{
    "cik": "1001601",
    "company": "MGT CAPITAL INVESTMENTS, INC.",
    "filing_type": "10-K",
    "filing_date": "2021-04-15",
    "period_of_report": "2020-12-31",
    "sic": "7374",
    "state_of_inc": "DE",
    "state_location": "NC",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1001601/0001493152-21-008913-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1001601/000149315221008913/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1001601/0001493152-21-008913.txt",
    "filename": "1001601_10K_2020_0001493152-21-008913.htm",
    "item_1": "Item 1. Business\nThe Company is a Delaware corporation that was incorporated in 2000. MGT was originally incorporated in Utah in 1977. MGT is comprised of the parent company and its wholly owned subsidiary MGT Sweden AB. MGT’s corporate office is in Raleigh, North Carolina.\nCryptocurrency Mining Business\nIndustry Summary\nBitcoin is a world-recognized cryptocurrency, which can be traded and converted into major fiat currencies on cryptocurrency exchanges. Cryptocurrencies are a medium of exchange that are transacted through and recorded on a decentralized distributed ledger system, called the “Blockchain.” The Blockchain is built by a chronological addition of transactions, which are grouped into blocks. Each new block requires a mathematical problem to be solved before it can be confirmed and added to the Blockchain. The processing power used to solve these mathematical problems is measured by Hash Rate or Hashes per second (“H/s”). The complexity of these problems, also referred to as mining difficulty, increases with the network’s growing Hash Rate.\nBitcoin mining entails solving these complex mathematical problems using custom designed and programmed application-specific integrated circuit (“ASIC”) computers (also referred to as “miners”). Bitcoin miners perform a vital function on the Bitcoin Blockchain network, by performing these calculations and adding transaction blocks to the Blockchain ledger. When a miner is successful in adding a block to the Blockchain, it is rewarded with a fixed number of Bitcoin; a miner can also be compensated by network transaction fees.\nAdditional information about Bitcoin, Blockchain and cryptocurrencies can be found on publicly available educational sources such as www.Bitcoin.org.\nOur Operations\nCryptocurrency mining\nFollowing a review of its Bitcoin mining operations in early 2019, we determined to consolidate our activities in a Company-owned and managed facility. Central to this strategy was the purchase of land in LaFayette, GA and the entry into a favorable contract for electricity in the second quarter of 2019. Located adjacent to a utility substation, the several acre property has access to over 20 megawatts (MW) of low-cost power.\nThe Company owned approximately 669 and 649 Antminer S17 Pro Bitcoin miners located in LaFayette, GA as of December 31, 2020 and April 15, 2021, respectively. All miners were purchased from Bitmaintech Pte. Ltd., a Singapore limited company (“Bitmain”), and are collectively rated at approximately 30 Ph/s in computing power. Bitmain has acknowledged manufacturing defects, combined with inadequate repair facilities, rendering approximately one half of our miners in need of repair or replacement. The Company’s miners are housed in three modified shipping containers. The Company’s current electrical load is estimated at under 1.0 MW. The entire facility, including the land, two 2500 KVA 3-phase transformers, the mining containers, and miners, are owned by MGT. As the Company is presently using only a portion of the built-out available electrical load, it is exploring ways to grow and maintain its current operations including but not limited to further equipment sales, leasing space to other Bitcoin miners, and raising capital to acquire newest generation miners.\nPrior to establishing our Company-owned and managed facility, we conducted our Bitcoin mining operations through third-party hosting arrangements. We also entered into management agreements with third party investors whereby the investors purchased the mining hardware, and we received both a fee to manage the mining operations plus one-half of the net operating profit. In March 2019, we entered into a settlement agreement to terminate our hosting agreement in Washington and conveyed ownership of its onsite mining assets for full satisfaction of $77 in outstanding hosting service fees. In August and September 2019, we terminated all our management agreements with third party investors, and in December 2019, we terminated our final remaining hosting arrangements in Colorado and Ohio.\nBitcoin And Blockchain Overview\nA Bitcoin is one type of a digital asset that is issued by, and transmitted through, an open source, math-based protocol platform using cryptographic security (the “Bitcoin Network”). The Bitcoin Network is an online, peer-to-peer user network that hosts the public Blockchain transaction ledger and the source code that comprises the basis for the cryptography and math-based protocols governing the Bitcoin Network. No single entity owns or operates the Bitcoin Network, the infrastructure of which is collectively maintained by a decentralized user base. Bitcoin can be used to pay for goods and services or can be converted to fiat currencies, such as the US Dollar, at rates determined on Bitcoin exchanges or in individual peer to peer end-user-to-end-user transactions.\nBitcoins are “stored” or reflected on the Blockchain in a decentralized manner on the computers of each Bitcoin Network user. The Blockchain records the transaction history of all Bitcoin in existence and, through the transparent reporting of transactions, allows the Bitcoin Network to verify the association of each Bitcoin with the digital wallet that owns it. The Bitcoin Network and Bitcoin software programs can interpret the Blockchain to determine the exact Bitcoin balance, if any, of any digital wallet listed in the Blockchain as having taken part in a transaction on the Bitcoin Network.\nThe Bitcoin Network, being decentralized, does not rely on either governmental authorities or financial institutions to create, transmit or determine the value of Bitcoin. Rather, Bitcoin are created and allocated by the Bitcoin Network protocol through a “mining” process subject to a strict, well-known issuance schedule. The value of Bitcoin is determined by the supply and demand of Bitcoin in the Bitcoin exchange market (and in private peer to peer transactions), as well as the number of merchants that accept it. As Bitcoin transactions can be broadcast to the Bitcoin Network by any user’s Bitcoin software and Bitcoin can be transferred without the involvement of intermediaries or third parties, there are only minor transaction costs in direct peer-to-peer transactions on the Bitcoin Network. Third party service providers such as Bitcoin exchanges and third party payment processing services may charge significant fees for processing transactions and for converting, or facilitating the conversion of, Bitcoin to or from fiat currency.\nMiners dedicate substantial resources to mining. Given the increasing difficulty of the target established by the Bitcoin Network, miners must continually invest in expensive mining hardware to achieve adequate processing power to hash at a competitive rate.\nBitcoin is an example of a digital asset that is not a fiat currency (i.e., a currency that is backed by a central bank or a national, supra-national or quasi-national organization) and are not backed by hard assets or other credit. As a result, the value of Bitcoin is determined by the value that various market participants place on Bitcoin through their transactions.\nThe supply of Bitcoin is finite. Once 21 million Bitcoin are generated, the network will stop producing more. Currently, there are approximately 19 million Bitcoin in circulation, or 90% of the total supply of Bitcoin. Within the Bitcoin protocol is an event referred to as Bitcoin halving (“Halving”) where the Bitcoin provided upon mining a block is reduced by 50%. Halvings are scheduled to occur once every 210,000 blocks, or roughly every four years, until the maximum supply of 21 million Bitcoin is reached. The most recent Halving occurred in May 2020, with a revised reward payout of 6.25 Bitcoin per block.\nGiven a stable hash rate, a Halving reduces the number of new Bitcoin being generated by the network. While the effect is to limit the supply of new coins, it has no impact on the quantity of total Bitcoin outstanding. As a result, the price of Bitcoin could rise or fall based on overall investor and consumer demand. Should the price of Bitcoin remain unchanged after the next Halving, the Company’s revenue would be reduced by 50%, with a much larger negative impact to profit.\nThe cryptocurrency markets have grown rapidly in both popularity and market size. These markets are local, national and international and include an ever-broadening range of products and participants. The United States Securities and Exchange Commission (the “SEC”), and other governmental agencies around the world, are evaluating the cryptocurrency markets and are likely to institute new rules and regulations within this market to protect investors and such regulations could result in the restriction of the acquisition, ownership, holding, selling, use or trading of our common stock.\nStrategy\nMGT’s strategy is to oversee the operation of its Bitcoin miners in La Fayette, Georgia. The Company’s immediate focus is to grow free cash flow, with a longer-term objective to expand its mining operation.\nCompetition\nOur industry is extremely new and subject to rapid change and constant innovation. We face significant competition, including from companies that have entered this space much earlier than us and are better capitalized, with vertically integrated business models. Some of these companies are our suppliers. We compete to attract, engage, and retain personnel, educated and skilled in the Blockchain and cryptocurrency mining space.\nWe compete with vertically integrated companies such as Bitfury Group Limited and Bitmain Technologies LTD that engage in both the design and distribution of mining machines, as well as cryptocurrency mining. We also compete with many other companies that are engaged in cryptocurrency mining, some of which may have lower operating costs or cost of capital than MGT.\nEmployees\nCurrently, the Company and its subsidiary have 2 full-time employees. None of our employees are represented by a union and we believe our relationships with our employees are good.\nAvailable Information\nMGT maintains a website at www.mgtci.com. The Company makes available free of charge our annual reports on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K, including any amendments to the foregoing reports, as soon as is reasonably practicable after such material is electronically filed with, or furnished to, the SEC. These materials along with our Code of Business Conduct and Ethics are also available through our corporate website at www.mgtci.com. A copy of this Annual Report is located at the SEC’s Public Reference Room at 100 F Street, NE, Washington, D.C. 20549. Information on the operation of the Public Reference Room can be obtained by calling the SEC at 1-800-SEC-0330. The public may also download these materials from the SEC’s website at http://www.sec.gov. Any amendments to, and waivers of, our Code of Business Conduct and Ethics will be posted on our corporate website. The Company is not including the information contained at mgtci.com as a part of this Annual Report.",
    "item_1A": "Item 1A. Risk Factors\nDiscussion of our business and operations included in this Annual Report should be read together with the risk factors set forth below. They describe various risks and uncertainties to which we are or may become subject. These risks and uncertainties, together with other factors described elsewhere in this report, have the potential to affect our business, financial condition, results of operations, cash flows, strategies or prospects in a material and adverse manner. New risks may emerge at any time, and we cannot predict those risks or estimate the extent to which they may affect our financial performance. Each of the risks described below could adversely impact the value of our securities. These statements, like all statements in this report, speak only as of the date of this Annual Report (unless another date is indicated), and we undertake no obligation to update or revise the statements in light of future developments.\nThe Company generates limited revenue from operations upon which an evaluation of our prospects can be made. The Company’s prospects must be considered keeping in mind the risks, expenses and difficulties frequently encountered in the establishment of a new business in a constantly changing industry. There can be no assurance that the Company will be able to achieve profitable operations in the foreseeable future, if at all.\nThe Company has identified several specific risk areas that may affect our operations and results in the future:\nRisks Related to Our Business\nWe have had limited commercial results and revenues, and we may be required to curtail operations if adequate funds are not available to us.\nOur commercial results have been limited. Historically, the Company has not generated significant revenues to fund its operations, and the Company cannot be certain that revenues will be sufficient to fund operations for the foreseeable future. The Company’s primary source of operating funds since inception has been debt and equity financings. The Company has also earned a limited amount of revenue through its Bitcoin operations. At December 31, 2020, MGT’s cash and cash equivalents were approximately $236.\nThe Company may raise additional capital, either through debt or equity financings, in order to achieve its business plan objectives. Management believes that it can be successful in obtaining additional capital; however, no assurance can be provided that the Company will be able to do so. There is no assurance, moreover, that any funds raised will be sufficient to enable the Company to attain profitable operations or continue as a going concern. To the extent that the Company is unsuccessful, the Company may need to curtail its operations and implement a plan to extend payables or reduce overhead until sufficient additional capital is raised to support further operations. The Company may also attempt to obtain funds through entering into arrangements with collaborative partners or others that may require the Company to relinquish rights to certain of our technologies or products that the Company would not otherwise relinquish. There can be no assurance that any such plan will be successful.\nThe Company’s consolidated financial statements have been prepared on a going concern basis, and do not include adjustments that might be necessary if the Company is unable to continue as a going concern.\nThe Company’s consolidated financial statements have been prepared on a going concern basis, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business. As of December 31, 2020, the Company had incurred significant operating losses since inception, and continues to generate losses from operations, and has an accumulated deficit of $418,389. These matters raise substantial doubt about the Company’s ability to continue as a going concern. The consolidated financial statements incorporated in this Annual Report do not include any adjustments relating to the recoverability and classification of asset amounts or the classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nThe further development and acceptance of Bitcoin and other cryptographic and algorithmic protocols governing the issuance of transactions in Bitcoin and other digital currencies, which represent a new and rapidly changing industry, are subject to a variety of factors that are difficult to evaluate. The slowing or stopping of the development or acceptance of Bitcoin may adversely affect our results of operations.\nThe use of digital currencies such as Bitcoin to, among other things, buy and sell goods and services, and the acquisition of digital currencies as an investment, is part of a new and rapidly evolving industry that employs digital assets based upon a computer-generated mathematical and/or cryptographic protocol. Bitcoin is a prominent, but not a unique part of this industry. The growth of this industry in general, and Bitcoin in particular, is subject to a high degree of uncertainty. The factors affecting the further development of this industry, include, but are not limited to:\n● continued worldwide growth in the adoption and use of Bitcoin and other digital currencies;\n● government and quasi-government regulation of Bitcoin and other digital assets and their use, or restrictions on or regulation of access to and operation of the Bitcoin network or similar digital asset systems;\n● changes in consumer demographics and public tastes and preferences;\n● the maintenance and development of the open-source software protocol of the Bitcoin network;\n● the availability and popularity of other forms or methods of buying and selling goods and services, including new means of using fiat currencies;\n● general economic conditions and the regulatory environment relating to digital assets; and\n● negative consumer perception of Bitcoin specifically and cryptocurrencies generally.\nA decline in the popularity or acceptance of Bitcoin may adversely affect our results of operations.\nThe supply of Bitcoin is limited, and production of Bitcoin is negatively impacted by the Bitcoin halving protocol expected every four years.\nThe supply of Bitcoin is finite. Once 21 million Bitcoin are generated, the network will stop producing more. Currently, there are approximately 19 million Bitcoin in circulation, or 90% of the total supply of Bitcoin. Within the Bitcoin protocol is an event referred to as Halving where the Bitcoin reward provided upon mining a block is reduced by 50%. Halvings are scheduled to occur once every 210,000 blocks, or roughly every four years, with the latest Halving having occurred in May 2020, with a revised payout of 6.25 Bitcoin per block.\nGiven a stable hash rate, a Halving reduces the number of new Bitcoin being generated by the network. While the effect is to limit the supply of new coins, it has no impact on the quantity of total Bitcoin outstanding. As a result, the price of Bitcoin could rise or fall based on overall investor and consumer demand. Should the price of Bitcoin remain unchanged after the next Halving, the Company’s revenue would be reduced by 50%, with a much larger impact to profit.\nCurrently, there is relatively small use of Bitcoin in the retail and commercial marketplace in comparison to relatively large use by speculators, thus contributing to price volatility that could adversely affect our results of operations.\nBitcoin has only recently become accepted as a means of payment for goods and services by certain major retail and commercial outlets, and use of Bitcoin by consumers to pay such retail and commercial outlets remains limited. Conversely, a significant portion of Bitcoin demand is generated by speculators and investors seeking to profit from the short- or long-term holding of Bitcoin. Many industry commentators believe that Bitcoin’s best use case is as a store of wealth, rather than as a currency for transactions, and that other cryptocurrencies having better scalability and faster settlement times will better serve as currency. This could limit Bitcoin’s acceptance as transactional currency. A lack of expansion by Bitcoin into retail and commercial markets, or a contraction of such use, may result in increased volatility or a reduction in the Bitcoin price, either of which could adversely affect our results of operations.\nSecurity threats could result in the halting of our operations and a loss of assets or damage to our reputation, each of which could have a material adverse effect on our business.\nSecurity breaches, computer malware and computer hacking attacks have been a prevalent concern in the Blockchain industry. Any security breach caused by hacking, which involves efforts to gain unauthorized access to information or systems, or to cause intentional malfunctions or loss or corruption of data, software, hardware or other computer equipment, and the inadvertent transmission of computer viruses, could harm our business operations or result in loss of our assets. Any breach of our infrastructure could result in damage to our reputation.\nAny Bitcoin we mine may be subject to loss, damage, theft or restriction on access.\nThere is a risk that some or all of the Bitcoin we mine could be lost, stolen or destroyed. Although we will seek to use various technology to minimize the risk of loss, damage and theft, we cannot guarantee the prevention of such loss, damage or theft, whether caused intentionally, accidentally or by an act of God. Access to our Bitcoin could also be restricted by natural events (such as an earthquake or flood) or human actions (such as a terrorist attack). Any of these events may adversely affect our operations. In addition, government regulations in the United States and abroad could materially alter the landscape for Bitcoin and other cryptocurrencies use and accessibility, including through tax regulations, restrictions on use in transactions and regulation or prohibition of cryptocurrency exchanges.\nIf we do not keep pace with technological changes, our solutions may become less competitive and our business may suffer.\nThe market for Bitcoin technology is characterized by rapid technological change, frequent product and service innovation and evolving industry standards. We may need to continuously modify and enhance our solutions to keep pace with changes in internet-related hardware, software, communication, browser and database technologies. We may not be successful in either developing these modifications and enhancements. Furthermore, uncertainties about the timing and nature of new network platforms or technologies, or modifications to existing platforms or technologies, could increase our research and development expenses. Any failure of our solutions to keep pace with technological changes or operate effectively with future network platforms and technologies could adversely affect our business.\nAdverse economic conditions or reduced technology spending may adversely impact our business.\nOur business depends on the overall demand for technology and on the economic health of our prospective customers. In general, worldwide economic conditions remain unstable, and these conditions may make it difficult for our prospective customers and us to forecast and plan future business activities accurately. Weak global economic conditions, or a reduction in technology spending even if economic conditions improve, could adversely impact our business, financial condition and results of operations in a number of ways, including longer sales cycles, lower prices for our solutions, reduced bookings and lower or no growth.\nOur ability to attract, train and retain qualified employees is crucial to our results of operations and any future growth.\nTo execute our growth plan, we must attract and retain highly qualified personnel. Competition for these individuals is intense, especially for engineers with high levels of experience in designing and developing software and internet-related services, and professional services personnel with appropriate financial reporting experience. We have, from time to time, experienced, and we expect to continue to experience, difficulty in hiring and retaining employees with appropriate qualifications. Many of the companies with which we compete for experienced personnel have greater resources than we have. If we hire employees from competitors or other companies, their former employers may attempt to assert that these employees have breached their legal obligations or that we have induced such breaches, resulting in a diversion of our time and resources. If we fail to attract new personnel or fail to retain and motivate our current personnel, our business and future growth prospects could be adversely affected.\nRegulatory changes or actions may alter the nature of an investment in the Company or restrict the use of cryptocurrencies in a manner that adversely affects the Company’s business, prospects or operations.\nGovernments around the world have reacted differently to cryptocurrencies, with certain governments deeming them illegal while others have allowed their use and trade. On-going and future regulatory actions may impact the ability of the Company to continue to operate and such actions could affect the ability of the Company to continue as a going concern or to pursue this segment at all, which could have a material adverse effect on the business, prospects or operations of the Company.\nThe effect of any future regulatory change on the Company or any cryptocurrency that the Company may mine or hold for others is impossible to predict, and such change could have a material adverse effect on the ability of the Company to continue as a going concern or to pursue this segment at all, which would have a material adverse effect on the business, prospects or operations of the Company.\nGovernments may in the future curtail or outlaw the acquisition, use or redemption of cryptocurrencies. Ownership of, holding or trading in cryptocurrencies may then be considered illegal and subject to sanction. Governments may also take regulatory action that may increase the cost and/or subject cryptocurrency companies to additional regulation.\nOn July 25, 2017, the SEC released an investigative report which states that the United States would, in some circumstances, consider the offer and sale of Blockchain tokens pursuant to an initial coin offering (“ICO”) subject to federal securities laws. Although the Company does not participate in ICOs, its clients and customers may participate in ICOs and these actions may be a prelude to further action which chills widespread acceptance of Blockchain and cryptocurrency adoption and have a material adverse effect on the ability of the Company to continue as a going concern or to pursue this segment at all, which would have a material adverse effect on the business, prospects or operations of the Company.\nFurther, the Peoples Bank of China has instituted restrictions on certain exchange trading in cryptocurrencies and ICOs. Further governmental regulation in that country or others could negatively impact pricing for Bitcoin. In addition, the Company’s sole source of mining computers is a Chinese company, and we are exposed to existing tariffs for certain equipment used in our operations. If outright restrictions or even more punitive tariffs are placed on the export of such computers, it could have a material adverse effect on the ability of the Company to continue as a going concern or to pursue this segment at all, which would have a material adverse effect on the business, prospects or operations of the Company.\nGovernments may in the future take regulatory actions that prohibit or severely restrict the right to acquire, own, hold, sell, use or trade cryptocurrencies or to exchange cryptocurrencies for fiat currency. Similar actions by governments or regulatory bodies (such as an exchange on which the Company’s securities are listed, quoted or traded) could result in restrictions of the acquisition, ownership, holding, selling, use or trading in the Company’s securities. Such a restriction could result in the Company liquidating its inventory at unfavorable prices and may adversely affect the Company’s shareholders and have a material adverse effect on the ability of the Company to continue as a going concern or to pursue this segment at all, raise new capital or maintain a securities listing with an exchange which could have a material adverse effect on the business, prospects or operations of the Company and harm investors in the Company’s securities.\nTerrorist actions and attacks may have a negative impact on economic conditions and market liquidity.\nThere is a risk of terrorist attacks on the United States and elsewhere causing significant loss of life and property damage and disruptions in the global market. Economic and diplomatic sanctions may be in place or imposed on certain states and military action may be commenced. The impact of such events is unclear, but could have a material effect on general economic conditions and market liquidity.\nThe real estate assets we own subject to the risks associated with real property.\nReal estate assets are subject to various risks, including:\n● declines in the value of real estate;\n● acts of nature, including earthquakes, floods and other natural disasters, which may result in uninsured losses;\n● adverse changes in national and local economic and market conditions;\n● changes in governmental laws and regulations, fiscal policies and zoning ordinances and the related costs of compliance with laws and regulations, fiscal policies and ordinances;\n● costs of remediation and liabilities associated with environmental conditions such as indoor mold; and\n● the potential for uninsured or under-insured property losses.\nThe occurrence of any of the foregoing or similar events may reduce the value of our property, impair our ability to conduct our mining operations and, consequently, materially adversely affect our business, financial condition and results of operations.\nWe face possible risks associated with the renewal of our contract for electricity.\nIn June 2019, the Company entered into a contract for electric power with the City of Lafayette, Georgia, a municipal corporation of the State of Georgia (“the City”). The Company makes monthly payments based upon electricity consumed, at a negotiated kilowatt per hour rate, inclusive of transmission charges and exclusive of state and local sales taxes. This agreement expires on September 30, 2021, and the Company will shortly begin negotiations for an extension or new contract. There can be no assurance that the Company and City will reach agreement with acceptable price and volume metrics, if at all.\nWe face possible risks associated with the physical effects of climate change.\nThe physical effects of climate change could have a material adverse effect on our properties, operations, and business. However, the impacts of climate change on our operations are highly uncertain and their significance will vary depending on the type and geographic location of any physical impact. The impacts of climate change could include changing temperatures, flooding, water shortages, changes in weather and rainfall patterns, and changing storm patterns and intensities. To the extent that climate change impacts changes in weather patterns, some of our properties could experience increases in storm intensity, loss of power, and rising sea levels. Climate change may also have indirect effects on our business by increasing the cost of, or availability of, property insurance on terms we find acceptable or increasing the cost of energy. There can be no assurance that climate change will not have a material adverse effect on our properties, operations, or business.\nOur business is subject to risks arising from epidemic diseases, such as the recent outbreak of the COVID-19 illness.\nThe recent outbreak of COVID-19, which has been declared by the World Health Organization to be a pandemic, has spread across the globe and is impacting worldwide economic activity. A pandemic, including COVID-19, or other public health epidemic poses the risk that we or our employees, suppliers, and other partners may be prevented from conducting business activities at full capacity for an indefinite period of time, including due to spread of the disease within these groups or due to shutdowns that may be requested or mandated by governmental authorities. While it is not possible at this time to estimate the impact that COVID-19 could have on our business, the continued spread of COVID-19 and the measures taken by the governments of countries affected and in which we operate could disrupt the operation of our business. The COVID-19 outbreak and mitigation measures may also have an adverse impact on global economic conditions, which could have an adverse effect on our business and financial condition, including on our potential to conduct financings on terms acceptable to us, if at all. In addition, we may take temporary precautionary measures intended to help minimize the risk of the virus to our employees, including temporarily requiring all employees to work remotely, and discouraging employee attendance at in-person work-related meetings, which could negatively affect our business. The extent to which the COVID-19 outbreak impacts our results will depend on future developments that are highly uncertain and cannot be predicted, including new information that may emerge concerning the severity of the virus and the actions to contain its impact.\nReliance on third parties to operate our mining machines may cause delays in production and mining and could have an impact on our business, financial condition and prospects.\nThe Company relies on third parties to operate its Bitcoin mining machinery. These third parties are not our employees and, except for restrictions imposed by our contracts with such third parties, we have limited ability to control the amount or timing of resources that they devote to our programs. Although we rely on these third parties to operate our mining machinery, we remain responsible for the overall mining operations. Many of the third parties with whom we contract may also have relationships with other commercial entities, some of which may compete with us. If the third parties operating our machinery do not perform their contractual duties or obligations, we may need to enter into new arrangements with alternative third parties. This could be costly, and mining operations may be delayed or terminated. If any of our relationships with these third parties terminate, we may not be able to enter into arrangements with alternative third party contractors or to do so on commercially reasonable terms. Though we carefully manage our relationships with our contract machinery operators, there can be no assurance that we will not encounter similar challenges or delays in the future or that these delays or challenges will not have a material adverse impact on our business, financial condition and prospects.\nThe Company’s reliance on a third-party mining pool service provider, such as Slush Pool or PoolIn, for our mining revenue payouts may have a negative impact on the Company operations.\nWe use a third-party mining pool to receive our mining rewards from the network. Bitcoin mining pools allow miners to combine their computing power, increasing their chances of solving a block and getting paid by the network. The rewards are distributed by the pool operator, proportionally to our contribution to the pool’s overall mining power used to generate each block. Should the pool operator’s system suffer downtime due to a cyber-attack, software malfunction or other similar issues, it will negatively impact our ability to mine and receive revenue.\nBanks and financial institutions may not provide banking services, or may cut off services, to businesses that provide cryptocurrency-related services or that accept cryptocurrencies as payment, including financial institutions of investors in the Company’s securities.\nA number of companies that provide Bitcoin and/or other cryptocurrency-related services have been unable to find banks or financial institutions that are willing to provide them with bank accounts and other services. Similarly, a number of companies and individuals or businesses associated with cryptocurrencies may have had and may continue to have their existing bank accounts closed or services discontinued with financial institutions. We also may be unable to obtain or maintain these services for our business. The difficulty that many businesses that provide Bitcoin and/or other cryptocurrency-related services have and may continue to have in finding banks and financial institutions willing to provide them services may be decreasing the usefulness of cryptocurrencies as a payment system and harming public perception of cryptocurrencies and could decrease its usefulness and harm its public perception in the future. Similarly, the usefulness of cryptocurrencies as a payment system and the public perception of cryptocurrencies could be damaged if banks or financial institutions were to close the accounts of businesses providing Bitcoin and/or other cryptocurrency-related services. This could occur as a result of compliance risk, cost, government regulation or public pressure. The risk applies to securities firms, clearance and settlement firms, national stock and commodities exchanges, the over the counter market and the Depository Trust Company, which, if any of such entities adopts or implements similar policies, rules or regulations, could result in the inability of our investors to open or maintain stock or commodities accounts, including the ability to deposit, maintain or trade the Company’s securities. Such factors would have a material adverse effect on the ability of the Company to continue as a going concern or to pursue this segment at all, which could have a material adverse effect on the business, prospects or operations of the Company and harm investors.\nTo the extent that the profit margins of Bitcoin mining operations are not high, operators of Bitcoin mining operations are more likely to immediately sell Bitcoin earned by mining in the market, resulting in a reduction in the price of Bitcoin that could adversely impact the Company and similar actions could affect other cryptocurrencies.\nOver the past several years, Bitcoin mining operations have evolved from individual users mining with computer processors, graphics processing units and first-generation ASIC servers. Currently, new processing power is predominantly added by incorporated and unincorporated “professionalized” mining operations. Professionalized mining operations may use proprietary hardware or sophisticated ASIC machines acquired from ASIC manufacturers. These operations require the investment of significant capital for the acquisition of this hardware, the leasing of operating space (often in data centers or warehousing facilities), incurring of electricity costs and the employment of technicians to operate the mining farms. As a result, professionalized mining operations are of a greater scale than prior miners and have more defined, regular expenses and liabilities. These regular expenses and liabilities require professionalized mining operations to more immediately sell Bitcoin earned from mining operations, whereas it is believed that individual miners in past years were more likely to hold newly mined Bitcoin for more extended periods. The immediate selling of newly mined Bitcoin may create downward pressure on the price of Bitcoin.\nThe extent to which the value of Bitcoin mined by a professionalized mining operation exceeds the allocable capital and operating costs determines the profit margin of such operation. A professionalized mining operation may be more likely to sell a higher percentage of its newly mined Bitcoin rapidly if it is operating at a low profit margin-and it may partially or completely cease operations if its profit margin is negative. In a low profit margin environment, a higher percentage of mined Bitcoin could be sold more rapidly, thereby potentially reducing Bitcoin prices. Lower Bitcoin prices could result in further tightening of profit margins, particularly for professionalized mining operations with higher costs and more limited capital reserves, creating a network effect that may further reduce the price of Bitcoin until mining operations with higher operating costs become unprofitable and remove mining power. The network effect of reduced profit margins resulting in greater sales of newly mined Bitcoin could result in a reduction in the price of Bitcoin that would adversely impact the Company.\nThe foregoing risks associated with Bitcoin could be equally applicable to other cryptocurrencies, existing now or introduced in the future. Such circumstances would have a material adverse effect on the ability of the Company to continue as a going concern or to pursue this segment at all, which could have a material adverse effect on the business, prospects or operations of the Company and potentially the value of any cryptocurrencies the Company holds or expects to acquire for its own account.\nPolitical or economic crises may motivate large-scale sales of Bitcoin or other cryptocurrencies, which could result in a reduction in value and adversely affect the Company.\nAs an alternative to fiat currencies that are backed by central governments, digital assets such as Bitcoin and Ethereum, which are relatively new, are subject to supply and demand forces based upon the desirability of an alternative, decentralized means of buying and selling goods and services, and it is unclear how such supply and demand will be impacted by geopolitical events. Nevertheless, political or economic crises may motivate large-scale acquisitions or sales of Bitcoin and other cryptocurrencies either globally or locally. Large-scale sales of Bitcoin or other cryptocurrencies would result in a reduction in their value and would adversely affect the Company. Such circumstances could have a material adverse effect on the ability of the Company to continue as a going concern or to pursue this segment at all, which would have a material adverse effect on the business, prospects or operations of the Company and potentially the value of any cryptocurrencies the Company holds or expects to acquire for its own account.\nIt may be illegal now, or in the future, to acquire, own, hold, sell or use Bitcoin, Ethereum, or other cryptocurrencies, participate in the Blockchain or utilize similar digital assets in one or more countries, the ruling of which could adversely affect the Company.\nAlthough currently Bitcoin and other cryptocurrencies, the Blockchain and digital assets generally are not regulated or are lightly regulated in most countries, including the United States, one or more countries such as China and Russia may take regulatory actions in the future that could severely restrict the right to acquire, own, hold, sell or use these digital assets or to exchange for fiat currency. Such restrictions may adversely affect the Company. Such circumstances could have a material adverse effect on the ability of the Company to continue as a going concern or to pursue this segment at all, which could have a material adverse effect on the business, prospects or operations of the Company and potentially the value of any cryptocurrencies the Company holds or expects to acquire for its own account and harm investors.\nIf regulatory changes or interpretations require the regulation of Bitcoin or other digital assets under the securities laws of the United States or elsewhere, including the Securities Act of 1933, the Securities Exchange Act of 1934 (the “Exchange Act”) and the Investment Company Act of 1940 or similar laws of other jurisdictions and interpretations by the SEC, the Commodity Futures Trading Commission (the “CFTC”), the Internal Revenue Service (“IRS”), Department of Treasury or other agencies or authorities, the Company may be required to register and comply with such regulations, including at a state or local level. To the extent that the Company decides to continue operations, the required registrations and regulatory compliance steps may result in extraordinary expense or burdens to the Company. The Company may also decide to cease certain operations. Any disruption of the Company’s operations in response to the changed regulatory circumstances may be at a time that is disadvantageous to the Company.\nCurrent and future legislation and SEC rulemaking and other regulatory developments, including interpretations released by a regulatory authority, may impact the manner in which Bitcoin or other cryptocurrency is viewed or treated for classification and clearing purposes. In particular, Bitcoin and other cryptocurrency may not be excluded from the definition of “security” by SEC rulemaking or interpretation requiring registration of all transactions, unless another exemption is available, including transacting in Bitcoin or cryptocurrency amongst owners and require registration of trading platforms as exchanges. The Company cannot be certain as to how future regulatory developments will impact the treatment of Bitcoin and other cryptocurrencies under the law. If the Company fails to comply with such additional regulatory and registration requirements, the Company may seek to cease certain of its operations or be subjected to fines, penalties and other governmental action. Such circumstances could have a material adverse effect on the ability of the Company to continue as a going concern or to pursue this segment at all, which could have a material adverse effect on the business, prospects or operations of the Company and potentially the value of any cryptocurrencies the Company holds or expects to acquire for its own account and harm investors.\nDemand for Bitcoin is driven, in part, by its status as the most prominent and secure digital asset. It is possible that a digital asset other than Bitcoin could have features that make it more desirable to a material portion of the digital asset user base, resulting in a reduction in demand for Bitcoins.\nBitcoin holds a “first-to-market” advantage over other digital currencies. This first-to-market advantage is driven in large part by having the largest user base and, more importantly, the largest combined mining power in use. Having a large mining network results in greater user confidence regarding the security and long-term stability of a digital asset’s network and its Blockchain; as a result, the advantage of more users and miners makes a digital asset more secure, which makes it more attractive to new users and miners, resulting in a network effect that strengthens the first-to-market advantage. Nonetheless, it is possible that another form of digital currency could become materially popular due to either a perceived or exposed shortcoming of the Bitcoin network or a perceived advantage of another form of digital currency. If another form of digital currency obtains significant market share, this could reduce the profitability of our Bitcoin operations.\nBecause the number of Bitcoin awarded for solving a block in the Bitcoin network Blockchain continually decreases, miners must invest in increasing processing power to maintain their yield of Bitcoins, which might make Bitcoin mining uneconomical for the Company.\nThe award of new Bitcoin for solving blocks continually declines, so that Bitcoin miners must invest in increasing processing power in order to maintain or increase their yield of Bitcoin. The Company is committed to increasing its investment in its Bitcoin mining operations, but if the pricing of Bitcoin were to decline significantly, there can be no assurance that the Company would be able to recover its investment in the computer hardware and processing power required to upgrade its mining operations. There can, moreover, be no assurance that the Company will have the resources to upgrade its processing power in order to maintain the continuing profitability of its Bitcoin mining operations. Also, the developers of the Bitcoin network or other programmers could propose amendments to the network’s protocols and software that, if accepted, might require the Company to modify its Bitcoin operations, and increase its investment in Bitcoin, in order to maintain profitability. There can be no assurance, however, that the Company will be able to do so.\nThe Company continues to have discussions with potential investors to purchase more Bitcoin mining machines, but we cannot assure you that we will be successful in obtaining the necessary financing.\nThe Company is considering further increasing the processing power of its Bitcoin mining operations, as the Company seeks to leverage its experience and expertise in this area of operations. To do so, however, the Company will need to raise additional investment capital. While we are in discussions with potential investors to provide the necessary capital to purchase additional Bitcoin mining machines, we cannot assure you that these discussions will lead to our obtaining additional capital or that we will otherwise be successful in obtaining the necessary financing to expand our Bitcoin operations. If we are successful in raising capital to expand our Bitcoin operations, the form in which the capital is invested could be different from the way we have traditionally structured capital investments in the Company. For example, funds could be invested through a joint venture or similar arrangement, in which the Company does not have the entire equity ownership interest.\nThe SEC has filed an action against the Company’s Chief Executive Officer alleging violations of federal securities laws which could result in liabilities for the Company.\nOn September 7, 2018, the SEC commenced a legal action, SEC v. Barry C. Honig et al. (the “SEC Action”), in the United States District Court for the Southern District of New York naming as defendant Mr. Ladd, among others. An amended complaint in the SEC Action was filed on March 8, 2019. On May 24, 2019, the SEC issued a subpoena in the SEC Action to the Company and on October 31, 2019, the SEC issued subpoenas in the SEC Action to our Chairman and our Independent Director. The SEC filed a second amended complaint in the SEC Action on March 16, 2020 asserting additional civil charges against Robert Ladd. The SEC Action asserts civil charges against multiple individuals and entities, including former shareholders of the Company, who are alleged to have violated the securities laws by engaging in pump and dump schemes in connection with certain microcap stocks and three unidentified companies. The Company is one of the three unidentified companies but is not named as a defendant. We cannot predict the impact that this action may have on the Company, or whether it might result in future actions, penalties or other liabilities against the Company. Moreover, we expect to incur costs in responding to related requests for information and subpoenas, and if instituted, in defending against any resulting governmental proceedings that may be instituted against the Company.\nThe Company and its directors and officer have received subpoenas from the SEC, which is imposing costs on the Company and creating a perception of wrongdoing.\nAt various times since September 15, 2016, and most recently in October 2019, the Company and its then officers and directors received subpoenas from the SEC requesting information, including but not limited to, with respect to risk factors contained in certain of the Company’s filings with the SEC. On October 21, 2020, the SEC notified the Company this investigation concluded, and it does not intend to recommend an enforcement action by the Commission against MGT in this matter. This notice was sent pursuant to guidelines set out in Securities Acts Release 5310, which states in part that the notice “must in no way be construed as indicating that the party has been exonerated or that no action may ultimately result from the Staff’s investigation.” Response to subpoenas entail, and may continue to entail, legal costs and the diversion of management’s attention, and the issuance of the subpoenas may create a perception of wrongdoing that could be harmful to our business.\nA number of shareholder class actions and shareholder derivative actions were filed against the Company and its CEO alleging violations of federal securities laws imposing costs on the Company and creating a perception of wrongdoing.\nCertain shareholders of the Company filed class action and derivative lawsuits against the Company and its directors, alleging violations of federal securities laws and seeking damages. These legal actions followed and referenced allegations made against Mr. Ladd and others in a complaint filed by the SEC in the SEC Action. All these legal actions have been settled pursuant to Court-approved agreements, however, there can be no assurance that other shareholders will not bring other shareholder class actions or derivative lawsuits alleging different violations of law. Responses to lawsuits entail, and may continue to entail, legal costs and the diversion of management’s attention, and the filing of lawsuits may create a perception of wrongdoing that could be harmful to our business.\nThe SEC’s actions against the Company’s CEO could result in the loss of his services or otherwise divert his attention from the management of the Company.\nMr. Ladd is a director of the Company and has served as the Chief Executive Officer of the Company since January 2012 (except for the periods from November 2016 through August 2017 and September 10, 2018 through April 30, 2019). During this time, he has been largely responsible for the Company’s strategic direction and has been influential in all major policy decisions of the Company. As described above, the SEC has filed a lawsuit against Mr. Ladd, alleging violations of securities laws. In addition to injunctive relief and monetary penalties, the complaint seeks an officer and director bar with respect to Mr. Ladd, which if obtained by the SEC would prevent him from continuing to serve in such capacities with the Company. While the Company has no reason to believe that Mr. Ladd has failed to comply with applicable securities law in respect of the Company, the outcome of this litigation is uncertain. In the event Mr. Ladd is prevented from serving as an executive officer and/or director of the Company, the Company’s business, operations and strategic direction may be adversely impacted. Also, the SEC Action may divert Mr. Ladd’s attention from the management of the Company and has resulted in an increase in our director and officer insurance costs.\nThe Company’s directors and officers insurance policies have been exhausted and will cause the Company to increase spending on legal expenses.\nUnder its bylaws and certain indemnification agreements, the Company has obligations to indemnify current and former officers and directors and certain current and former employees. Based on cumulative legal fees and settlements incurred, the Company has fully exhausted its directors and officers insurance coverage. Additional expenses currently expected to be incurred and that may occur in the future, or liabilities that may be imposed in connection with actions against certain of the Company’s past and present directors and officers and certain current and former employees who are entitled to indemnification will be funded by the Company with its existing cash resources. Such expenses could have a material impact on the Company’s financial condition, results of operations and cash flows.\nThe SEC charges against the Company’s CEO has created a perception of wrongdoing, and has impacted the Company’s ability to raise capital and attract investors to the Company.\nThe SEC Action has created a public perception of wrongdoing. The perception of wrongdoing has caused current investors to restrict trading in the Company’s common stock, and may cause potential investors to forego investment in the Company’s common stock, thereby reducing the Company’s ability to raise capital and finance its operations. Most brokerage firms, overseen by the Financial Industry Regulatory Authority (known as “FINRA”), will not accept deposits of our stock by potential investors. Further, FINRA will not permit a company in which an executive is being investigated by the SEC to effect certain corporate actions such as a reverse stock split, even if approved by directors and stockholders. Continued perception of wrongdoing could have a material impact on the Company’s financial condition, results of operations and cash flows.\nRisks Related to Our Stock\nPenny stock regulations may impose certain restrictions on marketability of our securities.\nThe SEC has adopted regulations which generally define a “penny stock” to be any equity security that has a market price of less than $5.00 per share or an exercise price of less than $5.00 per share, subject to certain exceptions. A security listed on a national securities exchange is exempt from the definition of a penny stock. Our common stock is not currently listed on a national security exchange. Our common stock is therefore subject to rules that impose additional sales practice requirements on broker-dealers who sell such securities to persons other than established customers and accredited investors (generally those with assets in excess of $1,000 or annual income exceeding $200, or $300 together with their spouse). For transactions covered by such rules, the broker-dealer must make a special suitability determination for the purchase of such securities and have received the purchaser’s written consent to the transaction prior to the purchase.\nAdditionally, for any transaction involving a penny stock, unless exempt, the rules require the delivery, prior to the transaction, of a risk disclosure document mandated by the SEC relating to the penny stock market. The broker-dealer must also disclose the commission payable to both the broker-dealer and the registered representative, current quotations for the securities and, if the broker-dealer is the sole market maker, the broker dealer must disclose this fact and the broker-dealer’s presumed control over the market. Finally, monthly statements must be sent disclosing recent price information for the penny stock held in the account and information on the limited market in penny stocks. Broker-dealers must wait two business days after providing buyers with disclosure materials regarding a security before effecting a transaction in such security. Consequently, the “penny stock” rules restrict the ability of broker-dealers to sell our securities and affect the ability of investors to sell our securities in the secondary market and the price at which such purchasers can sell any such securities, thereby affecting the liquidity of the market for our common stock.\nStockholders should also be aware that, according to the SEC, the market for penny stocks has suffered in recent years from patterns of fraud and abuse. Such patterns include:\n● control of the market for the security by one or more broker-dealers that are often related to the promoter or issuer;\n● manipulation of prices through prearranged matching of purchases and sales and false and misleading press releases;\n● “boiler room” practices involving high pressure sales tactics and unrealistic price projections by inexperienced salespersons;\n● excessive and undisclosed bid-ask differentials and markups by selling broker-dealers; and\n● the wholesale dumping of the same securities by promoters and broker-dealers after prices have been manipulated to a desired level, along with the inevitable collapse of those prices with consequent investor losses.\nOur stock price and trading volume may be volatile, which could result in losses for our stockholders.\nThe equity markets may experience periods of volatility, which could result in highly variable and unpredictable pricing of equity securities. The market price of our common stock could change in ways that may or may not be related to our business, our industry or our operating performance and financial condition and could negatively affect our share price or result in fluctuations in the price or trading volume of our common stock. We cannot predict the potential impact of these periods of volatility on the price of our common stock. The Company cannot assure you that the market price of our common stock will not fluctuate or decline significantly in the future.\nIf securities or industry analysts do not publish research or reports about our business, or if they publish inaccurate or unfavorable research reports about our business, our share price and trading volume could decline.\nThe trading market for our common stock will, to some extent, depend on the research and reports that securities or industry analysts publish about us or our business. We do not have any control over these analysts. If one or more of the analysts who cover us should downgrade our shares or change their opinion of our business prospects, our share price would likely decline. If one or more of these analysts ceases coverage of our Company or fails to regularly publish reports on us, we could lose visibility in the financial markets, which could cause our share price and volume to decline.\nFuture sales and issuances of our equity securities or rights to purchase our equity securities, including pursuant to equity incentive plans, would result in additional dilution of the percentage ownership of our stockholders and could cause our stock price to fall.\nTo the extent we raise additional capital by issuing equity securities through convertible notes or otherwise, our stockholders may experience substantial dilution. We may, as we have in the past, sell common stock, rights, warrants, options or convertible securities or other equity securities in one or more transactions at prices and in a manner we determine from time to time. If we sell common stock, rights, warrants, options or convertible securities or other equity securities in more than one transaction, investors may be further diluted by subsequent sales. Such sales may also result in material dilution to our existing stockholders, and new investors could gain rights superior to existing stockholders. Because we are quoted on the OTCQB instead of a national securities exchange or quotation system, our investors may experience significant volatility in the market price of our stock and have difficulty selling their shares.\nOur common stock is currently quoted on the OTC Market Group’s OTCQB market quotation system under the ticker symbol “MGTI.” The OTCQB is a regulated quotation services that displays real-time quotes and last sale prices in over-the-counter securities. Trading in shares quoted on the OTCQB is often thin and characterized by volatility in trading prices. This volatility may be caused by a variety of factors, including the lack of readily available price quotations, the absence of consistent administrative supervision of bid and ask quotations, lower trading volume and market conditions. As a result, there may be wide fluctuations in the market price of the shares of our common stock for reasons unrelated to operating performance, and this volatility, when it occurs, may have a negative effect on the market price for our securities. Moreover, the OTCQB is not a stock exchange, and trading of securities on this platform is more sporadic than the trading of securities listed on a national quotation system or stock exchange. Accordingly, our stockholders may not be able to realize a fair price from their shares when they determine to sell them or may have to hold them for a substantial period of time until the market for our common stock improves.\nA significant number of additional shares of our common stock may be issued at a later date, and their sale could depress the market price of our common stock.\nAs of April 15, 2021, we have an unknown, but substantial, amount of our common stock issuable upon conversion of outstanding notes. These convertible notes allow the holder to convert the principal amount of the note into the Company’s common stock at 70% of the lowest trading price of the common stock for the 10 days prior to the conversion date. The possibility of the issuance of all or some of the shares could substantially reduce the market price for our common stock.\nOffers or availability for sale of a substantial number of shares of our common stock may cause the price of our common stock to decline.\nIf our stockholders sell substantial amounts of our common stock in the public market, including upon the expiration of any statutory holding period under Rule 144 under the Securities Act of 1933, as amended, or registration for resale, or the conversion of preferred stock or exercise of warrants, circumstances commonly referred to as an “overhang” could result, in anticipation of which the market price of our common stock could fall. The existence of an overhang, whether or not sales have occurred or are occurring, could also make more difficult our ability to raise additional financing through the sale of equity or equity-related securities in the future at a time and price that we deem reasonable or appropriate.\nThe price of our common stock has fluctuated considerably and is likely to remain volatile, in part due to the limited market for our common stock, and you could lose all or part of your investment.\nThere is a limited public market for our common stock, and we cannot provide assurances that a more active trading market will develop or continue. As a result of low trading volume in our common stock, the purchase or sale of a relatively small number of shares could result in significant share price fluctuations. Additionally, the market price of our common stock may continue to fluctuate significantly in response to a number of factors, some of which are beyond our control.\nMoreover, several brokerage firms restrict opening purchases of our common stock, allowing only closing trades to sell out a position. Such activities limit the addressable market for our common stock.\nFor these reasons and others, an investment in our securities is risky and you should invest only if you can withstand a total loss of, and wide fluctuations in, the value of your investment.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNot applicable.",
    "item_2": "Item 2. Properties\nOur principal corporate office is located at 150 Fayetteville Street, Suite 1110 Raleigh, NC 27601, occupied under a lease that expires January 2023. Monthly rent is $3 until expiration of the lease. A security deposit of $3 was required upon execution of the lease. We believe our office is in good condition and is sufficient to conduct our operations.\nWe have constructed our own Bitcoin mining facility on 6 acres in LaFayette, GA which we acquired in May 2019. We believe our mining facility is in good condition and is sufficient to conduct our operations.",
    "item_3": "Item 3. Legal Proceedings\nThe Company has resolved all shareholder legal actions formerly pending in state and federal courts.\nOn January 24, 2017, the Company was served with a summons and complaint filed by plaintiff shareholder Atul Ojha in New York state court against certain officers and directors of the Company and naming the Company as a nominal defendant. The lawsuit is styled as a derivative action (the “Ojha Derivative Action”) and was originally filed (but not served on any defendant) on October 15, 2016. The Ojha Derivative Action substantively alleges that the defendants, collectively or individually, inadequately managed the business and assets of the Company resulting in the deterioration of the Company’s financial condition. The Ojha Derivative Action asserts claims including, but not limited to, breach of fiduciary duties, unjust enrichment and waste of corporate assets.\nOn December 12, 2018, a shareholder derivative action was filed by shareholder Bob Thomas against certain current and former directors, officers and shareholders of the Company, and naming the Company as a nominal defendant, in New York state court, alleging breach of fiduciary duties, unjust enrichment, abuse of control, gross mismanagement, and waste and seeking declaratory relief and damages (the “Thomas Derivative Action”). The underlying allegations in the Thomas Derivative Action largely repeat the allegations of wrongdoing in the 2018 Securities Class Actions (as defined below).\nOn April 23, 2020, the Company entered into a stipulation of settlement (the “Stipulation”) in connection with the Ojha Derivative Action and the Thomas Derivative Action (together, the “State Derivative Actions”). The consideration for the settlement of the Derivative Actions is as follows: (i) adoption by the Company of certain corporate governance reforms, the terms of which are fully set forth in Exhibits A and B to the Stipulation; (ii) Robert B. Ladd, H. Robert Holmes, Michael Onghai, and Nolan Bushnell shall collectively pay or cause to be paid $75 to the Company; and (iii) Barry C. Honig, John Stetson, Michael Brauser, John O’Rourke III, and Mark Groussman shall collectively pay or cause to be paid $150 to the Company. Further, the Company shall, subject to court approval, pay a fee and expense award to plaintiffs’ counsel in the Derivative Actions of $150 and service awards to each of the two plaintiffs in the Derivative Actions of $1.5 each, to be paid from the fee and expense award. On April 24, 2020, the New York state court entered an order preliminarily approving the Stipulation and the settlement contemplated therein and providing for the notice of the settlement to be made to current MGT Stockholders. The Preliminary Approval Order further provided for a Court hearing on the settlement on June 26, 2020. On May 4, 2020, pursuant to the Preliminary Approval Order, MGT provided notice of the settlement on its website, by press release and by filing a Form 8-K with the Securities and Exchange Commission.\nFinal approval of the settlement of the State Derivative Actions was granted on July 2, 2020.\nOn August 28, 2019, a shareholder derivative action was filed by shareholder Tyler Tomczak against the certain directors, officers and shareholders of the Company, and naming the Company as a nominal defendant, in the United States District Court for the Southern District of New York, alleging breach of fiduciary duties, waste and unjust enrichment and seeking declaratory relief and damages (the “Tomczak Derivative Action”). The underlying allegations in the Tomczak Derivative Action largely repeat the allegations of wrongdoing in the 2018 Securities Class Actions.\nOn September 11, 2019, a shareholder derivative action was filed by shareholder Arthur Aviles against certain directors, officers and shareholders of the Company, and naming the Company as a nominal defendant, in the United States District Court for the District of Delaware, alleging breach of fiduciary duties, waste and unjust enrichment and seeking declaratory relief and damages (the “Aviles Derivative Action”). The underlying allegations in the Aviles Derivative Action largely repeat the allegations of wrongdoing in the 2018 Securities Class Actions.\nOn May 7, 2020, the Company entered into a stipulation of settlement (the “Federal Stipulation”) in connection with the Tomczak Derivative Action and the Aviles Derivative Action (together, the “Federal Derivative Actions”). The consideration for the settlement of the Federal Derivative Actions is as follows: (i) adoption by the Company of a certain corporate governance reform, the terms of which are fully set forth in Exhibit A to the Federal Stipulation; and (ii) Robert B. Ladd, H. Robert Holmes, and Michael Onghai shall collectively pay or cause to be paid $65 to the Company. Further, the Company shall, subject to court approval, pay a fee and expense award to plaintiffs’ counsel in the Federal Derivative Actions of $30 and incentive awards to each of the two plaintiffs in the Federal Derivative Actions of $0.4 each. The parties to the Federal Stipulation presently intend to file the Federal Stipulation with the appropriate federal court after final approval of the settlement of the two state Derivative Actions referred to above.\nFinal approval of the settlement of the Federal Derivative Actions was granted on August 5, 2020. For the year ended December 31, 2020, the Company recorded $119 as other income in relation to the settlement of the Federal Derivative Actions.\nIn October 2019, the Company and its then officers and directors received subpoenas from the SEC requesting information, including but not limited to, with respect to risk factors contained in certain of the Company’s filings with the SEC. On October 21, 2020, the SEC notified the Company this investigation concluded, and it does not intend to recommend an enforcement action by the Commission against MGT in this matter. This notice was sent pursuant to guidelines set out in Securities Acts Release 5310, which states in part that the notice “must in no way be construed as indicating that the party has been exonerated or that no action may ultimately result from the Staff’s investigation.”\nIn November 2018, the Company’s board received a shareholder demand letter dated November 6, 2018, from shareholders Nicholas Fulton and Kelsey Thacker (the “Fulton Demand”). The Fulton Demand referenced the SEC Action, and the allegations therein, and demanded that the board take action to investigate, address and remedy the allegations raised in the SEC Action. Shortly after the New York state court entered the order preliminarily approving the stipulation of settlement in connection with the Ojha Derivative Action and the Thomas Derivative Action, counsel for the Company informed counsel for shareholders Nicholas Fulton and Kelsey Thacker of that stipulation of settlement and of counsel for the Company’s view that the releases in the settlement covered the matters raised in the Fulton Demand.\nSettlement of Class Action\nIn September 2018 and October 2018, various shareholders of the Company filed putative class action lawsuits against the Company, its Chief Executive Officer and certain of its individual officers and shareholders, alleging violations of federal securities laws and seeking damages (the “2018 Securities Class Actions”). The 2018 Securities Class Action followed and referenced the allegations made against the Company’s Chief Executive Officer and others in the SEC Action. The first putative class action lawsuit was filed on September 28, 2018, in the United States District Court for the District of New Jersey, and alleges that the named defendants engaged in a pump-and-dump scheme to artificially inflate the price of the Company’s stock and that, as a result, defendants’ statements about the Company’s business and prospects were materially false and misleading and/or lacked a reasonable basis at relevant times. The second putative class action was filed on October 9, 2018, in the United States District Court for the Southern District of New York and makes similar allegations.\nOn May 28, 2019, the parties to the 2018 Securities Class Actions entered into a binding settlement term sheet, and on September 24, 2019, the parties entered into a stipulation of settlement. On August 7, 2019, the lead plaintiff in the first class action filed a notice and order of voluntary dismissal with prejudice, and on October 11, 2019, the lead plaintiff in the second class action filed in the federal court in New York an unopposed motion for preliminary approval of the proposed class action settlement. On December 17, 2019, the court issued an order granting preliminary approval of the settlement.\nFinal approval of the settlement of the 2018 Securities Class Actions was granted on May 27, 2020. The plaintiff shareholder class received $750 in cash settlement, inclusive of attorney fees. This amount was paid by the Company’s insurance carrier.",
    "item_4": "Item 4. Mine Safety Disclosures\nNone.\nPART II",
    "item_5": "Item 5. Market For Registrant’s Common Equity, Related Stockholder Matters And Issuer’s Purchases Of Equity Securities\nMarket Information\nOur common stock is traded on the OTC QB tier of OTC Markets LLC under the symbol “MGTI.”\nHolders\nOn April 14, 2021, the Company’s common stock closed on the OTC QB tier of OTC Markets LLC at $0.08 per share and there were 362 stockholders of record.\nDividends\nThe Company has never declared or paid cash dividends on its common stock and has no intention to do so in the foreseeable future.\nUnregistered sales of equity securities\nNone",
    "item_6": "Item 6. Selected Financial Data\nNot applicable.",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nOverview\nFollowing a review of its Bitcoin mining operations in early 2019, we determined to consolidate our activities in a Company-owned and managed facility. Central to this strategy was the purchase of land in LaFayette, GA and the entry into a favorable contract for electricity in the second quarter of 2019. Located adjacent to a utility substation, the several acre property has access to over 20 megawatts (MW) of low-cost power.\nThe Company owned approximately 669 and 649 Antminer S17 Pro Bitcoin miners located in LaFayette, GA as of December 31, 2020 and April 15, 2021, respectively. All miners were purchased from Bitmaintech Pte. Ltd., a Singapore limited company (“Bitmain”), and are collectively rated at approximately 30 Ph/s in computing power. Bitmain has acknowledged manufacturing defects, combined with inadequate repair facilities, rendering approximately one half of our miners in need of repair or replacement. The Company’s miners are housed in three modified shipping containers. The Company’s current electrical load is estimated at under 1.0 MW. The entire facility, including the land, two 2500 KVA 3-phase transformers, the mining containers, and miners, are owned by MGT. As the Company is presently using only a portion of the built-out available electrical load, it is exploring ways to grow and maintain its current operations including but not limited to further equipment sales, leasing space to other Bitcoin miners, and raising capital to acquire newest generation miners.\nPrior to establishing our Company-owned and managed facility, we conducted our Bitcoin mining operations through third-party hosting arrangements. We also entered into management agreements with third party investors whereby the investors purchased the mining hardware, and we received both a fee to manage the mining operations plus one-half of the net operating profit. In March 2019, we entered into a settlement agreement to terminate our hosting agreement in Washington and conveyed ownership of its onsite mining assets for full satisfaction of $77 in outstanding hosting service fees. In August and September 2019, we terminated all our management agreements with third party investors, and in December 2019, we terminated our final remaining hosting arrangements in Colorado and Ohio.\nCritical accounting policies and estimates\nOur discussion and analysis of financial condition and results of operations are based upon our consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States of America (“U.S. GAAP”). The notes to the consolidated financial statements contained in this Annual Report describe our significant accounting policies used in the preparation of the consolidated financial statements. The preparation of these financial statements requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods. Actual results could differ from those estimates. We continually evaluate our critical accounting policies and estimates.\nWe believe the critical accounting policies listed below reflect significant judgments, estimates and assumptions used in the preparation of our consolidated financial statements.\nRevenue recognition\nOur primary revenue stream is related to the mining of digital currencies. We derive our revenue by solving “blocks” to be added to the blockchain and providing transaction verification services within the digital currency network of Bitcoin, commonly termed “cryptocurrency mining.” In consideration for these services, we receive digital currency (“Coins”). The Coins are recorded as revenue, using the average spot price of Bitcoin on the date of receipt. The Coins are recorded on the balance sheet as an intangible digital asset valued at the lower of cost or net realizable value. Net realizable value adjustments, to adjust the value of Coins to market value, is included in cost of revenue on our consolidated statement of operations. Further, any gain or loss on the sale of Coins would be recorded to costs of revenue. Costs of revenue include hosting fees, equipment and infrastructure depreciation, net realizable value adjustments, and electricity costs.\nWe also recognized revenue from our management agreements through their termination in August and September 2019. We received a fee from each management agreement based on the amount of Bitcoin mined, half of profits and were reimbursed for any electricity costs incurred to run the Bitcoin mining machines they managed in their facilities. Additionally, we had machines located in hosted facilities in Ohio and Colorado. We received an allocation of profits from these facilities. We terminated both hosting arrangements in December 2019.\nWe also recognize a royalty participation upon the sale of modified shipping containers manufactured by Bit5ive LLC of Miami, Florida under the terms of a collaboration agreement entered in August 2018.\nProperty and Equipment\nProperty and equipment are stated at cost less accumulated depreciation. Depreciation is calculated using the straight-line method on the various asset classes over their estimated useful lives, which range from one to ten years when placed in service. The cost of repairs and maintenance is expensed as incurred; major replacements and improvements are capitalized. When assets are retired or disposed of, the cost and accumulated depreciation are removed from the accounts, and any resulting gains or losses are included in income in the year of disposition. Deposits on property and equipment are initially classified as Other Assets and upon delivery, installation and full payment, the assets are classified as property and equipment on the consolidated balance sheet.\nStock-based compensation\nWe recognize compensation expense for all equity-based payments in accordance with Accounting Standards Codification (“ASC”) 718 “Compensation - Stock Compensation”. Under fair value recognition provisions, the Company recognizes equity-based compensation net of an estimated forfeiture rate and recognizes compensation cost only for those shares expected to vest over the requisite service period of the award.\nRestricted stock awards are granted at the discretion of the compensation committee of the board of directors of the Company (the “Board”). These awards are restricted as to the transfer of ownership and generally vest over the requisite service periods, typically over a 12 to 24 month period (vesting on a straight-line basis). The fair value of a stock award is equal to the fair market value of a share of the Company’s Common Stock on the grant date.\nThe fair value of an option award is estimated on the date of grant using the Black-Scholes option valuation model. The Black-Scholes option valuation model requires the development of assumptions that are inputs into the model. These assumptions are the expected stock volatility, the risk-free interest rate, the expected life of the option, the dividend yield on the underlying stock and the expected forfeiture rate. Expected volatility is calculated based on the historical volatility of the Company’s common stock over the expected term of the option. Risk-free interest rates are calculated based on continuously compounded risk-free rates for the appropriate term.\nDetermining the appropriate fair value model and calculating the fair value of equity-based payment awards requires the input of the subjective assumptions described above. The assumptions used in calculating the fair value of equity-based payment awards represent management’s best estimates, which involve inherent uncertainties and the application of management’s judgment. We are required to estimate the expected forfeiture rate and recognize expense only for those shares expected to vest.\nWe account for share-based payments granted to non-employees in accordance with ASC 505-50, “Equity Based Payments to Non-Employees”. We determine the fair value of the stock-based payment as either the fair value of the consideration received or the fair value of the equity instruments issued, whichever is more readily determinable. If the fair value of the equity instruments issued is used, it is measured using the stock price and other measurement assumptions as of the earlier of either (1) the date at which a commitment for performance by the counterparty to earn the equity instruments is reached, or (2) the date at which the counterparty’s performance is complete.\nEquity-linked instruments\nThe Company accounts for equity-linked instruments with certain anti-dilution provisions in accordance with ASC 815 and ASC 260. Under this guidance, the Company excludes instruments with certain down round features when determining whether a financial instrument (or embedded conversion feature) is considered indexed to the Company’s own stock. As a result, financial instruments (or embedded conversion features) with down round features are not required to be classified as derivative liabilities. The Company recognizes the value of a down round feature only when it is triggered and the exercise or conversion price has been adjusted downward. For equity-classified freestanding financial instruments, such as warrants, the Company treats the value of the effect of the down round, when triggered, as a deemed dividend and a reduction of income available to common stockholders in computing basic earnings per share. For convertible instruments with embedded conversion features containing down round provisions, the Company recognizes the value of the down round as a beneficial conversion discount to be amortized to earnings.\nAny incentive-based compensation received by the Optionee from the Company hereunder or otherwise shall be subject to recovery by the Company in the circumstances and manner provided in any Incentive-based Compensation Recovery that may be adopted or implemented by the Company and in effect from time to time on or after the date hereof, and Optionee shall effectuate any such recovery at such time and in such manner as the Company may specify.\nDerivative Instruments\nDerivative financial instruments are recorded in the accompanying consolidated balance sheets at fair value in accordance with ASC 815. When the Company enters into a financial instrument such as a debt or equity agreement (the “host contract”), the Company assesses whether the economic characteristics of any embedded features are clearly and closely related to the primary economic characteristics of the remainder of the host contract. When it is determined that (i) an embedded feature possesses economic characteristics that are not clearly and closely related to the primary economic characteristics of the host contract, and (ii) a separate, stand-alone instrument with the same terms would meet the definition of a financial derivative instrument, then the embedded feature is bifurcated from the host contract and accounted for as a derivative instrument. The estimated fair value of the derivative feature is recorded in the accompanying consolidated balance sheets separately from the carrying value of the host contract. Subsequent changes in the estimated fair value of derivatives are recorded as a gain or loss in the Company’s consolidated statements of operations.\nImpairment\nLong-lived assets are reviewed for impairment whenever facts or circumstances either internally or externally may suggest that the carrying value of an asset may not be recoverable, Should there be an indication of impairment, we test for recoverability by comparing the estimated undiscounted future cash flows expected to result from the use of the asset to the carrying amount of the asset or asset group. Any excess of the carrying value of the asset or asset group over its estimated fair value is recognized as an impairment loss.\nRecent accounting pronouncements\nNote 3 to our audited consolidated financial statements appearing elsewhere in this report includes Recent Accounting Pronouncements.\nResults of operations\nYears ended December 31, 2020 and 2019\nRevenues\nOur revenues for the year ended December 31, 2020 increased by $990, or 220%, to $1,440 as compared to $450 for the year ended December 31, 2019. Our revenue is primarily derived from cryptocurrency mining which totaled $1,434 during 2020. The increase in revenues is a result of increased Bitcoin mining production and Bitcoin prices.\nThe Company is also entitled to a royalty from the sale of POD5 mining containers manufactured and sold by Bit5ive, LLC. During 2020 and 2019, the Company recognized $4 and $44, respectively, in royalties under this agreement due to a lower number of POD5 sales.\nOperating Expenses\nOperating expenses for the year ended December 31, 2020 decreased by $3,640, or 46%, to $4,311 as compared to $7,951 for the year ended December 31, 2019. The decrease in operating expenses was comprised of lower general and administrative expenses of $4,857, offset by an increase in cost of revenue of $1,218.\nCost of Revenue\nCost of revenue for the year ended December 31, 2020 increased by $1,218, or 239%, to $1,728 as compared to $510 for the year ended December 31, 2019. The primary reasons for this increase included higher electricity usage of $560 from increased bitcoin mining, and higher depreciation expense of $932 resulting from recognition of a full year of service our bitcoin mining machines and related assets; these assets were placed in service in the fourth quarter of 2019, and were depreciated for just one quarter in 2019. These increases were offset by approximately $276 relating to other costs of revenue.\nGeneral and Administrative Expenses\nThe decrease in general and administrative expenses of $4,857 or 65% to $2,584 as compared to $7,441 for the year ended December 31, 2019, was primarily caused by a decrease in stock-based compensation of $2,078 based on fewer shares issued or vested and a lower stock price in 2020 compared to 2019, a decrease in payroll and related expenses of $436, a decrease of consulting fees in the amount of $643, and a decrease in legal and professional fees of $208. These decreases were partly offset by an increase related to the Company’s mining facility of $104.\nOther Income and Expense\nFor the year ended December 31, 2020, non-operating expense consisted of accretion of debt discount of $882, a loss on sale of property and equipment of $352, and interest expense of $347, partially offset by the change in fair value of the liability associated with the termination of management agreements of $26, the change in fair value of derivative liability of $309, funding from PPP Loan of $111, and other income of $119.\nFor the year ended December 31, 2019, non-operating expense consisted of accretion of debt discount of $5,605, partially offset by a gain on extinguishment of debt of $3,540, interest income of $10, a gain on sale of property and equipment of $599, and a change in the fair value of the liability associated with the termination of the management agreements of $176.\nLiquidity and capital resources\nSources of Liquidity\nWe have historically financed our business through the sale of debt and equity interests. We have incurred significant operating losses since inception and continue to generate losses from operations and as of December 31, 2020 have an accumulated deficit of $418,389. At December 31, 2020, our cash and cash equivalents were $236, and our working capital deficit was $1,527. As of December 31, 2020, we had one note payable outstanding with a principal amount of $230.\nIn January 2020, management completed the initial phase of its plan to consolidate its activities in Company-owned and managed facilities, executing on its expansion model to secure low cost power and grow its cryptocurrency assets. In connection with this plan, the Company terminated its management agreements and its third-party hosting arrangements in 2019. The Company will need to raise additional funding to grow its operations and to pay current maturities of debt. There can be no assurance however that the Company will be able to raise additional capital when needed, or at terms deemed acceptable, if at all. Such factors raise substantial doubt about the Company’s ability to sustain operations for at least one year from the issuance of these consolidated financial statements. The accompanying consolidated financial statements do not include any adjustments related to the recoverability and classification of asset amounts or the classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nThe price of Bitcoin is volatile, and fluctuations are expected. Declines in the price of Bitcoin have had a negative impact in our operating results and liquidity and could harm the price of our Common Stock. Movements may be influenced by various factors, including, but not limited to, government regulation, security breaches experienced by service providers, as well as political and economic uncertainties around the world. Since we record revenue based on the price of earned Bitcoin and we may retain such Bitcoin as an asset or as payment for future expenses, the relative value of such revenues may fluctuate, as will the value of any Bitcoin we retain. The high and low exchange rate per Bitcoin for the year ending December 31, 2020, as reported by Blockchain.info, were approximately $5 and $29 respectively.\nThe supply of Bitcoin is finite. Once 21 million Bitcoin are generated, the network will stop producing more. Currently, there are approximately 19 million Bitcoin in circulation, or 90% of the total supply of Bitcoin. Within the Bitcoin protocol is an event referred to as Halving where the Bitcoin reward provided upon mining a block is reduced by 50%. Halvings are scheduled to occur once every 210,000 blocks, or roughly every four years, until the maximum supply of 21 million Bitcoin is reached. The most recent Halving occurred in May 2020, with a revised reward payout of 6.25 Bitcoin per block.\nGiven a stable hash rate, a Halving reduces the number of new Bitcoin being generated by the network. While the effect is to limit the supply of new coins, it has no impact on the quantity of total Bitcoin outstanding. As a result, the price of Bitcoin could rise or fall based on overall investor and consumer demand. Should the price of Bitcoin remain unchanged after the next Halving, the Company’s revenue would be reduced by 50%, with a much larger negative impact to profit.\nThe COVID-19 pandemic represents a fluid situation that presents a wide range of potential impacts of varying durations for different global geographies, including locations where we have offices, employees, customers, vendors and other suppliers and business partners. Like most US-based businesses, the COVID-19 pandemic and efforts to mitigate the same began to have impacts on our business in March 2020. By that time, much of our first fiscal quarter was completed. In light of broader macro-economic risks and already known impacts on certain industries, we have taken, and continue to take targeted steps to lower our operating expenses because of the COVID-19 pandemic. We continue to monitor the impacts of COVID-19 on our operations closely and this situation could change based on a significant number of factors that are not entirely within our control and are discussed in this and other sections of this annual report on Form 10-K. To date, travel restrictions and border closures have not materially impacted our ability to operate. However, if such restrictions become more severe, they could negatively impact those activities in a way that would harm our business over the long term. Travel restrictions impacting people can restrain our ability to operate, but at present we do not expect these restrictions on personal travel to be material to our business operations or financial results. Like most companies, we have taken a range of actions with respect to how we operate to assure we comply with government restrictions and guidelines as well as best practices to protect the health and well-being of our employees. We have also undertaken measures to reduce our administrative and advisory costs required as a publicly reporting company. Actions taken to date include salary reductions for senior management and termination of certain consulting agreements. However, the impacts of COVID-19 and efforts to mitigate the same have remained unpredictable and it remains possible that challenges may arise in the future.\nOur primary source of operating funds has been through debt and equity financing.\nEquity Purchase Agreements\nIn June 2019, we entered into an equity purchase agreement pursuant to which we could issue and sell to an investor from time to time up to 76,558,643 shares of our common stock registered with the SEC under a Form S-1. Through October 2019, 52,000,000 shares were issued and sold under this registration statement for net proceeds of $1,654.\nSale of Preferred Stock\nOn April 12, 2019, our Board of Directors approved the authorization of 200 shares of Series C Convertible Preferred Stock with a par value of $0.001 and a stated value of $10,000 per share (“Preferred Shares”). The holders of the Preferred Shares are not entitled to voting rights or to receive dividends. At any time prior to the one-year anniversary from the issuance date, the Company may redeem the Preferred Shares at 1.4 times the Stated Value, following which we may redeem the Preferred Shares at 1.2 times the Stated Value.\nEach Preferred Share is convertible into shares of our common stock in an amount equal to the greater of: (a) 200,000 shares of common stock or (b) the amount derived by dividing the Stated Value by the product of 0.7 times the market price of our common stock, defined as the lowest trading price of our common stock during the ten day period preceding the conversion date. The holder may not convert any Preferred Shares if the total amount of shares, together with holdings of its affiliates, following a conversion shall exceed 9.99% of our common stock. The common shares issued upon conversion have been registered under our registration statement on Form S-3. On April 12, 2019 and July 15, 2019, we sold 190 Preferred Shares for $1,890 and 10 Preferred Shares for $100, respectively.\nSale of Common Stock\nOn April 12, 2019, we entered into a purchase agreement with an accredited investor whereby we sold 17,500,000 shares of our common stock for $525 pursuant to our registration statement on Form S-3. The holder of these shares is also the holder of an unsecured promissory note in the amount of $3,600 (the “June 2018 Note”) and an affiliate of the acquirer of 160 shares of the Preferred Shares of which 115 are issued and outstanding as of December 31, 2020.\nOn January 28, 2021 and February 18, 2021, we issued 2,597,403 and 27,272,727 shares of the Company’s common stock, respectively, to Chicago Venture Partners L.P., a Utah limited partnership, and Uptown Capital LLC, a Utah limited liability company, in connection with the conversion of 10 and 105 shares of the Company’s Series C Convertible Preferred Stock (the “Series C Preferred”). Following these conversions, the Company has no Series C Preferred issued or outstanding.\nDebt Financing\nDecember 2020 Note\nOn December 8, 2020, we entered into a securities purchase agreement pursuant to which we issued a convertible promissory note in the principal amount of $230 which is convertible, at the option of the holder, into shares of common stock at a conversion price equal to 70% of the lowest price for a share of common stock during the ten trading days immediately preceding the applicable conversion. The Company received consideration of $200 for the convertible promissory note. The note bears interest at a rate of 8% per annum and matures in twelve months.\nOn March 5, 2021, we entered into a securities purchase agreement (the “Securities Purchase Agreement”) with Bucktown Capital, LLC (the “Investor”), pursuant to which the Company issued a convertible promissory note in the original principal amount of $13,210 (the “2021 Note”). The 2021 Note is convertible, at the option of the Investor, into shares of common stock of the Company at a conversion price equal to 70% of the lowest price for a share of common stock during the ten trading days immediately preceding the applicable conversion (the “Conversion Price”); provided, however, in no event shall the Conversion Price be less than $0.04 per share. The 2021 Note bears interest at a rate of 8% per annum and will mature in twelve months.\nThe 2021 Note will be funded in tranches, with the initial tranche of $1,210 funded by the Investor on March 5, 2021 for consideration of $1,000. Six subsequent tranches (five tranches, each for $1,200 and one tranche for $6,000) will be funded upon the notice of effectiveness of a Registration Statement on Form S-1 covering the common stock issuable in connection with the 2021 Note. Further, the final tranche requires the mutual agreement of the Company and Investor. Until such time as Investor has funded the subsequent tranches, the Company will hold a series of Investor Notes that offset any unfunded portion of the 2021 Note.\nThe PPP Loan\nOn April 16, 2020, we entered into a promissory note with Aquesta Bank for $111 in connection with the Paycheck Protection Program (“PPP”) offered by the U.S. Small Business Administration (the “PPP Loan”). The PPP Loan bears interest at 1% per annum, with monthly installments of $6 commencing on November 1, 2021 for 18 months through its maturity on April 1, 2023. The principal amount of the PPP Loan will be forgiven if the loan proceeds are used to pay for payroll costs, rent and utilities costs over the 24-week period after the PPP Loan is made. Not more than 40% of the forgiven amount may be used for non-payroll costs. The amount of the loan forgiveness may be reduced if the Company reduces its full-time head count. On April 1, 2021, the Company received notice of forgiveness in the amount of $108 in relation to the PPP Loan. The Company used all proceeds from the PPP Loan to maintain payroll and other allowable expenses. As a result, management believes that the Company has met the PPP eligibility criteria for forgiveness for the remaining payable of $3 to the SBA and has concluded that the loan represents, in substance, a government grant that is expected to be forgiven in its entirety.\nProperty & Equipment Acquisitions and Commitments\nIn connection with consolidating our activities in a Company-owned and managed facility in LaFayette, Georgia, we acquired the following assets during 2019 and 2020:\n● 6 acres of land in Lafayette, Georgia for $55\n● 1,500 Bitcoin miners valued at $2,313\n● Infrastructure costs totaling $905, including transformers and related equipment, land preparation, fencing, electrical contracting, permits, design and architectural fees\n● 5 modified Bitcoin mining containers for $761\nPhase I of the LaFayette site is structurally complete. The entire facility, including the land, electrical transformers, the mining containers and the miners, are owned by MGT. As we are presently using only a small percentage of the available electrical load, we are exploring ways to grow our current operations.\nYears ended December 31,\nCash (used in) / provided by\nOperating activities $ (650 ) $ (3,960 )\nInvesting activities (3,314 )\nFinancing activities 7,394\nNet increase in cash and cash equivalents $ 20 $ 120\nCash Flows\nOperating activities\nNet cash used in operating activities was $650 for the year ended December 31, 2020 as compared to $3,960 for the year ended December 31, 2019. The amount in 2020 primarily consisted of a net loss of $3,887 offset by non-cash charges of $2,536 (including: stock-based compensation of $222, an impairment charge to the Company’s intangible cryptocurrency mining assets of $49, depreciation expense of $1,102, amortization of debt discount of $882, non-cash interest expense of $355 and loss on sale of property and equipment of $352), and reduced by other non-cash items, including funding from the PPP Loan recognized as income in the amount of $111, the change in the fair value of the liability associated with the termination of the management agreements of $26, the change in the fair value of the derivative liability of $309, and a change in working capital excluding cash of $701.\nInvesting activities\nNet cash provided by investing activities was $359 for the year ended December 31, 2020 as compared to net cash used in investing activities of $3,314 for the year ended December 31, 2019. The amount in 2020 primarily consisted of purchases of property and equipment of $376, offset by proceeds from the sale of property and equipment of $686.\nFinancing activities\nDuring the year ended December 31, 2020, cash provided by financing activities totaled $311 which includes $200 in net proceeds from the issuance of notes payable and $111 of proceeds from the PPP Loan.\nOff-balance sheet arrangements\nAs of December 31, 2020, we had no obligations, assets or liabilities which would be considered off-balance sheet arrangements. We do not participate in transactions that create relationships with unconsolidated entities or financial partnerships, often referred to as variable interest entities, which would have been established for the purpose of facilitating off-balance sheet arrangements.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosure About Market Risk\nThe Company is not exposed to market risk related to interest rates on foreign currencies.",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nSee Financial Statements and Schedules attached hereto.",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures designed to ensure that the information we are required to disclose in reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified under the rules and forms of the SEC. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that such information is accumulated and communicated to our management, including our Chief Executive Officer and our acting Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosures. As required by paragraph (b) of Rules 13a-15 and 15d-15 under the Exchange Act, our Chief Executive Officer (our principal executive) and acting Chief Financial Officer (our principal financial officer and principal accounting officer) carried out an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures as of December 31, 2020. Based on this evaluation, our Chief Executive Officer and acting Chief Financial Officer concluded that our disclosure controls and procedures (as defined in paragraph (e) of Rules 13a-15 and 15d-15 under the Exchange Act) were not effective as December 31, 2020.\nLimitations on Internal Control over Financial Reporting\nAn internal control system over financial reporting has inherent limitations and may not prevent or detect misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. However, these inherent limitations are known features of the financial reporting process. Therefore, it is possible to design into the process safeguards to reduce, though not eliminate, this risk.\nManagement’s Annual Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Exchange Act Rule 13a-15(f) and 15d-15(f). Internal control over financial reporting is a process used to provide reasonable assurance regarding the reliability of our financial reporting and the preparation of our financial statements for external purposes in accordance with generally accepted accounting principles in the United States. Internal control over financial reporting includes policies and procedures that pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of our assets; provide reasonable assurance that transactions are recorded as necessary to permit preparation of our financial statements in accordance with generally accepted accounting principles in the United States, and that our receipts and expenditures are being made only in accordance with the authorization of our board of directors and management; and provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on our financial statements.\nUnder the supervision and with the participation of our management, including our Chief Executive Officer (our principal executive) and acting Chief Financial Officer (our principal financial officer and principal accounting officer), we performed a complete documentation of the Company’s significant processes and key controls, and conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission in 2013. Based on this evaluation, management concluded that our internal control over financial reporting was not effective as of December 31, 2020.\nThis Annual Report on Form 10-K does not include an attestation report of the Company’s independent registered public accounting firm regarding internal control over financial reporting since the Company is a smaller reporting company under the rules of the SEC.\nChanges in Internal Control over Financial Reporting\nDuring the year ended December 31, 2020, there were no changes in internal control over financial reporting.",
    "item_9B": "Item 9B. Other Information\nNone.\nPART III",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nName\nAge\nPosition\nRobert B. Ladd\nPresident, Chief Executive Officer, acting Chief Financial Officer and Director\nMichael Onghai\nChairman of the Audit Committee, Compensation Committee and Nominating/Corporate Governance Committee Member, Independent Director\nDirectors are elected based on experience, qualifications and in accordance with the Company’s by-laws to serve until the next annual stockholders meeting and until their successors are elected in their stead. Officers are appointed by the Board and hold office until their successors are chosen and qualified, until their death or until they resign or have been removed from office. All corporate officers serve at the discretion of the Board. There are no family relationships between any director or executive officer and any other director or executive officer of the Company.\nRobert B. Ladd joined the Company in December 2010 as a Director. He was named Interim President and CEO in February 2011, and appointed President and CEO in January 2012, positions held continuously with the exception of November 2016 through August 2017, a period during which Mr. Ladd was President. He also served as our Interim CFO from November 2015 through February 2018 and acting Chief Financial Officer since July 1, 2020. On September 10, 2018, Mr. Ladd took a leave of absence from his positions as President and Chief Executive Office and was reappointed as President and Chief Executive Officer on May 1, 2019. Mr. Ladd was the Managing Member of Laddcap Value Advisors, LLC, which served as the investment manager for various private partnerships, including Laddcap Value Partners LP. Prior to forming his investment partnership in 2003, Mr. Ladd was a Managing Director at Neuberger Berman Group. Mr. Ladd is a former Director of InFocus Systems, Inc. (NASDAQ - INFS, 2007 to 2009), and served on the boards of Delcath Systems, Inc. (NASDAQ - DCTH, 2006-2012) and Pyxis Tankers (NASDAQ - PXS, 2016 - 2017). Mr. Ladd has earned his designation as a Chartered Financial Analyst (1986). Based on Mr. Ladd’s familiarity with the Company in serving as our Chief Executive Officer since 2011 and his overall background and experience as an executive in the financial industry, the Nominating and Corporate Governance Committee of the Board concluded that Mr. Ladd has the requisite experience, qualifications, attributes and skill necessary to serve as a member of the Board.\nMichael Onghai was appointed a director in May 2012. Mr. Onghai has been the CEO of LookSmart (OTC: LKST), since February 2013. He has been the founder and Chairman of AppAddictive, an advertising and social commerce platform since July 2011. Mr. Onghai is the President of Snowy August Management LLC, a special situations fund concentrating on the Asian market, spin-offs and event-driven situations. Mr. Onghai is the founder of Stock Sheet, Inc., and Daily Stocks, Inc. - the web’s early providers of financial information and search engine related content for financial information. Mr. Onghai has founded several other internet technology companies for the last two decades. Mr. Onghai is an advisor to several internet incubators and is a panelist who advises FundersClub on which companies to accept for its pioneering venture capital platform. Mr. Onghai has earned his designation as a Chartered Financial Analyst (2006) and holds a B.S. in Electrical Engineering and Computer Science from the University of California, Los Angeles and graduated from the Executive Management Certificate Program in Value Investing (The Heilbrunn Center for Graham & Dodd Investing) Graduate School of Business at Columbia Business School. The Board believes that Mr. Onghai has the experience, qualifications, attributes and skills necessary to serve as a director and chairman of the Audit Committee because of his years of business experience and financial expertise.\nFamily Relationships\nThere are no family relationships among any of the Company’s directors and executive officers.\nBoard Role in Risk Oversight\nThe Board’s primary function is one of oversight. The Board as a whole works with the Company’s management team to promote and cultivate a corporate environment that incorporates enterprise-wide risk management into strategy and operations. Management periodically reports to the Board about the identification, assessment and management of critical risks and management’s risk mitigation strategies. Each committee of the Board is responsible for the evaluation of elements of risk management based on the committee’s expertise and applicable regulatory requirements. In evaluating risk, the Board and its committees consider whether the Company’s programs adequately identify material risks in a timely manner and implement appropriately responsive risk management strategies throughout the organization. The audit committee focuses on assessing and mitigating financial risk, including risk related to internal controls, and receives at least quarterly reports from management on identified risk areas. In setting compensation, the compensation committee strives to create incentives that encourage behavior consistent with the Company’s business strategy, without encouraging undue risk-taking. The nominating committee considers areas of potential risk within corporate governance and compliance, such as management succession. Each of the committees reports regularly to the Board as a whole as to their findings with respect to the risks they are charged with assessing.\nCode of Business Conduct and Ethics\nOn July 11, 2018, the Board revised the Code of Business Conduct and Ethics which applies to all directors and employees including the Company’s principal executive officer, principal financial officer and principal accounting officer or persons performing similar functions. Prior to July 11, 2018, the Company’s employees and directors were subject to the previous Code of Ethics adopted by the Board on June 25, 2012.\nCopies of the Code of Business Conduct and Ethics can be obtained, without charge by writing to the Corporate Secretary at MGT Capital Investments, Inc., 150 Fayetteville Street, Suite 1110, Raleigh, NC 27601, or through our corporate website at mgtci.com.\nAudit Committee and Audit Committee Financial Expert\nOn November 25, 2004, the Board established an Audit Committee to carry out its audit functions. At December 31, 2020, the membership of the Audit Committee was Michael Onghai.\nThe Board has determined that Michael Onghai, an independent director, is the Audit Committee financial expert, as defined in Regulation S-K promulgated under the Exchange Act, serving on its Audit Committee.",
    "item_11": "Item 11. Executive Compensation\nSummary Compensation Table\nThe following table summarizes Fiscal Years 2020 and 2019 compensation for services in all capacities of the Company’s named executive officers and other individuals:\nName Principal Position Year Salary Bonus Stock\nawards All other\ncompensation Total\ncompensation\nRobert B. Ladd President, Chief Executive Officer and Acting Chief Financial Officer(1) $ 282 $ - $ - $ $ 282\n$ 360 $ - $ - $ - $ 360\nH. Robert Holmes Interim President and\nChief Executive Officer (2)\n$ 40 $ - $ - $ - $ 40\n$ 125 $ - $ - $ - $ 125\nRobert S. Lowrey Chief Financial Officer (3) $ 155 $ 40 $ - $ - $ 195\n$ 240 $ - $ - $ - $ 240\n(1) Mr. Ladd took a leave of absence as President and Chief Executive Officer on September 10, 2018 and was reappointed as President and Chief Executive Officer on May 1, 2019. Mr. Ladd was appointed as the acting Chief Financial Officer since July 1, 2020.\n(2) Mr. Holmes was appointed Interim Chief President and Chief Executive Officer from September 10, 2018 to May 1, 2019. Compensation for Mr. Holmes in 2019 included $75 in Director fees and $50 in salary. Compensation for Mr. Holmes in 2020 included $40 in Director fees. H. Robert Holmes resigned from his position as a director of the Company on May 26, 2020\n(3) Mr. Lowrey was appointed Chief Financial Officer on March 1, 2018 and resigned on June 30, 2020.\nEmployment Agreements\nRobert B. Ladd\nOn April 1, 2018, the Company entered into an Amended and Restated Executive Employment Agreement (the “Employment Agreement”) with Mr. Ladd, which was executed on April 6, 2018. The Employment Agreement provides that Mr. Ladd has been reappointed as President and Chief Executive Officer of the Company for an initial term of two years. Mr. Ladd is entitled to receive an annualized base salary of $360 and is also eligible for a cash and/or equity bonus as the Compensation Committee may determine, from time to time, based on meeting performance objectives and bonus criteria to be mutually identified by Mr. Ladd and the Compensation Committee. In connection with the execution of the Employment Agreement, the Company issued to Mr. Ladd 600,000 shares of the Company’s restricted Common Stock, pursuant to the Company’s 2016 Stock Option Plan, vesting over a two-year period. On September 10, 2018 through May 1, 2019, Mr. Ladd took a leave of absence as an executive and officer of the Company in order to focus on allegations levied against him in an SEC complaint filed on September 7, 2018.\nOn November 11, 2020, the Company and Mr. Ladd agreed to amend the Employment Agreement, by resetting its effective date to November 1, 2020, and reducing the annualized base salary to $240,000.\nRobert S. Lowrey\nOn March 8, 2018, the Company entered into an employment agreement with Mr. Lowrey, effective March 1, 2018 for an initial term of two years with an annualized base salary of $240,000. Mr. Lowrey also received a one-time signing bonus of $10,000. Mr. Lowrey was also eligible for a cash and/or equity bonus as the Compensation Committee may determine. In connection with the execution of his employment agreement, the Company issued to Mr. Lowrey 750,000 shares of the Company’s restricted Common Stock, pursuant to the Company’s 2016 Stock Option Plan, one-third of which vested on each of March 8, 2019, September 8, 2019, and March 8, 2020. On August 1, 2018, the Company issued Mr. Lowrey 250,000 shares of the Company’s Common Stock, pursuant to the Company’s 2016 Stock Option Plan, one-third of which vested on each of January 31, 2019, July 31, 2019, and January 1, 2020. The employment agreement expired on February 28, 2020, after which time, Mr. Lowrey remained an employee with the same title, responsibilities, compensation and benefits.\nOn June 30, 2020, in connection with the end of his employment, Mr. Lowrey and the Company entered into a separation and release agreement dated June 30, 2020 (the “Separation Agreement”). The Separation Agreement provided that Mr. Lowrey would be paid a lump sum of $25,000, representing all compensation earned or deferred through the end of Mr. Lowrey’s employment. In addition, the Separation Agreement provided for the payment of $19,525 to Mr. Lowrey for unreimbursed taxes and for Company-paid COBRA health insurance coverage.\nOutstanding Equity Awards at December 31, 2020\nOutstanding Stock Awards at Fiscal Year-End for 2020\nNone\nDirector Compensation\nThe following table sets forth the compensation of persons who served as a member of our Board of Directors during all or part of 2020, other than Robert B. Ladd, who is not compensated separately for Board service, and H. Robert Holmes whose compensation is discussed under “Executive Compensation.”\nName Fees Earned Or\nPaid in Cash Stock\nAwards All Other\nCompensation Total\nMichael Onghai $ 29 $ - $ - $ 29\nDirectors are reimbursed for their out-of-pocket expenses incurred in connection with the performance of Board duties.\nIndependent Director Compensation\nIn 2020, the Company changed its cash compensation policy for independent directors. Each independent director will receive annual compensation of $30.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nSecurity Ownership of Certain Beneficial Owners\nThe following table sets forth certain information regarding beneficial ownership and voting power of the Common Stock as of April 14, 2021, of:\n● each person serving as a director, a nominee for director, or executive officer of the Company;\n● all executive officers and directors of the Company as a group; and\n● all persons who, to our knowledge, beneficially own more than five percent of the Common Stock.\n“Beneficial ownership” here means direct or indirect voting or investment power over outstanding stock and stock which a person has the right to acquire now or within 60 days after April 14, 2021. See the accompanying footnotes to the tables below for more detailed explanations of the holdings. Except as noted, to our knowledge, the persons named in the tables beneficially own and have sole voting and investment power over all shares listed.\nPercentage beneficially owned is based upon 536,649,910 shares of Common Stock issued and outstanding as of April 14, 2021.\nName and Address of Beneficial Owner (1) Amount and Nature of\nBeneficial\nOwnership\n[Percentage of Beneficial\nOwnership]\nCurrent Directors and Officers:\nRobert B. Ladd 1,773,334 0.33 %\nMichael Onghai 586,000 0.11 %\nAll directors and executive officers (2 persons) 2,359,334 0.44 %\n5% Stockholders\nNone\n(1) Unless otherwise noted, the addresses for the above persons are in care of the Company at 105 Fayetteville Street, Suite 1110, Raleigh, NC 27601.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nThe table below provides information on our equity compensation plans as of December 31, 2020:\nNumber of securities\nto be issued upon\nexercise of\noutstanding options,\nwarrants and rights Weighted-average\nexercise price of\noutstanding options,\nwarrants and rights Number of securities\nremaining available\nfor future issuance\nunder equity\ncompensation plans\n(excluding securities\nreflected in column\n(a))\nPlan category (a) (b) (c)\nEquity compensation plans approved by security holders (1) $ - 5,102,586\nEquity compensation plans not approved by security holders - - -\nTotal $ - 5,102,586\n(1) On September 8, 2016, the Company’s stockholders approved the MGT Capital Investments, Inc. 2016 Equity Incentive Plan. The Company received approval to issue up to a maximum of 18,000,000 shares of Common Stock, including 6,000,000 options and 2,000,000 restricted shares to certain officers of the Company. As of December 31, 2020, the Company has issued 6,000,000 options and 6,897,414 shares under this plan. All options expired on January 31, 2020.",
    "item_13": "Item 13. Certain Relationships and Related Transactions and Director Independence\nNone.\nDirector Independence\nMichael Onghai is considered independent under Section 803A of NYSE MKT rules.",
    "item_14": "Item 14. Principal Accountant Fees and Services\nEffective January 5, 2017, RBSM LLP became our current independent auditor. The following is a summary of the fees billed by our independent auditors for professional services rendered for the fiscal years ended December 31, 2020 and 2019.\nYear Ended December 31,\nAudit fees $ 264 $ 262\nTax fees - -\nAudit-related fees -\nOther fees - -\n$ 264 $ 280\nAudit fees consist of fees billed for services rendered for the audit of our financial statements and review of our financial statements included in our quarterly reports on Form 10-Q.\nTax fees consist of fees billed for professional services related to the preparation of our U.S. federal and state income tax returns and tax advice.\nAudit-related fees consists of fees reasonably related to the performance of the audit or review of the Company’s financial statements that are not reported as “Audit Fees.”\nAll other fees consist of fees for other miscellaneous items, including fees related to registrations statements.\nAll services provided by the Company’s independent auditor were approved by the Company’s audit committee.\nPre-Approval Policy of Services Performed by Independent Registered Public Accounting Firm\nThe Audit Committee’s policy is to pre-approve all audit and non-audit related services, tax services and other services. Pre-approval is generally provided for up to one year, and any pre-approval is detailed as to the particular service or category of services and is generally subject to a specific budget. The Audit Committee has delegated the pre-approval authority to its chairperson when expedition of services is necessary. The independent registered public accounting firm and management are required to periodically report to the full Audit Committee regarding the extent of services provided by the independent registered public accounting firm in accordance with this pre-approval and the fees for the services performed to date.\nPART IV",
    "item_15": "Item 15. Exhibits and Financial Statement Schedules.\nFinancial Statements\nThe consolidated financial statements of the Company for the fiscal years covered by this Annual Report are located on pages to of this Annual Report.\nExhibit No.\nDescription\n3.1\nRestated Certificate of Incorporation of MGT Capital Investments, Inc., as amended (incorporated by reference to Exhibit 3.1 to the Annual Report on Form 10-K filed with the SEC on April 16, 2019).\n3.2\nAmended and Restated Bylaws of MGT Capital Investments, Inc. (incorporated by reference to Exhibit 3.1 to the Current Report on Form 8-K filed with the SEC on January 30, 2014).\n4.1\nCertificate of Designation of 12% Series B Preferred Stock of MGT Capital Investments, Inc., filed with the Delaware Secretary of State on January 11, 2019 (incorporated by reference to Exhibit 4.1 to the Current Report on Form 8-K filed with the SEC on January 14, 2019).\n4.2\nCertificate of Designation of Series C Convertible Preferred Stock (incorporated by reference to Exhibit 4.1 to the Current Report on Form 8-K filed with the SEC on April 18, 2019).\n4.3\nDescription of MGT Capital Investment, Inc.’s Securities (incorporated by reference to Exhibit 4.3 to the Annual Report on Form 10-K filed with the SEC on March 30, 2020).\n10.1\nEmployment Agreement, by and between MGT Capital Investments, Inc. and Robert Ladd, dated as of April 1, 2018 (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed with the SEC on April 12, 2018).\n10.2\nAgreement, effective as of May 1, 2019, by and among MGT Capital Investments, Inc., N 4th Street LLC, and Bit5ive LLC (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed with the SEC on May 15, 2019).\n10.3\nSecurities Purchase Agreement, dated December 8, 2020, between MGT Capital Investments, Inc. and Bucktown Capital, LLC (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed with the SEC on December 14, 2020).\n10.4\nConvertible Promissory Note in favor of Bucktown Capital, LLC dated December 8, 2020 (incorporated by reference to Exhibit 10.2 to the Current Report on Form 8-K filed with the SEC on December 14, 2020).\n10.5\nAmendment to Employment Agreement, dated November 11, 2020, by and between MGT Capital Investments, Inc. and Robert Ladd.*\n21.1\nSubsidiaries*\n23.1\nConsent of independent registered public accountant.*\nCertification pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 of Principal Executive Officer and Principal Accounting Officer*\nCertification pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 of Principal Executive Officer and Principal Financial Officer*\n101.INS\nXBRL Instance Document*\n101.SCH\nXBRL Taxonomy Extension Schema*\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase Document*\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document*\n101.LAB\nXBRL Taxonomy Extension Labels Linkbase Document*\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase Document*\n* Filed herewith.\nItem 16. Form 10-K Summary.\nNot applicable.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nMGT CAPITAL INVESTMENTS, INC\nApril 15, 2021\nBy: /s/ Robert B. Ladd\nRobert B. Ladd\nPresident (Principal Executive Officer)\nPursuant to the requirements of the Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Robert B. Ladd\nPresident, Chief Executive Officer, Acting Chief Financial Officer and Director\nApril 15, 2021\nRobert B. Ladd\n(Principal Executive Officer, Principal Financial Officer and Principal Accounting Officer)\n/s/ Michael Onghai\nDirector\nApril 15, 2021\nMichael Onghai\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of\nMGT Capital Investments, Inc.\nOpinion on the Financial Statement\nWe have audited the accompanying consolidated balance sheets of MGT Capital Investments, Inc. and its subsidiary (the Company) as of December 31, 2020 and 2019, the related consolidated statements of operations, stockholders’ (deficit) equity and cash flows for each of the years in the two year period ended December 31, 2020, and the related notes (collectively referred to as the financial statement). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2020 and 2019, and the results of its operations and its cash flows for each of the years in the two year period ended December 31, 2020, in conformity with accounting principles generally accepted in the United States of America.\nThe Company’s Ability to Continue as a Going Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has suffered recurring losses from operations and will require additional capital to continue as a going concern. This raises substantial doubt about the Company’s ability to continue as a going concern. Management’s plans regarding these matters are also described in Note 2. The financial statements do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets or the amounts and classification of liabilities that may result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nRevenue from mining of digital currencies - Refer to Note 3 of the consolidated financial statements\nCritical Audit Matter Description\nAs disclosed in Note 3, the Company’s primary revenue stream is related to the mining of digital currencies. The Company derives its revenue by solving “blocks” to be added to the blockchain and providing transaction verification services within the digital currency network of Bitcoin, commonly termed “cryptocurrency mining.” In consideration for these services, the Company receives digital currency (“Coins”). The Coins are recorded as revenue, using the average spot price of Bitcoin on the date of receipt. The Coins are recorded on the balance sheet as an intangible digital asset valued at the lower of cost or net realizable value. Net realizable value adjustments, to adjust the value of Coins to market value, are included in cost of revenue on the Company’s consolidated statements of operations. Further, any gain or loss on the sale of Coins would be recorded to costs of revenue. Costs of revenue include electricity costs, equipment and infrastructure depreciation, and net realizable value adjustments. During the year ended December 31, 2020, the Company recognized net cryptocurrency mining revenue of approximately $1,440,000.\nWe identified the accounting for and disclosure of cryptocurrency mining revenue recognized as a critical audit matter for the following reasons. Currently, no authoritative guidance exists for the accounting for and disclosure of cryptocurrency mining revenue recognized in accordance with GAAP. The Company’s management has exercised significant judgment in their determination of how existing GAAP should be applied to the accounting for and disclosure of cryptocurrency mining revenue recognized.\nHow the Critical Audit Matter Was Addressed in the Audit\nThe primary procedures we performed to address this critical audit matter included the following:\n● Performed a site visitation of the bitcoin mining facility where the Company’s mining hardware is located, which included an observation of the physical and environmental controls and mining equipment inventory observation procedures;\n● Evaluated management’s rationale for the application of ASC 606 to account for its cryptocurrency awards earned, which included evaluating the provisions of the contract between the Company and the Pool;\n● Evaluated management’s disclosures of its cryptocurrency activity in the financial statement footnotes;\n● Evaluated and tested management’s rationale and supporting documentation associated with the valuation of cryptocurrency awards earned;\n● Examined the Company’s hash rate and other assumptions to verify the Company’s mining capacity during the year;\n● Examined and verified certain bitcoins mined by the Company agree to public blockchain; and\n● Examined supporting sale and cash receipt evidence for cryptocurrency sales, including management’s processes for calculating any gains on sales of cryptocurrencies mined by the Company.\n/s/ RBSM LLP\nWe have served as the Company’s auditor since 2017.\nNew York, NY\nApril 15, 2021\nPART I - FINANCIAL INFORMATION\nItem 1. Financial Statements\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDIARY\nCONSOLIDATED BALANCE SHEETS\n(Dollars in thousands, except per-share amounts)\nDecember 31,\nAssets\nCurrent assets\nCash and cash equivalents $ 236 $ 216\nPrepaid expenses and other current assets\nIntangible digital assets\nTotal current assets\nNon-current assets\nProperty and equipment, at cost, net 1,872 3,536\nRight of use asset, operating lease, net of accumulated amortization\nOther assets\nTotal assets $ 2,301 $ 4,294\nLiabilities and Stockholders’ Equity\nCurrent liabilities\nAccounts payable $ 1,261 $ 795\nAccrued expenses and other payables\nConvertible note payable, net of debt discount\nManagement agreement termination liability -\nOperating lease liability\nDerivative liability -\nTotal current liabilities 1,777 1,008\nNon-current liabilities\nOperating lease liability\nTotal liabilities 1,810 1,067\nCommitments and Contingencies (Note 9)\nStockholders’ Equity\nUndesignated preferred stock, $0.001 par value, 8,489,800 shares authorized. No shares issued and outstanding at December 31, 2020 and 2019. - -\nSeries B preferred stock, $0.001 par value, 10,000 shares authorized. No shares issued or outstanding at December 31, 2020 and 2019. - -\nSeries C convertible preferred stock, $0.001 par value, 200 share authorized. 115 shares issued and outstanding at December 31, 2020 and 2019. - -\nCommon stock, $0.001 par value; 2,500,000,000 shares authorized; 506,779,781 and 413,701,289 shares issued and outstanding at December 31, 2020 and 2019, respectively.\nAdditional paid-in capital 418,373 417,315\nAccumulated deficit (418,389 ) (414,502 )\nTotal stockholders’ equity 3,227\nTotal Liabilities and Stockholders’ Equity $ 2,301 $ 4,294\nThe accompanying notes are an integral part of these consolidated financial statements\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDIARY\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(Dollars in thousands, except per-share amounts)\nFor the Year Ended December 31,\nRevenue $ 1,440 $ 450\nOperating expenses\nCost of revenue 1,728\nGeneral and administrative 2,584 7,441\nTotal operating expenses 4,311 7,951\nOperating loss (2,871 ) (7,501 )\nOther non-operating income (expense)\nInterest (expense) income (347 )\nFunding from SBA PPP loan -\nChange in fair value of liability\nChange in fair value of derivative liability -\nAccretion of debt discount (882 ) (5,605 )\nGain (loss) on sale of property and equipment (352 )\nOther income -\nGain on extinguishment of debt - 3,540\nTotal non-operating expense (1,015 ) (1,280 )\nNet loss (3,887 ) (8,781 )\nDeemed dividend - (1,005 )\nNet loss attributable to common stockholders $ (3,887 ) $ (9,786 )\nPer-share data\nBasic and diluted loss per share $ (0.01 ) $ (0.04 )\nWeighted average number of common shares outstanding 473,752,463 257,122,569\nThe accompanying notes are an integral part of these consolidated financial statements\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDIARY\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS’ (DEFICIT) EQUITY\nFOR THE YEARS ENDED DECEMBER 31, 2020 AND 2019\n(Dollars in thousands, except per-share amounts)\nTotal\nPreferred Stock Common Stock Additional Paid- Accumulated Stockholders’\n(Deficit)\nShares Amount Shares Amount In Capital Deficit Equity\nBalance at January 1, 2019 - $ - 111,079,683 $ 111 $ 403,299 $ (404,719 ) $ (1,309 )\nStock issued for services - - 160,500 - -\nStock based compensation - employee restricted stock - - - - 2,249 - 2,249\nSale of stock under equity purchase agreement - - 119,000,000 5,216 - 5,335\nStock sold in connection with registered direct placements - - 17,500,000 -\nSale of preferred stock - - - 1,990 - 1,990\nCommon stock issued on conversion of notes payable - - 124,089,191 2,614 - 2,738\nConversion of preferred stock (85 ) - 27,605,667 (28 ) - -\nIssuance of common stock for mining assets - - 10,250,000 -\nExercise of warrants - - 4,000,000 -\nWarrant buy-back and cancellation - - - - (14 ) - (14 )\nCancellation of shares received from transfer agent - - (83,752 ) - - - -\nDeemed dividend - - - - 1,005 (1,005 ) -\nCumulative effect adjustment related to ASU adoption - - - - -\nIssuance of stock based compensation - employee restricted stock - - 100,000 - - - -\nNet loss - - - - - (8,781 ) (8,781 )\nBalance at December 31, 2019 - 413,701,289 417,315 (414,502 ) 3,227\nStock based compensation - employee restricted stock - - - - -\nCommon stock issued on conversion of notes payable - - 93,078,492 -\nNet loss - - - - - (3,887 ) (3,887 )\nBalance at December 31, 2020 $ - 506,779,781 $ 507 $ 418,373 $ (418,389 ) $ 491\nThe accompanying notes are an integral part of these consolidated financial statements\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDIARY\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(Dollars in thousands, except per-share amounts)\nFor the Year Ended December 31,\nCash Flows From Operating Activities\nNet loss $ (3,887 ) $ (8,781 )\nAdjustments to reconcile net loss to net cash used in operating activities\nDepreciation 1,102\n(Gain) loss on sale of property and equipment (599 )\nImpairment of property and equipment\nChange in fair value of liability (26 ) (176 )\nChange in fair value of derivative liability (309 ) -\nStock-based compensation expense 2,301\nFunding from SBA PPP loan recognized as income (111 ) -\nExtinguishment of note payable - (3,540 )\nAmortization of note discount 5,605\nAmortization of right-of-use asset -\nNon-cash interest expense -\nTermination of management agreements -\nChange in operating assets and liabilities\nPrepaid expenses and other current assets\nIntangible digital assets\nManagement agreement termination liability (90 ) (45 )\nRight of use asset\nOperating lease liability (22 ) (6 )\nOther assets -\nAccounts payable\nAccrued expenses (8 )\nNet cash used in operating activities (650 ) (3,960 )\nCash Flows From Investing Activities\nPurchase of property and equipment (376 ) (3,646 )\nProceeds from sale of property and equipment\nProceeds from sale of Bitcoin received for sale of equipment\nDeposits made on property and equipment (38 ) (203 )\nRefund of security deposit -\nNet cash provided by (used in) investing activities (3,314 )\nCash Flows From Financing Activities\nProceeds from SBA PPP loan -\nProceeds from the issuance of notes payable, net of original issue discount -\nProceeds from sale of common stock -\nPayment of deferred offering costs - (70 )\nProceeds from sale of stock under equity purchase agreement, net of issuance costs - 5,053\nSale of preferred stock, net of issuance costs - 1,990\nRepayment of notes payable - (210 )\nProceeds from exercise of warrants -\nWarrant buybacks - (14 )\nNet cash provided by financing activities 7,394\nNet change in cash and cash equivalents\nCash and cash equivalents, beginning of year\nCash and cash equivalents, end of year $ 236 $ 216\nSupplemental disclosure of cash flow information\nCash paid for interest $ - $ 3\nCash paid for income tax $ - $ -\nNon-cash investing and financing activities\nReclassification of deposit to property plant and equipment $ 202 $ -\nDeemed dividend on warrant modification and beneficial conversion feature of preferred stock $ - $ 1,005\nCumulative effect adjustment related to ASU adoption $ - $ 3\nConversion of notes payable into common stock $ 929 $ 2,738\nRepayment of note payable and interest through the issuance of shares under the equity purchase agreement $ - $ 354\nAcquisition of miners through common stock $ $ 311\nConversion of Series C convertible preferred stock into common stock $ - $ 28\nReclassification of deferred offering costs $ - $ 70\nDebt discount on associated with convertible note $ 230 $ -\nThe accompanying notes are an integral part of these consolidated financial statements\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Dollars in thousands, except share and per-share amounts)\nNote 1. Organization and Basis of Presentation\nOrganization\nMGT Capital Investments, Inc. (“MGT” or the “Company”) is a Delaware corporation that was incorporated in 2000. MGT was originally incorporated in Utah in 1977. MGT is comprised of the parent company and its wholly owned subsidiary MGT Sweden AB. MGT’s corporate office is in Raleigh, North Carolina.\nCryptocurrency mining\nCurrent Operations\nThe Company owned approximately 669 and 649 Antminer S17 Pro Bitcoin miners at its Company-owned and managed facility located in LaFayette, GA as of December 31, 2020 and April 15, 2021, respectively. All miners were purchased from Bitmaintech Pte. Ltd., a Singapore limited company (“Bitmain”), and are collectively rated at approximately 30 Ph/s in computing power. Bitmain has acknowledged manufacturing defects, combined with inadequate repair facilities, rendering approximately one half of our miners in need of repair or replacement. The Company’s miners are housed in three modified shipping containers. A utility substation, adjacent to the several acre property, has access to over 20 megawatts (MW) of low-cost power. The Company’s current electrical load is estimated at slightly under 1.0 MW. The entire facility, including the land, two 2500 KVA 3-phase transformers, the mining containers, and miners, are owned by MGT. As the Company is presently using only a portion of the built-out available electrical load, it is exploring ways to grow and maintain its current operations including but not limited to further equipment sales, leasing space to other Bitcoin miners, and raising capital to acquire newest generation miners.\nBasis of presentation\nThe accompanying consolidated financial statements for the years ended December 31, 2020 and 2019 have been prepared in accordance with generally accepted accounting principles in the United States of America (“U.S. GAAP”) and applicable rules and regulations of the United States Securities and Exchange Commission (“SEC”).\nCOVID-19 pandemic:\nThe COVID-19 pandemic represents a fluid situation that presents a wide range of potential impacts of varying durations for different global geographies, including locations where we have offices, employees, customers, vendors and other suppliers and business partners.\nLike most US-based businesses, the COVID-19 pandemic and efforts to mitigate the same began to have impacts on our business in March 2020. By that time, much of our first fiscal quarter was completed. During the year ending December 31, 2020, the affects of COVID-19 were most noticeable in the daily interactions employees and consultant. Due to the volatility of bitcoin, it is difficult to quantify the effects of COVID-19. Given the daily evolution of the COVID-19 outbreak and the global responses to curb its spread, we are not able to estimate the effects of the COVID-19 outbreak on our results of operations, financial condition, or liquidity for the year ended December 31, 2021.\nIn light of broader macro-economic risks and already known impacts on certain industries, we have taken, and continue to take targeted steps to lower our operating expenses because of the COVID-19 pandemic. We continue to monitor the impacts of COVID-19 on our operations closely and this situation could change based on a significant number of factors that are not entirely within our control and are discussed in this and other sections of this annual report on Form 10-K.\nTo date, travel restrictions and border closures have not materially impacted our ability to operate. However, if such restrictions become more severe, they could negatively impact those activities in a way that would harm our business over the long term. Travel restrictions impacting people can restrain our ability to operate, but at present we do not expect these restrictions on personal travel to be material to our business operations or financial results.\nLike most companies, we have taken a range of actions with respect to how we operate to assure we comply with government restrictions and guidelines as well as best practices to protect the health and well-being of our employees. We have also undertaken measures to reduce our administrative and advisory costs required as a publicly reporting company. Actions taken to date include salary reductions for senior management and termination of certain consulting agreements. However, the impacts of COVID-19 and efforts to mitigate the same have remained unpredictable and it remains possible that challenges may arise in the future.\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Dollars in thousands, except share and per-share amounts)\nThe actions we have taken so far during the COVID-19 pandemic include, but are not limited to:\n● requiring all employees who can work from home to work from home;\n● increasing our IT networking capability to best assure employees can work effectively outside the office;\n● for employees who must perform essential functions in one of our offices;\n● Having employees maintain a distance of at least six feet from other employees whenever possible;\n● Having employees work in dedicated shifts to lower the risk all employees who perform similar tasks might become infected by COVID-19;\n● Having employees stay segregated from other employees in the office with whom they require no interaction; and\n● Requiring employees to wear masks while they are in the office whenever possible.\nNote 2. Going Concern and Management’s Plans\nThe accompanying consolidated financial statements have been prepared on a going concern basis, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business. As of December 31, 2020, the Company had incurred significant operating losses since inception and continues to generate losses from operations. As of December 31, 2020, the Company had an accumulated deficit of $418,389. As of December 31, 2020 MGT’s cash and cash equivalents were $236.\nThe Company will require additional funding to grow its operations. Further, depending upon operational profitability, the Company may also need to raise additional funding for ongoing working capital purposes. There can be no assurance however that the Company will be able to raise additional capital when needed, or at terms deemed acceptable, if at all. The Company’s ability to raise additional capital is impacted by the volatility of Bitcoin mining economics and the SEC’s ongoing enforcement action against our Chief Executive Officer, both of which are highly uncertain, cannot be predicted, and could have an adverse effect on the Company’s business and financial condition.\nSince January 2020, the Company has secured working capital from a PPP loan, the issuance of a convertible note, and the sale of assets.\nSuch factors raise substantial doubt about the Company’s ability to sustain operations for at least one year from the issuance of these consolidated financial statements. The accompanying consolidated financial statements do not include any adjustments related to the recoverability and classification of asset amounts or the classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nNote 3. Summary of Significant Accounting Policies\nPrinciples of consolidation\nThe consolidated financial statements include the accounts of MGT and MGT Sweden AB. All intercompany transactions and balances have been eliminated.\nUse of estimates and assumptions and critical accounting estimates and assumptions\nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities as of the date of the financial statements, and also affect the amounts of revenues and expenses reported for each period. Actual results could differ from those which result from using such estimates. Management utilizes various other estimates, including but not limited to determining the estimated lives of long-lived assets, stock compensation, determining the potential impairment of long-lived assets, the fair value of warrants issued, the fair value of conversion features, the recognition of revenue, the valuation allowance for deferred tax assets and other legal claims and contingencies. The results of any changes in accounting estimates are reflected in the financial statements in the period in which the changes become evident. Estimates and assumptions are reviewed periodically, and the effects of revisions are reflected in the period that they are determined to be necessary.\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Dollars in thousands, except share and per-share amounts)\nCash and cash equivalents\nThe Company considers all highly liquid instruments with an original maturity of three months or less when acquired to be cash equivalents. The Company’s combined accounts were $236 and $216 as of December 31, 2020 and 2019, respectively. Since the FDIC’s insurance coverage is for combined account balances that exceed $250, there is no concentration of credit risks.\nProperty and Equipment\nProperty and equipment are stated at cost less accumulated depreciation. Depreciation is calculated using the straight-line method on the various asset classes over their estimated useful lives, which range from one to ten years when placed in service. The cost of repairs and maintenance is expensed as incurred; major replacements and improvements are capitalized. When assets are retired or disposed of, the cost and accumulated depreciation are removed from the accounts, and any resulting gains or losses are included in income in the year of disposition. Deposits on property and equipment are initially classified as Other Assets and upon delivery, installation and full payment, the assets are classified as property and equipment on the consolidated balance sheet.\nResearch and development\nResearch and development expenses were charged to operations as incurred. No research and development costs were incurred in 2019 and 2020.\nIncome taxes\nThe Company accounts for income taxes in accordance with ASC 740, “Income Taxes”. ASC 740 requires an asset and liability approach for financial accounting and reporting for income taxes and established for all the entities a minimum threshold for financial statement recognition of the benefit of tax positions and requires certain expanded disclosures. The provision for income taxes is based upon income or loss after adjustment for those permanent items that are not considered in the determination of taxable income. Deferred income taxes represent the tax effects of differences between the financial reporting and tax basis of the Company’s assets and liabilities at the enacted tax rates in effect for the years in which the differences are expected to reverse. The Company evaluates the recoverability of deferred tax assets and establishes a valuation allowance when it is more likely than not that some portion or all the deferred tax assets will not be realized. Management makes judgments as to the interpretation of the tax laws that might be challenged upon an audit and cause changes to previous estimates of tax liability. In management’s opinion, adequate provisions for income taxes have been made. If actual taxable income by tax jurisdiction varies from estimates, additional allowances or reversals of reserves may be necessary.\nRevenue recognition\nThe Company’s primary revenue stream is related to the mining of digital currencies. The Company derives its revenue by solving “blocks” to be added to the blockchain and providing transaction verification services within the digital currency network of Bitcoin, commonly termed “cryptocurrency mining.” In consideration for these services, the Company receives digital currency (“Coins”). The Coins are recorded as revenue, using the average spot price of Bitcoin on the date of receipt. The Coins are recorded on the balance sheet as an intangible digital asset valued at the lower of cost or net realizable value. Net realizable value adjustments, to adjust the value of Coins to market value, are included in cost of revenue on the Company’s consolidated statement of operations. Further, any gain or loss on the sale of Coins would be recorded to costs of revenue. Costs of revenue include electricity costs, equipment and infrastructure depreciation, and net realizable value adjustments. During 2019, costs of revenues also included hosting fees based on third-party hosting agreements, all of which were terminated as of December 31, 2019.\nThe Company also recognized revenue from its management agreements through their termination in August and September 2019, as further described in Note 9. The Company received a fee from each management agreement based on the amount of Bitcoin mined, half of the profits and was reimbursed for any electricity costs incurred to run the Bitcoin mining machines it managed in its facilities.\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Dollars in thousands, except share and per-share amounts)\nAdditionally, the Company had machines located in hosted facilities in Ohio and Colorado. The Company received an allocation of profits from these facilities, as further described in Note 9. The Company recorded the net amount of the Bitcoin received as revenue in its statement of operations.\nThe Company also recognizes a royalty participation upon the sale of Pod5ive Containers, manufactured by Bit5ive LLC of Miami, Florida under the terms of a five-year collaboration agreement entered in August 2018.\nLoss per share\nBasic loss per share is calculated by dividing net loss applicable to common shareholders by the weighted average number of common shares outstanding during the period. Diluted loss per share is calculated by dividing the net loss attributable to common shareholders by the sum of the weighted average number of common shares outstanding plus potential dilutive common shares outstanding during the period. Potential dilutive securities, comprised of unvested restricted shares, convertible debt stock warrants, stock options, convertible debt and convertible preferred stock are not reflected in diluted net loss per share because such potential shares are anti-dilutive due to the Company’s net loss.\nAccordingly, the computation of diluted loss per share for the year ended December 31, 2020 excludes 33,333 unvested restricted shares, 9,173,651 shares issuable upon the conversion of convertible debt, and 45,634,921 shares under convertible preferred stock. The computation of diluted loss per share for the year ended December 31, 2019 excludes 650,000 unvested restricted shares, 6,000,000 shares issuable under stock options, 78,050,084 shares issuable upon the conversion of convertible debt, and 96,638,655 shares under convertible preferred stock.\nStock-based compensation\nThe Company applies ASC 718-10, “Share- Based Payment,” which requires the measurement and recognition of compensation expenses for all share based payment awards made to employees and directors including employee stock options under the Company’s stock plans and equity awards issued to non-employees based on estimated fair values.\nASC 718-10 requires companies to estimate the fair value of equity-based option awards on the date of grant using an option-pricing model. The fair value of the award is recognized as an expense on a straight-line basis over the requisite service periods in the Company’s consolidated statements of comprehensive loss.\nRestricted stock awards are granted at the discretion of the compensation committee of the board of directors of the Company (the “Board of Directors”). These awards are restricted as to the transfer of ownership and generally vest over the requisite service periods, typically over a 12 to 24-month period (vesting on a straight-line basis). The fair value of a stock award is equal to the fair market value of a share of the Company’s common stock on the grant date.\nThe fair value of an option award is estimated on the date of grant using the Black-Scholes option valuation model. The Black-Scholes option valuation model requires the development of assumptions that are inputs into the model. These assumptions are the expected stock volatility, the risk-free interest rate, the expected life of the option, the dividend yield on the underlying stock and the expected forfeiture rate. Expected volatility is calculated based on the historical volatility of the Company’s common stock over the expected term of the option. Risk-free interest rates are calculated based on continuously compounded risk-free rates for the appropriate term.\nDetermining the appropriate fair value model and calculating the fair value of equity-based payment awards require the input of the subjective assumptions described above. The assumptions used in calculating the fair value of equity-based payment awards represent management’s best estimates, which involve inherent uncertainties and the application of management’s judgment. The Company is required to estimate the expected forfeiture rate and recognize expense only for those shares expected to vest.\nFair Value Measure and Disclosures\nASC 820 “Fair Value Measurements and Disclosures” provides the framework for measuring fair value. That framework provides a fair value hierarchy that prioritizes the inputs to valuation techniques used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1 measurements) and the lowest priority to unobservable inputs (Level 3 measurements).\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Dollars in thousands, except share and per-share amounts)\nFair value is defined as an exit price, representing the amount that would be received upon the sale of an asset or payment to transfer a liability in an orderly transaction between market participants. Fair value is a market-based measurement that is determined based on assumptions that market participants would use in pricing an asset or liability. A three-tier fair value hierarchy is used to prioritize the inputs in measuring fair value as follows:\n● Level 1 Quoted prices in active markets for identical assets or liabilities.\n● Level 2 Quoted prices for similar assets or liabilities in active markets, quoted prices for identical or similar assets or liabilities in markets that are not active, or other inputs that are observable, either directly or indirectly.\n● Level 3 Significant unobservable inputs that cannot be corroborated by market data.\nAs of December 31, 2020, the Company had a Level 3 financial instrument related to the derivative liability. As of December 31, 2019, the Company had a Level 3 financial instrument related to the management agreement termination liability. Observable transactions are not available to aid in determining the fair value of the management agreement termination liability or the derivative liability. Therefore, the fair value for the management agreement termination liability was determined based on the remaining payments which include two components that are based on market conditions, Bitcoin price and Difficulty Rate, thus requiring the liability to be adjusted to fair value on a periodic basis. The fair value of Bitcoin price and Difficulty Rate are obtained on quoted prices in active markets. The Black-Scholes pricing model was used to determine the fair value of the derivative liability based on volatility, underlying stock price, the conversion price, the term, and the risk-free rate.\nGain (Loss) on Modification/Extinguishment of Debt\nIn accordance with ASC 470, a modification or an exchange of debt instruments that adds or eliminates a conversion option that was substantive at the date of the modification or exchange is considered a substantive change and is measured and accounted for as extinguishment of the original instrument along with the recognition of a gain or loss. Additionally, under ASC 470, a substantive modification of a debt instrument is deemed to have been accomplished with debt instruments that are substantially different if the present value of the cash flows under the terms of the new debt instrument is at least 10 percent different from the present value of the remaining cash flows under the terms of the original instrument. A substantive modification is accounted for as an extinguishment of the original instrument along with the recognition of a gain or loss.\nImpairment of long-lived assets\nLong-lived assets are reviewed for impairment whenever facts or circumstances either internally or externally may suggest that the carrying value of an asset may not be recoverable, should there be an indication of impairment, we test for recoverability by comparing the estimated undiscounted future cash flows expected to result from the use of the asset to the carrying amount of the asset or asset group. Any excess of the carrying value of the asset or asset group over its estimated fair value is recognized as an impairment loss.\nLeases\nEffective January 1, 2019, the Company adopted the guidance of ASC 842, Leases, which requires an entity to recognize a right-of-use asset and a lease liability for virtually all leases. The Company adopted ASC 842 using a modified retrospective approach. The assets and liabilities from operating leases are recognized at the acquisition date based on the present value of remaining lease payments over the lease term using the Company’s secured incremental borrowing rates or implicit rates, when readily determinable. The lease term includes the non-cancellable period of the lease plus any additional periods covered by either an option to extend or not terminate the lease that the Company is reasonably certain to exercise, or any option to extend or not to terminate a lease controlled by the lessor. The adoption of ASC 842 on January 1, 2019 did not have a material affect on the Company’s financial statements.\nEquity-linked instruments\nThe Company accounts for equity-linked instruments with certain anti-dilution provisions in accordance with ASC 815 and ASC 260. Under this guidance, the Company excludes instruments with certain down round features when determining whether a financial instrument (or embedded conversion feature) is considered indexed to the Company’s own stock. As a result, financial instruments (or embedded conversion features) with down round features are not required to be classified as derivative liabilities. The Company recognizes the value of a down round feature only when it is triggered and the exercise or conversion price has been adjusted downward. For equity-classified freestanding financial instruments, such as warrants, the Company treats the value of the effect of the down round, when triggered, as a deemed dividend and a reduction of income available to common stockholders in computing basic earnings per share. For convertible instruments with embedded conversion features containing down round provisions, the Company recognizes the value of the down round as a beneficial conversion discount to be amortized to earnings.\nAny incentive-based compensation received by the Optionee from the Company hereunder or otherwise shall be subject to recovery by the Company in the circumstances and manner provided in any Incentive-based Compensation Recovery that may be adopted or implemented by the Company and in effect from time to time on or after the date hereof, and Optionee shall effectuate any such recovery at such time and in such manner as the Company may specify.\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Dollars in thousands, except share and per-share amounts)\nDerivative Instruments\nDerivative financial instruments are recorded in the accompanying consolidated balance sheets at fair value in accordance with ASC 815. When the Company enters into a financial instrument such as a debt or equity agreement (the “host contract”), the Company assesses whether the economic characteristics of any embedded features are clearly and closely related to the primary economic characteristics of the remainder of the host contract. When it is determined that (i) an embedded feature possesses economic characteristics that are not clearly and closely related to the primary economic characteristics of the host contract, and (ii) a separate, stand-alone instrument with the same terms would meet the definition of a financial derivative instrument, then the embedded feature is bifurcated from the host contract and accounted for as a derivative instrument. The estimated fair value of the derivative feature is recorded in the accompanying consolidated balance sheets separately from the carrying value of the host contract. Subsequent changes in the estimated fair value of derivatives are recorded as a gain or loss in the Company’s consolidated statements of operations.\nManagement’s evaluation of subsequent events\nThe Company evaluates events that have occurred after the balance sheet date but before the financial statements are issued. Based upon the review, other than what is described in Note 12 - Subsequent Events, the Company did not identify any recognized or non-recognized subsequent events that would have required adjustment or disclosure in the consolidated financial statements.\nDigital Currencies\nDigital currencies are included in current assets in the consolidated balance sheets. Digital currencies are recorded at the lower of cost or net realizable value.\nNet realizable value adjustments, to adjust the value of Coins to market value, are included in cost of revenue on the Company’s consolidated statement of operations. Further, any gain or loss on the sale of Coins would be recorded to costs of revenue. Costs of revenue include hosting fees, equipment and infrastructure depreciation, net realizable value adjustments, and electricity costs.\nHalving - The Bitcoin blockchain and the cryptocurrency reward for solving a block is subject to periodic incremental halving. Halving is a process designed to control the overall supply and reduce the risk of inflation in cryptocurrencies using a Proof-of-Work consensus algorithm. At a predetermined block, the mining reward is cut in half, hence the term “Halving.” A Halving for bitcoin occurred on May 12, 2020. Many factors influence the price of Bitcoin and potential increases or decreases in prices in advance of or following a future halving is unknown.\nThe following table presents the activities of digital currencies for the years ended December 31, 2020 and 2019:\nDigital currencies at January 1, 2019 $ 30\nAdditions of digital currencies from mining\nPayment of digital currencies to management partners (198 )\nRealized gain on sale of digital currencies\nNet realizable value adjustment (22 )\nSale of digital currencies (674 )\nDigital currencies at December 31, 2019\nAdditions of digital currencies from mining 1,434\nAdditions of digital currencies from the sale of property and equipment\nPayment of digital currencies to management partners (90 )\nRealized gain on sale of digital currencies\nNet realizable value adjustment (2 )\nSale of digital currencies (1,438 )\nDigital currencies at December 31, 2020 $ 4\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Dollars in thousands, except share and per-share amounts)\nRecent accounting pronouncements\nManagement does not believe that any recently issued, but not yet effective accounting pronouncements, when adopted, will have a material effect on the accompanying consolidated financial statements, other than those disclosed below.\nIn August 2020, the FASB issued Accounting Standards Update (“ASU”) 2020-06, “Debt - Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging - Contracts in Entity’s Own Equity (Subtopic 815 - 40)” (“ASU 2020-06”). ASU 2020-06 simplifies the accounting for certain financial instruments with characteristics of liabilities and equity, including convertible instruments and contracts on an entity’s own equity. The ASU is part of the FASB’s simplification initiative, which aims to reduce unnecessary complexity in U.S. GAAP. The ASU’s amendments are effective for fiscal years beginning after December 15, 2023, and interim periods within those fiscal years. The Company is currently evaluating the impact ASU 2020-06 will have on its financial statements.\nIn June 2020, the American Institute of Certified Public Accountants in conjunction with the Financial Accounting Standards Board developed Technical Question and Answer (“TQA”) 3200.18, “Borrower Accounting for a Forgivable Loan Received Under the Small Business Administration Paycheck Protection Program”, which is intended to provide clarification on how to account for loans received from the PPP. TQA 3200.18 states that an entity may account for PPP loans under ASC 470, “Debt” or, if the entity is expected to meet PPP eligibility criteria and the PPP loan is expected to be forgiven, the entity may account for the loans under IAS 20, “Accounting for Government Grants and Disclosure of Government Assistance”. The Company has elected to account for PPP loan proceeds under IAS 20 as allowed by TQA 3200.18.\nNote 4. Property, Plant, and Equipment and Other Assets\nProperty and equipment consisted of the following:\nAs of\nDecember 31, 2020 December 31, 2019\nLand $ 57 $ 57\nComputer hardware and software\nBitcoin mining machines 1,206 2,313\nInfrastructure\nContainers\nLeasehold improvements -\nProperty and equipment, gross 2,732 3,618\nLess: Accumulated depreciation (860 ) (82 )\nProperty and equipment, net $ 1,872 $ 3,536\nThe Company recorded depreciation expense of $1,102 and $170 for the years ended December 31, 2020 and 2019, respectively. For the year ended December 31, 2020 a loss on sale of property and equipment of $352 was recorded as other non-operating expense related to the sale and disposition of Antminer S17 Pro Bitcoin miners. For the year ended December 31, 2019 a gain on sale of property and equipment of $599 was recorded as other non-operating income related to the sale and disposition of Antminer S9 Bitcoin miners. For the year ended December 31, 2020 an impairment of mining assets of $49 was recorded as general and administrative expense related to the disposal of Antminer S17 Pro Bitcoin miners.\nDuring the year ended December 31, 2019, the Company recorded an impairment charge of $64 in connection with the termination of its hosting agreement in Ohio. See Note 9 for a further description of this termination.\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Dollars in thousands, except share and per-share amounts)\nOther assets consisted of the following:\nAs of\nDecember 31, 2020 December 31, 2019\nDeposits on containers $ - $ 203\nSecurity deposits\nOther Assets $ 123 $ 321\nDuring September 2019, the Company entered into an agreement to purchase two containers to house the Bitcoin mining machines and paid a deposit of $203. Full payment on these containers was made upon delivery and installation in January 2020, at which time the cost of containers was reclassified to property and equipment and depreciated over the estimated useful life of 5 years using the straight-line method. The Company has paid $120 in security deposits related to its electrical contract, see Note 9, and $3 related to its office lease in Raleigh, NC.\nNote 5. Notes Payable\nMay 2018 Notes\nOn May 23, 2018, the Company entered into a securities purchase agreement with two accredited investors, pursuant to which the Company issued $840 in unsecured promissory notes for aggregate consideration of $700 (the “May 2018 Notes”), with an initial maturity date of March 23, 2019. On January 7, 2019, and again on March 28, 2019 the Company entered into an amendment to one of the May 2018 Notes, whereby the parties agreed to extend the maturity date of the note to July 15, 2019, agreed to forego certain monthly installments, and agreed prospective installments were to be paid in cash unless the Company elected to make payments in shares of the Company’s common stock, at a price equal to the lowest VWAP of the Company’s common stock during the preceding twenty trading days multiplied by 70%, or any lower price made available to any other holder of the Company’s securities. In consideration of these amendments, the Company incurred extension fees of $121. Because these amendments were considered substantive changes, the Company accounted for the modifications as extinguishments of debt and recorded a gain $320 during the year ended December 31, 2019.\nOn April 9, 2019, the Company entered into an amendment to another of its May 2018 Notes, whereby the parties agreed to extend the maturity date of the note to August 15, 2019, agreed to forego certain monthly installments, and provided a substantial conversion feature allowing the lender, in its sole discretion, the right to convert prospective installments into shares of the Company’s common stock, at a price equal to the lowest intra-day price of the Company’s common stock during the preceding twenty trading days multiplied by 70%, or any lower price made available to any other holder of the Company’s securities. In consideration of this amendment, the Company incurred an extension fee of $50. Because this amendment was considered a substantive change, the Company accounted for this modification as an extinguishment of debt and recorded a gain $127 during the year ended December 31, 2019.\nOn May 10, 2019, the original holders of the Company’s May 2018 Notes assigned and sold all notes to Oasis Capital, LLC (“Oasis Capital”). On the same date, the Company and Oasis Capital executed a letter agreement to amend the terms to allow Oasis Capital to convert the total outstanding principal amount of $421 into shares of the Company’s common stock, at a price equal to the lowest trading price of the Company’s common stock during the preceding twenty trading days multiplied by 70%, or any lower price made available to any other holder of the Company’s securities. On May 15, 2019, Oasis executed a full conversion of the May 2018 Notes and was issued 10,568,087 shares of the Company’s common stock.\nJune 2018 Note\nOn June 1, 2018, the Company entered into a note purchase agreement with an accredited investor, pursuant to which the Company issued an unsecured promissory note in the amount of $3,600 (the “June 2018 Note”) for consideration of $3,000. The outstanding balance was to be made in nine equal monthly installments beginning August 1, 2018, with an initial maturity date of April 1, 2019, with no prepayment penalty. Upon an event of default, the outstanding balance of the promissory note would immediately increase by 120% and become immediately due and payable. Prior to 2019, this note was amended twice.\nOn January 28, 2019, the Company entered into a third amendment, whereby the parties agreed to extend the maturity date to October 1, 2019 and to forego certain monthly installments. The parties also agreed the Company would pay all installments in cash unless both the Company and the lender agreed to make payments in shares of the Company’s common stock, at a price equal to the lowest intra-day trade price of the Company’s common stock during the preceding twenty trading days multiplied by 70%. In consideration of this amendment, the Company incurred an extension fee of $527. The Company accounted for this amendment as an extinguishment of debt and recorded a gain of $991 during the year ended December 31, 2019.\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Dollars in thousands, except share and per-share amounts)\nOn May 10, 2019, the Company entered into a fourth amendment, allowing the lender to convert the total outstanding principal amount of $3,159 into shares of the Company’s common stock, at a price equal the lowest intra-day trade price of the Company’s common stock during the preceding twenty trading days multiplied by 70%, or any lower price made available to any other holder of the Company’s securities. This amendment also eliminated the Company’s mandatory monthly amortization payments and extended the maturity to December 15, 2019. After such date, and within 10 business days, any outstanding balance shall be satisfied, at the Company’s election, either with cash, common stock conversion, or any combination thereof. The Company accounted for this amendment as an extinguishment of debt and recorded a gain $1,310 during the year ended December 31, 2019.\nOn December 31, 2019, the Company entered into a fifth amendment extending the maturity date to June 30, 2020 and deleting in its entirety, the requirement to settle the outstanding balance with cash, common stock conversion or any combination thereof, no later than December 15, 2019. An extension fee of $84 was added to the outstanding balance bringing the total outstanding principal balance to $929 as of December 31, 2019. The Company accounted for this amendment as an extinguishment of debt and recorded a gain of $792 during the year ended December 31, 2019. In connection with recording the new debt, the Company recorded debt discount of $877 including both (i) the time value of money and (ii) the discount related to the conversion feature underlying the debt instrument. The Company obtained a waiver from the holder of the June 2018 Note.\nThe holder of the June 2018 Note also acquired 17,500,000 shares of the Company’s common stock on April 12, 2019, and is an affiliate of the acquirer of 160 shares of Series C Convertible Preferred Stock with a par value of $0.001 and a stated value of $10,000 per share (“Preferred Shares”) acquired during 2019, of which 115 Preferred Shares remain outstanding as of December 31, 2020. See Note 7 below for a further description of the Preferred Shares. The holder of the June 2018 Note and its affiliates are collectively subject to a maximum beneficial ownership of 9.99%.\nOn July 28, 2020, the holder of the June 2018 Note converted $154 of debt principal into 17,164,732 shares of common stock, reducing the outstanding principal to zero.\nDuring the year ended December 31, 2020, the Company issued 93,078,492 shares of its common stock upon the conversion of $929 in outstanding principal, reducing the outstanding principal balance to $0 as of December 31, 2020.\nDecember 2018 Note\nOn December 6, 2018, the Company entered into a note purchase agreement with an accredited investor, pursuant to which the Company issued an unsecured promissory note in the amount of $598 (the “December 2018 Note”) for consideration of $500, with an interest rate of 8% per annum and a maturity date of May 6, 2019. The note was paid in full in March 2019.\nDecember 2020 Note\nOn December 8, 2020, the Company entered into a securities purchase agreement pursuant to which it issued a convertible promissory note in the principal amount of $230 which is convertible, at the option of the holder, into shares of common stock at a conversion price equal to 70% of the lowest price for a share of Common Stock during the ten trading days immediately preceding the applicable conversion. The Company received consideration of $200 for the convertible promissory note. The note bears interest at a rate of 8% per annum and matures in twelve months.\nThe Company determined that the embedded conversion feature of the convertible promissory note meets the definition of a beneficial conversion feature and a derivative liability which is accounted for separately. The Company measured the beneficial conversion feature’s intrinsic value on December 8, 2020 and determined that the beneficial conversion feature was valued at $200 which was recorded as a debt discount, and together with the original issue discount of $30, in the aggregate of $230, is being amortized over the life of the loan. The Company measured the derivative liability’s fair value on December 8, 2020 and determined that the derivative liability was valued at $555 which exceeded the intrinsic value of the beneficial conversion feature by $355 and resulted in the Company recording non-cash interest expense of $355. As of December 31, 2020, the fair value of the derivative liability was $246 and for the year ended December 31, 2020 the Company recorded a gain of $309 from the change in fair value of derivative liability as non-operating income in the consolidated statements of operations. The Company valued the derivative liability using the Black-Scholes option pricing model using the following assumptions as of December 8, 2020 and December 31, 2020, respectively: 1) stock prices of $0.027 and $0.04, 2) conversion prices of $0.009 and $0.025, 3) remaining lives of 1 year and 0.94 years, 4) dividend yields of 0%, 5) risk free rates of 0.10%, and 6) volatility of 158.55% and 167.36%.\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Dollars in thousands, except share and per-share amounts)\nThe Company’s activity in its derivative liability was as follows for the year ended December 31, 2020:\nBalance of derivative liability at January 1, $ -\nTransfers in due to issuance of convertible notes with embedded conversion provisions\nChange in fair value recognized in non-operating income (expense) (309 )\nBalance of derivative liability at December 31, 2020 $ 246\nThe Company did not have any derivative liability activity during the year ended December 31, 2019.\nFluctuations in the Company’s stock price are a primary driver for the changes in the derivative valuations during each reporting period. As the stock price increases for each of the related derivative instruments, the value to the holder of the instrument generally increases, therefore increasing the liability on the Company’s balance sheet. Additionally, stock price volatility is one of the significant unobservable inputs used in the fair value measurement of each of the Company’s derivative instruments. The simulated fair value of these liabilities is sensitive to changes in the Company’s expected volatility. Increases in expected volatility would generally result in higher fair value measurement. A 10% change in pricing inputs and changes in volatilities and correlation factors would not result in a material change in our Level 3 fair value.\nThe following table summarizes the Company’s derivative as of December 31, 2020:\nDecember 31, 2020\nLevel Level Level Fair Value\nLiabilities\nDerivative liability $ - $ - $ 246 $ 246\nThe PPP Loan\nOn April 16, 2020, the Company entered into a promissory note with Aquesta Bank for $111 in connection with the Paycheck Protection Program (“PPP”) offered by the U.S. Small Business Administration (the “PPP Loan”). The PPP Loan bears interest at 1% per annum, with monthly installments of $6 commencing on November 1, 2021 for 18 months through its maturity on April 1, 2023. The principal amount of the PPP Loan will be forgiven if the loan proceeds are used to pay for payroll costs, rent and utilities costs over the 24-week period after the PPP Loan is made. Not more than 40% of the forgiven amount may be used for non-payroll costs. The amount of the PPP Loan forgiveness may be reduced if the Company reduces its full-time head count. On April 1, 2021, the Company received notice of forgiveness in the amount of $108 in relation to the PPP Loan. The Company used all proceeds from the PPP Loan to maintain payroll and other allowable expenses. As a result, management believes that the Company has met the PPP eligibility criteria for forgiveness for the remaining payable of $3 to the SBA and has concluded that the PPP Loan represents, in substance, a government grant that is expected to be forgiven in its entirety. As such, in accordance with International Accounting Standards (“IAS”) 20, “Accounting for Government Grants and Disclosure of Government Assistance,” the Company has recognized the entire PPP Loan amount of $111 as grant income, which is included in other non-operating income (expense) in the consolidated statement of operations for the year ended December 31, 2020.\nNotes payable consisted of the following:\nAs of December 31, 2020\nPrincipal Discount Net\nTotal notes payable-December 2020 Note $ 230 $ 225 $ 5\nAs of December 31, 2019\nPrincipal Discount Net\nTotal notes payable-June 2018 Note $ 929 $ (877 ) $ 52\nDuring the years ended December 31, 2020 and 2019, the Company recorded accretion of debt discount of $882 and $5,605, respectively.\nAs of December 31, 2020, all of the May 2018, June 2018 and December 2018 Notes have been extinguished.\nNote 6. Leases\nIn December 2019, the Company entered a new office lease in connection with the relocation of its executive office to Raleigh, North Carolina. The Company accounted for its new office lease as an operating lease under the guidance of Topic 842. Rent expense under the new lease is $3 per month, with annual increases of 3% during the three-year term. The Company used an incremental borrowing rate of 29.91% based on the weighted average effective interest rate of its outstanding debt. In December 2019, the Company recorded a Right of Use Asset of $79 and a corresponding Lease Liability of $79. The Right to Use Asset is accounted for as an operating lease and has a balance, net of amortization, of $56 as of December 31, 2020.\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Dollars in thousands, except share and per-share amounts)\nTotal future minimum payments required under the lease agreement are as follows:\nAmount\n$ 38\nTotal undiscounted minimum future lease payments $ 76\nLess Imputed interest (20 )\nPresent value of operating lease liabilities $ 56\nDisclosed as:\nCurrent portion $ 23\nNon-current portion\nThe Company’s former executive office was located in Durham, North Carolina under a sublease agreement that was terminated in December 2019, with monthly rent of $7 in the final year of the sublease agreement. The Company recorded rent expense of $36 and $64 for the years ended December 31, 2020 and 2019, respectively.\nAt December 31, 2020, the weighted average remaining lease term for the operating lease was 2.0 years. The Company’s lease agreement does not contain any material residual value guarantees or material restrictive covenants.\nNote 7. Common Stock and Preferred Stock\nCommon stock\nEquity Purchase Agreement under Form S-3\nOn August 30, 2018, the Company and L2 Capital, LLC (“L2 Capital”) entered into an equity purchase agreement, which was later amended on November 30, 2018, whereby the Company could issue and sell to L2 Capital from time to time up to $50,000 of the Company’s common stock that was registered with the SEC under a registration statement on Form S-3. Subject to the terms of the equity purchase agreement, the Company provided notices (a “Put Notice”) requiring L2 Capital to purchase a number of shares (the “Put Shares”) of the common stock equal to the lesser of $500 and 200% of the average trading volume of the common stock in the ten trading days immediately preceding the date of such Put Notice. The terms also provided the purchase price for such Put Shares to be the lowest traded price on a principal market for any trading day during the five trading days either following or beginning on the date on which L2 Capital receives delivery of the Put Shares, multiplied by 95.0%.\nDuring the year ended December 31, 2019, the Company issued 67,000,000 shares of its common stock in exchange for $3,681, net of issuance cost of $50.\nOn April 16, 2019, the Company became ineligible to issue shares under its registration statement on Form S-3 as the aggregate market value of the Company’s common stock held by non-affiliates was below the regulatory threshold of $75,000. In connection with this ineligibility, the equity purchase agreement was terminated.\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Dollars in thousands, except share and per-share amounts)\nEquity Purchase Agreement under Form S-1\nOn June 3, 2019, the Company entered into an equity purchase agreement with Oasis Capital, whereby the Company had the right, but not the obligation, to direct Oasis Capital to purchase shares of the Company’s common stock (the “New Put Shares”) in an amount in each instance up to the lesser of $1,000 or 250% of the average daily trading volume by delivering a notice to Oasis Capital (the “New Put Notice”). The purchase price (the “Purchase Price”) for the New Put Shares shall equal 95% of the one lowest daily volume weighted average price on a principal market during the five trading days immediately following the date Oasis receives the New Put Shares via DWAC associated with the applicable New Put Notice (the “Valuation Period”). The closing of a New Put Notice shall occur within one trading day following the end of the respective Valuation Period, whereby (i) Oasis shall deliver the Investment Amount (as defined below) to the Company by wire transfer of immediately available funds and (ii) Oasis shall return surplus New Put Shares if the value of the New Put Shares delivered to Oasis causes the Company to exceed the maximum commitment amount. The Company shall not deliver another New Put Notice to Oasis within ten trading days of a prior New Put Notice. The “Investment Amount” means the aggregate Purchase Price for the New Put Shares purchased by Oasis, minus clearing costs payable to Oasis’s broker or to the Company’s transfer agent for the issuance of the New Put Shares. The shares issuable under the equity purchase agreement are registered with the SEC under a registration statement on Form S-1 that was declared effective on June 25, 2019 covering up to 76,558,643 shares of common stock (the “S-1”) and are subject to a maximum beneficial ownership by Oasis Capital of 9.99%.\nThrough December 31, 2019, the Company sold 52,000,000 shares of its common stock under the Form S-1 for net proceeds of $1,654, net of deferred offering costs of $70 and transaction clearing fees of $30 and no shares were sold during the year ended December 31, 2020.\nBy way of a post-effective amendment on June 25, 2020, the company filed to terminate the effectiveness of the S-1 and to deregister all shares of common stock that remained unsold. The SEC permitted this post-effective amendment to go effective July 2, 2020.\nOther Common Stock Issuances\nOn April 12, 2019, the Company entered into a purchase agreement with an accredited investor whereby it sold 17,500,000 shares of its common stock for $525 pursuant to the Company’s then-effective registration statement on Form S-3. The holder of these shares is also the holder of the June 2018 Note and an affiliate of the acquirer of 150 shares of the Preferred Shares acquired on April 12, 2019 described below.\nDuring the year ended December 31, 2019, the Company issued 160,500 shares of its common stock, to consultants in exchange for services. These services were valued at $60 during 2019 based upon the value of the shares issued. No shares were issued to consultants during the year ended December 31, 2020.\nIn connection with the termination of its management agreements, see Note 9 below, the Company issued 10,250,000 shares of its common stock to acquire 2,000 S9 miners from the third-party investors. The S9 miners were valued at $311, based on the trading value of the Company’s common stock on the date each management agreement was terminated.\nPreferred Stock\nOn January 11, 2019, the Company’s Board of Directors approved the authorization of 10,000 shares of Series B Preferred Stock with a par value of $0.001 and a Stated Value of $100 each (“Series B Preferred Shares”). The holders of the Series B Preferred Shares shall be entitled to receive, when, as, and if declared by the Board of Directors of the Company, out of funds legally available for such purpose, dividends in cash at the rate of 12% of the Stated Value per annum on each Series B Preferred Share. Such dividends shall be cumulative and shall accrue without interest from the date of issuance of the respective share of the Series B Preferred Shares. Each holder shall also be entitled to vote on all matters submitted to stockholders of the Company and shall be entitled to 55,000 votes for each Series B Preferred Share owned at the record date for the determination of stockholders entitled to vote on such matter or, if no such record date is established, at the date such vote is taken or any written consent of stockholders is solicited. In the event of a liquidation event, any holders of the Series B Preferred Shares shall be entitled to receive, for each Series B Preferred Shares, the Stated Value in cash out of the assets of the Company, whether from capital or from earnings available for distribution to its stockholders. The Series B Preferred Shares are not convertible into shares of the Company’s common stock. No shares of Series B Preferred Shares have been issued or are outstanding.\nOn April 12, 2019, the Company’s Board of Directors approved the authorization of 200 Series C Preferred Shares with a par value of $0.001 (“Series C Preferred Shares”). The holders of the Series C Preferred Shares have no voting rights, receive no dividends, and are entitled to a liquidation preference equal to the stated value. At any time, the Company may redeem the Series C Preferred Shares at 1.2 times the stated value. Given the right of redemption is solely at the option of the Company, the Series C Preferred Shares are not considered mandatorily redeemable, and as such are classified in shareholders’ equity on the Company’s consolidated balance sheet.\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Dollars in thousands, except share and per-share amounts)\nEach Series C Preferred Share is convertible into shares of the Company’s common stock in an amount equal to the greater of: (a) 200,000 shares of common stock or (b) the amount derived by dividing the stated value by the product of 0.7 times the market price of the Company’s common stock, defined as the lowest trading price of the Company’s common stock during the ten day period preceding the conversion date. The holder may not convert any Series C Preferred Shares if the total amount of shares held, together with holdings of its affiliates, following a conversion exceeds 9.99% of the Company’s common stock.\nThe common shares issued upon conversion of the Series C Preferred Shares have been registered under the Company’s then-effective registration statement on Form S-3. On April 12, 2019, the Company sold 190 Series C Preferred Shares for $1,890, net of issuance costs and on July 15, 2019 sold 10 Series C Preferred Shares for $100. During the second and third quarters of 2019, holders converted 50 Series C Preferred Shares into 14,077,092 shares of common stock and 35 Series C Preferred Shares into 13,528,575 shares of common stock, respectively. 115 shares of Series C Preferred Stock are issued and outstanding as of December 31, 2020.\nUpon issuance of the Series C Preferred Shares during the second and third quarters of 2019, the Company recorded a deemed dividend based on the beneficial conversion feature underlying the Preferred Shares, measured as the difference between the conversion price of the Series C Preferred Shares and the fair value of the underlying common stock Accordingly, on April 12, 2019 and for the July 2019 issuances, the Company recorded deemed dividends of $959 and $46, respectively.\nWarrants\nThe Company did not have any warrant activity during the year ended December 31, 2020.\nThe following table summarizes information about shares issuable under warrants outstanding during the year ended December 31, 2019:\nWarrant\nshares\noutstanding Weighted\naverage\nexercise price Weighted average remaining life Intrinsic value\nOutstanding at January 1, 5,477,975 $ 1.01\nIssued - -\nExercised (4,000,000 ) $ 1.12\nExpired or cancelled (1,477,975 ) $ 0.72\nOutstanding and exercisable at December 31, 2019 - $ - - $ -\nOn June 5, 2019, the Company entered into an agreement with a holder of a warrant for 10,000 shares of common stock, whereby the holder agreed to sell the warrant back to the Company for a nominal amount. The Company cancelled the warrant.\nOn May 9, 2019, the Company entered into a modification agreement with the holder of six separate warrants. Under the terms of the initial warrant agreements, the holder was entitled to purchase 4,000,000 shares of the Company’s common stock at prices of between $0.50 per share and $2.00 per share at various times through September 2022. Under the terms of the modification agreement, the holder was permitted to exercise all 4,000,000 warrants at a price of $0.03 per share, or $120. The Company accounted for this modification as a down-round feature under the guidance of ASC 260-10-30, whereby the change in fair value of the warrants before and after the down-round was triggered was recorded as a deemed dividend in the amount of $100.\nDuring August and September 2019, the Company entered into agreements with three holders of warrants for 1,450,000 shares of common stock, whereby the holders agreed to sell the warrants back to the Company for $14. The Company subsequently cancelled these warrants, as well as 17,975 warrants for no consideration, and there are no outstanding warrants as of December 31, 2019.\nNote 8. Stock-Based Compensation\nIssuance of restricted common stock - directors, officers and employees\nThe Company’s activity in restricted common stock was as follows for the years ended December 31, 2020:\nNon-vested at January 1, 2020 650,000 $ 1.24\nGranted - $ -\nVested (616,667 ) $ 1.48\nNon-vested at December 31, 2020 33,333 $ .04\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Dollars in thousands, except share and per-share amounts)\nThe Company’s activity in restricted common stock was as follows for the year ended December 31, 2019:\nNumber of shares Weighted average\ngrant date fair\nvalue\nNon-vested at January 1, 2019 3,355,000 $ 1.46\nGranted 100,000 $ 0.04\nVested (2,805,000 ) $ 1.30\nNon-vested at December 31, 2019 650,000 $ 1.24\nFor the years ended December 31, 2020 and 2019, the Company has recorded $222 and $2,249, in employee and director stock-based compensation expense, which is a component of general and administrative expenses in the consolidated statement of operations.\nAs of December 31, 2020, unamortized stock-based compensation costs related to restricted share arrangements was under $1.\nStock options\nAs of December 31, 2019, the Company had 6,000,000 outstanding stock options with a weighted average exercise price of $0.71 and a weighted average grant date fair value of $1.29. All the stock options were fully vested and there were no unrecognized costs. Under the terms of the stock option agreement, all options expired on January 31, 2020. As of December 31, 2020, there are no outstanding or exercisable stock options.\nNote 9. Commitments and Contingencies\nThe Company may incur legal expenses related to the indemnification of our Chief Executive Officer in relation to the SEC Action. During the year ending December 31, 2020, the Company has recorded $200 as general and administrative expense related to ongoing legal matters related to this action.\nBitcoin Production Equipment and Operations\nIn August 2018, the Company entered a collaborative venture with Bit5ive, LLC to develop a fully contained crypto currency mining pod (the “POD5 Agreement”) for a term of five years. Pursuant to the POD5 Agreement, the Company assists with the design and development of the POD5 Containers. The Company retains naming rights to the pods and receives royalty payments from Bit5ive, LLC in exchange for providing capital as well as engineering and design expertise. During the years ended December 31, 2020 and 2019, the Company recognized revenue of $3 and $44 under this agreement, respectively.\nElectricity Contract\nIn June 2019, the Company entered into a contract for electric power with the City of Lafayette, Georgia, a municipal corporation of the State of Georgia (“the City”). The Company makes monthly payments based upon electricity consumed, at a negotiated kilowatt per hour rate, inclusive of transmission charges and exclusive of state and local sales taxes. Over time, the Company is entitled to utilize a load of 10 megawatts. For each month, the Company estimates its expected electric load, and should the actual load drop below 90% of this estimate, the City reserves the right to impose a modest penalty to the hourly kilowatt rate for electricity consumed.\nIn connection with this agreement, the Company paid a $154 security deposit, which was reduced to $120 in June 2020. The new amount is classified as Other Assets in the Company’s consolidated balance sheet as of December 31, 2020.\nThis agreement expires on September 30, 2021, and the Company will shortly begin negotiations for an extension or new contract. There can be no assurance that that the Company and City will reach agreement with acceptable price and volume metrics, if at all.\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Dollars in thousands, except share and per-share amounts)\nManagement Agreement Termination Liability\nOn August 31, 2019, the Company entered into two Settlement and Termination Agreements (the “Settlement Agreements”) to management agreements it entered in 2017 with two accredited investors (together the “Users”). Under the terms of the Settlement Agreements, the Company paid the Users a percentage of profits (“Settlement Distribution”) of Bitcoin mining as defined in the Settlement Agreements. The estimated present value of the Settlement Distributions of $337 was recorded as termination expense with an offsetting liability on August 31, 2019. Since two of the components of the Settlement Distribution, Bitcoin price and Difficulty Rate, as defined in the Settlement Agreements, are based on market conditions, the liability was adjusted to fair value on a quarterly basis and any changes were recorded in the statement of operations. As such, the liability is considered a Level 3 financial instrument. During 2019, the Company recognized a gain on the change in the fair value of $176 based on the change of Bitcoin price and Difficulty Rate, and along with the monthly Settlement Distributions valued at $45, the liability was reduced to $116 as of December 31, 2019. During the year ended December 31, 2020, the Company recognized a gain on the change in the fair value of $26 based on the change of Bitcoin price and Difficulty Rate, and along with the Settlement Distributions valued at $90, the liability was reduced to $0 as of December 31, 2020. Pursuant to the terms of the Settlement Agreements, Settlement Distributions terminated on September 30, 2020.\nTermination liability at January 1, 2019 $ -\nAdditions to liability\nChange in fair value recognized in non-operating income (expense) (176 )\nSettlement distributions (46 )\nTermination liability at December 31, 2019\nChange in fair value recognized in non-operating income (expense) (26 )\nSettlement distributions (90 )\nTermination liability at December 31, 2020 $ -\nLegal\nThe Company has resolved all shareholder legal actions formerly pending in state and federal courts.\nOn January 24, 2017, the Company was served with a summons and complaint filed by plaintiff shareholder Atul Ojha in New York state court against certain officers and directors of the Company and naming the Company as a nominal defendant. The lawsuit is styled as a derivative action (the “Ojha Derivative Action”) and was originally filed (but not served on any defendant) on October 15, 2016. The Ojha Derivative Action substantively alleges that the defendants, collectively or individually, inadequately managed the business and assets of the Company resulting in the deterioration of the Company’s financial condition. The Ojha Derivative Action asserts claims including, but not limited to, breach of fiduciary duties, unjust enrichment and waste of corporate assets.\nOn December 12, 2018, a shareholder derivative action was filed by shareholder Bob Thomas against certain current and former directors, officers and shareholders of the Company, and naming the Company as a nominal defendant, in New York state court, alleging breach of fiduciary duties, unjust enrichment, abuse of control, gross mismanagement, and waste and seeking declaratory relief and damages (the “Thomas Derivative Action”). The underlying allegations in the Thomas Derivative Action largely repeat the allegations of wrongdoing in the 2018 Securities Class Actions (as defined below).\nOn April 23, 2020, the Company entered into a stipulation of settlement (the “Stipulation”) in connection with the Ojha Derivative Action and the Thomas Derivative Action (together, the “State Derivative Actions”). The consideration for the settlement of the Derivative Actions is as follows: (i) adoption by the Company of certain corporate governance reforms, the terms of which are fully set forth in Exhibits A and B to the Stipulation; (ii) Robert B. Ladd, H. Robert Holmes, Michael Onghai, and Nolan Bushnell shall collectively pay or cause to be paid $75 to the Company; and (iii) Barry C. Honig, John Stetson, Michael Brauser, John O’Rourke III, and Mark Groussman shall collectively pay or cause to be paid $150 to the Company. Further, the Company shall, subject to court approval, pay a fee and expense award to plaintiffs’ counsel in the Derivative Actions of $150 and service awards to each of the two plaintiffs in the Derivative Actions of $1.5 each, to be paid from the fee and expense award. On April 24, 2020, the New York state court entered an order preliminarily approving the Stipulation and the settlement contemplated therein and providing for the notice of the settlement to be made to current MGT Stockholders. The Preliminary Approval Order further provided for a Court hearing on the settlement on June 26, 2020. On May 4, 2020, pursuant to the Preliminary Approval Order, MGT provided notice of the settlement on its website, by press release and by filing a Form 8-K with the Securities and Exchange Commission.\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Dollars in thousands, except share and per-share amounts)\nFinal approval of the settlement of the State Derivative Actions was granted on July 2, 2020.\nOn August 28, 2019, a shareholder derivative action was filed by shareholder Tyler Tomczak against the certain directors, officers and shareholders of the Company, and naming the Company as a nominal defendant, in the United States District Court for the Southern District of New York, alleging breach of fiduciary duties, waste and unjust enrichment and seeking declaratory relief and damages (the “Tomczak Derivative Action”). The underlying allegations in the Tomczak Derivative Action largely repeat the allegations of wrongdoing in the 2018 Securities Class Actions.\nOn September 11, 2019, a shareholder derivative action was filed by shareholder Arthur Aviles against certain directors, officers and shareholders of the Company, and naming the Company as a nominal defendant, in the United States District Court for the District of Delaware, alleging breach of fiduciary duties, waste and unjust enrichment and seeking declaratory relief and damages (the “Aviles Derivative Action”). The underlying allegations in the Aviles Derivative Action largely repeat the allegations of wrongdoing in the 2018 Securities Class Actions.\nOn May 7, 2020, the Company entered into a stipulation of settlement (the “Federal Stipulation”) in connection with the Tomczak Derivative Action and the Aviles Derivative Action (together, the “Federal Derivative Actions”). The consideration for the settlement of the Federal Derivative Actions is as follows: (i) adoption by the Company of a certain corporate governance reform, the terms of which are fully set forth in Exhibit A to the Federal Stipulation; and (ii) Robert B. Ladd, H. Robert Holmes, and Michael Onghai shall collectively pay or cause to be paid $65 to the Company. Further, the Company shall, subject to court approval, pay a fee and expense award to plaintiffs’ counsel in the Federal Derivative Actions of $30 and incentive awards to each of the two plaintiffs in the Federal Derivative Actions of $0.4 each. The parties to the Federal Stipulation presently intend to file the Federal Stipulation with the appropriate federal court after final approval of the settlement of the two state Derivative Actions referred to above.\nFinal approval of the settlement of the Federal Derivative Actions was granted on August 5, 2020. For the year ended December 31, 2020, the Company recorded $119 as other income in relation to the settlement of the Federal Derivative Actions.\nIn October 2019, the Company and its then officers and directors received subpoenas from the SEC requesting information, including but not limited to, with respect to risk factors contained in certain of the Company’s filings with the SEC. On October 21, 2020, the SEC notified the Company this investigation concluded, and it does not intend to recommend an enforcement action by the Commission against MGT in this matter. This notice was sent pursuant to guidelines set out in Securities Acts Release 5310, which states in part that the notice “must in no way be construed as indicating that the party has been exonerated or that no action may ultimately result from the Staff’s investigation.”\nIn November 2018, the Company’s board received a shareholder demand letter dated November 6, 2018, from shareholders Nicholas Fulton and Kelsey Thacker (the “Fulton Demand”). The Fulton Demand referenced the SEC Action, and the allegations therein, and demanded that the board take action to investigate, address and remedy the allegations raised in the SEC Action. Shortly after the New York state court entered the order preliminarily approving the stipulation of settlement in connection with the Ojha Derivative Action and the Thomas Derivative Action, counsel for the Company informed counsel for shareholders Nicholas Fulton and Kelsey Thacker of that stipulation of settlement and of counsel for the Company’s view that the releases in the settlement covered the matters raised in the Fulton Demand.\nSettlement of Class Action\nIn September 2018 and October 2018, various shareholders of the Company filed putative class action lawsuits against the Company, its Chief Executive Officer and certain of its individual officers and shareholders, alleging violations of federal securities laws and seeking damages (the “2018 Securities Class Actions”). The 2018 Securities Class Action followed and referenced the allegations made against the Company’s Chief Executive Officer and others in the SEC Action. The first putative class action lawsuit was filed on September 28, 2018, in the United States District Court for the District of New Jersey, and alleges that the named defendants engaged in a pump-and-dump scheme to artificially inflate the price of the Company’s stock and that, as a result, defendants’ statements about the Company’s business and prospects were materially false and misleading and/or lacked a reasonable basis at relevant times. The second putative class action was filed on October 9, 2018, in the United States District Court for the Southern District of New York and makes similar allegations.\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Dollars in thousands, except share and per-share amounts)\nOn May 28, 2019, the parties to the 2018 Securities Class Actions entered into a binding settlement term sheet, and on September 24, 2019, the parties entered into a stipulation of settlement. On August 7, 2019, the lead plaintiff in the first class action filed a notice and order of voluntary dismissal with prejudice, and on October 11, 2019, the lead plaintiff in the second class action filed in the federal court in New York an unopposed motion for preliminary approval of the proposed class action settlement. On December 17, 2019, the court issued an order granting preliminary approval of the settlement.\nFinal approval of the settlement of the 2018 Securities Class Actions was granted on May 27, 2020. The plaintiff shareholder class received $750 in cash settlement, inclusive of attorney fees. This amount was paid by the Company’s insurance carrier.\nNote 10. Income Taxes\nSignificant components of deferred tax assets were as follows:\nAs of December 31,\nU.S. federal tax loss carry-forward $ 17,426 $ 15,227\nU.S. State tax loss carry-forward\nEquity based compensation 7,704 7,655\nFixed assets, intangible assets and goodwill\nLong-term investments (6 ) -\nTotal deferred tax assets 25,357 23,193\nLess: valuation allowance (25,357 ) (23,193 )\nNet deferred tax asset $ - $ -\nAs of December 31, 2020, the Company had the following tax attributes:\nThe Company has federal net operating loss carryforwards of $82,980 at December 31, 2020. Of the $82,980, approximately $55,200 will begin to expire in fiscal 2022 and the remaining approximately $27,800 million will be available indefinitely but will be limited to usage of 80% of taxable income. The Company also has state net operating loss carryforwards of $13,579 in the aggregate of which approximately $10,700 will begin to expire in 2036 and approximately $2,900 will not expire.\nAs it is not more likely than not that the resulting deferred tax benefits will be realized, a full valuation allowance has been recognized for such deferred tax assets. For the year ended December 31, 2020, the valuation allowance increased by $2,157. Federal and state laws impose substantial restrictions on the utilization of tax attributes in the event of an “ownership change,” as defined in Section 382 of the Internal Revenue Code. As of December 31, 2020, the Company performed a high-level review of its changes in ownership and determined that a change of control event likely occurred under Section 382 of the Internal Revenue Code and the Company’s net operating loss carryforwards are likely to be limited.\nThe reconciliation of income tax expense computed at the U.S. federal statutory rate to the income tax provision for the years ended December 31, 2020 and 2019 is as follows:\nAs of December 31,\nExpected Federal Tax (21.0 )% (-21.0 )%\nState income taxes (net of federal benefit) (0.9 )% (-2.0 )%\nAccretion of notes payable discount 4.8 % 13.8 %\nTrue up of prior year deferred tax assets (-41.3 )% 16.1 %\nTrue-up of state loss carryforward 2.9 % 8.8 %\nOther (0.2 )% 1.6 %\nChange in valuation allowance 55.7 % (-17.3 )%\nEffective tax rate 0.00 % 0.0 %\nThe Company has adopted the provisions of ASC 740-10-25, which provides recognition criteria and a related measurement model for uncertain tax positions taken or expected to be taken in income tax returns. ASC 740-10-25 requires that a position taken or expected to be taken in a tax return be recognized in the financial statements when it is more likely than not that the position would be sustained upon examination by tax authorities.\nTax position that meet the more likely than not threshold are then measured using a probability weighted approach recognizing the largest amount of tax benefit that is greater than 50% likely of being realized upon ultimate settlement. The Company had no tax positions relating to open income tax returns that were considered to be uncertain.\nThe Company files income tax returns in the U.S. federal jurisdiction, North Carolina and Georgia jurisdictions. With few exceptions, the Company is no longer subject to U.S. federal, state and local, or non-U.S. income tax examinations by tax authorities for years before 2015.\nNote 11. Employee Benefit Plans\nThe Company maintains defined contribution benefit plans under Section 401(k) of the Internal Revenue Code covering substantially all qualified employees of the Company (the “401(k) Plan”). Under the 401(k) Plan, the Company may make discretionary contributions of up to 100% of employee contributions. During the years ended December 31, 2020 and 2019, the Company made contributions to the 401(k) Plan of $11 and $18, respectively.\nMGT CAPITAL INVESTMENTS, INC. AND SUBSIDARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Dollars in thousands, except share and per-share amounts)\nNote 12. Subsequent Events\nOn January 28, 2021 and February 18, 2021, the Company issued 2,597,403 and 27,272,727 shares of the Company’s common stock, respectively, to Chicago Venture Partners L.P., a Utah limited partnership, and Uptown Capital LLC, a Utah limited liability company, in connection with the conversion of 10 and 105 shares of the Company’s Series C Convertible Preferred Stock (the “Series C Preferred”). Following these conversions, the Company has no Series C Preferred issued or outstanding.\nOn March 5, 2021, the Company entered into a securities purchase agreement (the “Securities Purchase Agreement”) with Bucktown Capital, LLC (the “Investor”), pursuant to which the Company issued a convertible promissory note in the original principal amount of $13,210 (the “2021 Note”). The 2021 Note is convertible, at the option of the Investor, into shares of common stock of the Company at a conversion price equal to 70% of the lowest price for a share of common stock during the ten trading days immediately preceding the applicable conversion (the “Conversion Price”); provided, however, in no event shall the Conversion Price be less than $0.04 per share. The 2021 Note bears interest at a rate of 8% per annum and will mature in twelve months.\nThe 2021 Note will be funded in tranches, with the initial tranche of $1,210 funded by the Investor on March 5, 2021 for consideration of $1,000. Six subsequent tranches (five tranches, each for $1,200 and one tranche for $6,000) will be funded upon the notice of effectiveness of a Registration Statement on Form S-1 covering the common stock issuable in connection with the 2021 Note. Further, the final tranche requires the mutual agreement of the Company and Investor. Until such time as Investor has funded the subsequent tranches, the Company will hold a series of Investor Notes that offset any unfunded portion of the 2021 Note.\nOn April 1, 2021, the Company received notice from the SBA that the Company’s PPP Loan was forgiven in its entirety in the amount of $108."
}