{
    "cik": "1013857",
    "company": "PEGASYSTEMS INC",
    "filing_type": "10-K",
    "filing_date": "2021-02-17",
    "period_of_report": "2020-12-31",
    "sic": "7374",
    "state_of_inc": "MA",
    "state_location": "MA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1013857/0001013857-21-000032-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1013857/000101385721000032/pega-20201231.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1013857/0001013857-21-000032.txt",
    "filename": "1013857_10K_2020_0001013857-21-000032.htm",
    "item_1": "ITEM 1. BUSINESS\nOur Business\nWe develop, market, license, host, and support enterprise software applications that help organizations transform how they engage with their customers and process work. We also license our low code Pega Platform™ for rapid application development to clients that wish to build and extend their business applications. Our cloud-architected portfolio of customer engagement and digital process automation applications leverages artificial intelligence (“AI”), case management, and robotic automation technology, built on our unified low code Pega Platform, empowering businesses to quickly design, extend, and scale their enterprise applications to meet strategic business needs.\nTo grow our business, we intend to:\n•increase market share by developing and delivering market-leading applications for marketing, sales, service, and operations that can work together seamlessly with maximum competitive differentiation;\n•execute new-market growth initiatives, further expanding go-to-market coverage within the Global 3000; and\n•continue to scale our marketing efforts to support the way today’s clients discover, evaluate, and buy products and services.\nWhether we are successful depends, in part, on our ability to:\n•execute our marketing and sales strategies;\n•appropriately manage our expenses as we grow our organization;\n•effectively develop new products and enhance our existing products; and\n•incorporate acquired technologies into our applications and unified Pega Platform.\nCloud Transition\nWe are in the process of transitioning our business to sell software primarily through subscription arrangements, particularly Pega Cloud (“Cloud Transition”). Until we substantially complete our Cloud Transition, which we anticipate will occur in early 2023, we expect to continue to experience lower revenue growth and lower operating cash flow growth or negative cash flow. The actual mix of revenue and new arrangements in a given period can fluctuate based on client preferences.\nSee risk factor \"If we fail to manage our transition to a more subscription-based business model successfully, our results of operations and/or cash flows could be negatively impacted.\" in",
    "item_1A": "ITEM 1A. RISK FACTORS\nThe risks and uncertainties described below are not the only ones we face. Events that we do not currently anticipate or that we currently expect to be immaterial may also affect our results of operations, cash flows, and financial condition.\nRisks Related to Our Business and Industry\nIf we fail to manage our transition to a more subscription-based business model successfully, our results of operations and/or cash flows could be negatively impacted.\nWe are transitioning to a more subscription-based business model, which may have negative revenue and/or cash flow implications. The subscription model prices and delivers our software differently than a perpetual license model. These changes reflect a significant shift from perpetual license sales in favor of providing our clients the right to access our software in a hosted environment or use downloaded software for a specified subscription period. The potential shift of our clients’ preference to a cloud-based subscription model requires a considerable investment of technical, financial, legal, managerial and sales resources, and a scalable organization.\nMarket acceptance of our subscription-based offering will depend on our ability to continue to:\n•innovate and include new functionality and improve the usability of our products in a manner that addresses our clients’ needs and requirements; and\n•optimally price our products in light of marketplace conditions, competition, our costs, and client demand.\nOur cloud-based subscription model also requires that we rely on third parties to host our products for our clients. We incur significant recurring third-party hosting expenses to deliver our Pega Cloud offering that we do not incur for our perpetual and term license products. These expenses may cause the gross margin we realize from our Pega Cloud sales to be lower than the gross margin we realize from our perpetual and term license products. If we are unable to meet these challenges effectively, our operating results and financial condition could be materially adversely affected.\nThe transition to a subscription-based business model gives rise to several risks, including the following:\n•our revenues and cash flows may fluctuate more than anticipated in the near term;\n•if the increased demand for our offerings does not continue, we could experience decreased profitability or losses and reduced or negative cash flow because of our continued significant investments in our Pega Cloud offering;\n•if new or current clients desire only perpetual licenses, our subscription sales may lag behind our expectations;\n•we may be unsuccessful in maintaining or implementing our target pricing or new pricing models, product adoption and projected renewal rates, or we may select a target price or new pricing model that is not optimal and could negatively affect our sales or earnings;\n•if our clients do not renew their subscriptions, our revenue may decline, and our business may be materially adversely affected; and\n•we may incur sales compensation costs at a higher than forecasted rate if the pace of our subscription transition is faster than anticipated.\nThe metrics our investors and we use to monitor our business model transition may evolve over the course of the transition as significant trends emerge. Therefore, it may be difficult to accurately determine the impact of this transition on our business on a contemporaneous basis or to clearly communicate the appropriate metrics to our investors.\nWe may not achieve the key elements of our strategy and grow our business as anticipated.\nWe currently intend to grow our business by pursuing strategic initiatives. Key elements of our strategy include growing our market share by developing and delivering robust applications that can work together seamlessly with maximum differentiation and minimal customization, offering versatility in our Pega Platform and application deployment and licensing options to meet the specific needs of our clients, growing our network of partner alliances, and developing the talent and organizational structure capable of supporting our revenue and earnings growth targets. We may not be able to achieve one or more of our key initiatives. Our success depends on our ability to manage our expenses as we grow our organization appropriately, successfully execute our marketing and sales strategies, successfully incorporate acquired technologies into our unified Pega Platform and develop new products or product enhancements. If we are not able to execute these actions, our business may not grow as we anticipate, and our operating results and financial condition could be materially adversely affected.\nWe depend on key personnel, including our Chief Executive Officer, and must be able to attract and retain qualified personnel in the future.\nOur business is dependent on key, highly skilled technical, managerial, consulting, sales, and marketing personnel, including our Chief Executive Officer, who is also our founder and largest stockholder.\nOn February 12, 2021, we entered into an agreement with our landlord to vacate our Cambridge, Massachusetts facility on October 1, 2021 and expect to enter into a new lease agreement for a facility within the greater Boston area. Although we believe this relocation will help us attract and retain key personnel and provide a dynamic space to engage with our employees, competition for talent, delays in and costs associated with development and occupancy of the new facility and changes in commuting for our existing employees could impact our ability to realize the intended benefits of the move.\nThe loss of key personnel could be disruptive to our operations, and materially adversely affect financial performance. We do not have any significant key-person life insurance on any officers or employees and do not plan to obtain any. Our success will largely depend on the ability to attract and retain qualified personnel and rapidly replace and develop new management. The number of potential employees who have the extensive knowledge needed to develop, sell, and maintain our offerings is limited, and competition for their services is intense. There can be no assurance that we will be able to attract and retain such personnel. If we are unable to do so, our business, operating results, and financial condition could be materially adversely affected.\nThe timing of our license and Pega Cloud revenue is difficult to predict accurately, which may cause our operating results to vary considerably.\nA change in the size or volume of license and Pega Cloud arrangements, or a change in the mix between perpetual licenses, term licenses, and Pega Cloud arrangements can cause our revenues and cash flows to fluctuate materially between periods. Revenue from Pega Cloud arrangements is typically recognized over the contract term. In contrast, revenue from license sales is generally recognized upfront when the license rights become effective. Pega Cloud and term license arrangements are generally billed and collected over the contract term while perpetual license arrangements are generally billed in full and collected upfront when the license rights become effective.\nFactors that may influence the predictability of our license and Pega Cloud revenue include:\n•changes in clients’ budgets and decision-making processes that could affect both the timing and size of transactions;\n•deferral of license revenue to future periods due to the timing of the execution of an agreement or our ability to deliver the products or services;\n•changes in our business model; and\n•our ability to execute our marketing and sales strategies.\nWe budget for our selling and marketing, product development, and other expenses based upon anticipated future bookings and revenue. If the timing or amount of revenue fails to meet our expectations in a given period, our financial performance is likely to be materially adversely affected because only a small portion of our expenses vary with revenue. Other factors that may cause our operating results to vary considerably include changes in foreign currency exchange rates, income tax effects, and the impact of new accounting pronouncements.\nAs a result, period-to-period comparisons of our operating results are not necessarily meaningful and should not be relied upon to predict future performance. If our revenues and operating results do not meet the expectations of our investors or securities analysts or fall below guidance we may provide to the market, or due to other factors discussed elsewhere in this section, the price of our common stock may decline.\nThe number of license and Pega Cloud arrangements has been increasing, and we may not be able to sustain this growth unless our partners and we can provide sufficient high-quality consulting, training, and maintenance resources to enable our clients to realize significant business value from our software.\nOur clients typically request consulting and training to assist them in implementing our license and Pega Cloud offerings. Our clients also typically purchase maintenance on our perpetual and term licenses. As a result, an increase in the number of license and Pega Cloud arrangements is likely to increase demand for consulting, training, and maintenance related to our offerings. Given that the number of our license and Pega Cloud arrangements has been growing, we will need to provide our clients with more consulting, training, and maintenance to enable them to realize significant business value from our software. We have been increasing our partner and client enablement through training to create an expanded ecosystem of people that are skilled in the implementation of our products. However, if our partners and we are unable to provide sufficient high-quality consulting, training, and maintenance resources, our clients may not realize sufficient business value from our offerings to justify follow-on sales, which could impact our future financial performance. Further, some of our client engagements have high public visibility. If our partners or we encounter problems in helping these clients implement our license and Pega Cloud offerings or if there is negative publicity regarding these engagements (even if unrelated to our services or offerings) our reputation could be harmed and our future financial performance could be negatively impacted. Finally, the investments required to meet the increased demand for our consulting services could strain our ability to deliver our consulting engagements at desired profitability, thereby impacting our overall profitability and financial results.\nWe may not be able to maintain our retention rate for Pega Cloud clients.\nAn increasing percentage of our revenue has been derived from our Pega Cloud offerings. Our clients have no obligation to renew their Pega Cloud subscriptions, although historically, most have elected to do so. If our retention rate for those clients decreases our business, operating results, and financial condition could be materially adversely affected.\nWe are investing heavily in sales and marketing, research and development, and support resources in anticipation of continued growth in license and Pega Cloud arrangements, and we may experience decreased profitability or losses and reduced or negative cash flow if we do not continue to increase the value of our license and Pega Cloud arrangements to balance our growth in expenses.\nWe have been expanding our sales and marketing capacity to meet the increasing demand for our software and to broaden our market coverage by hiring additional sales and marketing personnel. We anticipate that we will need to provide our clients with more maintenance support because of this increase in demand and have been hiring additional personnel in this area. We continue to invest significantly in research and development to expand and improve the Pega Platform and applications. These investments have resulted in increased fixed costs that do not vary with the level of revenue. If the increased demand for our offerings does not continue, we could experience decreased profitability or losses and reduced or negative cash flow because of these increased fixed costs. Conversely, if we are unable to hire sales and marketing personnel to meet future demand or research and development personnel to enhance our current products or develop new products, we may not be able to achieve our sales and profitability targets.\nWe face risks from operations and clients based outside of the U.S.\nWe market our products and services to clients based outside of the U.S., which represent 43% of our revenue over the last three years. We have established offices in the Americas, Europe, Asia, and Australia. We believe that growth will necessitate expanded international operations, resulting in increased managerial attention and costs. We anticipate hiring additional personnel to accommodate increased international market demand, and we may also enter into agreements with local distributors, representatives, or resellers. If we are unable to do one or more of these things in a timely and effective manner, the growth, if any, of our international operations may be restricted, and our business, operating results, and financial condition could be materially adversely affected.\nAdditional risks inherent in our international business activities generally include:\n•laws and business practices favoring local competitors;\n•compliance with multiple, conflicting, and changing governmental laws and regulations, including employment, tax, privacy and data privacy and protection, and increased tariffs and other trade barriers;\n•the costs of localizing offerings for local markets, including translation into foreign languages and associated expenses;\n•longer payment cycles and credit and collectability risk on our foreign trade receivables;\n•difficulties in enforcing contractual and intellectual property rights;\n•heightened fraud and bribery risks;\n•treatment of revenue from international sources and changes to tax codes, including being subject to foreign tax laws, being liable for paying withholding, income or other taxes in foreign jurisdictions, and other potentially adverse tax consequences (including restrictions on repatriating earnings and the threat of “double taxation”);\n•management of our international operations, including increased accounting, internal control, and compliance expenses;\n•heightened risks of political and economic instability; and\n•foreign currency exchange rate fluctuations and controls.\nThere can be no assurance that one or more of these factors will not have a material adverse effect on our international operations and, consequently, on our business, operating results, and financial condition.\nWe rely on third-party relationships.\nWe have a number of relationships with third parties that are significant to our sales, marketing, support, and product development efforts, including hosting facilities for our Pega Cloud offering. We rely on software and hardware vendors, large system integrators, and technology consulting firms to supply marketing and sales opportunities for our direct sales force and to strengthen our products using industry-standard tools and utilities. We also have relationships with third parties that distribute our products. There can be no assurance that these companies, many of which have far greater financial and marketing resources than us, will not develop or market offerings that compete with ours in the future or will not otherwise end or limit their relationships with us. Further, the use of third-party hosting facilities requires us to rely on the functionality and availability of the third parties’ services, as well as their data security, which despite our due diligence, may be or become inadequate.\nWe are exposed to fluctuations in currency exchange rates that could negatively impact our financial results and cash flows.\nBecause a significant portion of our business is conducted outside of the U.S., we face exposure to movements in foreign currency exchange rates. Our international sales are usually denominated in foreign currencies. The operating expenses of our foreign operations are also primarily denominated in foreign currencies, which partially offset our foreign currency exposure on our international sales. Our results of operations and cash flows are subject to fluctuations due to changes in foreign currency exchange rates, particularly changes in the U.S. dollar, the Euro, and the Australian dollar relative to the British Pound. These exposures may change over time as business practices evolve.\nWe have historically used but do not currently use foreign currency forward contracts to hedge our exposure to changes in foreign currency exchange rates associated with our foreign currency-denominated cash, accounts receivable, and intercompany receivables and payables held by our U.S. parent company and its U.K. subsidiary. We may enter into hedging contracts again in the future if we believe it is appropriate.\nOur realized gain or loss for foreign currency fluctuations will generally depend on the size and type of cross-currency exposures that we enter into, the currency exchange rates associated with these exposures and changes in those rates, whether we have entered into forward contracts to offset these exposures and other factors. All of these factors could materially impact our operating results, financial condition, and cash flows.\nOur consulting revenue is significantly dependent upon our consulting personnel implementing new license and Pega Cloud arrangements.\nWe derive a substantial portion of our consulting revenue from implementations of new license and Pega Cloud arrangements managed by our consulting personnel and consulting for partner and client-led implementation efforts. Our strategy is to support and encourage partner-led and client-led implementations to increase the breadth, capability, and depth of market capacity to deliver implementation services to our clients. Accordingly, if our consulting personnel’s involvement in future implementations decreases, this could materially adversely affect our consulting revenue.\nWe frequently enter into a series of license or Pega Cloud arrangements that are each focused on a specific purpose or area of operations. If we are not successful in obtaining follow-on business from these clients, our financial performance could be materially adversely affected.\nOnce a client has realized the value of our software, we work with the client to identify opportunities for follow-on sales. However, we may not be successful in demonstrating this value for several reasons, including the performance of our products, the quality of the services and support provided by our partners and us, or external factors. Also, some of our smaller clients may have limited additional sales opportunities available. We may not obtain follow-on sales, or the follow-on sales may be delayed, and our future revenue could be limited. This could lower the total value of all transactions, and materially adversely affect our financial performance.\nWe will need to acquire or develop new products, evolve existing ones, address any defects or errors, and adapt to technology changes.\nTechnical developments, client requirements, programming languages, industry standards, and regulatory requirements frequently change in the markets in which we operate. The introduction of third-party solutions embodying new technologies and the emergence of new industry standards could make our existing and future software solutions obsolete and unmarketable. As a result, our success will depend upon our ability to enhance current products, address any product defects or errors, acquire or develop and introduce new products that meet client needs, keep pace with technology and regulatory changes, respond to competitive products, and achieve market acceptance. Product development requires substantial investments for research, refinement, and testing. We may not have sufficient resources to make the necessary product development investments. We may experience technical or other difficulties that will delay or prevent the successful development, introduction, or implementation of new or enhanced products. We may also experience technical or other challenges in the integration of acquired technologies into our existing platform and applications. Inability to introduce or implement new or enhanced products in a timely manner could result in loss of market share if competitors are able to provide solutions to meet client needs before we do, give rise to unanticipated expenses related to further development or modification of acquired technologies, and materially adversely affect our financial performance. We may also fail to adequately anticipate and prepare for the development of new markets and applications for our technology and the commercialization of emerging technologies such as blockchain and thereby fail to take advantage of new market opportunities or fall behind early movers in those markets.\nThe market for our offerings is intensely and increasingly competitive, rapidly changing, and fragmented.\nWe encounter significant competition from:\n•customer engagement vendors, including CRM application vendors;\n•DPA vendors and platforms, including BPM vendors, low code application development platforms, and service-oriented architecture middleware vendors;\n•case management vendors;\n•decision management, data science, and AI vendors, as well as vendors of solutions that leverage decision making and data science in managing customer relationships and marketing;\n•robotic automation and workforce intelligence software providers;\n•companies that provide application-specific software for financial services, healthcare, insurance, and other specific markets;\n•mobile application platform vendors;\n•co-browsing software providers;\n•social listening, text analytics, and natural language processing vendors;\n•commercialized open-source vendors;\n•professional service organizations that develop their own products or create custom software in conjunction with rendering consulting services; and\n•clients’ in-house information technology departments, which may seek to modify their existing systems or develop their own proprietary systems.\nMany of our competitors, such as Salesforce.com, Microsoft Corporation, Oracle Corporation, SAP SE, ServiceNow, and International Business Machines Corporation (“IBM”), have far greater resources than we do and may be able to respond more quickly and efficiently to new or emerging technologies, programming languages or standards, or changes in client requirements or preferences. Competitors may also be able to devote greater managerial and financial resources to develop, promote, and distribute products and to provide related consulting and training services.\nWe believe the principal competitive factors within our market include:\n•product adaptability, scalability, functionality, and performance;\n•proven success in delivering cost-savings and efficiency improvements;\n•proven success in enabling improved customer interactions;\n•ease-of-use for developers, business units, and end-users;\n•timely development and introduction of new products and product enhancements;\n•establishment of a significant base of reference clients;\n•ability to integrate with other products and technologies;\n•customer service and support;\n•product price;\n•vendor reputation; and\n•relationships with systems integrators.\nCompetition for market share and pressure to reduce prices and make sales concessions is likely to increase. There can be no assurance that we will be able to compete successfully against current or future competitors or that the competitive pressures faced by us will not materially adversely affect our business, operating results, and financial condition.\nSee \"Competition\" in Item 1 of this Annual Report for additional information.\nOur Chief Executive Officer is our largest stockholder and can exert significant influence over matters submitted to our stockholders, which could materially adversely affect our other stockholders.\nAs of December 31, 2020, our Chief Executive Officer beneficially owned 49% of our outstanding common stock. As a result, he has the ability to exert significant influence over all matters submitted to our stockholders for approval, including the election and removal of directors and any merger, consolidation, or sale of our assets. This concentration of ownership may delay or prevent a change in control, impede a merger, consolidation, takeover, or other business combination involving us, discourage a potential acquirer from making a tender offer or otherwise attempting to obtain control of us, or result in actions that may be opposed by other stockholders.\nRisks Related to Information Technology Resilience and Security\nWe face risks related to outages, data losses, and disruptions of our online services if we fail to maintain an adequate operations infrastructure.\nThe increasing user traffic for our Pega Cloud offering demands more computing power. It requires that we maintain an internet connectivity infrastructure that is robust and reliable within competitive and regulatory constraints that continue to evolve. Inefficiencies or operational failures, including temporary or permanent loss of client data, power outages, or telecommunications infrastructure outages, by our third-party service providers or us, could diminish the quality of our user experience resulting in contractual liability, claims by clients and other third parties, damage to our reputation, loss of current and potential clients, and negatively impact our operating results and financial condition.\nSecurity of our systems and global client data is a growing challenge on many fronts. Cyber-attacks and security breaches may expose us to significant legal and financial liabilities.\nSecurity breaches could expose our clients and us to a risk of loss or misuse of this information. Any security breach could result in a loss of confidence in the security of our services, damage our reputation, disrupt our business, lead to legal liability, and negatively impact our future sales. High-profile security breaches at other companies have increased in recent years. Security industry experts and government officials have warned about the risks of hackers and cyber-attackers targeting information technology products and businesses. Threats to IT security can take a variety of forms. Individual hackers, groups of hackers, and sophisticated organizations, including state-sponsored organizations, or nation-states themselves, may take steps that threaten our clients and IT structure. Additionally, our Pega Cloud offering provides environments that are provisioned, monitored, and maintained for individual clients to create and deploy Pega-based applications using an Internet-based infrastructure. These services involve the storage and transmission of clients’ data and other confidential information.\nOur security measures and those of our clients may be breached because of third-party actions or that of employees, consultants, or others, including intentional misconduct by computer hackers, system error, human error, technical flaws in our products, or otherwise. Because we do not control the configuration of Pega applications by our clients, the transmissions between our clients and our third-party technology providers, the processing of data on the servers at third-party technology providers, or the internal controls maintained by our clients and third-party technology providers that could prevent unauthorized access or provide appropriate data encryption, we cannot fully ensure the complete integrity or security of such transmissions processing or controls. In addition, privacy, security, and data transmission concerns in some parts of the world may inhibit demand for our Pega Cloud offering or lead to requirements to provide our products or services in configurations that may increase the cost of serving such markets. The techniques used to obtain unauthorized access or sabotage systems change frequently and are generally not recognized until launched against a target. While we have invested in protecting our data and systems and our clients’ data to reduce these risks, there can be no assurance that our efforts will prevent breaches. We carry data breach insurance coverage to mitigate the financial impact of a breach, though this may prove insufficient in the event of a breach.\nOur Pega Cloud offering involves the hosting of clients’ applications on the servers of third-party technology providers. We also rely on third-party systems and technology, including encryption, virtualized infrastructure, and support, and we employ a shared security model with our clients and our third-party technology providers.\nTo defend against security threats, we need to continuously engineer products and services with enhanced security and reliability features, improve the deployment of software updates to address security vulnerabilities, apply technologies that mitigate the risk of attacks, and maintain a digital security infrastructure that protects the integrity of our network, products, and services. The cost of these steps could negatively impact our operating results.\nWe may experience significant errors or security flaws in our products and services and could face privacy, product liability, and warranty claims as a result.\nDespite quality testing each release, our software frequently contains errors or security flaws, especially when first introduced or when new versions are released. Errors in our software could affect its ability to work with hardware or other software or delay the development or release of new products or new versions of our software. Additionally, the detection and correction of any security flaws can be time-consuming and costly. Errors or security flaws in our software could result in the inadvertent disclosure of confidential information or personal data relating to our clients, employees, or third parties. Software errors and security flaws in our products or services could expose us to privacy, product liability, and/or warranty claims as well as harm our reputation, which could impact our future sales of products and services. Typically, we enter into license agreements that contain provisions intended to limit the nature and extent of our risk of product liability and warranty claims. There is a risk that a court might interpret these terms in a limited way or could hold part or all of these terms to be unenforceable. Also, there is a risk that these contract terms might not bind a party other than the direct client. Furthermore, some of our licenses with our clients are governed by non-U.S. law, and there is a risk that foreign law might give us less or different protection. Although we have not experienced any material product liability claims to date, a product liability suit or action claiming a breach of warranty, whether meritorious, could result in substantial costs and a diversion of management’s attention and our resources.\nRisks Related to Our Financial Obligations and Indebtedness\nWe have a significant amount of debt that may decrease our business flexibility, access to capital, and/or increase our borrowing costs, and we may still incur additional debt in the future, which may adversely affect our operations and financial results.\nAs of December 31, 2020, we had $600 million aggregate principal amount of indebtedness under our Convertible Senior Notes due 2025 (the “Notes”).\nOur indebtedness may:\n•limit our ability to borrow additional funds for working capital, capital expenditures, acquisitions, or other business purposes;\n•limit our ability to use our cash flow or obtain additional financing for future working capital, capital expenditures, acquisitions, or other general business purposes;\n•require us to use a substantial portion of our cash flow from operations to make debt service payments;\n•limit our flexibility to plan for, or react to, changes in our business and industry;\n•place us at a competitive disadvantage compared to our less leveraged competitors;\n•dilute the interests of our existing stockholders as a result of issuing shares of our common stock upon the conversion of the Notes; and\n•increase our vulnerability to the impact of adverse economic and industry conditions.\nOur ability to pay our debt when due or refinance our indebtedness, including the Notes, depends on our future performance, which is subject to economic, financial, competitive, and other factors beyond our control. Our business may not generate cash flow from operations in the future sufficient to service our debt and make necessary investments in our business. Our ability to refinance our indebtedness will depend on the capital markets and our financial condition at such time. We may not be able to engage in any of these activities or engage in these activities on desirable terms, which could result in a default on our debt obligations which could, in turn, result in that and our other indebtedness becoming immediately payable in full which could harm our financial condition, results of operation or cost of borrowing. In addition, we may incur additional debt to meet future financing needs. If we incur additional indebtedness, the risks related to our business and our ability to service or repay our indebtedness will increase.\nThe conditional conversion feature of the Notes, if triggered, may adversely affect our financial condition and operating results.\nUnder certain circumstances, the noteholders may convert their Notes at their option prior to the scheduled maturities. Upon conversion of the Notes, unless we elect to deliver solely shares of our common stock to settle such conversion, we will be obligated to make cash payments. In addition, holders of our Notes will have the right to require us to repurchase their Notes upon the occurrence of a fundamental change (as defined in the indenture, dated as of February 24, 2020, between U.S. Bank National Association, as trustee (the “Trustee”) and us (the “Indenture”)), at a repurchase price equal to 100% of the principal amount of the Notes to be repurchased, plus accrued and unpaid interest, if any, to, but not including, the fundamental change repurchase date. Although it is our intention and we currently expect to settle the conversion value of the Notes in cash up to the principal amount and any excess in shares, there is a risk that we may not have enough available cash or be able to obtain financing at the time we are required to make repurchases of Notes surrendered therefor or Notes being converted. In addition, our ability to make payments may be limited by law, by regulatory authority, or by agreements governing our future indebtedness. Our failure to repurchase Notes when the Indenture requires the repurchase or to pay any cash payable on the Notes’ future conversions as required by the Indenture would constitute a default under the Indenture. A default under the Indenture or the fundamental change itself could also lead to a default under agreements governing our future indebtedness. If the repayment of the related indebtedness were to be accelerated after any applicable notice or grace periods, we may not have sufficient funds to repay the indebtedness and repurchase the Notes or make cash payments upon conversions thereof. In addition, even if holders of Notes do not elect to convert their Notes, we could be required under applicable accounting rules to reclassify all or a portion of the outstanding principal of the Notes as a current rather than long-term liability, which would result in a material reduction of our net working capital.\nThe Capped Call Transactions may affect the value of the Notes and our common stock.\nIn connection with the Notes’ issuance, we entered into Capped Call Transactions with certain financial institutions (“option counterparties”). The Capped Call Transactions are generally expected to reduce the potential dilution to our common stock upon any conversion of the Notes and/or offset any cash payments we are required to make in excess of the principal amount of converted Notes, as the case may be, with such reduction and/or offset subject to a cap. From time to time, the option counterparties that are parties to the Capped Call Transactions or their respective affiliates may modify their hedge positions by entering into or unwinding various derivative transactions with respect to our common stock and/or purchasing or selling our common stock or other securities of ours in secondary market transactions before the maturity of the Notes. This activity could cause a decrease in the market price of our common stock.\nWe are exposed to counterparty risk for the Capped Call Transactions.\nThe option counterparties are financial institutions, and we are subject to the risk that one or more of the option counterparties may default or otherwise fail to perform, or may exercise certain rights to terminate, their obligations under the Capped Call Transactions. Our exposure to the credit risk of the option counterparties is not secured by any collateral. Recent global economic conditions have resulted in the actual or perceived failure or financial difficulties of many financial institutions. If an option counterparty becomes subject to insolvency proceedings, we will become an unsecured creditor in those proceedings with a claim equal to our exposure at the time under such transaction. Our exposure depends on many factors, but our exposure will generally increase if the market price or the volatility of our common stock increases. In addition, upon default or other failures to perform, or termination of obligations, by an option counterparty, we may suffer more dilution than we currently anticipate with respect to our common stock. We can provide no assurances as to the financial stability or viability of the option counterparties.\nProvisions in the Notes’ Indenture may deter or prevent a business combination that may be favorable to our stockholders.\nIf a fundamental change occurs prior to the Notes’ maturity date, holders of the Notes will have the right, at their option, to require us to repurchase all or a portion of their Notes. In addition, if a “make-whole fundamental change” (as defined in the Indenture) occurs prior to the maturity date, we will in some cases be required to increase the conversion rate of the Notes for a holder that elects to convert its Notes in connection with such make-whole fundamental change.\nFurthermore, the Indenture will prohibit us from engaging in certain mergers or acquisitions unless, among other things, the surviving entity assumes our obligations under the Notes. These and other provisions in the Indenture could deter or prevent a third party from acquiring us even when the acquisition may be favorable to our stockholders.\nConversion of the Notes may dilute the ownership interest of existing stockholders.\nThe conversion of some or all of the Notes will dilute the ownership interests of existing stockholders to the extent we deliver shares of our common stock upon conversion of any of the Notes. Any sales in the public market of the common stock issuable upon such conversion could adversely affect our common stock’s prevailing market prices. In addition, the existence of the Notes may encourage short selling by market participants because the conversion of the Notes could be used to satisfy short positions, or anticipated conversion of the Notes into shares of our common stock could depress the price of our common stock.\nWe are required to comply with certain financial and operating covenants under our revolving credit facility. Failure to comply with these covenants could cause amounts borrowed to become immediately due and payable and/or prevent us from borrowing under the credit facility.\nWe must comply with specified financial and operating covenants under our credit facility and to make payments, limiting our ability to operate our business as we otherwise might. Our failure to comply with any of these covenants or to meet any debt payment obligations could result in an event of default which, if not cured or waived, would result in any amounts outstanding, including any accrued interest and/or unpaid fees, becoming immediately due and payable. We might not have sufficient working capital or liquidity to satisfy any repayment obligations in the event of an acceleration of those obligations. In addition, if we are not in compliance with the financial and operating covenants under the credit facility at the time we wish to borrow funds, we will be unable to borrow funds. The financial and operating covenants under the credit facility may limit our ability to borrow funds or capital, including for strategic acquisitions, share repurchases, and other general corporate purposes.\nRisks Related to Government Regulation and Intellectual Property\nOur success depends in part on maintaining and increasing our sales to clients in the public sector.\nWe derive a portion of our revenues from contracts with federal, state, local, and foreign governments and agencies. We believe that our business’s success and growth will continue to depend on our successful procurement of government contracts. Selling to government entities can be highly competitive, expensive, and time-consuming, often requiring significant upfront time and expense without any assurance that our efforts will produce any sales.\nFactors that could impede our ability to maintain or increase the revenue derived from government contracts include:\n•changes in fiscal or contracting policies;\n•decreases in available government funding;\n•changes in government programs or applicable requirements;\n•the adoption of new laws or regulations or changes to existing laws or regulations;\n•potential delays or changes in the government appropriations or other funding authorization processes;\n•governments and governmental agencies requiring contractual terms that are unfavorable to us, such as most-favored-nation pricing provisions; and\n•delays in the payment of our invoices by government payment offices.\nThe occurrence of any of those factors could cause governments and governmental agencies to delay or refrain from purchasing our software in the future or otherwise harm our business, results of operations, financial condition, and cash flows.\nFurther, to increase our sales to clients in the public sector, we must comply with laws and regulations relating to the formation, administration, performance, and pricing of contracts with the public sector, including U.S. federal, state, and local governmental bodies, which affect how our channel partners and we do business in connection with governmental agencies. These laws and regulations may impose added costs on our business, and failure to comply with these laws and regulations or other applicable requirements, including non-compliance in the past, could lead to claims for damages from our channel partners or government clients, penalties, termination of contracts, loss of intellectual property rights and temporary suspension or permanent debarment from government contracting. Any such damages, penalties, disruptions, or limitations in our ability to do business with the public sector could have a material adverse effect on our business, results of operations, financial condition, and cash flows.\nWe are subject to increasingly complex U.S. and foreign laws and regulations, requiring costly compliance measures. Any failure to comply with these laws and regulations could subject us to, among other things, penalties and legal expenses that could harm our reputation or have a material adverse effect on our business, financial condition, and results of operations.\nWe are subject to extensive federal, state, and foreign laws and regulations, including but not limited to the U.S. Foreign Corrupt Practices Act, the U.K. Bribery Act, data privacy and security laws, and similar laws and regulations. The U.S. Foreign Corrupt Practices Act, the U.K. Bribery Act, and similar foreign anti-bribery laws generally prohibit companies and their intermediaries from making improper payments to obtain or retain business. Similar laws and regulations exist in many other countries throughout the world in which we do or intend to do business. Data privacy laws and regulations in Europe, Australia, Latin America, and elsewhere are undergoing a rapid transformation toward increased restrictions.\nIn April 2016, the European Parliament adopted the General Data Protection Regulation (“GDPR”). It became effective in May 2018. The GDPR extends the scope of European privacy laws to any entity that controls or processes EU residents' personal data in connection with the offer of goods or services or the monitoring of behavior and imposes new compliance obligations concerning the handling of personal data. Complying with the GDPR and other emerging and changing requirements caused us to incur additional costs in 2020 and may cause us to incur substantial additional costs or require us to change our business practices. Compliance also depends on how regulators choose to interpret and apply the new requirements. Moreover, non-compliance, or if regulators assert we have not complied, with GDPR could result in significant monetary penalties of up to the higher of 20 million Euro or 4% of annual worldwide revenue, private lawsuits, and damage to our reputation, which could have a material adverse effect on our business, financial condition, and results of operation.\nThe California Consumer Privacy Act (“CCPA”), which creates new individual privacy rights for California consumers (as defined in the law) and places increased privacy and security obligations on entities handling certain personal data of consumers or households, went into effect on January 1, 2020, and the California Attorney General may now bring enforcement actions for violations. The CCPA requires, among other things, covered companies to provide new disclosure to consumers about such companies’ data collection, use and sharing practices, provide such consumers new ways to opt-out of certain sales or transfers of personal information, and provide consumers with additional causes of action. The CCPA may increase our compliance costs and potential liability.\nWe have developed and implemented a compliance program based on what we believe are current best practices, including the background checking of our current partners and prospective clients and partners. We cannot guarantee, however, that we, our employees, our consultants, our partners, or our contractors are or will be compliant with all federal, state, and foreign regulations, particularly as we expand our operations outside of the U.S. If our representatives or we fail to comply with any of these laws or regulations, a range of fines, penalties, and/or other sanctions could be imposed on us, which could have a material adverse effect on our business, financial condition, and results of operations. Even if we are determined not to have violated these laws, government inquiries into these issues typically require the expenditure of significant resources and generate negative publicity, which could also harm our business. In addition, regulation of data privacy and security laws is increasing worldwide, including various restrictions on cross-border access or transfer of data, including personal data of our employees, our clients, and customers of our clients. Compliance with such regulations may increase our costs, and there is a risk of enforcement of such laws resulting in damage to our brand, as well as financial penalties and potential loss of business, which could be significant.\nWe may have exposure to greater than anticipated tax liabilities.\nThe determination of our worldwide provision for income taxes and other tax liabilities requires estimation and significant judgment, and there are many transactions and calculations where the ultimate tax determination is uncertain. Like many other multinational corporations, we are subject to tax in multiple U.S. and foreign jurisdictions. The determination of our tax liability is always subject to audit and review by applicable domestic and foreign tax authorities, and we are currently undergoing several inquiries, audits, and reviews by taxing authorities throughout the world. Any adverse outcome of any such audit or review could harm our business, and the ultimate tax outcome may differ from the amounts recorded in our financial statements and may materially affect our financial results in the period or periods for which such determination is made. While we have established reserves based on assumptions and estimates that we believe are reasonable to cover such eventualities, these reserves may prove to be insufficient.\nIn addition, our future income taxes could be materially adversely affected by a shift in our jurisdictional income mix, by changes in the valuation of our deferred tax assets and liabilities, as a result of changes in tax laws, regulations, or accounting principles, as well as by certain discrete items.\nIn light of continuing fiscal challenges in many jurisdictions, various levels of government are increasingly focused on tax reform and other legislative action to increase tax revenue, including corporate income taxes. Several U.S. states have attempted to increase corporate tax revenues by taking an expansive view of corporate presence to attempt to impose corporate income taxes and other direct business taxes on companies that have no physical presence in their state, and taxing authorities in foreign jurisdictions may take similar actions. Many U.S. states are also altering their apportionment formulas to increase the amount of taxable income or loss attributable to their state from certain out-of-state businesses. Similarly, in Europe and elsewhere globally, there are various tax reform efforts underway designed to ensure that corporate entities are taxed on a larger percentage of their earnings.\nIf it becomes necessary or desirable to repatriate any of our foreign cash balances to the United States, we may be subject to increased taxes, other restrictions, and limitations.\nAs of December 31, 2020, $66.0 million of our cash and cash equivalents were held in our foreign subsidiaries. If it becomes necessary or desirable to repatriate these funds, we may be required to pay U.S. federal, state, and local income and foreign withholding taxes upon repatriation. We consider the earnings of our foreign subsidiaries to be permanently reinvested. As a result, U.S. federal, state, and local, and foreign withholding taxes on such earnings have not been provided in our financial statements. It is not practical to estimate the amount of tax we would have to pay upon repatriation due to the complexity of the tax laws and other factors.\nWe face risks related to intellectual property claims or appropriation of our intellectual property rights.\nWe rely primarily on a combination of patent, copyright, trademark, and trade secrets laws, as well as intellectual property and confidentiality agreements to protect our proprietary rights. We also try to control access to and distribution of our technologies and other proprietary information. We have obtained patents in strategically important global markets relating to the architecture of our systems. We cannot assure that such patents will not be challenged, invalidated, or circumvented, or that rights granted thereunder, or the claims contained therein will provide us with competitive advantages. Moreover, despite our efforts to protect our proprietary rights, unauthorized parties may attempt to copy aspects of our software or to obtain the use of information that we regard as proprietary. Although we generally enter into intellectual property and confidentiality agreements with our employees and strategic partners, despite our efforts our former employees may seek employment with our business partners, clients, or competitors, and there can be no assurance that the confidential nature of our proprietary information will be maintained. In addition, the laws of some foreign countries do not protect our proprietary rights as effectively as they do in the U.S. There can be no assurance that our means of protecting our proprietary rights will be adequate or that our competitors will not independently develop similar technology.\nOther companies or individuals have obtained proprietary rights covering a variety of designs, processes, and systems. There can be no assurance that third parties, including clients, will not claim infringement by us for current or future products. Although we attempt to limit the amount and type of our contractual liability for infringement of the proprietary rights of third parties and assert ownership of work product and intellectual property rights as appropriate, there are often exceptions, and limitations may not be applicable and enforceable in all cases. Even if limitations are found to be applicable and enforceable, our liability to our clients for these types of claims could be material given the size of certain of our transactions. We expect that software product developers will increasingly be subject to infringement claims as the number of products and competitors in our industry segment grows and the functionality of products in different industry segments overlaps. Any such claims, with or without merit, could be time-consuming, result in costly litigation, cause product shipment and delivery delays, require us to enter into royalty or licensing agreements, or be precluded from making and selling the infringing software, if such proprietary rights are found to be valid. Royalty or licensing agreements, if required, may not be available on terms acceptable to us or at all. These claims could also subject us to significant liability for damages, potentially including treble damages if we are found to have willfully infringed patents or copyrights. Even if a license were available, we could be required to pay significant royalties, which would increase our operating expenses. As a result, we may be required to develop alternative non-infringing technology, which could require substantial effort and cost. If we cannot license or develop technology for any infringing aspect of our business, we would be forced to limit or stop sales of our software and may be unable to compete effectively, which could have a material adverse effect upon our business, operating results, and financial condition.\nWe may be subject to intellectual property rights claims by third parties, which are extremely costly to defend, could require us to pay significant damages, and could limit our ability to use certain technologies.\nCompanies in the software and technology industries, including some of our current and potential competitors, own large numbers of patents, copyrights, trademarks, and trade secrets and frequently enter into litigation based on allegations of infringement or other violations of intellectual property rights. In addition, many of these companies can dedicate substantially greater resources to enforce their intellectual property rights and to defend claims that may be brought against them. The litigation may involve patent holding companies or other adverse patent owners that have no relevant product revenues and against which our patents may, therefore, provide little or no deterrence. We have received, and may in the future receive, notices that claim we have misappropriated, misused, or infringed other parties' intellectual property rights, and, to the extent we gain greater market visibility, we face a higher risk of being the subject of intellectual property infringement claims.\nCoronavirus (“COVID-19”)\nEpidemic diseases, such as the recent global COVID-19 outbreak, could harm our business and results of operations.\nThe recent outbreak of a novel coronavirus disease (“COVID-19”), which has been declared by the World Health Organization to be a pandemic, has spread across the globe and is impacting worldwide economic activity. A pandemic, including COVID-19, or other public health epidemics pose the risk that our employees, partners, and clients may be prevented from conducting business activities at full capacity for an indefinite period, including due to the spread of the disease within these groups or due to the shutdowns that are requested or mandated by governmental authorities. Moreover, these conditions can affect the rate of IT spending and may adversely affect our clients’ willingness to purchase our solutions, delay prospective clients’ purchasing decisions, reduce the value or duration of their contracts, request concessions including extended payment terms or better pricing, or affect attrition rates, all of which could adversely affect our future sales and operating results. The global spread of COVID-19 has created significant volatility, uncertainty, and economic disruption.\nWe have undertaken measures to protect our employees, partners, and clients, including by adopting a virtual-only meeting format for our annual PegaWorld conference and encouraging employees to work remotely. There can be no assurance that these measures will be sufficient, however, or that we can implement them without adversely affecting our business operations.\nWe continue to monitor the situation and adjust our policies as more information and public health guidance become available. Precautionary measures that have been adopted, or may be adopted in the future, could negatively affect our client success efforts, sales, and marketing efforts, delay and lengthen our sales cycles, or create operational or other challenges, any of which could harm our business and results of operations. In addition, COVID-19 may disrupt our clients’, vendors’, and partners’ operations for an indefinite period, including as a result of travel restrictions and/or business shutdowns, all of which could negatively impact our business and results of operations, including cash flows.\nAt this time, it is not possible to estimate the ultimate impact that COVID-19 could have on our business, as the impact will depend on future developments, which are highly uncertain and cannot be predicted. Furthermore, due to our shift to a renewable model, the effect of COVID-19 may not be fully reflected in our results of operations until future periods. The extent to which COVID-19 impacts our business, operations, and financial results will depend on numerous evolving factors that we may not be able to predict accurately, including:\n•the duration and scope of the pandemic;\n•governmental, business, and individual actions taken in response to the pandemic and the impact of those actions on global economic activity;\n•the actions that are taken in response to economic disruption;\n•the impact of business disruptions and reductions in our clients’ business and the resulting impact on their demand for our services and solutions; and\n•our ability to provide our services and solutions, including as a result of our employees or our clients’ employees working remotely and/or closures of offices and facilities.\nGeneral Risk Factors\nThe provision in our amended and restated bylaws, requiring exclusive forum in certain courts in The Commonwealth of Massachusetts or the federal district court for the District of Massachusetts for certain types of lawsuits, may have the effect of discouraging lawsuits against us and our directors, officers, and employees.\nOur amended and restated bylaws provide that unless we consent in writing to the selection of an alternative forum, the Business Litigation Section of the Superior Court of Suffolk County, Massachusetts (the “BLS”) or, if the BLS lacks jurisdiction, the federal district court for the District of Massachusetts, Eastern Division, shall be the exclusive forum for any (i) derivative action or proceeding brought on our behalf, (ii) any action asserting a claim of breach of a fiduciary duty owed by any of our directors, officers, or other employees to us or our stockholders, (iii) any action asserting a claim arising pursuant to the Massachusetts Business Corporation Act (the “MBCA”), our articles of organization, or our bylaws (as each may be amended from time to time), or (iv) any action asserting a claim governed by the internal affairs doctrine.\nThe choice of forum provision may increase costs to bring a claim, discourage claims, or limit a stockholder’s ability to bring a claim in a judicial forum that it finds favorable for disputes with us or our directors, officers, or other employees, which may discourage such lawsuits against us or our directors, officers and other employees. Alternatively, if a court were to find the choice of forum provision in our amended and restated bylaws to be inapplicable or unenforceable in an action, we may incur additional costs associated with resolving such action in other jurisdictions. The exclusive forum provision in our amended and restated bylaws will not preclude or contract the scope of exclusive federal or concurrent jurisdiction for actions brought under the federal securities laws, including the Securities Exchange Act of 1934, as amended, or the Securities Act of 1933, as amended, or the respective rules and regulations promulgated thereunder.\nThe continued uncertainties in the global economy may negatively impact our sales to, and the collection of receivables, from our clients.\nOur sales to, and the collection of receivables from, our clients may be impacted by adverse changes in global economic conditions. The U.S. and other key international economies have experienced cyclical downturns from time to time, during which economic activity has been impacted by falling demand for goods and services, restricted credit, poor liquidity, reduced corporate profitability, volatility in credit, equity, and foreign exchange markets, bankruptcies, and economic uncertainty. These changes in global economic conditions could impact the ability and willingness of our clients to make investments in technology, which in turn may delay or reduce the purchases of our software and services. These factors could also impact the ability and willingness of these clients to pay their trade obligations and honor their contractual commitments. These clients may also become subject to increasingly restrictive regulatory requirements, which could limit or delay their ability to proceed with technology purchases and may result in longer sales cycles, increased price competition, and reductions in sales of our products and services. The financial uncertainties facing many of our clients and the industries in which they operate could negatively impact our business, operating results, and financial condition.\nThe U.K.’s withdrawal from the European Union (commonly referred to as “Brexit”) on January 31, 2020 could have a material impact on our business, including our relationships with existing and future clients, suppliers, and employees, which could harm our financial results and operations.\nWe have material operations in the U.K. and European Union. The ultimate or perceived effects of the U.K.’s withdrawal from the European Union, could potentially disrupt the markets we serve and the tax jurisdictions in which we operate.\nThe market price of our common stock has been and is likely to continue to be volatile.\nThe market price of our common stock may be highly volatile and may fluctuate substantially due to a variety of factors, some of which are related in complex ways.\nFactors that may affect the market price of our common stock include:\n•actual or anticipated fluctuations in our financial condition and operating results;\n•variance in our financial performance from expectations of securities analysts;\n•changes in our projected operating and financial results;\n•changes in the prices of our products and professional services;\n•changes in laws or regulations applicable to our products or services;\n•announcements by our competitors or us of significant business developments, acquisitions, or new offerings;\n•our involvement in any litigation or investigations by regulators;\n•our sale of our common stock or other securities;\n•changes in our Board of Directors, senior management, or key personnel;\n•the trading volume of our common stock;\n•price and volume fluctuations in the overall stock market;\n•changes in the anticipated future size and growth rate of our market; and\n•general economic, regulatory, political, and market conditions.\nBroad market and industry fluctuations, as well as general economic, regulatory, political, and market conditions, may negatively impact the market price of our common stock. In the past, companies that have experienced volatility in the market price of their securities have been subject to securities class action litigation. We may be the target of this type of litigation in the future, which could result in substantial costs and divert our management’s attention.\nWe may fail to meet our publicly announced guidance or other expectations about our business and future operating results, which could cause our stock price to decline.\nWe have provided and may continue to give guidance on our business, future operating results, and other business metrics. In developing this guidance, our management must make certain assumptions and judgments about our future performance. Furthermore, analysts and investors may develop and publish their own projections of our business, which may form a consensus about our future performance. Our business results may vary significantly from such guidance or that consensus due to a number of factors, many of which are outside of our control and which could materially adversely affect our operations and operating results. Furthermore, if we make downward revisions of our previously announced guidance, or if our publicly announced guidance of future operating results fails to meet expectations of securities analysts, investors, or other interested parties, our common stock price would decline.\nIf securities or industry analysts do not publish research or reports about our business, or publish negative reports about our business, our stock price and trading volume could decline.\nThe trading market for our common stock depends, in part, on the research and reports that securities or industry analysts publish about us or our business. We do not have any control over these analysts. If our financial performance fails to meet analyst estimates or one or more of the analysts who cover us downgrade our shares or change their opinion of our shares, our share price would likely decline. If one or more of these analysts cease coverage of us or fail to publish reports on us regularly, we could lose visibility in the financial markets, which could cause our share price or trading volume to decline.",
    "item_1B": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item_2": "ITEM 2. PROPERTIES\nOur principal administrative, sales, marketing, support, and research and development operations are in Cambridge, Massachusetts and Hyderabad, India. We also maintain offices elsewhere in the Americas, Europe, and the Asia-Pacific regions. On February 12, 2021, we entered into an agreement with our landlord to vacate our Cambridge, Massachusetts corporate headquarters on October 1, 2021, in exchange for a one-time payment to us of $18 million. We expect to enter into a new lease agreement for a facility within the greater Boston area. All of our properties are leased. We are currently assessing the impact of the COVID-19 pandemic and the increase in remote work on our future real estate needs. We believe we will be able to obtain future space as needed on acceptable and commercially reasonable terms.\nSee \"Note 9. Leases\" in Item 8 of this Annual Report for additional information.",
    "item_3": "ITEM 3. LEGAL PROCEEDINGS\nFrom time to time, we may be subject to legal proceedings and civil and regulatory claims that arise in the ordinary course of our business activities. Regardless of the outcome, litigation can have a material adverse effect on us because of defense and settlement costs, diversion of management resources, and other factors.",
    "item_4": "ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II",
    "item_5": "ITEM 5. MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket information\nOur common stock is quoted on the NASDAQ Global Select Market under the symbol “PEGA.”\nHolders\nAs of February 5, 2021, we had 48 stockholders of record.\nDividends\nDuring 2020, 2019, and 2018, we paid quarterly cash dividends of $0.03 per share of common stock. We currently expect to pay a quarterly cash dividend of $0.03 per share, however, the Board of Directors may terminate or modify this dividend program at any time without prior notice.\nIssuer purchases of equity securities (1)\nCommon stock repurchased in the three months ended December 31, 2020:\n(in thousands, except per share amounts) Total Number\nof Shares\nPurchased (2)\nAverage Price\nPaid per\nShare (2)\nTotal Number\nof Shares Purchased as Part of Publicly Announced Share Repurchase Program\nApproximate Dollar\nValue of Shares That\nMay Yet Be Purchased at Period End Under Publicly Announced Share Repurchased Programs\nOctober 1, 2020 - October 31, 2020 37 $ 125.97 26 $ 43,873\nNovember 1, 2020 - November 30, 2020 105 $ 123.82 23 $ 41,024\nDecember 1, 2020 - December 31, 2020 138 $ 128.76 25 $ 37,726\nTotal 280 $ 126.54\n(1) See \"Stock repurchase program\" in Item 7 of this Annual Report for additional information.\n(2) Shares withheld to cover the option exercise price and tax withholding obligations under the net settlement provisions of our stock compensation awards have been included in these amounts.\nStock performance graph and cumulative total stockholder return (1)\nThe following performance graph represents a comparison of the cumulative total stockholder return, assuming the reinvestment of dividends, for a $100 investment on December 31, 2015 in our common stock, the Total Return Index for the NASDAQ Composite, a broad market index, and the Standard & Poor’s (“S&P”) North American Technology Sector - Software Index™ (“S&P NA Tech Software”), a published industry index.\nDecember 31,\n2015 2016 2017 2018 2019 2020\nPegasystems Inc. $ 100.00 $ 131.46 $ 172.58 $ 175.44 $ 292.66 $ 490.22\nNASDAQ Composite $ 100.00 $ 108.87 $ 141.13 $ 137.12 $ 187.44 $ 271.64\nS&P NA Tech Software $ 100.00 $ 106.20 $ 151.66 $ 170.83 $ 229.93 $ 349.26\n(1) The graph lines merely connect measurement dates and do not reflect fluctuations between those dates.",
    "item_6": "ITEM 6. SELECTED FINANCIAL DATA\nConsistent with the final rules promulgated by the SEC on November 19, 2020 (Release 33-10890 titled “Management’s Discussion and Analysis, Selected Financial Data, and Supplementary Financial Data”), we have elected early adoption of the elimination of Item 301 of Regulation S-K.",
    "item_7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nBUSINESS OVERVIEW\nWe develop, market, license, host, and support enterprise software applications that help organizations transform how they engage with their customers and process work. We also license our low code Pega Platform™ for rapid application development to clients that wish to build and extend their business applications. Our cloud-architected portfolio of customer engagement and digital process automation applications leverages artificial intelligence (“AI”), case management, and robotic automation technology, built on our unified low code Pega Platform, empowering businesses to quickly design, extend, and scale their enterprise applications to meet strategic business needs.\nOur target clients are Global 3000 organizations and government agencies that require applications to differentiate themselves in the markets they serve. Our applications achieve and facilitate differentiation by increasing business agility, driving growth, improving productivity, attracting and retaining customers, and reducing risk. We deliver applications tailored to our clients’ specific industry needs.\nCloud Transition\nWe are in the process of transitioning our business to sell software primarily through subscription arrangements, particularly Pega Cloud (“Cloud Transition”). Until we substantially complete our Cloud Transition, which we anticipate will occur in early 2023, we expect to continue to experience lower revenue growth and lower operating cash flow growth or negative cash flow. The actual mix of revenue and new arrangements in a given period can fluctuate based on client preferences.\nSee risk factor \"If we fail to manage our transition to a more subscription-based business model successfully, our results of operations and/or cash flows could be negatively impacted.\" in Item 1A of this Annual Report for additional information.\nCoronavirus (“COVID-19”)\nAs of December 31, 2020, COVID-19 has not had a material impact on our results of operations or financial condition.\nCOVID-19's ultimate impact on our operational and financial performance will depend on future developments, including the duration and spread of the outbreak and the impact of COVID-19 on our sales cycles, partners, vendors, and employees, all of which is uncertain and unpredictable. Our shift towards subscription-based revenue streams, the industry mix of our clients, the substantial size and available resources of our clients, and the critical nature of our products to our clients may reduce or delay the impact of COVID-19 on our business. However, it is not possible to estimate the ultimate impact that COVID-19 will have on our business at this time.\nSee “Coronavirus (“COVID-19”)” in Item 1A of this Annual Report for additional information.\nRelocation of Corporate Headquarters\nOn February 12, 2021, we entered into an agreement with our landlord to vacate our Cambridge, Massachusetts corporate headquarters on October 1, 2021, in exchange for a one-time payment to us of $18 million. We expect to enter into a new lease agreement for a facility within the greater Boston area.\nPerformance metrics\nWe utilize several performance metrics to analyze and assess our overall performance, make operating decisions, and forecast and plan for future periods, including:\nAnnual contract value (“ACV”) | Increased 21% since December 31, 2019\n•ACV, as reported, represents the annualized value of our active contracts as of the measurement date. The contract's total value is divided by its duration in years to calculate ACV for term license and Pega Cloud contracts. Maintenance revenue for the quarter then ended is multiplied by four to calculate ACV for maintenance. Client Cloud ACV is composed of maintenance ACV and ACV from term license contracts. ACV is a performance measure that we believe provides useful information to our management and investors, particularly during our Cloud Transition. Reported amounts have not been adjusted for changes in foreign exchange rates. Foreign currency contributed 1%-2% to ACV growth in 2020.\nRemaining performance obligations (“Backlog”) | Increased 28% since December 31, 2019\n•Backlog represents contracted revenue that has not yet been recognized and includes deferred revenue and non-cancellable amounts expected to be invoiced and recognized as revenue in future periods.\n•\nPega Cloud revenue | Increased 56% since 2019\n•Pega Cloud revenue is revenue as reported under U.S. GAAP for cloud contracts.\nRESULTS OF OPERATIONS\nRevenue\nCloud Transition\nWe are in the process of transitioning our business to sell software primarily through subscription arrangements, particularly Pega Cloud. Revenue growth has and is expected to continue to be slower during this transition Revenue from Pega Cloud arrangements is typically recognized over the contract term. In contrast, revenue from license sales is generally recognized upfront when the license rights become effective.\n(Dollars in thousands) 2020 2019 Change\nPega Cloud $ 208,268 20 % $ 133,746 15 % $ 74,522 56 %\nMaintenance 296,709 30 % 280,580 30 % 16,129 6 %\nTerm license 266,352 26 % 199,433 22 % 66,919 34 %\nSubscription (1)\n$ 771,329 76 % $ 613,759 67 % 157,570 26 %\nPerpetual license 28,558 3 % 80,015 9 % (51,457) (64) %\nConsulting 217,630 21 % 217,609 24 % 21 - %\n$ 1,017,517 100 % $ 911,383 100 % $ 106,134 12 %\n(1) Reflects client arrangements subject to renewal (Pega Cloud, maintenance, and term license).\nThe change in total revenue since 2019 generally reflects the impact of our Cloud Transition. Additional contributing factors were:\n•An increasing portion of our term license contracts include multi-year committed maintenance periods instead of annually renewable maintenance periods. Under such arrangements, a larger portion of the total contract value is recognized as maintenance revenue over the contract term rather than as term license revenue upon effectiveness of the license rights. In 2020, multi-year committed maintenance contributed $10.2 million to maintenance revenue growth and reduced term revenue growth by $20.8 million.\n•Maintenance renewal rates remained over 90% in 2020.\n•The slight increase in consulting revenue in 2020 was primarily due to increased billable hours, which offset the impact of reduced billable travel expenses due to COVID-19. As part of our long-term strategy, we intend to continue growing and increasingly leveraging our ecosystem of partners on future implementation projects, potentially reducing our future consulting revenue growth rate.\nGross profit\n(Dollars in thousands) 2020 2019 Change\nSoftware license $ 291,982 99 % $ 275,792 99 % $ 16,190 6 %\nMaintenance 274,398 92 % 254,924 91 % 19,474 8 %\nPega Cloud 131,693 63 % 67,918 51 % 63,775 94 %\nConsulting 8,531 4 % 2,727 1 % 5,804 213 %\n$ 706,604 69 % $ 601,361 66 % $ 105,243 18 %\n•The increase in gross profit in 2020 was primarily due to cost-efficiency gains as Pega Cloud grows and scales as a result of our Cloud Transition and overall revenue growth.\n•The increase in consulting gross profit in 2020 was primarily due to a decrease in travel and entertainment expenses and an increase in consultant utilization. Consultant utilization is impacted by several factors, including the timing of new implementation projects and our scope and level of involvement in these projects compared to that of our consulting partners and enabled clients.\nOperating expenses\n2020 2019 Change\n(Dollars in thousands) % of Revenue % of Revenue\nSelling and marketing $ 545,693 54 % $ 474,459 52 % $ 71,234 15 %\nResearch and development $ 236,986 23 % $ 205,210 23 % $ 31,776 15 %\nGeneral and administrative $ 67,452 7 % $ 56,570 6 % $ 10,882 19 %\n•The increase in selling and marketing in 2020 was primarily due to an increase in compensation and benefits of $97.2 million, attributable to increases in headcount and equity compensation, partially offset by a decrease in travel and entertainment of $27.2 million due to COVID-19. The increase in headcount reflects our efforts to increase our sales capacity to deepen relationships with existing clients and target new accounts.\n•The increase in research and development in 2020 was primarily due to an increase in compensation and benefits of $30.2 million, attributable to increases in headcount and equity compensation. The increase in headcount reflects additional investments in the development of our products, particularly for Pega Cloud.\n•The increase in general and administrative in 2020 was primarily due to an increase in compensation and benefits of $4.0 million, attributable to increases in headcount and equity compensation to support the growth in our operations and an increase in professional services fees of $4.2 million.\nOther income (expense), net\n(Dollars in thousands) 2020 2019 Change\nForeign currency transaction gain (loss) 3,704 (2,335) $ 6,039 *\nInterest income 1,223 2,020 (797) (39) %\nInterest expense (19,356) (212) (19,144) (9,030) %\nGain on capped call transactions 31,697 - 31,697 *\nOther (loss) income, net 1,370 559 811 145 %\n$ 18,638 $ 32 $ 18,606 58,144 %\n* not meaningful\n•The change in foreign currency transaction gain (loss) in 2020 was primarily due to the impact of fluctuations in foreign currency exchange rates associated with our foreign currency-denominated cash, accounts receivable, and intercompany receivables and payables held by our United Kingdom (“U.K.”) subsidiary.\n•The decrease in interest income in 2020 was due to the significant decline in market interest rates despite the significant increase in our interest-bearing investment balances.\n•The increase in interest expense in 2020 was due to our issuance of $600 million in aggregate principal amount of the Notes on February 24, 2020. See \"Note 10. Debt\" in Item 8 of this Annual Report for additional information.\nInterest expense related to the Notes:\nYear Ended\nDecember 31, Change\n(in thousands) 2020 2019\nContractual interest expense (0.75% coupon)\n$ 3,825 $ - $ 3,825\nAmortization of debt discount 12,898 - 12,898\nAmortization of issuance costs 1,915 - 1,915\n$ 18,638 $ - $ 18,638\n•The increase in the gain on capped call transactions in 2020 was due to fair value adjustments on the Capped Call Transactions. See \"Note 10. Debt\" in Item 8 of this Annual Report for additional information.\n•The increase in other (loss) income, net in 2020 was due to a gain from our venture investments portfolio.\n(Benefit from) income taxes\n(Dollars in thousands) 2020 2019\n(Benefit from) income taxes $ (63,516) $ (44,413)\nEffective income tax benefit rate 51 % 33 %\nDuring 2020, the increase in our effective income tax benefit rate was primarily due to an increase in excess tax benefits from stock-based compensation and a carryback claim benefit due to the Coronavirus Aid, Relief, and Economic Security Act (“Cares Act”). See \"Note 16. Income Taxes\" in Item 8 of this Annual Report for additional information.\nStock-based compensation increases the variability of our effective tax rates. The impact of stock-based compensation on a given period depends on our profitability, the attributes of our stock compensation awards we grant, and award holders' exercise behavior.\nLIQUIDITY AND CAPITAL RESOURCES\n(in thousands) 2020 2019\nCash provided by (used in)\nOperating activities $ (563) $ (42,165)\nInvesting activities (321,683) 70,074\nFinancing activities 423,448 (74,258)\nEffect of exchange rate on cash and cash equivalents 2,334 290\nNet increase (decrease) in cash and cash equivalents $ 103,536 $ (46,059)\nDecember 31,\n(in thousands)\n2020 2019\nHeld in U.S. entities $ 399,138 $ 23,437\nHeld in foreign entities 66,030 44,926\nTotal cash, cash equivalents, and marketable securities $ 465,168 $ 68,363\nWe believe that our current cash, cash flow from operations, and borrowing capacity will be sufficient to fund our operations, stock repurchases, and quarterly cash dividends for at least the next 12 months. Whether these resources are adequate to meet our liquidity needs beyond that period will depend on our growth, operating results, and the investments required to respond to the possible increased demand for our services. If we require additional capital resources to grow our business, we may seek to finance our operations from available funds or additional external financing.\nIf it became necessary to repatriate foreign funds, we may be required to pay U.S. and foreign taxes upon repatriation. Due to the complexity of income tax laws and regulations, and the Tax Reform Act’s effects, it is impracticable to estimate the amount of taxes we would have to pay. See risk factor \"If it becomes necessary or desirable to repatriate any of our foreign cash balances to the United States, we may be subject to increased taxes, other restrictions, and limitations\" in Item 1A of this Annual Report for additional information.\nCash (used in) operating activities\nWe are in the process of transitioning our business to sell software primarily through subscription arrangements, particularly Pega Cloud. This transition has and is expected to continue to impact our billings and resulting timing of cash collections. Pega Cloud and term license arrangements are generally billed and collected over the contract term while perpetual license arrangements are generally billed in full and collected upfront when the license rights become effective. As client preferences continue to shift in favor of Pega Cloud arrangements, we could continue to experience slower operating cash flow growth, or negative cash flow, in the near term\nIn 2020, COVID-19 did not have a material impact on our cash flows from operations. See “Coronavirus (“COVID-19”)” in Item 1A. of this Annual Report for additional information.\nThe change in cash (used in) operating activities in 2020 was primarily due to improved cash collections. The increased cash collections were partially offset by increased costs as we accelerated investments in our Pega Cloud offering and selling and marketing activities to support future growth.\nCash (used in) provided by investing activities\nThe change in cash (used in) provided by investing activities in 2020 was primarily driven by purchases of financial instruments and property and equipment investments for our offices.\nCash provided by (used in) financing activities\nConvertible senior notes\nIn February 2020, we issued $600 million in aggregate principal amount of our convertible senior notes (the “Notes”) due March 1, 2025, which provided proceeds as follows:\n(in thousands) Amount\nPrincipal $ 600,000\nLess: issuance costs (14,527)\nLess: Capped Call Transactions (51,900)\n$ 533,573\nA portion of the proceeds of the Notes was used to fund the Capped Call Transactions, with the remainder to be used for working capital and other general corporate purposes. The Notes mature on March 1, 2025; however, under certain circumstances, holders may surrender their Notes for conversion prior to the maturity date. We may settle conversion by paying or delivering, as applicable, cash, shares of our common\nstock or a combination of cash and shares of our common stock. See \"Note 10. Debt\" in Item 8 of this Annual Report for additional information.\nCredit facility\nIn November 2019, and as amended as of February 2020, July 2020, and September 2020, we entered into a five-year $100 million senior secured revolving credit agreement (the “Credit Facility”) with PNC Bank, National Association (“PNC”). As of December 31, 2020, we had no outstanding borrowings under the Credit Facility. See \"Note 10. Debt\" in Item 8 of this Annual Report for additional information.\nStock repurchase program\nChanges in the remaining stock repurchase authority:\n(in thousands) 2020\nDecember 31, 2019 $ 45,484\nAuthorizations (1)\n20,516\nRepurchases (2)\n(28,274)\nDecember 31, 2020 $ 37,726\n(1) On June 15, 2020, we announced that our Board of Directors extended the current stock repurchase program’s expiration date to June 30, 2021 and increased the remaining common stock repurchase authority to $60 million.\n(2) Purchases under this program have been made on the open market.\nCommon stock repurchases\n2020 2019\n(in thousands) Shares Amount Shares Amount\nTax withholdings for net settlement of equity awards 725 $ 75,560 645 $ 44,857\nStock repurchase program 278 28,274 333 21,136\n1,003 $ 103,834 978 $ 65,993\nDuring 2020 and 2019, instead of receiving cash from the equity holders, we withheld shares with a value of $59.6 million and $41.7 million, respectively, for the exercise price of options. These amounts have been excluded from the table above.\nDividends\n(in thousands) 2020 2019\nDividend payments to stockholders $ 9,628 $ 9,486\nWe currently intend to pay a quarterly cash dividend of $0.03 per share. However, the Board of Directors may terminate or modify the dividend program at any time without prior notice.\nContractual obligations\nAs of December 31, 2020, our contractual obligations were:\nPayments due by period\n(in thousands) 2021 2022 2023 2024 2025 and after Other Total\nConvertible senior notes (1) $ 4,500 $ 4,500 $ 4,500 $ 4,500 $ 601,488 $ - $ 619,488\nPurchase obligations (2) 59,685 56,829 7,669 747 351 - 125,281\nOperating lease obligations 22,164 21,747 21,599 7,683 14,431 - 87,624\nInvestment commitments (3) 500 - - - - - 500\nLiability for uncertain tax positions (4) - - - - - 4,680 4,680\n$ 86,849 $ 83,076 $ 33,768 $ 12,930 $ 616,270 $ 4,680 $ 837,573\n(1) Includes principal and interest.\n(2) Represents the fixed or minimum amounts due under purchase obligations for hosting services and sales and marketing programs.\n(3) Represents the maximum funding under existing venture investment agreements. Our investment agreements generally allow us to withhold unpaid funds at our discretion.\n(4) We are unable to reasonably estimate the timing of the cash outflow due to uncertainties in the timing of the effective settlement of tax positions.\nA detailed discussion and analysis of the 2019 year-over-year changes can be found in \"Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\" of our Annual Report on Form 10-K for the year ended December 31, 2019.\nCRITICAL ACCOUNTING ESTIMATES AND SIGNIFICANT JUDGMENTS\nManagement’s discussion and analysis of the financial condition and results of operations is based upon our consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the U.S. and the rules and regulations of the SEC for annual financial reporting. The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. We base our estimates and judgments on historical experience, knowledge of current conditions, and beliefs of what could occur in the future, given the available information.\nWe believe that, of our significant accounting policies, described in “Note 2. Significant Accounting Policies” in Item 8 of this Annual Report, the following accounting policies are most important to the portrayal of our financial condition and require the most subjective judgment. Accordingly, these are the policies we believe are the most critical to aid in fully understanding and evaluating our consolidated financial condition and results of operations. If actual results differ significantly from management’s estimates and projections, there could be a material effect on our financial statements.\nRevenue recognition\nOur contracts with clients typically contain promises by us to provide multiple products and services. Specifically, contracts associated with Pega Platform sales and other software applications, sold either as licenses to use functional intellectual property or as a cloud-based solution, typically include consulting services. Determining whether such products and services within a client contract are considered distinct performance obligations that should be accounted for separately requires significant judgment. We review client contracts to identify all separate promises to transfer goods and services that would be considered performance obligations. Judgment is also required in determining whether an option to acquire additional products and services within a client contract represents a material right that the client would not receive without entering into the contract.\nA contract modification is a legally binding change to the scope, price, or both of an existing contract. Contract modifications are reviewed to determine whether they should be accounted for as part of the original contract or as a separate contract. This determination requires significant judgment, which could impact the timing of revenue recognition. We typically account for contract modifications prospectively as a separate contract. The additional performance obligation(s) in our contract modifications are generally distinct and priced at their stand-alone selling price.\nWe allocate the transaction price to the distinct performance obligations, including options in contracts determined to represent a material right, based on each performance obligation's relative stand-alone selling price. Judgment is required in estimating stand-alone selling prices. We maximize the use of observable inputs by maintaining pricing analyses that consider our pricing policies, historical stand-alone sales when they exist, and historical renewal prices charged to clients. We have concluded that the stand-alone selling prices of certain performance obligations, specifically the stand-alone selling prices of software licenses and Pega Cloud arrangements, are highly variable. In these instances, we estimate the stand-alone selling prices using the residual approach, determined based on total transaction price minus the stand-alone selling price of other performance obligations promised in the contract. We update our stand-alone selling price analysis periodically, including a re-assessment of whether the residual approach used to determine the stand-alone selling prices for software licenses and Pega Cloud arrangements remains appropriate.\nChanges in the assumptions or judgments used in determining the performance obligations in client contracts and stand-alone selling prices could significantly impact the timing and amount of revenue we report in a particular period.\nGoodwill and intangible assets impairment\nOur goodwill and intangible assets result from our previous business acquisitions. Goodwill and intangible assets with indefinite useful lives are not amortized but are tested for impairment at least annually or as circumstances indicate their value may no longer be recoverable. We do not carry any intangible assets with indefinite useful lives other than goodwill. We perform our annual goodwill impairment test as of November 30th. To assess if goodwill is impaired, we first perform a qualitative assessment to determine whether further impairment testing is necessary. If based on the qualitative assessment, we consider it more-likely-than-not that our reporting unit's fair value is less than its carrying amount, we perform a quantitative impairment test. An excess of carrying value over fair value would indicate that goodwill may be impaired. We periodically reevaluate our business and have determined that we have one operating segment and one reporting unit. If our assumptions change in the future, we may be required to record impairment charges to reduce our goodwill's carrying value. Changes in the valuation of goodwill could materially impact our operating results and financial position.\nWe evaluate our intangible assets for impairment whenever events or changes in circumstances indicate that such assets' carrying amount may not be recoverable. In evaluating potential impairment of these assets, we specifically consider whether any indicators of impairment are present, including, but not limited to:\n•whether there has been a significant adverse change in the business climate that affects the value of an asset;\n•whether there has been a significant change in the extent or way an asset is used; and\n•whether it is expected that the asset will be sold or disposed of before the end of its originally estimated useful life.\nIf indicators of impairment are present, we compare the estimated undiscounted cash flows that the specific asset is expected to generate to its carrying value. The key assumptions of the cash flow model involve significant subjectivity. If such assets are impaired, an impairment is measured by the amount by which the carrying amount of the asset exceeds its fair value.\nAs of December 31, 2020, we had $79.2 million of goodwill and $15.7 million of intangible assets. Changes in the valuation of long-lived assets could materially impact our operating results and financial position. To date, there have been no impairments of goodwill or intangible assets.\nAccounting for income taxes\nSignificant judgment is required to determine our provision for income taxes and income tax assets and liabilities, including evaluating uncertainties in applying accounting principles and complex tax laws. Changes in tax laws or our interpretation of tax laws and the resolution of any tax audits could significantly impact our financial statements.\nWe regularly assess the need for a valuation allowance against our deferred tax assets. Future realization of our deferred tax assets ultimately depends on sufficient taxable income within the available carryback or carryforward periods. We record a valuation allowance to reduce our deferred tax assets to an amount we believe is more likely than not to be realized. Changes in our valuation allowance impact income tax expense in the period of adjustment. Our deferred tax valuation allowance requires significant judgment and uncertainties, including assumptions about future taxable income based on historical and projected information.\nWe assess our income tax positions and record tax benefits based upon management’s evaluation of the facts, circumstances, and information available at the reporting date. For those tax positions where it is more-likely-than-not that a tax benefit will be sustained, we record the largest amount of tax benefit with a greater than 50 percent likelihood of being realized upon ultimate settlement with a taxing authority having full knowledge of all relevant information. For those income tax positions where it is not more-likely-than-not that a tax benefit will be sustained, no tax benefit is recognized in the financial statements.\nAs a global company, we use significant judgment to calculate and provide for income taxes in each of the tax jurisdictions in which we operate. In the ordinary course of our business, there are transactions and calculations undertaken whose ultimate tax outcome cannot be certain. Some of these uncertainties arise due to transfer pricing for transactions with our subsidiaries, the determination of tax nexus, and tax credit estimates. In addition, the calculation of acquired tax attributes and the associated limitations are complex. We estimate our exposure to unfavorable outcomes related to these uncertainties and estimate the probability of such outcomes.\nAlthough we believe our estimates are reasonable, no assurance can be given that the final tax outcome will not be different from what is reflected in our historical income tax provisions, returns, and accruals. Such differences, or changes in estimates relating to potential differences, could have a material impact on our income tax provision and operating results in the period in which such a determination is made.\nSee \"Note 16. Income Taxes\" in Item 8 of this Annual Report for additional information.\nConvertible senior notes and capped call transactions\nIn February 2020, we issued Convertible Senior Notes (the \"Notes\") with an aggregate principal amount of $600 million, due March 1, 2025, in a private placement. We also entered into privately negotiated capped call transactions (“Capped Call Transactions”) with certain financial institutions. The Capped Call Transactions cover 4.4 million shares (representing the number of shares for which the Notes are initially convertible) of our common stock and are generally expected to reduce potential dilution of our common stock upon any conversion of the Notes.\nIn accounting for the convertible senior notes and Capped Call Transactions:\n•The initial carrying amount of the liability component was calculated by measuring a similar debt instrument’s fair value that does not have an associated conversion feature. The excess of the Notes’ principal amount over the initial carrying amount of the liability component, the debt discount, is amortized as interest expense over the Notes’ contractual term. The fair value was determined utilizing a discounted cash flow model and required us to make various estimates including, implied credit spread, expected volatility, and the risk-free rate for notes with a similar term.\n•The equity component was recorded as an increase to additional paid-in capital and is not remeasured as long as it continues to meet the conditions for equity classification. The carrying amount of the equity component representing the conversion option was determined by deducting the fair value of the liability component from the par value of the Convertible Senior Notes.\n•The Capped Call Transactions are accounted for as derivative instruments. The Capped Call Transactions do not qualify for the Company’s own equity scope exception in ASC 815 since, in some cases of early settlement, the settlement value of the Capped Call Transactions, calculated in accordance with the governing documents, may not represent a fair value measurement.\nThe fair value of the Capped Call Transactions at the end of each reporting period is determined using a Black-Scholes option-pricing model. The valuation models use various market-based inputs, including stock price, remaining contractual term, expected volatility, risk-free interest rate, and expected dividend yield, as applicable. Management applies judgment in its determination of expected volatility. We consider both historical and implied volatility levels of the underlying equity security and, to a lesser extent, historical peer group volatility levels.\nApplying the accounting framework for the Convertible Senior Notes and the Capped Call Transactions requires the exercise of judgment and the determination of the fair value of the liability component of the convertible notes and the fair value of the Capped Call Transactions requires the Company to make significant estimates and assumptions. As of December 31, 2020, a hypothetical 10% increase in our stock price would have increased the fair value of the capped call to $96.5 million, while a hypothetical 10% decrease in our stock price would have decreased the fair value of the capped call to $70.3 million.\nSee \"Note 2. Significant Accounting Policies\", \"Note 10. Debt\", and \"Note 12. Fair Value Measurements\" in Item 8 of this Annual Report for additional information.\nNew accounting pronouncements\nSee \"Note 2. Significant Accounting Policies\" in Item 8 of this Annual Report for additional information.",
    "item_7A": "ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nMarket risk represents the risk of loss that may affect us due to adverse changes in financial market prices and rates.\nForeign currency exposure\nTranslation risk\nOur foreign operations’ operating expenses are primarily denominated in foreign currencies. However, our international sales are also primarily denominated in foreign currencies, which partially offsets our foreign currency exposure.\nA hypothetical 10% strengthening in the U.S. dollar against other currencies would result in the following impact:\n2020 2019 2018\n(Decrease) increase in revenue (4) % (4) % (4) %\n(Decrease) increase in net income 12 % (7) % (1) %\nRemeasurement risk\nWe experience fluctuations in transaction gains or losses from remeasurement of monetary assets and liabilities denominated in currencies other than the functional currency of the entities in which they are recorded.\nWe are primarily exposed to changes in foreign currency exchange rates associated with the Australian dollar, Euro, and U.S. dollar-denominated cash and cash equivalents, accounts receivable, unbilled receivables, and intercompany receivables and payables held by our U.K. subsidiary, a British pound functional entity.\nA hypothetical 10% strengthening in the British pound exchange rate against the Australian dollar, Euro, and U.S. dollar would result in the following impact:\n(in thousands) December 31, 2020 December 31, 2019 December 31, 2018\nForeign currency (loss) gain $ (7,782) $ 3,633 $ (6,295)",
    "item_8": "ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nReport of Independent Registered Public Accounting Firm 35\nConsolidated Balance Sheets as of December 31, 2020 and 2019\nConsolidated Statements of Operations for the years ended December 31, 2020, 2019, and 2018\nConsolidated Statements of Comprehensive (Loss) Income for the years ended December 31, 2020, 2019, and 2018\nConsolidated Statements of Stockholders’ Equity for the years ended December 31, 2020, 2019, and 2018\nConsolidated Statements of Cash Flows for the years ended December 31, 2020, 2019, and 2018\nNotes to Consolidated Financial Statements 42\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of Pegasystems Inc.\nCambridge, Massachusetts\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Pegasystems Inc. and subsidiaries (the \"Company\") as of December 31, 2020 and 2019, the related consolidated statements of operations, comprehensive (loss) income, stockholders’ equity, and cash flows for each of the three years in the period ended December 31, 2020, and the related notes (collectively referred to as the “financial statements”). We also have audited the Company’s internal control over financial reporting as of December 31, 2020, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2020 and 2019, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2020, in conformity with accounting principles generally accepted in the United States of America. Also, in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2020, based on criteria established in Internal Control - Integrated Framework (2013) issued by COSO.\nBasis for Opinions\nThe Company’s management is responsible for these financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on and Changes in Internal Control over Financial Reporting. Our responsibility is to express an opinion on these financial statements and an opinion on the Company’s internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the financial statements included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures to respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America (“generally accepted accounting principles”). A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current-period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing a separate opinion on the critical audit matters or on the accounts or disclosures to which they relates.\nRevenue Recognition - Software License Arrangements - Refer to Note 2 to the financial statements\nThe Company generates revenue from multiple sources, including software license revenue primarily derived from license sales of the Company’s Pega Platform and other software applications, maintenance revenue from client support, and services revenue primarily derived from cloud sales of the Company’s hosted Pega Platform and other software applications and consulting services.\nThe Company’s license and cloud arrangements often contain multiple performance obligations. These performance obligations may be included in the same contract or negotiated separately. Additionally, the Company enters into amendments to previously executed contracts which constitute contract modifications. Certain new complex arrangements require a detailed analysis of the contractual terms and application of more complex accounting guidance, specifically for contracts with higher contract values. Factors with potentially significant judgments include:\n•Identification of the complete client arrangement\n•Accounting treatment of contract modifications\n•Valuation and allocation of identified material rights\n•Allocation of arrangement consideration to bundled fixed price work orders\nGiven the accounting complexity and the management judgment necessary to properly identify, classify, and account for performance obligations, auditing such estimates involved especially complex and subjective auditor judgment in relation to license and cloud arrangements.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to license and cloud revenue arrangements included the following, among others:\n•We tested the effectiveness of controls over revenue recognition, including those over the identification of performance obligations included in the transaction, accounting treatment of contract modifications, identification of material rights, and allocation of arrangement consideration.\n•We selected a sample of client contracts and performed the following:\n◦Evaluated whether the Company properly identified the terms of the arrangements and considered all arrangement terms that may have an impact on revenue recognition.\n◦Evaluated whether the Company appropriately identified all performance obligations in the arrangement and whether the methodology to allocate the transaction price to the individual performance obligations was appropriately applied.\n◦Tested the accuracy of management’s calculation of revenue for each performance obligation by developing an expectation for the revenue to be recorded in the current period and comparing it to the Company’s recorded balances.\n◦Evaluated management’s assessment of any ongoing negotiations with clients and bundling with statements of work.\n◦Analyzed the proper accounting treatment for any contract modifications based on 1) whether the additional products and services are distinct from the products and services in the original arrangement, and 2) whether the amount of consideration expected for the added products and services reflects the stand-alone selling price of those products and services.\n◦Evaluated management’s determination of whether certain renewal clauses, additional product offers, or additional usage offers represented material rights included in the contract and whether they were properly valued based on the incremental discount provided and the probability of the right being exercised.\n◦For contracts with a performance obligation of bundled fixed price services, evaluated whether management reasonably estimated the number of hours that each project will require and independently recalculated the stand-alone selling price for each bundled fixed price service.\n◦Obtained evidence of delivery of the elements of the arrangement to the client.\nConvertible senior notes and capped calls- Refer to Note 10 to the financial statements\nIn February 2020, the Company issued Convertible Senior Notes (the \"Notes\") with an aggregate principal amount of $600 million, due March 1, 2025, in a private placement. In accounting for the issuance of the Notes, the Company separated the Notes into liability and equity components. The carrying amount of the liability component was calculated by measuring the fair value of a similar debt instrument that does not have an associated convertible feature. The fair value was determined utilizing a discounted cash flow model that includes assumptions such as implied credit spread, expected volatility, and the risk-free rate for notes with a similar term. The carrying amount of the equity component representing the conversion option was determined by deducting the fair value of the liability component from the par value of the Notes. The equity component is not remeasured as long as it continues to meet the conditions for equity classification.\nIn February 2020, the Company also entered into privately negotiated capped call transactions (“Capped Call Transactions”) with certain financial institutions. The Capped Call Transactions are generally expected to reduce potential dilution to the common stock upon any conversion of Notes and/or offset any potential cash payments the Company is required to make in excess of the principal amount of converted Notes. The Capped Call Transactions are accounted for as derivative instruments which are recorded at fair value at the end of each reporting period. The fair value was determined utilizing a lattice model that includes inputs and assumptions such as stock price, expected term, volatility, risk-free rate and implied yield.\nThere is complexity in applying the accounting framework for the Notes and the related Capped Call Transactions. In addition, the determination of the fair value of the liability component of the convertible notes and the Capped Call Transactions requires the Company to make significant estimates and assumptions relating to the implied credit spread, expected volatility, and the risk-free rate for the liability component of the Convertible Notes, and the expected term, volatility, risk-free rate and implied yield for the derivative value of the Capped Call Transactions. Performing audit procedures to evaluate the appropriateness of the accounting framework and the reasonableness of the estimates and assumptions used in the fair value of the liability component of the Notes and the Capped Call Transactions required a high degree of auditor judgment and an increased extent of effort, including the need to involve our fair value specialists.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the accounting for the Notes and Capped Call Transactions, including the Company’s judgments and calculations related to the fair value of the liability component of the Notes and the derivative value of the Capped Call Transactions, included the following procedures, among others:\n•We tested the effectiveness of controls over the Company’s accounting for the Notes and Capped Call Transactions, and over the determination of the fair value of the liability component of the Notes and fair value of the Capped Call Transaction derivative.\n•With the assistance of professionals in our firm having expertise in debt issuance and derivative transaction accounting, we evaluated the Company’s conclusions regarding the accounting treatment applied to the Notes and Capped Call Transactions.\n•With the assistance of fair value specialists, we evaluated the reasonableness of the valuation methodologies and the significant assumptions used to determine the respective fair values of the liability component of the Notes and the Capped Call Transaction derivative, by:\n◦Testing the source information underlying the respective fair values of the liability component of the Notes and the Capped Call Transaction derivative and the mathematical accuracy of the calculations.\n◦Developing estimates of the respective fair values of the liability component of the Notes and the Capped Call Transaction derivative using independent expectations of the significant assumptions, and comparing our estimates of fair value to the Company’s estimates.\n/s/ DELOITTE & TOUCHE LLP\nBoston, Massachusetts\nFebruary 17, 2021\nWe have served as the Company's auditor since 2000.\nPEGASYSTEMS INC.\nCONSOLIDATED BALANCE SHEETS\n(in thousands, except per share amounts)\nDecember 31, 2020 December 31, 2019\nAssets\nCurrent assets:\nCash and cash equivalents $ 171,899 $ 68,363\nMarketable securities 293,269 -\nTotal cash, cash equivalents, and marketable securities 465,168 68,363\nAccounts receivable 215,827 199,720\nUnbilled receivables 207,155 180,219\nOther current assets 88,760 57,308\nTotal current assets 976,910 505,610\nUnbilled receivables 113,278 121,736\nGoodwill 79,231 79,039\nOther long-term assets 434,843 278,427\nTotal assets $ 1,604,262 $ 984,812\nLiabilities and Stockholders’ Equity\nCurrent liabilities:\nAccounts payable $ 24,028 $ 17,475\nAccrued expenses 59,261 48,001\nAccrued compensation and related expenses 123,012 104,126\nDeferred revenue 232,865 190,080\nOther current liabilities 20,969 18,273\nTotal current liabilities 460,135 377,955\nConvertible senior notes, net 518,203 -\nOperating lease liabilities 59,053 52,610\nOther long-term liabilities 24,699 15,237\nTotal liabilities 1,062,090 445,802\nCommitments and Contingencies (Note 19)\nStockholders’ equity:\nPreferred stock, $0.01 par value, 1,000 shares authorized; none issued\n- -\nCommon stock, $0.01 par value, 200,000 shares authorized; 80,890 and 79,599 shares issued and outstanding at December 31, 2020 and 2019, respectively\n809 796\nAdditional paid-in capital 204,432 140,523\nRetained earnings 339,879 410,919\nAccumulated other comprehensive (loss)\nNet unrealized gain on available-for-sale marketable securities, net of tax 46 -\nForeign currency translation adjustments (2,994) (13,228)\nTotal stockholders’ equity 542,172 539,010\nTotal liabilities and stockholders’ equity $ 1,604,262 $ 984,812\nSee notes to consolidated financial statements.\nPEGASYSTEMS INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(in thousands, except per share amounts)\nYear Ended\nDecember 31,\n2020 2019 2018\nRevenue\nSoftware license $ 294,910 $ 279,448 $ 288,119\nMaintenance 296,709 280,580 263,875\nPega Cloud 208,268 133,746 82,627\nConsulting 217,630 217,609 256,960\nTotal revenue 1,017,517 911,383 891,581\nCost of revenue\nSoftware license 2,928 3,656 5,169\nMaintenance 22,311 25,656 24,565\nPega Cloud 76,575 65,828 37,409\nConsulting 209,099 214,882 234,622\nTotal cost of revenue 310,913 310,022 301,765\nGross profit 706,604 601,361 589,816\nOperating expenses\nSelling and marketing 545,693 474,459 373,495\nResearch and development 236,986 205,210 181,710\nGeneral and administrative 67,452 56,570 51,643\nTotal operating expenses 850,131 736,239 606,848\n(Loss) from operations (143,527) (134,878) (17,032)\nForeign currency transaction gain (loss) 3,704 (2,335) 2,421\nInterest income 1,223 2,020 2,715\nInterest expense (19,356) (212) (10)\nGain on capped call transactions 31,697 - -\nOther income (loss), net 1,370 559 363\n(Loss) before (benefit from) income taxes (124,889) (134,846) (11,543)\n(Benefit from) income taxes (63,516) (44,413) (22,160)\nNet (loss) income $ (61,373) $ (90,433) $ 10,617\n(Loss) earnings per share\nBasic $ (0.76) $ (1.14) $ 0.14\nDiluted $ (0.76) $ (1.14) $ 0.13\nWeighted-average number of common shares outstanding\nBasic 80,336 79,055 78,564\nDiluted 80,336 79,055 83,064\nSee notes to consolidated financial statements.\nPEGASYSTEMS INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE (LOSS) INCOME\n(in thousands)\n2020 2019 2018\nNet (loss) income $ (61,373) $ (90,433) $ 10,617\nOther comprehensive income (loss), net of tax\nUnrealized gain (loss) on available-for-sale securities 46 249 (17)\nForeign currency translation adjustments 10,234 (155) (6,600)\nTotal other comprehensive income (loss), net of tax 10,280 94 (6,617)\nComprehensive (loss) income $ (51,093) $ (90,339) $ 4,000\nSee notes to consolidated financial statements.\nPEGASYSTEMS INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\n(in thousands, except per share amounts)\nCommon Stock Additional Paid-In Capital Retained Earnings Accumulated Other Comprehensive (Loss) Income Total\nStockholders’ Equity\nNumber\nof Shares Amount\nBalance at January 1, 2018 78,081 $ 781 $ 152,097 $ 509,697 $ (6,705) $ 655,870\nRepurchase of common stock (1,001) (10) (55,265) - - (55,275)\nIssuance of common stock for stock compensation plans 1,413 14 (39,375) - - (39,361)\nIssuance of common stock under the employee stock purchase plan 33 - 1,767 - - 1,767\nStock-based compensation - - 63,981 - - 63,981\nCash dividends declared ($0.12 per share)\n- - - (9,451) - (9,451)\nOther comprehensive (loss) - - - - (6,617) (6,617)\nNet income - $ - $ - $ 10,617 $ - $ 10,617\nDecember 31, 2018 78,526 $ 785 $ 123,205 $ 510,863 $ (13,322) $ 621,531\nRepurchase of common stock (333) (3) (21,133) - - (21,136)\nIssuance of common stock for stock compensation plans 1,375 14 (44,853) - - (44,839)\nIssuance of common stock under the employee stock purchase plan 31 - 2,202 - - 2,202\nStock-based compensation - - 81,102 - - 81,102\nCash dividends declared ($0.12 per share)\n- - - (9,511) - (9,511)\nOther comprehensive income - - - - 94 94\nNet (loss) - - - (90,433) - (90,433)\nDecember 31, 2019 79,599 $ 796 $ 140,523 $ 410,919 $ (13,228) $ 539,010\nEquity component of convertible senior notes, net - - 61,604 - - 61,604\nRepurchase of common stock (278) (3) (28,271) - - (28,274)\nIssuance of common stock for stock compensation plans 1,536 16 (75,578) - - (75,562)\nIssuance of common stock under the employee stock purchase plan 33 - 3,039 - - 3,039\nStock-based compensation - - 103,115 - - 103,115\nCash dividends declared ($0.12 per share)\n- - - (9,667) - (9,667)\nOther comprehensive income - - - - 10,280 10,280\nNet (loss) - - - (61,373) - (61,373)\nDecember 31, 2020 80,890 $ 809 $ 204,432 $ 339,879 $ (2,948) $ 542,172\nSee notes to consolidated financial statements.\nPEGASYSTEMS INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in thousands)\n2020 2019 2018\nOperating activities\nNet (loss) income $ (61,373) $ (90,433) $ 10,617\nAdjustments to reconcile net (loss) income to cash (used in) provided by operating activities\nStock-based compensation 103,068 80,909 63,862\n(Gain) loss on capped call transactions (31,697) - -\nDeferred income taxes (59,777) (49,317) (30,898)\nAmortization of deferred commissions 33,302 29,152 17,271\nLease expense 16,248 14,497 -\nAmortization of debt discount and issuance costs 14,813 - -\nAmortization of intangible assets and depreciation 21,348 21,396 25,295\nAmortization of investments 1,073 800 1,596\nForeign currency transaction (gain) loss (3,704) 2,335 (2,421)\nOther non-cash (879) (521) (1,678)\nChange in operating assets and liabilities:\nAccounts receivable, unbilled receivables, and contract assets (32,321) 1,088 25,779\nOther current assets (12,959) (6,344) (6,068)\nAccounts payable, accrued compensation, and accrued expenses 37,945 25,670 20,798\nDeferred revenue 43,661 1,937 28,951\nDeferred commissions (55,175) (49,746) (44,036)\nOther long-term assets and liabilities (14,136) (23,588) (4,712)\nCash (used in) provided by operating activities (563) (42,165) 104,356\nInvesting activities\nPurchases of investments (326,549) (11,424) (69,494)\nProceeds from maturities and called investments 28,811 13,634 33,991\nSales of investments 1,424 89,406 -\nPayments for acquisitions, net of cash acquired - (10,934) (800)\nInvestment in property and equipment (25,369) (10,608) (11,893)\nCash (used in) provided by investing activities (321,683) 70,074 (48,196)\nFinancing activities\nProceeds from issuance of convertible senior notes 600,000 - -\nPurchase of capped calls related to convertible senior notes (51,900) - -\nPayment of debt issuance costs (14,527) - -\nDividend payments to stockholders (9,628) (9,486) (9,432)\nProceeds from revolving credit facility - 45,000 -\nPayments on revolving credit facility - (45,000) -\nCommon stock repurchases for tax withholdings for net settlement of equity awards (72,523) (42,637) (37,594)\nCommon stock repurchases under stock repurchase program (27,974) (22,135) (54,434)\nCash provided by (used in) financing activities 423,448 (74,258) (101,460)\nEffect of exchange rate changes on cash and cash equivalents 2,334 290 (2,557)\nNet increase (decrease) in cash and cash equivalents 103,536 (46,059) (47,857)\nCash and cash equivalents, beginning of period 68,363 114,422 162,279\nCash and cash equivalents, end of period $ 171,899 $ 68,363 $ 114,422\nSupplemental disclosures\nInterest paid on convertible notes $ 2,338 $ - $ -\nIncome taxes paid $ 3,377 $ 4,745 $ 6,630\nNon-cash investing and financing activity:\nDividends payable $ 2,427 $ 2,388 $ 2,363\nSee notes to consolidated financial statements.\nPEGASYSTEMS INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1. BASIS OF PRESENTATION\nBusiness\nThe Company develops, markets, licenses, and supports customer engagement and digital process automation software applications in addition to the Pega Platform™ for clients that wish to build and extend their own applications. The Company provides consulting, training, support, and hosting services to facilitate the use of its software.\nManagement estimates and reporting\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America (“U.S.”) requires management to make estimates and judgments that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the periods presented. Actual results could differ from those estimates. Accounts with reported amounts based on significant estimates and judgments include, but are not limited to, revenue, unbilled receivables, deferred revenue, deferred income taxes, deferred commissions, income taxes payable, convertible senior notes, capped call transactions, intangible assets, and goodwill.\nPrinciples of consolidation\nThe Company’s consolidated financial statements reflect Pegasystems Inc. and subsidiaries in which the Company holds a controlling financial interest. All intercompany accounts and transactions were eliminated in consolidation.\n2. SIGNIFICANT ACCOUNTING POLICIES\nRevenue\nThe Company’s revenue is primarily derived from:\n•software license revenue from sales of the Company’s Pega Platform and software applications. Software licenses represent functional intellectual property and are delivered separately from maintenance and services.\n•maintenance revenue from client support including software upgrades (on a when and if available basis), telephone support, and bug fixes or patches.\n•Pega Cloud revenue, which is sales of the Company’s hosted Pega Platform and software applications.\n•consulting revenue, which is primarily related to new software license implementations, training, and reimbursable costs.\nPerformance Obligations\nThe Company’s software license and Pega Cloud arrangements often contain multiple performance obligations. If a contract contains multiple performance obligations, the Company accounts for each distinct performance obligation separately. The transaction price is allocated to the separate performance obligations on a relative stand-alone selling price basis. Any discounts or expected potential future price concessions are considered when determining the total transaction price. The Company’s policy is to exclude sales and similar taxes collected from clients from the determination of transaction price.\nThe Company’s typical performance obligations are:\nPerformance Obligation How Standalone Selling Price is Typically Determined When Performance Obligation is Typically Satisfied When Payment is Typically Due\nPerpetual license Residual approach Upon transfer of control to the client, defined when the client can use and benefit from the license (point in time) Effective date of the license\nTerm license Residual approach Upon transfer of control to the client, defined when the client can use and benefit from the license (point in time) Annually, or more frequently, over the term of the license\nMaintenance Consistent pricing relationship as a percentage of the related license and observable in stand-alone renewal transactions (1)\nRatably over the term of the maintenance (over time) Annually, or more frequently, over the term of the maintenance\nPega Cloud Residual approach Ratably over the term of the service (over time) Annually, or more frequently, over the term of the service\nConsulting\n- time and materials Observable hourly rate for time and materials-based services in similar geographies for similar contract sizes Based on hours incurred to date Monthly\nConsulting\n- fixed price Observable hourly rate for time and materials-based services in similar geographies for similar contract sizes multiplied by estimated hours for the project Based on hours incurred as a percentage of total estimated hours As contract milestones are achieved\n(1) Technical support and software updates are considered distinct services but accounted for as a single performance obligation, as they have the same pattern of transfer to the client.\nThe Company utilizes the residual approach for performance obligations since the selling price is highly variable and stand-alone selling price is not discernible from past transactions or other observable evidence. Periodically, the Company reevaluates whether the residual approach remains appropriate. As required, the Company evaluates its residual approach estimate compared to all available observable data in order to conclude the estimate is representative of its stand-alone selling price.\nIf the contract grants the client the option to acquire additional products or services, the Company assesses whether the option represents a material right to the client that the client would not receive without entering into that contract. Discounts on options to purchase additional products and services greater than discounts available to similar clients are accounted for as an additional performance obligation.\nDuring most of each client contract term, the amount invoiced is generally less than the amount of revenue recognized to date, primarily because we transfer control of the performance obligation related to the software license at the inception of the contract term. A significant portion of the total contract consideration is typically allocated to the license performance obligation. Therefore, our contracts often result in the recording of unbilled receivables and contract assets throughout most of the contract term. The Company records an unbilled receivable or contract asset when revenue recognized on a contract exceeds the billings. The Company recognizes an impairment on receivables and contract assets if, after contract inception, it becomes probable that payment is not collectible. The Company reviews receivables and contract assets on an individual basis for impairment.\nVariable consideration\nThe Company’s arrangements can include variable fees, such as the option to purchase additional usage of a previously delivered software license. The Company may also provide pricing concessions to clients, a business practice that also gives rise to variable fees in contracts. For variable fees arising from the client’s acquisition of additional usage of a previously delivered software license, the Company applies the sales and usage-based royalties guidance related to a license of intellectual property and recognizes the revenue in the period the underlying sale or usage occurs. The Company includes variable fees in the determination of total transaction price if it is not probable that a future significant reversal of revenue will occur. The Company uses the expected value or most likely value amount, whichever is more appropriate for specific circumstances, to estimate variable consideration, and the estimates are based on the level of historical price concessions offered to clients. The variable consideration related to pricing concessions and other forms of variable consideration, including usage-based fees, have not been material to the Company’s consolidated financial statements.\nSignificant financing components\nThe Company generally does not intend to provide financing to its clients, as financing arrangements are not contemplated as part of the negotiated terms of contracts between the Company and its clients. Although there may be instances with an intervening period between the delivery of the license and the payment, typically in term license arrangements, the purpose of that timing difference is to align the client’s payment with the timing of the use of the software license or service.\nIn certain circumstances, however, there are instances where revenue recognition timing differs from the timing of payment due to extended payment terms or fees that are non-proportional to the associated usage of software licenses. In these instances, the Company evaluates whether a significant financing component exists. This evaluation includes determining the difference between the consideration the client would have paid at the time the performance obligation was satisfied and the amount of consideration actually paid. Contracts that include a significant financing component are adjusted for the time value of money at the rate inherent in the contract, the client’s borrowing rate, or the Company’s incremental borrowing rate, depending upon the recipient of the financing.\nDuring 2020, 2019, and 2018, significant financing components were not material.\nContract modifications\nThe Company assesses contract modifications to determine:\n•if the additional products and services are distinct from the products and services in the original arrangement; and\n•if the amount of consideration expected for the added products and services reflects the stand-alone selling price of those products and services.\nA contract modification meeting both criteria is accounted for as a separate contract. A contract modification not meeting both criteria is considered a change to the original contract and is accounted for on either:\n•a prospective basis as a termination of the existing contract and the creation of a new contract; or\n•a cumulative catch-up basis.\nDeferred commissions\nThe Company recognizes an asset for the incremental costs of obtaining a client contract, primarily related to sales commissions. The Company expects to benefit from those costs for more than one year, as the Company primarily pays sales commissions on the initial contract. As a result, there are no commensurate commissions paid on contract renewals. Deferred commissions are allocated to each performance obligation within the contract and amortized according to the transfer of underlying goods and services within those contracts and expected renewals. The expected benefit period is determined based on the length of the client contracts, client attrition rates, the underlying technology life-cycle, and the competitive marketplace’s influence in which the products and services are sold. Deferred costs allocated to maintenance and deferred costs for Pega Cloud arrangements are amortized over an average expected benefit period of five years. Deferred costs allocated to software licenses, and any expected renewals of term software licenses within the five years expected benefit period, are amortized at the point in time control of the software license is transferred. Deferred costs allocated to consulting are amortized over a period consistent with the pattern of transfer of control for the related services.\nFinancial instruments\nThe principal financial instruments held by the Company consist of cash equivalents, marketable securities, receivables, capped call transactions, and accounts payable. The Company considers debt securities that are readily convertible to known amounts of cash with maturities of three months or less from the purchase date to be cash equivalents. Interest is recorded when earned. All of the Company’s investments are classified as available-for-sale and are carried at fair value. Unrealized gains and losses considered temporary in nature are recorded as a component of accumulated other comprehensive loss, net of related income taxes. The Company reviews all investments for reductions in fair value that are other-than-temporary. When such reductions occur, the investment cost is adjusted to fair value by recording a loss on investments in the consolidated statements of operations. Gains and losses on investments are calculated based upon the specific investment.\nSee \"Note 4. Receivables, Contract Assets, And Deferred Revenue\", \"Note 10. Debt\", and \"Note 12. Fair Value Measurements\" for additional information.\nProperty and equipment\nProperty and equipment are recorded at cost. Depreciation and amortization are computed using the straight-line method over the estimated useful lives of the assets, which are three years for computer equipment and five years for furniture and fixtures. Leasehold improvements are amortized over the lesser of the lease’s term or the useful life of the asset. Repairs and maintenance costs are expensed as incurred.\nLeases\nAll the Company’s leases are operating leases, primarily composed of office space leases. The Company accounts for a contract as a lease when it has the right to control the asset for a period of time while obtaining substantially all of the asset’s economic benefits. The Company determines the initial classification and measurement of its operating right of use assets and lease liabilities at the lease commencement date and thereafter if modified. Fixed lease costs are recognized on a straight-line basis over the term of the lease. Variable lease costs are recognized in the period in which the obligation for those payments is incurred. The Company combines lease and non-lease components in the determination of lease costs for its office space leases. The lease liability includes lease payments related to options to extend or renew the lease term if the Company is reasonably certain it will exercise those options. The Company’s leases do not contain any material residual value guarantees or restrictive covenants.\nInternal-use software\nThe Company capitalizes and amortizes certain direct costs associated with computer software developed or purchased for internal use incurred during the application development stage. Costs related to preliminary project activities and post-implementation activities are expensed as incurred. The Company amortizes capitalized software costs generally over three to five years, commencing on the date the software is placed into service.\nGoodwill\nGoodwill represents the residual purchase price paid in a business combination after the fair value of all identified assets and liabilities have been recorded. Goodwill is not amortized. The Company has a single reporting unit. The Company performed a qualitative assessment as of November 30, 2020, 2019, and 2018, and concluded that there was no impairment since it was not more likely than not that the fair value of its reporting unit was less than its carrying value.\nIntangible and long-lived assets\nAll of the Company’s intangible assets are amortized using the straight-line method over their estimated useful life. The Company evaluates its long-lived tangible and intangible assets for impairment whenever events or changes in circumstances indicate that such assets’ carrying amount may not be recoverable. Impairment is assessed by comparing the undiscounted cash flows expected to be generated by the long-lived tangible or intangible assets to their carrying value. If impairment exists, the Company calculates the impairment by comparing the carrying value to its fair value as determined by discounted expected cash flows.\nCash equivalents\nCash equivalents include money market funds, time deposits and other investments with original maturities of three months or less.\nBusiness combinations\nThe Company uses its best estimates and assumptions to assign a fair value to the tangible and intangible assets acquired and liabilities assumed at the acquisition date. The Company’s estimates are inherently uncertain and subject to refinement. During the measurement period, which may be up to one year from the acquisition date, the Company may record adjustments to the fair value of these tangible and intangible assets acquired and liabilities assumed, with the corresponding offset to goodwill. In addition, uncertain tax positions and tax-related valuation allowances are initially established in connection with a business combination as of the acquisition date. The Company continues to collect information and reevaluates these estimates and assumptions quarterly and records any adjustments to the Company’s preliminary estimates to goodwill provided that the Company is within the measurement period. Upon the conclusion of the measurement period or final determination of the fair value of assets acquired or liabilities assumed, whichever comes first, any subsequent adjustments are recorded to the Company’s consolidated statements of operations.\nResearch and development and software development costs\nResearch and development costs are expensed as incurred. Capitalization of computer software developed for resale begins upon the establishment of technological feasibility, generally demonstrated by a working model or an operative version of the computer software product. Such costs have not been material to date, as technological feasibility is established within a short time frame from the software’s general availability. As a result, no costs were capitalized in 2020, 2019, or 2018.\nStock-based compensation\nThe Company recognizes stock-based compensation expense associated with equity awards based on the award’s fair value at the grant date. Stock-based compensation is recognized over the requisite service period, which is generally the vesting period of the equity award and is adjusted each period for anticipated forfeitures. See \"Note 14. Stock-Based Compensation\" for discussion of the Company’s key assumptions included in determining the fair value of its equity awards at the grant date.\nForeign currency translation and remeasurement\nThe translation of assets and liabilities for the Company’s subsidiaries with functional currencies other than the U.S. dollar are made at period-end exchange rates. Revenue and expense accounts are translated at the average exchange rates during the period transactions occurred. The resulting translation adjustments are reflected in accumulated other comprehensive income. Realized and unrealized exchange gains or losses from transactions and remeasurement adjustments are reflected in foreign currency transaction gain (loss) in the accompanying consolidated statements of operations.\nAccounting for income taxes\nThe Company uses the asset and liability method of accounting for income taxes. Under this method, deferred tax assets and liabilities are determined based on temporary differences between the financial statement and tax basis of assets and liabilities using enacted tax rates in effect for the year in which the differences are expected to reverse. The Company regularly assesses the need for a valuation allowance against its deferred tax assets. Future realization of the Company’s deferred tax assets ultimately depends on sufficient taxable income within the available carryback or carryforward periods. Taxable income sources include taxable income in prior carryback years, future reversals of existing taxable temporary differences, tax planning strategies, and future taxable income. The Company records a valuation allowance to reduce its deferred tax assets to an amount it believes is more-likely-than-not to be realized. Changes in the valuation allowance impacts income tax expense in the period of adjustment. The Company’s deferred tax valuation allowance requires significant judgment and uncertainties, including assumptions about future taxable income that are based on historical and projected information. The Company recognizes excess tax benefits when they are realized, as a reduction of the provision for income taxes.\nThe Company assesses its income tax positions and records tax benefits based upon management’s evaluation of the facts, circumstances, and information available at the reporting date. For those tax positions where it is more-likely-than-not that a tax benefit will be sustained, the Company records the largest amount of tax benefit with a greater than 50 percent likelihood of being realized upon ultimate settlement with a taxing authority having full knowledge of all relevant information. For those income tax positions where it is not more-likely-than-not that a tax benefit will be sustained, no tax benefit is recognized in the financial statements. The Company classifies liabilities for uncertain tax positions as non-current liabilities unless the uncertainty is expected to be resolved within one year. The Company classifies interest and penalties on uncertain tax positions as income tax expense.\nAs a global company, the Company uses significant judgment to calculate and provide for income taxes in each of the tax jurisdictions in which it operates. In the ordinary course of the Company’s business, there are transactions and calculations undertaken whose ultimate tax outcome cannot be certain. Some of these uncertainties arise as a consequence of transfer pricing for transactions with the Company’s subsidiaries and nexus and tax credit estimates. In addition, the calculation of acquired tax attributes and the associated limitations are complex. See \"Note 16. Income Taxes\" for additional information.\nAdvertising expense\nAdvertising costs are expensed as incurred. Advertising costs were $8.7 million, $6.7 million, and $6.9 million during 2020, 2019, and 2018, respectively.\nNew Accounting Standards\nConvertible debt\nIn August 2020, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) No. 2020-06, “Accounting for Convertible Instruments and Contracts in an Entity’s Own Equity” (ASU 2020-06), which simplifies the accounting for certain financial instruments with characteristics of liabilities and equity, including convertible instruments and contracts in an entity’s own equity. The standard eliminates the liability and equity separation model for convertible instruments with a cash conversion feature. As a result, after adoption, entities will no longer separately present in equity an embedded conversion feature for such debt. Additionally, the embedded conversion feature will no longer be amortized into income as interest expense over the instrument’s life. Instead, entities will account for a convertible debt instrument wholly as debt unless (1) a convertible instrument contains features that require bifurcation as a derivative under ASC Topic 815, Derivatives and Hedging, or (2) a convertible debt instrument was issued at a substantial premium. Additionally, the standard requires applying the if-converted method to calculate convertible instruments’ impact on diluted earnings per share (“EPS”). The standard is effective for fiscal years beginning after December 15, 2021, with early adoption permitted for fiscal years beginning after December 15, 2020. It can be adopted on either a full retrospective or modified retrospective basis. The Company is currently evaluating the effect this ASU will have on its consolidated financial statements and related disclosures. The Company expects to elect to early adopt the new standard in the first quarter of 2021.\n3. MARKETABLE SECURITIES\nDecember 31, 2020\n(in thousands) Amortized Cost Unrealized Gains Unrealized Losses Fair Value\nGovernment debt $ 39,996 $ - $ (8) $ 39,988\nCorporate debt 253,345 88 (152) 253,281\n$ 293,341 $ 88 $ (160) $ 293,269\nAs of December 31, 2020, marketable securities maturities ranged from January 2021 to December 2023, with a weighted-average remaining maturity of 1.5 years.\nAs of December 31, 2019, the Company did not hold any marketable securities.\n4. RECEIVABLES, CONTRACT ASSETS, AND DEFERRED REVENUE\nReceivables\n(in thousands)\nDecember 31, 2020 December 31, 2019\nAccounts receivable $ 215,827 $ 199,720\nUnbilled receivables 207,155 180,219\nLong-term unbilled receivables 113,278 121,736\n$ 536,260 $ 501,675\nUnbilled receivables are client committed amounts for which revenue recognition precedes billing, and billing is solely subject to the passage of time.\nUnbilled receivables are expected to be billed in the future as follows:\n(Dollars in thousands)\nDecember 31, 2020\n1 year or less $ 207,155 65 %\n1-2 years 83,992 26 %\n2-5 years 29,286 9 %\n$ 320,433 100 %\nUnbilled receivables based upon contract effective date:\n(Dollars in thousands)\nDecember 31, 2020\n2020 $ 149,867 47 %\n2019 87,941 27 %\n2018 31,097 10 %\n2017 31,668 10 %\n2016 and prior 19,860 6 %\n$ 320,433 100 %\nMajor clients\nNo client represented 10% or more of the Company’s total accounts receivable and unbilled receivables as of December 31, 2020 or December 31, 2019.\nContract assets and deferred revenue\n(in thousands)\nDecember 31, 2020 December 31, 2019\nContract assets (1)\n$ 15,296 $ 5,558\nLong-term contract assets (2)\n7,777 5,420\n$ 23,073 $ 10,978\nDeferred revenue $ 232,865 $ 190,080\nLong-term deferred revenue (3)\n8,991 5,407\n$ 241,856 $ 195,487\n(1) Included in other current assets. (2) Included in other long-term assets. (3) Included in other long-term liabilities.\nContract assets are client committed amounts for which revenue recognized exceeds the amount billed to the client where the right to payment is subject to conditions other than the passage of time, such as completing a related performance obligation. Deferred revenue consists of billings and payments received in advance of revenue recognition. Contract assets and deferred revenue are netted at the contract level for each reporting period.\nThe change in deferred revenue in the year ended December 31, 2020 was primarily due to new billings in advance of revenue recognition and $187.6 million of revenue recognized during the period that was included in deferred revenue on December 31, 2019.\n5. DEFERRED COMMISSIONS\nDecember 31,\n(in thousands)\n2020 2019\nDeferred commissions (1)\n$ 108,624 $ 85,314\n(1) Included in other long-term assets.\n(in thousands) 2020 2019 2018\nAmortization of deferred commissions (1)\n$ 33,302 $ 29,152 $ 17,271\n(1) Included in selling and marketing expenses.\n6. PROPERTY AND EQUIPMENT (1)\n(in thousands) December 31,\n2020 2019\nLeasehold improvements\n$ 52,335 $ 42,162\nComputer equipment\n30,211 25,147\nFurniture and fixtures\n10,572 8,524\nComputer software purchased\n8,415 7,775\nComputer software developed for internal use\n18,542 17,606\nFixed assets in progress\n2,077 4,044\n122,152 105,258\nLess: accumulated depreciation\n(81,754) (70,975)\n$ 40,398 $ 34,283\n(1) Included in other long-term assets.\n(in thousands) 2020 2019 2018\nDepreciation expense $ 17,378 $ 14,771 $ 13,875\n7. GOODWILL AND OTHER INTANGIBLE ASSETS\nGoodwill\n(in thousands)\n2020 2019\nJanuary 1, $ 79,039 $ 72,858\nAcquisition - 6,179\nCurrency translation adjustments 192 2\nDecember 31, $ 79,231 $ 79,039\nIntangibles\nIntangible assets are recorded at cost and amortized using the straight-line method over their estimated useful lives as follows:\nDecember 31, 2020\n(in thousands) Useful Lives Cost Accumulated Amortization Net Book Value (1)\nClient-related\n4-10 years\n$ 63,168 $ (55,877) $ 7,291\nTechnology\n2-10 years\n64,843 (56,386) 8,457\nOther\n1-5 years\n5,361 (5,361) -\n$ 133,372 $ (117,624) $ 15,748\n(1) Included in other long-term assets.\nDecember 31, 2019\n(in thousands) Useful Lives Cost Accumulated Amortization Net Book Value (1)\nClient-related 4-10 years\n$ 63,140 $ (54,368) $ 8,772\nTechnology 2-10 years\n64,843 (53,898) 10,945\nOther 1-5 years\n5,361 (5,361) -\n$ 133,344 $ (113,627) $ 19,717\n(1) Included in other long-term assets.\nAmortization of intangible assets was:\n(in thousands)\n2020 2019 2018\nCost of revenue $ 2,487 $ 3,500 $ 5,027\nSelling and marketing 1,483 3,125 6,416\n$ 3,970 $ 6,625 $ 11,443\nFuture estimated amortization expense related to intangible assets:\n(in thousands)\nDecember 31, 2020\n2021 $ 3,657\n2022 3,557\n2023 3,289\n2024 2,520\n2025 and after 2,725\n$ 15,748\n8. SEGMENT INFORMATION\nOperating segments are defined as components of an enterprise about which separate financial information is available that is evaluated regularly by the chief operating decision-maker (“CODM”) in deciding how to allocate resources and in assessing performance.\nThe Company derives substantially all of its revenue from the sale and support of one group of similar products and services - software that provides case management, business process management, and real time decisioning solutions to improve customer engagement and operational excellence in the enterprise applications market. To assess performance, the Company’s CODM, the Chief Executive Officer, reviews financial information on a consolidated basis. Therefore, the Company determined it has one operating segment and one reporting unit.\nLong-lived assets related to the Company’s U.S. and international operations were:\n(Dollars in thousands) December 31,\n2020 2019\nU.S. $ 31,339 78 % $ 26,644 78 %\nInternational 9,059 22 % 7,639 22 %\n$ 40,398 100 % $ 34,283 100 %\n9. LEASES\nExpense\n(in thousands) 2020 2019\nFixed lease costs $ 20,235 $ 18,250\nShort-term lease costs 1,669 1,291\nVariable lease costs 4,470 5,554\n$ 26,374 $ 25,095\nTotal rent expense under operating leases was $14.9 million for 2018.\nRight of use assets and lease liabilities\n(in thousands) December 31, 2020 December 31, 2019\nRight of use assets (1)\n$ 67,651 $ 58,273\nLease liabilities (2)\n$ 18,541 $ 15,885\nLong-term lease liabilities $ 59,053 $ 52,610\n(1) Represents the Company’s right to use the leased asset during the lease term. Included in other long-term assets. (2) Included in other current liabilities.\nThe weighted-average remaining lease term and discount rate for the Company’s leases were:\nDecember 31, 2020 December 31, 2019\nWeighted-average remaining lease term 4.7 years 4.0 years\nWeighted-average discount rate (1)\n5.4 % 5.8 %\n(1) The rates implicit in most of the Company’s leases are not readily determinable. Therefore the Company uses its incremental borrowing rate as the discount rate when measuring operating lease liabilities. The incremental borrowing rate represents an estimate of the interest rate the Company would incur to borrow an amount equal to the lease payments on a collateralized basis over the lease term in a similar economic environment.\nMaturities of lease liabilities are:\n(in thousands) December 31, 2020\n1 year or less $ 22,164\n1-2 years 21,747\n2-3 years 21,599\n3-4 years 7,683\n> 4 years 14,431\nTotal lease payments 87,624\nLess: imputed interest (1) (10,030)\nTotal short and long-term lease liabilities $ 77,594\n(1) Lease liabilities are measured at the present value of the remaining lease payments using a discount rate determined at lease commencement, unless the discount rate is updated due to a lease reassessment event.\nCash flow information\n(in thousands) 2020 2019\nCash paid for leases $ 20,548 $ 19,727\nRight of use assets recognized for new leases and amendments (non-cash) $ 24,276 $ 31,155\n10. DEBT\nConvertible senior notes and capped calls\nConvertible senior notes\nIn February 2020, the Company issued Convertible Senior Notes (the \"Notes\") with an aggregate principal amount of $600 million, due March 1, 2025, in a private placement. The proceeds from the Notes were used or are anticipated to be used for the Capped Call Transactions (described below), working capital, and other general corporate purposes. There are no required principal payments until the maturity of the Notes. The Notes accrue interest at an annual rate of 0.75%, payable semi-annually in arrears on March 1 and September 1, beginning on September 1, 2020.\nProceeds from the Notes and Capped Call Transactions:\n(in thousands) Amount\nPrincipal $ 600,000\nLess: issuance costs (14,527)\nLess: Capped Call Transactions (51,900)\n$ 533,573\nConversion rights\nThe conversion rate is 7.4045 shares of common stock per $1,000 principal amount of the Notes, representing an initial conversion price of $135.05 per share of common stock. The Company will settle conversions by paying or delivering, as applicable, cash, shares of its common stock, or a combination of cash and shares of its common stock, at the Company’s election, based on the applicable conversion rate. The conversion rate will be adjusted upon the occurrence of certain events, including spin-offs, tender offers, exchange offers, and certain stockholder distributions.\nBeginning on September 1, 2024, noteholders may convert their Notes at any time at their election. Before September 1, 2024, noteholders may convert their Notes in the following circumstances:\n•During any calendar quarter commencing after the calendar quarter ending on June 30, 2020 (and only during such calendar quarter), if the last reported sale price per share of the Company’s common stock exceeds one hundred and thirty percent (130%) of the conversion price for each of at least twenty (20) trading days (whether or not consecutive) during the thirty (30) consecutive trading days ending on, and including, the last trading day of the immediately preceding calendar quarter.\n•During the five consecutive business days immediately after any five consecutive trading day period (the “Measurement Period”), if the trading price per $1,000 principal amount of Notes for each trading day of the Measurement Period was less than 98% of the product of the last reported sale price per share of common stock on such trading day and the conversion rate on such trading day.\n•Upon the occurrence of certain corporate events or distributions, or if the Company calls all or any Notes for redemption, then the noteholder of any Note may convert such Note at any time before the close of business on the business day immediately before the related redemption date (or if the Company fails to pay the redemption price due on such redemption date in full, at any time until the Company pays such redemption price in full).\nAs of December 31, 2020, no Notes were eligible for conversion at the noteholders’ election.\nRepurchase rights\nOn or after March 1, 2023 and on or before the 40th scheduled trading day immediately before the maturity date, the Company may redeem for cash all or part of the Notes at a repurchase price equal to 100% of the principal amount, plus accrued and unpaid interest, if the last reported sale price of the Company’s common stock exceeded 130% of the conversion price then in effect for at least 20 trading days (whether or not consecutive) during any 30 consecutive trading day period ending on, and including, the trading day immediately preceding the date on which the Company provides a redemption notice.\nIf certain corporate events that constitute a “Fundamental Change” (as described below) occur at any time, each noteholder will have the right, at such noteholder’s option, to require the Company to repurchase for cash all of such noteholder’s Notes, or any portion of the principal thereof that is equal to $1,000 or an integral multiple of $1,000, at a repurchase price equal to 100% of the principal amount thereof, plus accrued and unpaid interest. A fundamental change relates to events such as mergers, changes in control of the Company, liquidation/dissolution of the Company, or the delisting of the Company’s common stock.\nImpact of the Notes\nIn accounting for the transaction, the Notes have been separated into liability and equity components.\n•The initial carrying amount of the liability component was calculated by measuring a similar debt instrument’s fair value that does not have an associated conversion feature. The excess of the Notes’ principal amount over the initial carrying amount of the liability component, the debt discount, is amortized as interest expense over the Notes’ contractual term.\n•The equity component was recorded as an increase to additional paid-in capital and is not remeasured as long as it continues to meet the conditions for equity classification. The carrying amount of the equity component representing the conversion option was determined by deducting the fair value of the liability component from the par value of the Convertible Senior Notes.\nThe Company incurred issuance costs of $14.5 million related to the Notes, allocated between the Notes’ liability and equity components proportionate to the initial carrying amount of the liability and equity components.\n•Issuance costs attributable to the liability component are recorded as an offset to the Notes’ principal balance. They are amortized as interest expense using the effective interest method over the contractual term of the Notes.\n•Issuance costs attributable to the equity component are recorded as an offset to the equity component in additional paid-in capital and are not amortized.\nNet carrying amount of the liability component:\n(in thousands) December 31, 2020\nPrincipal $ 600,000\nUnamortized debt discount (71,222)\nUnamortized issuance costs (10,575)\n$ 518,203\nNet carrying amount of the equity component, included in additional paid-in capital:\n(in thousands) December 31, 2020\nConversion options (1)\n$ 61,604\n(1) Net of issuance costs and taxes.\nInterest expense related to the Notes:\n(in thousands) 2020\nContractual interest expense (0.75% coupon)\n$ 3,825\nAmortization of debt discount (1)\n12,898\nAmortization of issuance costs (1)\n1,915\n$ 18,638\n(1) Amortized based upon an effective interest rate of 4.31%.\nFuture payments of principal and contractual interest:\nDecember 31, 2020\n(in thousands) Principal Interest Total\n2021 - 4,500 4,500\n2022 - 4,500 4,500\n2023 - 4,500 4,500\n2024 - 4,500 4,500\n2025 600,000 1,488 601,488\n$ 600,000 $ 19,488 $ 619,488\nCapped Call Transactions\nIn February 2020, the Company entered into privately negotiated capped call transactions (“Capped Call Transactions”) with certain financial institutions. The Capped Call Transactions cover 4.4 million shares (representing the number of shares for which the Notes are initially convertible) of the Company’s common stock. They are generally expected to reduce potential dilution to the common stock upon any conversion of Notes and/or offset any potential cash payments the Company is required to make in excess of the principal amount of converted Notes, as the case may be, with such reduction and/or offset subject to a cap. The cap price of the Capped Call Transactions is $196.44, subject to adjustment upon the occurrence of specified extraordinary events affecting the Company, including merger events and tender offers.\nThe Capped Call Transactions are accounted for as derivative instruments. The Capped Call Transactions do not qualify for the Company’s own equity scope exception in ASC 815 since, in some cases of early settlement, the settlement value of the Capped Call Transactions, calculated in accordance with the governing documents, may not represent a fair value measurement. The Capped Call Transactions are classified as “other long-term assets” and remeasured to fair value at the end of each reporting period, resulting in a non-operating gain or loss.\nChange in value of Capped Call Transactions:\n(in thousands) Year Ended\nDecember 31, 2020\nValue at issuance $ 51,900\nFair value adjustment 31,697\nBalance as of December 31, $ 83,597\nCredit facility\nIn November 2019, and as amended as of February 2020, July 2020, and September 2020, the Company entered into a five-year $100 million senior secured revolving credit agreement (the “Credit Facility”) with PNC Bank, National Association (“PNC”). The Company may use borrowings to finance working capital needs and for general corporate purposes. Subject to specific conditions, the Credit Facility allows the Company to increase the aggregate commitment to $200 million. The commitments expire on November 4, 2024, and any outstanding loans will be payable on such date. The Credit Facility, as amended, contains customary covenants, including, but not limited to, those relating to additional indebtedness, liens, asset divestitures, and affiliate transactions.\nThe Company is also required to comply with financial covenants, including:\n•Beginning with the fiscal quarter ended on September 30, 2020 and ending with the fiscal quarter ended December 31, 2021, at least $200 million in cash and investments held by Pegasystems Inc.\n•Beginning with the quarter ended on March 31, 2022, a maximum net consolidated leverage ratio of 3.5 to 1.0 (with a step-up in the event of certain acquisitions) and a minimum consolidated interest coverage ratio of 3.5 to 1.0.\nAs of December 31, 2020 and December 31, 2019, the Company had no outstanding borrowings under the Credit Facility.\n11. STOCKHOLDERS’ EQUITY\nPreferred stock\nThe Company has 1 million authorized shares of preferred stock, $0.01 par value per share, of which none were issued and outstanding at December 31, 2020. The Board of Directors has the authority to issue the shares of preferred stock in one or more series, to establish the number of shares to be included in each series, and to determine the designation, powers, preferences, and rights of the shares of each series and the qualifications, limitations, or restrictions thereof, without any further vote or action by the stockholders. The issuance of preferred stock could decrease the earnings and assets available for distribution to holders of common stock and may have the effect of delaying, deferring, or defeating a change in control of the Company. The Company had not issued any shares of preferred stock through December 31, 2020.\nCommon stock\nThe Company has 200 million authorized shares of common stock, $0.01 par value per share, of which 80.9 million shares were issued and outstanding at December 31, 2020.\nDividends declared\n2020 2019 2018\nDividends declared (per share) $ 0.12 $ 0.12 $ 0.12\nDividend payments to stockholders (in thousands) $ 9,628 $ 9,486 $ 9,432\nThe Company’s paid a quarterly cash dividend of $0.03 per share in 2020, 2019, and 2018, however, the Board of Directors may terminate or modify the dividend program at any time without prior notice.\nStock repurchases\n(in thousands) 2020 2019 2018\nShares Amount Shares Amount Shares Amount\nJanuary 1, $ 45,484 $ 6,620 $ 34,892\nAuthorizations (1)\n$ 20,516 $ 60,000 $ 27,003\nRepurchases (2)\n(278) $ (28,274) (333) $ (21,136) (1,001) $ (55,275)\nDecember 31, $ 37,726 $ 45,484 $ 6,620\n(1) On June 15, 2020, the Company announced that the Board of Directors extended the current stock repurchase program’s expiration date to June 30, 2021 and increased the remaining stock repurchase authority to $60 million.\n(2) Purchases under this program have been made on the open market.\n12. FAIR VALUE MEASUREMENTS\nAssets and liabilities measured at fair value on a recurring basis\nThe Company records its cash equivalents, marketable securities, Capped Call Transactions, and venture investments at fair value on a recurring basis. Fair value is an exit price, representing the amount that would be received from the sale of an asset or paid to transfer a liability in an orderly transaction between market participants based on assumptions that market participants would use in pricing an asset or liability.\nAs a basis for classifying the fair value measurements, a three-tier fair value hierarchy, which classifies the fair value measurements based on the inputs used in measuring fair value, was established as follows:\n•Level 1 - observable inputs such as quoted prices in active markets for identical assets or liabilities;\n•Level 2 - significant other inputs that are observable either directly or indirectly; and\n•Level 3 - significant unobservable inputs on which there is little or no market data, which require the Company to develop its own assumptions. This hierarchy requires the Company to use observable market data, when available, and minimize unobservable inputs when determining fair value.\nThe fair value of the Capped Call Transactions at the end of each reporting period is determined using a Black-Scholes option-pricing model. The valuation models use various market-based inputs, including stock price, remaining contractual term, expected volatility, risk-free interest rate, and expected dividend yield, as applicable. The Company applies judgment in its determination of expected volatility. The Company considers both historical and implied volatility levels of the underlying equity security and, to a lesser extent, historical peer group volatility levels. The Company’s venture investments are recorded at fair value based on valuation methods using the observable transaction price and other unobservable inputs, including the volatility, rights, and obligations of the securities the Company holds.\nThe Company’s assets and liabilities measured at fair value on a recurring basis:\nDecember 31, 2020 December 31, 2019\n(in thousands) Level 1 Level 2 Level 3 Total Level 1 Level 2 Level 3 Total\nCash equivalents $ 42,339 $ 14,000 $ - $ 56,339 $ - $ - $ - $ -\nMarketable securities $ - $ 293,269 $ - $ 293,269 $ - $ - $ - $ -\nCapped Call Transactions (1) (2)\n$ - $ 83,597 $ - $ 83,597 $ - $ - $ - $ -\nVenture investments (1) (3)\n$ - $ - $ 8,345 $ 8,345 $ - $ - $ 4,871 $ 4,871\n(1) Included in other long-term assets.\n(2) See \"Note 10. Debt\" for additional information.\n(3) Investments in privately-held companies.\nChange in venture investments:\n(in thousands) 2020 2019\nJanuary 1, $ 4,871 $ 3,390\nNew investments 3,306 1,444\nSales of investments (1,424) -\nChanges in foreign exchange rates 118 37\nFair value adjustment 1,474 -\nDecember 31, $ 8,345 $ 4,871\nThe carrying value of certain other financial instruments, including receivables and accounts payable, approximates fair value due to these items’ relatively short maturity.\nFair value of the Notes\nThe fair value of the Company’s Notes was recorded at $515.9 million upon issuance, which reflected the principal amount of the Notes less the fair value of the conversion feature. The fair value of the debt component was determined based on a discounted cash flow model. The discount rate used reflected both the time value of money and credit risk inherent in the Notes. The carrying value of the Notes will be accreted, over the remaining term to maturity, to their principal value of $600 million.\nThe Notes’ fair value (inclusive of the conversion feature embedded in the Notes) was $706.5 million as of December 31, 2020. The fair value was determined based on the Notes’ quoted price in an over-the-counter market on the last trading day of the reporting period and classified within Level 2 in the fair value hierarchy. See \"Note 10. Debt\" for additional information.\nCredit risk\nIn addition to receivables, the Company is potentially subject to concentrations of credit risk from the Company’s cash, cash equivalents, and marketable securities. The Company’s cash and cash equivalents are generally held with large, diverse financial institutions worldwide to reduce the Company’s credit risk exposure. Investment policies have been implemented that limit purchases of marketable debt securities to investment-grade securities.\n13. REVENUE\nGeographic revenue\n(Dollars in thousands) 2020 2019 2018\nU.S. $ 613,844 61 % $ 525,191 57 % $ 469,987 52 %\nOther Americas 49,441 5 % 60,536 7 % 53,239 6 %\nUnited Kingdom (“U.K.”) 91,517 9 % 87,382 10 % 95,628 11 %\nEurope (excluding U.K.), Middle East, and Africa 156,056 15 % 137,946 15 % 147,248 17 %\nAsia-Pacific 106,659 10 % 100,328 11 % 125,479 14 %\n$ 1,017,517 100 % $ 911,383 100 % $ 891,581 100 %\nRevenue streams\n(in thousands) 2020 2019 2018\nPerpetual license $ 28,558 $ 80,015 $ 109,863\nTerm license 266,352 199,433 178,256\nRevenue recognized at a point in time 294,910 279,448 288,119\nMaintenance 296,709 280,580 263,875\nPega Cloud 208,268 133,746 82,627\nConsulting 217,630 217,609 256,960\nRevenue recognized over time 722,607 631,935 603,462\n$ 1,017,517 $ 911,383 $ 891,581\n(in thousands) 2020 2019 2018\nPega Cloud 208,268 133,746 82,627\nMaintenance 296,709 280,580 263,875\nTerm license $ 266,352 $ 199,433 $ 178,256\nSubscription (1)\n771,329 613,759 524,758\nPerpetual license 28,558 80,015 109,863\nConsulting 217,630 217,609 256,960\nTotal revenue $ 1,017,517 $ 911,383 $ 891,581\n(1) Reflects client arrangements subject to renewal (Pega Cloud, maintenance, and term license).\nRemaining performance obligations (\"Backlog\")\nExpected future revenue on existing contracts:\nDecember 31, 2020\n(Dollars in thousands) Perpetual license Term license Maintenance Pega Cloud Consulting Total\n1 year or less $ 11,514 $ 105,920 $ 227,803 $ 248,223 $ 19,226 $ 612,686 57 %\n1-2 years 395 7,962 54,509 193,064 346 256,276 24 %\n2-3 years - 4,928 28,320 104,542 851 138,641 13 %\nGreater than 3 years - 4 19,283 44,308 1,189 64,784 6 %\n$ 11,909 $ 118,814 $ 329,915 $ 590,137 $ 21,612 $ 1,072,387 100 %\nDecember 31, 2019\n(Dollars in thousands) Perpetual license Term license Maintenance Pega Cloud Consulting Total\n1 year or less $ 2,305 $ 97,826 $ 206,882 $ 165,571 $ 20,798 $ 493,382 58 %\n1-2 years 2,179 12,014 30,291 128,109 1,439 174,032 21 %\n2-3 years - 3,132 17,844 84,788 132 105,896 13 %\nGreater than 3 years - 3,861 13,277 43,702 1,993 62,833 8 %\n$ 4,484 $ 116,833 $ 268,294 $ 422,170 $ 24,362 $ 836,143 100 %\n14. STOCK-BASED COMPENSATION\nThe following table presents the stock-based compensation expense included in the Company’s consolidated statements of operations:\n(in thousands) 2020 2019 2018\nCost of revenue $ 20,796 $ 18,822 $ 16,862\nSelling and marketing 46,283 32,665 23,237\nResearch and development 22,885 18,938 15,274\nGeneral and administrative 13,104 10,484 8,489\n$ 103,068 $ 80,909 $ 63,862\nIncome tax benefit $ (20,464) $ (16,392) $ (13,383)\nThe Company periodically grants stock options and restricted stock units (“RSUs”) for a fixed number of shares upon vesting to employees and non-employee Directors. Beginning in 2019, the Company granted Directors awards in the form of common stock and stock options.\nMost of the Company’s stock-based compensation arrangements vest over five years, with 20% vesting after one year and the remaining 80% vesting in equal quarterly installments over the remaining four years. The Company’s stock options have a term of ten years. The Company recognizes stock-based compensation using the accelerated attribution method, treating each vesting tranche as if it were an individual grant. The stock-based compensation expense recognized during a period is based on the value of the awards that are ultimately expected to vest. Forfeitures are estimated at the time of grant and revised, if necessary, in subsequent periods if actual forfeitures differ from those estimates. Ultimately, the Company recognizes the actual expense over the vesting period only for the shares that vest.\nEmployees may elect to receive 50% of the employee’s target incentive compensation under the Company’s Corporate Incentive Compensation Plan (the “CICP”) in the form of RSUs instead of cash. If elected by an employee, the equity amount is equal in value on the date of grant to 50% of the employee’s target incentive opportunity, based on the employee’s base salary. The number of RSUs granted is determined by dividing 50% of the employee’s target incentive opportunity by 85% of the closing price of the Company’s common stock on the grant date, less the present value of expected dividends during the vesting period. If elected, the award vests 100% on the following year’s CICP payout date. Vesting is conditioned upon the performance conditions of the CICP and on continued employment; if threshold funding does not occur, the RSUs will not vest. The Company considers vesting to be probable on the grant date and recognizes the associated stock-based compensation expense over the requisite service period beginning on the grant date and ending on the vesting date.\nThe Company grants awards that allow for the settlement of vested stock options and RSUs on a net share basis (“net settled awards”). With net settled awards, the employee does not surrender any cash or shares upon exercise. Instead, the Company withholds the number of shares to cover the exercise price (in the case of stock options) and the minimum statutory tax withholding obligations (in the case of stock options and RSUs) from the shares that would otherwise be issued upon exercise or settlement. The exercise of stock options and settlement of RSUs on a net share basis results in fewer shares issued by the Company.\nShare-based compensation plans\n2004 Long-Term Incentive Plan (as amended and restated)\nIn 2004, the Company adopted the 2004 Long-Term Incentive Plan (as amended and restated, the “2004 Plan”) to provide employees, non-employee Directors, and consultants with opportunities to purchase stock through incentive stock options and non-qualified stock options. Subsequent amendments to the plan increased the number of shares authorized for issuance under the plan to 36 million, extended the term of the plan to 2030, and limited annual compensation to any non-employee Director to $0.5 million.\nAs of December 31, 2020, 9.9 million shares were subject to outstanding options and stock-based awards under the 2004 Plan.\n2006 Employee Stock Purchase Plan\nIn 2006, the Company adopted the 2006 Employee Stock Purchase Plan (the “2006 ESPP”) under which the Company’s employees are entitled to purchase up to an aggregate of one million shares of common stock, at a price equal to at least 85% of the fair market value of the Company’s common stock on the lesser of the commencement date or completion date for offerings under the plan, or such higher price as the Company’s Board of Directors may establish from time to time. Until the Company’s Board of Directors determines otherwise, the Board has set the purchase price at 95% of the fair market value on the completion date of the offering period. As a result, the 2006 ESPP is non-compensatory and is tax-qualified. Therefore, as of December 31, 2020, no compensation expense related to the plan had been recognized. In October 2012, the Company’s Board of Directors amended the term of the 2006 ESPP such that it will continue until there are no shares remaining under the plan or until the plan is terminated by the Board of Directors, whichever occurs first.\nAs of December 31, 2020, 0.5 million shares had been issued thereunder.\nShares issued and available for issuance\nDuring 2020, the Company issued 1.6 million shares to its employees and directors under the Company’s share-based compensation plans.\nAs of December 31, 2020, there were 11.1 million shares available for issuance for future equity grants under the Company’s stock plans, consisting of 10.6 million shares under the 2004 Plan and 0.5 million shares under the 2006 ESPP.\nGrant activity\nStock options\nThe Company estimates the fair value of stock options using a Black-Scholes option-pricing model. Key inputs used to estimate the fair value of stock options include the exercise price of the award, expected term of the option, expected volatility of the Company’s common stock over the option’s expected term, risk-free interest rate over the option’s expected term, and the Company’s expected annual dividend yield. The exercise price for stock options is greater than or equal to the shares’ fair market value at the grant date.\nThe following table summarizes the Company’s fair value assumptions for stock options:\n2020 2019 2018\nWeighted-average grant-date fair value $ 24.16 $ 19.10 $ 18.03\nAssumptions used in the Black-Scholes option-pricing model:\nExpected annual volatility (1)\n31 % 32 % 34 %\nExpected term in years (2)\n4.5 4.5 4.5\nRisk-free interest rate (3)\n0.7 % 2.4 % 2.6 %\nExpected annual dividend yield (4)\n0.2 % 0.3 % 0.4 %\n(1) The expected annual volatility for each grant is determined based on the average of historic daily price changes of the Company’s common stock over a period, which approximates the expected option term.\n(2) The expected option term for each grant is determined based on the historical exercise behavior of employees and post-vesting employment termination behavior.\n(3) The risk-free interest rate is based on the yield of U.S. Treasury securities with a commensurate maturity with the expected option term at the time of grant.\n(4) The expected annual dividend yield is based on the weighted-average dividend yield assumptions used for options granted during the applicable period.\nThe following table summarizes the combined stock option activity under the Company’s stock option plans for 2020:\nShares\n(in thousands) Weighted-average Exercise Price Weighted-average Remaining Contractual Term (in years) Aggregate Intrinsic Value\n(in thousands)\nOptions outstanding as of January 1, 2020 7,436 $ 44.76\nGranted 2,018 92.81\nExercised (1,777) 33.52\nForfeited (286) 62.86\nOptions outstanding as of December 31, 2020 7,391 $ 59.88\nVested and expected to vest as of December 31, 2020 6,225 $ 57.85 7.1 $ 469,374\nExercisable as of December 31, 2020 2,935 $ 38.73 5.6 $ 277,450\nThe aggregate intrinsic value of stock options exercised (i.e., the difference between the market price at exercise and the price paid by the employee at exercise) in 2020, 2019, and 2018 was $126.8 million, $63.3 million, and $56.8 million, respectively. The aggregate intrinsic value of stock options outstanding and exercisable as of December 31, 2020 is based on the difference between the closing price of the Company’s stock of $133.26 and the exercise price of the applicable stock options.\nAs of December 31, 2020, the Company had unrecognized stock-based compensation expense related to the unvested portion of stock options of $35.9 million that is expected to be recognized as expense over a weighted-average period of 2.3 years.\nRSUs\nRSUs deliver to the recipient a right to receive a specified number of shares of the Company’s common stock upon vesting. The Company values its RSUs at the fair value of its common stock on the grant date, which is the closing price of its common stock on the grant date less the present value of expected dividends during the vesting period, as the recipient is not entitled to dividends during the requisite service period.\nThe weighted-average grant-date fair value for RSUs granted in 2020, 2019, and 2018 was $93.68, $66.21, and $58.52, respectively.\nThe following table summarizes the combined RSU activity for all grants, including the CICP, under the 2004 Plan for 2020:\nShares\n(in thousands) Weighted- Average Grant-Date\nFair Value Aggregate Intrinsic Value\n(in thousands)\nNonvested as of January 1, 2020 2,565 $ 55.61\nGranted 1,168 93.68\nVested (1,059) 51.11\nForfeited (212) 65.17\nNonvested as of December 31, 2020 2,462 $ 74.78 $ 328,023\nExpected to vest as of December 31, 2020 1,841 $ 76.05 $ 245,339\nThe fair value of RSUs vested in 2020, 2019, and 2018 was $108.4 million, $77.0 million, and $66.5 million, respectively. The aggregate intrinsic value of RSUs outstanding and expected to vest as of December 31, 2020 is based on the closing price of the Company’s stock of $133.26 on December 31, 2020.\nAs of December 31, 2020, the Company had $68.6 million of unrecognized stock-based compensation expense related to all unvested RSUs that is expected to be recognized as expense over a weighted-average period of 2.1 years.\nCommon stock\nIn 2020, the Company granted 0.01 million shares of common stock to Directors with a weighted-average grant-date fair value of $117.47 per share.\n15. EMPLOYEE BENEFIT PLANS\nThe Company sponsors defined contribution plans for qualifying employees, including a 401(k) plan in the United States to which the Company makes discretionary matching contributions.\nThe following expenses related to defined contribution plans were recorded in the Company’s consolidated statements of operations:\n(in thousands) 2020 2019 2018\nU.S. 401(k) Plan $ 8,109 $ 6,676 $ 5,506\nInternational plans 16,132 13,021 11,101\n$ 24,241 $ 19,697 $ 16,607\n16. INCOME TAXES\nThe components of (loss) before (benefit from) income taxes are:\n(in thousands) 2020 2019 2018\nDomestic $ (59,281) $ (51,396) $ (27,494)\nForeign (65,608) (83,450) 15,951\n$ (124,889) $ (134,846) $ (11,543)\nThe components of (benefit from) income taxes are:\n(in thousands) 2020 2019 2018\nCurrent:\nFederal $ (11,251) $ 1,050 $ (1,862)\nState 399 405 287\nForeign 7,113 3,449 10,313\nTotal current (benefit from) provision for (3,739) 4,904 8,738\nDeferred:\nFederal (34,573) (25,356) (18,939)\nState (8,119) (5,143) (3,702)\nForeign (17,085) (18,818) (8,257)\nTotal deferred (benefit) (59,777) (49,317) (30,898)\n$ (63,516) $ (44,413) $ (22,160)\nA reconciliation of the U.S federal statutory tax rate and the Company’s effective tax rate, is as follows:\n(in thousands) 2020 2019 2018\nU.S. federal income taxes at statutory rates $ (26,227) $ (28,318) $ (2,424)\nValuation allowance (5,881) 727 510\nState income taxes, net of federal benefit and tax credits (6,994) (4,450) (3,329)\nPermanent differences 1,773 2,606 1,302\nGILTI, FDII, and BEAT (1)\n- - 399\nFederal research and experimentation credits (5,716) (4,295) (6,991)\nTax effects of foreign activities 3,050 3,056 (399)\nTax-exempt income - (91) (137)\nProvision to return adjustments 3,416 (5,460) 253\nNon-deductible compensation 1,806 1,716 1,025\nExpiration of statutes and changes in estimates 55 2,420 (516)\nExcess tax benefits related to share-based compensation (25,797) (14,291) (13,541)\nCares Act (10,576) - -\nImpact of change in tax law 7,489 1,908 1,636\nOther 86 59 52\n$ (63,516) $ (44,413) $ (22,160)\n(1) Global Intangible Low Taxed Income (“GILTI”), Foreign-Derived Intangible Income (“FDII”), and Base Erosion and Anti-abuse Tax (“BEAT”)\nCares Act\nOn March 27, 2020, the Coronavirus Aid, Relief, and Economic Security Act (“Cares Act”) was enacted to address the economic impact of the COVID-19 pandemic in the United States. Among other things, the Cares Act allows a five-year carryback period for tax losses generated in 2019 through 2021.\nThe Company carried back net operating losses generated in 2019, resulting in an income tax benefit of $5.7 million. The $5.7 million income tax benefit represents the Federal rate differential between 35% and 21%. In addition, the Company applied the carryback provisions of the Cares Act to its net operating losses generated in 2020, which resulted in the reclassification of $4.8 million net operating losses from a deferred income tax asset to refundable income taxes. The Company does not expect the other income tax provisions of the Cares Act to have a material impact on its financial statements.\nDeferred income taxes\nSignificant components of net deferred tax assets and liabilities are:\nDecember 31,\n(in thousands) 2020 2019\nDeferred tax assets:\nNet operating loss carryforwards $ 88,129 $ 70,960\nAccruals and reserves 26,309 24,902\nInterest expense carryforward 3,464 -\nDepreciation 4,795 2,493\nTax credit carryforwards 31,556 15,307\nOther 370 199\nTotal deferred tax assets 154,623 113,861\nValuation allowances (23,409) (28,007)\nTotal net deferred tax assets 131,214 85,854\nDeferred tax liabilities:\nCapped call transactions (20,858) -\nConvertible senior notes (6,473) -\nSoftware revenue (11,477) (23,859)\nIntangibles (4,338) (6,103)\nTotal deferred tax liabilities (43,146) (29,962)\n$ 88,068 $ 55,892\nThe Company regularly assesses the need for a valuation allowance against its deferred tax assets. In making that assessment, the Company considers both positive and negative evidence related to the likelihood of realizing the deferred tax assets to determine, based on the weight of available evidence, whether it is more-likely-than-not that some or all of the deferred tax assets will not be realized. This determination requires significant judgment, including assumptions about future taxable income based on historical and projected information. In 2020, the change in valuation allowances was primarily due to the expiration of $5.9 million in acquisition-related net operating losses. There were no material changes in valuation allowances in 2019.\nAs of December 31, 2020, the Company’s net operating losses and credit carryforwards are:\n(in thousands)\nFederal State\nNet operating losses (1)\n$ 124,115 $ 9,149\nNet operating losses due to acquisitions (1)\n$ 76,826 $ 1,466\nCredit carryforwards (2)\n$ 24,372 $ 1,895\nCredit carryforwards due to acquisitions $ 640 $ 60\n(1) Excludes federal and state net operating losses of $29.5 million and $0.8 million, respectively, from prior acquisitions that the Company expects will expire unutilized.\n(2) Excludes federal and state tax credits of $0.1 million and $9.0 million, respectively, that the Company expects will expire unutilized.\nCarryforward losses and credits expire between 2021 and 2038, except for the 2020 federal net operating loss of $47.3 million and $1.2 million of state credits, which both have unlimited carryforward periods.\nThe Company’s India subsidiary is primarily located in Special Economic Zones (“SEZs”) and is entitled to a tax holiday in India. The tax holiday reduces or eliminates income tax in India. The tax holiday in the Hyderabad SEZ is scheduled to expire in 2024. The tax holiday in the Bangalore SEZ is scheduled to expire in 2022. For 2020, 2019, and 2018, the income tax holiday reduced the Company’s provision for income taxes by $1.7 million, $1.9 million, and $1.3 million, respectively.\nUncertain tax benefits\nA rollforward of the Company’s gross unrecognized tax benefits is:\n(in thousands)\n2020 2019 2018\nBalance as of January 1,\n$ 23,271 $ 18,157 $ 19,150\nAdditions for tax positions related to the current year 653 510 978\nAdditions for tax positions of prior years 962 4,917 174\nReductions for tax positions of prior years (1,085) (313) (2,145)\nBalance as of December 31,\n$ 23,801 $ 23,271 $ 18,157\nAs of December 31, 2020, the Company had $23.8 million of total unrecognized tax benefits, which would decrease the Company’s effective tax rate if recognized.\nAs of December 31, 2020 and December 31, 2019, the Company’s income tax receivable was $44.1 million and $25.9 million, respectively.\nTax examinations\nThe Company files federal and state income tax returns in the U.S. and in various foreign jurisdictions. In the ordinary course of business, the Company and its subsidiaries are examined by various tax authorities, including the Internal Revenue Service in the U.S. As of December 31, 2020, the Company’s U.S. federal tax returns for the years 2014 through 2017 were under examination by the Internal Revenue Service. In addition, certain foreign jurisdictions are auditing the Company’s income tax returns for periods ranging from 2010 through 2018. The Company does not expect the results of these audits to have a material effect on the Company’s financial condition, results of operations, or cash flows. With few exceptions, the statute of limitations remains open in all jurisdictions for the tax years 2014 to the present.\n17. (LOSS) EARNINGS PER SHARE\nBasic earnings per share is calculated using the weighted-average number of common shares outstanding during the applicable period. Diluted earnings per share is calculated using the weighted-average number of common shares outstanding during the applicable period, plus the dilutive effect of outstanding stock options and RSUs, using the treasury stock method. In periods of loss, all stock options and RSUs are excluded from the weighted-average number of common shares, as their inclusion would be anti-dilutive.\n(in thousands, except per share amounts) 2020 2019 2018\nNet (loss) income $ (61,373) $ (90,433) $ 10,617\nWeighted-average common shares outstanding 80,336 79,055 78,564\n(Loss) earnings per share, basic $ (0.76) $ (1.14) $ 0.14\nNet (loss) income $ (61,373) $ (90,433) $ 10,617\nStock options - - 2,891\nRSUs - - 1,609\nEffect of dilutive securities - - 4,500\nWeighted-average common shares outstanding, assuming dilution 80,336 79,055 83,064\n(Loss) earnings per share, diluted $ (0.76) $ (1.14) $ 0.13\nOutstanding anti-dilutive stock options and RSUs (1)\n6,278 5,911 188\n(1) Certain outstanding stock options and RSUs were excluded from the computation of diluted earnings per share because they were anti-dilutive in the period presented. These awards may be dilutive in the future.\n18. COMMITMENTS AND CONTINGENCIES\nCommitments\nSee \"Note 9. Leases\" for additional information.\nContingencies\nThe Company is a party in various contractual disputes, litigation, and potential claims arising in the ordinary course of business. The Company does not believe that the resolution of these matters will have a material adverse effect on its financial position or results of operations.\n19. SUBSEQUENT EVENTS\nRelocation of Corporate Headquarters\nOn February 12, 2021, the Company executed the Lease Termination Agreement with Charles Park Owner LLC to accelerate the lease termination date for the Company’s corporate headquarters in Cambridge, Massachusetts to October 1, 2021. Under the terms of the Lease Termination Agreement, the Company will receive a payment of $18 million. The Company is obligated to make rent payments outlined in the existing lease agreements until October 1, 2021, the new lease termination date.\nQurious.io acquisition\nIn January 2021, the Company acquired Qurious.io, Inc., a cloud-based real time speech analytics solution for customer service teams. The acquisition was immaterial.",
    "item_9": "ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.",
    "item_9A": "ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of disclosure controls and procedures\nOur management, with the participation of our Chief Executive Officer (“CEO”) and Chief Financial Officer (“CFO”), evaluated the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act) as of December 31, 2020. In designing and evaluating our disclosure controls and procedures, our management recognized that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving their objectives, and our management necessarily applied its judgment in evaluating the cost-benefit relationship of possible controls and procedures.\nBased on this evaluation, our CEO and CFO concluded that our disclosure controls and procedures were effective as of December 31, 2020.\nManagement’s report on and changes in internal control over financial reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act. Under the supervision and with the participation of our management, including our CEO and CFO, we conducted an evaluation of the effectiveness of our internal control over financial reporting as of December 31, 2020 based on the framework in the updated Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”) on May 14, 2013.\nBased on this evaluation, management has concluded that (i) our internal control over financial reporting was effective as of December 31, 2020 and (ii) no change in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act) occurred during the quarter ended December 31, 2020 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nDeloitte & Touche LLP, our independent registered public accounting firm which also audited our consolidated financial statements, has issued an attestation report on our internal control over financial reporting, which is included in Item 8 “Financial Statements and Supplementary Data”.",
    "item_9B": "ITEM 9B. OTHER INFORMATION\nOn February 12, 2021, Pegasystems Inc. (the “Company”) executed the Lease Termination Agreement with Charles Park Owner LLC to accelerate the lease termination date for the Company’s corporate headquarters in Cambridge, Massachusetts to October 1, 2021. Under the terms of the Lease Termination Agreement, the Company will receive a payment of $18 million. The Company is obligated to make rent payments outlined in the existing lease agreements until October 1, 2021, the new lease termination date.\nThe foregoing description of the Lease Termination Agreement does not purport to be complete and is qualified in its entirety by reference to the Lease Termination Agreement, a copy of which is attached as Exhibit 10.17 hereto.\nPART III",
    "item_10": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\nExcept as set forth below, information required by this item is incorporated herein by reference from the information contained in our proxy statement for our 2021 annual stockholders meeting (the “2021 proxy statement”) under the headings Executive Compensation, Election of Directors, Corporate Governance, Executive Officers, and Delinquent Section 16(a) Reports, which will be filed with the Securities and Exchange Commission within 120 days after the close of the fiscal year.\nWe have adopted a written code of conduct that applies to our Board of Directors and employees, including our principal executive officer, principal financial officer, principal accounting officer, and persons performing similar functions. A copy of our code of conduct can be found on our website, www.pega.com. We intend to satisfy the disclosure requirements under Item 5.05 of Form 8-K and the applicable the NASDAQ Global Select Market rules by posting such information on our website in accordance with such requirements.",
    "item_11": "ITEM 11. EXECUTIVE COMPENSATION\nThe information required by this item is incorporated herein by reference from the information contained in the 2021 proxy statement under the headings “Director Compensation”, “Compensation Discussion and Analysis”, and “Executive Compensation” and is incorporated herein by reference.",
    "item_12": "ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this item is incorporated herein by reference from the information contained in the 2021 proxy statement under the headings “Executive Compensation”, “Equity Compensation Plan Information”, and “Security Ownership of Certain Beneficial Owners and Management”, and is incorporated herein by reference.",
    "item_13": "ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this item is incorporated herein by reference from the information contained in the 2021 proxy statement under the headings “Certain Relationships and Related Transactions” and “Determination of Independence” and is incorporated herein by reference.",
    "item_14": "ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this item is incorporated herein by reference from the information contained in the 2021 proxy statement under the heading “Independent Registered Public Accounting Firm Fees and Services” and is incorporated herein by reference.\nPART IV",
    "item_15": "ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) The following are filed as part of this Annual Report:\n(1) Financial Statements\nThe following consolidated financial statements are included in Item 8:\nPage\nReport of Independent Registered Public Accounting Firm 35\nConsolidated Balance Sheets as of December 31, 2020 and 2019\nConsolidated Statements of Operations for the years ended December 31, 2020, 2019, and 2018\nConsolidated Statements of Comprehensive (Loss) Income for the years ended December 31, 2020, 2019, and 2018\nConsolidated Statements of Stockholders’ Equity for the years ended December 31, 2020, 2019, and 2018\nConsolidated Statements of Cash Flows for the years ended December 31, 2020, 2019, and 2018\n(b) Exhibits\nExhibit No. Description\n3.1 Restated Articles of Organization of the Registrant and Amendments thereto. (Filed as Exhibit 3.1 to the Registrant’s September 30, 2014 Form 10-Q and incorporated herein by reference.)\n3.2 Amended and Restated Bylaws of Pegasystems Inc. (Filed as Exhibit 3.2 to the Registrant’s June 15, 2020 Form 8-K and incorporated herein by reference.)\n4.1 Specimen Certificate Representing the Common Stock. (Filed as Exhibit 4.1 to the Registrant’s Registration Statement on Form S-1 (Registration No. 333-03807) or an amendment thereto and incorporated herein by reference.)\n4.2 Indenture, dated as of February 24, 2020, between Pegasystems Inc. and U.S. Bank National Association, as trustee. (Filed as Exhibit 4.1 to the Registrant’s February 24, 2020 Form 8-K and incorporated herein by reference)\n4.3 Form of certificate representing the 0.75% Convertible Senior Notes due 2025 (included as Exhibit A to Exhibit 4.1 to the Registrant’s Form 8-K filed February 24, 2020 and incorporated herein by reference)\n4.4 Description of Common Stock (Filed as Exhibit 4.2 to the Registrant’s 2019 Form 10-K and incorporated herein by reference).\n10.1++ 2004 Long-Term Incentive Plan (as amended and restated) (Filed as Exhibit 10.1 to the Registrant’s June 24, 2020 Form 8-K and incorporated herein by reference)\n10.2++ Restricted Stock Unit Sub-Plan of the Registrant’s 2004 Long-Term Incentive Plan for French Participants (Filed as Appendix B within the Registrant’s 2016 Proxy Statement, filed April 18, 2016 and incorporated herein by reference.)\n+10.3++ 2006 Employee Stock Purchase Plan, as amended on October 29, 2020.\n10.4++ Form of Employee Stock Option Agreement, as amended. (Filed as Exhibit 10.3 to the Registrant’s March 31, 2017 Form 10-Q and incorporated herein by reference.)\n+10.5++ Form of Global Stock Option Agreement\n10.6++ Form of Restricted Stock Unit Agreement, as amended. (Filed as Exhibit 10.4 to the Registrant’s March 31, 2017 Form 10-Q and incorporated herein by reference.)\n+10.7++ Form of Global Restricted Stock Unit Agreement\n10.8++ Form of Non-Employee Director Stock Option Agreement. (Filed as Exhibit 10.2 to the Registrant’s September 30, 2004 Form 10-Q and incorporated herein by reference.)\n10.9++ Form of Director Indemnification Agreement. (Filed as Exhibit 99.1 to the Registrant’s April 11, 2005 Form 8-K and incorporated herein by reference.)\n10.10++ Offer Letter between the Registrant and Douglas I. Kra dated October 19, 2004. (Filed as Exhibit 10.20 to the Registrant’s 2004 Form 10-K and incorporated herein by reference.)\n10.11++ Offer Letter, dated April 27, 2020, between Pegasystems Inc. and Hayden Stafford. (Filed as Exhibit 10.3 to the Registrant’s June 30, 2020 Form 10-Q and incorporated herein by reference)\n10.12++ Offer Letter between the Registrant and Kenneth Stillwell dated June 1, 2016. (Filed as Exhibit 99.1 to the Registrant’s June 14, 2016 Form 8-K and incorporated herein by reference.)\n10.13++ Compensation program for non-employee members of the Registrant’s Board of Directors, effective August 5, 2019 (Filed as Item 1.01 of the Registrant’s August 9, 2019 Form 8-K and incorporated herein by reference.)\n10.14++ 2020 Section 16 Officer/FLT Member Corporate Incentive Compensation Plan. (Filed as Exhibit 99.1 to the Registrant’s February 7, 2020 Form 8-K and incorporated herein by reference.)\n10.15 2020 Section 16 Officers/FLT Member Executive Officers Base Salaries and Target Bonus Payments (Filed as Exhibit 99.1 to the Registrant’s March 9, 2020 Form 8-K and incorporated herein by reference)\n10.16\n2021 Section 16 Officers/FLT Member Corporate Incentive Compensation Plan (Filed as Exhibit 99.1 to the Registrant’s February 8, 2021 Form 8-K and incorporated herein by reference.\n10.17\nLease Agreement dated June 29, 2011 between Charles Park One, LLC and Pegasystems Inc. for premises at One Charles Park (Filed as Exhibit 99.1 to the Registrant’s Form 8-K/A filed on July 6, 2011 and incorporated herein by reference.)\n10.18\nFirst Amendment to Lease Agreement dated November 11, 2014 between Charles Park One, LLC and Pegasystems Inc. (Filed as Exhibit 10.2 to the Registrant’s September 30, 2015 Form 10-Q and incorporated herein by reference.)\nExhibit No. Description\n+10.18 Lease Termination Agreement, dated February 12, 2021, between Charles Park One, LLC and Pegasystems Inc.\n10.19\nCredit Agreement dated as of November 5, 2019 with PNC Bank, National Association (Filed as Exhibit 10.1 to the Registrant’s September 30, 2019 Form 10-Q and incorporated herein by reference.)\n10.20 Amendment to Loan Documents, dated February 18, 2020, between Pegasystems Inc. and PNC Bank, National Association. (Filed as Exhibit 10.3 to the Registrant’s Form 8-K filed February 24, 2020 and incorporated herein by reference)\n10.21 Amendment 2 to Loan Documents, dated July 22, 2020, between Pegasystems Inc. and PNC Bank, National Association. (Filed as Exhibit 10.2 to the Registrant’s June 30, 2020 Form 10-Q and incorporated herein by reference.)\n10.22 Amendment to Loan Documents, dated as of September 30, 2020, between Pegasystems Inc. and PNC Bank, National Association (Filed as Exhibit 10.3 to the Registrant’s September 30, 2020 Form 10-Q and incorporated herein by reference.)\n10.23 Form of Side Letter to Base Call Option Transaction (Filed as Exhibit 10.1 to the Registrant’s September 30, 2014 Form 10-Q and incorporated herein by reference.)\n10.24 Form of Side Letter to Additional Call Option Transaction (Filed as Exhibit 10.2 to the Registrant’s September 30, 2020 Form 10-Q and incorporated herein by reference.)\n10.25 Form of Confirmation of Base Call Option Transaction. (Filed as Exhibit 10.1 to the Registrant’s Form 8-K filed February 24, 2020 and incorporated herein by reference)\n10.26 Form of Confirmation of Additional Call Option Transaction. (Filed as Exhibit 10.2 to the Registrant’s Form 8-K filed February 24, 2020 and incorporated herein by reference)\n+21.1 Subsidiaries of the Registrant.\n+23.1 Consent of Independent Registered Public Accounting Firm-Deloitte & Touche LLP.\n+31.1 Certification pursuant to Exchange Act Rules 13a-14 and 15d-14 of the Chief Executive Officer.\n+31.2 Certification pursuant to Exchange Act Rules 13a-14 and 15d-14 of the Chief Financial Officer.\n+32 Certification pursuant to 18 U.S.C. Section 1350 of the Chief Executive Officer and the Chief Financial Officer.\n101.INS Inline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH Inline XBRL Taxonomy Extension Schema Document.\n101.CAL Inline XBRL Taxonomy Calculation Linkbase Document.\n101.DEF Inline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB Inline XBRL Taxonomy Label Linkbase Document.\n101.PRE Inline XBRL Taxonomy Presentation Linkbase Document.\n104 Cover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n+ Filed herewith\n++ Management contracts and compensatory plan or arrangements required to be filed pursuant to Item 15(b) of Form 10-K.\n(c) Financial Statement Schedules\nAll financial statement schedules are omitted because the required information is not present or not present in sufficient amounts to require submission of the schedule or because the information is reflected in the consolidated financial statements or notes thereto.\nITEM 16. FORM 10-K SUMMARY\nOmitted at Registrant’s option.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this Annual Report on Form 10-K to be signed on its behalf by the undersigned, thereunto duly authorized.\nPegasystems Inc.\nDate:\nFebruary 17, 2021 By: /s/ KENNETH STILLWELL\nKenneth Stillwell\nChief Financial Officer and Chief Administrative Officer\n(Principal Financial Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this Annual Report on Form 10-K has been signed below on February 17, 2021 by the following persons on behalf of the Registrant and in the capacities indicated.\nSignature Title\n/s/ ALAN TREFLER\nChairman and Chief Executive Officer\n(Principal Executive Officer)\nAlan Trefler\n/s/ KENNETH STILLWELL Chief Financial Officer and Chief Administrative Officer\n(Principal Financial Officer)\nKenneth Stillwell\n/s/ EFSTATHIOS KOUNINIS Chief Accounting Officer, Vice President of Finance, and Treasurer\n(Principal Accounting Officer)\nEfstathios Kouninis\n/s/ PETER GYENES Director\nPeter Gyenes\n/s/ RONALD HOVSEPIAN Director\nRonald Hovsepian\n/s/ RICHARD JONES Director\nRichard Jones\n/s/ CHRISTOPHER LAFOND Director\nChristopher Lafond\n/s/ DIANNE LEDINGHAM Director\nDianne Ledingham\n/s/ SHARON ROWLANDS Director\nSharon Rowlands\n/s/ LARRY WEBER\nDirector\nLarry Weber"
}