{
    "cik": "1015739",
    "company": "AWARE INC /MA/",
    "filing_type": "10-K",
    "filing_date": "2021-02-17",
    "period_of_report": "2020-12-31",
    "sic": "7372",
    "state_of_inc": "MA",
    "state_location": "MA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1015739/0001564590-21-006373-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1015739/000156459021006373/awre-10k_20201231.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1015739/0001564590-21-006373.txt",
    "filename": "1015739_10K_2020_0001564590-21-006373.htm",
    "item_1": "ITEM 1. BUSINESS\nCompany Overview\nAware, Inc. (“Aware”, “we”, “us”, “our”, or the “Company”) is a global leader in biometrics software offerings and solutions. Our portfolio enables government agencies and commercial entities to enroll, identify, authenticate and enable using biometrics, which comprise physiological characteristics, such as fingerprints, faces, irises and voices.\n•\nEnroll: Register biometric identities into an organization’s secure database\n•\nIdentify: Utilize an organization’s secure database to accurately identify individuals using biometric data\n•\nAuthenticate: Provide frictionless multi-factor, passwordless access to secured accounts and databases with biometric verification\n•\nEnable: Manage the lifecycle of secure identities through optimized biometric interchanges\nWe have been engaged in this business since 1993. Our comprehensive portfolio of biometric solutions is based on innovative, robust products designed explicitly for ease of integration, including customer-managed and integration ready biometric frameworks, platforms, software development kits (SDKs) and services. Principal government applications of biometrics systems include border control, visa applicant screening, law enforcement, national defense, intelligence, secure credentialing, access control, and background checks. Principal commercial applications include mobile enrollment, user authentication, identity proofing, and secure transaction enablement.\nOur products span multiple biometric modalities, including fingerprint, face, iris and voice, and provide interoperable, standards-compliant, field-proven biometric functionality. Our products are used to capture, verify, format, compress and decompress biometric images as well as aggregate, analyze, process, match and transport those images and templates within biometric systems. For large deployments, we may provide project management and software engineering services. We sell our biometrics software products and services globally through a multifaceted distribution strategy using systems integrators, original equipment manufacturers (OEMs), value added resellers (VARs), partners, and directly to end user customers.\nAware was incorporated in Massachusetts in 1986. We are headquartered at 40 Middlesex Turnpike in Bedford, Massachusetts, and our telephone number at this address is (781) 276-4000. Our website address is www.aware.com. The information on our website is not part of this Form 10-K, unless expressly noted. Our stock is traded on the Nasdaq Global Market under the symbol AWRE.\nWorldwide Coronavirus Pandemic (“COVID-19”)\nOn March 11, 2020, the World Health Organization declared the novel strain of coronavirus (“COVID-19”) a global pandemic and recommended containment and mitigation measures worldwide. Governor Charlie Baker of Massachusetts ordered all businesses and organizations that do not provide “COVID-19 Essential Services” to close their physical workplaces and facilities to workers, customers and the public as of noon on March 24, 2020. At that time, we took the necessary steps to enable an all-remote workforce. Many of our clients worldwide were similarly impacted. Over time, the restrictions in the state of Massachusetts were eased, or re-tightened, in line with the trends of the pandemic. As of December 31, 2020, we were in a hybrid model with some employees coming into the office and others continuing to work remotely.\nThe global outbreak of COVID-19 continues to evolve, and the extent to which COVID-19 may have long-term impact on our business and the markets we serve, will depend on future developments-which are highly uncertain and cannot be predicted with confidence, such as the pace of ongoing vaccination efforts in the United States and the rest of the world, the duration of the outbreak, travel restrictions and social distancing measures in the United States and other countries, business closures or business disruptions, and the effectiveness of actions taken in the United States and other countries to contain and treat the disease.\nWe are continuing to monitor the situation with our primary focus on the health and safety of our employees and clients.\nPrincipal Products & Services\nWe sell a broad range of biometrics software products and solutions that perform functions to address our customers’ desired use cases where they are addressing improved security, data protection compliance and improved ROI and efficiencies including:\n1.\nEnrollment of their workforce for benefits and background checks\n2.\nEnrollment of their customers for a better experience or improved customer service and security\n3.\nLaw enforcement processing and forensic analysis\n4.\nTrusted remote enrollment where travel or direct contact is not viable\n5.\nTrusted transactions and access control\nOur biometrics software solutions are built upon robust componentized products that are customer configurable to give them control so they can uniquely address their specific customers’ expectations. These solutions and services facilitate customers with an opportunity for a faster go-to-market process to help reduce their development times and exposure to software support and maintenance risks. Our solutions and services are described below.\nIntegrated Framework and Platform Solutions and Services\nKnomi® Mobile Framework\nThe Knomi mobile biometric authentication framework is built on our hardened biometric SDK component , which are optimized to operate on mobile devices, and a server that together enable strong, multi-factor, password-free authentication from a mobile device using biometrics. Knomi offers multiple biometric modality options, including facial recognition, and voice authentication as means to enroll, onboard or authenticate. Knomi software components can be used in different combinations and configurations to enable either a server-centric architecture, a web-based or a device-centric implementation. Knomi has primarily been sold as a perpetual license and is also available as a fixed term license that is priced based on a usage-based model.\nAwareABIS™ Platform\nAwareABIS is an Automated Biometric Identification System (“ABIS”) used for large-scale biometric identification and deduplication using fingerprint, face, and iris recognition. Leveraging Aware’s Astra™ and BioSP™ products, AwareABIS is a highly scalable platform that performs one-to-many search or one-to-one match against large stores of biometrics and other identity data. Utilizing highly distributed computing, AwareABIS also enables complex filtering, and linking operations critical to data preparation and quality assurance functions, such as identity resolution and data deduplication of massive biometric databases (tens of millions of records). The platform is built upon several mature, high-performance, field-proven applications and algorithms from Aware. AwareABIS has primarily been sold as perpetual license and is also available as a fixed term license that is priced based on a usage-based model or the size of the biometric system.\nAFIX Suite of Products\nAware’s recently acquired AFIX suite of products is used for small-scale law enforcement focused biometric identification. AFIX Tracker™ supports fingerprint, palmprint and latent print identification, designed to serve between 15,000 and 2 million identities. AFIX Tracker is ideal for crime scene investigation applications in low to moderate sized community populations. The product provides minutiae-based search capability and can be configured as either a standalone system, or for use with centralized, server-based data stores. AFIX Tracker has primarily been sold as a perpetual license and is also available as a fixed term license that is priced based on a usage-based model or the size of the biometric system.\nBioSP™ - Biometric Services Platform\nBioSP is a service-oriented platform used to enable a biometric system with advanced biometric data processing and management functionality in a web services architecture. It provides workflow, data management and formatting, and other important utilities for large-scale fingerprint recognition, face recognition, and iris recognition systems. BioSP is well suited for applications that require the collection of biometrics throughout a distributed network, and\nsubsequent aggregation, analysis, processing, distribution, matching, and sharing of data with other system components. BioSP is modular, programmable, scalable, and secure, capable of managing all aspects of transaction workflow, including messaging, submissions, responses, and logging. BioSP has primarily been sold as a perpetual license and is also available as a fixed term license that is priced based on users, transactions, or enterprise wide.\nBioSP™ Biometric Services Platform - WebEnroll\nWebEnroll is a browser-based biometric enrollment and data management solution available as an enhanced version of BioSP™ that utilizes BioComponents™ for capture of biographic data, fingerprints and facial images in a browser. Each BioComponent performs advanced biometric image autocapture as well as capture device hardware abstraction. Once images are captured, they are submitted to BioSP, where configurable workflows and modular software applications are used for processing, routing, and storage of each transaction.\nIndigo™\nIndigo™ is Aware’s family of cloud-based biometric application programming interfaces (APIs) and turnkey services, each provided as a subscription-based software-as-a-service (SaaS). Indigo|API provides biometric face and fingerprint image analysis, matching, and enrollment functionality; all as granular REST services that can enhance identity systems with biometric functionality. These functions include quality scoring, liveness detection, enrollment, verification, comparison and matching, and searching for fingerprint and face modalities. Indigo turnkey solutions deliver biometric capabilities accessible from a browser. Indigo is provided as a subscription-based solution that is available with enterprise-based, usage-based pricing. Going forward, we plan to transition Indigo into a wider SaaS offering.\nSoftware products\nWe sell a broad range of software components, or “building blocks”, such as SDKs, APIs, and applications that customers use to streamline or develop their systems into more effective solutions. These building blocks enable important functions including:\n1.\nMatching of biometric samples against biometric databases.\n2.\nEnrollment, analysis, and processing of biometric images and identity data on workstations.\n3.\nImage compression\nBioComponents™ bundles our offerings as applications with a user interface. We also license our software unbundled as building blocks and have primarily sold these offerings as a perpetual license.\nBuilding Blocks: SDKs, APIs, Applications, and Subsystems\nBiometric Search & Matching SDKs\nOur SDKs consist of: i) multiple software libraries; ii) sample applications that show customers how to use the libraries; and iii) documentation. Customers use our SDKs to design and develop biometrics applications. Nexa™ is our line of biometric search and match SDKs, including Nexa|Fingerprint™, Nexa|Face™, Nexa|Iris™ and Nexa|Voice™. These products provide high-performance biometric algorithms for fingerprint, facial, iris and voice identification or authentication. The algorithms in these products convert images into biometric templates, which can then be compared to templates stored in databases to find matches.\nIn addition to the Nexa line, we also offer AwareXM™, an interoperable fingerprint matching SDK that provides MINEX-certified, INCITS 378-compliant fingerprint minutiae extraction, template generation, and fingerprint authentication.\nBiometric Enrollment SDKs and APIs\nOur suite of enrollment SDKs and APIs performs functions that are critical to biometric enrollment, including (i) image capture and hardware abstraction, (ii) image quality assurance, (iii) image compression, (iv) mobile enrollment, matching and liveness verification, and (v) fingerprint card processing.\nImaging products\nIn addition to our biometrics software products, we also sell products used in applications involving medical and advanced imaging. Our principal imaging product is Aware JPEG 2000, which is based on the JPEG2000 standard. The JPEG2000 standard is an image compression standard and coding system that was created by the Joint Photographic Experts Group committee in 2000. Our JPEG2000 product is used to compress, store, and display images. Those images are typically medical images.\nSoftware maintenance\nWe also provide and sell software maintenance to many of our customers who purchase our software products and solutions. Software maintenance has historically been made available by contracts that typically have a one-year term during which customers have the right to receive technical support and software updates for a fixed fee, if and when they become available. Software maintenance is also available as part of a subscription-based solution offering under which customers receive standard software maintenance plus access to upgrades and product enhancements.\nServices\nWe provide a variety of program management and software engineering services, including: i) project planning and management; ii) system and architecture design; iii) software design, development, customization, configuration, and testing; and iv) software integration and installation. Services are sold in conjunction with our products and solutions and are provided for a fixed fee or as part of a subscription-based fee.\nService engagement deliverables may include: i) complete customer software solutions; ii) one or more subsystems comprised of software products that are integrated within a larger system; iii) custom-configured versions of existing software products; or iv) custom-designed software products. In some cases, the software resulting from service engagements may form the basis for new or improved Aware software solutions and/or products.\nOur customers for services include: i) government agencies; ii) large multinational systems integrators; iii) smaller systems integrators with a particular market, technology or geographic focus; and iv) commercial partners or providers of products, solutions, and services for themselves or to their end customers. We provide services directly to end-users or indirectly to end-users through systems integrators or commercial entities or partners. When we provide services to systems integrators, they are often engaged with the end-user as a prime contractor and are responsible for delivery of a complete solution, in which case we typically serve as a subcontractor assigned a subset of the total scope of work.\nThe scope of our services projects varies. A small project might involve configuration and testing of a single software product, taking a small team one month or less. A large project might involve delivery of a more complex solution comprised of multiple products and subsystems, requiring a larger team to conduct program and project management, system design, software customization and integration, and taking up to one year or more. Some projects are followed by subsequent follow-on projects that serve to change or extend the features and functionality of the initial system.\nDistribution Methods\nWe sell our products, solutions and services through three principal channels of distribution:\ni)\nSystems integrator channel - we sell to systems integrators that incorporate our software products and solutions into biometric systems that are delivered primarily to government end users.\nii)\nDirect channel - we sell directly to government, as well as commercial customers.\niii)\nOEM and VAR channel - we sell to hardware and software solution providers that incorporate our software products into their products for resale or use in their solution offerings or integrated software products.\nMajor Customers\nAll of our revenue in 2020 and 2019 was derived from unaffiliated customers. In 2019, one customer represented 16% of total revenue. No other customer represented 10% or more of total revenue in either 2020 or 2019.\nCompetitive Business Conditions\nA significant number of established companies have developed or are developing and marketing software and hardware for biometrics products and applications that currently compete with or will compete directly with our offerings. We believe that additional competitors will enter the biometrics market and become significant long-term competitors, and that, as a result, competition will increase. Companies competing with us may introduce solutions that are competitively priced, have increased performance or functionality or incorporate technological advances we have not yet developed or implemented. Our current principal competitors include:\n•\nDiversified technology providers that offer integrated biometrics solutions to governments, law enforcement agencies and other organizations. This group of competitors includes companies such as Idemia, Thales, and NEC.\n•\nComponent providers that offer biometrics software and hardware components for fingerprint, facial, iris and voice biometric identification. This group of competitors includes companies such as FaceTec, Dermalog, and Innovatrics.\nWe expect competition to intensify in the near term in the biometrics market. Many current and potential competitors have substantially greater financial, marketing, and research resources than we have. Moreover, low-cost foreign competitors have demonstrated a willingness to sell their products at significantly reduced prices. To compete effectively in this environment, we must continually develop and market new and enhanced solutions and technologies at competitive prices and must have the resources available to invest in significant research and development activities. Our failure to compete successfully could cause our revenues and market share to decline.\nIntellectual Property\nWe rely on a combination of nondisclosure agreements and other contractual provisions, as well as patent, trademark, trade secret and copyright law to protect our proprietary rights. We have an active program to protect our proprietary technology through the filing of patents. As of December 31, 2020, we had approximately 121 U.S. and foreign patents and approximately 34 pending patent applications. Our patents and patent applications pertain primarily to biometrics and imaging compression.\nAlthough we have patented certain aspects of our technology, we rely primarily on trade secrets to protect our intellectual property. We attempt to protect our trade secrets and other proprietary information through agreements with our customers, suppliers, employees and consultants, and through security measures. Each of our employees is required to sign a non-disclosure agreement. Although we intend to protect our rights vigorously, we cannot guarantee that these measures will be successful. In addition, effective intellectual property protection may be unavailable or limited in certain foreign countries.\nThird parties may assert exclusive patent, copyright and other intellectual property rights to technologies that are important to us. We may receive claims from third parties suggesting that we may be obligated to license such intellectual property rights. If we were found to have infringed any third party’s patents, we could be subject to substantial damages or an injunction preventing us from conducting our business.\nEmployees\nAs of December 31, 2020, we employed 90 people, including 52 in engineering and research, 25 in sales and marketing, and 13 in finance and administration. Of these employees, 77 were based in Massachusetts and 13 were based outside of Massachusetts. None of our employees are represented by a labor union. We consider our employee relations to be good.\nWe believe that our future success will depend in large part on the service of our technical, sales, marketing and senior management personnel and upon our ability to retain highly qualified technical, sales and marketing and managerial personnel. We cannot guarantee that we will be able to retain our key managers and employees or that we will be able to attract and retain additional highly qualified personnel in the future.\nAvailable Information\nOur Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, proxy statements, and amendments to reports filed pursuant to Sections 13(a) and 15(d) of the Securities Exchange Act of 1934, as\namended, are made available free of charge on or through our website at www.aware.com as soon as reasonably practicable after such reports are filed with, or furnished to, the Securities and Exchange Commission (the SEC). The SEC also maintains a website, www.sec.gov, that contains reports and other information regarding issuers that file electronically with the SEC.\nCopies of our (i) Corporate Governance Principles, (ii) charters for the Audit Committee, Compensation Committee, and Nominating Committee, and (iii) Code of Ethics are available in the Investor Relations section of our website at www.aware.com.",
    "item_1A": "ITEM 1A. Risk Factors\nWhile we expect the impacts of COVID-19 to have an adverse effect on our business, financial condition and results of operations, we are unable to predict the extent or nature of these impacts at this time.\nDue to the COVID-19 pandemic we have been unable to: (i) conduct face-to-face meetings with customers and prospective customers, (ii) present in-person demonstrations of our software solutions, (iii) attend trade shows and conferences which typically generate future sales opportunities or (iv) meet with prospective strategic partners. These effects caused by the COVID-19 pandemic adversely impacted our operating and financial results in 2020 and will likely have an adverse impact on our operating and financial results over the next several quarters.\nThe extent to which our operating and financial results will continue to be affected by the COVID-19 pandemic will depend on various factors and consequences beyond our control, such as the duration and scope of the pandemic; additional actions by businesses and governments in response to the pandemic; and the speed and effectiveness of responses to combat the virus, including vaccine development and distribution. COVID-19, and the volatile regional and global economic conditions stemming from the pandemic, could also aggravate our other risk factors described in this Form 10-K.\nOur operating results may fluctuate significantly from period-to-period and are difficult to predict.\nIndividual orders can represent a meaningful percentage of our revenues and operating results in any single quarter and the timing of the receipt of those orders is difficult to predict. The failure to close an order or the deferral or cancellation of an order can result in revenue and net income shortfalls for that quarter. We base our current and future expense levels on our internal operating plans and sales forecasts, and our operating costs are to a large extent fixed. As a result, we may not be able to sufficiently reduce our costs in any quarter to adequately compensate for an unexpected near-term shortfall in revenues, and even a small shortfall could disproportionately and adversely affect financial results for that quarter.\nOur financial results may be negatively affected by a number of factors, including the following:\n•\nthe lack or reduction of government funding and the political, budgetary and purchasing constraints of government customers who purchase products and services directly or indirectly from us;\n•\nthe terms of customer contracts that affect the timing of revenue recognition;\n•\nthe size and timing of our receipt of customer orders;\n•\nsignificant fluctuations in demand for our products and services;\n•\nthe loss of a key customer or one of its key customers;\n•\nnew competitors, or the introduction of enhanced solutions from new or existing competitors;\n•\ncompetitive pressures on selling prices;\n•\ncancellations, delays or contract amendments by government customers;\n•\nhigher than expected costs, asset write-offs, and other one-time financial charges; and\n•\ngeneral economic trends and other factors, such as the COVID-19 pandemic.\nAs a result of these factors, we believe that period-to-period comparisons of our revenue levels and operating results are not necessarily meaningful. You should not rely on our quarterly revenue and operating results to predict our future performance.\nWe derive a significant portion of our revenue directly or indirectly from government customers, and our business may be adversely affected by changes in the contracting or fiscal policies of those governmental entities.\nWe derive a significant portion of our revenue directly or indirectly from federal, international, state and local governments. We believe that the success and growth of our business will continue to depend on government customers purchasing our products and services either directly through us or indirectly through our channel partners. Changes in government contracting policies or government budgetary constraints may adversely affect our financial performance. Among the factors that could adversely affect our business are:\n•\nchanges in fiscal policies or decreases in available government funding,\n•\nchanges in government funding priorities;\n•\nchanges in government programs or applicable requirements;\n•\nthe adoption of new laws or regulations or changes to existing laws or regulations;\n•\nchanges in political or social attitudes with respect to security and defense issues;\n•\nchanges in audit policies and procedures of government entities;\n•\npotential delays or changes in the government appropriations process; and\n•\ndelays in the payment of our invoices by government payment offices.\nThese and other factors could cause government customers or our channel partners to reduce purchases of products and services from us which would have a material adverse effect on our business, financial condition and operating results.\nA significant commercial market for biometrics technology may not develop, and, even if it does, there can be no assurance our biometrics technology will be successful.\nA component of our strategy to grow revenue includes expansion into commercial markets. To date, biometrics technology has received only limited acceptance and slow adoption in such markets. Although the recent appearance of biometric readers on popular consumer products, such as smartphones, has increased interest in biometrics as a means of authenticating and/or identifying individuals, commercial markets for biometrics technology are still in the process of developing and evolving. Biometrics-based solutions compete with more traditional security methods including keys, cards, personal identification numbers, passwords and security personnel. Acceptance of biometrics as an alternative to such traditional methods depends upon a number of factors including: i) the performance and reliability of biometric solutions; ii) costs involved in adopting and integrating biometric solutions; iii) public concerns regarding privacy; and iv) potential privacy legislation.\nFor these reasons, we are uncertain whether there will be significant demand for biometrics technology from commercial markets. Moreover, even if there is significant demand, there can be no assurance that our biometrics products will achieve market acceptance.\nWe derive a significant portion of our revenue from third party channel partners.\nOur future results depend upon the continued successful distribution of our products through a channel of systems integrators and OEM partners. Systems integrators, including VARs, use our software products as a component of the biometrics systems they deliver to their customers. OEMs embed our software products in their technology devices or software products. These channel partners typically sell their products and services to government customers.\nOur failure to effectively manage our relationships with these third parties could impair the success of our sales, marketing and support activities. Moreover, the activities of these third parties are not within our direct control. The occurrence of any of the following events could have a material adverse effect on our business, financial condition and operating results:\n•\na reduction in sales efforts by our partners;\n•\nthe failure of our partners to win government awards in which our products are used;\n•\na reduction in technical capabilities or financial viability of our partners;\n•\na misalignment of interest between us and them;\n•\nthe termination of our relationship with a major systems integrator or OEM; or\n•\nany adverse effect on a partner’s business related to competition, pricing and other factors.\nIf the biometrics market does not experience significant growth or if our products do not achieve broad acceptance both domestically and internationally, we may not be able to grow our business.\nOur revenues are derived primarily from sales of biometrics products and services. We cannot accurately predict the future growth rate or the size of the biometrics market. The expansion of the biometrics market and the market for our biometrics products and services depends on a number of factors, such as:\n•\nthe cost, performance and reliability of our products and services and the products and services offered by our competitors;\n•\nthe continued growth in demand for biometrics solutions within the government and law enforcement markets, as well as the development and growth of demand for biometric solutions in markets outside of government and law enforcement;\n•\ncustomers’ perceptions regarding the benefits of biometrics solutions;\n•\npublic perceptions regarding the intrusiveness of these solutions and the manner in which organizations use the biometric information collected;\n•\npublic perceptions regarding the confidentiality of private information;\n•\nproposed or enacted legislation related to privacy of information;\n•\ncustomers’ satisfaction with biometrics solutions; and\n•\nmarketing efforts and publicity regarding biometrics solutions.\nEven if biometrics solutions gain wide market acceptance, our solutions may not adequately address market requirements and may not continue to gain market acceptance. If biometrics solutions generally or our solutions specifically do not gain wide market acceptance, we may not be able to achieve our anticipated level of growth and our revenues and results of operations would be adversely affected.\nWe face intense competition from other biometrics solutions providers.\nA significant number of established companies have developed or are developing and marketing software and hardware for biometrics products and applications that currently compete with or will compete directly with our offerings. We believe that additional competitors will enter the biometrics market and become significant long-term competitors, and that, as a result, competition will increase. Companies competing with us may introduce solutions that are competitively priced, have increased performance or functionality or incorporate technological advances we have not yet developed or implemented. Our current principal competitors include:\n•\nDiversified technology providers that offer integrated biometrics solutions to governments, law enforcement agencies and other organizations. This group of competitors includes companies such as Idemia, Thales, and NEC.\n•\nComponent providers that offer biometrics software and hardware components for fingerprint, facial, iris and voice biometric identification. This group of competitors includes companies such as FaceTec, Dermalog and Innovatrics.\nWe expect competition to intensify in the near term in the biometrics market. Many current and potential competitors have substantially greater financial, marketing, and research resources than we have. Moreover, low-cost foreign competitors from third world and other countries have demonstrated a willingness to sell their products at significantly reduced prices. To compete effectively in this environment, we must continually develop and market new and enhanced solutions and technologies at competitive prices and must have the resources available to invest in significant research and development activities. Our failure to compete successfully could cause our revenues and market share to decline.\nThe biometrics industry is characterized by rapid technological change and evolving industry standards, which could render our existing products obsolete.\nOur future success will depend upon our ability to develop and introduce a variety of new capabilities and enhancements to our existing products in order to address the changing and sophisticated needs of the marketplace. Frequently, technical development programs in the biometrics industry require assessments to be made of the future direction of technology, which is inherently difficult to predict. Delays in introducing new products and enhancements, the failure to choose correctly among technical alternatives or the failure to offer innovative products or enhancements at competitive prices may cause customers to forego purchases of our products and purchase our competitors’ products. We may not have adequate resources available to us or may not adequately keep pace with appropriate requirements in order to effectively compete in the marketplace.\nOur software products may have errors, defects or bugs, which could result in delayed or lost revenue, expensive correction, liability to our customers, and claims against us.\nComplex software products such as ours may contain errors, defects or bugs. Defects in the products that we develop and sell to our customers could require expensive corrections and result in delayed or lost revenue, adverse customer reaction and negative publicity about us or our products and services. Customers who are not satisfied with any of our products may also bring claims against us for damages, which, even if unsuccessful, would likely be time-consuming to defend, and could result in costly litigation and payment of damages. Such claims could harm our reputation, financial results and competitive position.\nOur business may be adversely affected by our use of open source software.\nThe software industry is making increasing use of open source software in the development of products. We also license and integrate certain open source software components from third parties into our software. Open source software license agreements may require that the software code in these components or the software into which they are integrated be freely accessible under open source terms. Many features we may wish to add to our products in the future may be available as open source software and our development team may wish to make use of this software to reduce development costs and speed up the development process. While we carefully monitor the use of all open source software and try to ensure that no open source software is used in such a way as to require us to disclose the source code to the related product, such use could inadvertently occur. If we were required to make our software freely available, our business could be seriously harmed.\nWe rely on third-party software to develop and provide our solutions and significant defects in third-party software could harm our business.\nWe rely on software licensed from third parties to develop and offer some of our solutions. In addition, we may need to obtain future licenses from third parties to use software or other intellectual property associated with our solutions. We cannot assure you that these licenses will be available to us on acceptable terms, without significant price increases or at all. Any loss of the right to use any such software or other intellectual property required for the development and maintenance of our solutions could result in delays in the provision of our solutions until equivalent technology is either developed by us, or, if available from others, is identified, obtained, and integrated, which could harm our business. Any errors or defects in third-party software could result in errors or a failure of our solutions, which could harm our business.\nPart of our future business is dependent on market demand for, and acceptance of, the cloud-based model for the use of software.\nWe expect to derive a growing percentage of our revenue from the sale of cloud-based services. As a result, widespread acceptance and use of the cloud-based business model is critical to our future growth and success. Under the perpetual or fixed term license model for software procurement, users of the software typically run applications on their hardware. Because companies are generally predisposed to maintaining control of their IT systems and infrastructure, there may be resistance to the concept of accessing the functionality that software provides as a service through a third party. If the market for cloud-based, software solutions ceases to grow or grows slower than we currently anticipate, demand for our services could be negatively affected.\nOur operational systems and networks and products may be subject to an increasing risk of continually evolving cybersecurity or other technological risks, which could result in the disclosure of company or customer confidential information, damage to Aware’s reputation, additional costs to Aware, regulatory penalties and financial losses.\nThe company's products, services and systems may be used in critical company, customer or third-party operations, or involve the storage, processing and transmission of sensitive data, including valuable intellectual property, other proprietary or confidential data, regulated data, and personal information of employees, customers and others. Successful breaches, employee malfeasance, or human or technological error could result in, for example, unauthorized access to, disclosure, modification, misuse, loss, or destruction of company, customer, or other third party data or systems; theft of sensitive, regulated, or confidential data including personal information and intellectual property; the loss of access to critical data or systems through ransomware, destructive attacks or other means; and business delays, service or system disruptions or denials of service.\nIf we or third parties with which we do business were to fall victim to successful cyber-attacks or experience other cybersecurity incidents, including the loss of individually identifiable customer or other sensitive data, we may incur substantial costs and suffer other negative consequences, which may include remediation costs, such as liability for stolen assets or information, repairs of system damage, and incentives to customers or business partners in an effort to maintain relationships after an attack as well as litigation and legal risks, including regulatory actions by state and federal regulators.\nOur intellectual property is subject to limited protection.\nBecause we are a technology provider, our ability to protect our intellectual property and to operate without infringing the intellectual property rights of others is critical to our success. We regard our technology as proprietary. We rely on a combination of U.S. and worldwide patent, trade secret, copyright, and trademark law as well as confidentiality agreements to protect our proprietary technology and cannot assure you that we will be able to enforce the patents we own against third parties. Some foreign countries do not currently provide effective legal protection for intellectual property and our ability to prevent the unauthorized use of our products in those countries is therefore limited. Despite our efforts, these measures can only provide limited protection. Unauthorized third parties may try to copy or reverse engineer portions of our products or otherwise obtain and use our intellectual property. If we fail to protect our intellectual property rights adequately, our competitors may gain access to our technology, and our business would thus be harmed.\nIn the future, we may be involved in legal action to enforce our intellectual property rights relating to our patents, copyrights or trade secrets. Any such litigation could be costly and time-consuming for us, even if we were to prevail. Moreover, even if we are successful in protecting our proprietary information, our competitors may independently develop technologies substantially equivalent or superior to our technology. Accordingly, despite our efforts, we may be unable to prevent third parties from infringing upon or misappropriating our intellectual property or otherwise gaining access to our technology. The misappropriation of our technology or the development of competitive technology could seriously harm our business.\nWe may be sued by third parties for alleged infringement of their proprietary rights.\nOur technology and products may infringe the intellectual property rights of others. A large and increasing number of participants in the technology industry, including companies known as non-practicing entities, have applied for or obtained patents. Some of these patent holders have demonstrated a readiness to commence litigation based on allegations of patent infringement. Third parties have asserted against us in the past and may assert against us in the future patent, copyright and other intellectual property rights to technologies that are important to our business.\nIntellectual property rights can be uncertain and involve complex legal and factual questions. Moreover, intellectual property claims, with or without merit, can be time-consuming and expensive to litigate or settle, and could divert management attention away from the execution of our business plan. If we were found to have infringed the proprietary rights of others, we could be subject to substantial damages or an injunction preventing us from conducting our business.\nIf we are unable to attract and retain key personnel, our business could be harmed.\nIf any of our key employees were to leave, we could face substantial difficulty in hiring qualified successors and could experience a loss in productivity while any successor obtains the necessary training and experience. Our employment relationships are at-will and we have had key employees leave in the past. We cannot assure you that one or more key employees will not leave in the future. We intend to continue to hire additional highly qualified personnel, including software engineers and sales personnel, but may not be able to attract, assimilate or retain qualified personnel in the future. Any failure to attract, integrate, motivate and retain these employees could harm our business.\nOur business may be affected by government laws and regulations.\nExtensive regulation under federal, state, and foreign law has adversely affected us and could further adversely affect us in ways that are difficult for us to predict. More specifically, we are subject to regulatory environment changes regarding privacy and data protection that could have a material impact on our results of operations. These regulatory changes may potentially involve new regulatory issues/requirements such as the EU General Data Protection Regulation (GDPR), the California Consumer Privacy Act (CCPA), the Illinois Biometric Privacy Act, Texas Statute on the Capture or Use of Biometric Identifier, State of Washington H.B. 1493, Brazil’s General Data Protection Law (LGPD) and any other state, federal or foreign regulations governing the collection, use and storage of biometric data. The potential costs of compliance with or imposed by new/existing regulations and policies that are applicable to us may affect the use of our products and services and could have a material adverse impact on our results of operations.\nIn addition, our business may also be adversely affected by: i) the imposition of tariffs, duties and other import restrictions on goods and services we purchase from non-domestic suppliers; or ii) by the imposition of export restrictions on products we sell internationally. Changes in current or future laws or regulations, in the United States or elsewhere, could seriously harm our business.\nAdverse economic conditions could harm our business.\nUnfavorable changes in economic conditions, including recessions, inflation, turmoil in financial markets, changes caused by global crisis such as the COVID-19 pandemic or other changes in economic conditions, could harm our business, results of operations, and financial conditions as a result of:\n•\nreduced demand for our products;\n•\nincreased risk of order cancellations or delays;\n•\nincreased pressure on the prices for our products;\n•\ngreater difficulty in collecting accounts receivable; and\n•\nrisks to our liquidity, including the possibility that we might not have access to our cash when needed.\nWe are unable to predict whether or when any such adverse economic conditions could occur in the U.S. or other countries; and if they do occur, nor can we predict their timing, duration, or severity. The longer the duration, the greater the risks we face in operating our business.\nWe may not realize the anticipated benefits of our acquisitions.\nWe may make acquisitions of companies that offer complementary products, services and technologies such as our acquisition of AFIX in November of 2020. The ultimate success of our acquisitions depends, in part, on our ability to realize the anticipated synergies, cost savings and growth opportunities from integrating acquired businesses or assets into our existing businesses. However, the acquisition and successful integration of independent businesses or assets is a complex, costly and time-consuming process, and the benefits we realize may not exceed the costs of the acquisition. The risk and difficulties associated with acquiring and integrating companies and other assets include, among others, difficulties assimilating the operations and personnel of acquired companies, challenges in realizing\nthe value of the acquired assets relative to the price paid, distraction of management from our ongoing businesses and potential product disruptions associated with the sale of the acquired company’s products. These factors could have a material adverse effect on our business, financial condition, operating results and cash flows. Additionally, the consideration we pay for any future acquisitions could include shares of our stock, which could cause dilution to existing shareholders and to earnings per share.\nWe may have additional tax liabilities.\nWe are subject to income taxes in the United States. Significant judgments are required in determining our provisions for income taxes. In the course of preparing our tax provisions and returns, we must make calculations where the ultimate tax determination may be uncertain. Our tax returns are subject to examination by the Internal Revenue Service (“IRS”) and state tax authorities. There can be no assurance as to the outcome of these examinations. If the ultimate determination of taxes owed is for an amount in excess of amounts previously accrued, our operating results, cash flows, and financial condition could be adversely affected.\nThe market price of our common stock has been and may continue to be subject to wide fluctuations, and this may make it difficult for shareholders to resell the common stock when they want or at prices they find attractive.\nThe market price of our common stock, like that of other technology companies, is volatile and is subject to wide fluctuations in response to a variety of factors, including:\n•\nquarterly variations in operating results;\n•\nannouncements of technological innovations or new products by us or our competitors,\n•\nchanges in customer relationships, such as the loss of a key customer;\n•\nrecruitment or departure of key personnel;\n•\ncorporate actions we may initiate, such as acquisitions, stock sales or repurchases, dividend declarations, or corporate reorganizations; and\n•\nother events or factors.\nOur stock price may also be affected by broader market trends unrelated to our performance. As a result, purchasers of our common stock may be unable at any given time to sell their shares at or above the price they paid for them. Moreover, companies that have experienced volatility in the market price of their stock often are subject to securities class action litigation. If we were the subject of such litigation, it could result in substantial costs and divert management's attention and resources.\nIf we are unable to maintain effective internal controls over financial reporting, investors could lose confidence in the reliability of our financial statements, which could result in a decline in the price of our common stock.\nAs a public company, we are required to enhance and test our financial, internal and management control systems to meet obligations imposed by the Sarbanes-Oxley Act of 2002. Consistent with the Sarbanes-Oxley Act and the rules and regulations of the SEC, management's assessment of our internal controls over financial reporting is required in connection with our filing of our Annual Report on Form 10-K. If we are unable to identify, implement and conclude that we have effective internal controls over financial reporting, investors could lose confidence in the reliability of our financial statements, which could result in a decrease in the value of our common stock. Our assessment of our internal controls over financial reporting may also uncover weaknesses or other issues with these controls that could also result in adverse investor reaction.\nWe must make judgments in the process of preparing our financial statements.\nWe prepare our financial statements in accordance with generally accepted accounting principles and certain critical accounting policies that are relevant to our business. The application of these principles and policies requires us to make significant judgments and estimates. The most significant estimates included in the financial statements pertain to revenue recognition, reserves for doubtful accounts, valuation of acquired assets and assumed liabilities in business combination and valuation allowance for deferred income tax assets. In the event that our judgments and estimates differ from actual results, we may have to change them, which could materially affect our financial position and results of operations.\nMoreover, accounting standards have been subject to rapid change and evolving interpretations by accounting standards setting organizations over the past few years. The implementation of new accounting standards requires us to interpret and apply them appropriately. If our current interpretations or applications are later found to be incorrect, we may have to restate our financial statements and the price of our stock could decline.",
    "item_1B": "ITEM 1B. Unresolved Staff Comments\nNot applicable.",
    "item_2": "ITEM 2. PROPERTIES\nWe believe that our existing facilities are adequate for our current needs and that additional space sufficient to meet our needs for the foreseeable future will be available on reasonable terms. We currently occupy approximately 72,000 square feet of office space in Bedford, Massachusetts, which serves as our headquarters. This site is used for our research and development, sales and marketing, and administrative activities. We own this facility.",
    "item_3": "ITEM 3. LEGAL PROCEEDINGS\nFrom time to time we are involved in litigation incidental to the conduct of our business. We are not party to any lawsuit or proceeding that, in our opinion, is likely to materially impact us or our business.",
    "item_4": "ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II",
    "item_5": "ITEM 5. MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur common stock is the only class of stock we have outstanding, and it trades on the Nasdaq Global Market under the symbol AWRE.\nAs of February 11, 2021, we had approximately 78 shareholders of record. This number does not include shareholders from whom shares were held in a “nominee” or “street” name. We paid no dividends in 2020 or 2019. We anticipate that we will continue to reinvest any earnings to finance future operations although we may also pay special cash dividends if our board of directors deems it appropriate.\nIssuer Purchases of Equity Securities\nPeriod\n(a)\nTotal\nNumber\nof Shares\nPurchased\n(b)\nAverage\nPrice Paid\nper Share\n(c)\nTotal\nNumber of\nShares\nPurchased\nas Part of\nPublicly\nAnnounced\nPlans or\nPrograms\n(1)\n(d)\nMaximum Number\n(or Approximate\nDollar Value) of\nShares That May\nYet Be Purchased\nUnder the Plans\nor Programs\nNovember 1 through 30, 2020\n33,317\n$\n2.95\n33,317\nDecember 1 through 31, 2020\n43,395\n$\n3.40\n43,395\n$\n9,048,396\n(1)\nOn May 4, 2020, the Company announced that the board of directors had approved the repurchase of up to $10,000,000 of our common stock from time to time through December 31, 2021. During the three months ended December 31, 2020, we purchased 76,712 shares under this plan at an aggregate purchase price of $245,851.",
    "item_6": "ITEM 6. SELECTED FINANCIAL DATA\nNot applicable.",
    "item_7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nRESULTS OF OPERATIONS\nThe following table sets forth, for the years indicated, certain line items from our consolidated statements of income and comprehensive income stated as a percentage of total revenue:\nYear ended\nDecember 31,\nRevenue:\nSoftware licenses\n%\n%\nSoftware maintenance\nServices\nTotal revenue\nCosts and expenses:\nCost of services\nResearch and development\nSelling and marketing\nGeneral and administrative\nTotal costs and expenses\nOperating loss\n(83\n)\n(34\n)\nInterest income\nLoss before provision for (benefit from) income taxes\n(81\n)\n(26\n)\nProvision for (benefit from) income taxes\n(14\n)\nNet loss\n(67\n%)\n(68\n%)\nSummary of Operations\nWe are primarily engaged in the development and sale of biometrics products, solutions and services. Our software products are used in government and commercial systems and applications and fulfill a broad range of functions critical to secure biometric enrollment, authentication, identification and transactions. Principal government applications of biometrics systems include border control, visa applicant screening, law enforcement, national defense, intelligence, secure credentialing, access control, and background checks. Principal commercial applications include: i) user enrollment and authentication used for login to mobile devices, computers, networks, and software programs; ii) user authentication for financial transactions and purchases (online and in-person); iii) physical access control to buildings; and iv) identity proofing of prospective employees and customers. We sell our biometrics software products and services globally through a multifaceted distribution strategy using systems integrators, OEMs, VARs, partners, and directly to end user customers. We also derive a portion of our revenue from the sale of imaging software licenses to OEMs and systems integrators that incorporate our software into medical imaging products and medical systems.\nSummary of Financial Results\nWe used revenue and operating loss to summarize financial results over the past two years as we believe these measurements are the most meaningful way to understand our operating performance.\n2020 compared to 2019\nRevenue and operating loss in 2020 were $11.3 million and $9.4 million, respectively, which compared to revenue and operating loss in 2019 of $12.2 million and $4.1 million, respectively.\nLower revenue in 2020 as compared to 2019 was primarily due to lower services revenue related to a software license agreement, we entered with a systems integrator in the second quarter of 2018 for a large project where we performed significantly more services in 2019 as compared to 2020. This was partially offset by higher subscription revenue. Lower operating income in 2020 as compared to 2019 was primarily due to: i) lower revenue in 2020; and ii) higher total costs and expenses in 2020.\nSoftware License Revenue\nSoftware license revenue consists of revenue from the sale of biometrics and imaging software products. Sales of software products depend on our ability to win proposals to supply software for biometrics systems projects either directly to end user customers or indirectly through channel partners.\nSoftware license revenue increased 9% from $4.6 million in 2019 to $5.0 million in 2020. As a percentage of total revenue, software license revenue increased from 38% in 2019 to 45% in 2020. The $0.4 million increase in software license revenue was primarily due to a $0.3 million increase in biometrics software license sales and a $0.1 million increase in imaging software license sales. The reasons for the changes in biometrics and imaging software licenses were:\ni)\nBiometrics software licenses - Biometrics software license sales were $4.1 million in 2020 versus $3.8 million in 2019. The dollar increase was primarily due to higher subscription revenue of $0.6 million. This was partially offset by lower license revenue of $0.4 million.\nii)\nImaging software licenses - Imaging software license sales were $0.9 million in 2020 versus $0.8 million in 2019. The dollar increase was primarily due to higher imaging license sales to our systems integrator customers in 2020.\nSoftware Maintenance Revenue\nSoftware maintenance revenue consists of revenue from the sale of software maintenance contracts. Software maintenance contracts entitle customers to receive software support and software updates, if and when they become available, during the term of the contract.\nSoftware maintenance revenue increased 3% from $5.3 million in 2019 to $5.4 million in 2020. As a percentage of total revenue, software maintenance revenue increased from 43% in 2019 to 48% in 2020.\nA majority of our customers purchase software maintenance contracts when they initially purchase software licenses. Since our software is used in active biometrics systems, many of our customers continue to renew their maintenance contracts in subsequent years while systems remain operational.\nServices Revenue\nServices revenue consists of fees we charge to perform software development, integration, installation, and customization services. Similar to software license revenue, services revenue depends on our ability to win biometrics systems projects either directly with end user customers or in conjunction with channel partners. Services revenue will fluctuate when we commence new projects and/or when we complete projects that were started in previous periods.\nServices decreased 64% from $2.3 million in 2019 to $0.8 million in 2020. As a percentage of total revenue, services decreased from 19% in 2019 to 7% in 2020. The dollar decrease in services revenue was primarily due to lower services revenue related to the software license agreement we entered into with a systems integrator in the second quarter of 2018 for a large project where we performed significantly more services in 2019 as compared to 2020 and to a less extent lower services revenue from other system integrators.\nCost of Services\nCost of services consists of engineering costs to perform customer services projects. Such costs primarily include: i) engineering salaries, stock-based compensation, fringe benefits, and facilities; and ii) engineering consultants and contractors.\nCost of services decreased 4% from $1.3 million in 2019 to $0.8 million in 2020. Cost of services as a percentage of services revenue increased from 54% in 2019 to 96% in 2020, which means that gross margins on services decreased from 46% in 2019 to 4% in 2020. The dollar decrease in cost of services was primarily due to a large project with a systems integrator that we signed in the second quarter of 2018.\nGross margins on services of 4% and 46%, in 2020 and 2019, respectively, were a function of: i) the nature of the projects; ii) the level of engineering difficulty and labor hours required to complete project tasks; and iii) how much we were able to charge. Gross margins in these years reflect the profitability mix of customer projects. We expect\nthat gross margins on services will continue to fluctuate in future periods based on the nature, complexity, and pricing of future projects.\nResearch and Development Expense\nResearch and development expense consists of costs for: i) engineering personnel, including salaries, stock-based compensation, fringe benefits, and facilities; ii) engineering consultants and contractors, and iii) other engineering expenses such as supplies, equipment depreciation, dues and memberships and travel. Engineering costs incurred to develop our technology and products are classified as research and development expense. As described in the cost of services section, engineering costs incurred to provide engineering services for customer projects are classified as cost of services and are not included in research and development expense.\nThe classification of total engineering costs to research and development expense and cost of services was (in thousands):\nYears ended\nDecember 31,\nResearch and development expense\n$\n9,093\n$\n7,928\nCost of services\n1,261\nTotal engineering costs\n$\n9,903\n$\n9,189\nResearch and development expense increased 8% from 2019 to 2020. As a percentage of total revenue, research and development expense increased from 75% in 2019 to 87% in 2020.\nTotal engineering costs increased by $0.7 million in 2020 as compared to 2019. The spending increase was primarily due to higher employee costs of $1.3 million. The increase was partially offset by a $0.6 million reduction in spending on third-party software development costs. Our engineering headcount increased by six to 52 in 2020. We believe our engineering organization was adequately staffed as of December 31, 2020.\nAs we described in the Part I-Business of this Form 10-K, we intend to introduce new products that will allow us to offer more complete biometrics solutions. We believe this strategy will allow us to sell more software into biometrics systems projects in order to grow our revenue. Our preference is to develop such products internally, however to the extent we are unable to do that, we may purchase or license technologies from third parties. We anticipate that we will continue to focus our future research and development activities on enhancing existing products and developing new products.\nSelling and Marketing Expense\nSelling and marketing expense primarily consists of costs for: i) sales and marketing personnel, including salaries, sales commissions, stock-based compensation, fringe benefits, travel, and facilities; and ii) advertising and promotion expenses.\nSales and marketing expense increased by 50% from $3.6 million in 2019 to $5.4 million in 2020. As a percentage of total revenue, sales and marketing expense increased from 30% in 2019 to 48% in 2020. The dollar increase in selling and marketing expense was primarily due increased headcount related costs of $1.7M and higher professional services of $0.5 million. This increase was partially offset by lower travel costs of $0.2 million due to COVID-19 travel restrictions and lower sales commission of $0.2 million due to lower revenue.\nGeneral and Administrative Expense\nGeneral and administrative expense consists primarily of costs for: i) officers, directors and administrative personnel, including salaries, bonuses, director compensation, stock-based compensation, fringe benefits, and facilities; ii) professional fees, including legal and audit fees; iii) public company expenses; and iv) other administrative expenses, such as insurance costs and bad debt provisions.\nGeneral and administrative expense increased by 51% from $3.6 million in 2019 to $5.4 million in 2020. As a percentage of total revenue, general and administrative expense increased from 29% in 2019 to 48% in 2020. The increase in general and administrative expense in 2020 was primarily due to costs related to the COVID-19 pandemic and turnover of over 50% our administrative personnel. Costs included $0.7 million of severance and transition\nexpense, $0.2 million of legal fees, $0.1 million of bad debt expense and $0.2 million of expense related to remote working. Also contributing to increased general and administrative expenses were $0.3 million of higher employee costs due to increased headcount legal and professional fees of $0.4 million.\nInterest Income\nInterest income decreased by 82% from $1.0 million in 2019 to $0.2 million in 2020. The dollar decrease was primarily due to lower interest rates within our money market accounts.\nIncome Taxes\nWe are subject to income taxes in the United States and we use estimates in determining our provisions for income taxes. We account for income taxes using the asset and liability method for accounting and reporting income taxes. Deferred tax assets and liabilities are recognized based on temporary differences between the financial reporting and income tax bases of assets and liabilities using statutory rates.\nA discussion of income taxes for the years ended December 31, 2020, and 2019 follows:\nYear ended December 31, 2020. Total income tax benefit for the year ended December 31, 2020 was $1.6 million. The income tax benefit for 2020 was primarily due to the tax benefit of the current year tax loss which can be carried back due to changes made by the CARES Act.\nYear ended December 31, 2019. Total income tax provision for the year ended December 31, 2019 was $5.2 million. The income tax provision for 2019 was primarily due to a change in valuation allowance for our deferred tax assets.\nLIQUIDITY AND CAPITAL RESOURCES\nIn recent years, we have financed the company with our cash balances, cash generated from operations, and cash received from the sale of patent assets. Equity financing has not been a meaningful source of financing for us in recent years. Cash flows from operating, investing and financing activities are described below.\nCash flow from operating activities\nA discussion of cash flow from operating activities for each of the last two years is as follows:\nYear ended December 31, 2020. Cash used by operating activities was $5.3 million in 2020. Cash used by operations was primarily the result of $7.6 million of net loss, partially offset by $0.8 million of changes in assets and liabilities and by the add back of $1.5 million of non-cash items for depreciation, amortization and stock-based compensation.\nYear ended December 31, 2019. Cash used by operating activities was $2.9 million in 2019. Cash used by operations was primarily the result of $8.3 million of net loss, and $0.9 million of changes in assets and liabilities. This was partially offset by the add back of $6.3 million of non-cash items for depreciation, amortization, stock-based compensation and deferred tax assets.\nCash flow from investing activities\nIn the years ended December 31, 2020 and 2019, our investing activities used net cash of $2.9 million and $0.1 million, respectively. A discussion of cash flow from investing activities for each of the last two years is as follows:\nYear ended December 31, 2020. Investing activity cash usage was primarily the result of $2.4 million used in connection with our acquisition of certain assets and liabilities of AFIX product suite and $0.5 million of purchases of property and equipment.\nYear ended December 31, 2019. Investing activity cash usage was primarily the result of purchases of property and equipment. We have no material commitments for capital expenditures.\nCash flow from financing activities\nIn the years ended December 31, 2020 and 2019, our financing activities used net cash of $1.0 million and $0.8 million, respectively. A discussion of cash flow from financing activities for each of the last two years is as follows:\nYear ended December 31, 2020. Financing activity cash usage was primarily the result of $0.9 million used to buy back stock under our stock repurchase program and $0.1 million used to pay income taxes for employees who surrendered shares in connection with stock grants.\nYear ended December 31, 2019. Financing activity cash usage was primarily the result of $0.8 million used to buy back stock under our stock repurchase program and $0.1 million used to pay income taxes for employees who surrendered shares in connection with stock grants.\nAt December 31, 2020, we had cash and cash equivalents of $38.6 million. While we cannot assure you that we will not require additional financing, or that if needed such financing will be available to us, we believe that our cash and cash equivalents will be sufficient to fund our operations for at least the next twelve months from the filing date of this Annual Report on Form 10-K.\nTo date, inflation has not had a material impact on our financial results. There can be no assurance, however, that inflation will not adversely affect our financial results in the future.\nOFF-BALANCE SHEET ARRANGEMENTS\nWe do not currently have any arrangements with unconsolidated entities, such as entities often referred to as structured finance, special purpose entities, or variable interest entities which are often established for the purpose of facilitating off-balance sheet arrangements or other contractually narrow or limited purposes. Accordingly, we are not exposed to any financing, liquidity, market or credit risk if we had such relationships.\nCRITICAL ACCOUNTING POLICIES\nThe Company’s significant accounting policies are discussed in Note 2, Summary of Significant Accounting Policies, to our financial statements, included elsewhere in this Annual Report. We have identified the following as our significant accounting policies and estimates, which are defined as those that are reflective of significant judgments and uncertainties, are the most pervasive and important to the presentation of our financial condition and results of operations and could potentially result in materially different results under different assumptions, judgments or conditions.\nRevenue recognition. In accordance with Accounting Standards Codification (“ASC”), Topic 606, Revenue from Contracts with Customers (“ASC 606”), revenue is recognized when a customer obtains control of promised goods and services. The amount of revenue recognized reflects the consideration to which we expect to be entitled to receive in exchange for these goods and services. In addition, ASC 606 requires disclosures of the nature, amount, timing, and uncertainty of revenue and cash flows arising from contracts with customers.\nThe core principle of the standard is that we should recognize revenue to depict the transfer of promised goods or services to customers in an amount that reflects the consideration to which we expect to be entitled in exchange for those goods or services. To achieve that core principle, we apply the following five step model:\n1.\nIdentify the contract with the customer;\n2.\nIdentify the performance obligations in the contract;\n3.\nDetermine the transaction price;\n4.\nAllocate the transaction price to the performance obligations in the contract; and\n5.\nRecognize revenue when (or as) each performance obligation is satisfied.\nWe categorize revenue as software licenses, software maintenance, or services. Revenue from software licenses is recognized at a point in time upon delivery, provided all other revenue recognition criteria are met. We recognize software maintenance revenue over time on a straight-line basis over the contract period. Services revenue is recognized over time as the services are delivered using an input method (i.e., labor hours incurred as a percentage of total labor hours budgeted), provided all other revenue recognition criteria are met.\nIn addition to selling software licenses, software maintenance and software services on a standalone basis, a significant portion of our contracts include multiple performance obligations, which require an allocation of the transaction price to each distinct performance obligation based on a relative standalone selling price (“SSP) basis. The SSP is the price\nat which we would sell a promised good or service separately to a customer. The best estimate of SSP is the observable price of a good or service when we sell that good or service separately. A contractually stated price or a list price for a good or service may be the SSP of that good or service. We use a range of amounts to estimate SSP when we sell each of the goods and services separately and need to determine whether there is a discount that needs to be allocated based on the relative SSP of the various goods and services. In instances where SSP is not directly observable, such as when we do not sell the product or service separately, we typically determine the SSP using an adjusted market assessment approach using information that may include market conditions and other observable inputs. We typically have more than one SSP for individual goods and services due to the stratification of those goods and services by customers and circumstances. In these instances, we may use information such as the nature of the customer and distribution channel in determining the SSP.\nWhen software licenses and significant customization engineering services are sold together, they are accounted for as a combined performance obligation, as the software licenses are generally highly dependent on, and interrelated with, the associated customization services and therefore are not distinct performance obligations. Revenue for the combined performance obligation is recognized over time as the services are delivered using an input method (i.e., labor hours incurred as a percentage of total labor hours budgeted).\nWhen software subscription licenses are sold, the term software license and software maintenance are generally considered distinct performance obligations. The transaction price is allocated to the term software license and the software maintenance based on relative SSP. We sell our software subscription license for a fixed fee or a usage-based royalty fee, sometimes subject to a minimum guarantee. When the amount is in the form of a fixed fee, including the guaranteed minimum in usage-based royalty, revenue allocated to the term software license is recognized at a point in time upon delivery, provided all other revenue recognition criteria are met. Any royalties not subject to the guaranteed minimum or earned in excess of the minimum amount are recognized as revenue when the subsequent usage occurs. Revenue allocated to the software maintenance is recognized over the contract term.\nThe amount of consideration is not adjusted for a significant financing component if the time between payment and the transfer of the related good or service is expected to be one year or less under the practical expedient in ASC 606-10-32-18. Our revenue arrangements are typically accounted for under such expedient, as payment is typically due within 30 to 60 days. As of December 31, 2020 and 2019, none of our contracts contained a significant financing component.\nStock-Based Compensation. We grant stock and stock options to our employees and directors. We measure stock-based compensation cost at the grant date based on the fair value of the award and recognize it as expense over the applicable vesting period of the award on a straight-line basis.\nFor stock awards, we determine the fair value of the award by using the fair market value of our stock on the date of grant; provided the number of shares in the grant is fixed on the grant date.\nFor stock options, we use the Black-Scholes valuation model to estimate the fair value of the award. This valuation model takes into account the exercise price of the award, as well as a variety of significant assumptions. The assumptions used to estimate the fair value of stock options include the expected term, the expected volatility of our stock over the expected term, the risk-free interest rate over the expected term, and our expected annual dividend yield.\nIncome taxes. As part of the process of preparing our consolidated financial statements we are required to estimate our actual current tax expense. We must also estimate temporary and permanent differences that result from differing treatment of certain items for tax and accounting purposes. These differences result in deferred tax assets and liabilities, which are included in our consolidated balance sheet. We must then assess the likelihood that our deferred tax assets will be recovered from future taxable income and to the extent we believe recovery is not likely, we must establish a valuation allowance. To the extent we establish a valuation allowance or increase this allowance in a period for deferred tax assets, which have been recognized, we must include an expense with the tax provision in the statement of operations. Conversely, to the extent we decrease our valuation allowance in a period for deferred tax assets, which have been previously reserved, we must include a tax benefit with the tax provision in the statement of operations.\nThe Coronavirus Aid, Relief and Economic Security Act (CARES Act) was signed into law on March 27, 2020. The Act contained specific relief and stimulus measures including allowing net operating losses originating in 2018 through 2020 to be carried back five years to offset taxable income in the carryback period.\nSignificant management judgment is required in determining our provision for income taxes, our deferred tax assets, and any valuation allowance recorded against our net deferred tax assets. Our deferred tax assets primarily relate to: i) research and development tax credit carryforwards related to excess stock compensation benefits; ii) net operating loss carryforwards; and iii) temporary differences that result from differing treatment of certain items for tax and accounting purposes. As of December 31, 2020, we had a total of $8.7 million of deferred tax assets for which we have recorded an $8.7 million valuation allowance. Also, we have recognized the tax benefit of the amount of our current year loss that can be carried back to recover taxes paid in earlier years.\nWe will continue to assess the level of valuation allowance required in future periods. Should evidence regarding the realizability of tax assets change at a future point in time, the valuation allowance will be adjusted accordingly.\nAllowance for doubtful accounts. We make judgments as to our ability to collect outstanding receivables and provide allowances for receivables when collection becomes doubtful. Provisions are made based upon a specific review of all significant outstanding invoices. If the judgments we make to determine the allowance for doubtful accounts do not reflect the future ability to collect outstanding receivables, additional provisions for doubtful accounts may be required.\nRECENT ACCOUNTING PRONOUNCEMENTS\nRecent Accounting Pronouncements. In December 2019, the Financial Accounting Standards Board (“FASB”) issued Accounting Standard Update (“ASU”) No. 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes. The ASU was issued to reduce the complexity of the reporting information for financial statement users. We adopted the standard on January 1, 2020. The adoption of the standard did not result in any adjustment to our financial statements.\nIn June 2016, the FASB issued ASU 2016-13, Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses of Financial Instruments, which changes the methodology for measuring credit losses on financial instruments and the timing of when such losses are recorded. This guidance was to be effective for reporting periods beginning after December 15, 2019, with early adoption permitted. In November 2019, the FASB issued ASU 2019-10, Financial Instruments - Credit Losses (Topic 326), Derivatives and Hedging (Topic 815), and Leases (Topic842) Effective Dates, which deferred the effective dates for us, as a smaller reporting company, until fiscal year 2023. We are continuing to assess the impact of the standard on our consolidated financial statements.",
    "item_7A": "",
    "item_8": "ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Aware, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Aware, Inc. and its subsidiary (the Company) as of December 31, 2020 and 2019, the related consolidated statements of operations, stockholders’ equity, and cash flows for the years then ended, and the related notes to the consolidated financial statements (collectively, the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2020 and 2019, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nRevenue Recognition\nAs described in Note 2 to the financial statements, the Company recognizes revenue when a customer obtains control of promised goods and services. The amount of revenue recognized reflects the consideration to which the Company expects to be entitled to receive in exchange for these goods and services. The Company offers customers the ability to purchase combinations of software licenses, software maintenance, and related professional services together in one arrangement. The Company must determine which promises are distinct performance obligations and allocate the revenue to the performance obligations that are considered distinct based upon their relative stand-alone selling price. Revenue allocated to software licenses is typically recognized at a point in time upon delivery and revenue allocated to the software maintenance and professional services is recognized over time, provided all other\nrevenue recognition criteria are met. Significant judgment is exercised by the Company in determining revenue recognition for these customer agreements, and includes the following:\n•\nDetermination of whether products and services are considered distinct performance obligations that should be accounted for separately versus together, such as software maintenance or professional services that are sold with software licenses\n•\nThe pattern of delivery (i.e., timing of when revenue is recognized) for each distinct performance obligation\n•\nIdentification and treatment of contract terms that may impact the timing and amount of revenue recognized (e.g., variable consideration, optional purchases, and material rights)\n•\nDetermination of stand-alone selling prices for each distinct performance obligation\nGiven these factors, the related audit effort in evaluating management's judgments in determining revenue recognition for these customer agreements was extensive and required a high degree of auditor judgment.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the financial statements. Our procedures related to the Company's revenue recognition for these customer agreements included, among others:\n•\nWe evaluated management's significant accounting policies related to these customer agreements for reasonableness.\n•\nWe selected a sample of customer agreements and performed the following procedures:\n-\nObtained and read contract source documents for each selection, including master agreements, and certain other documents which were part of the agreement\n-\nTested management's identification and treatment of contract terms\n-\nTested management’s underlying assumptions and conclusions regarding the standalone selling price for each distinct performance obligation\n-\nAssessed the terms in the customer agreement and evaluated the appropriateness of management's application of their accounting policies, along with their use of estimates, in the determination of revenue recognition conclusions\n-\nTested the mathematical accuracy of management's calculations of revenue and the associated pattern of revenue recognized in the financial statements.\n/s/ RSM US LLP\nWe have served as the Company's auditor since 2012.\nBoston, Massachusetts\nFebruary 17, 2021\nAWARE, INC.\nCONSOLIDATED BALANCE SHEETS\n(in thousands, except share data)\nDecember 31,\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n38,565\n$\n47,742\nAccounts receivable (less allowance for doubtful accounts of\n$138 at December 31, 2020 and $20 at December 31, 2019)\n2,285\n2,487\nUnbilled receivables\n2,229\n3,315\nPrepaid expenses and other current assets\nTotal current assets\n43,661\n53,800\nProperty and equipment, net\n3,701\n3,755\nIntangible assets, net\n1,217\n-\nGoodwill\n1,651\n-\nLong term tax receivable\n1,398\n-\nTotal assets\n$\n51,628\n$\n57,555\nLIABILITIES AND STOCKHOLDERS’ EQUITY\nCurrent liabilities:\nAccounts payable\n$\n$\nAccrued expenses\n1,531\n1,096\nDeferred revenue\n3,843\n2,777\nTotal current liabilities\n5,868\n4,060\nLong-term deferred revenue\nCommitments and contingent liabilities (Note 7)\nStockholders’ equity:\nPreferred stock, $1.00 par value; 1,000,000 shares authorized,\nnone outstanding\n-\n-\nCommon stock, $.01 par value; shares authorized,\n70,000,000 in 2020 and 2019; issued and\noutstanding 21,378,833 as of December 31,\n2020 and 21,442,781 as of December 31, 2019\nAdditional paid-in capital\n96,104\n96,255\nAccumulated deficit\n(50,648\n)\n(43,034\n)\nTotal stockholders’ equity\n45,670\n53,435\nTotal liabilities and stockholders’ equity\n$\n51,628\n$\n57,555\nThe accompanying notes are an integral part of the consolidated financial statements.\nAWARE, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(in thousands, except per share data)\nYears ended December 31,\nRevenue:\nSoftware licenses\n$\n5,038\n$\n4,599\nSoftware maintenance\n5,429\n5,262\nServices\n2,343\nTotal revenue\n11,309\n12,204\nCosts and expenses:\nCost of services\n1,261\nResearch and development\n9,093\n7,928\nSelling and marketing\n5,411\n3,610\nGeneral and administrative\n5,419\n3,583\nTotal costs and expenses\n20,733\n16,382\nOperating loss\n(9,424\n)\n(4,178\n)\nInterest and other income\n1,049\nLoss before (benefit) provision for income taxes\n(9,248\n)\n(3,129\n)\n(Benefit) provision for income taxes\n(1,634\n)\n5,211\nNet loss\n$\n(7,614\n)\n$\n(8,340\n)\nNet loss per share - basic\n$\n(0.35\n)\n$\n(0.39\n)\nNet loss per share - diluted\n$\n(0.35\n)\n$\n(0.39\n)\nWeighted-average shares - basic\n21,473\n21,523\nWeighted-average shares - diluted\n21,473\n21,523\nThe accompanying notes are an integral part of the consolidated financial statements.\nAWARE, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in thousands)\nYears ended December 31,\nCash flows from operating activities:\nNet loss\n$\n(7,614\n)\n$\n(8,340\n)\nAdjustments to reconcile net income to net cash\nprovided by operating activities:\nDepreciation and amortization\nStock-based compensation\nDeferred tax assets\n-\n5,171\nBad debt provision\n-\nIncrease (decrease) from changes in assets and liabilities:\nAccounts receivable\n(477\n)\nUnbilled receivables\n1,086\n(36\n)\nPrepaid expenses and other current assets\n(171\n)\nLong-term tax receivable\n(1,398\n)\n-\nAccounts payable\nAccrued expenses\n(223\n)\nDeferred revenue\n(262\n)\nNet cash used in operating activities\n(5,274\n)\n(2,945\n)\nCash flows from investing activities:\nPurchases of property and equipment\n(484\n)\n(111\n)\nCash paid for acquisition, net\n(2,430\n)\n-\nNet cash used in investing activities\n(2,914\n)\n(111\n)\nCash flows from financing activities:\nProceeds from issuance of common stock\nPayments made for taxes of employees who surrendered\nshares related to unrestricted stock\n(93)\n(92)\nRepurchase of common stock\n(946\n)\n(765\n)\nNet cash used in financing activities\n(989\n)\n(814\n)\nDecrease in cash and cash equivalents\n(9,177\n)\n(3,870\n)\nCash and cash equivalents, beginning of year\n47,742\n51,612\nCash and cash equivalents, end of year\n$\n38,565\n$\n47,742\nSupplemental disclosure:\nCash paid for income taxes\n$\n-\n$\nThe accompanying notes are an integral part of the consolidated financial statements.\nAWARE, INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\n(in thousands)\nAdditional\nTotal\nCommon Stock\nPaid-In\nAccumulated\nStockholders’\nShares\nAmount\nCapital\nDeficit\nEquity\nBalance at December 31, 2018\n21,516\n$\n$\n96,376\n$\n(34,694\n)\n$\n61,897\nExercise of common stock options\n-\n-\n-\nPerformance share award\n-\n-\n-\nIssuance of unrestricted stock\n(1\n)\n-\nShares surrendered by employees to\npay taxes related to unrestricted\nstock\n(27\n)\n-\n(92\n)\n(92\n)\nIssuance of common stock under\nemployee stock purchase plan\n-\nStock-based compensation expense\nRepurchase of common stock\n(234\n)\n(2\n)\n(763\n)\n(765)\nNet loss\n(8,340\n)\n(8,340\n)\nBalance at December 31, 2019\n21,443\n96,255\n(43,034\n)\n53,435\nIssuance of unrestricted stock\n(2\n)\n-\nShares surrendered by employees to pay\ntaxes related to unrestricted stock\n(27)\n-\n(93\n)\n(93)\nIssuance of common stock under\nemployee stock purchase plan\n-\nStock-based compensation expense\nRepurchase of common stock\n(298\n)\n(2\n)\n(944\n)\n(946\n)\nNet loss\n(7,614\n)\n(7,614\n)\nBalance at December 31, 2020\n21,379\n$\n$\n96,104\n$\n(50,648\n)\n$\n45,670\nThe accompanying notes are an integral part of the consolidated financial statements.\nNATURE OF BUSINESS\nWe are a global leader in biometrics software offerings and solutions. Our portfolio enables government agencies and commercial entities to enroll, identify authenticate and enable using biometrics, which comprise physiological characteristics, such as fingerprints, faces, irises and voices.\n•\nEnroll: Register biometric identities into an organization’s secure database\n•\nIdentify: Utilize an organization’s secure database to accurately identify individuals using biometric data\n•\nAuthenticate: Provide frictionless multi-factor, passwordless access to secured accounts and databases with biometric verification\n•\nEnable: Manage the lifecycle of secure identities through optimized biometric interchanges\nWe have been engaged in this business since 1993. Our comprehensive portfolio of biometric solutions is based on innovative, robust products designed explicitly for ease of integration, including customer-managed and integration ready biometric frameworks, platforms, software development kits (SDKs) and services. Principal government applications of biometrics systems include border control, visa applicant screening, law enforcement, national defense, intelligence, secure credentialing, access control, and background checks. Principal commercial applications include mobile enrollment, user authentication, identity proofing, and secure transaction enablement.\nOur products span multiple biometric modalities including fingerprint, face, iris and voice, and provide interoperable, standards-compliant, field-proven biometric functionality. Our products are used to capture, verify, format, compress and decompress biometric images as well as aggregate, analyze, process, match and transport those images and templates within biometric systems. For large deployments, we may provide project management and software engineering services. We sell our biometrics software products and services globally through a multifaceted distribution strategy using systems integrators, original equipment manufacturers (OEMs), value added resellers (VARs), partners, and directly to end user customers.\nCertain amounts in the consolidated financial statements and associated notes may not add due to rounding. All percentages have been calculated using unrounded amounts.\nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation - The consolidated financial statements include the accounts of Aware, Inc. and its subsidiary (“the Company”). All significant intercompany transactions have been eliminated.\nUse of Estimates - The preparation of our financial statements in conformity with accounting principles generally accepted in the United States of America requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amount of revenues and expenses during the reporting period. The most significant estimates included in the financial statements pertain to revenue recognition, reserves for doubtful accounts, valuation of acquired assets and assumed liabilities in business combinations and valuation allowance for deferred income tax assets. Actual results could differ from those estimates.\nFair Value Measurements - The Financial Accounting Standards Board (“FASB”) Codification defines fair value and establishes a fair value hierarchy that prioritizes the inputs to valuation techniques used to measure fair value. The hierarchy gives the highest priority to the unadjusted quoted prices in active markets for identical assets or liabilities (level 1 measurements) and the lowest priority to unobservable inputs (level 3 measurements). The three levels of the fair value hierarchy under the FASB Codification are: i) Level 1 - valuations that are based on quoted prices (unadjusted) in active markets for identical assets or liabilities that the reporting entity has the ability to access at the measurement date; ii) Level 2 - valuations that are based on quoted prices in markets that are not active or for which all significant inputs are observable, either directly or indirectly; and iii) Level 3 - valuations that require inputs that are both significant to the fair value measurement and unobservable.\nCash and cash equivalents, which primarily include money market mutual funds, were $38.6 million and $47.7 million at December 31, 2020 and December 31, 2019, respectively. We classified our cash equivalents of $37.9\nmillion and $46.2 million as of December 31, 2020 and 2019, respectively, within Level 1 of the fair value hierarchy because they are valued using quoted market prices. Our cash equivalents are measured at fair value on a recurring basis and their carrying values approximate their respective fair values.\nAs of December 31, 2020, our assets that are measured at fair value on a recurring basis and whose carrying values approximate their respective fair values include the following (in thousands):\nFair Value Measurement at\nDecember 31, 2020 Using:\nQuoted Prices\nin Active\nMarkets for\nIdentical\nAssets\nSignificant\nOther\nObservable\nInputs\nSignificant\nUnobservable\nInputs\n(Level 1)\n(Level 2)\n(Level 3)\nMoney market funds (included in cash\nand cash equivalents)\n$\n37,948\n$\n-\n$\n-\nTotal\n$\n37,948\n$\n-\n$\n-\nAs of December 31, 2019, our assets that are measured at fair value on a recurring basis and whose carrying values approximate their respective fair values include the following (in thousands):\nFair Value Measurement at\nDecember 31, 2019 Using:\nQuoted Prices\nin Active\nMarkets for\nIdentical\nAssets\nSignificant\nOther\nObservable\nInputs\nSignificant\nUnobservable\nInputs\n(Level 1)\n(Level 2)\n(Level 3)\nMoney market funds (included in cash\nand cash equivalents)\n$\n46,174\n$\n-\n$\n-\nTotal\n$\n46,174\n$\n-\n$\n-\nCash and Cash Equivalents - Cash and cash equivalents, which consist primarily of money market funds and demand deposits, are stated at fair value. All highly liquid investments purchased with an original maturity of three months or less are considered cash equivalents. Our cash balances exceed the Federal Deposit Insurance Corporation limits. The Company does not believe it is exposed to significant credit risk related to cash and cash equivalents.\nAllowance for Doubtful Accounts - Accounts are charged to the allowance for doubtful accounts as they are deemed uncollectible based on a periodic review of the accounts.\nFor the years ended December 31, 2020 and 2019, changes to and ending balances of the allowance for doubtful accounts were as follows (in thousands):\nYears ended\nDecember 31,\nAllowance for doubtful accounts balance -\nbeginning of year\n$\n$\nAdditions to the allowance for doubtful accounts\n-\nDeductions against the allowance for doubtful\naccounts\n-\n-\nAllowance for doubtful accounts balance - end of\nyear\n$\n$\nProperty and Equipment - Property and equipment is stated at cost. Depreciation and amortization of property and equipment is provided using the straight-line method over the estimated useful lives of the assets. Upon retirement or sale, the costs of the assets disposed of and the related accumulated depreciation are removed from the accounts and any resulting gain or loss on disposal is included in the determination of income or loss. Expenditures for repairs and maintenance are charged to expense as incurred.\nThe estimated useful lives of assets used by us are:\nBuilding\n30 years\nBuilding improvements\n5 to 20 years\nFurniture and fixtures\n5 years\nComputer, office & manufacturing equipment\n3 years\nPurchased software\n3 years\nGoodwill - We record goodwill when consideration paid in a business acquisition exceeds the value of the net assets acquired. Our estimates of fair value are based upon assumptions believed to be reasonable at the time, but such estimates are inherently uncertain and unpredictable. Assumptions may be incomplete or inaccurate and unanticipated events or circumstances may occur, which may affect the accuracy of validity of such assumptions, estimates or actual results. Goodwill is not amortized but rather is tested for impairment annually in the fourth quarter or more frequently, if facts and circumstances warrant a review. Circumstances that could trigger an impairment test include, but are not limited to, a significant adverse change in the business climate or legal factors, an adverse action or assessment by a regulator, or unanticipated competition. We have determined that there is a single reporting unit for the purpose of conducting the goodwill impairment assessment. In accordance with ASC Topic 350, Intangibles-Goodwill and Other, we first assess qualitative factors to determine whether it is necessary to perform the quantitative goodwill impairment test. If after assessing the totality of events or circumstances, we determine that it is more likely than not (i.e. greater than 50% likelihood) that the fair value of the reporting unit is less than its carrying amount, then the quantitative test is required. The quantitative goodwill impairment test requires us to estimate and compare the fair value of the reporting unit, determined using an income approach and a market approach, with its carrying value. If the fair value of the reporting unit exceeds the carrying value of the net assets, goodwill is not impaired. If the fair value of the reporting unit is less than the carrying value, the difference is recorded as an impairment loss up to the amount of goodwill.\nApplication of the goodwill impairment test requires judgments, including identification of the reporting units, assigning goodwill to reporting units, a qualitative assessment to determine whether there are any impairment indicators, and determining the fair value of each reporting unit which often involves the use of significant estimates and assumptions, including assumptions with respect to future cash inflows and outflows, discount rates, asset lives and market multiples, among other items. There is no assurance that the actual future earnings or cash flows of the reporting unit will not decline significantly from the projections used in the impairment analysis. Goodwill impairment charges may be recognized in future periods to the extent changes in factors or circumstances occur, including deterioration in the macroeconomic environment and industry, deterioration in the Company’s performance or its future projections, or changes in plans for its reporting unit.\nAs of December 31, 2020, we had $1.7 million of goodwill. Changes in the valuation of goodwill could materially impact our operating results and financial position. To date, there have been no impairments of goodwill.\nValuation of Long-Lived Assets - We review long-lived assets for impairment whenever events or changes in business circumstances indicate that the carrying amount of the assets may not be fully recoverable or that the useful lives of these assets are no longer appropriate. Each impairment test is based on a comparison of the undiscounted cash flows estimated to be generated by those assets over their estimated economic life to the related carrying value of those assets to determine if the assets are impaired. If an impairment is indicated, the asset is written down to its estimated fair value. The cash flow estimates used to identify the potential impairment reflect our best estimates using appropriate assumptions and projections at that time. In evaluating potential impairment of these assets, we specifically consider whether any indicators of impairment are present, including, but not limited to:\n•\nwhether there has been a significant adverse change in the business climate that affects the value of an asset:\n•\nwhether there has been a significant change in the extent or way an asset is used; and\n•\nwhether there is an expectation that the asset will be sold or disposed of before the end of its originally estimated useful life.\nWe did not identify any events or changes in business circumstances that the carrying amount of the assets may not be fully recoverable or that the useful lives of these assets are no longer appropriate during the year ended December 31, 2020.\nRevenue recognition. The core principle of Accounting Standards Codification (“ASC”) Topic 606, Revenue from Contracts with Customers (“ASC 606”) is that we should recognize revenue to depict the transfer of promised goods or services to customers in an amount that reflects the consideration to which we expect to be entitled in exchange for those goods or services. To achieve that core principle, we should apply the following five step model:\n1) Identify the contract with the customer\nA contract with a customer exists when (i) we enter into an enforceable contract with a customer that defines each party’s rights regarding the goods or services to be transferred and identifies the related payment terms, (ii) the contract has commercial substance, and (iii) we determine that collection of substantially all consideration for goods and services that are transferred is probable based on the customer’s intent and ability to pay the promised consideration. We apply judgment in determining the customer’s intent and ability to pay, which is based on a variety of factors including the customer’s historical payment experience, or in the case of a new customer, published credit and financial information pertaining to the customer.\nWe evaluate contract modifications for the impact on revenue recognition if they have been approved by both parties such that the enforceable rights and obligations under the contract have changed. Contract modifications are either accounted for using a cumulative effect adjustment or prospectively over the remaining term of the arrangement. The determination of which method is more appropriate depends on the nature of the modification, which we evaluate on a case-by-case basis.\nWe combine two or more contracts entered into at or near the same time with the same customer and account for them as a single contract if (i) the contracts are negotiated as a package with a common commercial objective, (ii) the amount of consideration to be paid in one contract depends on the price or performance of the other contract, or (iii) some or all of the goods or services in one contract would be combined with some or all of the goods and services in the other contract into a single performance obligation. If two or more contracts are combined, the consideration to be paid is aggregated and allocated to the individual performance obligations without regard to the consideration specified in the individual contracts.\n2) Identify the performance obligations in the contract\nPerformance obligations promised in a contract are identified based on the goods and services that will be transferred to the customer that are both capable of being distinct, whereby the customer can benefit from the\ngood or service either on its own or together with other available resources, and are distinct in the context of the contract, whereby the transfer of the good or service is separately identifiable from other promises in the contract. To the extent a contract includes multiple promised goods and services, we apply judgment to determine whether promised goods and services are capable of being distinct and distinct in the context of the contract. If these criteria are not met, the promised goods and services are accounted for as a combined performance obligation. To identify performance obligations, we consider all of the goods or services promised in a contract regardless of whether they are explicitly stated or are implied by customary business practices.\n3) Determine the transaction price\nThe transaction price is determined based on the consideration we expect to be entitled in exchange for transferring promised goods and services to the customer. Determining the transaction price requires significant judgment. To the extent the transaction price includes variable consideration, we estimate the amount of variable consideration that should be included in the transaction price utilizing either the expected value method or the most likely amount method depending on the nature of the variable consideration. Variable consideration is included in the transaction price if, in our judgment, it is probable that a significant future reversal of cumulative revenue recognized under the contract will not occur. Any estimates, including the effect of the constraint on variable consideration, are evaluated at each reporting period. Some of our arrangements include usage-based royalties where a software license is the predominant item that the royalty relates to. In these arrangements, revenue from the usage-based royalty is recognized when the subsequent usage occurs.\nThe amount of consideration is not adjusted for a significant financing component if the time between payment and the transfer of the related good or service is expected to be one year or less under the practical expedient in ASC 606-10-32-18. Our revenue arrangements are typically accounted for under such expedient, as payment is typically due within 30 to 60 days. As of December 31, 2020 and 2019, none of our contracts contained a significant financing component.\n4) Allocate the transaction price to performance obligations in the contract\nIf the contract contains a single performance obligation, the entire transaction price is allocated to the single performance obligation. Contracts that contain multiple performance obligations require an allocation of the transaction price to each performance obligation based on a relative standalone selling price (“SSP”) basis unless the transaction price is variable and meets the criteria to be allocated entirely to a performance obligation or to a distinct service that forms part of a single performance obligation. The consideration to be received is allocated among the separate performance obligations based on relative SSPs. The SSP is the price at which we would sell a promised good or service separately to a customer. The best estimate of SSP is the observable price of a good or service when we sell that good or service separately. A contractually stated price or a list price for a good or service may be the SSP of that good or service. We use a range of amounts to estimate SSP when we sell each of the goods and services separately and need to determine whether there is a discount that needs to be allocated based on the relative SSP of the various goods and services. In instances where SSP is not directly observable, such as when we do not sell the product or service separately, we typically determine the SSP using an adjusted market assessment approach using information that may include market conditions and other observable inputs. We typically have more than one SSP for individual goods and services due to the stratification of those goods and services by customers and circumstances. In these instances, we may use information such as the nature of the customer and distribution channel in determining the SSP.\n5) Recognize revenue when or as we satisfy a performance obligation\nWe satisfy performance obligations either over time or at a point in time. Revenue is recognized over time if 1) the customer simultaneously receives and consumes the benefits provided by our performance, 2) our performance creates or enhances an asset that the customer controls as the asset is created or enhanced, or 3) our performance does not create an asset with an alternative use to us and we have an enforceable right to payment for performance completed to date. If we do not satisfy a performance obligation over time, the related performance obligation is satisfied at a point in time by transferring the control of a promised good or service to a customer.\nWe categorize revenue as software licenses, software maintenance, or services. Specific revenue recognition policies apply to each category of revenue.\nSoftware licenses\nSoftware licenses consist of revenue from the sale of software licenses for biometrics and imaging applications. Our software licenses are functional intellectual property and typically provide customers with the right to use our software on a term or perpetual basis as it exists when made available to the customer. We recognize revenue from perpetual software licenses at a point in time upon delivery, provided all other revenue recognition criteria are met.\nWe also offer certain products pursuant to a usage based software model which includes a term software license to use the software for a fixed term. We recognize revenue for fixed fees associated with usage based software licenses at a point in time upon delivery, provided all other revenue recognition criteria are met. Fees subject to the usage-based royalty exception are recognized when the subsequent usage occurs.\nSoftware maintenance\nSoftware maintenance consists of revenue from the sale of software maintenance contracts for biometrics and imaging software. Software maintenance contracts entitle customers to receive software support and software updates, if and when they become available, during the term of the maintenance contract. Software support and software updates are considered distinct services. However, these distinct services are considered a single performance obligation consisting of a series of distinct services that are substantially the same and have the same pattern of transfer to the customer. We recognize software maintenance revenue over time on a straight-line basis over the contract period.\nServices\nService revenue consists of fees from biometrics customers for software engineering services we provide to them. We recognize services revenue over time as the services are delivered using an input method (i.e., labor hours incurred as a percentage of total labor hours budgeted), provided all other revenue recognition criteria are met. The use of the over-time revenue recognition method requires judgment in developing budgeted labor hours. Changes in budgeted hours may occur and the resulting impact on revenue recognition is accounted for in the period of the change in estimate.\nArrangements with multiple performance obligations\nIn addition to selling software licenses, software maintenance and software services on a standalone basis, a significant portion of our contracts include multiple performance obligations. The various combinations of multiple performance obligations and our revenue recognition for each are described as follows:\n•\nPerpetual software licenses and software maintenance. When software licenses and software maintenance contracts are sold together, the software licenses and software maintenance are generally considered distinct performance obligations. The transaction price is allocated to the software licenses and the software maintenance based on relative SSP. Revenue allocated to the software licenses is recognized at a point in time upon delivery, provided all other revenue recognition criteria are met. Revenue allocated to the software maintenance is recognized over time on a straight-line basis over the contract period.\n•\nPerpetual software licenses and services. When software licenses and significant customization engineering services are sold together, they are accounted for as a combined performance obligation, as the software licenses are generally highly dependent on, and interrelated with, the associated services and therefore are not distinct performance obligations. Revenue for the combined performance obligation is recognized over time as the services are delivered using an input method (i.e., labor hours incurred as a percentage of total labor hours budgeted). When software licenses and standard implementation or consulting-type services are sold together, they are generally considered distinct performance obligations, as the software licenses are not dependent on or interrelated with the associated services. The transaction price in these arrangements is allocated to the software licenses and services based on relative SSP. Revenue allocated to the software licenses is recognized at a point in time upon delivery, provided all other revenue recognition criteria are met. Revenue allocated to the services is recognized over time using an input method. In arrangements with both software licenses and services, the software license portion of the arrangement is classified as software license revenue and the services portion is classified as services revenue in our consolidated statements of operations.\n•\nPerpetual software licenses, software maintenance and services. When we sell software licenses, software maintenance and software services together, we account for the individual performance obligations separately if they are distinct. The transaction price is allocated to the separate performance obligations based on relative SSP. Revenue allocated to the software licenses is recognized at a point in time upon delivery. Revenue allocated to the services is recognized over time using an input method (i.e., labor hours incurred as a percentage of total labor hours budgeted). Revenue for the software maintenance is recognized over time on a straight-line basis over the contract period. However, if the software services are significant customization engineering services, they are accounted for with the software licenses as a combined performance obligation, as stated above. Revenue for the combined performance obligation is recognized over time using an input method.\n•\nUsage based software licenses consisting of a term software license and software maintenance. When usage based software subscription licenses are sold, the term software license and software maintenance are generally considered distinct performance obligations. The transaction price is allocated to term software license and the software maintenance based on relative SSP. We sell usage based software license for a fixed fee and/or a usage-based royalty fee, sometimes subject to a minimum guarantee. When the amount is in the form of a fixed fee, including the guaranteed minimum in usage based royalty, revenue is allocated to the term software license recognized at a point in time upon delivery, provided all other revenue recognition criteria are met. Any royalties not subject to the guaranteed minimum or earned in excess of the minimum amount are recognized as revenue when the subsequent usage occurs. Revenue allocated to the software maintenance is recognized over the contract term time on a straight-line basis over the contract period.\nReturns\nWe do not offer rights of return for our products and services in the normal course of business.\nCustomer Acceptance\nOur contracts with customers generally do not include customer acceptance clauses.\nContract Balances\nWhen the timing of our delivery of goods or services is different from the timing of payments made by customers, we recognize either a contract asset (performance precedes contractual due date) or a contract liability (customer payment precedes performance). Customers that prepay are represented by the deferred revenue below until the performance obligation is satisfied. Our contract assets consist of unbilled receivables. Our contract liabilities consisted of deferred (unearned) revenue, which is generally related to software maintenance contracts. We classify deferred revenue as current or noncurrent based on the timing of when we expect to recognize revenue.\nThe following table presents changes in our contract assets and liabilities during the years ended December 31, 2019 and 2020 (in thousands):\nRemaining Performance Obligations\nRemaining performance obligations represent the transaction price from contracts for which work has not been performed or goods and services have not been delivered. We expect to recognize revenue on approximately 67% of the remaining performance obligations over the next 12 months, with the remainder recognized thereafter. As of December 31, 2020, the aggregate amount of the transaction price allocated to remaining performance obligations with a duration greater than one year, comprised of software maintenance contracts, was $2.4 million.\nBalance at\nBeginning\nof period\nRevenue\nRecognized\nIn Advance\nof Billings\nBillings\nBalance at\nEnd of\nPeriod\nYear ended December 31, 2019\nContract Assets:\nUnbilled receivables\n$\n3,279\n$\n2,638\n$\n(2,602\n)\n$\n3,315\nYear ended December 31, 2020\nContract Assets:\nUnbilled receivables\n$\n3,315\n$\n1,508\n$\n(2,594\n)\n$\n2,229\nBalance at\nBeginning\nof period\nBillings\nRevenue\nRecognized\nBalance at\nEnd of\nPeriod\nYear ended December 31, 2019\nContract Liabilities:\nDeferred revenue\n$\n3,099\n$\n5,006\n$\n(5,268\n)\n$\n2,837\nYear ended December 31, 2020\nContract Liabilities:\nDeferred revenue\n$\n2,837\n$\n6,619\n$\n(5,523\n)\n$\n3,933\nContract Costs\nWe recognize an other asset for the incremental costs of obtaining a contract with a customer if we expect the benefit of those costs to be longer than one year. We have determined that certain sales commissions meet the requirements to be capitalized, and we amortize these costs on a consistent basis with the pattern of transfer of the goods and services in the contract. Total capitalized costs to obtain a contract were immaterial during the periods presented and are included in other current and long-term assets on our consolidated balance sheets.\nWe apply a practical expedient to expense costs as incurred for costs to obtain a contract when the amortization period is one year or less. These costs include sales commissions on software maintenance contracts with a contract period of one year or less as sales commissions paid on contract renewals are commensurate with those paid on the initial contract.\nIncome Taxes - We compute deferred income taxes based on the differences between the financial statement and tax basis of assets and liabilities using enacted rates in effect in the years in which the differences are expected to reverse. We establish a valuation allowance to offset temporary deductible differences, net operating loss carryforwards and tax credits when it is more likely than not that the deferred tax assets will not be realized.\nWe recognize the tax benefit from an uncertain tax position only if it is more-likely-than-not that the tax position will be sustained upon examination by the taxing authorities, based on the technical merits of the tax position. The evaluation of an uncertain tax position is based on factors that include, but are not limited to, changes in the tax law, the measurement of tax positions taken or expected to be taken in tax returns, the effective settlement of matters subject to audit, and changes in facts or circumstances related to a tax position. Any changes to these estimates, based on the actual results obtained and/or a change in assumptions, could impact our tax provision in future periods. Interest and penalty charges, if any, related to unrecognized tax benefits would be classified as a provision for income tax in the consolidated statements of operations.\nCapitalization of Software Costs - We capitalize certain internally developed software development costs after technological feasibility of the product has been established. No software costs were capitalized during the years ended December 31, 2020 and 2019, because such costs incurred subsequent to the establishment of technological feasibility, but prior to commercial availability, were immaterial.\nResearch and Development Costs - Costs incurred in the research and development of our products are expensed as incurred.\nConcentration of Credit Risk - At December 31, 2020 and 2019, we had cash and cash equivalents, in excess of federally insured deposit limits of approximately $38.3 million and $47.5 million, respectively.\nConcentration of credit risk with respect to net accounts receivable and unbilled receivables consisted of amounts owed by the following customers that comprised more than 10% of net accounts receivable and unbilled receivables at December 31:\nCustomer A\n%\n%\nCustomer B\n%\n-\nThe portion of total revenue that was derived from major customers was as follows:\nYear ended\nDecember 31,\nCustomer A\n%\n%\nStock-Based Compensation - We grant stock and stock options to our employees and directors. We measure stock-based compensation cost at the grant date based on the fair value of the award and recognize stock-based compensation expense on a straight-line basis over the requisite service period of the award.\nFor stock awards, we determine the fair value of the award by using the fair market value of our stock on the date of grant; provided the number of shares in the grant is fixed on the grant date.\nFor stock options, we use the Black-Scholes option valuation model to estimate the fair value of the award. This valuation model takes into account the exercise price of the award, as well as a variety of significant assumptions. The assumptions used to estimate the fair value of stock options include the expected term, the expected volatility of our stock over the expected term, the risk-free interest rate over the expected term, and our expected annual dividend yield.\nComputation of Earnings per Share - Basic earnings per share is computed by dividing income available to common shareholders by the weighted average number of common shares outstanding. Diluted earnings per share is computed by dividing income available to common shareholders by the weighted average number of common shares outstanding plus additional common shares that would have been outstanding if dilutive potential common shares had been issued. For the purposes of this calculation, stock options are considered common stock equivalents in periods in which they have a dilutive effect. Stock options that are antidilutive are excluded from the calculation.\nFair Value of Financial Instruments - The carrying amounts of cash and cash equivalents, accounts receivable, accounts payable and accrued expenses approximate fair value because of their short-term nature.\nSegments - We organize ourselves into a single segment reporting to the chief operating decision maker. We have sales outside of the United States. All long-lived assets are maintained in the United States.\nWe conduct our operations in the United States and sell our products and services to domestic and international customers. Revenues were generated from the following geographic regions (in thousands):\nYear ended\nDecember 31,\nUnited States\n$\n6,724\n$\n6,091\nUnited Kingdom\n1,606\n2,334\nRest of world\n2,979\n3,779\n$\n11,309\n$\n12,204\nRevenue by product group was (in thousands):\nYear ended\nDecember 31,\nBiometrics\n$\n10,064\n$\n11,170\nImaging\n1,245\n1,034\n$\n11,309\n$\n12,204\nRevenue by timing of transfer of goods or services for the years ended December 31, 2020 and 2019 was:\nYear ended\nDecember 31,\nGoods or services transferred at a point in time\n$\n5,120\n$\n3,812\nGoods or services transferred over time\n6,189\n8,392\n$\n11,309\n$\n12,204\nPROPERTY AND EQUIPMENT\nProperty and equipment consisted of the following at December 31 (in thousands):\nLand\n$\n1,056\n$\n1,056\nBuilding and improvements\n9,166\n9,071\nComputer equipment\n1,183\nPurchased software\nFurniture and fixtures\nOffice equipment\nTotal\n12,437\n11,952\nLess accumulated depreciation\n(8,736\n)\n(8,197\n)\nProperty and equipment, net\n$\n3,701\n$\n3,755\nDepreciation expense was $0.5 million and 0.4 million for the years ended December 31, 2020 and 2019 respectively.\n4.\nACQUISTIONS\nIn November 2020, the Company entered into a Bill of Sale and Assignment Agreement (the “Agreement”) with Radiant Mission Solutions Inc. (“Radiant” as seller) and Maxar Technologies, Inc. (as guarantor) to acquire certain assets and assume certain liabilities of Radiant’s AFIX product line for cash consideration of approximately $2.4 million. The acquisition of AFIX, provides turnkey face and fingerprint biometric and forensic analysis software for small and medium-sized law enforcement and government agencies, extends our ABIS product family.\nThe acquisition was accounted for as a business combination, whereby all the assets acquired, and liabilities assumed were recognized at fair value on the acquisition date, with any excess of the consideration transfer over the fair value of the net assets acquired recognized as goodwill. Unaudited pro forma results of operations assuming the above acquisition had taken pace at the beginning of each period are not provided because the historical operating results and pro forma results would not be materially different from reported results for the periods presented.\nThe preliminary fair values recorded were based on a preliminary valuation and the estimates and assumptions used in such valuation are subject to change, within the measurement period (up to one year from the acquisition date). The Company is continuing to obtain information to determine the acquired assets and liabilities, including tax, assets, liabilities and other assets. The following table summarizes the preliminary fair values of the assets acquired and liabilities assumed at the date of acquisition (in thousands):\nNet working capital, excluding deferred revenue\n$\nCustomer relationships\nDeveloped technology\nTrade name / trademarks\nGoodwill\n1,651\nGross assets acquired\n3,046\nDeferred revenue\n(616\n)\nNet assets acquired\n$\n2,430\nAfter allocating the purchase price to the assets acquired and liabilities assumed based on their fair values at the date of acquisition, the Company recorded goodwill of approximately $1.7 million. Goodwill largely consists of expected synergies to be realized from combining operations. The goodwill is deductible for income tax purposes.\nThe fair values of intangible assets were based on valuations using the income approach. The preliminary fair value of intangible assets and their estimated useful live are as follows (dollars in thousands):\nUseful Life\nGross\nAmount\nAccumulated\nAmortization\nNet Book\nValue\nCustomer relationships\n8 years\n$\n$\n$\nDeveloped technology\n5 years\nTradenames\n7 years\n$\n1,240\n$\n$\n1,217\nDuring the year ended December 31, 2020 we recorded $23 thousand of amortization for its intangibles. The Company expects to record amortization for the years ended December 31 (in thousands):\n$\nThereafter\n$\n1,217\n5.\nINCOME TAXES\nWe recorded a benefit for income taxes of $1.6 million in the year ended December 31, 2020 that includes a $1.4 million tax benefit of the current year tax loss which can be carried back due to changes made by the Coronavirus Aid, Relief and Economic Security Act (CARES Act) which was signed into law on March 27, 2020. The CARES Act contained specific relief and stimulus measures including allowing net operating losses originating in 2018 through 2020 to be carried back five years to offset taxable income in the carryback period. We recorded a provision for income taxes of $5.2 million in the year ended December 31, 2019. The components of the provision for income taxes are as follows (in thousands):\nYear ended\nDecember 31,\nCurrent:\nFederal\n(1,397\n)\nState\n(237\n)\n(1,634\n)\nDeferred:\nFederal\n-\n4,965\nState\n-\n-\n5,171\nProvision for (benefit from) income taxes\n$\n(1,634\n)\n$\n5,211\nA reconciliation of the U.S. federal statutory rate to the effective tax rate is as follows:\nYear ended\nDecember 31,\nFederal statutory rate\n%\n%\nState rate, net of federal benefit\nTax credits\nPermanent adjustments\n-\n(1\n)\nChange in valuation allowance\n(25\n)\n(202\n)\nExpiration of statutes on uncertain tax positions\n-\nNet operating loss carryback rate benefit under\nCARES Act\n-\nOther\n-\n(1\n)\nEffective tax rate\n%\n(167\n)%\nThe 2020 difference between the effective tax rate and the U.S federal statutory rates was driven primarily due to the change in valuation allowance of our deferred tax assets. This was partially offset by an income tax rate benefit related to a carryback of the 2020 net operating losses under the CARES Act.\nThe 2019 difference between the effective tax rate and the U.S federal statutory rates was driven primarily due to the change in valuation allowance of our deferred tax assets.\nWe had deferred tax assets of $8.7 million and $6.3 million as of December 31, 2020 and 2019 respectively. The principal components of deferred tax assets were as follows at December 31 (in thousands):\nDepreciation\n$\n$\nStock compensation\nResearch and development credits\n6,686\n4,975\nNet operating loss\n1,352\nOther\nTotal\n8,674\n6,325\nLess valuation allowance\n(8,674\n)\n(6,325\n)\nDeferred tax assets, net\n$\n-\n$\n-\nAs of December 31, 2020, $6.7 million of our deferred tax assets relates to research credit carryforwards. We have assessed the need for a valuation allowance on our deferred tax assets. We evaluated and considered all available evidence, both positive and negative, to determine whether, based on the weight of that evidence, a valuation allowance for deferred tax assets was needed. As part of this analysis, we have given more weight to recent, historical evidence than future projections as we consider the past more objective. As of the fourth quarter of 2020, we have a cumulative pretax loss over the most recent three-year period including a pretax loss of $9.2 million in 2020. We considered the cumulative loss as of the end of the fourth quarter of 2020 to be significant negative evidence in the overall analysis.\nIn 2019, we appointed a new Chief Executive Officer and, as a result, we reviewed and made changes to our strategy and business plans. We will be making additional investments in research, product development and sales and marketing including additional headcount. These changes in strategy and additional investment started in 2019 and continued in 2020. Our pretax income forecasts are highly predicated upon new product development and penetrating new markets. Therefore, this evidence is given nominal weight in the analysis compared to the recent history of losses and anticipated investment.\nFurther, a significant portion of our deferred tax assets relates to federal and state research and development credits. These credits may only offset 75% of the tax liability after net operating loss carryforwards are utilized and thus, we have the risk that the credits could expire before utilization if sufficient taxable income in the carryforward periods doesn’t exist.\nBased upon the information available to us at the time, the above analysis of evidence represents our best estimate regarding the utilization of the deferred tax assets, and we concluded as of December 31,2019 that it is more likely than not that the deferred tax assets will not be realized. Therefore, we have recorded a full valuation allowance of $6.3 million against our deferred tax assets as of December 2019. We have also concluded that as of December 31, 2020 it is more likely than not that the deferred tax assets will not be realized. Therefore, we have recorded a full valuation allowance for a total of $8.7 million as of December 31, 2020. We will continue to monitor the evidence and the realizability of our deferred tax assets in future periods. Should evidence regarding the realizability of our deferred tax assets change at a future point in time, we will adjust the valuation allowance as required.\nA roll forward of the uncertain tax position that was primarily related to our research and development tax credits is as follows (in thousands):\nUncertain tax positions at December 31, 2018\n$\nIncrease due to positions taken in prior periods\nUncertain tax positions at December 31, 2019\n1,008\nDecrease due to positions taken in prior periods\n(206\n)\nUncertain tax positions at December 31, 2020\n$\nUncertain tax positions of $0.8 million will impact our tax rate if realized.\nThe tax years from 2017 through 2020 are subject to examination by the IRS and the tax years 2004 through 2020 are subject to examination by state tax authorities.\n6.\nEQUITY AND STOCK COMPENSATION PLANS\nStock Option Plan - We have one active fixed stock option plan which is our 2001 Nonqualified Stock Plan (“2001 Plan”). We are authorized to grant nonqualified stock options, stock appreciation rights and stock awards to our employees and directors for up to 8,000,000 shares of common stock under this plan. As of December 31, 2020, there were 3,760,815 shares available for grant under the 2001 Plan.\nOptions are granted at exercise prices as determined by the Board of Directors and have terms ranging from four to a maximum of ten years. Options generally vest over three to five years.\nThe following table presents stock-based employee compensation expenses included in our consolidated statements of income and comprehensive income (in thousands):\nYears ended\nDecember 31,\nCost of services\n$\n$\nResearch and development\nSelling and marketing\nGeneral and administrative\nStock-based compensation expense\n$\n$\nStock-based compensation expense in the preceding table includes expenses associated with grants of: i) stock options, ii) unrestricted shares of our common stock; and iii) performance share awards. The methods used to determine stock-based compensation expense for each type of equity grant are described in the following paragraphs.\nStock Option Grants. For the years ended December 31, 2020 and 2019, we granted stock options for 50,000 and 435,000 shares of our common stock, respectively. We estimate the fair value of those stock options using the Black-Scholes valuation model.\nThe Black-Scholes valuation model takes into account the exercise price of the award, as well as a variety of significant assumptions. The assumptions used to estimate the fair value of stock options include the expected term, the expected volatility of our stock over the expected term, the risk-free interest rate over the expected term, and our expected annual dividend yield. We do not estimate our forfeiture rates as the actual forfeiture rate is known at the end of each reporting period due to the timing of our stock option vesting. We believe that the valuation technique and the approach utilized to develop the underlying assumptions are appropriate in calculating the fair values of stock options granted in the year ended December 31, 2020. Estimates of fair value are not intended to predict actual future events or the value ultimately realized by persons who receive equity awards.\nSpecific assumptions used to determine the fair value of options granted during the year ended December 31, 2020, using the Black-Scholes valuation model were:\nYears ended\nDecember 31,\nExpected term (1)\n6.14 years\n6.08-6.18 years\nExpected volatility factor (2)\n%\n35-46%\nRisk-free interest rate (3)\n0.6\n%\n1.51-1.66%\nExpected annual dividend yield\nn/a\nn/a\n(1) The expected term for each grant was determined based on the simplified method.\n(2) The expected volatility for each grant is estimated based on an average of historical volatility over the expected term of the stock options.\n(3) The risk-free interest rate for each grant is based on the U.S. Treasury yield curve in effect at the time of grant for a period equal to the expected term of the stock option.\nUnrestricted Stock Grants. Our 2001 Plan permits us to grant shares of unrestricted stock to our directors, officers, and employees. Stock-based compensation expense for stock grants is determined based on the fair market value of our stock on the date of grant; provided the number of shares in the grant is fixed on the grant date. We granted 256,250, and 285,500 shares of unrestricted stock during the years ended December 31, 2020, and 2019, respectively.\nThe accounting treatment of unrestricted stock awards in 2020 and 2019 is described below:\nIn 2020, we granted 256,250 shares of unrestricted stock to directors, officers, and employees. In March and May 2020, we granted 243,000 shares of unrestricted stock to directors, officers, and employees. The shares were issued in two equal installments shortly after June 30, 2020 and December 31, 2020. In October and November, we granted 13,250 shares of unrestricted stock to employees. The shares were issued shortly after December 31, 2020.\nWe expensed $0.7 million of stock-based compensation expense related to these grants in the year ended December 31, 2020. There was no unamortized stock-based compensation charge associated with these stock grants as of December 31, 2020.\nWe issued 109,773 shares of common stock related to the March and May 2020 grants in early July 2020 after employees surrendered 11,727 shares for which we paid $75,000 of withholding taxes on their behalf.\nIn 2019 we granted 285,500 shares of unrestricted stock to directors, officers, and employees. We also, granted 120,000 shares to be issued in four equal installments on the anniversaries of their grant dates in September and October of 2020, 2021, 2022, and 2023, provided the grantee is serving as a director, officer, or employee on those dates. We also granted 165,500 shares throughout March, September, and October of 2019. We issued 71,500 and 94,000 shares shortly after September 30, 2019 and December 31, 2019, respectively. The total stock-based compensation expense related to the 285,500 shares granted in 2019 is $947,000, of which $633,000 was charged to expense in the 2019 and $122,000 was charged to expense in 2020. We anticipate the remaining $230,000 will be charged to expense ratably through 2023.\nWe issued shares of common stock related to the March 2019 grant as follows: i) 58,548 net shares of common stock were issued in early July 2019 after employees surrendered 12,952 shares for which we paid $43,000 of withholding taxes on their behalf; and ii) 56,605 net shares of common stock were issued in early January 2020 after employees surrendered 14,895 shares for which we paid $50,000 of withholding taxes on their behalf. We also issued 20,000 and 10,000 shares of common stock related to a September 2019 and October 2019 grant in September 2020 and October 2020 respectively.\nPerformance Share Award. In September 2019, we granted 20,000 shares of stock to an officer as a performance share award under our 2001 Nonqualified Stock Plan. The shares were issued in September 2019 and became fully vested on March 19, 2020 as the officer was still serving as a director, officer or employee, 2020. Stock-\nbased compensation expense for this stock grant was determined based on the fair market value of our stock on the date of grant, as the number of shares in the grant was fixed on the grant date. The total stock-based compensation expense related to this grant was $55,000, of which $31,000 was charged to expense in 2019 and $24,000 was charged to expense in 2020.\nIn October 2019, we granted 10,000 shares of stock to an officer as a performance share award under our 2001 Nonqualified Stock Plan. The shares were issued in October 2019 and became full vested on April 1, 2020 as the officer was still serving as a director, officer or employee. Stock-based compensation expense for this stock grant was determined based on the fair market value of our stock on the date of grant, as the number of shares in the grant was fixed on the grant date. The total stock-based compensation expense related to this grant was $29,000, of which $15,000 was charged to expense in 2019 and $14,000 was charged to expense 2020.\nA summary of stock option transactions for our fixed stock option plan for the years ended December 31, 2020, and 2019 are presented below:\nShares\nWeighted\nAverage\nExercise\nPrice\nShares\nWeighted\nAverage\nExercise\nPrice\nOutstanding at beginning of year\n435,000\n$\n6.00\n18,000\n$\n2.52\nGranted\n50,000\n$\n6.00\n435,000\n$\n6.00\nExercised\n-\n-\n18,000\n$\n2.52\nForfeited or cancelled\n60,000\n$\n6.00\n-\n-\nOutstanding at end of year\n425,000\n$\n6.00\n435,000\n$\n6.00\nExercisable at year end\n112,496\n$\n6.00\n16,248\n$\n6.00\nTotal options outstanding at December 31, 2020 were 425,000. 112,496 of those options were vested and had a weighted average exercise price of $6.00.\nOptions to purchase up to 50,000 and 435,000 shares of our common stock were granted in the years ended December 31, 2020 and 2019 respectively.\nAt December 31, 2020, the weighted average remaining contractual term for total options outstanding and total options exercisable was approximately 8.83 and 8.78 years, respectively.\nAt December 31, 2020, the aggregate intrinsic value of options outstanding and options exercisable was zero. The intrinsic value of a stock option is the amount by which the market value of the underlying stock exceeds the exercise price of the option.\nThe following table summarizes the stock options outstanding at December 31, 2020:\nOptions Outstanding\nOptions Exercisable\nExercise Price Range\nNumber\nWeighted\nAverage\nExercise\nPrice\nWeighted\nAverage\nRemaining\nContractual\nTerm\n(in years)\nNumber\nWeighted\nAverage\nExercise\nPrice\n$4 to $5\n106,250\n$\n4.50\n8.8304\n28,124\n$\n4.50\n$5 to $6\n106,250\n$\n5.50\n8.8304\n28,124\n$\n5.50\n$6 to $7\n106,250\n$\n6.50\n8.8304\n28,124\n$\n6.50\n$7 to $8\n106,250\n$\n7.50\n8.8304\n28,124\n$\n7.50\n425,000\n$\n6.00\n8.8304\n112,496\n$\n6.00\nAt December 31, 2020, unrecognized compensation expense related to non-vested stock options was approximately $176,000, which is expected to be recognized over a weighted average period of 2.93 years.\nWe issue common stock from previously authorized but unissued shares to satisfy option exercises and purchases under our Employee Stock Purchase Plan.\nEmployee Stock Purchase Plan - In June 1996, we adopted an Employee Stock Purchase Plan (the “ESPP Plan”) under which eligible employees could purchase common stock at a price equal to 85% of the lower of the fair market value of the common stock at the beginning or end of each six-month offering period. On November 29, 2005 we amended the ESPP Plan to provide that eligible employees may purchase common stock at a price equal to 95% of the fair market value of the common stock as of the end of each six-month offering period. There is no stock-based compensation expense related to our Employee Stock Purchase Plan because it is not considered a compensatory plan. The plan does not have a look-back feature and has a minimal discount of 5% of the fair market value of the common stock as of the end of each six-month offering period. Participation in the ESPP Plan is limited to 6% of an employee’s compensation, may be terminated at any time by the employee and automatically ends on termination of employment. A total of 350,000 shares of common stock have been reserved for issuance. As of December 31, 2020 there were 23,635 shares available for future issuance under the ESPP Plan. We issued 15,388, and 13,699 common shares under the ESPP Plan in 2020, and 2019, respectively.\nShare Purchases - On April 30, 2020, our Board of Directors approved a program authorizing to purchase up to $10 million of our common stock, of which $1.0 million had been utilized as of December 31, 2020. During the year ended December 31, 2020, we repurchased 298,214 shares of our common stock. The shares may be purchased from time to time in the open market or through privately negotiated transactions at management’s discretion, depending upon market conditions and other factors. The authorization to repurchase Company stock expires on December 31, 2021. Repurchases will be made under the program using our own cash resources and will been accordance with Rule 10b-18 under the Securities Exchange Act of 1934 and other applicable laws, rules and regulations. The program does not obligate us to acquire any particular amount of common stock and the program may be modified or suspended at any time at our Board of Director’s discretion.\nDividends - We did not pay dividends in the years ended December 31, 2020 and 2019.\n7.\nCOMMITMENTS AND CONTINGENT LIABILITIES\nLease Commitments - We own our principal office and research facility in Bedford, Massachusetts, which we have occupied since November 1997. We have no real estate lease commitments and no equipment lease commitments.\nLitigation - There are no material pending legal proceedings to which we are a party or to which any of our properties are subject which, either individually or in the aggregate, are expected to have a material adverse effect on our business, financial position or results of operations.\nGuarantees and Indemnification Obligations - We enter into agreements in the ordinary course of business that require us: i) to perform under the terms of the contracts, ii) to protect the confidentiality of our customers’ intellectual property, and iii) to indemnify customers, including indemnification against third party claims alleging infringement of intellectual property rights. We also have agreements with each of our directors and executive officers to indemnify such directors or executive officers, to the extent legally permissible, against all liabilities reasonably incurred in connection with any action in which such individual may be involved by reason of such individual being or having been a director or officer of the Company.\nGiven the nature of the above obligations and agreements, we are unable to make a reasonable estimate of the maximum potential amount that we could be required to pay. Historically, we have not made any significant payments on the above guarantees and indemnifications and no amount has been accrued in the accompanying consolidated financial statements with respect to these guarantees and indemnifications.\n8.\nEMPLOYEE BENEFIT PLAN\nIn 1994, we established a qualified 401(k) Retirement Plan (the “Plan”) under which employees are allowed to contribute certain percentages of their pay, up to the maximum allowed under Section 401(k) of the Internal Revenue Code. Our contributions to the Plan are at the discretion of the Board of Directors. Our contributions were approximately $0.3 million and $0.2 million in 2020 and 2019, respectively.\n9.\nNET INCOME (LOSS) PER SHARE\nThe number of common shares used in the computation of diluted net loss per share for the periods presented does not include the effect of the following potentially outstanding common shares because the effect would have been anti-dilutive (in thousands):\nYear ended\nDecember 31,\nStock options\nNet income (loss) per share is calculated as follows (in thousands, except per share data):\nYear ended\nDecember 31,\nNet income (loss)\n(7,614\n)\n$\n(8,340\n)\nShares outstanding:\nWeighted-average common shares outstanding\n21,473\n21,523\nAdditional dilutive common stock equivalents\n-\n-\nDiluted shares outstanding\n21,473\n21,523\nNet income (loss) per share - basic\n$\n(0.35\n)\n$\n(0.39\n)\nNet income (loss) per share - diluted\n$\n(0.35\n)\n$\n(0.39\n)",
    "item_9": "ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.",
    "item_9A": "ITEM 9A. CONTROLS AND PROCEDURES\nConclusion Regarding the Effectiveness of Disclosure Controls and Procedures\nUnder the supervision and with the participation of our management, including our chief executive officer and chief financial officer, we conducted an evaluation of our disclosure controls and procedures, as such term is defined under Rule 13a-15(e) promulgated under the Securities Exchange Act of 1934, as amended (the Exchange Act). Based on this evaluation, our chief executive officer and chief financial officer concluded that our disclosure controls and procedures were effective as of the end of the period covered by this annual report.\nEvaluation of Changes in Internal Control Over Financial Reporting\nUnder the supervision and with the participation of our management, including our chief executive officer and chief financial officer, we concluded that there were no changes in our internal control over financial reporting that occurred during the quarterly period ended December 31, 2020 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nManagement’s Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13(a)-15(f) under the Exchange Act. Under the supervision and with the participation of our management, including our principal executive officer and principal financial officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission in 2013. Based on our evaluation under the framework in Internal Control - Integrated Framework, our management concluded that our internal control over financial reporting was effective as of December 31, 2020.",
    "item_9B": "ITEM 9B. OTHER INFORMATION\nNone.\nPART III",
    "item_10": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by Item 10 of Form 10-K is incorporated by reference from the information contained in the sections captioned “Directors and Executive Officers”, “Corporate Governance” and “Section 16(a) Beneficial Ownership Reporting Compliance” in the Proxy Statement that will be delivered to our shareholders in connection with our May 19, 2021 Annual Meeting of Shareholders.",
    "item_11": "ITEM 11. EXECUTIVE COMPENSATION\nThe information required by Item 11 of Form 10-K is incorporated by reference from the information contained in the section captioned “Executive Compensation” in the Proxy Statement that will be delivered to our shareholders in connection with our May 19, 2021 Annual Meeting of Shareholders.",
    "item_12": "ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by Item 12 of Form 10-K is incorporated by reference from the information contained in the section captioned “Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters” in the Proxy Statement that will be delivered to our shareholders in connection with our May 19, 2021 Annual Meeting of Shareholders.",
    "item_13": "ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information, if any, required by Item 13 of Form 10-K is incorporated by reference from the information contained in the sections captioned “Corporate Governance” and “Certain Relationships and Related Transactions” in the Proxy Statement that will be delivered to our shareholders in connection with our May 20, 2020 Annual Meeting of Shareholders.",
    "item_14": "ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by Item 14 of Form 10-K is incorporated by reference from the information contained in the section captioned “Independent Accountants” in the Proxy Statement that will be delivered to our shareholders in connection with our May 19, 2021 Annual Meeting of Shareholders.\nPART IV",
    "item_15": "ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULE\nThe following documents are filed as part of this report:\n(a)\nFinancial Statements and Exhibits:\nPage\n(1) Consolidated Balance Sheets as of December 31, 2020 and 2019\nConsolidated Statements of Operations for each of the two years in the period ended December 31, 2020\nConsolidated Statements of Cash Flows for each of the two years in the period ended December 31, 2020\nConsolidated Statements of Stockholders’ Equity for each of the two years in the period ended December 31, 2020\nNotes to Consolidated Financial Statements\n(2) Exhibits:\nThe exhibits listed below are filed with or incorporated by reference in this report.\nExhibit No.\nDescription of Exhibit\n3.1\nAmended and Restated Articles of Organization, as amended (filed as Exhibit 3.1 to the Company’s Form 10-K for the year ended December 31, 2008 and incorporated herein by reference).\n3.2\nAmended and Restated By-Laws (filed as Exhibit 3.1 to the Company’s Form 8-K filed with the Securities and Exchange Commission on December 10, 2007 and incorporated herein by reference).\n4.1†\nDescription of the Registrant’s Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934, as amended (filed as Exhibit 4.1 to the Company’s Form 10-K for the year ended December 31, 2019 and incorporated herein by reference)\n10.1*\n1996 Employee Stock Purchase Plan, as amended and restated (filed as Exhibit 99.1 to the Company’s Current Report on Form 8-K filed with the Securities and Exchange Commission on November 29, 2005 and incorporated herein by reference).\n10.2*\nForm of Indemnification Agreement for Directors and Officers of Aware, Inc. (filed as Exhibit 10.1 to the Company's Form 8-K filed with the Securities and Exchange Commission on February 22, 2011 and incorporated herein by reference).\n10.3*\n2001 Nonqualified Stock Plan (filed as Exhibit 99(d)(4) to the Company’s Schedule TO filed with the Securities and Exchange Commission on March 3, 2003 and incorporated herein by reference).\n10.4*\nForm of Nonqualified Stock Option Agreement under the 2001 Nonqualified Stock Plan for options granted to executive officers and directors prior to May 21, 2008 (filed as Exhibit 10.6 to Company’s Form 10-K for the year ended December 31, 2006 and incorporated herein by reference).\n10.5*\nForm of Nonqualified Stock Option Agreement under the 2001 Nonqualified Stock Plan for options granted to executive officers and directors from and after May 21, 2008 (filed as Exhibit 10.8 to Company’s Form 8-K on May 22, 2008 and incorporated herein by reference)\n10.6*\nForm of Unrestricted Stock Award for outside directors of Aware under the 2001 Nonqualified Stock Plan (filed as Exhibit 10.1 to Company's Form 8-K filed with the Securities and Exchange Commission on July 28, 2010 and incorporated herein by reference).\n10.7*\nForm of Unrestricted Stock Award for officers of Aware under the 2001 Nonqualified Stock Plan (filed as Exhibit 10.2 to Company's Form 8-K filed with the Securities and Exchange Commission on July 28, 2010 and incorporated herein by reference).\n10.8*\nForm of Unrestricted Stock Award for executive officers and directors of Aware, Inc. under the 2001 Nonqualified Plan (filed as Exhibit 10.1 to the Company’s Form 8-K filed with the Securities and Exchange Commission on April 4, 2013 and incorporated herein by reference).\n10.9*\nForm of Change in Control Retention Agreement between Aware, Inc. and Kevin T. Russell (filed as Exhibit 10.1 to the Company’s Form 8-K filed with the Securities and Exchange Commission on March 30, 2015 and incorporated herein by reference).\n10.10*\nForm of Change in Control Retention Agreement between Aware, Inc. and David J. Martin (filed as Exhibit 10.1 to the Company’s Form 8-K filed with the Securities and Exchange Commission on March 1, 2017 and incorporated herein by reference).\n10.11*\nEmployment Agreement between Aware, Inc. and Robert A. Eckel (filed as Exhibit 10.1 to the Company’s Form 8-K filed with the Securities and Exchange Commission on September 19, 2019 and incorporated herein by reference).\n10.12*\nPerformance Share Award Agreement between Aware, Inc. and Robert A. Eckel (filed as Exhibit 10.2 to the Company’s Form 8-K filed with the Securities and Exchange Commission on September 19, 2019 and incorporated herein by reference).\n10.13*\nEmployment Agreement between Aware, Inc. and Kevin T. Russell (filed as Exhibit 10.3 to the Company’s Form 8-K filed with the Securities and Exchange Commission on September 19, 2019 and incorporated herein by reference).\n10.14*\nEmployment Agreement between Aware, Inc. and Robert M. Mungovan (filed as Exhibit 10.1 to the Company’s Form 8-K filed with the Securities and Exchange Commission on October 1, 2019 and incorporated herein by reference).\n10.15*\nPerformance Share Award Agreement between Aware, Inc. and Robert M. Mungovan (filed as Exhibit 10.2 to the Company’s Form 8-K filed with the Securities and Exchange Commission on October 1, 2019 and incorporated herein by reference).\n10.16*\nEmployment Agreement between Aware, Inc. and Mohamed Lazzouni (filed as Exhibit 10.1 to the Company’s Form 8-K filed with the Securities and Exchange Commission on November 19, 2019 and incorporated herein by reference).\n10.17*\nAware, Inc. Q4 2019 Executive Bonus Plan (filed as Exhibit 10.2 to the Company’s Form 8-K filed with the Securities and Exchange Commission on November 19, 2019 and incorporated herein by reference).\n10.18*\nEmployment Agreement between Aware, Inc. and David B. Barcelo dated May 4, 2020 (filed as Exhibit 10.1 to Aware, Inc. Current Report on Form 8-K filed with the Securities and Exchange Commission on May 4, 2020 and incorporated herein by reference).\n10.19*\nAware, Inc. 2020 Executive Bonus Plan (filed as Exhibit 10.2 to Aware, Inc. Current Report on Form 8-K filed with the Securities and Exchange Commission on May 4, 2020 and incorporated herein by reference).\n10.20*\nSeparation Agreement between Aware, Inc. and David J. Martin dated March 27, 2020 (filed as Exhibit 10.1 to Aware Inc. Current Report on Form 8-K filed with the Securities and Exchange Commission on March 30, 2020 and incorporate herein by reference).\n10.21*\nAmendment to Employment Agreement between Aware, Inc. and Kevin T. Russell dated March 27, 2020 (filed as Exhibit 10.2 to Aware Inc. Current Report on Form 8-K filed with the Securities and Exchange Commission on March 30, 2020 and incorporate herein by reference).\n10.22*\nAmendment to Employment Agreement between Aware, Inc. and Robert Eckel dated March 27, 2020 (filed as Exhibit 10.2 to Aware Inc. Current Report on Form 8-K filed with the Securities and Exchange Commission on March 30, 2020 and incorporate herein by reference).\n21.1\nSubsidiaries of Registrant.\n23.1\nConsent of Independent Registered Public Accounting Firm.\n31.1\nCertification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2\nCertification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1\nCertification of Chief Executive Officer and Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nThe following financial statements from Aware, Inc.’s Annual Report on Form 10-K for the year ended December 31, 2020, formatted in XBRL (eXtensible Business Reporting Language), as follows: (i) Consolidated Balance Sheets as of December 31, 2020 and December 31, 2019; (ii) Consolidated Statements of Operations for the Years Ended December 31, 2020 and December 31, 2019; (iii) Consolidated Statements of Cash Flows for the Years Ended December 31, 2020 and December 31, 2019; (iv) Consolidated Statements of Stockholders’ Equity for the Years Ended December 31, 2020 and December 31, 2019; and (v) Notes to Consolidated Financial Statements.\n*Management contract or compensatory plan.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nAWARE, INC.\nBy:\n/s/ Robert A. Eckel\nRobert A. Eckel\nChief Executive Officer & President\nBy:\n/s/ David Barcelo\nDavid Barcelo\nChief Financial Officer (Principal Financial and Accounting Officer)\nDate: February 17, 2021\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities indicated on the 17th day of February 2021.\nSignature\nTitle\n/s/ Robert A. Eckel\nChief Executive Officer, President & Director\nRobert A. Eckel\n(Principal Executive Officer)\n/s/ David Barcelo\nChief Financial Officer\nDavid Barcelo\n(Principal Financial and Accounting Officer)\n/s/ Brent P. Johnstone\nChairman of the Board & Director\nBrent P. Johnstone\n/s/ John S. Stafford, III\nDirector\nJohn S. Stafford, III\n/s/ Brian D. Connolly\nDirector\nBrian D. Connolly\n/s/ Peter Faubert\nDirector\nPeter Faubert"
}