{
    "cik": "1017655",
    "company": "PAID INC",
    "filing_type": "10-K",
    "filing_date": "2021-03-31",
    "period_of_report": "2020-12-31",
    "sic": "7389",
    "state_of_inc": "DE",
    "state_location": "MA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1017655/0001654954-21-003649-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1017655/000165495421003649/payd10k_dec312020.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1017655/0001654954-21-003649.txt",
    "filename": "1017655_10K_2020_0001654954-21-003649.htm",
    "item_1": "Item 1. Business\nOverview\nPAID, Inc. (the “Company” or “PAID”) was incorporated in Delaware on August 9, 1995. The Company has multiple web addresses, www.paid.com, which offers updated information on various aspects of our operations and www.shiptime.com which showcases our online label generation software. Information contained in the Company's website shall not be deemed to be a part of this Annual Report. The Company's principal executive offices are located at 225 Cedar Hill Street, Marlborough, Massachusetts 01581 with offices also located at 700 Dorval Drive, Oakville, Ontario, Canada. The Company's telephone number is (617) 861-6050.\nWe file annual reports on Form 10-K, quarterly reports on Form 10-Q, and current reports on Form 8-K with the Securities and Exchange Commission (the “SEC”). These reports, any amendments to these reports, proxy and information statements and certain other documents we file with the SEC are available through the SEC's website at www.sec.gov or free of charge on our website as soon as reasonably practicable after we file the documents with the SEC. The public may also read and copy these reports and any other materials we file with the SEC at the SEC's Public Reference Room at 100 F Street, NE, Washington, D.C. 20549. You may obtain information on the operation of the Public Reference Room by calling the SEC at 1-800-SEC-0330.\nOur Business\nShipTime Inc. ShipTime’s platform provides its members with the ability to quote, process, track and dispatch shipments while getting preferred rates on packages and skidded less than truckload (“LTL”) freight shipments throughout North America and around the world. In addition to these features, ShipTime also provides what it refers to as “Heroic Multilingual Customer Support.” In this capacity, ShipTime acts as an advocate on behalf of its clients in resolving matters concerning orders and shipping. With an increasing focus and service offering for e-commerce merchants; which include online shopping carts, inventory management, payment services, client prospecting and retention software, ShipTime can help merchants worldwide grow and scale their businesses. ShipTime generates monthly recurring revenue through transactions and “software as a service” (SAAS) offerings. It currently serves in excess of 60,000 members in North America and desires to expand its services worldwide.\nAuctionInc Software. AuctionInc is a suite of online shipping and tax management tools assisting businesses with e-commerce storefronts, shipping solutions, tax calculation, inventory management, and auction processing. The application was designed to focus on real-time carrier calculated shipping rates and tax calculations. The product does have tools to assist with other aspects of the fulfillment process, but the main purpose of the product is to provide accurate shipping and tax calculations and packaging algorithms that provide customers with the best possible shipping and tax solutions. This product has been retired and the Company is announcing the new eCommerce shipping calculator and shopping cart solutions. PaidWeb, PaidCart and PaidShipping was launched in 2020 and the clients continue to transition to our new solutions.\nBeerRun Software. BeerRun Software is a brewery management and Alcohol and Tobacco Tax and Trade Bureau tax reporting software. Small craft brewers can utilize the product to manage brewery schedules, inventory, packaging, sales and purchasing. Tax reporting can be processed with a single click and is fully customizable by state or province. The software is designed to integrate with QuickBooks accounting platforms by using our powerful sync engine. We currently offer two versions of the software BeerRun and BeerRun Light which excludes some of the enhanced features of BeerRun without disrupting the core functionality of the software. Additional features include Brewpad and Kegmaster and can be added on to the base product. Craft brewing continues to grow in the United States and we feel that there is potential to grow this portion of our business.\nPaid, Inc. PaidPayments provides commerce solutions to small - and medium-sized businesses by enabling them to sell their goods and services, accept payment, and create repeat sales though an online payment processing solution. The Company has offered PaidPayments as a Payment Facilitator since 2019, which enables our merchants to get the benefit of instant boarding and discounted rates. Our platform provides all aspects required for payment processing, including merchant boarding, underwriting, fraud monitoring, settlement, funding to the sub-merchant, and monthly reporting and statements. The Company controls all of these necessary aspects in the payment process and is then able to supply a one-step boarding process for our partners and value-added resellers. This capability also provides cost advantages, rapid response to market needs, simplified processes for boarding business and a seamless interface for our merchant customers.\nBusiness Strategy\nThe Company’s focus in 2020 was to effectively execute the integration of Paid Inc. and ShipTime while ensuring that our vision (“To provide a comprehensive e-commerce platform for small to medium enterprises”) continued to move with the pace needed for our members to compete in today’s on-line marketplace.\nWhile the ShipTime portion of our business is now our key revenue driver; our strategy in 2020 was to continue to buildout the foundation of our e-commerce platform while driving our core business forward with double digit growth. By continuing to offer small to medium enterprises meaningful solutions and an integrated infrastructure platform we can enhance the value proposition to both our channel partners and our growing customer base allowing us to cost effectively break into new markets.\nIn order to support the Company’s members via our strategic build-out of e-commerce services, a transition has begun to shift our Heroic Support team from an inbound support role to a combined Support and Customer Success mindset. Our new Sales and Account Management Teams will be engaging with our prospects and members to provide guidance and support in utilizing new tools and services. Paid will provide the infrastructure to assist in accelerating growth for our customers in both their existing markets and new markets as well. We continue to focus on clients in both the United States and Canada. Paid products will continue to grow in 2021 with the addition of the PaidShipping, PaidWeb and PaidCart products.\nOur strategy for the shipping calculator clients includes upgrading the AuctionInc clients to our new Paid platform. We are increasing our product offerings to include plug-ins for several online shopping cart platforms.\nBeerRun continues to be a valuable component of the Company, we hope to maintain our client base in the Craft Brewery industry.\nThe business strategy described above is intended to expand our markets, increase revenue per member while enhancing our opportunities in the online ecommerce market. There are always a variety of factors that may impact our plans and inhibit our success. See “Risk Factors” included in",
    "item_1A": "Item 1A. We have no guarantees and can provide no assurances that our plans will be successful.\nCompetition\nTechnology within the logistics industry is highly competitive and we have focused a variety of differentiators including our Heroic Customer Support™ to elevate our services beyond those of our competition. Our product offerings may also be available from other companies in our industry and we continue to emphasize value and quality customer support. The ShipTime trademark has been registered in both Canada and the United States. Our line of AuctionInc shipping calculator software is proprietary. Our intellectual property rights do not guarantee any competitive advantage and may not sufficiently protect us against competitors with similar technology. We believe that our products and other proprietary rights do not infringe on the proprietary rights of third parties. However, there can be no assurance that third parties will not assert infringement claims against us in the future with respect to current or future products or other works of ours.\nWe also utilize free open-source technology in certain areas. Unlike proprietary software, open-source software has publicly available source code and can be copied, modified and distributed with minimal restrictions. We use open source software and technology as well to support the growing social and viral opportunities on the internet. By using 'best-of-breed' products and tools we can maximize our clients’ opportunities while minimizing our costs, which we are able to pass on to our customers.\nAs with any software product BeerRun is not excluded from the competitive market. There are a growing number of competitors in the industry all with a unique perspective. The updates to our existing offering have helped us maintain a presence in the brewery management industry. Our support team stays informed with the competition and we have the ability to modify our product as the industry changes.\nResearch and Development\nOver the past years, the Company has made significant progress developing new integrations with e-commerce shopping cart platforms. The Company now employs several developers who are focused on the growth of the PAID brand and ShipTime products and their technologies. Our technology roadmap has been projected for the 2021 calendar year and we have enhancements scheduled for all aspects of our businesses. Our strategy includes continuous user enhancements on our existing platforms, new websites, updates to our e-commerce shopping cart solution, enhancements to our merchant payment processing platform, shipping calculator enhancements and many additional features and upgrades to our online shopping and shipping tools.\nEmployees\nAs of March 31, 2021, the Company currently has twenty-three full time equivalent employees and one part time employee. We have no collective bargaining agreements and consider the relationship with our employees to be good.\nGovernment Regulation\nWe are not currently subject to direct federal, state or local regulation, and laws or regulations applicable to access or commerce on the Internet, other than regulations applicable to businesses generally. However, due to the increasing popularity and use of the Internet and other online services, it is possible that a number of laws and regulations may be adopted with respect to the Internet or other online services covering issues such as user privacy, freedom of expression, pricing, content and quality of products and services, taxation, advertising, intellectual property rights and information security.\nItem 1A. Risk Factors\nYou should carefully consider the risks and uncertainties described below before deciding to invest in shares of our common stock. If any of the following risks or uncertainties actually occurs, our business, prospects, financial condition and operating results would likely suffer. In that event, the market price of our common stock could decline and you could lose all or part of your investment.\nRisks Relating to the Company\nWe have experienced operating losses.\nOur business and prospects must be considered in light of the risks, expenses and difficulties that are inherent in our business. The risks include:\n●\nour ability to anticipate and adapt to a developing market;\n●\nour ability to market, license and enforce our shipping calculator, payment processing platform and shopping cart;\n●\ndevelopment of equal or superior Internet portals, shipping calculators and related services by competitors; and\n●\nour ability to maintain competitive pricing with our carriers\nTo address these risks, we must, among other things, successfully market our e-commerce shopping cart, our merchant payment platform and shipping label generation services, continue to develop new relationships with carriers, e-commerce service providers, maintain our customer base, attract significant numbers of new customers, respond to competitive developments, and continue to develop and upgrade our technologies. We cannot offer any assurances that we will be successful in addressing these risks.\nThe Company has reported substantial operating losses since 1999. There can be no assurance that we will be profitable in the future.\nOur capital is limited and we may need additional financing to continue operations.\nWe require substantial working capital to fund our business. If we are unable to obtain additional financing in the amounts desired and on acceptable terms, or at all, or issue stock, we could be required to significantly reduce the scope of our expenditures, which impact our business potential and the market price of our common stock. By raising additional funds by issuing equity securities, our shareholders will be further diluted. Based on our cash position as of December 31, 2020, we believe we have sufficient capital to fund our anticipated operating expenses over the next 12 months.\nWe are unable to guarantee that the marketplace will accept our software products.\nThe software markets are characterized by rapid technological change, frequent new product enhancements, uncertain product life cycles, changes in customer demands and evolving industry standards. Our software products could be rendered obsolete if products based on new technologies are introduced or new industry standards emerge, or if we do not obtain adequate intellectual property protection. We are unable to provide any assurances that the marketplace will accept our software products and services, or that we will be able to provide these products and services at a profit.\nOur operating results are unpredictable.\nYou should not rely on the results for any period as an indication of future performance. Our operating results and rate of growth are unpredictable and are expected to fluctuate in the future due to a number of additional factors, many of which are outside our control. These factors beyond our control include:\n●\nour ability to significantly increase our customer base and traffic to our websites, maintain gross margins, and maintain customer satisfaction;\n●\nour ability to market and sell our software products;\n●\nconsumer confidence in encrypted transactions in the internet environment;\n●\nthe announcement or introduction of new types of services or products by our competitors;\n●\ntechnical difficulties with respect to customer use of our technologies;\n●\ngovernmental regulation by federal or local governments; and\n●\ngeneral economic conditions and economic conditions specific to the internet and e-commerce.\nAs a strategic response to changes in the competitive environment, we may from time to time make certain service, marketing or supply decisions or acquisitions that could have a material adverse effect on our results of operations and financial condition. In 2020, our revenues were derived from our shipping coordination, shipping label generation services, shipping calculator services, merchant payment processing and brewery management software solutions.\nThe successful operation of our business depends upon the supply of critical technology elements from other third parties, including our internet service provider and technology licensors.\nOur operations depend on a number of third parties for internet/telecom access, delivery services, and software services. We have limited control over these third parties and no long-term relationships with many of them. We rely on an internet service provider to connect our websites to the internet. From time to time, we have experienced temporary interruptions in our websites connection and also our telecommunications access. The Company has recently secured a secondary subscription for our internet services and have migrated our hosted services to a cloud based offsite location in order to mitigate any potential outages. We license technology and related databases from third parties for certain elements of our properties. Furthermore, we are dependent on hardware suppliers for prompt delivery, installation, and service of servers and other equipment to deliver our products and services. Our internally developed software depends on operating system, database and server software that was developed and produced by and licensed from third parties. We have from time to time discovered errors and defects in the software from these third parties and, in part, rely on these third parties to correct these errors and defects in a timely manner. Any errors, failures, interruptions, or delays experienced in connection with these third-party technologies and information services could negatively impact our relationship with users and adversely affect our brand and our business, and could expose us to liabilities to third parties.\nOur failure to manage growth could place a significant strain on our management, operational and financial resources.\nGrowth places a significant strain on our management, operational and financial resources, and has placed significant demands on our management, which currently include two executive officers, a vice president of operations and a vice president of finance. In order to manage growth, we will be required to expand existing operations, particularly with respect to enhanced product offerings, customer service and development, to improve existing and implement new operational, financial systems, procedures and controls. In 2020, the Company added a significant number of personnel and has included in its growth a number of new positions to assist with the workload.\nWe have experienced some strain on our resources because of:\n●\nthe need to manage relationships with various technology licensors, other websites and services, and other third parties;\n●\npressures for the continued development of our core of software products; and\n●\nthe need for additional sales and marketing personnel.\nDifficulties we may encounter in dealing successfully with the above risks could seriously harm our operations. We cannot offer any assurance that our current personnel, systems, procedures and controls will be adequate to support our future operations or that management will be able to identify, hire, train, retain, motivate and manage required personnel.\nOur Company's success still depends upon the continued services of its current management and other relationships.\nWe are substantially dependent on the continued services of our key personnel, W. Austin Lewis, IV and David Scott. Mr. Lewis has specialized knowledge and skills with respect to our Company and our operations and relationships with our clients. As a result, if Mr. Lewis were to leave our Company, we could face some difficulties in hiring qualified successors. Mr. Scott has unique knowledge regarding the technology of the Company and its integrations to other third-party software. If Mr. Scott were to leave the Company, we could face some setbacks in development or possible outages. We do not maintain any key person life insurance.\nOur Company's success will depend on our ability to attract and retain qualified personnel.\nWe believe that our future success will depend upon our ability to identify, attract, hire, train, motivate and retain other highly skilled managerial, accounting, technical consulting, marketing and customer service personnel. The Company has recently added seven new employees and has had minimal turnover in the last year. We cannot offer assurances that we will be successful in attracting, assimilating or retaining the necessary personnel, and the failure to do so could have an adverse effect on our business.\nOur success depends upon market awareness of our brand.\nDevelopment and awareness of our Company will depend largely on our success in increasing our customer base, specifically in the United States. To attract and retain customers and to promote and maintain our Company in response to competitive pressures, we may find it necessary to increase our marketing and advertising budgets and otherwise to increase substantially our financial commitment to creating and maintaining brand loyalty among consumers. We will need to continue to devote substantial financial and other resources to increase and maintain the awareness of our online brands among website users, advertisers, affiliate relationships, and e-commerce entities that we have advertising relationships with through:\n●\nweb advertising, marketing, and social media;\n●\ntraditional media advertising campaigns;\n●\nCanadian seller resources; and\n●\ntrade show exhibits in the United States and Canada.\nOur results of operations could be seriously harmed if our investment of financial and other resources, in an attempt to achieve or maintain a leading position in internet commerce or to promote and maintain our brand, does not generate a corresponding increase in net revenue, or if the expense of developing and promoting our online brands becomes excessive.\nSystem failures could result in interruptions in our service, which could harm our business.\nA key element of our strategy is to generate a high volume of traffic to, and use of, our products. Accordingly, the satisfactory performance, reliability and availability of the shipping calculations, transaction processing systems and network infrastructure are critical to our operating results, as well as our reputation and our ability to attract and retain customers and maintain adequate customer service levels.\nWe periodically have experienced minor systems interruptions, including internet disruptions. Some of the interruptions are due to upgrading our technology. During these upgrades, the outages have generally lasted less than an hour. Any systems interruptions, including internet disruptions, which result in the unavailability of our services, could harm our business. In addition to placing increased burdens on our engineering staff, these outages create a large number of user questions and complaints that need to be responded to by our personnel. We cannot offer assurances that:\n●\nwe will be able to accurately project the rate or timing of increases if any, in the use of our services; or\n●\nwe will have uninterrupted access to the internet.\nAny disruption in the Internet access to our websites and services or any systems failures could significantly reduce consumer demand for our services, diminish the level of traffic to our products, impair our reputation and reduce our e-commerce and advertising revenues.\nWe currently identify vulnerabilities with our communications hardware and computer hardware.\nOur main servers are cloud-based and are located within two separate third party hosting facilities. The cloud-based servers are spread across North America. ShipTime maintains several non-critical servers which are located in Canada with daily operations conducted in Oakville, Ontario. Neither our Massachusetts facilities nor our Canadian facilities are protected from flood, power loss, telecommunication failure, break-in and similar events however the equipment located at these offices is not considered critical to our service offerings.\nAs with all servers, our cloud-based servers are also vulnerable to computer viruses, physical or electronic break-ins, attempts by third parties to deliberately exceed the capacity of our systems and similar disruptive problems. Computer viruses, break-ins or other problems caused by third parties could lead to interruptions, delays, loss of data or cessation in service to users of our services and products and could seriously harm our business. Our implementation of redundancies minimizes the risk of loss though there are no guarantees.\nThere are certain provisions of Delaware law that could have anti-takeover effects.\nCertain provisions of Delaware law and our Certificate of Incorporation, and Bylaws could make an acquisition of our Company by means of a tender offer, a proxy contest or otherwise, and the removal of our incumbent officers and directors more difficult. Our Certificate of Incorporation and Bylaws do not provide for cumulative voting in the election of directors. Our Bylaws include advance notice requirements for the submission by stockholders of nominations for election to the Board of Directors and for proposing matters that can be acted upon by stockholders at a meeting.\nWe are subject to the anti-takeover provisions of Section 203 of the Delaware General Corporation Law (the “DGCL”), which will prohibit us from engaging in a “business combination” with an “interested stockholder” for three years after the date of the transaction in which the person became an interested stockholder unless the business combination is approved in a prescribed manner. Generally, a \"business combination\" includes a merger, asset or stock sale, or other transaction resulting in a financial benefit to the interested stockholder. Generally, an \"interested stockholder\" is a person who, together with affiliates and associates, owns (or within three years prior to the determination of interested stockholder status, did own) 15% or more of a corporation's voting stock. The existence of this provision would be expected to have an anti-takeover effect with respect to transactions not approved in advance by the Board of Directors, including discouraging attempts that might result in a premium over the market price for the shares of common stock held by stockholders. Section 203 could adversely affect the ability of stockholders to benefit from certain transactions, which are opposed by the Board or by stockholders owning 15% of our common stock, even though such a transaction may offer our stockholders the opportunity to sell their stock at a price above the prevailing market price.\nOur success is dependent in part on our ability to obtain and maintain proprietary protection for our technologies and processes.\nOur most important intellectual property relates to the software for our shipping calculator, label generation and payment processing products. We do not have any patents or patent applications for our designs or innovations, except for our patent with respect to our online auction shipping and tax calculator. We may not be able to obtain copyright, patent or other protection for our proprietary technologies or for the processes developed by our employees. Legal standards relating to intellectual property rights in computer software are still developing and this area of the law is evolving with new technologies. Our intellectual property rights do not guarantee any competitive advantage and may not sufficiently protect us against competitors with similar technology.\nAs part of our confidentiality procedures, we generally enter into agreements with our employees and consultants and limit access to and distribution of our software, documentation and other proprietary information. We cannot offer assurances that the steps we have taken will prevent misappropriation of our technology or that agreements entered into for that purpose will be enforceable. Notwithstanding the precautions we have taken, it might be possible for a third party to copy or otherwise obtain and use our software or other proprietary information without authorization or to develop similar software independently. Policing unauthorized use of our technology is difficult, particularly because the global nature of the internet makes it difficult to control the ultimate destination or security of software or other data transmitted. The laws of other countries may afford our Company little or no effective protection of its intellectual property. Because our success in part relies upon our technologies, if proper protection is not available or can be circumvented, our business may suffer.\nIntellectual property infringement claims would harm our business.\nWe may in the future receive notices from third parties claiming infringement by our software or other aspects of our business. Any future claim, with or without merit, could result in significant litigation costs and diversion of resources, including the attention of management, and require us to enter into licensing agreements, which could have a material adverse effect on our business, results of operations and financial condition. Licensing agreements, if required, may not be available on terms acceptable to the Company or at all. In the future, we may also need to file lawsuits to enforce our intellectual property rights, to protect our trade secrets, or to determine the validity and scope of the proprietary rights of others. This litigation, whether successful or unsuccessful, could result in substantial costs and diversion of resources, which could have a material adverse effect on our business, results of operations and financial condition.\nOur success is dependent on licensed technologies.\nWe rely on a variety of technologies that we license from third parties. We also rely on encryption and authentication technology licensed from a third party through an online user agreement to provide the security and authentication necessary to effect secure transmission of confidential information.\nWe cannot make any assurances that these third-party technology licenses will continue to be available to us on commercially reasonable terms. Although no single software vendor licensor provides us with irreplaceable software, the termination of a license and the need to obtain and install new software on our systems would interrupt our operations. Our inability to maintain or obtain upgrades to any of these technology licenses could result in delays in completing our proprietary software enhancements and new developments until equivalent technology could be identified, licensed or developed and integrated. These delays would materially and adversely affect our business, results of operations and financial condition.\nWe may be exposed to liability for content retrieved from our websites.\nOur exposure to liability from providing content on the internet is currently uncertain. Due to third party use of information and content downloaded from our websites, we may be subject to claims relating to:\n●\nthe content and publication of various materials based on defamation, libel, negligence, personal injury and other legal theories;\n●\ncopyright, trademark or patent infringement and wrongful action due to the actions of third parties; and\n●\nother theories based on the nature and content of online materials made available through our websites.\nOur exposure to any related liability could result in us incurring significant costs and could drain our financial and other resources. We do not maintain insurance specifically covering these claims. Liability or alleged liability could further harm our business by diverting the attention and resources of our management and by damaging our reputation in our industry and with our customers.\nThe Company may be exposed to potential risks relating to our significant deficiencies and material weaknesses in our internal controls over financial reporting.\nAs directed by Section 404 of the Sarbanes-Oxley Act of 2002 (“SOX 404”), the Securities and Exchange Commission adopted rules requiring public companies to include a report of management on the Company's internal control over financial reporting in their annual reports, including Form 10-K. We have identified deficiencies and material weaknesses in our internal controls and have taken steps to remediate them as cost-effectively as possible. Based on these deficiencies and material weaknesses, investors and others may lose confidence in the reliability of our financial statements and our ability to obtain equity or debt financing could suffer.\nRisks Associated With Our Industry\nThe market for online services is intensely competitive with low barriers to entry.\nThe market for internet products and services is very competitive. Barriers to entry are relatively low, and current and new competitors can launch new sites at relatively low costs using commercially available software. We currently or potentially compete with a variety of other companies depending on the type of services offered to customers. These competitors include a number of indirect competitors that specialize in e-commerce shipping solutions or derive a substantial portion of their revenue from e-commerce products and those that specialize in brewery management solutions.\nIt is possible that new competitors or alliances may emerge and rapidly acquire market share. Increased competition is likely to result in reduced operating margins, loss of market share and a diminished brand recognition, any one of which could materially adversely affect our business, results of operations and financial condition. Many of our current and potential competitors have greater financial, marketing, customer support, technical and other resources than the Company. As a result, these competitors may be able to provide services on more favorable terms than we can, and they may be able to respond more quickly to changes in customer preferences or to devote greater resources to the development of their products than the Company.\nWe may be adversely affected by the deterioration in economic conditions, which could affect consumer and corporate spending and our ability to raise capital, and, therefore, significantly adversely impact our operating results.\nThe impact of slowdowns on our business is difficult to predict, but they may result in reductions in new client registrations and our ability to generate revenue. The risks associated with our businesses may become more acute in periods of a slowing economy or a recession, which may be accompanied by a decrease in e-commerce business. Instability in the financial markets as a result of recession or otherwise, as well as insufficient financial sector liquidity, also could affect the cost of capital and energy suppliers and our ability to raise capital.\nOur business depends on discretionary consumer and corporate spending. Many factors related to corporate spending and discretionary consumer spending, including economic conditions affecting disposable consumer income such as employment, fuel prices, interest and tax rates and inflation can significantly impact our operating results. Business conditions, as well as various industry conditions, including corporate marketing and promotional spending, can also significantly impact our operating results. Negative factors such as challenging economic conditions, public concerns over terrorism and security incidents, particularly when combined, can impact corporate and consumer spending and one negative factor can impact our results more than another. There can be no assurance that consumer and corporate spending will not be adversely impacted by economic conditions, thereby possibly impacting our operating results and growth.\nOn March 11, 2020, the World Health Organization declared COVID-19 a global pandemic. The extent of COVID-19’s effect on the Company’s operational and financial performance would depend on future developments, including the duration, spread and intensity of the pandemic, all of which are uncertain and difficult to predict considering the rapidly evolving landscape. The Company continues to analyze the potential impacts to all of its business segments. At this time, it is not possible to determine the magnitude of the overall impact of COVID-19 on the Company’s business. However, it could have a material adverse effect on the Company’s business, financial condition, liquidity, results of operations, and cash flows.\nSecurity breaches and credit card fraud could harm our business.\nWe rely on encryption and authentication technology licensed from a third party through an online user agreement to provide the security and authentication necessary to effect secure transmission of confidential information. We believe that a significant barrier to e-commerce and communications is the secure transmission of confidential information over public networks. We cannot give an assurance that advances in computer capabilities, new discoveries in the field of cryptography or other events or developments will not result in a compromise or breach of the algorithms we use to protect customer transaction data. If this compromise of our security were to occur, it could have a material adverse effect on our business, results of operations and financial condition. A party who is able to circumvent our security measures and those of our third party providers could misappropriate proprietary information or cause interruptions in our operations. To the extent that activities of our Company or third-party contractors involve the storage and transmission of proprietary information. Security breaches could expose us to a risk of loss or litigation and possible liability. We may be required to expend significant capital and other resources to protect against the threat of security breaches or to alleviate problems caused by these breaches. We cannot offer assurances that our security measures will prevent security breaches or that failure to prevent these security breaches will not have a material adverse effect on our business.\nOur industry may be exposed to increased government regulation.\nOur Company is not currently subject to direct regulation by any government agency, other than regulations applicable to businesses generally, and laws or regulations directly applicable to access to, or commerce on, the internet. Today there are relatively few laws specifically directed towards online services, other than to protect user privacy or children. However, due to the increasing popularity and use of the internet, it is possible that a number of laws and regulations may be adopted with respect to the internet, covering issues such as user privacy, freedom of expression, pricing, content and quality of products and services, fraud, taxation, advertising, intellectual property rights and information security. Compliance with additional regulation could hinder our growth or prove to be prohibitively expensive.\nThe applicability to the internet of existing laws in various jurisdictions governing issues such as property ownership, sales tax, libel and personal privacy is uncertain and may take time to resolve. In addition, because our service is available over the internet in multiple states, and we sell to numerous consumers resident in these states, these jurisdictions may claim that we are required to qualify to do business as a foreign corporation in each state. Our failure to qualify as a foreign corporation in a jurisdiction where it is required to do so could subject our Company to taxes and penalties for the failure to qualify. Any new legislation or regulation, or the application of laws or regulations from jurisdictions whose laws do not currently apply to our business, could have a material adverse effect our business, results of operations and financial condition.\nRisks Associated with our Common Stock\nOur stock price has been and may continue to be very volatile.\nThe market price of the shares of our common stock has been, and is likely to be, highly volatile. During the year ended December 31, 2020 our stock price as quoted on the OTC Pink operated by the OTC Markets Group, Inc., on the OTCPINK has ranged from a high of $5.45 per share to a low of $2.02 per share. The variance in our share price makes it difficult to forecast with any certainty the stock price at which you may be able to buy or sell your shares of our common stock. The market price for our stock could be subject to wide fluctuations in response to factors that are out of our control such as:\n●\nactual or anticipated variations in our results of operations;\n●\nannouncements of new products, services or technological innovations by our competitors;\n●\nshort selling our common stock and stock price manipulation;\n●\nmerger, split or issuance;\n●\ndevelopments in internet regulation; and\n●\ngeneral conditions and trends on the internet and e-commerce industries.\nThe trading prices of many technology companies' stock have experienced extreme price and volume fluctuations. These fluctuations often have been unrelated or disproportionate to the operating performance of these companies. These broad market factors may adversely affect the market price of our common stock. These market fluctuations, as well as general economic, political and market conditions such as recessions or interest rate fluctuations, may adversely affect the market price of our common stock. Any negative change in the public's perception of the prospects of Internet or e-commerce companies could depress our stock price regardless of our results.\n“Penny stock” regulations may impose certain restrictions on marketability of securities.\nThe SEC adopted regulations which generally define \"penny stock\" to be an equity security that has a market price of less than $5.00 per share. Our common stock may be subject to rules that impose additional sales practice requirements on broker-dealers who sell these securities to persons other than established customers and accredited investors (generally those with assets in excess of $1,000,000, or annual incomes exceeding $200,000 or $300,000 together with their spouse). For transactions covered by these rules, the broker-dealer must make a special suitability determination for the purchase of these securities and have received the purchaser's prior written consent to the transaction.\nAdditionally, for any transaction, other than exempt transactions, involving a penny stock, the rules require the delivery, prior to the transaction, of a risk disclosure document mandated by the SEC relating to the penny stock market. The broker-dealer also must disclose the commissions payable to both the broker-dealer and the registered representative, current quotations for the securities and, if the broker-dealer is the sole market-maker, the broker-dealer must disclose this fact and the broker-dealer's presumed control over the market. Finally, monthly statements must be sent disclosing recent price information for the penny stock held in the account and information on the limited market in penny stocks. Consequently, the \"penny stock\" rules may restrict the ability of broker-dealers to sell our common stock and may affect the ability to sell our common stock in the secondary market.\nThe market for our Company's securities is limited and may not provide adequate liquidity.\nOur common stock is currently quoted on the OTCPINK, a regulated quotation service that displays real-time quotes, last-sale prices, and volume information in over-the-counter equity securities. As a result, an investor may find it more difficult to dispose of, or obtain accurate quotations as to the price of, our securities than if the securities were traded on the Nasdaq Stock market, or another national exchange. There are a limited number of active market makers of our common stock. In order to trade shares of our common stock you must use one of these market makers unless you trade your shares in a private transaction. In the year ended December 31, 2020 the actual daily trading volume ranged from a low of 0 shares of common stock to a high of over 8,815 shares of common stock. Selling our shares can be more difficult because smaller quantities of shares are bought and sold and news media coverage about us is limited. These factors result in a limited trading market for our common stock and therefore holders of our Company's stock may be unable to sell shares purchased should they desire to do so.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNone.",
    "item_2": "Item 2. Properties\nThe Company’s primary offices are located at 700 Dorval Drive, Oakville, Ontario with a presence at 225 Cedar Hill Street, Marlborough, Massachusetts, pursuant to a lease agreement for the Oakville property which expires in August 2023.",
    "item_3": "Item 3. Legal Proceedings\nFrom time to time we may be a party to various legal proceedings arising in the ordinary course of our business. Our management is not aware of any litigation outstanding, threatened or pending as of the date hereof by or against us or our properties which we believe would be material to our financial condition or results of operations, except with respect to a dispute related to its non-renewal of the employment agreement with Mr. Allan Pratt, the Company's former CEO, in which Mr. Pratt appears to be treating it as a termination which would trigger a two-year severance payment.",
    "item_4": "Item 4. Mine Safety Disclosure\nNot applicable.\nPART II",
    "item_5": "Item 5. Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur common stock, par value $0.001 per share, is presently quoted on the OTC Pink operated by the OTC Markets Group Inc., on the OTCPINK under the symbol \"PAYD\".\nThe following table sets forth the high and low bid information for our common stock as reported by OTCPINK for the eight quarters ended December 31, 2019 (retroactively to reflect the reverse stock split). The quotations from the OTCPINK reflect inter-dealer prices without retail mark-up, mark-down, or commission and may not represent actual transactions.\nHigh\nLow\nQuarter ended March 31, 2019\n$3.50\n$2.69\nQuarter ended June 30, 2019\n$3.26\n$2.55\nQuarter ended September 30, 2019\n$3.55\n$2.69\nQuarter ended December 31, 2019\n$3.50\n$2.52\nHigh\nLow\nQuarter ended March 31, 2020\n$2.95\n$2.49\nQuarter ended June 30, 2020\n$3.25\n$2.10\nQuarter ended September 30, 2020\n$5.45\n$2.33\nQuarter ended December 31, 2020\n$3.36\n$2.02\nAs of March 31, 2021, there were approximately 873 holders of record of our common stock. Because many of the shares are held by brokers and other institutions on behalf of stockholders, the Company is unable to estimate the total number of individual stockholders represented by these holders of record.\nWe have not previously paid cash dividends on our common stock, and intend to utilize current resources to operate the business; thus, it is not anticipated that cash dividends will be paid on our common stock in the foreseeable future.\nExchangeable Shares\nHolders of our subsidiary’s exchangeable shares have the same dividend and distribution rights as holders of Company shares, and if Company shares are subdivided or in the event of a Company stock dividend, the exchangeable shares will be equally subdivided, as exchangeable shares are intended to be economically the same as shares of common or preferred stock of the Company. The Company will have a “liquidation call right” in the event of proposed liquidation, dissolution or winding up of ShipTime Canada Inc. Absent prior events, the Company will redeem the exchangeable shares on the fifth anniversary whereby the Company will redeem the exchangeable shares for shares of the Company’s preferred stock and common stock. By agreement, exchangeable shares also may be purchased by ShipTime Canada Inc. for cancellation. The Company also has a right to call the shares in the event of a change in the applicable laws.\nThe holders of exchangeable shares have an “automatic exchange right” in the event of any bankruptcy or insolvency or in general, related proceedings, of ShipTime Canada Inc. or the Company. The exchangeable shares would at such time be converted automatically into that number of shares of common stock and preferred stock of the Company at the agreed upon conversion ratio. Moreover, Callco will have an overriding call right to purchase some or all of the exchangeable shares. This mechanism will be triggered with the automatic exchange right and is necessary to comply with Canadian tax laws. The exercise of this call right does not alter the outcome of the exchangeable share transaction.\nUnder a Support Agreement, the Company is required to treat holders of Exchangeable Shares substantially similar, or economically equivalent, to holders of Company stock. As such, under the Support Agreement, the Company cannot declare or pay any dividend or other distribution on Company stock unless ShipTime Inc. simultaneously declares or pays the dividend or distribution on the Exchangeable Shares and has sufficient money or other assets to meet these requirements. In turn, ShipTime Inc. would effect a corresponding dividend or distribution of its securities related to the Exchangeable Shares. The Company also undertakes to advise ShipTime Inc. of the declaration of dividend or distribution, among other similar events, and to cooperate with it to effect the dividend or distribution as of the same record and effective date. The Company is also required in this case to segregate funds to pay for the dividend, and to reserve sufficient number of shares to permit the exchange of the Exchangeable Shares into the required number of Company shares of common stock and preferred stock. The Support Agreement is also binding on any successor to the Company and with respect to any successor transaction.\nEquity Compensation Plan Information\nNumber of Securities To be Issued Upon Exercise of Outstanding Options, Warrants and Rights\nWeighted-Average Exercise Price of Outstanding Options, Warrants and Rights\nNumber of Securities Remaining Available For Future Issuance Under Equity Compensation Plans (Excluding Securities Reflected\nin Column (a)\n(a)\n(b)\n(c)\nEquity Compensation Plans Approved by Security Holders\n16,000\n$23.33\n-\nEquity Compensation Plans Not Approved by Security Holders\n387,790\n$3.24\n591,210\nTotal\n403,790\n$3.81\n591,210\nSee Note 10, Notes to Consolidated Financial Statements for the years ended December 31, 2020 and 2019 included in Part IV, Item 15, of this Annual Report, for a discussion of the material features of the stock options, warrants and related stock plans.",
    "item_6": "Item 6. Selected Financial Data\nAs a smaller reporting company, the Company is not required to provide the information for this Item 6.",
    "item_7": "Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nForward Looking Statements\nThis Annual Report on Form 10-K contains certain forward-looking statements (within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934) regarding the Company and its business, financial condition, results of operations and prospects. Words such as \"expects,\" \"anticipates,\" \"intends,\" \"plans,\" \"believes,\" \"seeks,\" \"estimates\", \"could\", \"may\", \"should\", \"will\", \"would\", and similar expressions or variations of such words are intended to identify forward-looking statements in this report. Additionally, statements concerning future matters such as the development of new services, technology enhancements, purchase of equipment, credit arrangements, possible changes in legislation and other statements regarding matters that are not historical are forward-looking statements.\nAlthough forward-looking statements in this Annual Report reflect the good faith judgment of the Company's management, such statements can only be based on facts and factors currently known by the Company. Consequently, forward-looking statements are inherently subject to risks, contingencies and uncertainties, and actual results and outcomes may differ materially from results and outcomes discussed in this report. Although the Company believes that its plans, intentions and expectations reflected in these forward-looking statements are reasonable, the Company can give no assurance that its plans, intentions or expectations will be achieved. For a more complete discussion of these risk factors, see Item 1A, \"Risk Factors.”\nFor example, the Company's ability to maintain a positive cash flow and to become profitable may be adversely affected as a result of a number of factors that could thwart its efforts. These factors include the Company's inability to successfully implement the Company's business and revenue model, higher costs than anticipated, the Company's inability to sell its products and services to a sufficient number of customers, the introduction of competing products or services by others, the Company's failure to attract sufficient interest in, and traffic to, its sites, the Company's inability to complete development of its products, the failure of the Company's operating systems, and the Company's inability to increase its revenues as rapidly as anticipated.\nOverview\nShipTime Inc. has developed a SaaS based application, which focuses on the small to medium business segment. This offering allows members to quote, process, generate labels, dispatch and track courier and LTL shipments all from a single interface. The application provides customers with a choice of today’s leading couriers and freight carriers all with discounted pricing allowing members to save on every shipment. ShipTime can also be integrated into on-line shopping carts to facilitate sales via e-commerce. We actively sell directly to small businesses and through long standing partnerships with selected associations throughout Canada. Our focus in 2021 will be to significantly grow this portion of our business.\nPAID, Inc. (the “Company”) has developed AuctionInc, which is a suite of online shipping and tax management tools assisting businesses with e-commerce storefronts, shipping solutions, tax calculation, inventory management, and auction processing. The product does have tools to assist with other aspects of the fulfillment process, but the main purpose of the product is to provide accurate shipping and tax calculations and packaging algorithms that provide customers with the best possible shipping and tax solutions.\nBeerRun Software is a brewery management and Alcohol and Tobacco Tax and Trade Bureau tax reporting software. Small craft brewers can utilize the product to manage brewery schedules, inventory, packaging, sales and purchasing. Tax reporting can be processed with a single click and is fully customizable by state or providence. The software is designed to integrate with QuickBooks accounting platforms by using our powerful sync engine. We currently offer two versions of the software BeerRun and BeerRun Light which excludes some of the enhanced features of BeerRun without disrupting the core functionality of the software.\nPaidPayments provides commerce solutions to small - and medium-sized businesses by enabling them to sell their goods and services, accept payment, and create repeat sales though an online payment processing solution. The Company has operated as a Payment Facilitator since 2019, which enables our merchants to get the benefit of instant boarding and discounted rates. Our platform provides all aspects required for payment processing, including merchant boarding, underwriting, fraud monitoring, settlement, funding to the sub-merchant, and monthly reporting and statements. The Company controls all of these necessary aspects in the payment process and is then able to supply a one-step boarding process for our partners and value-added resellers. This capability also provides cost advantages, rapid response to market needs, simplified processes for boarding business and a seamless interface for our merchant customers.\nCritical Accounting Policies\nOur significant accounting policies are more fully described in Note 3 to our consolidated financial statements. However, certain of our accounting policies are particularly important to the portrayal of our financial position and results of operations and require the application of significant judgment by our management; as a result, they are subject to an inherent degree of uncertainty. In applying these policies, our management makes estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses and related disclosures. Those estimates and judgments are based upon our historical experience, the terms of existing contracts, our observance of trends in the industry, information that we obtain from our customers and outside sources, and on various other assumptions that we believe to be reasonable and appropriate under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions. Our critical accounting policies include:\nRevenue Recognition\nThe Company generates revenue principally from the sales related to the label generation services, shipping calculator services, brewery management software subscriptions, merchant processing services, and client services.\nThe Company recognizes revenues in accordance with the FASB ASC Topic 606. Accordingly, the Company recognizes revenues when the transfer of goods or services to customers at an amount that reflects the consideration to which the entity expects to be entitled in exchange for those goods or services.\nFor label generation service revenues the Company recognizes revenue when a customer has successfully prepared a shipping label and had a pickup. The service is offered to consumers via an online registration and allows users to create a shipping label using a credit card on their account (all customers must have a valid credit card on file to process shipments on the ShipTime platform).\nFor shipping calculator revenues and brewery management software and other subscription-based revenues, the Company recognizes subscription revenue on a monthly basis. Shipping calculator customers’ renewal dates are based on their date of installation and registration of the shipping calculator line of products. The timing of the revenue recognition and cash collection may vary within a given quarter and the deposits for future services are recorded as contract liabilities on the consolidated balance sheets. Brewery management software subscribers are billed monthly at the first of the month. All payments are made via credit card for the month following.\nFor payment processing services, the Company recognizes revenue based on daily transactions by our partners and merchants. Customers process credit card payments for sales and remit fees based on the number of transactions and percent of the processed amounts. The merchant bank deposits the funds to the customer net of fees. The remainder of the fees withheld is disbursed to the Company on a daily basis, net of interchange and other transactional charges.\nForeign Currency\nThe currencies of ShipTime, the Company’s international subsidiary, are in Canadian dollars. Foreign currency denominated assets and liabilities are translated into U.S. dollars using the exchange rates in effect at December 31, 2020. Results of operations and cash flows are translated using the average exchange rates throughout the period. The effect of exchange rate fluctuations on translation of assets and liabilities is included as a component of shareholders’ equity in accumulated other comprehensive income.\nLong-Lived Assets\nThe Company reviews the carrying values of its long-lived assets for possible impairment whenever events or changes in circumstances indicate that the carrying amount may not be recoverable. If the expected future cash flow from the use of the asset and its eventual disposition is less than the carrying amount of the asset, an impairment loss is recognized and measured using the fair value of the related asset. There can be no assurance, however, that market conditions will not change or demand for the Company’s services will continue, which could result in additional impairment of long-lived assets in the future.\nShare- Based Compensation\nThe Board of Directors has on occasion voted to award stock options or common shares/preferred shares to employees or directors. The price at which the option shares may be purchased is based on the fair market value of the shares on the date of the agreement. Each recipient’s option agreement may differ; the vesting terms may vary from fully vested immediately to one-third immediately, one-third vesting in 18 months and the final one-third vesting in 36 months from the date of the grant or one-third immediately, one-third vesting on January 1, 2019 and one-third vesting on January 1, 2020. Historically the options granted have had a 10-year term. If the recipient’s employment or relationship with the Company is terminated the options recipient may be allowed up to three months to exercise their options. Option compensation is calculated by using the Black-Scholes-Merton option pricing model to estimate the fair value of these share-based awards.\nLeases\nA right-of-use asset represents a lessee’s right to use a leased asset for the term of the lease. Our right-of-use assets generally consist of an operating lease for a building. Right-of-use assets are measured initially at the present value of the lease payments, plus any lease payments made before a lease began and any initial direct costs, such as commissions paid to obtain a lease. Right-of-use assets are subsequently measured at the present value of the remaining lease payments, adjusted for incentives, prepaid or accrued rent, and any initial direct costs not yet expensed.\nWe have an operating lease for our corporate offices in Canada and finance leases for furniture and equipment. Our leases have remaining lease terms of six months to thirty-two months, and our primary operating leases include options to extend the leases for four years. Future renewal options that are not likely to be executed as of the balance sheet date are excluded from right-of-use assets and related lease liabilities.\nWe report operating leased assets, as well as operating lease current and noncurrent obligations on our balance sheets for the right to use the building in our business. Our finance leases represent furniture and office equipment; we report the furniture and equipment, as well as finance lease current and noncurrent obligations on our balance sheet.\nGenerally, interest rates are stated in our leases for equipment. When no interest rate is stated in a lease, however, we review the interest rates implicit in our recent finance leases to estimate our incremental borrowing rate. We determine the rate implicit in a lease by using the most recent finance lease rate, or other method we think most closely represents our incremental borrowing rate.\nResults of Operations\nComparison of the years ended December 31, 2020 and\nThe following discussion compares the Company's results of operations for the year ended December 31, 2020 with those for the year ended December 31, 2019. The Company's consolidated financial statements and notes thereto included elsewhere in this Annual Report contain detailed information that should be referred to in conjunction with the following discussion.\nRevenues\nThe following table compares total revenue for the periods indicated.\nYears ended December 31,\n% Change\nClient services\n$3,541\n$19,395\n(82)%\nShipping calculator services\n27,845\n148,035\n(81)%\nBrewery management software\n114,881\n193,150\n(41)%\nMerchant processing services\n425,839\n2,011\n21,071%\nShipping coordination and label generation services\n12,348,683\n10,185,704\n21%\nTotal revenues\n$12,920,789\n$10,548,295\n22%\nRevenues increased 22% in 2020 primarily from the continued growth of the shipping coordination and label generation services and the addition of merchant processing services to the Company’s revenue stream.\nClient services revenues decreased $15,854 or 82% to $3,541 compared to $19,395 in 2019. The decrease was attributable to depleting inventory of our movie posters available for auction.\nShipping calculator services revenues decreased $120,190 or 81% to $27,845 compared to $148,035 in 2019. The decrease was attributed to discontinuance of billable services for a portion of the AuctionInc products. The Company is preparing to launch a new platform where the new clients will be migrated to.\nBrewery management software revenues decreased $78,269 or 41% to $114,881 in 2020 compared to $193,150 in 2019. The decrease is attributable to the additional competition in the brewery management software industry and the limited marketing to new clients.\nMerchant processing services is a new segment for the Company launched in late 2019. This segment has contributed to the overall growth of the Company increasing $423,828 to $425,839 in 2020 from $2,011 in 2019. These services also have a higher gross margin and gross profit. They will continue to be a source of growth for the Company.\nShipping coordination and label generation service revenues increased $2,162,979 or 21% to $12,348,683 in 2020 compared to $10,185,704 in 2019. The increase is attributable to the increase in marketing efforts along with the impact of COVID-19 on the small businesses and their ability to sell and ship online.\nGross Profit\nGross profit increased $364,548 or 13% to $3,111,289 in 2020 compared to $2,746,741 in 2019. Gross margin decreased 2 percentage points to 24% in 2020 from 26% in 2019. The decrease in gross margin was partially due to the increase in revenue from our shipping label generation services which are offered at a lower margin.\nOperating Expenses\nTotal operating expenses in 2020 were $5,242,763 compared to $3,458,774 in 2019, an increase of $1,783,989 or 52%. The increase is mainly due to the share-based compensation for 2020.\nOther Income/Expense, net\nNet other income in 2020 was $21,128 compared to $991,840 in the same period of 2019, a decrease of $970,712. This is primarily attributable to the gain recorded on the elimination of the stock price guarantee in 2019.\nNet Income (Loss)\nThe Company reported a net loss in 2020 of $(2,232,553) compared to a net income of $282,011 for the same period in 2019. The basic loss per common share in 2020 represents $(0.41) while the basic net income per common share in 2019 represents $0.06.\nInflation\nThe Company believes that inflation has not had a material effect on its results of operations.\nOperating Cash Flows\nA summarized reconciliation of the Company's net income (loss) to cash provided by operating activities for the years ended December 31, 2020 and 2019 is as follows:\nNet income (loss)\n$(2,232,553)\n$282,011\nProvision for bad debts\n20,125\n-\nDepreciation and amortization\n488,745\n490,250\nAmortization of operating lease right-of-use assets\n28,545\n22,850\nShare-based compensation\n2,452,701\n407,974\nOther income from stock price guarantee\n-\n(880,553)\nDeferred income taxes\n(120,835)\n(73,208)\nGain on sale of property and equipment\n(739)\n-\nUnrealized loss on stock price guarantee\n-\n(3,688)\nChanges in current assets and liabilities\n464,820\n(230,103)\nNet cash provided by operating activities\n$1,100,809\n$15,533\nWorking Capital and Liquidity\nThe Company had cash and cash equivalents of $1,644,210 on December 31, 2020 compared to $475,881 at December 31, 2019. The Company had working capital of $218,615 as of December 31, 2020 compared to a working capital deficit of $397,891 at December 31, 2019, an improvement of $616,506. The improvement in working capital is primarily attributed to the cash on hand at year end.\nManagement believes that the Company has adequate cash resources to fund operations during the next 12 months. In addition, management continues to explore opportunities and has organized additional resources to monetize its patents. However, there can be no assurance that anticipated growth in new business will occur, and that the Company will be successful in launching new products and services. Management continues to seek alternative sources of capital to support the growth of future operations.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosure about Market Risk\nAs a smaller reporting company, the Company is not required to provide the information for this Item 7A.",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nThe financial statements listed in Item 15(a) are incorporated herein by reference and are filed as a part of this report and follow the signature pages to this Annual Report on Form 10-K on page 34.",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nThe Company's management, including the interim Chief Executive Officer /Chief Financial Officer of the Company, as its principal financial officer has evaluated the effectiveness of the Company's “disclosure controls and procedures,” as such term is defined in Rule 13a-15(e) promulgated under the Securities Exchange Act of 1934, as amended (the “Exchange Act”). Based upon this evaluation, the interim Chief Executive Officer/Chief Financial Officer has concluded that, as of December 31, 2020, the Company's disclosure controls and procedures were not effective, due to material weaknesses in internal control over financial reporting, for the purpose of ensuring that the information required to be disclosed in the reports that the Company files or submits under the Exchange Act with the Securities and Exchange Commission is recorded, processed, summarized and reported within the time period specified by the Securities and Exchange Commission's rules and forms, and is accumulated and communicated to the Company's management, including its principal executive/financial officer, as appropriate, to allow timely decisions regarding required disclosure.\nAs described in our accompanying Management's Annual Report on Internal Control over Financial Reporting, we have identified four remaining material weaknesses in internal control over financial reporting. Because of these remaining material weaknesses, we concluded that, as of December 31, 2020, our internal control over financial reporting was not effective based on the criteria outlined in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”).\nWe continued to implement new procedures and controls in 2020 and have taken steps to remediate the material weaknesses at the entity and activity levels, and to review further our procedures and controls in 2021. In addition, we expect to make additional changes to our infrastructure, personnel and related processes that we believe are also reasonably likely to strengthen and materially affect our internal control over financial reporting.\nPrior to the complete remediation of these material weaknesses, there remains risk that the processes and procedures on which we currently rely will fail to be sufficiently effective, which could result in material misstatement of our financial position or results of operations and require a restatement. Moreover, because of the inherent limitations in all control systems, no evaluation of controls even where we conclude the controls are operating effectively can provide absolute assurance that all control issues, including instances of fraud, if any, have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty, and breakdowns can occur because of simple error or mistake. Additionally, controls can be circumvented by the individual acts of some persons, by collusion of two or more people, or by management override of the controls. The design of any system of controls also is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Over time, our control systems, as we develop them, may become inadequate because of changes in conditions, or the degree of compliance with the policies or procedures may deteriorate. Because of the inherent limitations in a cost-effective control system, misstatements due to error or fraud may occur and not be detected and could be material to our financial statements.\nThe certifications of our principal executive officer/principal financial officer required in accordance with Rule 13a-14(a) under the Exchange Act and Section 302 of the Sarbanes-Oxley Act of 2002 are attached as exhibits to this Annual Report on Form 10-K. The disclosures set forth in this Item 9A contain information concerning (i) the evaluation of our disclosure controls and procedures, and changes in internal control over financial reporting, referred to in paragraph 4 of the certifications, and (ii) material weaknesses in the design or operation of our internal control over financial reporting, referred to in paragraph 5 of the certifications. Those certifications should be read in conjunction with this Item 9A for a more complete understanding of the matters covered by the certifications.\nManagement's Annual Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining effective internal control over financial reporting of the Company. Internal control over financial reporting is a process designed by, or under the supervision of, our interim Chief Executive Officer/Chief Financial Officer and effected by our Board of Directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.\nOur internal control over financial reporting includes those policies and procedures that: (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect our transactions and dispositions of our assets; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of our assets that could have a material effect on the financial statements.\nA material weakness is a deficiency, or combination of deficiencies, in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of our annual or interim financial statements will not be prevented or detected on a timely basis.\nManagement, with the participation of our principal executive officer/principal financial officer, is required to evaluate the effectiveness of our internal controls over financial reporting as of December 31, 2020 based on criteria established under the COSO integrated framework of internal controls. The COSO framework identifies five components of internal control and provides a basis for evaluating the effectiveness of internal controls. Management has concluded that our internal controls over financial reporting were not effective as of December 31, 2020 due to the following:\n1. Entity Level Controls\n- Ineffective control environment, including lack of corporate governance\n- Ineffective communication of information\n- Ineffective monitoring of activities\n2. Activity Level Controls\n- Lack of procedures and control documentation\n1. Inadequate Entity Level Controls\nIneffective Control Environment, Including Lack of Corporate Governance\nThe Control Environment is the tone of an organization and how the tone influences the control consciousness of its people. Control Environment factors include, the integrity, ethical values, and competence of the entity’s people; management’s philosophy and operating style; the way management assigns authority and responsibility; the way management organizes and develops its people; and the attention and direction provided by the audit committee and board of directors. The Control Environment includes the Company’s Corporate Governance which is made up of a set of practices, policies, laws, and principals, designed to provide guidance and structure to directors, managers, and employees with a clear view of corporate goals and business objectives. These processes and procedures need to be clearly defined, presented and administered to each participant in the organization, and should document the distribution of rights and responsibilities among employees, management, clients and customers.\nSteps taken towards Remediation for an Ineffective Control Environment:\n●\nThe Company has included in its hiring process supplemental documentation regarding the internal control, insider trading and other Corporate matters\n●\nThe Company meets monthly in a town hall style with the opportunity to convey best practices for public companies.\n●\nManagement and the Board formally meet to discuss our filings. During these discussions, our auditors, and legal counsel may present to the Company various information which may be of material importance to our financial reporting and internal controls.\n●\nThe Company has made improvements by designing and drafting a corporate governance policy which has been approved by the Board of Directors, which documents the role of the Board and management, functions of the Board, role of the Audit Committee, agenda items for Board meetings, recoupment of unearned compensation, indemnification, reporting of concerns and complaints, and director access to management.\n●\nThe Board of Directors has appointed a Compensation Committee Chairman to oversee matters relating to employment, personnel and independent contractors.\nIneffective Communication of Information\nInformation and communication systems support the identification, capture, and, exchange of information in a form and time frame that enable people to carry out their responsibilities. This component includes information technology controls which are specific activities performed by persons of systems designed to ensure that the business objective can be met, protect the business from fraud and collusion, and keep the corporate assets protected and safe.\nSteps taken towards Remediation of Ineffective Communication of Information:\n●\nEnhanced the documentation and procedures of our information technology to control assurance that changes to financial applications are properly authorized and tested and that access to our information systems and financial applications are appropriately restricted.\n●\nTechnology staff has implemented a documenting and sharing process for software development\n●\nUpdated our information systems user profiles and passwords to improve access controls.\n●\nImplemented improvements to our information systems to further address control deficiencies.\n●\nUpdated secure backup procedures with best practice methodologies for protecting our financial data and, in case of a problem.\n●\nEnhanced the documentation of certain core proprietary technologies so that there is more redundancy and protection of corporate assets.\nIneffective Monitoring of Activities\nMonitoring is a process that assesses the quality of internal control performance over time.\nSteps taken towards Remediation of Ineffective Monitoring of Activities:\n●\nThe Company has reorganized the organizational reporting structure to enable greater oversight and control of operations which has increased the level of awareness and accountability.\n●\nThe Company meets regularly throughout the year to review operating results, policies and procedures, and staff reviews and practices.\n●\nNew management personnel are required to review their procedures and policies to make sure they are effective. The Company is evaluating the procedure and polices that have material weakness and developing corrective action plans to strengthen our internal controls.\n●\nThe Company has made changes to its policies and procedures with regard to its financial reporting systems. Upgrades to software systems have been made which has resulted in the automation of accounting transactions and has enhanced our financial reporting and timeliness of operating results. Management and staff are more integrated into the review process.\n●\nFinance staff is required to review expenses for proper approval and accounting treatment. Managers and staff are required to have expenditures pre-approved by their supervisor. All significant expenditures require multiple approvals including Company officers.\nThe Company believes significant improvements have been made to remediate its material weakness in the internal controls over financial reporting at the entity level, but does not have the appropriate documentation to support its efforts. The Company also believes that further work is still required to develop appropriate controls in some aspects of entity level control to provide reasonable assurance that controls are designed in the most effective and efficient manner possible. While we believe these changes will be effective at mitigating risk of material error, there continues to be additional work required for us to conclude that all three of these control areas are operating effectively. As noted in the Management's Report on Internal Control over Financial Reporting, we consider each of these control areas within the entity level control to constitute a material weakness.\nThe Company has taken significant steps to reduce risks associated with information technology controls and documentation. Our information technology department has worked toward cross training and redundancies to assure that no one single person has the ability to make changes to the core operating systems of our products. Additionally, we have contacted with our third party hosting provider to gain the ability to increase bandwidth in cases of larger than normal traffic to our websites and servers. The critical employees have continued network access with additional access to two independent internet providers.\nIn addition to the ongoing increase of documentation of the policies and procedures the Company has added increased internal controls with regard to the segregation of duties. As the Company grows and adds additional management level personnel it is increasingly easier to segregate duties. We have also added internal spending and approval limits to monitor activities.\n2. Inadequate Activity Level Controls\nLack of Procedures and Control Documentation\nThe Company lacks specific documentation relating to certain accounts, and financial closing, which in effect make these internal controls ineffective. The lack of documentation in internal controls relating to these accounts may affect the financial statements and will directly affect the nature and timing of other auditing procedures for certain activities.\nSteps taken towards Remediation of Revenue Recognition:\n●\nThe Company upgraded its transactional processing systems which resulted in the automation of several manual accounting tasks. This automation eliminated the risk of human error for these manual tasks and created a more concise audit trail in the revenue recognition process.\n●\nAll sales are reconciled across the Company's multiple revenue and accounting systems comparing for any discrepancies.\n●\nThe Company continues to document new processes and procedures to assure employees are following proper protocols with regard to activity that has an effect on the financial transactions of the Company.\nSteps taken towards Remediation of Expenditures and Accounts Payable:\n●\nExpenses are reviewed as incurred for proper accounting treatment and approval, department heads are responsible for budgeting and reviewing all expenses for their department..\n●\nThe Vendor Master File is reviewed for updates and changes and any changes are analyzed and monitored for their activity and frequency.\n●\nManagement evaluates all new client relationships for savings opportunities and value.\n●\nThe Chief Financial Officer is required to review and approve all cash disbursements.\n●\nPolicies for accounts payable approvals and payments have been reviewed with all department heads.\nSteps taken towards Remediation of Financial Closing:\n●\nThe Company closes its books and reconciles all accounts monthly, and provides management with a comprehensive set of financial and operating reports and analysis of results.\n●\nThe interim CEO/CFO receives monthly financial updates on each segment of the Company.\nThe Company has made significant improvements to the activity level controls specifically with regard to the deficiencies with the financial close. In addition, further work is required to develop appropriate controls in the other aspects of activity level control to provide reasonable assurance that controls are designed in the most effective and efficient manner possible. Therefore, while we believe these changes are effective at mitigating risk of material error, there continues to be additional work required for us to conclude that both of these control areas are operating effectively. Therefore, as noted in the Management's Report on Internal Control over Financial Reporting, we consider each of these control areas within the activity level control to constitute a material weakness.\nA factor for our internal control deficiencies is the small size of the Company and the lack of a financial expert on the Audit Committee of the Board of Directors and other corporate governance controls. As defined by the Public Company Accounting Oversight Board Auditing Standard No. 5, a material weakness is a significant control deficiency or a combination of significant control deficiencies that results in there being more than a remote likelihood that a material misstatement of the annual or interim financial statements will not be prevented or detected. Management continues to monitor and assess the controls to ensure compliance.\nAs a smaller reporting company, our independent registered public accounting firm is not required to issue a report on the Company's internal control over financial reporting as of December 31, 2020.\nChanges in Internal Control Over Financial Reporting\nAs discussed in the Managements' Annual Report on Internal Control over Financial Reporting, the Company made continuous improvements to the entity and activity controls and expects to take further steps in 2021 to remediate the outlined deficiencies. The Company has implemented a substantial amount of policies and procedures with regard to financial reporting, specifically in terms of segregation of duties. The Interim CEO/CFO has worked with the SVP Finance and management to identify areas of improvement and together they created appropriate written procedures for approvals and spending limits for individuals within the Company. Departmental budgets have been established and all transactions are reviewed monthly. The Company has also implemented dual approval and review of all cash disbursements and financial transactions. While we believe they are effective at mitigating risk of material error, we have not yet concluded that they are operating effectively. There were several areas of improvement in our segregation of duties, financial closing, and information technology controls that have positively impacted our internal control over financial reporting for the fiscal year ended 2020.",
    "item_9B": "Item 9B. Other Information\nNot applicable.\nPART III",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nDirectors and Executive Officers\nThe following table sets forth certain information regarding the directors and executive officers of PAID:\nName\nAge\nPosition\nW. Austin Lewis, IV\nInterim CEO, CFO\nDavid Scott\nCOO\nAndrew Pilaro\nDirector\nLaurie Bradley\nDirector\nDavid Ogden\nDirector\nAndrew Pilaro was elected as of September 19, 2000, for a term expiring at the 2001 Annual Meeting of Stockholders and until their successors are elected and qualified. On March 27, 2021, the Company amended its Bylaws to reduce the existing Board of Directors from five positions to three positions. At that time, W. Austin Lewis, IV and Allan Pratt automatically rolled off from the Board of Directors. Under Delaware law, unless otherwise provided in the certificate of incorporation or bylaws, directors are elected for one-year terms at the annual meeting of shareholders. The Amended Bylaws would provide for the Board to be divided into three classes of directors serving staggered three-year terms. As a result, approximately one-third of the Board will be elected each year. Initially, three directors will serve between one-to-three-year terms. The directors placed in a Class I position will serve for approximately one year. The directors placed in a Class II position will serve for approximately two years. The directors placed in a Class III position will serve approximately three years. After this transitional arrangement, the Directors will serve for three-year terms, with one class being elected each year.\nAndrew Pilaro has served as a Director of PAID since September 2000. He is President of CAP Properties Limited, a family office which is an investment management company, with a primary responsibility for asset management. Mr. Pilaro was asked to serve as a director because he provides investment management skills and a general business background.\nW. Austin Lewis, IV currently serves as CFO, interim CEO of PAID and previously served as the Chairman of the Audit Committee for MAM Software, Inc. (MAMS). Since 2004, Mr. Lewis has served as Chief Executive Officer of Lewis Asset Management Corporation, an investment management company he founded, where he is also the General Partner of the Lewis Opportunity Fund. Prior to founding Lewis Asset Management, Mr. Lewis held a variety of positions with investment firms, including Puglisi & Co., Thompson Davis & Co., and Branch Cabell & Company. Mr. Lewis holds a Bachelor of Science in Finance and a Bachelor of Science in Financial Economics from James Madison University. Mr. Lewis was asked to serve as the interim CEO because he had a thorough knowledge of the Company’s strengths and weaknesses and has a strong background in being able to make companies run efficiently and successfully.\nDavid Ogden is the CEO of Soho Management Consulting, a global investment consulting firm. David held many senior positions with FedEx, including Managing Director of Sales for FedEx Middle East and Africa region based in Dubai, and instrumental in India's launch as a direct served FedEx location. He was Managing Director of FedEx Logistics in the Middle East and Africa and was responsible for the region's first FedEx Logistics subsidiary's start-up. After FedEx, he moved to Egypt, where he created a group of companies representing best-of-class business support services under a group holding company. After Egypt, he moved to Abu Dhabi to work for an alternative investment company developing warehousing and logistics parks in the United Arab Emirates. He has recently been working with ecommerce ventures from around the world.\nLaurie Bradley is the Chief Executive Officer of Flexible Support Group providing funding, accounting, and payroll services to small and mid-size businesses across North America. Ms. Bradley also retains ownership in ASG Renaissance and serves as its President. ASG sold it staffing and contracting business in 2016 and now operates with a focus on executive search, and consulting services that delivers training to assist clients with their diversity and inclusion initiatives. The ASG consulting practice also leverages the 2007 Mosaic Advantage initiative which aggregated a network of minority, women, and veteran owned businesses providing them with access to larger business opportunities, coaching, mentoring and financial services. Ms. Bradley has worked in both the public and private sectors specializing in talent management, executive leadership, and advisory services. Ms. Bradley holds a Bachelor of Arts degree from McMaster University and a certificate in Business Strategy from Cornell University.\nDavid Scott currently serves as COO of PAID. Prior, he served as the Director of Technology joining the Company in 2017. Mr. Scott leads the Development and IT teams from requirements through to implementation while supporting Sales, Marketing & Customer Success. Mr. Scott has completed courses in Computer Science at both Mohawk College and McMaster University.\nThe Company has not made any material changes to the procedures by which security holders may recommend nominees to the Board of Directors. The Board does not have a separate nominating committee.\nAudit Committee\nThe Securities and Exchange Commission has adopted rules to implement certain requirements of the Sarbanes-Oxley Act of 2002 pertaining to public company audit committees. One of the rules requires a company to disclose whether it has an “audit committee financial expert” serving on its audit committee. Based on its review of the criteria of an audit committee financial expert under the rule adopted by the SEC, the Board of Directors does not believe that any member of the Board of Directors' Audit Committee would be described as an audit committee financial expert. At this time, the Board of Directors believes it would be desirable for the Audit Committee to have an audit committee financial expert serving on the committee. While from time to time informal discussions as to potential candidates have occurred, no formal search process has commenced. Andrew Pilaro, one of the Company’s independent directors, is the sole member of the audit committee. The audit committee does not have a charter.\nAudit Committee Report\nThe Audit Committee reviewed and discussed our audited consolidated financial statements for the year ended December 31, 2020 with our management. The Audit Committee also reviewed and discussed our audited consolidated financial statements and the matters required to be discussed, by the Public Company Accounting Oversight Board (“PCAOB”), including material weaknesses and other internal control deficiencies with KMJ Corbin & Company LLP, our independent registered public accounting firm. The Audit Committee received from KMJ Corbin & Company LLP the written disclosures and letter required by applicable requirements of the PCAOB regarding the independent accountant's communications with the audit committee concerning independence, and has discussed with the independent accountant the independent accountant's independence.\nBased on the reviews and discussions referred to above, the Audit Committee recommended to our Board of Directors that our audited consolidated financial statements be included in our Annual Report on Form 10-K for the year ended December 31, 2020.\nThe Audit Committee\nAndrew Pilaro\nCode of Ethics\nThe Company has adopted a Code of Ethics that applies to all of its directors, officers, and employees, including its principal executive officer, principal financial officer, principal accounting officer, or controller, or persons performing similar functions. A written copy of the Company's Code of Ethics will be provided to anyone, free of charge, upon request to: W. Austin Lewis, CFO, PAID, Inc., 225 Cedar Hill Street, Marlborough, Massachusetts 01752.\nAny waiver of the code of business conduct and ethics for directors or executive officers, or any amendment to the code that applies to directors or executive officers, may only be made by the board of directors. We intend to satisfy the disclosure requirement under Item 5.05 of Form 8-K regarding an amendment to, or waiver from, a provision of this code of ethics by posting such information on our website, at the address and location specified above. To date, no such waivers have been requested or granted.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Securities Exchange Act of 1934 requires the Company's directors and executive officers, and persons who own more than 10% of the Company's outstanding Common Stock to file with the Securities and Exchange Commission initial reports of ownership and reports of changes in ownership of Common Stock. These persons are required by SEC regulation to furnish the Company with copies of all such reports they file. To the Company's knowledge, based solely on a review of the copies of such reports furnished to the Company and representations that no other reports were required, all Section 16(a) filing requirements applicable to its officers and directors and beneficial owners of more than 10% of the Company's stock, have been complied with for the period which this Form 10-K relates.",
    "item_11": "Item 11. Executive Compensation\nOn May 10, 2017, the Board of Directors appointed Laurie Bradley as the Chairman of the Compensation Committee. Ms. Bradley along with the remaining Board of Directors will be responsible for carrying out the Boards responsibilities relating to executive compensation, employment agreements, executive succession and equity based compensation programs and practices of the Company.\nOn March 29, 2021, the Company entered into an Employment Agreement and an Executive Non-Competition Agreement with W. Austin Lewis, IV, as CEO of the Company, with an effective date of January 4, 2021. The Employment Agreement is for a two-year term from the effective date with automatic one-year renewals subject to 12 months’ notice of termination by the Company. Mr. Lewis shall receive an annualized salary of $300,000 and may qualify for a bonus. Mr. Lewis also received 250,000 shares of Company common stock as a signing bonus, of which 125,000 shares may be repurchased at $1.91 per share in the event that Mr. Lewis terminates his employment prior to January 1, 2022. In addition, other than termination “for cause”, Mr. Lewis qualifies for a one-year severance of his then current salary. By separate agreement dated March 29, 2021, Mr. Lewis is also bound by a non-competition restriction for a period of 12 months following termination.\nCompensation to the Named Executive Officers\nThe following table sets forth the compensation of the Company's chief executive officer, chief financial officer and the chief operating officer, and each officer whose total cash compensation exceeded $100,000, for the last two fiscal years ended December 31, 2020 and 2019.\nSummary Compensation Table\nName and\nPrincipal Position\nYear\nSalary\nBonus\nOption Awards ($)\nTotal\nW. Austin Lewis, IV (1),(2),(7) (CFO, Interim CEO)\n$283,294\n$2,005,500\n$-\n$2,288,794\n$180,000\n$-\n$-\n$180,000\nAllan Pratt (3), (4)\n$185,000\n$-\n$-\n$185,000\nDavid Scott (5), (6) (COO)\n$104,475\n$-\n$109,200\n$215,675\n$82,896\n$-\n$85,050\n$167,946\n1.\nMr. Lewis’s start date was July 31, 2012.\n2.\nMr. Lewis’s salary was approved by the Board of Directors at $300,000.\n3.\nMr. Pratt’s start date was December 30, 2016.\n4.\nMr. Pratt’s salary and employment agreement were approved by the Board of Directors on December 19. 2016. On February 29, 2020, Mr. Pratt completed his contractual obligation as Chief Executive Officer.\n5.\nMr. Scott was promoted to Chief Operating Officer on May 1, 2020.\n6.\nMr. Scott received 15,000 non-qualified options on February 13, 2019, 15,000 on August 13, 2019. On November 10, 2020 he was awarded an additional 40,000 non-qualified options.\n7.\nMr. Lewis' bonus of 1,050,000 shares for 2019 and 2020 was approved by the Board of Directors on March 29, 2021 and was valued at $1.91 per share based on the close price of the Company's common stock at March 29, 2021.\nThe following tables set forth certain information related to outstanding equity awards as of December 31, 2020 for our executive officers.\nOption Awards\nName\nNumber of Securities Underlying Unexercised Options (#) Exercisable\nNumber of Securities Underlying Unexercised Options (#) Unexercisable\nEquity Incentive Plan Awards: Number of Securities Underlying Unexercised Unearned Options (#)\nOption Exercise Price ($)\nOption Expiration Date\nW. Austin Lewis IV\n10,000\n-\n-\n$0.975\n08/08/2022\nCFO, (PFO), (PEO)\n10,000\n-\n-\n$0.975\n10/15/2022\n2,000\n-\n-\n$0.975\n12/06/2022\n2,000\n-\n-\n$0.975\n05/21/2023\n4,000\n-\n-\n$0.975\n11/18/2024\n2,000\n-\n-\n$0.975\n04/01/2026\nDavid Scott\n7,000\n-\n-\n$4.10\n03/23/2028\n3,000\n-\n$3.50\n10/01/2028\n15,000\n5,000\n-\n$2.92\n02/13/2029\n15,000\n5,000\n-\n$3.00\n08/13/2029\n40,000\n26,667\n-\n$2.885\n11/10/2030\nNone of the Company's executive officers who serve as directors receive separate compensation from the Company for serving as directors.\nOn August 26, 2016 the Board of Directors approved to vote to reprice 53,500 stock options and fully vest any unvested options for two employees and three board members. The exercise price was lowered to $0.975 which reflects the market value of the stock.\nIn 2020, a number of non-executive employees and non-employee directors received compensation though cash and through stock option grants under the Company’s 2018 Non-Qualified Stock Option Plan. The Company granted 105,000 stock options to employees and consultants during the year ended December 31, 2020. The options have vesting periods of immediately and over a three-year period, they expire if not exercised within ten years from grant date, and the exercise price was $2.885 per share. As a result of the issuance and the expense recorded on previously issued stock options, in addition to an accrued common stock bonus, the Company recorded share-based compensation expense of $2,133,808 during the year ended December 31, 2020.\nThe following table provides compensation information for the one-year period ended December 31, 2020 for the only non-employee members of our Board of Directors.\nDirector Compensation in 2020\nName\nFees earned or paid in cash\nOption Awards ($)\nTotal\nAndrew Pilaro\n$2,500\n$25,700\n$28,200\nLaurie Bradley\n$2,500\n$25,700\n$28,200\nDavid Ogden\n$1,000\n$12,850\n$13,850",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nTo the knowledge of the management of the Company the following table sets forth the beneficial ownership of our common stock as of March 31, 2021 of each of our directors and executive officers, and all of our directors and executive officers as a group, and other beneficial owners holding more than five percent of the Company’s issued and outstanding shares.\nAmount and Nature of Beneficial Ownership\nPercent of Class (3)\nW. Austin Lewis, IV\n3,006,178(1)\n37%\nAllan Pratt\n2,222,273(4)\n27%\nJohn Smith\n914,973\n11%\nDavid Ogden\n35,000(5)\n1%\nLaurie Bradley\n74,217(6)\n1%\nAndrew Pilaro\n68,337(2)\n1%\nAll directors beneficial owners\n6,320,978\n78%\n(1)\nIncluded are options to purchase 30,000 shares of the Company’s common stock, and 1,402,058 shares held for which W. Austin Lewis, IV is the General Partner.\n(2)\nIncludes options to purchase 66,000 shares of the Company's common stock.\n(3)\nPercentages are calculated on the basis of the amount of outstanding securities plus for such person or group, any securities that person or group has the right to acquire within 60 days.\n(4)\nIncluded in this amount are shares authorized and reserved for future issuance from exchangeable shares.\n(5)\nIncludes options to purchase 35,000 shares of the Company's common stock.\n(6)\nIncludes options to purchase 47,500 shares of the Company's common stock.\nTo the knowledge of the management of the Company, based solely on our review of SEC filings, four shareholders are the beneficial owner of more than five percent of the Company’s common stock.\nThe information regarding the Company's “Equity Compensation Plan Information” is incorporated herein by reference in Part II, Item 5 of this Annual Report on Form 10-K.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe Company did not engage in any transaction in 2019 or 2020, and does not currently propose any transaction, in which the Company was a participant whereas the amount involved exceeds $120,000, and in which any related person had or will have a direct or indirect material interest.\nReview, Approval or Ratification of Transactions with Related Parties\nIt is our unwritten policy, which policy is not otherwise evidenced, for any related party transaction that involves more than a de minimis obligation, expense or payment or stock option or equity grants, to obtain approval by our entire board of directors prior to our entering into any such transaction. In conformity with our various policies on related party transactions, any transactions discussed in this Item 13 has been reviewed and approved by our board of directors.\nDirector Independence\nThe Company has a majority of independent directors with Laurie Bradley as the sole member of the compensation committee and Andrew Pilaro is the sole member of the audit committee.\nOur board of directors currently consists of three members. Our board of directors determined that the three directors, Andrew Pilaro, Laurie Bradley and David Ogden, are independent under the standards of the “Nasdaq Global Market\" pursuant to Nasdaq Listing Rule 5605.",
    "item_14": "Item 14. Principal Accountant Fees and Services\nKMJ Corbin & Company LLP (“KMJ”) is our independent registered public accounting firm for the years ended December 31, 2020 and 2019.\nThe following is a summary of the fees billed to the Company by KMJ for professional services rendered for the years ended December 31, 2020 and 2019. These fees are for work performed in the years indicated and, in some instances, we have estimated the fees for services rendered but not yet billed.\nAudit Fees:\nConsists of fees billed for professional services rendered for the audit of the Company’s annual financial statements and the review of the interim financial statements included in the Company’s Quarterly Reports (together, the “Financial Statements” ) and for services normally provided in connection with statutory and regulatory filings or engagements\n$54,600\n$55,550\nTax Fees\nConsists of fees billed for tax compliance, tax advice and tax planning\n5,250\n8,350\nTotal All Fees\n$59,850\n$63,900\nThe Audit Committee approves all audit and audit-related fees. The Audit Committee is required to pre-approve all non-audit services to be performed by the auditor. The percentage of hours expended on the principal accountant's engagement to audit the Company's financial statements for the most recent fiscal year that were attributed to work performed by persons other than the principal accountant's full-time, permanent employees was 0%.\nPART IV",
    "item_15": "Item 15. Exhibits and Financial Statement Schedules\n(a)(1) Financial Statements\nFor a list of the financial information included herein, see “Index to Audited Consolidated Financial Statements” on page 32 of this Annual Report on Form 10-K.\n(a)(2) Financial Statements Schedules\nAll schedules are omitted because they are not applicable or the required information is included in the financial statements or notes thereto.\n(a)(3) Exhibits\nThe list of exhibits filed as a part of this Annual Report on Form 10-K is set forth on the Exhibit Index immediately preceding the exhibits hereto and is incorporated herein by reference.\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nPAID, INC.\nBy:\n/s/\nDate: March 31, 2021\nW. Austin Lewis, IV, Interim Chief Executive Officer, Chief Financial Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/\nAndrew Pilaro\nDirector\nMarch 31, 2021\n/s/\nLaurie Bradley\nDirector\nMarch 31, 2021\nPAID, INC.\nINDEX TO AUDITED CONSOLIDATED FINANCIAL STATEMENTS\nDECEMBER 31, 2020 AND 2019\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of December 31, 2020 and 2019\nConsolidated Statements of Operations and Comprehensive Income (Loss) for the Years ended December 31, 2020 and 2019\nConsolidated Statements of Changes in Shareholders' Equity for the Years ended December 31, 2020 and 2019\nConsolidated Statements of Cash Flows for the Years ended December 31, 2020 and\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Shareholders of\nPAID, Inc.\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of PAID, Inc. and subsidiaries (the “Company”) as of December 31, 2020 and 2019, the related consolidated statements of operations and comprehensive income (loss), changes in shareholders’ equity and cash flows for each of the two years in the period ended December 31, 2020, and the related notes (collectively referred to as the \"consolidated financial statements\"). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2020 and 2019, and the results of its operations and its cash flows for each of the two years in the period ended December 31, 2020, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (“PCAOB”) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nLiquidity Assessment\nCritical Audit Matter Description\nManagement has prepared the Company’s consolidated financial statements on a going concern basis, which contemplates the continuity of operations, and the realization of assets and the satisfaction of liabilities in the normal course of business. As discussed in Note 2, the Company incurred an operating loss for the year ended December 31, 2020, but had positive working capital as of December 31, 2020 and net cash provided by operating activities for the year ended December 31, 2020. Management assesses whether the Company has sufficient liquidity to fund its costs for the next twelve months from the financial statement issuance date in order to determine if there is substantial doubt about the Company’s ability to continue as a going concern. In the preparation of this liquidity assessment, management applies judgment to estimate the projected cash flows of the Company, which are based on known or planned cash requirements for operating costs as well as planned costs for project development.\nThe principal consideration for our determination that performing procedures relating to the liquidity assessment is a critical audit matter is the significant judgments made by management when assessing whether the Company has sufficient liquidity. We determined there is significant estimation and execution uncertainty regarding the Company’s future cash flows and the risk of bias in management’s judgments and assumptions in estimating these cash flows.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the Company’s assertion as to its ability to continue as a going concern included the following, among others:\n●\nWe gained an understanding of the Company’s process relating to the preparation of projected information and considerations of the Company’s obligations.\n●\nWe tested the reasonableness of the projected operating expenses, and uses and sources of cash used in management’s assessment of whether the Company has sufficient liquidity to fund operations for at least one year from the financial statement issuance date. This testing included inquiries with management, comparison of prior period projections to actual results, and consideration of positive and negative evidence impacting management’s projections.\n●\nWe evaluated the reasonableness of management’s assumptions related to the likelihood that the Company would be able to reduce operating expenditures if required.\nKMJ Corbin & Company LLP\nWe have served as the Company’s auditor since 2013.\nIrvine, California\nMarch 31, 2021\nPAID, INC.\nCONSOLIDATED BALANCE SHEETS\nAS OF DECEMBER 31,\nASSETS\nCurrent assets:\nCash and cash equivalents\n$1,644,210\n$475,881\nAccounts receivable, net\n171,785\n131,561\nPrepaid expenses and other current assets\n184,366\n124,257\nTotal current assets\n2,000,361\n731,699\nProperty and equipment, net\n59,848\n89,707\nIntangible assets, net\n3,633,420\n4,048,572\nOperating lease right-of-use assets\n93,457\n121,440\nTotal assets\n$5,787,086\n$4,991,418\nLIABILITIES AND SHAREHOLDERS' EQUITY\nCurrent liabilities:\nAccounts payable\n$1,460,484\n$876,260\nFinance leases - current portion\n2,844\n9,951\nAccrued expenses\n276,254\n207,786\nContract liabilities\n9,046\n5,338\nOperating lease obligations - current portion\n33,118\n30,255\nTotal current liabilities\n1,781,746\n1,129,590\nLong-term liabilities:\nFinance leases - net of current portion\n-\n2,797\nOperating lease obligations - net of current portion\n61,794\n93,642\nDeferred tax liability, net\n960,947\n1,070,189\nTotal liabilities\n2,804,487\n2,296,218\nCommitments and contingencies\nShareholders' equity:\nSeries A Preferred stock, $0.001 par value, 5,000,000 shares authorized; none and 4,438,578 shares issued and outstanding at December 31, 2020 and 2019, respectively; liquidation value of $0 and $13,808,610 at December 31, 2020 and 2019, respectively\n-\n4,439\nCommon stock, $0.001 par value, 25,000,000 shares authorized; 6,489,004 shares issued and 6,455,164 shares outstanding at December 31, 2020, 1,648,657 shares issued and 1,614,817 outstanding at December 31,\n6,489\n1,649\nAccrued common stock bonus\n2,005,500\n-\nAdditional paid-in capital\n70,083,486\n69,242,412\nAccumulated other comprehensive income\n570,761\n512,894\nAccumulated deficit\n(69,625,790)\n(67,008,347)\nCommon stock in treasury, at cost, 33,840 shares at December 31, 2020 and\n(57,847)\n(57,847)\nTotal shareholders' equity\n2,982,599\n2,695,200\nTotal liabilities and shareholders' equity\n$5,787,086\n$4,991,418\nSee accompanying notes to consolidated financial statements\nPAID, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE INCOME (LOSS)\nFOR THE YEARS ENDED DECEMBER 31,\nRevenues, net\n$12,920,789\n$10,548,295\nCost of revenues\n9,809,500\n7,801,554\nGross profit\n3,111,289\n2,746,741\nOperating expenses:\nSalaries and related\n1,530,151\n1,452,134\nGeneral and administrative\n800,996\n1,135,230\nAmortization of intangible assets\n458,915\n463,436\nShare-based compensation\n2,452,701\n407,974\nTotal operating expenses\n5,242,763\n3,458,774\nLoss from operations\n(2,131,474)\n(712,033)\nOther income (expense):\nOther income, net\n21,128\n988,152\nUnrealized gain on stock price guarantee\n-\n3,688\nTotal other income, net\n21,128\n991,840\nIncome (loss) before income tax provision (benefit)\n(2,110,346)\n279,807\nIncome tax provision (benefit)\n122,207\n(2,204)\nNet income (loss)\n(2,232,553)\n282,011\nPreferred dividends\n(28,532)\n(192,005)\nNet income (loss) available to common shareholders\n$(2,261,085)\n$90,006\nNet income (loss) per share - basic\n$(0.41)\n$0.06\nNet income (loss) per share - diluted\n$(0.41)\n$0.05\nWeighted average number of common shares outstanding - basic\n5,469,908\n1,614,817\nWeighted average number of common shares outstanding - diluted\n5,469,908\n1,669,178\nConsolidated statements of comprehensive income (loss):\nNet income (loss)\n$(2,232,553)\n$282,011\nOther comprehensive income (loss):\nForeign currency translation adjustments\n57,867\n168,712\nComprehensive income (loss)\n$(2,174,686)\n$450,723\nSee accompanying notes to consolidated financial statements\nPAID, INC.\nCONDENSED CONSOLIDATED STATEMENTS OF CHANGES IN SHAREHOLDERS' EQUITY\nFOR THE YEARS ENDED DECEMBER 31, 2020 AND 2019\nPreferred Stock\nCommon Stock\nAdditional Paid in\nAccumulated Other Comprehensive\nAccumulated\nTreasury Stock\nShares\nAmount\nShares\nAmount\nStock Bonus\nCapital\nIncome\nDeficit\nShares\nAmount\nTotal\nBalance, January 1,\n3,784,712\n$3,785\n1,648,657\n$1,649\n$-\n$68,751,871\n$344,182\n$(67,127,122)\n(33,840)\n$(57,847)\n$1,916,518\nForeign currency translation adjustment\n-\n-\n-\n-\n-\n-\n168,712\n-\n-\n-\n168,712\nPreferred dividends paid\n-\n-\n-\n-\n-\n-\n-\n(163,236)\n-\n-\n(163,236)\nShare-based compensation expense\n-\n-\n-\n-\n-\n407,974\n-\n-\n-\n-\n407,974\nPreferred shares issued as compensation\n653,866\n-\n-\n-\n82,567\n-\n-\n-\n-\n83,221\nNet income\n-\n-\n-\n-\n-\n-\n-\n282,011\n-\n-\n282,011\nBalance December 31, 2019\n4,438,578\n4,439\n1,648,657\n1,649\n-\n69,242,412\n512,894\n(67,008,347)\n(33,840)\n(57,847)\n2,695,200\nForeign currency translation adjustment\n-\n-\n-\n-\n-\n-\n57,867\n-\n-\n-\n57,867\nShare-based compensation expense\n-\n-\n-\n-\n2,005,500\n128,308\n-\n-\n-\n-\n2,133,808\nPreferred dividends paid in shares\n126,727\n-\n-\n-\n358,511\n-\n(358,638)\n-\n-\n-\nExchange of Preferred to Common\n(4,565,305)\n(4,566)\n4,566,227\n4,566\n-\n-\n-\n-\n-\n-\n-\nPreferred dividends paid\n-\n-\n-\n-\n-\n-\n-\n(26,252)\n-\n-\n(26,252)\nWarrant reprice\n-\n-\n-\n-\n-\n318,893\n-\n-\n-\n-\n318,893\nWarrant exercise\n-\n-\n274,120\n-\n35,362\n-\n-\n-\n-\n35,636\nNet loss\n-\n-\n-\n-\n-\n-\n-\n(2,232,553)\n-\n-\n(2,232,553)\nBalance December 31, 2020\n-\n$-\n6,489,004\n$6,489\n$2,005,500\n$70,083,486\n$570,761\n$(69,625,790)\n(33,840)\n$(57,847)\n$2,982,599\nSee accompanying notes to consolidated financial statements\nPAID, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFOR THE YEARS ENDED DECEMBER 31,\nCash flows from operating activities:\nNet income (loss)\n$(2,232,553)\n$282,011\nAdjustments to reconcile net income (loss) to net cash provided by operating activities:\nDepreciation and amortization\n488,745\n490,250\nAmortization of operating lease right-of-use assets\n28,545\n22,850\nProvision for bad debts\n20,125\n-\nGain on sale of property and equipment\n(739)\n-\nShare-based compensation\n2,452,701\n407,974\nUnrealized (gain) loss on stock price guarantee\n-\n(3,688)\nOther income from stock price guarantee\n-\n(880,553)\nDeferred income taxes\n(120,835)\n(73,208)\nChanges in assets and liabilities:\nAccounts receivable\n(60,044)\n(39,574)\nPrepaid expenses and other current assets\n(59,362)\n(8,589)\nAccounts payable\n546,859\n164,652\nAccrued expenses\n63,460\n(183,229)\nContract liabilities\n3,444\n(142,914)\nOperating lease obligations\n(29,537)\n(20,449)\nNet cash provided by operating activities\n1,100,809\n15,533\nCash flows from investing activities:\nProceeds from sale of property and equipment\n-\nPurchase of property and equipment\n-\n(16,106)\nNet cash provided by (used in) investing activities\n(16,106)\nCash flows from financing activities:\nPayments on finance leases\n(9,627)\n(8,821)\nPayments on notes payable\n-\n(15,346)\nProceeds from warrant exercise\n35,636\n-\nPayments of preferred dividends\n(26,252)\n(163,236)\nNet cash used in financing activities\n(243)\n(187,403)\nEffect of exchange rate changes on cash and cash equivalents\n67,024\n31,526\nNet change in cash and cash equivalents\n1,168,329\n(156,450)\nCash and cash equivalents, beginning of year\n475,881\n632,331\nCash and cash equivalents, end of year\n$1,644,210\n$475,881\nSUPPLEMENTAL DISCLOSURES OF CASH FLOW INFORMATION\nCash paid during the year for:\nIncome taxes\n$500\n$960\nInterest\n$664\n$1,687\nSUPPLEMENTAL DISCLOSURES OF NON-CASH ITEMS\nIssuance of preferred shares for settlement of dividends\n$358,638\n$-\nIssuance of preferred shares for settlement of accrued expenses\n$-\n$83,221\nOperating lease liabilities from obtaining operating lease right-of-use assets\n$-\n$55,600\nSee accompanying notes to consolidated financial statements\nPAID, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDECEMBER 31, 2020 AND 2019\nNOTE 1. ORGANIZATION\nPAID, Inc. (“PAID”, the “Company”, “we”, “us”, or “our”) has developed AuctionInc, which is a suite of online shipping and tax management tools assisting businesses with e-commerce storefronts, shipping solutions, tax calculation, inventory management, and auction processing. The product has tools to assist with other aspects of the fulfillment process, but the main purpose of the product is to provide accurate shipping and tax calculations and packaging algorithms that provide customers with the best possible shipping and tax solutions.\nBeerRun Software (“BeerRun”) is a brewery management and Alcohol and Tobacco Tax and Trade Bureau tax reporting software. Small craft brewers can utilize the product to manage brewery schedules, inventory, packaging, sales and purchasing. Tax reporting can be processed with a single click and is fully customizable by state or province. The software is designed to integrate with QuickBooks accounting platforms by using our powerful sync engine. We currently offer two versions of the software BeerRun and BeerRun Light which excludes some of the enhanced features of BeerRun without disrupting the core functionality of the software. Additional features include Brewpad and Kegmaster and can be added on to the base product. Craft brewing is on the rise in the United States, and we feel that there is a large potential to grow this portion of our business.\nShipTime Canada Inc. (“ShipTime”) has developed a SaaS-based application, which focuses on the small and medium business segments. This offering allows members to quote, process, generate labels, dispatch and track courier and LTL shipments all from a single interface. The application provides customers with a choice of today’s leading couriers and freight carriers all with discounted pricing allowing members to save on every shipment. ShipTime can also be integrated into on-line shopping carts to facilitate sales via e-commerce. We actively sell directly to small and medium businesses and through long standing partnerships with selected associations throughout Canada.\nPaidPayments provides commerce solutions to small - and medium-sized businesses by enabling them to sell their goods and services, accept payment, and create repeat sales though an online payment processing solution. The Company has operated as a Payment Facilitator since 2019, which enables our merchants to get the benefit of instant boarding and discounted rates. Our platform provides all aspects required for payment processing, including merchant boarding, underwriting, fraud monitoring, settlement, funding to the sub-merchant, and monthly reporting and statements. The Company controls all of these necessary aspects in the payment process and is then able to supply a one-step boarding process for our partners and value-added resellers. This capability also provides cost advantages, rapid response to market needs, simplified processes for boarding business and a seamless interface for our merchant customers.\nNOTE 2. LIQUIDITY AND MANAGEMENT’S PLANS\nFor the year ended December 31, 2020, the Company reported cash and cash equivalents of $1,644,210 and cash flow from operations of $1,100,809 with working capital of $218,615. The Company has reported an operating loss of $2,131,474 for the year ended December 31, 2020 and has an accumulated deficit of $69,625,790 at December 31, 2020.\nManagement believes that the continued growth of the new PAID platform of services in addition to the continued profitability of ShipTime’s services will return a valuable impact on the Company’s success in the future. The ongoing positive cash flows from operations is a significant indicator of our successful transition to the new shipping and eCommerce services. In addition to the existing services provided, ShipTime will launch products in the United States that are complementary to the current offerings. The Company also continues to seek alternate sources of capital to support future operations.\nAlthough there can be no assurances, the Company believes that the above management plan will be sufficient to meet the Company's working capital requirements through the end of March 2022 and will have a positive impact on the Company for the foreseeable future.\nNOTE 3. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe accompanying consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (“GAAP”).\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of PAID, Inc. and its wholly owned subsidiaries, PAID Run, LLC and ShipTime Canada. All intercompany accounts and transactions have been eliminated.\nForeign Currency\nThe currency of ShipTime, the Company’s international subsidiary, is in Canadian dollars. Foreign currency denominated assets and liabilities are translated into U.S. dollars using the exchange rates in effect at each balance sheet date. Results of operations and cash flows are translated using the average exchange rates throughout the period. The effect of exchange rate fluctuations on translation of assets and liabilities is included as a separate component of shareholders’ equity in accumulated other comprehensive income.\nGeographic Concentrations\nThe Company conducts business in the U.S. and Canada. For customers headquartered in their respective countries, the Company derived approximately 96% of its revenues from Canada and 4% from the U.S. during the year ended December 31, 2020, compared to 97% of its revenues from Canada and 3% from the U.S. during the year ended December 31, 2019.\nAt December 31, 2020 and 2019, the Company maintained 100% of its net property and equipment in Canada.\nComprehensive Income (Loss)\nComprehensive income (loss) includes all changes in equity (net assets) during a period from non-owner sources. For the years ended December 31, 2020 and 2019, the components of comprehensive income (loss) consist solely of foreign currency translation gains (losses).\nUse of Estimates\nThe preparation of the consolidated financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenues and expenses during the reporting period. Significant estimates made by the Company’s management include, but are not limited to, the collectability of accounts receivable, the recoverability of long-lived assets, the valuation of deferred tax assets and liabilities, renewal periods and discount rates for leases and valuation of share-based transactions. Actual results could materially differ from those estimates.\nFair Value Measurements\nThe Company measures the fair value of certain of its financial assets on a recurring basis. A fair value hierarchy is used to rank the quality and reliability of the information used to determine fair values. Financial assets and liabilities carried at fair value will be classified and disclosed in one of the following three categories:\nLevel 1 - Quoted prices (unadjusted) in active markets for identical assets or liabilities;\nLevel 2 - Inputs other than Level 1 that are observable, either directly or indirectly, such as unadjusted quoted prices for similar assets and liabilities, unadjusted quoted prices in the markets that are not active, or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities; and\nLevel 3 - Unobservable inputs that are supported by little or no market activity and that are significant to the fair value of the assets or liabilities.\nAt December 31, 2020 and 2019, the Company’s financial instruments include cash and cash equivalents, accounts receivable, accounts payable, and accrued expenses. The carrying amount of cash and cash equivalents, accounts receivable, accounts payable, and accrued expenses approximates fair value due to the short-term maturities of these instruments.\nCash and Cash Equivalents\nThe Company considers all highly liquid temporary cash investments with an initial maturity of three months or less to be cash equivalents. Management believes that the carrying amounts of cash equivalents approximate their fair value because of the short maturity period.\nConcentration of Risk\nThe Company maintains cash balances at financial institutions that are insured by the Federal Deposit Insurance Corporation (“FDIC”) up to USD $250,000 and the Canadian Depositors Insurance Corporation (“CDIC”) up to CAD $100,000. At December 31, 2020, the Company had amounts that exceeded the CDIC insurance limits but none that were in excess of the FDIC insurance limits. The Company has not experienced any losses in such accounts and believes it is not exposed to any significant credit risk related to these deposits.\nThe Company extends credit based on an evaluation of the customer's financial condition, generally without requiring collateral. Exposure to losses on receivables is principally dependent on each customer's financial condition. The Company monitors its exposure for credit losses and maintains allowances for anticipated losses. Although the Company expects to collect amounts due, actual collections may differ from the estimated amounts. As of December 31, 2020, and 2019, the Company recorded a provision for doubtful accounts of $20,125 and $0, respectively.\nFor the years ended December 31, 2020 and 2019, no revenues from any one individual customer accounted for more than 10% of the total revenues. As of December 31, 2020, there was no customer that accounted for more than 10% of the accounts receivable balance, As of December 31, 2019, there was one customer that accounted for 39% of the accounts receivable balance.\nAdvanced Royalties\nAdvanced royalties represented amounts the Company had advanced to certain customers and were recoverable against future royalties earned by the customers. In connection with one of the Company’s advance royalties with a client, the Company guaranteed that shares of common stock would sell for at least $60.00 per share. If the shares are not at the required $60.00 per share when they are sold, the Company has the option of issuing additional shares at their fair value or making cash payments for the difference between the guaranteed price per share and the fair value of the stock. The change in fair value was ($3,688) for the year ended December 31, 2019. The Company would have disputed this obligation if demanded by the client; further, pursuing any action by the client was required to be filed within six years of the time of the original issuance and during the year ended December 31, 2019, the Company believed the time for pursuing an action expired. As a result of the expiration the Company eliminated this obligation from its consolidated balance sheet and recorded $880,553 in other income during the year ended December 31, 2019.\nProperty and Equipment\nProperty and equipment are stated at cost. Depreciation is computed using the straight-line method over the estimated useful lives of 3 to 8 years. Any leasehold improvements are depreciated at the lesser of the useful life of the asset or the lease term. Equipment purchased under capital leases is amortized on a straight-line basis over the estimated useful life of the asset or the term of the lease, whichever is shorter. Expenditures for repairs and maintenance are charged to expense as incurred.\nRight of Use Assets\nA right-of-use asset represents a lessee’s right to use a leased asset for the term of the lease. Our right-of-use assets generally consist of an operating lease for a building.\nRight-of-use assets are measured initially at the present value of the lease payments, plus any lease payments made before a lease began and any initial direct costs, such as commissions paid to obtain a lease.\nRight-of-use assets are subsequently measured at the present value of the remaining lease payments, adjusted for incentives, prepaid or accrued rent, and any initial direct costs not yet expensed.\nIntangible Assets\nIntangible assets consist of patents, client lists, trade names, customer relationships, brewery and distillery management software and shipping label generation technology which are being amortized on a straight-line basis over their estimated useful lives. Currently the intangible assets are being amortized between two and 17 years.\nLong-Lived Assets\nThe Company reviews the carrying values of its long-lived assets for possible impairment whenever events or changes in circumstances indicate that the carrying amount may not be recoverable. If the expected future cash flows from the use of the asset and its eventual disposition is less than the carrying amount of the asset, an impairment loss is recognized and measured using the fair value of the related asset. No impairment charges were recognized during the years ended December 31, 2020 and 2019. There can be no assurance, however, that market conditions will not change or demand for the Company’s services will continue, which could result in impairment of long-lived assets in the future.\nRevenue Recognition\nThe Company generates revenues principally from fees for coordinating shipping services, sales of shipping calculator subscriptions, brewery management software subscriptions, merchant processing services and client services (see Note 4).\nCost of Revenues\nCost of revenues includes carrier services, web hosting, data storage, and commissions, carrier insurance costs and merchant processing interchange fees.\nOperating Expenses\nOperating expenses include indirect expenses, including credit card processing fees, marketing, payroll, travel, facility costs, amortization of intangible assets and other general and administrative expenses.\nAdvertising\nAdvertising costs are charged to expense as incurred. For the years ended December 31, 2020 and 2019, advertising expense totaled $104,121 and $165,941, respectively, and are included in general and administrative expenses in the accompanying consolidated statements of operations and comprehensive income (loss).\nShare-Based Compensation\nThe Company grants options to purchase the Company’s common stock to employees, directors and consultants under stock option plans. The benefits provided under these plans are share-based payments that the Company accounts for using the fair value method. In addition, the Board of Directors approved an amendment to ShipTime’s December 30, 2016 Warrant Agreement with an entity controlled by the Company’s Interim CEO/CFO to reprice the outstanding warrants. The modification of the warrant resulted in a charge to the Company’s share-based compensation expense. In addition, during 2021, the Company's board of directors granted shares of common stock valued at the closing price on the date of the grant, for 2019 and 2020 bonuses and 2021 signing bonus to the Interim CEO/CFO (See Note 10 and Note 13).\nThe fair value of each option award is estimated on the date of grant using a Black-Scholes-Merton option pricing model (“Black-Scholes-Merton model”) that uses assumptions regarding a number of complex and subjective variables. These variables include, but are not limited to, expected stock price volatility, actual and projected employee stock option exercise behaviors, risk-free interest rate and expected dividends. Expected volatilities are based on the historical volatility of the Company’s common stock. The expected terms of options granted are based on analyses of historical employee termination rates and option exercises. The risk-free interest rate is based on the U.S. Treasury yield in effect at the time of the grant. Since the Company does not expect to pay dividends on common stock in the foreseeable future, it estimated the dividend yield to be 0%.\nShare-based compensation expense recognized during a period is based on the value of the portion of share-based payment awards that is ultimately expected to vest and is amortized under the straight-line attribution method. As share-based compensation expense recognized in the accompanying consolidated statements of operations and comprehensive income (loss) for the years ended December 31, 2020 and 2019 is based on awards ultimately expected to vest, it has been reduced for estimated forfeitures. The fair value method requires forfeitures to be estimated at the time of grant and revised, if necessary, in subsequent periods if actual forfeitures differ from those estimates. The Company estimates forfeitures based on historical experience. Changes to the estimated forfeiture rate are accounted for as a cumulative effect of change in the period the change occurred.\nSince the Company has a net operating loss carry-forward as of December 31, 2020 and 2019, no excess tax benefits for tax deductions related to share-based awards were recognized from any stock options exercised in the years ended December 31, 2020 and 2019 that would have resulted in a reclassification from cash flows from operating activities to cash flows from financing activities.\nIncome Taxes\nThe Company accounts for income taxes and the related accounts under the liability method. Deferred tax assets and liabilities are determined based on the differences between the financial statement carrying amounts and the income tax bases of assets and liabilities. A valuation allowance is applied against any net deferred tax asset if, based on available evidence, it is more likely than not that some or all of the deferred tax assets will not be realized. Therefore, the Company has recorded a full valuation allowance against the net deferred tax assets. The Company’s income tax provision includes state minimum taxes.\nThe Company recognizes any uncertain income tax positions on income tax returns at the largest amount that is more-likely-than-not to be sustained upon audit by the relevant taxing authority. An uncertain income tax position will not be recognized if it has less than a 50% likelihood of being sustained. There are no unrecognized tax benefits included in the consolidated balance sheet that would, if recognized, affect the effective tax rate.\nThe Company’s policy is to recognize interest and/or penalties related to income tax matters in income tax expense. The Company had $0 accrued for interest and penalties on the Company’s consolidated balance sheets at December 31, 2020 and 2019.\nThe Company is subject to taxation in the U.S. and various state jurisdictions. The Company does not foresee material changes to its gross uncertain income tax position liability within the next twelve months.\nEarnings (Loss) Per Common Share\nBasic earnings (loss) per share represent income (loss) available to common stockholders divided by the weighted-average number of common shares outstanding during the period. Diluted earnings (loss) per share reflects additional common shares that would have been outstanding if dilutive potential common shares had been issued, as well as any adjustment to income (loss) that would result from the assumed issuance. The potential common shares that may be issued by the Company relate to outstanding stock options and have been excluded from the computation of diluted earnings (loss) per share because they would reduce the reported loss per share and therefore have an anti-dilutive effect.\nFor the year ended December 31, 2020, there were no dilutive shares that were included in the diluted earnings (loss) per share as their effect would have been anti-dilutive for the year then ended.\nThe Company computes its income (loss) available to common shareholders by subtracting dividends on preferred stock, including undeclared or unpaid dividends if cumulative, and any deemed dividends or discounts on redeemed preferred stock from its reported net income (loss) and reports the same on the face of the consolidated statements of operations and comprehensive income (loss).\nThe following is a reconciliation of the numerators and denominators of the basic and diluted earnings per share computations for the years ended December 31:\nNumerator:\n$(2,261,085)\n$90,006\nNet income (loss) available to common shareholders\nDenominator:\nBasic weighted-average shares outstanding\n5,469,908\n1,614,817\nEffect of dilutive securities\n-\n54,361\nDiluted weighted-average shares outstanding\n5,469,908\n1,669,178\nNet income (loss) per share attributed to common stockholders - basic\n$(0.41)\n$0.06\nNet income (loss) per share attributed to common stockholders - diluted\n$(0.41)\n$0.05\nSegment Reporting\nThe Company reports information about segments of its business in its annual consolidated financial statements and reports selected segment information in its quarterly reports issued to shareholders. The Company also reports on its entity-wide disclosures about the products and services it provides and reports revenues and its major customers. The Company’s five reportable segments are managed separately based on fundamental differences in their operations. At December 31, 2020, the Company operated in the following five reportable segments:\na)\nClient services;\nb)\nShipping calculator services;\nc)\nBrewery management software;\nd)\nMerchant processing services;\ne)\nShipping coordination and label generation services; and\nf)\nCorporate operations.\nThe Company evaluates performance and allocates resources based on operating income. The accounting policies of the reportable segments are the same as those described in this summary of significant accounting policies. The Company’s chief operating decision makers are the interim Chief Executive Officer and Chief Financial Officer.\nThe following table compares total revenues for the years indicated.\nYears Ended\nDecember 31,\nDecember 31,\nClient services\n$3,541\n$19,395\nBrewery management software\n114,881\n193,150\nShipping calculator services\n27,845\n148,035\nMerchant processing services\n425,839\n2,011\nShipping coordination and label generation services\n12,348,683\n10,185,704\nTotal revenues, net\n$12,920,789\n$10,548,295\nThe following table compares total income (loss) from operations for the years indicated.\nYears Ended\nDecember 31,\nDecember 31,\nClient services\n$2,775\n$14,739\nBrewery management software\n49,601\n51,612\nShipping calculator services\n6,274\n108,512\nMerchant processing services\n104,958\n(673)\nShipping coordination and label generation services\n679,130\n(100,771)\nCorporate operations\n(2,974,212)\n(785,452)\nTotal loss from operations\n$(2,131,474)\n$(712,033)\nDuring 2020, the Company recorded depreciation and amortization of $488,745 which was solely related to the shipping coordination and label generations service segment of the Company.\nRecent Accounting Pronouncements\nIn June 2016, the FASB issued ASU 2016-13, “Financial Instruments-Credit Losses: Measurement of Credit Losses on Financial Instruments”, which requires the measurement and recognition of expected credit losses for financial assets held at amortized cost. ASU 2016-13 replaces the existing incurred loss impairment model with a forward-looking expected credit loss model which will result in earlier recognition of credit losses. The Company’s adoption of ASU 2016-13 on January 1, 2020 had no impact on its consolidated financial position, results of operations, cash flows or disclosures.\nIn August 2018, the FASB issued ASU 2018-13, “Changes to Disclosure Requirements for Fair Value Measurements”, which improved the effectiveness of disclosure requirements for recurring and nonrecurring fair value measurements. The standard removes, modifies, and adds certain disclosure requirements. The Company’s adoption of ASU 2018-13 on January 1, 2020 had no impact on its consolidated financial position, results of operations, cash flows or disclosures.\nIn December 2019, the FASB issued ASU No. 2019-12, Income Taxes (Topic 740): “Simplifying the Accounting for Income Taxes” to identify, evaluate, and improve areas of GAAP for which costs and complexity can be reduced while maintaining or improving the usefulness of the information provided to users of financial statements. The amendments for ASU No. 2019-12 simplify the accounting for income taxes by removing certain exceptions to the general principles in Topic 740. The amendments also improve consistent application of and simplify GAAP for other areas of Topic 740 by clarifying and amending existing guidance. ASU No. 2019-12 is effective for fiscal years beginning after December 15, 2020, and interim periods within those fiscal years. Early adoption is permitted. An entity that elects to early adopt must adopt all the amendments in the same period. The Company is currently evaluating the impact of ASU No. 2019-12 and does not expect the adoption of this guidance to have a material impact on its consolidated financial position or results of operations.\nNOTE 4. REVENUE FROM CONTRACTS WITH CUSTOMERS\nIn accordance with current accounting guidance, the Company recognizes revenue by taking into consideration the following five steps: (1) identify the contract(s) with a customer; (2) identify the performance obligations in the contract; (3) determine the transaction price; (4) allocate the transaction price to the performance obligations in the contract; and (5) recognize revenue when (or as) the entity satisfies a performance obligation. Due to the nature of the Company’s product offerings and contracts associated with those products, the Company’s deliverables do not fluctuate and its revenue recognition is consistent.\nNature of Goods and Services\nFor label generation service revenues the Company recognizes revenue when a customer has successfully prepared a shipping label and had a pickup. The service is offered to consumers via an online registration and allows users to create a shipping label using a credit card on their account. ShipTime, in partnership with the Canadian Federation of Independent Businesses (“CFIB”), offered a cash rebate to its customers. Revenues were recognized net of the cash rebates, which were held in “funds held in trust” account in the accompanying consolidated balance sheets. The cash rebates were available for twelve months for future use. Rebate revenue was recognized when the rebate was used.\nBeginning in 2018, customers were offered airline miles as a reward in lieu of a cash rebate. As a result, the CFIB allowed the Company to release the funds held in trust for unused customer rebates back to cash and cash equivalents. As the Company transitioned from cash rebates to airline mile rewards, customers were allowed to convert their existing cash rebate balances to airline miles at the rate of 10 miles per $1 of rebates. For the year ended December 31, 2019, the Company recognized $8,066 of other income related to the conversion of airline miles as the cost was less than the value of the cash rebated exchanged. In December 2019, the Company recognized $95,500 of other income related to the expiration of the cash rebates. Unused airline miles are recorded in prepaid expenses and other current assets in the accompanying consolidated balance sheets. During the second quarter of 2019 the prepaid miles purchased to be awarded to customers were scheduled to expire. Aeroplan granted permission for a one-time transfer of the balance of the prepaid miles to the Company’s Aeroplan account. As a result, the Company recorded an expense in the amount of $32,102 for the year ended December 31, 2019.\nFor shipping calculator revenues and brewery management software revenues, the Company recognizes subscription revenue on a monthly basis. Shipping calculator customers’ renewal dates are based on their date of installation and registration of the shipping calculator line of products. The timing of the revenue recognition and cash collection may vary within a given quarter and the deposits for future services are recorded as contract liabilities on the consolidated balance sheets. Brewery management software subscribers are billed monthly at the first of the month. All payments are made via credit card for the month following.\nMerchant processing revenue consists of fees a seller pays us to process their payment transactions and is recognized upon authorization of a transaction. Revenue is recognized net of estimated refunds, which are reversals of transactions initiated by sellers. We act as the merchant of record for our sellers, which puts us in their shoes with respect to card networks and puts the risk for refunds and chargebacks on us. The gross transaction fees collected from sellers is recognized as revenue as we are the primary obligor to the seller and are responsible for processing the payment, have latitude in establishing pricing with respect to the sellers and other terms of service, have sole discretion in selecting the third party to perform the settlement, and assume the credit risk for the transaction processed.\nRevenue Disaggregation\nThe Company operates in five reportable segments (see Note 3).\nPerformance Obligations\nAt contract inception, an assessment of the goods and services promised in the contracts with customers is performed and a performance obligation is identified for each distinct promise to transfer to the customer a good or service (or bundle of goods or services). To identify the performance obligations, the Company considers all of the goods or services promised in the contract regardless of whether they are explicitly stated or are implied by customary business practices. Revenue is recognized when the performance obligation has been met, which is when the customer has successfully prepared a shipping label and had a pickup for shipping coordination and label generation services. The Company considers control to have transferred at that time because the Company has a present right to payment at that time, the Company has provided the shipping label, and the customer is able to direct the use of, and obtain substantially all of the remaining benefits from the shipping label.\nFor arrangements under which the Company provides a subscription for shipping calculator services and brewery management software, the Company satisfies its performance obligations over the life of the subscription, typically twelve months or less.\nMerchant processing customers receive a merchant identification number which allows them to process credit card transactions. Once the transaction is approved, the funds are distributed in an overnight feed and the Company has met its performance obligation.\nThe Company has no shipping and handling activities related to contracts with customers.\nRevenues are recognized net of any taxes collected from customers, which are subsequently remitted to government authorities.\nSignificant Payment Terms\nPursuant to the Company’s contracts with its customers, amounts are collected up front primarily through credit/debit card transactions. Accordingly, the Company determined that its contracts with customers do not include extended payment terms or a significant financing component.\nVariable Consideration\nIn some cases, the nature of the Company’s contracts may give rise to variable consideration, including rebates and cancellations or other similar items that generally decrease the transaction price.\nVariable consideration is estimated at the most likely amount that is expected to be earned. Estimated amounts are included in the transaction price to the extent it is probable that a significant reversal of cumulative revenue recognized will not occur when the uncertainty associated with the variable consideration is resolved. Estimates of variable consideration and determination of whether to include estimated amounts in the transaction price are based largely on an assessment of the anticipated performance and all information (historical, current and forecasted) that is reasonably available.\nRevenues are recorded net of variable consideration, such as rebates, refunds and cancellations.\nWarranties\nThe Company’s products and services are provided on an “as is” basis and no warranties are included in the contracts with customers. Also, the Company does not offer separately priced extended warranty or product maintenance contracts.\nContract Assets\nTypically, the Company has already collected revenue from the customer at the time it has satisfied its performance obligation. Accordingly, the Company has only a small balance of accounts receivable, totaling $171,785 and $131,561 at December 31, 2020 and 2019, respectively. Generally, the Company does not have material amounts of contract assets since revenue is recognized as control of goods is transferred or as services are performed.\nContract Liabilities (Deferred Revenue)\nContract liabilities are recorded when cash payments are received in advance of the Company’s performance (including rebates). Contract liabilities were $9,046 and $5,338 at December 31, 2020 and 2019, respectively. During the years ended December 31, 2020 and 2019, the Company recognized revenues of $5,338 and $40,152, respectively, related to contract liabilities outstanding at the beginning of each year.\nNOTE 5. PROPERTY AND EQUIPMENT\nAt December 31, property and equipment consisted of the following:\nComputer equipment and software\n$139,551\n$139,328\nOffice furniture and equipment\n70,348\n69,343\nWebsite development costs\n402,306\n400,866\n612,205\n609,537\nAccumulated depreciation\n(552,357)\n(519,830)\n$59,848\n$89,707\nDepreciation expense of property and equipment for the years ended December 31, 2020 and 2019 amounted to $29,830 and $26,814, respectively.\nNOTE 6. INTANGIBLE ASSETS\nThe Company holds several patents for the real-time calculation of shipping costs for items purchased through online auctions using a zip code as a destination location indicator. It includes shipping charge calculations across multiple carriers and accounts for additional characteristics of the item being shipped, such as weight, special packaging or handling, and insurance costs. These patents help facilitate rapid and accurate estimation of shipping costs across multiple shipping carriers and also include real-time calculation of shipping.\nIn addition, the Company has various intangible assets from past business combinations.\nAt December 31 2020, intangible assets consisted of the following:\nPatents\nTrade Name\nTechnology & Software\nCustomer Relationships\nTotal\nGross carrying amount\n$16,000\n$839,816\n$620,094\n$4,928,102\n$6,404,012\nAccumulated amortization\n(16,000)\n(668,929)\n(620,094)\n(1,465,569)\n(2,770,592)\n$-\n$170,887\n$-\n$3,462,533\n$3,633,420\nAt December 31, 2019, intangible assets consisted of the following:\nPatents\nTrade Name\nTechnology & Software\nCustomer Relationships\nTotal\nGross carrying amount\n$16,000\n$826,098\n$611,333\n$4,851,093\n$6,304,524\nAccumulated amortization\n(16,000)\n(492,783)\n(611,333)\n(1,135,836)\n(2,255,952)\n$-\n$333,315\n$-\n$3,715,257\n$4,048,572\nAmortization expense of intangible assets for the years ended December 31, 2020 and 2019 was $458,915 and $463,436, respectively.\nAmortization of intangible assets for the next five years ending December 31 are as follows:\nYear Ended December 31,\n482,236\n314,279\n314,279\n314,279\n314,279\nTotal 5 year amortization\n$1,739,352\nNOTE 7. ACCRUED EXPENSES\nAt December 31, accrued expenses consist of the following:\nPayroll and related costs\n$25,319\n$1,797\nProfessional and consulting fees\n-\nRoyalties\n47,803\n47,803\nAccrued cost of revenues\n170,928\n114,455\nSales tax\n31,902\n31,902\nOther\n10,869\nTotal\n$276,254\n$207,786\nNOTE 8. NOTE PAYABLE\nIn August 2018, the Company entered into a note payable with a shareholder to repurchase common and preferred shares. The note was an interest-free, six-month note for CAD $122,400 with payment terms of six equal installments of CAD $20,400. This note was paid in full in the first quarter of 2019.\nNOTE 9. COMMITMENTS AND CONTINGENCIES\nLegal Matters\nIn the normal course of business, the Company periodically becomes involved in litigation and disputes. During 2020, the Company was notified of a dispute related to its non-renewal of the employment agreement with Mr. Allan Pratt, the Company's former CEO, in which Mr. Pratt appears to be treating it as a termination which would trigger a two-year severance payment. As of December 31, 2020, in the opinion of management, the Company had no pending litigation and disputes that would have a material adverse effect on the Company's consolidated financial position, results of operations, or cash flows.\nIndemnities and Guarantees\nThe Company has made certain indemnities and guarantees, under which it may be required to make payments to a guaranteed or indemnified party, in relation to certain actions or transactions. The Company indemnifies its directors, officers, employees and agents, as permitted under the laws of the State of Delaware. In connection with its facility lease, the Company has agreed to indemnify its lessor for certain claims arising from the use of the facilities. The duration of the guarantees and indemnities varies, and is generally tied to the life of the agreement. These guarantees and indemnities do not provide for any limitation of the maximum potential future payments the Company could be obligated to make. Historically, the Company has not been obligated nor incurred any payments for these obligations and, therefore, no liabilities have been recorded for these indemnities and guarantees in the accompanying consolidated balance sheets.\nNOTE 10. SHAREHOLDERS’ EQUITY\nPreferred Stock\nThe Company’s amended Certificate of Incorporation authorizes the issuance of 20,000,000 shares of blank-check preferred stock at $0.001 par value. The Board of Directors will be authorized to fix the designations, rights, preferences, powers and limitations of each series of the preferred stock.\nThe Company filed a Certificate of Designations effective on December 30, 2016 which sets aside 5,000,000 shares of Preferred Stock as Series A Preferred Stock. The Series A Preferred Stock carries a coupon payment obligation of 1.5% of the liquidation value per share ($3.03) per year in cash or additional Series A Preferred Stock, calculated by taking the 30-day average closing price for a share of common stock for the month immediately preceding the coupon payment date which is made annually. For the years ended December 31, 2020 and 2019, the annual coupon is $28,532 and $192,005, respectively. The Series A Preferred Stock has no voting or conversion rights. If purchased, redeemed, or otherwise acquired (other than conversion), the preferred stock may be reissued. In April 2019, the Company paid the annual coupon for the year ended December 31, 2017. The Company paid the 2018 and 2019 coupon payments totaling $358,638 by issuing 126,727 preferred shares and a cash payment of $26,252 for the 2020 coupon payment through March 2020. During 2019, the Board of Directors satisfied 2018 accrued executive compensation by means of issuance of 653,866 preferred shares valued at $83,221. In 2020, all 4,565,305 shares of Series A Preferred Stock were exchanged for common stock (see below). As of December 31, 2020, there are no outstanding shares of Series A Preferred Stock.\nCommon Stock\nIn February 2020, ShipTime Canada amended its rights to exchange one share of ShipTime Canada stock from 45 PAID common shares and 311 PAID preferred shares to 356 PAID common shares. The Company made available to its ShipTime Canada exchangeable preferred shareholders the one-time option to convert existing book entry preferred shares and exchangeable rights to preferred shares into PAID common shares. As a result, certain ShipTime exchangeable shareholders exercised their rights to receive 1,461,078 shares of PAID Series A Preferred Stock for 1,461,078 shares of PAID common stock. At the same time, the Company made available to its Series A Preferred Stock shareholder the option to exchange existing Series A preferred shares for PAID common shares. The exchange was offered on a one-to-one basis. Shareholders holding 1,015,851 shares of Series A Preferred Stock exchanged such shares for 1,015,851 shares of PAID common stock. Furthermore, because of the amended exchange rights, the Company reflected an additional exchange of PAID Series A Preferred Stock shares totaling 2,089,298 to PAID common shares, representing the additional amount of PAID common shares that will be issued to the ShipTime shareholders upon the exchange. During 2020, two shareholders sold 500 ShipTime exchangeable shares which were subsequently exchanged for 178,000 common shares. In total, the Company has reserved for future issuance of 2,213,608 shares of PAID common stock with respect to the remaining 6,218 exchangeable shares to be issued as a result of the ShipTime acquisition which are considered issued and outstanding as of December 31, 2020 for financial reporting purposes.\nDuring 2020, the Company issued 274,120 shares of PAID common stock as a result of the exercise of an investor warrant for 770 ShipTime exchangeable shares. The Company received gross proceeds of $35,636 in connection with the warrant exercise. On March 29, 2021, the Company's Board of Directors authorized the issuance of 1,050,000 bonus shares of PAID common stock to the interim CEO/CFO for services rendered during 2019 and 2020. This bonus was valued at $2,005,500 based on the closing price of the Company's common stock at March 29, 2021 and is recorded in accrued common stock bonus in shareholders’ equity at December 31, 2020. These shares were issued in March 2021.\nShare-Based Incentive Plans\nDuring the years ended December 31, 2020 and 2019, the Company had four stock option plans that include both incentive and non-qualified options to be granted to certain eligible employees, non-employee directors, or consultants of the Company.\nOn March 23, 2018, the Board of Directors voted to approve the 2018 Stock Option Plan which reserves 450,000 non-qualified stock options to be granted to employees. On November 10, 2020 the board voted to increase the 2018 Stock Option Plan from 450,000 options to 900,000 options. The Company granted 136,020 stock options to employees and consultants during the year ended December 31, 2019. For the year ended December 31, 2020, the Company granted 105,000 stock options to employees, consultants and directors. The 2020 options have vesting periods of immediately and over a three-year period, they expire if not exercised within ten years from grant date, and the exercise price is $2.885 per share. During 2020, as a result of the termination of several employees, the Company recorded 61,948 expired options and an additional 20,459 that were cancelled.\nActive Plans:\n2018 Plan\nOn March 23, 2018, the Company adopted the 2018 Non-Qualified Stock Option Plan (the \"2018 Plan\"). The purpose of the 2018 Plan is to provide long-term incentives and rewards to those employees of the Company, and any other individuals, whether directors, consultants or advisors who are in a position to contribute to the long-term success and growth of the Company. The options granted have a 10-year contractual term and have a vesting period that ranges from one hundred percent on the date of grant to fully vest over a two-year period. There are currently 591,210 shares reserved for future issuance under this plan. Information with respect to stock options granted under this plan during the year ended December 31, 2020 is as follows:\nNumber of shares\nWeighted average exercise price per share\nOptions outstanding at January 1, 2020\n286,197\n$3.50\nGranted\n105,000\n2.89\nCancelled/Expired\n(82,407)\n3.68\nExercised\n-\n-\nOptions outstanding at December 31, 2020\n308,790\n$3.24\n2012 Plan\nOn October 15, 2012, the Company adopted the 2012 Non-Qualified Stock Option Plan (the \"2012 Plan\"). The purpose of the 2012 Plan is to provide long-term incentives and rewards to those employees of the Company, and any other individuals, whether directors, consultants or advisors who are in a position to contribute to the long-term success and growth of the Company. The options granted have a 10-year contractual term and vest one hundred percent on the date of grant. There are no shares reserved for future issuance under this plan. Information with respect to stock options granted under this plan during the year ended December 31, 2020 is as follows:\nNumber of shares\nWeighted average exercise price per share\nOptions outstanding at January 1, 2020\n36,000\n$0.98\nGranted\n-\n-\nCancelled\n-\n-\nExercised\n-\n-\nOptions outstanding at December 31, 2020\n36,000\n$0.98\n2011 Plan\nOn February 1, 2011, the Company adopted the 2011 Non-Qualified Stock Option Plan (the \"2011 Plan\"). Under the 2011 Plan, employees and consultants may elect to receive their gross compensation in the form of options, exercisable at $0.98 per share, to acquire the number of shares of the Company's common stock equal to their gross compensation divided by the fair value of the stock on the date of grant. The options granted have a 10-year contractual term and have vesting periods that range from one hundred percent on the date of grant to one-third immediately, one-third vesting in 18 months and the final one-third vesting in 36 months from the date of the grant. There are no shares reserved for issuance under this plan. Information with respect to stock options granted under this plan during the year ended December 31, 2020 is as follows:\nNumber of shares\nWeighted average exercise price per share\nOptions outstanding at January 1, 2020\n43,000\n$3.00\nGranted\n-\n-\nCancelled\n-\n-\nExercised\n-\n-\nOptions outstanding at December 31, 2020\n43,000\n$3.00\n2002 Plan\nThe 2002 Stock Option Plan (“2002 Plan”) provides for the award of qualified and non-qualified options for up to 60,000 shares. The options granted have a ten-year contractual term and have a vesting schedule of either immediately, two years, or four years from the date of grant. There are no shares reserved for issuance under this plan. Information with respect to stock options granted under this plan during the year ended December 31, 2020 is as follows:\nNumber of shares\nWeighted average exercise price per share\nOptions outstanding at January 1, 2020\n16,000\n$23.33\nGranted\n-\n-\nCancelled\n-\n-\nExercised\n-\n-\nOptions outstanding at December 31, 2020\n16,000\n$23.33\nFair value of issuances\nThe fair value of the Company's option grants under the 2018, 2012, 2011, and 2002 Plans was estimated at the date of grant using the Black-Scholes-Merton model with the following weighted average assumptions:\nExpected term (based upon historical experience)\n5.0-5.8 years\n5.0 years\nExpected volatility\n143 - 159%\n178-180%\nExpected dividends\nNone\nNone\nRisk free interest rate\n0.46%\n2.05 - 2.4%\nFor the years ended December 31, 2020 and 2019, the Company recorded total share-based compensation expense related to accrued common stock bonus and stock options of $2,133,808 and $407,974, respectively, which is recorded in share-based compensation expenses in the accompanying consolidated statements of operations and comprehensive income (loss).\nThe Company has unrecognized share-based compensation expense of $178,349 for options outstanding as of December 31, 2020 which will be recognized over the weighted average period of approximately three years.\nInformation pertaining to options outstanding and exercisable at December 31, 2020 is as follows:\nOptions Outstanding\nOptions Exercisable\nExercise Prices\nNumber of shares\nWeighted Average Remaining contractual Life (In Years)\nNumber of shares\nWeighted Average Remaining contractual Life (In Years)\n$0.98\n52,500\n2.93\n52,500\n2.93\n$2.89\n105,000\n9.87\n51,667\n9.87\n$2.92\n52,500\n8.13\n47,500\n8.13\n$3.00\n65,000\n8.62\n46,667\n8.62\n$3.30\n37,500\n6.75\n37,500\n6.75\n$3.50\n7,590\n7.76\n7,590\n7.76\n$4.10\n78,700\n7.23\n78,700\n7.23\n$72.50\n5,000\n0.86\n5,000\n0.86\n403,790\n7.58\n327,124\n7.14\nSummary of all stock option plans activity during the year ended December 31, 2020 is as follows:\nNumber of Shares\nWeighted Average Price\nWeighted Average Remaining Contractual Life (In Years)\nAggregate Intrinsic Value\nOptions outstanding at January 1, 2020\n381,197\n$4.03\nGranted\n105,000\n2.89\nCancelled/Expired\n(82,407)\n3.68\nExercised\n-\n-\nOptions outstanding and expected to vest at December 31, 2020\n403,790\n$3.81\n7.58\n$57,488\nOptions exercisable at December 31, 2020\n327,124\n$4.02\n7.14\n$57,488\nThe aggregate intrinsic value of options is calculated as the difference between the exercise price of options and the fair value of the Company’s common stock.\nWarrants\nFrom time to time, the Company issues warrants to purchase shares of the Company’s common stock to investors, note holders and to non-employees for services rendered or to be rendered in the future. On August 14, 2020, the Board of Directors approved an amendment to ShipTime’s December 30, 2016 Warrant Agreement with an entity controlled by the Company’s Interim CEO/CFO to reprice the outstanding warrants. The modification of the warrant resulted in a charge to the Company’s share-based compensation expense of $318,893. As of December 31, 2020, there were no outstanding warrants.\nNOTE 11. INCOME TAXES\nThe Company’s income (loss) before taxes includes the following components for the years ended December 31:\nU.S.\n$(2,537,388)\n$277,014\nForeign\n427,042\n2,793\n$(2,110,346)\n$279,807\nThe Company is subject to taxation in the U.S., Canada, and Massachusetts. The provision (benefit) for income taxes for the years ended December 31 are summarized below:\nCurrent:\nFederal\n$-\n$-\nState\nForeign\n250,711\n62,135\nTotal current\n251,211\n62,591\nDeferred:\nFederal\n-\n-\nState\n-\n-\nForeign\n(129,004)\n(64,795)\nTotal deferred\n(129,004)\n(64,795)\nIncome tax provision (benefit)\n$122,207\n$(2,204)\nA reconciliation of income taxes computed by applying the statutory U.S. income tax rate to the Company’s income (loss) before income tax provision (benefit) to the income tax provision (benefit) is as follows for the years ended December 31:\nU.S. federal statutory tax rate\n21.00%\n21.00%\nState tax benefit, net\n7.52%\n7.62%\nStock compensation\n(5.16)%\n8.79%\nAttributes expiration\n(38.04)%\n114.46%\nOther\n(0.85)%\n1.82%\nValuation allowance\n9.75%\n(154.66)%\nEffective income tax rate\n(5.78)%\n(0.97)%\nDeferred tax assets and liabilities reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. Significant components of the Company’s deferred tax assets are as follows as of December 31:\nDeferred taxes:\nNOLs\n$9,456,605\n$10,155,715\nInventory and other reserves\n24,128\n-\nStock based compensation expense\n853,239\n380,544\nLease liability\n25,151\n32,576\nAccruals\n1,892\n-\nOther\nTotal deferred tax assets\n10,361,111\n10,568,931\nDepreciation and amortization\n(908,380)\n(1,012,528)\nRight-of-use assets\n(24,767)\n(31,929)\nValuation allowance\n(10,388,911)\n(10,594,663)\nNet deferred tax liabilities\n$(960,947)\n$(1,070,189)\nRealization of deferred tax assets is dependent upon future earnings, if any, the timing and amount of which are uncertain. Accordingly, the net deferred tax assets have been fully offset by a valuation allowance. The reduction in the valuation allowance is approximately $206,000 and $432,000 in 2020 and 2019, respectively.\nAs of December 31, 2020, the Company had net operating loss carryforwards for federal income tax purposes of approximately $41,093,000. Of the total amount approximately $494,000 were generated after January 1, 2018, and therefore will not expire but can only be used to offset 80 percent of future taxable income. The remaining amount of approximately $40,599,000 expire beginning in the year 2021. As of December 31, 2020, the Company had net operating loss carryforwards for state income tax purposes of approximately $12,559,000 which expire beginning in the year 2030.\nUtilization of the net operating losses may be subject to substantial annual limitation due to federal and state ownership change limitation provided by the Internal Revenue Code and similar state provisions. Such annual limitations could result in the expiration of the net operating losses and credits before their utilization. The Company has not performed an analysis to determine the limitation of the net operating loss carryforwards.\nA valuation allowance of 100% has been established in respect of the deferred income tax assets due to the uncertainty of the Company’s utilization of such deferred tax assets for the U.S. federal and state on each of the Company’s consolidated balance sheets at December 31, 2020 and 2019.\nThe income tax provision at December 31, 2020 reflects a full accounting of tax filings under ASC Subtopic 740-10. Paid, Inc. is subject to U.S. federal and Massachusetts state tax. With limited exceptions, the Company is no longer subject to U.S. federal, state and local income tax examinations by tax authorities for years before 2017. Generally, the tax years remain open for examination by the Federal authority under three-year statute of limitation; however, states generally keep their statute open for four years. In addition, the Company's tax years from inception are subject to limited examination by the United States and Massachusetts authorities due to the carry forward of unutilized net operating losses. ShipTime is subject to taxation in Canada and Ontario. The Company recognizes interest and penalties, as estimated or incurred, as general and administrative expense.\nOn March 27, 2020, the Coronavirus Aid, Relief, and Economic Security Act (CARES Act) was enacted in response to the COVID-19 pandemic. The CARES Act, among other things, permits NOL carryovers and carrybacks to offset 100% of taxable income for taxable years beginning before 2021. In addition, the CARES Act allows NOLs incurred in 2018, 2019, and 2020 to be carried back to each of the five preceding taxable years to generate a refund of previously paid income taxes. Due to the Company's history of net operating losses, the CARES Act is not expected to have a material impact on the Company's financial statements.\nOn December 27, 2020, the United States enacted the Consolidated Appropriations Act of 2021 (“CAA”). The CAA includes provisions extending certain CARES Act provisions and adds coronavirus relief, tax and health extenders. The Company will continue to evaluate the impact of the CAA and its impact on our financial statements in 2021 and beyond.\nNOTE 12. Leases\nWe have an operating lease for our corporate offices in Canada and finance leases for furniture and equipment. Our leases have remaining lease terms of six months to thirty-two months, and our primary operating leases include options to extend the leases for four years. Future renewal options that are not likely to be executed as of the balance sheet date are excluded from right-of-use assets and related lease liabilities.\nWe report operating leased assets, as well as operating lease current and noncurrent obligations on our consolidated balance sheets for the right to use the building in our business. Our finance leases represent furniture and office equipment; we report the furniture and equipment, as well as finance lease current and noncurrent obligations on our consolidated balance sheets.\nGenerally, interest rates are stated in our leases for equipment. When no interest rate is stated in a lease, however, we review the interest rates implicit in our recent finance leases to estimate our incremental borrowing rate. We determine the rate implicit in a lease by using the most recent finance lease rate, or other method we think most closely represents our incremental borrowing rate.\nThe components of lease expense for the years ended December 31, were as follows:\nOperating lease cost\n$38,163\n$31,009\nFinance lease cost:\nAmortization of leased assets\n$10,813\n$10,636\nInterest on lease liabilities\n1,669\nTotal finance lease cost\n$11,645\n$12,305\nSupplemental cash flow information related to leases for the years ended December 31, was as follows:\nCash paid for amounts included in leases:\nOperating cash flows from operating leases\n$39,583\n$30,960\nOperating cash flows from finance leases\n$832\n$1,669\nFinancing cash flows from finance leases\n$9,627\n$8,821\nRight-of-use assets obtained in exchange for lease obligations:\nOperating leases\n$-\n$55,600\nFinance leases\n$-\n$-\nSupplemental balance sheet information related to leases was as follows:\nDecember 31,\nOperating leases:\nOperating lease right-of-use assets\n$93,457\nCurrent portion of operating lease obligations\n$33,118\nOperating lease obligations, net of current portion\n61,794\nTotal operating lease liabilities\n$94,912\nFinance leases:\nProperty and equipment, at cost\n$54,066\nAccumulated depreciation\n(48,659)\nProperty and equipment, net\n$5,407\nCurrent portion of finance lease obligations\n$2,844\nFinance lease obligations, net of current portion\n-\nTotal finance lease liabilities\n$2,844\nYear Ended December 31, 2020\nWeighted Average Remaining Lease Term\nOperating lease\n2.6 years\nFinance leases\n0.3 years\nWeighted Average Discount Rate\nOperating lease\n9.0%\nFinance leases\n9.7%\nUpon adoption of the new lease standard, discount rates used for existing leases were established at January 1, 2019.\nA summary of future minimum payments under non-cancellable operating lease commitment as of December 31, 2020 is as follows:\nYears ending December 31,\nTotal\n$40,869\n40,869\n25,274\nTotal lease liabilities\n107,012\nLess amount representing interest\n(12,100)\nTotal\n94,912\nLess current portion\n(33,118)\n$61,794\nThe following is a schedule of minimum future rentals on the non-cancelable finance leases as of December 31, 2020:\nYear ending December 31,\nTotal\n$2,919\nTotal minimum payments required:\n2,919\nLess amount representing interest:\n(75)\nPresent value of net minimum lease payments:\n2,844\nLess current portion\n(2,844)\n$-\nNOTE 13. SUBSEQUENT EVENTS\nOn March 29, 2021, the Board of Directors approved the issuance of 250,000 shares of PAID common stock valued at $1.91 per share to W. Austin Lewis IV as it relates to his 2021 employment agreement, of which 125,000 of the shares are subject to repurchase at the award value of $1.91 per share if Mr. Lewis terminates employment prior to January 1, 2022, as defined in the employment agreement. Total shares issued of PAID common stock to Mr. Lewis on March 29, 2021 were 1,300,000 (see Note 10).\nThe Company has evaluated subsequent events through the filing of this Annual Report on Form 10-K, and determined that there have been no events that have occurred that would require adjustment to or additional disclosure in the consolidated financial statements, except as disclosed herein.\nEXHIBIT INDEX\nNo.\nDescription of Exhibits\n3.1\nCertificate of Incorporation, as amended (incorporated by reference to Exhibit 3.1 to Form 8-K, filed on November 25, 2003)\n3.2\nAmended and Restated Bylaws (incorporated by reference to Exhibit 3.2 to Form 8-K, filed on December 8, 2004)\n3.3\nCertificates of Amendment of Certificate of Incorporation of the Company effective December 30, 2016 (incorporated by reference to Exhibit 3.1 to Form 8-K filed on December 23, 2016)\n3.4\nAmendment No. 1 to Bylaws effective December 30, 2016 (incorporated by reference to Exhibit 3.2 to Form 8-K filed on December 23, 2016)\n4.1\nSpecimen of certificate for Common Stock (incorporated by reference to Exhibit 4.1 to Form SB-2/A filed on December 1, 2000)\n4.2\nAgreement dated November 21, 2008, by and between the Company and Lewis Asset Management Equity Fund, LLP with respect to the purchase of 2,500,000 shares at $.20 per share (incorporated by reference to Exhibit 4.2 to Form 10-KSB filed on March 31, 2009)\n4.3\nForm of Warrant to Lewis Asset Management with respect to Promissory Note dated April 29, 2009 (incorporated by reference to Exhibit 4.2 to Form 10-Q filed on May 12, 2009)\n10.1+\nNon-Qualified Stock Option Plan (incorporated by reference from Exhibit 10.17 to Form 10-KSB filed on March 31, 2003)\n10.2+\nNon-Qualified Stock Option Plan (incorporated by reference from Exhibit 99.1 to Form S-8 filed on February 2, 2011)\n10.3\nNon-Qualified Stock Option Plan (incorporated by reference from Exhibit 10.35 to Form 10-K filed on April 1, 2019 )\n10.4+\nPAID, Inc. 2012 Non-Qualified Stock Option Plan (incorporated by reference to Exhibit 10.1 to Form 10-Q filed on October 18, 2012)\n10.5+\nAgreement for Non-Qualified Stock Option under the PAID, Inc. 2012 Non-Qualified Stock Option Plan awarded to W. Austin Lewis, IV, dated October 15, 2012 (incorporated by reference to Exhibit 10.2 to Form 10-Q filed on October 18, 2012)\n10.6+\nAgreement for Non-Qualified Stock Option under the PAID, Inc. 2011 Non-Qualified Stock Option Plan awarded to W. Austin Lewis, IV, dated August 8, 2012 (incorporated by reference to Exhibit 10.3 to Form 10-Q filed on October 18, 2012)\n10.7\nAmalgamation Agreement dated September 1, 2016 by and among PAID, Inc., emergeIT, Inc., 2534845 Ontario Inc. and 2534841 Ontario Inc. (incorporated by reference to Exhibit 10.1 to Form 8-K filed on December 23, 2016)\n10.8\nExchange and Call Rights Agreement (incorporated by reference to Exhibit 10.2 to Form 8-K filed on December 23, 2016)\n10.9\nSupport Agreement (incorporated by reference to Exhibit 10.4 to Form 8-K filed on December 23, 2016)\n10.10+\nEmployment Agreement for Allan Pratt (incorporated by reference to Exhibit 10.6 to Form 8-K filed on December 23, 2016)\n10.11\nEmployment Agreement for W. Austin Lewis IV\n10.12\nNon-Compete Agreement for W. Austin Lewis IV\n31.1*\nCEO Certification required under Section 302 of Sarbanes-Oxley Act of\n31.2*\nCFO Certification required under Section 302 of Sarbanes-Oxley Act of\n32.0*\nCEO and CFO Certification required under Section 906 of Sarbanes-Oxley Act of 2002\nEX-101.INS\nXBRL Instance Document\nEX-101.SCH\nXBRL Taxonomy Extension Schema\nEX-101.CAL\nXBRL Taxonomy Extension Calculation Linkbase\nEX-101.DEF\nXBRL Taxonomy Extension Definition Linkbase\nEX-101.LAB\nXBRL Taxonomy Extension Label Linkbase\nEX-101.PRE\nXBRL Taxonomy Extension Presentation Linkbase\n*filed herewith\n+Indicates a management contract or any compensatory plan, contract or arrangement"
}