{
    "cik": "1019034",
    "company": "BIO KEY INTERNATIONAL INC",
    "filing_type": "10-K",
    "filing_date": "2021-03-29",
    "period_of_report": "2020-12-31",
    "sic": "3576",
    "state_of_inc": "DE",
    "state_location": "NJ",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1019034/0001437749-21-007486-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1019034/000143774921007486/bkyi20201231_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1019034/0001437749-21-007486.txt",
    "filename": "1019034_10K_2020_0001437749-21-007486.htm",
    "item_1": "ITEM 1. BUSINESS\nSolely for convenience, trademarks and tradenames referred to in this Annual Report on Form 10-K appear (after the first usage) without the ® and ™ symbols, but those references are not intended to indicate, in any way, that we will not assert, to the fullest extent under applicable law, our rights or that the applicable owner will not assert its rights, to these trademarks and tradenames.\nOverview\nBIO-key International, Inc. (the “Company,” “BIO-key,” “we,” or “us”) is a leading identity and access management (IAM) platform provider enabling secure work-from-anywhere for enterprise, education, and government customers. Our vision is to enable any organization to secure streamlined and passwordless workforce, customer, citizen and student access to any online service, workstation, or mobile application, without a requirement to use tokens or phones. Our products include PortalGuard® and PortalGuard Identity-as-a-Service (IDaaS) enterprise IAM, WEB-key® biometric civil and large-scale ID infrastructure, and high-quality, low-cost accessory hardware to provide a full and complete solution for identity-innovating customers.\nBIO-key PortalGuard empowers organizations to maximize the power of cloud, mobile and web technologies by securing users’ identities and connecting them with the applications they rely on, while keeping cyber-intruders and unauthorized delegates (proxy) out.\nMillions of users trust BIO-key® to secure access to a variety of cloud, mobile and web applications, on-premise and cloud-based hypervisor servers from all of their devices. Employees and contractors sign into BIO-key PortalGuard to seamlessly and securely access the applications of need to do their work, and customers sign into BIO-key PortalGuard to access online services. Organizations use PortalGuard to securely collaborate and communicate with their partners and to provide their customers with flexible, resilient user experiences online and while using mobile devices.\nBIO-key’s WEB-key is a scalable biometric service management platform, incorporating key functions for regulatory compliance, enrollment, authentication or identification, and integrity in a multi-tenant private or public cloud delivery platform. Government agencies use BIO-key for their large-scale civil ID projects, because WEB-key underpins a biometric identity ecosystem, is cloud-ready, and provides a scalable, high-integrity trust platform which can be operated anywhere and supports over 30 fingerprint scanners interchangeably.\nWe also deliver biometric software integration application programming interfaces, or APIs, allowing software developers to leverage our platform to securely and efficiently embed biometric multi-factor authentication, or MFA, into their own products. This allows software developers to focus on their core functionality while BIO-key ensures users enter the application without requiring they carry their phone or any token.\nEven the most security-focused organizations are suffering breaches as a result of human error or improper conduct. As enterprises scale the number of software as a service, or SaaS applications, and multi-cloud services they rely on and the interconnections between them increase, assured identity has emerged as a critical component of an organization’s security framework, directly affecting each triad of cybersecurity - confidentiality, integrity, and availability. As access perimeters dissolve, organizations must evolve from network-based security models to Zero Trust and Continuous Authentication and Risk Trust Assessment (CARTA) security models, focusing on adaptive and context-aware controls. True server-secured biometric verification removes the human nature vulnerability at the root of many security compromises creating a more reliable means to manage user access and protect digital assets against rogue users willing to hand over their credentials to a proxy. Our global identity as a service, or IDaaS, hosting capability allows our customers to simplify and efficiently scale their security infrastructures across internal IT systems and external customer facing applications without installation overhead, security or uptime management efforts.\nWe designed BIO-key PortalGuard IDaaS and WEB-key to provide organizations an integrated approach to managing and securing all of their identities using the technologies they already use while providing capacity for future needs through the strategic use of biometrics to limit vulnerability and contain authentication costs. Our platform allows users to authenticate their customers, employees, contractors, and partners. It enables any user to connect to any device, cloud or application, all with a simple, customizable, intuitive and consumer-friendly user experience. We utilize server-secured biometrics to support roving users without requiring them to carry their phone or a token. As of December 31, 2020, more than 300 customers across multiple industries use BIO-key to secure and manage access for users around the world.\nDevelopment of Business\nWe were founded in 1993 to develop and market advanced fingerprint biometric technology and related security software solutions. First incorporated as BBG Engineering, the company was renamed SAC Technologies in 1994 and renamed BIO-key International, Inc. in 2002. Our principal executive office is located at 3349 Highway 138, Building A, Suite E, Wall, New Jersey 07719.\nWe were pioneers in developing automated, finger identification technology that supplements or compliments other methods of identification and verification, such as personal inspection identification, passwords, tokens, smart cards, ID cards, credit card, passports, driver’s licenses, or other form of possession or knowledge-based credentialing. Our advanced technology has been, and is, used to improve both the accuracy and speed of competing fingerprint biometrics in some of the largest biometric systems in the world.\nOn June 30, 2020, we enhanced our product offering by acquiring PistolStar, Inc. (“PistolStar”) for $2.5 million. PistolStar provides enterprise-ready identity access management solutions to commercial, government and education customers throughout the United States and internationally. PistolStar develops and markets our PortalGuard line of software and services.\nOur Products\nBIO-key PortalGuard and PortalGuard IDaaS\nBIO-key PortalGuard is an independent, customer-controlled and neutral-by-design cloud-based identity platform that allows our customers to integrate with any cloud or on-premise SaaS application, service or cloud host, as well as Windows device authentication through a single secure, reliable and scalable IAM platform. It provides identical capabilities in both a SaaS (PortalGuard IDaaS) or on-premise (PortalGuard) delivery model. Our three-way IAM neutrality consists of:\n●\nfifteen MFA authentication factor choices, including our server-secured biometrics,\n●\nopen user directory choices including on premise, hybrid or full-Azure Active Directory, LDAP, IBM Domino, or custom SQL user directory; and\n●\nmultiple single sign on, or SSO, federation options, including SAML, OIDC, CAS and WS-Fed.\nThe forgoing allows our customers to combine and authenticate legacy and future technologies and to securely connect users to the technology that they choose. We design transparent compatibility of the BIO-key PortalGuard IDaaS with on-premise infrastructures and public and hybrid clouds.\nOur customers use the BIO-key PortalGuard IDaaS to secure their workforces and student populations and make their partner networks more collaborative. PortalGuard IDaaS provides more and secure experiences for their customers and end users, which enables our customers to future-proof their environments. PortalGuard IDaaS can be used as the central system for an organization’s connectivity, access, authentication and identity lifecycle management needs across all of its users, technology and applications. We enable our customers to easily deploy, manage and secure applications and devices, and offer provisioning services using open source tools.\nDevelopers can leverage an extensive suite of API and modular SDK tools to build custom cloud, mobile and web application enrollment and authentication experiences that leverage BIO-key PortalGuard and WEB-key as the underlying identity management platform. Once deployed, PortalGuard allows administrators to enforce contextual access management decisions based on conditions such as user identity, device, geolocation, application destination identity, IP range, and time of day.\nOur customers use BIO-key to (i) manage and secure work-related IT access of their employees, contractors and supply chain partners, which we call workforce identity; and (ii) manage and secure the identities of users of their web properties, which we call customer identity.\nBIO-key PortalGuard and PortalGuard IDaaS for Workforce Identity. PortalGuard streamlines the way an organization’s employees, contractors and supply chain partners connect to its applications and data from any device, while increasing user efficiency, preventing unauthorized delegation, credential sharing, and keeping digital environments secure through our MFA capabilities. We enable organizations to provide their workforces with immediate and secure access to every application from any device they use, without maintaining multiple credentials. Our multi-directory support interfaces with the directories in place at an organization, while allowing SQL-based custom directories where none presently exist. BIO-key PortalGuard Desktop allows customers to extend the BIO-key PortalGuard IDaaS to their existing on-premises and remote workstation Windows sign in.\nBIO-key PortalGuard and PortalGuard IDaaS for Customer Identity. BIO-key PortalGuard allows organizations to secure access to their online properties, while upgrading their customers’ user experience by delivering self-enrollment and management for customer-facing cloud, mobile or web applications. We enable an organization’s product team to layer BIO-key’s MFA, SSO and self-service password reset, or SSPR, functionality into their cloud, web and mobile applications through federation standards or using our APIs. Our customers are able to centrally manage policies, audit and log access across their properties, leading to more seamless customer experiences.\nBIO-key VST and WEB-key; Products; Civil and Large-Scale ID Infrastructure\nWe have developed what we believe is the most discriminating and effective commercially available finger-based biometric technology. This technology is embedded in our PortalGuard product for enterprise security, providing customers with a unique capability to authenticate users without a phone or token, where appropriate, such as manufacturing, retail, call centers, and health care workers. Other markets for scalable biometric engines include government markets, large scale identity projects such as voter’s registration, driver’s license, national ID programs, and SIM card registration.\nWe also offer a full line of easy to use finger scanners for both enterprise and consumer markets. Our SideSwipe®, EcoID® and SidePass® finger readers can be used on any laptop, tablet or other device which contains a USB A or C port. We market and sell these fingerprint scanners through distributors and directly to end users via Amazon.\nImpact of COVID-19\nThe COVID-19 outbreak has led us to migrate to a remote business model for our sales, marketing, administrative and executive teams. Research and development and production are adjusting to the new landscape to maintain production as best as possible considering the conditions and regulations. Our transition to remote work has been highly successful, and our teams operate efficiently using our own IAM software to authenticate video conferencing applications and other collaboration tools. The COVID-19 pandemic has extended sales cycles and delayed deployments in most markets in which we operate, particularly in Africa. We continue to conduct business daily and are actively closing transactions throughout the current climate, with no changes to personnel.\nMarkets\nIdentity Management, User Authentication, Privilege Entitlement and Access Control\nOur products simplify the authentication process for enterprise users and consumers, while raising security levels. This allows our customers to meet new, stronger authentication requirements and security best practices across many industries, while delivering a superior end-user experience. Customers use our products to reduce risk of theft, fraud, loss, account takeover attacks, and unauthorized account sharing by limiting access to valuable assets, privileges, data, services, networks and places to only authorized individuals. Our products provide stronger identity binding and a superior user experience versus traditional credentialing systems, which utilize a physical or knowledge-based electronic credential to authenticate the holder, but fail to authenticate the actual user in addition to the token. Both commercial enterprises and the public sector have seen a shift in the requirement for stronger authentication, and the FBI, NIST and industry thought leaders such as SalesForce and Microsoft have encouraged entities to enhance their security posture by implementing stronger 2-factor authentication (2FA) or MFA. We believe the market for advanced user MFA, including fingerprint biometrics, extends to nearly every industry segment and the market opportunity for our products is massive, global and growing.\nHistorically, our largest market has been access control within highly regulated industries like government and healthcare. However, we are witnessing a change in the landscape as organizations within all industries and of all sizes are embracing biometric technology and MFA as a security and workflow solution. Championed by the millions of users that have been successfully introduced to biometrics by companies such as Apple and Samsung, today’s users have witnessed the security and convenience benefits of biometric technology in their phones and welcome the same user experience to access applications without passwords.\nMore recently, in connection with the acquisition of PistolStar we have developed a large customer base in the higher education vertical. Colleges and universities throughout the United States use our PortalGuard single sign on platform. As colleges and universities continue to operate in remote environments, we have seen additional demand for our solutions.\nUpon introducing a series of compact fingerprint readers, we saw an immediate increase in inquiries from both commercial companies seeking an alternative to passwords, and from consumers recognizing that they could use SidePass, SideSwipe or EcoID to replace their Windows passwords and enable Windows Hello without replacing or upgrading laptops or tablets.\nIn October 2015, we established BIO-key Hong Kong for purposes of establishing relationships and conducting business is the Asia Pacific Region. Through our Hong Kong subsidiary, we support the growing demand for secure identification and authentication in the region.\nWe believe there is potential for significant market growth in the following key areas:\n●\nCorporate network access control, corporate campuses, computer networks, and applications.\n●\nLarge scale identification projects, especially in Africa and the surrounding regions.\n●\nGovernment funded initiatives, including the state board of elections.\n●\nInternational law enforcement use case applications as prospects see us as a global leader in the biometric technology space as witnessed by our agreement with the Israeli Defense Force, and the Singapore and Dubai Police departments.\n●\nConsumer mobile credentialing, including mobile payments, credit and payment card programs, data and application access, and commercial loyalty programs.\n●\nDemand for BIO-key hardware products from Windows 10 users and Fortune 500 companies.\n●\nGovernment services and highly regulated industries including, Medicare, Medicaid, Social Security, drivers licenses, campus and school ID, passports/visas.\n●\nThe Asia Pacific region.\n●\nNew remote authentication challenges, including those created by the COVID-19 pandemic.\nBusiness Model\nOur business model is focused on the following key areas:\nMarket\nDrivers\nThe frequent announcements of supply chain breaches, ransomware attacks, and administrative access compromises have highlighted the shortcomings of mainstream MFA and security approaches, which leave far too much responsibility on end-users to comply with cyber-hygiene policies. BIO-key biometrics remove the human error and human nature elements from the authentication process, while making the end user’s access easier than ever. The current climate of broad enterprise adoption of MFA to replace passwords, an ongoing upgrade cycle of Microsoft Windows 10, and accompanying moves to Windows Hello for Business, all present broad opportunities for us to leverage our unique differentiators and exploit the gaps in existing IAM technology approaches. One of those gaps is the challenge of authenticating users that “rove” among workstations. A second gap is preventing unauthorized account sharing and delegation.\nOEM\nCustomers\nWe will continue to prioritize securing agreements with OEM customers. The history of success supporting NCR, McKesson, Omnicell, and LexisNexis provides an established footprint that we intend to build upon. As OEM customers embed our solutions within their products, the customer benefits from the enhanced security and workflow, and frees them from investing in R&D to manage an IAM infrastructure of their own. OEM customers’ ordering patterns are more predictable and OEM customers generally require lower service and support resourcing.\nHighly\nRegulated\nIndustries\nGovernment ID projects and healthcare organizations, including hospitals, clinics, and small private practices present a strong opportunity for us. Additionally, the financial services industry, including banks and credit unions has grown substantially.\nPartner\nModel\nIn 2020, we took major steps to upgrade our partner program. We hired dedicated resources and announced the launch of a new Channel Alliance Partner program (CAP) focused on partnering with select value added resellers, integrators, and resellers.\nMicrosoft\nPartnership\nWe are a Microsoft Partner and our line of compact fingerprint scanners has been tested and qualified by Microsoft to support Windows Hello and Windows Hello for Business.\nHardware\nHardware products generated 16% of our revenue in 2020. EcoID has emerged as our most popular scanner for enterprise deployments. For customers that require the highest level of security, PIV-Pro is a FIPS complaint fingerprint scanner, suitable for highly regulated industries and organizations that want a best-in-class solution.\nWe have grown our business through a combination of organic growth and the strategic acquisition of PistolStar. We expect to continue to pursue strategic acquisitions of select businesses and assets in the IAM space. In furtherance of this strategy, we are active in the industry and regularly evaluate businesses that we believe will either provide an entry into new market verticals or be synergistic with our existing operations and in either case, be accretive to earnings. We cannot provide any assurance as to whether we will be able to complete any acquisition and if completed, successfully integrate any business we acquire into our operations. Please see the section captioned “RISK FACTORS” for additional information regarding acquisition risks.\nMarketing and Distribution\nWe sell our products directly through our field and inside sales teams, as well as indirectly through our network of channel partners. Through our CAP, we have partnered with more than 40 resellers, system integrators and other distribution partners. We are committed to aggressively growing this program in 2021.\nWe partner with leading application, managed service and infrastructure vendors, such as Ingram, D&H, Insight, NGEN, Amazon Web Services, UCROO Campus, Software House International (SHI), Virtual Graffiti, Atlassian, and ProCirrus.\nWe offer our software under a SaaS term license and generate annual recurring revenue (ARR) primarily by selling multi-year subscriptions to our software. We employ a customer success team, focused on customer satisfaction and early remediation.\nIn 2020, we announced that we had secured two of the largest contracts in our history, with our partner Technology Transfer Institute. The contracts, valued at a combined $75,000,000, are for large-scale identification projects in Nigeria. Under the first contract, we will provide biometric authentication to support the infrastructure of a new e-commerce project developed with the expectation to generate more than one million jobs in Nigeria. The second contract provides for BIO-key hardware and software to be used by a leading African telecommunications company to secure internal access to customer data. Currently Africa and the surrounding regions are receiving government funding to expand the use of biometric authentication solutions to help establish trustworthy government programs and reduce fraud. These historic opportunities are expected to showcase our ability to support large scale projects utilizing our core biometric authentication software engine, WEB-key and hardware to support large-scale enrollment and ID verification. We received our first purchase order under these contracts in the fourth quarter of 2020 which we expect to ship in the first half of 2021 upon receipt of prepayment of the order. The COVID-19 pandemic has and may continue to delay the rollout of these programs.\nIntellectual Property Rights\nWe develop and own significant intellectual property and believe that our intellectual property is fundamental to our biometric operation:\nPatents\nWe own patented technologies and trade secrets developed or acquired by us.\nIn May 2005, the U.S. Patent & Trademark Office issued patent 6,895,104 for our Vector Segment fingerprint technology (VST), our core biometric analysis and identification technology. With the payment of all maintenance fees, this patent will expire on March 4, 2023.\nOn October 3, 2006, we announced that our patent for a biometric authentication security framework had been granted by the U.S. Patent & Trademark Office. The patent No. 7,117,356 was issued to us for a biometric authentication security framework that enhances commercial and civil biometric use. Our authentication security framework protects privacy and security of cloud or network-based authentications while also facilitates ease of use of biometric systems. The technology that this patent is based on is the foundation for the authentication security incorporated in our WEB-key product line. WEB-key is a mature enterprise authentication solution that functions in a wide variety of application environments. The solution supports a variety of implementation alternatives including card technologies for “two-factor” authentication and also supports “single-factor” authentication. Partners and customers implementing our WEB-key software to provide convenient and secure user identity include a number of institutions including the Allscripts Healthcare Solutions, Computer Associates Site Minder, Oracle Access Manager and many other enterprise and solutions-based systems. With the payment of all maintenance fees, this patent will expire on May 20, 2023.\nOn December 26, 2006, we were issued US patent No. 7,155,040 covering our unique image processing technology, which is critical for enhancing information used in the extraction of biometric minutiae. The issued patent protects a critical part of an innovative four-phase image enhancement process developed by us. With the payment of all maintenance fees, this patent will expire on January 29, 2025.\nOn April 15, 2008, we were issued US patent No. 7,359,553 covering our image enhancement and data extraction core algorithm components. The solution protected under this patent provides the capability to quickly and accurately transform a fingerprint image into a computer image that can be analyzed to determine the critical data elements. With the payment of all maintenance fees, this patent will expire on January 3, 2025.\nOn August 19, 2008, we were issued US patent No. 7,415,605 for our “Biometric Identification Network Security” method. The solution protected under this patent provides a defense against hackers and system attacks, while leveraging the industry standard Trusted Platform Module (TPM) specification for encryption key management. With the payment of all maintenance fees, this patent will expire on May 20, 2023.\nOn November 18, 2008, we were issued US patent No. 7,454,624 for our “Match Template Protection within a Biometric Security System” method. The solution protected under this patent limits the scope of enrollment templates usage and also eliminates the need for revocation or encryption processes, which can be expensive and time consuming. With the payment of all maintenance fees, this patent will expire on May 17, 2025.\nOn March 10, 2009, we were issued US patent No. 7,502,938 for our “Trusted Biometric Device” which covers a simple, yet secure method of protecting a user’s biometric information. It covers the transmission of information from the point the information is collected at the biometric reader until the data reaches the computer or device that is authenticating the user’s identity. With the payment of all maintenance fees, this patent will expire on October 25, 2025.\nOn May 26, 2009, we were issued US patent No. 7,539,331 for our “Image Identification System” method for improving the performance and reliability of image analysis within an image identification system. With the payment of all maintenance fees, this patent will expire on March 22, 2022.\nOn November 8, 2011, we were issued US Patent No. 8,055,027 for our “Generation of Directional Information in the Context of Image Processing” method for image enhancement and processing. With the payment of all maintenance fees, this patent will expire on October 10, 2027.\nOn June 5, 2012, PistolStar was issued US Patent No. 8,196,193 for “Method For Retrofitting Password Enabled Computer Software with a Redirectional User Authentication Method”, where a device, method, and system may be used to integrate and control authentication and passwords among various applications and platforms. With the payment of all maintenance fees, this patent will expire on November 1, 2030.\nOn July 3, 2012, we were issued US Patent No. 8,214,652 for our “Biometric Identification Network Security”, an expanded method of network and related network authentication security systems utilizing hardware-based support for encryption and key management for authentication purposes. With the payment of all maintenance fees, this patent will expire on April 24, 2024.\nOn March 12, 2013, PistolStar was issued US Patent No. 8,397,077 for “Client Side Authentication Redirection”, where user specific attributes may be accessed and used to produce a generated password, using an algorithm and the user attributes. With the payment of all maintenance fees, this patent will expire on August 7, 2030.\nOn May 3, 2017, we were issued US Patent No. 9,646,146 for our “Utilization of Biometric Data”, a method enables existing small area sensors to capture substantially more fingerprint surface area, leading to a higher degree of accuracy when performing a match. With the payment of all maintenance fees, this patent will expire on March 6, 2035.\nOn June 19, 2018 we were issued U.S. Patent No. 10,002,244 for our “Utilization of Biometric Data” to allow continuous, passive user authentication on a mobile device. With the payment of all maintenance fees, this patent will expire on March 6, 2035.\nOn July 27, 2018 we were issued U.S. Patent No. 10,025,831 for “Adaptive Short Lists and Acceleration of Biometric Database Search”, a method to quickly and iteratively search a database of biometric data. With the payment of all maintenance fees, this patent will expire on August 10, 2036.\nOn September 3, 2019 we were issued U.S. Patent No. 10,400,481 for “Fingerprint Lock”, a lock design method of the shackle and spring integration to electronics. With the payment of all maintenance fees, this patent will expire on June 27, 2037.\nOn September 10, 2019 we were issued U.S Patent No. 10,410,040 for “Fingerprint Lock Control method and Fingerprint Lock System”, a lock design method of the control process of scanning, and server communications for user profile management. With the payment of all maintenance fees, this patent will expire on July 26, 2037.\nWe have also been granted parallel patents to the US Patent portfolio to certain of our patents in many foreign countries offering protection of our intellectual property rights around the world.\nTrademarks\nWe have registered our trademarks “BIO-key”, “True User Identification”, “Intelligent Image Indexing”, “WEB-key”, “SideSwipe”, “SidePass”, “EcoID”, “PistolStar®”, “PortalGuard”, “PASSIVEKEY®”, and “The Biometric of Things” with the U.S. Patent & Trademark Office, as well as many foreign countries, protecting our companies name and key technology offering names.\nThrough our subsidiary PistolStar, we have the following additional registered trademarks: “PortalGuard®”, “PASSIVEKEY®”, and “PISTOLSTAR®”. We also acquired the following unregistered trademarks: “PortalGuard NebulaTM”, “Password PowerTM” and “ScoochTM”.\nCopyrights and trade secrets\nWe take measures to ensure copyright and license protection for our software releases prior to distribution When possible, the software is licensed in an attempt to ensure that only licensed and activated software functions to its full potential. We also take measures to protect the confidentiality of our trade secrets.\nResearch and Development\nOur PortalGuard IAM product line is mature, with hundreds of active customers, and we are adding additional factors and capabilities to the product, as well as enhancing the self-management for the functionally equivalent PortalGuard IDaaS offering. Our VST and WEB-key biometric platforms are mature, stable, and widely-deployed and we concentrate our research and development efforts on enhancing the functionality, reliability and integration of our current products as well as acquiring and developing new and innovative products and solutions for providing broader access to the BIO-key user experience.\nAlthough we believe that our identification technology is one of the most advanced and discriminating fingerprint technologies available today, the markets in which we compete are characterized by rapid technological change and evolving standards and use-cases. In order to maintain our position in the market, we will need to continue to upgrade and refine our existing technologies as new standards become relevant to our customers and markets.\nDuring the years ended December 31, 2020 and 2019, we incurred $1,396,436 and $1,331,667, respectively, on research and development.\nIn future periods our R&D efforts will remain focused on updating and advancing our core software products including PortalGuard and PortalGuard IDaaS, WEB-key and VST. These products are critical to support the anticipated growth in enterprise IAM and large-scale ID projects.\nCompetition\nThe IAM MFA and SSO market has many providers of solutions in either standalone or IAM suite delivery models. We believe that our unique differentiator in this market is the incorporation of an unparalleled server-secured biometric authentication capability among our 15 authentication factors. In addition to companies that provide existing commonplace methods of restricting access to facilities and logical access points such as pass cards, PIN numbers, passwords, locks and keys, there are numerous companies involved in the development, manufacturing and marketing of fingerprint biometrics products to commercial, government, law enforcement and prison markets. These companies include, but are not limited to, 3M (Cogent), NEC, and MorphoTrak.\nThe majority of sales for automated fingerprint identification products in the market to date have been deployed for government agencies, healthcare facilities, and law enforcement applications. The consumer and commercial markets represent areas of growth potential for biometrics, led by the use of mobile devices.\nThe epidemic of security and data breaches reported over the past few years is one of the driving factors for identifying new methods of protecting valuable data. After attempting to create a more sophisticated password or more efficient token or PIN, it has become apparent that each of these methods are easily compromised, and the downside risks are significant.\nWe have also seen FIDO-compliant keys enter the market, led by Yubico’s YubiKey, a USB key that acts as a credential for access. Keys alone do not meet the needs of large organizations for which key sharing and lost keys are concerns. We are introducing a line of low-cost USB keys and they do not offer the security benefits of biometric technology as they can be easily lost or stolen and replacement costs / managing the product becomes a growing expense.\nWith respect to competing biometrics technologies, each has its strengths and weaknesses and none has emerged as a market leader:\n●\nFingerprint identification is generally viewed as very accurate, inexpensive and non-intrusive and is the dominant biometric in use today and will be for the foreseeable future;\n●\nPalm Vein scanning is expensive, technique-sensitive, and offers mobility challenges;\n●\nIris scanning is viewed as accurate, but the hardware is significantly more expensive; and\n●\nFacial recognition can have privacy concerns with work-from-home use, and is typically highly dependent on ambient lighting conditions, angle of view, and other factors.\nGovernment Regulations\nVarious state, federal and EU privacy laws govern the collection, storage, use and any sale of biometric-related data. To the extent that BIO-key’s IDaaS offerings include the collection and storage of customer users’ personal or biometric data, we operate as a processor of such data. Our WEB-key platform includes compliance features to ensure automated compliance with these laws including collection of informed written consent during enrollment workflows and robust auditing to control and report on the retention of biometric data and removal requests. Additionally, our customers have access to these tools to maintain their own compliance, including deletion of user data when business relationships terminate.\nWe believe in biometric privacy rights, and that both users and their organizations benefit from a responsibly operated biometric identity infrastructure. We actively participate in industry privacy workgroups as recognized biometric subject matter experts in order to influence and keep abreast of any proposed changes to these regulations. Beyond these regulations, we are not currently subject to direct regulation by any government agency, other than regulations generally applicable to businesses or related to specific project requirements. In the event of any international sales, we would be subject to various domestic and foreign laws regulating such exports and export activities.\nEnvironmental Regulations\nAs of the date of this report, we have not incurred any material expenses relating to our compliance with federal, state, or local environmental laws and do not expect to incur any material expenses in the foreseeable future.\nSeasonality\nGenerally, our revenues do not exhibit a seasonal pattern, however, revenue is affected by customer budgeting, government fiscal year planning, and capital budgets.\nHuman Capital Resources\nAs of the date of this report, we employed thirty-four individuals on a full-time basis as follows: (i) sixteen in engineering, customer support, and research and development; (ii) eight in finance and administration; and (iii) ten in sales and marketing. We also use two consultants who provide engineering and technical services on a part-time basis, three full-time factory contractors, and three part-time factory contractors in China. None of our employees are represented by a labor union and we believe that our relationship with our employees is good.\nAvailable Information\nWe maintain a website with the address www.BIO-key.com. Our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports are available on our website, without charge, as soon as reasonably practicable after they are filed electronically with the SEC. The SEC also maintains a website that contains reports, proxy and information statements and other information statements and other information regarding issuers who file electronically with the SEC. The SEC’s website address is www.sec.gov.",
    "item_1A": "ITEM 1A. RISK FACTORS\nSet forth below are the risks that we believe are material to our investors. This section contains forward-looking statements. You should refer to the explanation of the qualifications and limitations on forward-looking statements appearing just before the section captioned “BUSINESS” in Item 1. above. Effective November 20, 2020, we implemented a reverse stock split of our outstanding common stock at a ratio of 1-for-8. All share figures are reflected on a post-split basis.\nBUSINESS AND FINANCIAL RISKS\nWe have historically not generated significant revenue and have sustained substantial operating losses.\nIn order to increase revenue, we have developed a direct sales force and anticipate the need to retain additional sales, marketing and technical support personnel and may need to incur substantial expenses. We cannot assure you that we will be able to secure these necessary resources, that a significant market for our technologies will develop, or that we will be able to achieve our targeted revenue. If we are unable to achieve revenue or raise capital sufficient to cover our ongoing operating expenses, we will be required to scale back operations, including marketing and research initiatives, or in the extreme case, discontinue operations. As of December 31, 2020, we had an accumulated deficit of approximately $99 million.\nOur biometric technology has yet to gain widespread market acceptance and we do not know how large of a market will develop for our technology.\nBiometric technology has received only limited market acceptance, particularly in the private sector. Our technology represents a novel security solution and we have not yet generated significant sales. Although recent security concerns relating to identification of individuals and appearance of biometric readers on popular consumer products, including the Apple iPhone, have increased interest in biometrics generally, it remains an undeveloped, evolving market. Biometric based solutions compete with more traditional security methods including keys, cards, personal identification numbers and security personnel. Acceptance of biometrics as an alternative to such traditional methods depends upon a number of factors including:\n●\nnational or international events which may affect the need for or interest in biometric solutions;\n●\nthe performance and reliability of biometric solutions;\n●\nmarketing efforts and publicity regarding these solutions;\n●\npublic perception regarding privacy concerns;\n●\ncosts involved in adopting and integrating biometric solutions;\n●\nproposed or enacted legislation related to privacy of information; and\n●\ncompetition from non-biometric technologies that provide more affordable, but less robust, authentication (such as tokens and smart cards).\nFor these reasons, we are uncertain whether our biometric technology will gain widespread acceptance in any commercial markets or that demand will be sufficient to create a market large enough to produce significant revenue or earnings. Our future success depends, in part, upon business customers adopting biometrics generally, and our solution specifically.\nBiometric technology is a new approach to Internet security, which must be accepted in order for our WEB-key solution to generate significant revenue.\nOur WEB-key authentication initiative represents a new approach to Internet security, which has been adopted on a limited basis by companies that distribute goods, content or software applications over the Internet. The implementation of our WEB-key solution requires the distribution and use of a finger scanning device and integration of database and server side software. Although we believe our solutions provide a higher level of security for information transmitted over the Internet than existing traditional methods, unless business and consumer markets embrace the use of a scanning device and believe the benefits of increased accuracy outweigh implementation costs, our solution will not gain market acceptance.\nThe market for our solutions is still developing and if the biometrics industry adopts standards or a platform different from our standards or platform, our competitive position would be negatively affected.\nThe market for identity solutions is still developing. The evolution of this market may result in the development of different technologies and industry standards that are not compatible with our current solutions, products or technologies. Several organizations set standards for biometrics to be used in identification and documentation. Although we believe that our biometric technologies comply with existing standards, these standards may change and any standards adopted could prove disadvantageous to or incompatible with our business model and current or future solutions, products and services.\nOur software products may contain defects which will make it more difficult for us to establish and maintain customers.\nAlthough we have completed the development of our core biometric technology, it has only been used by a limited number of business customers. Despite extensive testing during development, our software may contain undetected design faults and software errors, or “bugs” that are discovered only after it has been installed and used by a greater number of customers. Any such defect or error in new or existing software or applications could cause delays in delivering our technology or require design modifications. These could adversely affect our competitive position and cause us to lose potential customers or opportunities. Since our technologies are intended to be utilized to secure physical and electronic access, the effect of any such bugs or delays will likely have a detrimental impact on us. In addition, given that biometric technology generally, and our biometric technology specifically, has yet to gain widespread acceptance in the market, any delays would likely have a more detrimental impact on our business than if we were a more established company.\nIn order to generate revenue from our biometric products, we are dependent upon independent original equipment manufacturers, system integrators and application developers, which we do not control. As a result, it may be more difficult to generate sales.\nWe market our technology through licensing arrangements with:\n●\noriginal equipment manufacturers (OEMs), system integrators and application developers which develop and market products and applications which can then be sold to end users; and\n●\ncompanies which distribute goods, services or software applications over the Internet.\nAs a technology licensing company, our success will depend upon the ability of these manufacturers and developers to effectively integrate our technology into products and services which they market and sell. We have no control over these licensees and cannot assure you that they have the financial, marketing or technical resources to successfully develop and distribute products or applications acceptable to end users or generate any meaningful revenue for us. These third parties may also offer the products of our competitors to end users. While we have commenced a significant sales and marketing effort, we have only begun to develop a significant distribution channel and may not have the resources or ability to sustain these efforts or generate any meaningful sales.\nWe face intense competition and may not have the financial and human resources necessary to keep up with rapid technological changes, which may result in our technology becoming obsolete.\nThe Internet, facility access control, and information security markets are subject to rapid technological change and intense competition. We compete with both established biometric companies and a significant number of startup enterprises as well as providers of more traditional methods of access control. Most of our competitors have substantially greater financial and marketing resources than we do and may independently develop superior technologies, which may result in our technology becoming less competitive or obsolete. We may not be able to keep pace with this change. If we are unable to develop new applications or enhance our existing technology in a timely manner in response to technological changes, we will be unable to compete in our chosen markets. In addition, if one or more other biometric technologies such as voice, face, iris, hand geometry or blood vessel recognition are widely adopted, it would significantly reduce the potential market for our fingerprint identification technology.\nWe expect material revenues from Africa beginning in 2021 and future periods. Our financial performance will be subject to risks associated with changes in the value of the U.S. dollar versus local currencies.\nOur primary exposure to movements in foreign currency exchange rates relates to non-U.S. dollar-denominated sales and operating expenses worldwide. Weakening of foreign currencies relative to the U.S. dollar will adversely affect the U.S. dollar value of our foreign currency-denominated sales and earnings, if any, and could lead to us raising international pricing, potentially reducing the demand for our products. In addition, margins on sales of our products in foreign countries and on sales of products that include components obtained from foreign suppliers could be materially adversely affected by foreign currency exchange rate fluctuations.\nAlthough we have made significant sales of our products throughout Asia and Africa in prior years, we have not been able to consistently enforce our contract rights and collect all receivables which has resulted in material write-offs.\nOur ability to enforce our international contracts is contingent on our relationships with foreign resellers, and their financial viability. Although we are making efforts to better enforce our contract rights, there can be no assurance that we will be able to fully collect all receivables originating in Asia and Africa or that will not have to write-off future receivables which may be material in amount. Any such write-offs have in the past and will negatively impact our financial position and results of operation.\nWe depend on key employees and members of our management team, including our Chairman of the Board and Chief Executive Officer and our Chief Technology Officer, in order to achieve our goals. We cannot assure you that we will be able to retain or attract such persons.\nOur employment contracts with Michael W. DePasquale, our Chairman of the Board and Chief Executive Officer, and Mira LaCous, our Chief Technology Officer, expire annually, and renew automatically for successive one year periods unless notice of non-renewal is provided by the Company. Although the contracts do not prevent them from resigning, they do contain confidentiality and non-compete clauses, which are intended to prevent them from working for a competitor within one year after leaving our Company. Our success depends on our ability to attract, train and retain employees with expertise in developing, marketing and selling software solutions. In order to successfully market our technology, we will need to retain additional engineering, technical support and marketing personnel. The market for such persons remains highly competitive and our limited financial resources will make it more difficult for us to recruit and retain qualified persons.\nWe cannot assure you that the intellectual property protection for our core technology provides a sustainable competitive advantage or barrier to entry against our competitors.\nOur success and ability to compete is dependent in part upon proprietary rights to our technology. We rely primarily on a combination of patent, copyright and trademark laws, trade secrets and technical measures to protect our propriety rights. We have filed a patent application relating to both the optic technology and biometrics solution components of our technology wherein several claims have been allowed. The U.S. Patent and Trademark Office has issued us a series of patents for our Vector Segment fingerprint technology (VST), and our other core biometric analysis and identification technologies. However, we cannot assure you that we will be able to adequately protect our technology or other intellectual property from misappropriation in the U.S. and abroad. Any patent issued to us could be challenged, invalidated or circumvented or rights granted thereunder may not provide a competitive advantage to us. Furthermore, patent applications that we file may not result in issuance of a patent or, if a patent is issued, the patent may not be issued in a form that is advantageous to us. Despite our efforts to protect our intellectual property rights, others may independently develop similar products, duplicate our products or design around our patents and other rights. In addition, it is difficult to monitor compliance with, and enforce, our intellectual property rights on a worldwide basis in a cost-effective manner. In jurisdictions where foreign laws provide less intellectual property protection than afforded in the U.S. and abroad, our technology or other intellectual property may be compromised, and our business would be materially adversely affected. If any of our proprietary rights are misappropriated or we are forced to defend our intellectual property rights, we will have to incur substantial costs. Such litigation could result in substantial costs and diversion of our resources, including diverting the time and effort of our senior management, and could disrupt our business, as well as have a material adverse effect on our business, prospects, financial condition and results of operations. We can provide no assurance that we will have the financial resources to oppose any actual or threatened infringement by any third party. Furthermore, any patent or copyrights that we may be granted may be held by a court to infringe on the intellectual property rights of others and subject us to the payment of damage awards.\nWe may be subject to claims with respect to the infringement of intellectual property rights of others, which could result in substantial costs and diversion of our financial and management resources.\nThird parties may claim that we are infringing on their intellectual property rights. We may violate the rights of others without our knowledge. We may expose ourselves to additional liability if we agree to indemnify our customers against third party infringement claims. While we know of no basis for any claims of this type, the existence of and ownership of intellectual property can be difficult to verify and we have not made an exhaustive search of all patent filings. Additionally, most patent applications are kept confidential for twelve to eighteen months, or longer, and we would not be aware of potentially conflicting claims that they make. We may become subject to legal proceedings and claims from time to time relating to the intellectual property of others in the ordinary course of our business. If we are found to have violated the intellectual property rights of others, we may be enjoined from using such intellectual property, and we may incur licensing fees or be forced to develop alternative technology or obtain other licenses. In addition, we may incur substantial expenses in defending against these third party infringement claims and be diverted from devoting time to our business and operational issues, regardless of the merits of any such claim.\nIn addition, in the event that we recruit employees from other technology companies, including certain potential competitors, and these employees are engaged in the development of portions of products which are similar to the development in which they were involved at their former employers, we may become subject to claims that such employees have improperly used or disclosed trade secrets or other proprietary information. If any such claims were to arise in the future, litigation or other dispute resolution procedures might be necessary to retain our ability to offer our current and future services, which could result in substantial costs and diversion of our financial and management resources. Successful infringement or licensing claims against us may result in substantial monetary damages, which may materially disrupt the conduct of our business and have a material adverse effect on our reputation, business, financial condition and results of operations. Even if intellectual property claims brought against us are without merit, they could result in costly and time consuming litigation, and may divert our management and key personnel from operating our business.\nIf we are unable to effectively protect our intellectual property rights on a worldwide basis, we may not be successful in the international expansion of our business.\nAccess to worldwide markets depends in part on the strength of our intellectual property portfolio. There can be no assurance that, as our business expands into new areas, we will be able to independently develop the technology, software or know-how necessary to conduct our business or that we can do so without infringing the intellectual property rights of others. To the extent that we have to rely on licensed technology from others, there can be no assurance that we will be able to obtain licenses at all or on terms we consider reasonable. The lack of a necessary license could expose us to claims for damages and/or injunction from third parties, as well as claims for indemnification by our customers in instances where we have a contractual or other legal obligation to indemnify them against damages resulting from infringement claims. With regard to our own intellectual property, we actively enforce and protect our rights. However, there can be no assurance that our efforts will be adequate to prevent the misappropriation or improper use of our protected technology in international markets.\nWe face inherent product liability or other liability risks that could result in large claims against us.\nWe have inherent risk of exposure to product liability and other liability claims resulting from the use of our products, especially to the extent customers may depend on our products in public safety situations that may involve physical harm or even death to individuals, as well as exposure to potential loss or damage to property. Despite quality control systems and inspection, there remains an ever-present risk of an accident resulting from a faulty manufacture or maintenance of products, or an act of an agent outside of our or our supplier’s control. Even if our products perform properly, we may become subject to claims and costly litigation due to the catastrophic nature of the potential injury and loss. A product liability claim, or other legal claims based on theories including personal injury or wrongful death, made against us could adversely affect operations and financial condition. Although we may have insurance to cover product liability claims, the amount of coverage may not be sufficient.\nWe may need to obtain additional financing to execute our business plan over the long-term, which may not be available. If we are unable to raise additional capital or generate significant revenue, we may not be able to continue operations.\nWe have historically financed our operations through access to the capital markets by issuing secured and convertible debt securities, convertible preferred stock, common stock, and through factoring receivables. We currently require approximately $735,000 per month to conduct our operations, a monthly amount that we have been unable to consistently achieve through revenue generation. During 2020, we generated approximately $2,837,000 of revenue, which is below our average monthly requirements. If we are unable to generate sufficient revenue to cover operating expenses and fund our business plan, we will need to obtain additional third-party financing. We may, therefore, need to obtain additional financing through the issuance of debt or equity securities. We cannot assure you that we will be able to secure any such additional financing on terms acceptable to us or at all. If we cannot obtain such financing, we will not be able to execute our business plan, will be required to reduce operating expenses, and in the extreme case, discontinue operations.\nWe may not achieve profitability if we are unable to maintain, improve our offerings.\nWe believe that our future business prospects depend in part on our ability to maintain and improve our current services and to develop new ones on a timely basis. Our services will have to achieve market acceptance, maintain technological competitiveness, and meet an expanding range of customer requirements. As a result of the complexities inherent in our service offerings, major new wireless data services and service enhancements require long development and testing periods. We may experience difficulties that could delay or prevent the successful development, introduction or marketing of new services and service enhancements. Additionally, our new services and service enhancements may not achieve market acceptance. If we cannot effectively develop and improve services, we may not be able to recover our fixed costs or otherwise become profitable.\nIf we fail to adequately manage our resources, it could have a severe negative impact on our financial results or stock price.\nWe could be subject to fluctuations in technology spending by existing and potential customers. Accordingly, we will have to actively manage expenses in a rapidly changing economic environment. This could require reducing costs during economic downturns and selectively growing in periods of economic expansion. If we do not properly manage our resources in response to these conditions, our results of operations could be negatively impacted.\nThe recent outbreak of COVID-19 has and may continue to have a negative impact on our business, sales, results of operations and financial condition.\nThe global outbreak of COVID-19 has led to severe disruptions in general economic activities, particularly retail operations and travel, as businesses and federal, state, and local governments take increasingly broad actions to mitigate this public health crisis. Individually and collectively, the consequences of the COVID-19 outbreak could have a material adverse effect on our business, sales, results of operations and financial condition. Although our employees have been accustomed to working remotely prior to the COVID-19 pandemic, the uncertainty has extended sales cycles, extended payment terms, impacted access to inventory overseas, and delayed the start of planned deployments.\nAdditionally, our liquidity could be negatively impacted if these conditions continue for a significant period of time and we may be required to pursue additional sources of financing to obtain working capital, maintain appropriate inventory levels, and meet our financial obligations. Currently capital and credit markets have been disrupted by the crisis and our ability to obtain any required financing is not guaranteed and largely dependent upon evolving market conditions and other factors. Depending on the continued impact of the crisis, further actions may be required.\nThe extent to which the COVID-19 outbreak ultimately impacts our business, sales, results of operations and financial condition will depend on future developments, which are highly uncertain and cannot be predicted, including, but not limited to, the duration and spread of the outbreak, its severity, the actions to contain the virus or treat its impact, and how quickly and to what extent normal economic and operating conditions can resume. Even after the COVID-19 outbreak has subsided, we may continue to experience significant impacts to our business as a result of its global economic impact, including any economic downturn or recession that has occurred or may occur in the future.\nWe have taken measures to minimize the health risks of COVID-19 to our employees, as their safety and well-being are a top priority. Our U.S. employees are working remotely when possible, and we may experience reduced productivity due to the remote work environment. The extent to which COVID-19 impacts our business, sales and results of operations will depend on future developments, which are highly uncertain and cannot be predicted.\nWar, terrorism, other acts of violence or natural or manmade disasters such as a global pandemic may affect the markets in which the Company operates, the Company’s customers, the Company’s delivery of products and customer service, and could have a material adverse impact on our business, results of operations, or financial condition.\nOur business may be adversely affected by instability, disruption or destruction in a geographic region in which we operate, regardless of cause, including war, terrorism, riot, civil insurrection or social unrest, and natural or manmade disasters, including famine, food, fire, earthquake, storm or pandemic events and spread of COVID-19, described above.\nSuch events may cause customers to suspend their decisions on using our products and services, make it difficult or impossible to access some of our inventory, and give rise to sudden significant changes in regional and global economic conditions and cycles that could interfere with purchases of goods or services. These events also pose significant risks to our personnel and to physical facilities which could materially adversely affect our financial results.\nOur business could be negatively impacted by security threats, including cybersecurity threats, ransomware, and other disruptions.\nAs a technology company, we face various security threats, including cybersecurity threats to gain unauthorized access to sensitive information. Although we utilize various procedures and controls to monitor these threats and mitigate our exposure to such threats, there can be no assurance that these procedures and controls will be sufficient in preventing security threats from materializing. If any of these events were to materialize, they could lead to losses of sensitive information, critical infrastructure, personnel or capabilities, essential to our operations and could have a material adverse effect on our reputation, financial position, results of operations, or cash flows.\nCybersecurity attacks in particular are evolving and include but are not limited to, malicious software, attempts to gain unauthorized access to data, and other electronic security breaches that could lead to disruptions in critical systems, unauthorized release of confidential or otherwise protected information and corruption of data. Although we have implemented systems and procedures that are designed to protect customer, employee, vendor and Company information, prevent data loss and other security breaches, and otherwise identify, assess, and analyze cybersecurity risks, these measures may not be effective. Development and maintenance of these systems is costly and requires ongoing monitoring and updating as technologies change and efforts to overcome security measures increase and become more sophisticated. We face an evolving threat landscape in which cybercriminals, among others, employ a complex array of techniques designed to access personal data and other information, including, for example, the use of fraudulent or stolen access credentials, malware, ransomware, phishing, denial of service and other types of attacks. While, to the best of our knowledge, we have not experienced any material misappropriation, loss or other unauthorized disclosure of confidential or personally identifiable information as a result of a security breach or cyberattack that could materially increase financial risk to the Company or our customers, such a security breach or cyberattack could adversely affect our business and operations, including by damaging our reputation and our relationships with our customers, employees and investors, exposing us to litigation, fines, penalties or remediation costs.\nWe may experience difficulties in completing the integration of the operations, personnel and assets of PistolStar which we acquired in June 2020.\nWe recently acquired PistolStar. There can be no assurance that we will be able to manage PistolStar’s business or successfully integrate the business with our historic operations without substantial costs, delays or other operational or financial problems. In addition, we cannot assure you that we will be able to maintain and grow the revenues and operating margins of the combined business, realize cost synergies with PistolStar’s products, services, and operations, or that we will be able to retain all of PistolStar’s existing customers and employees. If we are unable to successfully manage the new business, we will not be able to generate sufficient revenue to offset the acquisition costs that we have incurred which would have a material adverse effect on our financial position and results of operations.\nThere is a scarcity of and competition for acquisition opportunities.\nThere are a limited number of operating companies available for acquisition that we deem to be desirable targets. In addition, there is a very high level of competition among companies seeking to acquire these operating companies. Many established and well-financed entities are active in acquiring interests in companies that we may find to be desirable acquisition candidates. Many of these entities have significantly greater financial resources, technical expertise and managerial capabilities than us. Consequently, we will be at a competitive disadvantage in negotiating and executing possible acquisitions of these businesses. Even if we are able to successfully compete with these entities, this competition may affect the terms of completed transactions and, as a result, we may pay more or receive less favorable terms than we expected for potential acquisitions. We may not be able to identify operating companies that complement our strategy, and even if we identify a company that complements our strategy, we may be unable to complete an acquisition of such a company for many reasons, including:\n●\nfailure to agree on the terms necessary for a transaction, such as the purchase price;\n●\nincompatibility between our operational strategies or management philosophies with those of the potential acquiree;\n●\ncompetition from other acquirers of operating companies;\n●\nlack of sufficient capital to acquire a profitable distribution company; and\n●\nunwillingness of a potential acquiree to work with our management.\nRisks related to acquisition financing.\nWe have a limited amount of financial resources and our ability to make additional acquisitions without securing additional financing from outside sources is limited. In order to continue to pursue our acquisition strategy, we may be required to obtain additional financing. We may obtain such financing through a combination of traditional debt financing or the placement of debt and equity securities. We may finance some portion of our future acquisitions by either issuing equity or by using shares of our common stock for all or a portion of the purchase price for such businesses. In the event that our common stock does not attain or maintain a sufficient market value, or potential acquisition candidates are otherwise unwilling to accept our common stock as part of the purchase price for the sale of their businesses, we may be required to use more of our cash resources, if available, in order to maintain our acquisition program. If we do not have sufficient cash resources, we will not be able to complete acquisitions and our growth could be limited unless we are able to obtain additional capital through debt or equity financings.\nWe may experience difficulties in integrating the operations, personnel and assets of any business we acquire which may disrupt our business, dilute stockholder value, and adversely affect our operating results.\nA component of our business plan is to acquire businesses and assets in the biometric and identity access management industry. There can be no assurance that we will be able to identify, acquire or profitably manage businesses or successfully integrate acquired businesses into the Company without substantial costs, delays or other operational or financial problems. Such acquisitions also involve numerous operational risks, including:\n●\ndifficulties in integrating operations, technologies, services and personnel;\n●\nthe diversion of financial and management resources from existing operations;\n●\nthe risk of entering new markets;\n●\ndifficulties in retaining the existing customers;\n●\nthe potential loss of existing or acquired strategic operating partners following an acquisition;\n●\nthe potential loss of key employees following an acquisition and the associated risk of competitive efforts from such departed personnel;\n●\nassumed or unforeseen liabilities that arise in connection with the acquired business\n●\npossible legal disputes with the acquired company following an acquisition; and\n●\nthe inability to generate sufficient revenue to offset acquisition or investment costs.\nAs a result, if we fail to properly evaluate and execute any acquisitions or investments, our business and prospects may be seriously harmed.\nTo the extent we make any material acquisitions, our earnings may adversely affected by non-cash charges relating to the amortization of intangible assets.\nUnder applicable accounting standards, purchasers are required to allocate the total consideration paid in a business combination to the identified acquired assets and liabilities based on their fair values at the time of acquisition. The excess of the consideration paid to acquire a business over the fair value of the identifiable tangible assets acquired must be allocated among identifiable intangible assets including goodwill. The amount allocated to goodwill is not subject to amortization. However, it is tested at least annually for impairment. The amount allocated to identifiable intangible assets, such as customer relationships and the like, is amortized over the life of these intangible assets. We expect that this will subject us to periodic charges against our earnings to the extent of the amortization incurred for that period. Because our business strategy focuses, in part, on growth through acquisitions, our future earnings may be subject to greater non-cash amortization charges than a company whose earnings are derived solely from organic growth. As a result, we may experience an increase in non-cash charges related to the amortization of intangible assets acquired in our acquisitions. Our financial statements will show that our intangible assets are diminishing in value, even if the acquired businesses are increasing (or not diminishing) in value.\nRISKS RELATED TO OUR COMMON STOCK\nWe have issued a substantial number of options and warrants exercisable into shares of our common stock which could result in substantial dilution to the ownership interests of our existing stockholders.\nAs of the date of this report, approximately 4,917,000 shares of our common stock were reserved for issuance upon exercise or conversion of outstanding stock options and warrants. The exercise or conversion of these securities will result in a significant increase in the number of outstanding shares and substantially dilute the ownership interests of our existing stockholders.\nThe availability of a substantial number of shares of our common stock for public sale may cause the price of our common stock to decline.\nOur most recent public offering in July 2020 resulted in the issuance of 5,059,850 shares of our common stock, including the exercise of prefunded warrants, and warrants to purchase approximately 4,260,000 shares of common stock. These warrants are immediately exercisable as of the date of this report and subject to an effective registration. The availability of these shares for sale to the public, whether or not sales have occurred or are occurring, and the sale of such shares in the public markets could have an adverse effect on the market price of our common stock. Such an adverse effect on the market price would make it more difficult for us to raise additional financing through the sale of equity or equity-related securities in the future at a time and price that we deem reasonable or appropriate.\nAn active trading market for our common stock may not be sustained.\nAlthough our common stock is listed on the Nasdaq Capital Market, an active trading market for our shares may not be developed and if developed, sustained. If an active market for our common stock is not developed or sustained, it may be difficult for you to sell your shares without depressing the market price for the shares or sell your shares at all. Any inactive trading market for our common stock may also impair our ability to raise capital to continue to fund our operations by selling shares and may impair our ability to acquire other companies or technologies by using our shares as consideration.\nIf we fail to comply with the continued minimum closing bid requirements of the Nasdaq or other requirements for continued listing, our Common Stock may be delisted and the price of our Common Stock and our ability to access the capital markets could be negatively impacted.\nOur common stock is listed for trading on Nasdaq. We must satisfy Nasdaq’s continued listing requirements, including, among other things, a minimum closing bid price requirement of $1.00 per share and minimum stockholders’ agreement. A delisting of our common stock from Nasdaq could materially reduce the liquidity of our common stock and result in a corresponding material reduction in the price of our Common Stock. In addition, delisting could harm our ability to raise capital through alternative financing sources on terms acceptable to us, or at all, and may result in the potential loss of confidence by investors, employees and fewer business development opportunities.\nWe may need to raise additional funds in the future through issuances of securities and such additional funding may be dilutive to stockholders or impose operational restrictions.\nWe may need to raise additional capital in the future to help fund our operations through sales of shares of our common stock or securities convertible into shares of our common stock, as well as issuances of debt. Such additional financing may be dilutive to our stockholders, and debt financing, if available, and may involve restrictive covenants which may limit our operating flexibility. If additional capital is raised through the issuance of shares of our common stock or securities convertible into shares of our common stock, the percentage ownership of existing stockholders will be reduced. These stockholders may experience additional dilution in net book value per share and any additional equity securities may have rights, preferences and privileges senior to those of the holders of our common stock.\nBecause we do not expect to pay dividends for the foreseeable future, investors seeking cash dividends should not purchase our shares of common stock.\nWe have never declared or paid any cash dividends on our common stock, and we do not anticipate paying any cash dividends on our common stock in the foreseeable future. Payment of any future dividends will be at the discretion of our board of directors after taking into account various factors, including but not limited to our financial condition, operating results, cash needs, growth plans and the terms of any credit agreements that we may be a party to at the time. Accordingly, investors seeking cash dividends should not purchase shares of our common stock.\nProvisions of our certificate of incorporation, bylaws and Delaware law may make a contested takeover of our Company more difficult.\nCertain provisions of our certificate of incorporation, bylaws and the General Corporation Law of the State of Delaware (“DGCL”) could deter a change in our management or render more difficult an attempt to obtain control of us, even if such a proposal is favored by a majority of our stockholders. For example, we are subject to the provisions of the DGCL that prohibit a public Delaware corporation from engaging in a broad range of business combinations with a person who, together with affiliates and associates, owns 15% or more of the corporation’s outstanding voting shares (an “interested stockholder”) for three years after the person became an interested stockholder, unless the business combination is approved in a prescribed manner. Our certificate of incorporation also includes undesignated preferred stock, which may enable our board of directors to discourage an attempt to obtain control of us by means of a tender offer, proxy contest, merger or otherwise. Finally, our bylaws include an advance notice procedure for stockholders to nominate directors or submit proposals at a stockholders meeting. Delaware law and our charter may, therefore, inhibit a takeover.\nThe trading price of our common stock may be volatile.\nThe trading price of our shares has from time to time fluctuated widely and in the future may be subject to similar fluctuations. The trading price may be affected by a number of factors including the risk factors set forth in this prospectus as well as our operating results, financial condition, announcements of innovations or new products by us or our competitors, general conditions in the biometrics and access control industries, and other events or factors. We cannot assure you that any of the broker-dealers that currently make a market in our common stock will continue to serve as market makers or have the financial capability to stabilize or support our common stock. A reduction in the number of market makers or the financial capability of any of these market makers could also result in a decrease in the trading volume of and price of our shares. In recent years broad stock market indices, in general, and the securities of technology companies, in particular, have experienced substantial price fluctuations. Such broad market fluctuations may adversely affect the future-trading price of our common stock.",
    "item_1B": "",
    "item_2": "ITEM 2. DESCRIPTION OF PROPERTY\nWe do not own any real estate. We conduct operations from leased premises in Eagan, Minnesota (5,544 square feet), Bedford, New Hampshire (3,364 square feet), and Wall, New Jersey (4,517 square feet). Internationally, we conduct operations from leased premises in Tsuen Wan, Hong Kong (1,098 square feet), and Jiangmen, China (3,267 square feet). Our Eagan, Minnesota and Bedford, New Hampshire offices provide research and development, and customer support, for BIO-key software and PistolStar software, respectively. Our Wall, New Jersey location serves as our corporate headquarters. Our Hong Kong location is a small warehouse for finished goods as well as administrative and sales support. Our Jiangmen, China facility provides our hardware research and development, contract manufacturing and warehousing of raw materials, work-in-process, and finished goods.",
    "item_3": "ITEM 3. LEGAL PROCEEDINGS\nFrom time to time, we may be involved in litigation relating to claims arising out of our operations in the normal course of business. As of the date of this report, we are not a party to any pending lawsuit.",
    "item_4": "ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II",
    "item_5": "ITEM 5. MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur common stock currently trades on the Nasdaq Capital Market under the symbol “BKYI”.\nHolders\nAs of March 26, 2021, the number of stockholders of record of our common stock was 112.\nDividends\nWe have not paid any cash dividends on our common stock to-date and have no intention of paying any cash dividends on our common stock in the foreseeable future. The declaration and payment of dividends on our common stock is also subject to the discretion of our Board of Directors and certain limitations imposed under the Delaware General Corporation Law. The timing, amount, and form of dividends, if any, will depend on, among other things, our results of operations, financial condition, cash requirements and other factors deemed relevant by our Board of Directors.\nSecurities Authorized for Issuance under Equity Compensation Plans\nFor information on securities authorized for issuance under the Company’s equity compensation plans, see “Item 12 - Security Ownership of Certain Beneficial Owners and Related Stockholder Matters.”\nUnregistered Sales of Equity Securities\nThere were no unregistered sales of the Company’s equity securities during 2020 that were not previously disclosed in a Quarterly Report on Form 10-Q or in a Current Report on Form 8-K.\nRule 10b-18 Transactions\nNone.",
    "item_6": "ITEM 6. SELECTED FINANCIAL DATA\nNot Applicable.",
    "item_7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations, and other parts of this Report contain forward-looking statements that involve risks and uncertainties. All forward-looking statements included in this Report are based on information available to us on the date hereof, and we assume no obligation to update any such forward-looking statements. Our actual results could differ materially from those anticipated in these forward-looking statements as a result of a number of factors, including those set forth in the section captioned “RISK FACTORS” in Item 1A and elsewhere in this Report.\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations is intended to help you understand our Company. This discussion is provided as a supplement to and should be read in conjunction with our consolidated financial statements for the years ended December 31, 2020 and 2019 and the accompanying notes included elsewhere in this Report.\nEffective November 20, 2020, we implemented a reverse stock split of our outstanding common stock at a ratio of 1-for-8. All share figures are reflected on a post-split basis.\nOverview\nWe are a leading identity access management (IAM) platform provider for the enterprise and large-scale customer and civil ID solutions. Built to leverage BIO-key’s world-class biometric core platform among 14 other strong authentication factors, BIO-key PortalGuard and hosted PortalGuard IDaaS are platforms that enable our customers to securely and easily assure that only the right people can access the right systems. PortalGuard goes beyond traditional multifactor authentication (MFA) solutions by addressing sizeable gaps, such as allowing roving users to biometrically authenticate at any workstation without using their phones or tokens, eliminating unauthorized account delegation, detecting duplicate users, and accommodating in-person identification.\nMillions use BIO-key every day to securely access a variety of cloud, mobile and web applications, on-premise and cloud-based hypervisor servers from all of their devices. Employees, contractors, students and faculty sign in through PortalGuard to seamlessly and securely access the applications they need to do their important work, without relying on personal phone use or per-user tokens. Organizations use our platform to securely collaborate with their supply chain and partners, and to provide their customers with flexible, resilient user experiences online or in-person.\nLarge-scale customer and civil ID customers use our scalable biometric management platform and FBI-certified scanner hardware to manage enrollment, de-duplication and authentication for millions of users. One large bank has enrolled and identifies over 10 million of their customers in branches on a daily basis.\nWe sell our branded biometric and FIDO authentication hardware as accessories to our IAM platforms, so that customers can have a single vendor providing all components of their IAM solution. We do not mandate BIO-key hardware and our NIST-certified biometric platform is unique in that it supports interoperable mixing and matching combinations of fingerprint scanners regardless of manufacturer, so that the right scanner can be deployed for the right use case, without mandating the user of a particular scanner.\nSecurity-conscious developers leverage our platform APIs and federation interfaces to securely and efficiently embed biometric and MFA identity capabilities into their software. Our approach to IDaaS allows our customers to efficiently scale their security and identity infrastructures to protect both internal cloud workforce- and external customer-facing applications.\nWe operate a SaaS business model with customers subscribing to term use of our software for annual recurring revenue. We sell our products directly through our field and inside sales teams, as well as indirectly through our network of channel partners including resellers, system integrators, master agents and other distribution partners. Our subscription fees include a term license of hosted or on-premise product and technical support and maintenance of our platform. We base subscription fees primarily on the products used and the number of users enrolled in our platform. We generate subscription fees pursuant to noncancelable contracts with a weighted average duration of approximately one year.\nPortalGuard is used by our customers to manage and secure IT access by their employees, contractors and partners, which we call workforce identity. PortalGuard is also used to manage and secure the identities of an organization’s customers through integration of APIs we have developed and industry-standard federation standards, which we call customer identity. We invoice customers in advance in annual and multi-year prepaid installments for subscriptions to our platforms.\nStrategic Outlook\nHistorically, our largest market has been access control within highly regulated industries such as government, financial services, and healthcare. In 2019 we became the go-to biometric authentication provider for board of election offices as eight offices deployed our hardware and software to secure internal access to the voter registration database. We will seek to extend this footprint in 2021 and beyond.\nIn 2020, we announced that we had secured two of the largest contracts in our history, with our partner Technology Transfer Institute. The contracts, valued at a combined $75,000,000, are for large-scale identification projects in Africa and Nigeria. Under the first contract, we will provide biometric authentication to support the infrastructure of a new e-commerce project developed with the expectation to generate more than one million jobs in Nigeria. The second contract provides for BIO-key hardware and software to be used by a leading African telecommunications company to secure internal access to customer data. Currently Africa and the surrounding regions are receiving government funding to expand the use of biometric authentication solutions to help establish trustworthy government programs and reduce fraud. We received our first purchase order under these contracts in the fourth quarter of 2020 which we expect to ship in the first half of 2021 upon receipt of prepayment for the order. The COVID-19 pandemic has and may continue to delay the rollout of these programs.\nWe plan to have a more significant role in the IAM market which continues to expand. We plan to offer customers a suite of authentication options that complement our biometric solutions. The more well-rounded offerings of authentication options will allow customers to customize their approach to authentication all under one umbrella.\nWe expect to grow our business within government services and highly-regulated industries in which we have historically had a strong presence including financial services, higher education, and healthcare. We believe that continued heightened security and privacy requirements in these industries, and as colleges and universities continue operating in remote environments, we will generate increased demand for security solutions, including biometrics. In addition, we expect that the compatible, yet superior portable biometric user experience offered by our technology for Windows 10 users will accelerate the demand for our computer network log-on solutions and fingerprint readers. Through value add-offerings via direct sales, resellers, and strategic partnerships with leading higher education platform providers, we will continue to grow our installed base.\nOur primary sales strategies are focused on (i) increased marketing efforts into the IAM market, (ii) dedicated pursuit of large-scale identification projects across the globe and (iii) growing our channel alliance program which we have grown to more than forty participants and is starting to generate incremental revenues.\nA second component of our growth strategy is to pursue strategic acquisitions of select businesses and assets in the IAM space. In furtherance of this strategy, we are active in the industry and regularly evaluate businesses that we believe will either provide an entry into new market verticals or be synergistic with our existing operations and in either case, be accretive to earnings. We cannot provide any assurance as to whether we will be able to complete any acquisition and if completed, successfully integrate any business we acquire into our operations.\nRecent Developments\nAs discussed under “Item 1A. Risk Factors” above, an outbreak of a novel strain of the coronavirus, COVID-19, has been recognized as a pandemic by the World Health Organization. This outbreak has severely restricted the level of economic activity around the world. In response to this coronavirus outbreak the governments of many countries, states, cities and other geographic regions have taken preventative or protective actions, including imposing restrictions on travel and business operations and requiring individuals to limit time outside of their homes. Given the uncertainty regarding the spread of this coronavirus, the related financial impact cannot be reasonably estimated at this time.\nThe complications caused by COVID-19 has forced organizations to quickly adapt to a work from home remote business model. This increases the risk of unauthorized users, phishing attacks, and hackers who are eager to take advantage of the challenges of securing remote workers. We believe that biometrics should play a key role in remote user authentication.\nRESULTS OF OPERATIONS\nConsolidated Results of Operations\nTwo Year % trend\nYears ended\nDecember 31,\nRevenues\nServices\n%\n%\nLicense fees\n%\n%\nHardware\n%\n%\n%\n%\nCosts and other expenses\nCost of services\n%\n%\nCost of license fees\n%\n%\nCost of hardware\n%\n%\n%\n%\nGross Profit (Loss)\n%\n%\nOperating expenses\nSelling, general and administrative\n%\n%\nResearch, development and engineering\n%\n%\nTotal operating expenses before impairment\n%\n%\nImpairment of resalable software license rights\n%\n%\nOperating loss\n%\n%\nOther income (expense)\nTotal other income (expense)\n%\n%\nNet loss\n%\n%\nRevenues and Costs and other expenses\n2020 - 2019\n$ Chg\n% Chg\nRevenues\nServices\n$ 1,432,228\n$ 925,245\n$ 506,983\n%\nLicense fees\n962,038\n442,649\n519,389\n%\nHardware\n442,516\n899,634\n(457,118\n)\n%\nTotal Revenue\n$ 2,836,782\n$ 2,267,528\n$ 569,254\n%\nCosts and other expenses\nServices\n$ 502,214\n$ 272,318\n$ 229,896\n%\nLicense fees\n49,891\n916,112\n(866,221\n)\n%\nHardware\n242,721\n1,272,815\n(1,030,094\n)\n%\nTotal Costs and other expenses\n$ 794,826\n$ 2,461,245\n$ (1,666,419\n)\n%\nRevenues\nRevenue increased $569,254 or 25% to $2,836,782 in 2020 as compared to $2,267,528 in 2019 due to the factors stated below.\nFor the years ended December 31, 2020 and 2019, service revenues included approximately $1,383,000 and $904,000, respectively, of recurring maintenance and support revenue, and approximately $49,000 and $21,000, respectively, of non-recurring custom services revenue. Recurring service revenue increased 53% from 2019 to 2020 which is due largely to the additional service revenue from PistolStar customers in the last six months of 2020. Non-recurring custom services increased 134% due to increased new customer installations. As our customer base continues to grow, we expect the service revenue to increase in future periods.\nFor the years ended December 31, 2020 and 2019, license revenue increased approximately $519,000 or 117% to $962,038. We increased both the variation and number of customers, including additional revenue from the PistolStar acquisition in the last six months of 2020.\nHardware sales decreased by approximately $457,000, or 51%, to $442,516 in 2020 as a result of fewer large customer deployments, and reduced lock sales. Fingerprint reader sales decreased approximately $412,000, or 48%, while the biometric locks decreased approximately $45,000, or 98% from 2019.\nCosts of goods sold\nFor the year ended December 31, 2020, cost of service increased approximately 84% to $502,214, due to the increased revenue and the direct support for the PortalGuard installations.\nLicense costs for the year ended December 31, 2020 decreased approximately 95% to $49,891. The decrease was attributable primarily to the amortization and actual deployments of the software rights of approximately $15,000 in 2020 compared to $884,000 in 2019.\nHardware costs for the year ended December 31, 2020 decreased approximately 81% to $242,721. The decrease was attributable primarily to the write down of lock inventory and parts as a result of the discontinuance of lock sales in the US in 2019 and reduction of hardware sales.\nSelling, general and administrative\n2020 - 2019\n$ Chg\n% Chg\n$ 5,848,687\n$ 5,036,820\n$ 811,867\n%\nSelling, general and administrative costs for year ended December 31, 2020 were $5,848,687 representing a 16% increase over 2019. The increase included expenses associated with new marketing personnel and web-site integration of PistolStar, additional costs associated with the PistolStar office staff and expenses, one-time integration costs incurred in connection the acquisition of PistolStar, increased accounting and legal fees incurred in connection with financing transactions, and costs associated with establishing our African subsidiary. These amounts were offset in part by a decrease in travel, bad debt expense, factor fees, and non-cash compensation.\nResearch, development and engineering\n2020 - 2019\n$ Chg\n% Chg\n$ 1,396,436\n$ 1,331,667\n$ 64,769\n%\nFor the year ended December 31, 2020, research, development and engineering costs were $1,396,436 representing a 5% increase over 2019, as a result of an increase in recruiting expenses and the addition of PistolStar expenses. These amounts were offset by a decrease in contracting services and non-cash compensation.\nImpairment\n2020 - 2019\n$ Chg\n% Chg\nImpairment of resalable software license rights\n$ -\n6,957,516\n$ (6,957,516\n)\n%\nImpairment of assets relates to the write-down of the FingerQ resalable software license rights to zero in the fourth quarter of 2019.\nOther income (expense)\n2020 - 2019\n$ Chg\n% Chg\nInterest income\n30,649\n30,495\n19,802\n%\nGovernment grant\n340,819\n-\n340,819\nn/a\nInterest expense\n(4,343,212\n)\n(1,069,134\n)\n(3,274,078\n)\n%\nLoss of extinguishment of debt\n(499,076\n)\n-\n(499,076\n)\nn/a\n$ (4,470,820\n)\n$ (1,068,980\n)\n$ (3,401,840\n)\n%\nInterest expense for 2020 related to the amortization of debt discounts and debt issuance costs relating to convertible notes of approximately $3,574,000, as well as the amortization of a beneficial conversion feature of approximately $641,000. Also included in other income (expense) for 2020 was a loss on the extinguishment of a convertible note in the approximate amount of $500,000 resulting from the issuance of an amended and restated convertible note, for which the issuer did not grant a concession. These amounts were partially offset by amounts received under the Payment Protection Program (the “Program”) the Coronavirus Aid, Relief, and Economic Security Act (“CARES Act”) administered by the U.S. Small Business Administration of approximately $341,000 and interest income of approximately $31,000.\nThe 2019 total includes the write-off of unamortized discount and debt issuance costs related to the April 2019 and June 2019 notes repaid prior to maturity.\nLIQUIDITY AND CAPITAL RESOURCES\nOperating activities overview\nNet cash used for operations during the year ended December 31, 2020 was approximately $4,950,000. Items of note included:\n●\nNet positive cash flows related to non-cash expenses of approximately $6,104,000.\n●\nNet negative cash flows related to changes in accounts receivable, prepayments, accounts payable, accruals, lease liabilities, and deferred revenue of approximately $1,457,000 and our net loss for the period.\nInvesting activities overview\nApproximately $2,230,000 was used for investing activities during the year ended December 31, 2020 and related primarily to the acquisition of PistolStar.\nFinancing activities overview\nApproximately $24,094,000 was provided by financing activities during the year ended December 31, 2020 consisting of the issuance of common stock and warrants in our underwritten public offering, exercise of warrants and issuance of convertible notes. These amounts were offset by repayment of convertible notes, repayment of notes payable and other related party debt, debt service fees, and costs associated with the issuance of our securities.\nSources of Liquidity\nSince our inception, our capital needs have been principally met through proceeds from the sale of equity and debt securities. We expect capital expenditures to be less than $100,000 during the next twelve months.\nThe following sets forth our primary sources of capital during the previous two years:\nWe entered into an accounts receivable factoring arrangement with a financial institution (the “Factor”) which has been extended to October 31, 2021 and may be discontinued at that time. Pursuant to the terms of the arrangement, from time to time, we sell to the Factor a minimum of $150,000 per quarter of certain of our accounts receivable balances on a non-recourse basis for credit approved accounts. The Factor remits 35% of the foreign and 75% of the domestic accounts receivable balance to us (the “Advance Amount”), with the remaining balance, less fees, forwarded to us once the Factor collects the full accounts receivable balance from the customer. In addition, from time to time, we receive over advances from the Factor. Factoring fees range from 2.75% to 15% of the face value of the invoice factored and are determined by the number of days required for collection of the invoice. We expect to continue to use this factoring arrangement periodically to assist with our general working capital requirements due to contractual requirements.\nOn April 4, 2019, we issued a $550,000 secured convertible debenture to an institutional investor with a maturity date of November 15, 2019 which was convertible into common stock at a conversion price of $12.00 per share. On July 10, 2019, this debenture was redeemed and repaid in full in connection with the financing described below.\nOn June 14, 2019, we issued a $157,000 principal amount convertible note to an institutional investor with a maturity date of November 14, 2019 which was convertible into common stock at a conversion price of $12.00 per share. On July 10, 2019, this note was redeemed and repaid in full in connection with the financing described below.\nOn July 10, 2019, we issued a $3,060,000 principal amount senior secured convertible note (the “Original Note”) to an institutional investor. At closing, $2,550,000 was funded. The Original Note was secured by a lien on substantially all of our assets and properties and was convertible into shares of our common stock at a fixed conversion price of $12.00 per share. Pursuant to amendments in the first and second quarter of 2020, we amended the Original Note to increase the principal amount to $3,789,000 as a result of interest and penalties, accelerated the maturity date to June 13, 2020, and reduced the conversion price to $5.20 per share (the “Amended Note”). The full balance of the Amended Note has been converted into common stock.\nOn January 13, 2020, we issued a $157,000 principal amount convertible note to an institutional investor with a maturity date of June 13, 2020 which was convertible into common stock at a conversion price of $12.00 per share. This note was paid in full on June 12, 2020 by payment of $211,984.\nOn February 13, 2020, we issued a $126,000 principal amount convertible note to an institutional investor with a maturity date of July 13, 2020 which was convertible into common stock at a conversion price of $9.20 per share. This note was paid in full on July 10, 2020 by payment of $170,442.\nOn April 20, 2020, we entered into a Paycheck Protection Program Term Note (the “SVB Note”) with Silicon Valley Bank (“SVB”) pursuant to the Program. We received total proceeds of approximately $341,000 which was used in accordance with the requirements of the CARES Act. The full amount of the SVB Note has been forgiven.\nOn May 6, 2020, we issued a $2,415,000 principal amount senior secured convertible note. The principal amount was due and payable in five equal monthly installments of $268,333 beginning seven months after the funding date with the remaining balance due twelve months after the date of funding. Following the completion of the underwritten offering consummated in July 2020 discussed below, all outstanding amounts relating this note were paid in full.\nOn June 29, 2020, we issued a $1,811,250 principal amount senior secured convertible note. The principal amount was due and payable in nine equal monthly installments of $201,250 beginning four months after the funding date. Following the completion of the underwritten offering consummated in July 2020 discussed below, all outstanding amounts relating this note were paid in full.\nOn July 23, 2020, we completed an underwritten public offering of shares of common stock and warrants resulting in net proceeds of approximately $22.7 million, inclusive of the over-allotment and after deducting underwriting discounts and commissions and estimated offering expenses. We used approximately $4.2 million of the net proceeds to repay all outstanding amounts due under outstanding convertible promissory notes at that time.\nLiquidity Outlook\nAt December 31, 2020, our total cash and cash equivalents were approximately $17,000,000, as compared to approximately $79,000 at December 31, 2019. At December 31, 2020 we had working capital of approximately $17,000,000.\nAs discussed above, we have historically financed our operations through access to the capital markets by issuing secured and convertible debt securities, convertible preferred stock, common stock, and through factoring receivables. We currently require approximately $735,000 per month to conduct our operations, a monthly amount that we have been unable to consistently achieve through revenue generation. During 2020, we generated approximately $2,837,000 of revenue, which is below our average monthly requirements. If we are unable to generate sufficient revenue to fund current operations and execute our business plan, we may need to obtain additional third-party financing. As of the date of this report, we do not expect that we will need to obtain additional financing during the next twelve months.\nOur long-term viability and growth will depend upon the successful commercialization of our technologies and our ability to obtain adequate financing. To the extent that we require such additional financing, no assurance can be given that any form of additional financing will be available on terms acceptable to us, that adequate financing will be obtained to meet our needs, or that such financing would not be dilutive to existing stockholders. If available financing is insufficient or unavailable or we fail to continue to generate sufficient revenue, we may be required to further reduce operating expenses, delay the expansion of operations, be unable to pursue merger or acquisition candidates, or in the extreme case, not continue as a going concern.\nOFF-BALANCE SHEET ARRANGEMENTS\nWe do not have any off-balance sheet arrangements that have, or are in the opinion of management reasonably likely to have, a current or future effect on our financial condition or results of operations.\nCRITICAL ACCOUNTING POLICIES\nOur financial statements are prepared in accordance with accounting principles generally accepted in the United States. The preparation of these financial statements requires that we make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting periods. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances. We evaluate our estimates and assumptions on an ongoing basis. Our actual results may differ significantly from these estimates under different assumptions or conditions. There have been no material changes to these estimates for the periods presented in this Annual Report on Form 10-K.\nWe believe that of our significant accounting policies, which are described in Note A of the notes to our consolidated financial statements included in this Annual Report on Form 10-K, the following accounting policies involve a greater degree of judgment and complexity. Accordingly, these are the policies we believe are the most critical to aid in fully understanding and evaluating our financial condition and results of operations, as listed below:\n1. Revenue Recognition\n2. Business Combinations\n3. Goodwill and acquired intangible assets\n4. Impairment or Disposal of Long Lived Assets, including Intangible Assets\n5. Research and Development Expenditures\n6. Income Taxes\n7. Accounting for Stock-Based Compensation",
    "item_7A": "ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nNot Applicable.",
    "item_8": "ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nSee financial statements appearing at pages 37-66 of this Annual Report on Form 10-K.",
    "item_9": "ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.",
    "item_9A": "ITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nOur management, with the participation of our Chief Executive Officer (“CEO”) and Chief Financial Officer (“CFO”), evaluated the effectiveness of our disclosure controls and procedures as of December 31, 2020. The term “disclosure controls and procedures,” as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the “Exchange Act”), means controls and other procedures of a company that are designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the SEC’s rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is accumulated and communicated to the Company’s management, including its principal executive and principal financial officers, as appropriate to allow timely decisions regarding required disclosure. Based on the evaluation of our disclosure controls and procedures as of December 31, 2020, our CEO and CFO concluded that, as of such date, our disclosure controls and procedures were effective at the reasonable assurance level.\nManagement’s Annual Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f). Internal control over financial reporting cannot provide absolute assurance of achieving financial reporting objectives because of its inherent limitations. Internal control over financial reporting is a process that involves human diligence and compliance and is subject to lapses in judgment and breakdowns resulting from human failures. Internal control over financial reporting also can be circumvented by collusion or improper management override. Because of such limitations, there is a risk that material misstatements may not be prevented or detected on a timely basis by internal control over financial reporting. However, these inherent limitations are known features of the financial reporting process. Therefore, it is possible to design into the process safeguards to reduce, though not eliminate, the risk. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nUnder the supervision and with the participation of our management, including our CEO and CFO, we have conducted an evaluation of the effectiveness of our internal control over financial reporting as of December 31, 2020, based upon the framework in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation, management has concluded that our internal control over financial reporting was effective as of December 31, 2020.\nAs we are a smaller reporting company, this annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Management’s report was not subject to attestation by our registered public accounting firm pursuant to rules of the Securities and Exchange Commission that permit the Company to provide only management’s report in this Annual Report on Form 10-K.\nChanges in Internal Control Over Financial Reporting\nNo change in our internal control over financial reporting occurred during the quarter ended December 31, 2020 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.",
    "item_9B": "ITEM 9B. OTHER INFORMATION\nNone.\nPART III",
    "item_10": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe following sets forth certain information about each director, executive officer, and key employee of the Company.\nNAME\nAGE\nPOSITIONS HELD\nMichael W. DePasquale\nChairman of the Board of Directors and Chief Executive Officer\nThomas E. Bush, III (a)* (c)\nDirector\nRobert J. Michel (a) (b)*\nDirector\nThomas Gilley (c)\nDirector\nWong Kwok Fong (Kelvin)\nDirector and Vice-Chairman of the Board of Directors\nPieter Knook (b)\nDirector\nEmmanuel Alia (Manny) (b)\nDirector\nCecilia Welch\nChief Financial Officer\nMira K. LaCous\nChief Technology Officer\nJames Sullivan\nVice President of Strategy and Compliance, Chief Legal Officer\n(a)\nCompensation Committee Member\n(b)\nAudit Committee Member\n(c)\nNominating Committee Member\n*\nIndicates chair of committee\nSet forth below is a brief description of the background and business experience of our directors and executive officers for the past five years.\nDirectors\nMichael W. DePasquale has served as our Chief Executive Officer and a Director since January 3, 2003, and Chairman of the Board since January 29, 2014. He served as Co-Chief Executive Officer of the Company from July 2005 to August 2006. Mr. DePasquale brings more than 30 years of executive management, sales and marketing experience to the Company. Prior to joining us, Mr. DePasquale served as the President and Chief Executive Officer of Prism eSolutions, Inc., a Pennsylvania-based provider of professional consulting services and online solutions for ISO-9001/14000 certification for customers in manufacturing, healthcare and government markets, since February 2001. From December 1999 through December 2000, Mr. DePasquale served as Group Vice President for WRC Media, a New York-based distributor of supplemental education products and software. From January 1996 until December 1999, Mr. DePasquale served as Senior Vice President of Jostens Learning Corp., a California-based provider of multimedia curriculum. Prior to Jostens, Mr. DePasquale held sales and marketing management positions with McGraw-Hill and Digital Equipment Corporation. Mr. DePasquale earned a Bachelor of Science degree from the New Jersey Institute of Technology. He serves as the Vice Chairman on the Board of Directors of the International Biometrics and Identification Industry Association. We believe Mr. DePasquale’s qualifications to sit on the board of directors include his extensive executive management experience in the technology sector and biometric industry expertise which strengthen the board’s collective qualifications, skills and experience.\nThomas E. Bush, III has served as a Director of the Company since January 29, 2014. Since 2009, Mr. Bush has provided business consulting services through his firm, Tom Bush Consulting. Prior to that, Mr. Bush served with the Federal Bureau of Investigation for over 33 years. Mr. Bush joined the FBI in September 1975, ultimately becoming the Director of the CJIS division, with over 2,500 employees and a budget of approximately one billion dollars. Mr. Bush is known for providing critical services in support of the criminal justice community, including two significant IT projects, Next Generation Identification and N-Dex, which were awarded by CJIS during his tenure at the FBI. Mr. Bush has received many awards during his career, most notably a Presidential Rank Award for Meritorious Service in 2007. We believe Mr. Bush’s qualifications to sit on the board of directors include his extensive experience in law enforcement, security matters, and the use of biometric technologies in the government sector, which provide the board with a unique perspective on security and public sector matters.\nRobert J. Michel has served as a Director of the Company since April 10, 2017. He has over 30 years of accounting and financial management experience. Since September, 2018, he has served as the Chief Financial Officer of Daxor Corporation (NYSE MKT: DXR), a medical device manufacturing company specializing in blood volume analysis. Prior to Daxor, from November, 2017 until September 2018, Mr. Michel served as the CFO of Roadway Moving, Inc., a transportation, moving and storage company located in New York City. Immediately prior to Roadway Moving, Inc., Mr. Michel served as a consultant with Feuer & Orlando, LLP, a New York City based CPA firm, from May, 2016 until November 2017. From 2009 until March, 2016, Mr. Michel was the Chief Financial Officer of Asta Funding, Inc. (Nasdaq: ASFI), a diversified financial services company where he was responsible for all financial matters and SEC reporting. From 2004 until 2009, Mr. Michel served as the Controller and the Director of Financial Reporting and Compliance for Asta Funding. Mr. Michel is a certified public accountant, earned a MBA in Taxation from St. John’s University, and a BS in Business Administration from Villanova University. Mr. Michel gained his public accounting experience at PricewaterhouseCoopers in New York. We believe Mr. Michel’s qualifications to sit on the board of directors include his substantial experience in accounting and financial management for public companies which provide the board with a deep knowledge of financial and SEC reporting and strengthen the board’s collective qualifications, skills, and experience.\nThomas Gilley has served as a Director of the Company since January 29, 2014. Mr. Gilley is an entrepreneur, investor and advisor in the connected product Internet of Things (IoT) industry with 37 patents. Since founding his Enterprise Software IoT company in 2012 and selling it in 2016, Mr. Gilley invests in technology companies, serves as growth strategy advisor, and independent board member to companies in the connected industry. Mr. Gilley was previously employed at Apple Computer, in the Advance Technology Group, Portable Products Group and Strategy Advisor. Before and after Apple, Mr. Gilley founded several successful companies including PicoStar, a Silicon Valley incubator-technology investment company, and an on-demand web media company he sold to Vignette. Mr. Gilley acted as CTO throughout the transaction until the company’s ultimate acquisition by OpenText. We believe Mr. Gilley’s qualifications to sit on the board of directors include his substantial experience in starting, operating and financing technology companies which provides the board with a deep knowledge of the sales and development cycles applicable to growth businesses in the technology industry.\nWong Kwok Fong (Kelvin) has served as a Director of the Company since December 4, 2015, as Managing Director of our Hong Kong Subsidiary since August 2016, and as Vice-Chairman of the Board of Directors since March 2019. He is the co-founder of China Goldjoy Group (previously World Wide Touch Technology Holdings Limited), a company listed on The Stock Exchange of Hong Kong. From 1997 until August, 2015, Mr. Wong served as the Chairman of China Goldjoy Group and served as its Chief Technology Officer through October 2016. During this time, Kelvin played a significant role in the substantial growth of the business. Kelvin brings over 15 years of senior management experience in manufacturing, supply chain, and marketing functions in the electronics and technology industries, including establishing manufacturing plants in Hong Kong and China, and building an extensive network in the electronics and technology industries. We believe Kelvin’s qualifications to sit on the board of directors include his substantial experience in the technology industry, including biometrics and payment systems, and serving the Asian markets, which broaden and strengthen the board’s collective qualifications, skills, and experience.\nPieter Knook, has served as a Director of the Company since May 2, 2016. Mr. Knook has over 30 years of experience in mobility and software technology in Europe, Asia and the United States. Since 2010, Mr. Knook has served on the boards of a number of private equity backed and publicly traded early stage technology companies, including Altitude Angel in Reading, the London Internet Exchange, Pulsant in the UK, BroadHorizon in the Netherlands and Telenor in Norway. Mr. Knook served as the Director of Internet Services at Vodafone Group in London from March 2008 through October 2010. Prior to joining Vodafone, Mr. Knook spent 18 years at Microsoft. As President of Microsoft Asia from 1997 to 2001, Mr. Knook led the company’s efforts in opening and expanding Asian markets. He subsequently served as Senior Vice President of Microsoft’s mobile communication business from 2001 through 2008. We believe Mr. Knook’s qualifications to sit on the board of directors include his extensive technology industry experience, which further broaden and strengthen the board’s collective qualifications, skills, and experience.\nEmmanual Alia (Manny), was appointed Director of the Company on April 3, 2020. Since 2018 Mr. Alia has been providing management consulting services as an advisor to businesses seeking market entry strategies to emerging markets such as Africa and the Caribbean. From 2011 to 2018, Mr. Alia served as an Executive Director at the Corporate and Investment division of JPMorgan, and as a Senior Vice-President at CHASE Bank’s Consumer and Community Banking specializing in the financial and banking services industry and opportunities in Africa. During Mr. Alia’s tenure with JPMorgan, he served as head of WholeSale Operations in the Receivables Operations of the Global banking operations in the US and Canada, head of Retail Banking in the Greater Detroit area, and head of branches in the New York and New Jersey areas. For two years Mr. Alia was co-chair of the Black Organizational Leadership Development, an employee networking group in JPMorgan that works with firm’s leadership to strengthen the firm’s message, strategies and community outreach globally. Mr. Alia received a Bachelor of Arts in Accounting from SouthEastern University and a Master’s of Business Administration (MBA) from Cornell University. We believe Mr. Alia’s qualifications to sit on the board of directors include his extensive industry experience and connection and networking abilities in the African communities and markets which further broaden and strengthen the board’s collective qualifications, skills, and experience.\nNon-director Executive Officers\nCecilia Welch has served as the Chief Financial Officer of the Company since December 21, 2009. Ms. Welch joined the Company in 2007 as Corporate Controller. Prior to joining the Company, from January 2006 to December 2006, she was the Controller for Savaje Technologies (acquired by Sun Microsystems), a developer of advanced mobile telephone software. From October 2004 to January 2006, she was Controller for Crystal Systems, a manufacturer of sapphire crystals used for industrial, semiconductor, defense and medical applications. From December 1988 to July 2004, she was the Controller for ATN Microwave (acquired by Agilent Technologies), a manufacturer of automated test equipment. Ms. Welch has a Bachelor’s degree in Accounting from Franklin Pierce University.\nMira K. Lacous has served as Chief Technology Officer of the Company since March 13, 2014. Prior to her appointment as Chief Technology Officer, she served as Senior Vice President of Technology & Development since 2012, and as our Vice President of Technology and Development since 2000. Ms. LaCous has over 30 years of product/project management, solution architecture, software development, team leadership and customer relations experience, with a background that includes successfully bringing numerous technologies to market, including automated voice response systems, automated building control systems, software piracy protection, intranet training materials and testing, page layout and design software, image scanning software and systems, biometric security, and biometric algorithms. Ms. LaCous is also the author of six US patented technologies, multiple international patents, and other patent pending solutions. Ms. LaCous has a Bachelor’s in Computer Science from North Dakota State University.\nJames Sullivan has served as BIO-key’s Senior Vice President of Strategy and Compliance and BIO-key’s Chief Legal Officer since February, 2020, as Senior Vice President of Strategy and Business Development the Company from April 2012 through December 2018, and the dual role as Senior Vice President of Global Sales from August 2015 through December of 2016. Mr. Sullivan is a recognized expert in biometric authentication, cyberlaw and privacy for consumer and mobile applications. During over 17 years with the Company, Mr. Sullivan has directly worked with dozens of the Company’s customers, including AT&T, Israel Defense Forces, LexisNexis, NCR and Omnicell, as well as large-scale biometric-centered identity management projects that interface daily with millions of corporate and consumer users. Mr. Sullivan earned a Juris Doctor cum laude from Georgia State University College of Law, is a member of the Georgia Bar, and enrolled to practice before the IRS. Mr. Sullivan has an undergraduate degree in Computer Science from Brown University and has over 25 years of experience in IT projects and implementation, including directly working with security and identity management solutions at the Company, Computer Associates, Platinum Technology, and Memco Software.\nCommittees of the Board of Directors\nAudit Committee\nOur audit committee is comprised of Robert J. Michel (Chair), Pieter Knook, and Emmanuel Alia, all of whom meet the independence standards for purposes of serving on an audit committee established by NASDAQ and under the Exchange Act. Our audit committee (i) assists the board of directors in its oversight of the integrity of our financial statements, compliance with legal and regulatory requirements, and corporate policies and controls, (ii) has the sole authority to retain and terminate our independent registered public accounting firm, approve all auditing services and related fees and the terms thereof, and pre-approve any non-audit services to be rendered by our independent registered public accounting firm, and (iii) is responsible for confirming the independence and objectivity of our independent registered public accounting firm. Our independent registered public accounting firm has unrestricted access to our audit committee. Our board of directors has determined that Robert J. Michel qualifies as an “audit committee financial expert,” as such term is defined in Item 407 of Regulation S-K.\nOur audit committee operates under a written charter that is reviewed annually. The charter is available on our website at www.bio-key.com.\nCompensation Committee\nOur compensation committee is comprised of Thomas Bush, III (Chair) and Robert Michel, both of whom meet the independence standards established by NASDAQ and under the Exchange Act. The compensation committee’s duties include overseeing our overall compensation philosophy, policies and programs. This includes reviewing and analyzing the design and function of our various compensation components, establishing salaries, incentives and other forms of compensation for officers and non-employee directors, and administering our equity incentive plan. In fulfilling its responsibilities, the compensation committee has the authority to delegate any or all of its responsibilities to a subcommittee of the compensation committee.\nOur compensation committee operates under a written charter that is reviewed annually. The charter is available on our website at www.bio-key.com.\nCode of Ethics\nWe have adopted a Code of Ethics that applies to our principal executive officer, principal financial officer, principal accounting officer or controller, and persons performing similar functions. Our Code of Ethics is designed to deter wrongdoing and promote: (i) honest and ethical conduct, including the ethical handling of actual or apparent conflicts of interest between personal and professional relationships; (ii) full, fair, accurate, timely and understandable disclosure in reports and documents that we file with, or submit to, the SEC and in our other public communications; (iii) compliance with applicable governmental laws, rules, and regulations; (iv) the prompt internal reporting of violations of the code to an appropriate person or persons identified in the code; and (v) accountability for adherence to the code. We intend to disclose amendments or waivers of the Code of Ethics on our website within four business days. Any person may obtain a copy of our Code of Ethics free of charge by sending a written request for such to the attention of the Chief Financial Officer of the Company, 3349 Highway 138, Building A Suite E, Wall, NJ 07719.\nTerm of Office\nOur directors are elected at the annual meeting of stockholders and hold office until the annual meeting of the stockholders next succeeding his or her election, or until his or her prior death, resignation or removal in accordance with our bylaws. Our officers are appointed by the Board and hold office until the annual meeting of the Board next succeeding his or her election, and until his or her successor shall have been duly elected and qualified, subject to earlier termination by his or her death, resignation or removal.\nDelinquent Section 16(a) Reports\nReports of all transactions in our common stock by officers, directors and ten percent (10%) stockholders are required to be filed with the SEC pursuant to Section 16(a) of the Exchange Act. Based solely on our review of copies of the reports received, or representations of such reporting persons, we believe that during the year ended December 31, 2020, all Section 16(a) filing requirements applicable to our officers, directors and ten percent (10%) stockholders were satisfied in a timely fashion, except for one late Form 4 filing by Mr. Sullivan.",
    "item_11": "ITEM 11. EXECUTIVE COMPENSATION\nThe following table sets forth a summary of the compensation paid to or accrued by our chief executive officer and the two most highly compensated executive officers other than our chief executive officer, for the fiscal years ended December 31, 2020 and 2019:\nSUMMARY COMPENSATION TABLE\nName\nFiscal\nYear\nSalary\n($)\nBonus\n($)\nOption\nAwards\n($) (1)\nStock\nAwards\n($) (2)\nAll Other\nCompensation\n($) (3)\nTotal\n($)\nMichael W. DePasquale\n275,000\n50,000\n-\n21,450\n2,219\n348,669\nChief Executive Officer\n275,000\n-\n34,510\n-\n1,127\n310,637\nMira K. LaCous\n213,000\n-\n-\n21,450\n2,493\n236,943\nChief Technology Officer\n213,075\n-\n12,941\n-\n1,401\n227,417\nJames Sullivan\n150,000\n35,000\n-\n21,450\n137,238 (4)\n343,688\nChief Legal Officer\n150,000\n-\n25,883\n-\n55,240 (5)\n231,123\n(1)\nThe aggregate grant date fair value of the option awards was estimated using the Black-Scholes option pricing model, with the assumptions listed in Note A to the Company’s financial statements. The amount shown in this column represents the grant date fair value calculated under FASB ASC 718.\n(2)\nThe aggregate grant date fair value of the restricted shares is calculated by the multiplying the quantity of shares issued by the closing trading price of the shares on the date of issuance calculated under FASB ASC 718.\n(3)\nConsists of life insurance premiums paid by the Company except as otherwise noted.\n(4)\n(5)\nConsists of $135,383 of sales commissions and $1,855 of life insurance premiums paid by the Company.\nConsists of $53,385 of sales commissions and $1,855 of life insurance premiums paid by the Company.\nNarrative Disclosure to Summary Compensation Table\nCompensation for our executives is comprised of three main components: base salary, annual performance-based cash bonus, and long-term equity awards. We do not target a specific weighting of these three components or use a prescribed formula to establish pay levels. Rather, the board of directors and compensation committee considers changes in the business, external market factors and our financial position each year when determining pay levels and allocating between long-term and current compensation for the named executive officers.\nCash compensation is comprised of base salary and an annual performance-based cash bonus opportunity. The compensation committee generally seeks to set a named executive officer’s targeted total cash compensation opportunity within a range that is the average of the applicable peer company and/or general industry compensation survey data, adjusted as appropriate for individual performance and internal pay equity and labor market conditions.\nIn setting cash compensation levels, we favor a balance in which base salaries are generally targeted at slightly below the peer average and a bonus opportunity that is targeted at slightly above the average. The base salary of our CEO has not been increased since 2018. In 2020, we increased the base salary of Mr. Sullivan to $225,000 to compensate for the fact that in connection with his promotion to Chief Legal Officer, he would be limited to sales commissions on only three of his existing long term accounts.\nPerformance-based bonuses have historically been based upon the achievement of certain revenue milestones established by the compensation committee. The committee believes that this higher emphasis on performance-based cash bonuses places an appropriate linkage between a named executive officer’s pay, his or her individual performance, and the achievement of specific business goals by placing a higher proportion of annual cash compensation at risk, thereby aligning executive opportunity with the interests of stockholders.\nIn 2020, due to extraordinary efforts in maintaining operations during the pandemic, acquiring PistolStar, and the completing an underwritten public offering, Mr. DePasquale and Mr. Sullivan were awarded cash bonuses of $50,000 and $35,000, respectively. Based on the performance of the Company in 2019, we did not award any discretionary incentive compensation to our named executive officers.\nWe also include an equity component as part of our compensation package because we believe that equity-based compensation aligns the long-term interests of our named executive officers with those of stockholders. In March 2019, we issued options to Mr. DePasquale to purchase 4,167 of common stock, to Mr. Sullivan to purchase 3,125 shares of common stock, and to Ms. LaCous to purchase 1,563 shares of common stock. The foregoing options have an exercise price of $9.44 per share, the last sales price of our common stock on the date of grant, have a term of seven years, and vest in three equal annual installments commencing March 21, 2020. We did not issue any options to the named executive officers in 2020. In August 2020, we issued 4,125 shares of restricted stock to Mr. DePasquale, Mr. Sullivan and Ms. LaCous. These shares vest in equal annual installments over a three-year period from the date of grant.\nThese cash and equity compensation components of pay are supplemented by various benefit plans that provide health, life, accident, disability and severance benefits, most of which are the same as the benefits provided to all of our US based employees.\nEmployment Agreements\nOn March 26, 2010, we entered into an employment agreement, effective as of March 25, 2010, with Michael W. DePasquale to serve as our Chief Executive Officer until March 24, 2011. The agreement automatically renews for subsequent one-year terms, unless the employment relationship is terminated by either party, or modified in accordance with the terms and conditions of the agreement. Since 2018, Mr. DePasquale’s annual base salary has been $275,000, subject to adjustment by the compensation committee. In addition to the base salary, a “Performance Bonus” may be awarded to Mr. DePasquale on the basis of the Company achieving certain corporate and strategic performance goals, as determined by the compensation committee in its sole discretion. The employment agreement contains standard and customary confidentiality, non-solicitation and “work made for hire” provisions as well as a covenant not to compete which prohibits Mr. DePasquale from doing business with any current or prospective customer of the Company or engaging in a business competitive with that of the Company during the term of his employment and for the one-year period thereafter. This agreement also contains a number of termination and change in control provisions as described under the captions “Termination Arrangements” and “Change in Control Arrangements” below.\nOn April 5, 2017, we entered into an employment agreement with James Sullivan. The agreement automatically renews for subsequent one-year terms, unless terminated by the Company upon at least two months prior written notice which is treated as termination without cause. Under this agreement, Mr. Sullivan’s initial base salary was $150,000 plus commissions, subject to adjustment. The agreement contains standard and customary confidentiality, technical invention provisions as well as non-competition and non-solicitation covenants which prohibit Mr. Sullivan from doing business with any current or prospective customer of the Company or engaging in any business competitive with that of the Company during the term or his employment and for the one-year period thereafter. The agreement also contains a number of termination provisions as described under the caption “Termination Agreements” below.\nOn November 20, 2001, we entered into an employment agreement with Mira LaCous. The agreement automatically renews for subsequent one-year terms, unless terminated by the Company upon at least one-month prior written notice which is treated as termination without cause and provides for a discretionary bonus which shall not exceed 50% of base salary. The agreement contains standard and customary confidentiality, technical invention provisions as well as non-competition and non-solicitation covenants which prohibit Ms. LaCous from doing business with any current or prospective customer of the Company or engaging in any business competitive with that of the Company during the term or her employment and for the one-year period thereafter. The agreement also contains a number of termination provisions as described under the caption “Termination Agreements” below.\nStock Option Grants and Restricted Stock Awards\nIn the event of any change in the outstanding shares of our common stock by reason of a stock dividend, stock split, combination of shares, recapitalization, merger, consolidation, transfer of assets, reorganization, conversion or what the board deems to be similar circumstances, the number and kind of shares subject to outstanding options and restricted stock awards, and the exercise price of such options shall be appropriately adjusted. Restricted Furthermore, option agreements and restricted stock award agreements contain change of control provisions as described under the caption “Change in Control Provisions” below.\nOUTSTANDING EQUITY AWARDS AT FISCAL YEAR END\nDECEMBER 31, 2020\nThe following table sets forth for each named executive officer, information regarding outstanding equity awards as at December 31, 2020. The option awards and per share amounts for all periods reflect our 1-for-8 reverse stock split, which was effective November 20, 2020.\nOption Awards\nStock Awards\nName\nNumber of\nsecurities\nunderlying\nunexercised\noptions\nexercisable\n(#)\nNumber of\nsecurities\nunderlying\nunexercised\noptions\nunexercisable\n(#)\nOption\nexercise\nprice\n($)\nOption\nexpiration\ndate\nNumber of\nshares or units\nof stock that\nhave not vested\n(#)\nMarket value of\nshares of units of\nstock that have not\nvested\n($)(1)\nMichael W. DePasquale\n2,605\n39.35\n3/13/2021\n4,125\n14,520\n2,605\n17.27\n8/13/2022\n31,250\n21.20\n3/16/2024\n2,778\n1,389 (2)\n15.68\n3/23/2025\n1,389\n2,778 (3)\n9.44\n3/21/2026\nMira LaCous\n1,563\n39.36\n3/13/2021\n4,125\n14,520\n1,042\n17.27\n8/13/2022\n12,500\n21.20\n3/16/2024\n1,042\n(2)\n15.68\n3/23/2025\n1,042 (3)\n9.44\n3/21/2026\nJames Sullivan\n1,563\n39.36\n3/13/2021\n4,125\n14,520\n2,084\n17.27\n8/13/2022\n12,500\n21.20\n3/16/2024\n2,084\n1,041 (2)\n15.68\n3/23/2025\n1,042\n2,083 (3)\n9.44\n3/21/2026\n(1)\nCalculated based on the closing market price of the Company’s common stock on December 31, 2020 of $3.52 per share.\n(2)\nThe options vest equally in three annual installments commencing March 23, 2019.\n(3)\nThe options vest equally in three annual installments commencing March 21, 2020.\nNarrative Disclosure to Outstanding Equity Awards at Fiscal Year End Table\nThe following are the material terms of each agreement, contract, plan or arrangement that provide for payments to one or more of our named executive officers at, following or pursuant to their resignation, retirement or termination, or in connection with a change in control of the Company.\nTermination Arrangements\nWe may terminate our employment agreement with Mr. DePasquale at any time with or without cause. In the event of termination by us without cause, we will continue to pay Mr. DePasquale his then current base salary for the greater of nine months from the date of such termination or the number of months remaining until the end of the term of the agreement.\nWe may terminate our employment agreement with Mr. Sullivan at any time with or without cause. In the event of termination by us without cause, we will continue to pay Mr. Sullivan his then current base salary, plus earned commissions, for the greater of six months from the date of such termination or the number of months remaining until the end of the term of the agreement.\nWe may terminate our employment agreement with Ms. LaCous at any time with or without cause. In the event of termination by us without cause, we will continue to pay Ms. LaCous her then current base salary for nine months from the date of such termination.\nChange in Control Provisions\nOur 2015 Equity Incentive Plan (the “Plan”) provides for the acceleration of vesting of unvested options and termination of any restriction or forfeiture provisions applicable to restricted stock awards upon a “Change in Control” of the Company. A Change in Control is defined in the Plans to include (i) a sale or transfer of substantially all of the Company’s assets; (ii) the dissolution or liquidation of the Company; (iii) a merger or consolidation to which the Company is a party and after which the prior stockholders of the Company hold less than 50% of the combined voting power of the surviving corporation’s outstanding securities; (iv) the incumbent directors cease to constitute at least a majority of the Board of Directors; or (v) a change in control of the Company which would otherwise be reportable under Section 13 or 15(d) of the Exchange Act. In the event of a “Change In Control” the Plan provides for the immediate vesting of all options issued thereunder and termination of all forfeiture provisions applicable to restricted stock award issued thereunder. Options issued to executive officers outside of the Plans contain change in control provisions substantially similar to those contained in the Plans.\nOur employment agreement with Mr. DePasquale contains a change in control provision that is triggered if Mr. DePasquale is not offered continued employment with us or any successor, or within five years following such Change of Control, we or any successor terminate Mr. DePasquale’s employment without cause. If this occurs, then we will pay Mr. DePasquale his base salary and benefits earned but unpaid through the date of termination, and any prorated bonus earned during the then current bonus year, plus two times his then current base salary.\nDIRECTOR COMPENSATION FOR THE FISCAL YEAR ENDED\nDECEMBER 31, 2020\nThe following table sets forth for each director, information regarding their compensation for the year ended December 31, 2020:\nName (1)\nStock Awards\n($) (2)\nTotal\n($)\nThomas E. Bush, III (3)\n4,502\n4,502\nThomas Gilley (3)\n4,002\n4,002\nYau Jianhui (4)\n1,001\n1,001\nPieter Knook (5)\n6,002\n6,002\nRobert J Michel (5)\n6,502\n6,502\nFabian Shin (6)\n4,001\n4,001\nAlia, Emmanuel (7)\n3,501\n3,501\n(1)\nMr. DePasquale and Kelvin Wong have been omitted from the above table because they do not receive any additional compensation for serving on our Board of Directors.\n(2)\nThe aggregate fair value of the common stock issued was calculated based on the closing price of our common stock on the date of issuance in accordance with FASB ASC 718.\n(3)\nAt December 31, 2020, Messrs. Bush and Gilley each held options to purchase 2,716 shares of common stock.\n(4)\nAt December 31, 2020, Mr. Jianhui held options to purchase 188 shares of common stock. Mr. Jianhui was not nominated for re-election to the Board of Directors at Company’s Annual Meeting in 2020.\n(5)\nAt December 31, 2020, Messrs. Knook and Michel each held options to purchase 2,064 shares of common stock.\n(6)\nAt December 31, 2020, Mr. Shin held options to purchase 501 shares of common stock. Mr. Shin resigned from the Board of Directors on September 2, 2020.\n(7)\nAt December 31, 2020, Mr. Alia held options to purchase 313 shares of common stock.\nNarrative Disclosure to Director Compensation Table\nDuring 2020, we had a policy to pay to each non-employee director $3,000 per board meeting, $1,000 per telephonic board meeting, and $500 per board committee meeting attended. Fees for attendance at regular quarterly board meetings held during the first three quarters of each fiscal year are paid through the issuance of common stock and payments for the last meeting of the year are paid in cash or, at the option of the director, in shares of common stock. All of our directors elected to receive payment in common stock for the last board meeting in 2020. All directors will be indemnified by us for actions associated with being a director to the fullest extent permitted under Delaware law. We reimburse each of our non-employee directors for their reasonable expenses incurred in connection with attending meetings of the board of directors and related committees.",
    "item_12": "ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth, as of March 26, 2021 information with respect to the securities holdings of all persons that we, pursuant to filings with the SEC and our stock transfer records, have reason to believe may be deemed the beneficial owner of more than 5% of our common stock. The following table also sets forth, as of such date, the beneficial ownership of our common stock by all of our current officers and directors, both individually and as a group.\nThe beneficial owners and amount of securities beneficially owned have been determined in accordance with Rule 13d-3 under the Exchange Act and, in accordance therewith, include all shares of our common stock that may be acquired by such beneficial owners within 60 days of March 99999, 2021 upon the exercise or conversion of any options, warrants or other convertible securities. This table has been prepared based on 7,817,475 shares of common stock outstanding on March 26, 2021.\nName and Address of Beneficial Owner (1)\nAmount and Nature\nof Beneficial\nOwnership\nPercentage\nof\nClass\nMichael W. DePasquale\n60,988 (2)\n*\nCecilia Welch\n28,189 (3)\n*\nMira LaCous\n21,835 (4)\n*\nJames Sullivan\n37,523 (5)\n*\nThomas Gilley\n6,239 (6)\n*\nRobert J. Michel\n5,686 (7)\n*\nThomas E. Bush, III\n5,758 (8)\n*\nPieter Knook\n5,164 (9)\n*\nEmmanuel Alia\n(10)\n*\nWong Kwok Fong (Kelvin)\n578,659 (11)\n7.4\n%\nAll officers and directors as a group (10) persons\n751,039\n9.6 %\nLind Global Micro Fund, LP\n833,126 (12)\n9.6\n%\n*\nLess than 1%\n(1)\nUnless otherwise indicated, the address of each person listed below is c/o BIO-key International, Inc., 3349 Highway 138, Building A, Suite E, Wall, NJ 07719.\n(2)\nIncludes 43,405 shares issuable on exercise of options and 4,125 shares of restricted stock of which 4,125 remain subject to vesting. Does not include 1,389 shares issuable upon exercise of options subject to vesting.\n(3)\nConsists of shares issuable upon exercise of options and 4,125 shares of restricted stock of which 4,125 remain subject to vesting. Does not include 1,041 shares issuable upon exercise of options subject to vesting.\n(4)\nConsists of shares issuable upon exercise of options and 4,125 shares of restricted stock of which 4,125 remain subject to vesting. Does not include 521 shares issuable upon exercise of options subject to vesting.\n(5)\nIncludes 21,355 shares issuable on exercise of options and 4,125 shares of restricted stock of which 4,125 remain subject to vesting. Does not include 1,042 shares issuable upon exercise of options subject to vesting.\n(6)\nIncludes 2,300 shares issuable on exercise of options. Does not include 416 shares issuable upon exercise of options subject to vesting.\n(7)\nIncludes 1,648 shares issuable on exercise of options. Does not include 416 shares issuable upon exercise of options subject to vesting.\n(8)\nIncludes 2,300 shares issuable on exercise of options. Does not include 416 shares issuable upon exercise of options subject to vesting.\n(9)\nIncludes 1,648 shares issuable on exercise of options. Does not include 416 shares issuable upon exercise of options subject to vesting.\n(10)\nConsists of shares of common stock. Does not include 313 shares issuable upon exercise of options subject to vesting.\n(11)\nIncludes 25,695 shares issuable on exercise of options. The address of Kelvin is Flat C, 27/F, Block 5, Grand Pacific Views, Siu Lam, Hong Kong N7.\n(12)\nIncludes 833,125 shares issuable upon exercise of warrants. The address of Lind Global Capital Micro Fund, LP is 444 Madison Ave, Floor 41, New York, NY 10022\nEQUITY COMPENSATION PLAN INFORMATION\nThe following table sets forth, as of December 31, 2020, information with respect to securities authorized for issuance under equity compensation plans. The shares and per share amounts reflect BIO-key’s 1-for-8 reverse stock split, which was effective November 20, 2020.\nNumber of\nsecurities to be\nissued\nupon exercise\nof outstanding\noptions,\nwarrants and\nrights\n(a)\nWeighted-\naverage\nexercise price\nof outstanding\noptions,\nwarrants and\nrights\n(b)\nNumber\nof securities\nremaining\navailable for\nfuture issuance\nunder equity\ncompensation\nplans\n(excluding\nsecurities\nreflected in\ncolumn (a))\n(c)\nEquity compensation plans approved by security holders\n94,183\n10.73\n36,086\nEquity compensation plans not approved by security holders\n133,091\n$ 22.48\n-\nTotal\n227,274\n$ 17.61\n36,086\nOn January 27, 2016, the stockholders approved the 2015 Equity Incentive Plan (the “2015 Plan”). Under the terms of this plan, 187,500 shares of common stock are reserved for issuance to employees, officers, directors, and consultants of the Company at exercise prices which may not be below 100-110% of fair market value. The term of stock options granted may not exceed ten years. Options issued under the 2015 Plan vest pursuant to the terms of stock option agreements with the recipients. In the event of a change in control, certain stock awards issued under this plan may be subject to additional acceleration of vesting as may be provided in the participants’ written agreement. The 2015 Plan expires in December 2025.\nIn addition to options issued under the 2015 Plan, we have issued options to purchase common stock to employees, officers, directors and consultants outside of the plan. As of December 31, 2020, there were outstanding non-plan options to purchase 133,091 shares of common stock. The terms of these outstanding options are substantially similar to the provisions of the 2015 Plan and options issued thereunder. In the event of change in control, as defined, certain of the non-plan options outstanding vest immediately.",
    "item_13": "ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nStandstill Agreement with Principal Stockholder\nPursuant to separate securities purchase agreements dated October 29, 2015 and November 11, 2015 with each of Wong Kwok Fong (Kelvin), Micron, and Giant Leap we issued and sold shares of series A-1 stock to Kelvin and shares of series B-1 stock to Micron and Giant Leap, which were subsequently converted into shares of our common stock. The forgoing agreements contain a standstill provision (the “Standstill”) which prohibits each of these investors either alone or together with any other person, from acquiring additional shares of our common stock or any of our assets, soliciting proxies, or seeking representation on our board of directors. Kelvin is the Co-Chairman of the board of directors, and an executive officer.\nLoans from Wong Kwok Fong (Kelvin)\nBetween March 2019 and February 2020, we received a series of non-interest-bearing advances from Mr. Wong Kwok Fong (Kelvin) in the aggregate amount of $217,360 to pay current liabilities. The amounts were repaid in their entirety during the 2020 fiscal year. Mr. Wong is the Vice-Chairman of the Board, an executive officer, and a principal stockholder of the Company.\nLoans from Michael W. DePasquale\nIn December 2019, we received two non-interest-bearing advances from Michael DePasquale in the aggregate amount of $114,000 to pay current liabilities. The amounts were repaid in their entirety during the 2020 fiscal year. Mr. DePasquale serves as the Chairman of the Board and Chief Executive Officer of the Company.\nSales Incentive Agreement with Technology Transfer Institute (“TTI”)\nOn March 25, 2020, we entered into a sales incentive agreement TTI. The agreement provides that for each $5,000,000 in revenue (up to a maximum of $20,000,000), TTI generates for the Company during the first year that generate net income (calculated under U.S. generally accepted accounting principles) of at least 20%, we will pay TTI a sales incentive fee of $500,000 payable by the issuance of 62,500 shares of common stock. In the event that TTI generates revenue for the Company in excess of $20,000,000 during first year, we will issue TTI a five-year warrant to purchase 12,500 shares of Common Stock at an exercise price of $12.00 per share for each $1,000,000 of revenue in excess of $20,000,000 (up to a maximum of $25,000,000). In no event will we be obligated to issue more than 250,000 shares of common stock or warrants to purchase more than 62,500 shares of common stock pursuant to this agreement. Manny Alia, a member of our board of directors, served as the Chief Executive Officer of TTI until August 12, 2020.\nDirector Independence\nAs required under the NASDAQ Marketplace Rules, a majority of the members of a listed company’s board of directors must qualify as “independent,” as affirmatively determined by the board of directors. Our board considered certain relationships between our directors and us when determining each director’s status as an “independent director” under Rule 5605(a)(2) of the NASDAQ Marketplace Rules. Based upon such definition and SEC regulations, we have determined that Robert Michel, Pieter Knook, Emmanuel Alia, Thomas Bush, III, and Thomas Gilley are “independent” under NASDAQ standards.",
    "item_14": "ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe following table shows fees for professional services and quarterly audit fees billed to us by Rotenberg Meril Solomon Bertiger & Guttilla, P.C. (“RMSBG”) for the audit of our annual consolidated financial statements for the years ended December 31, 2020 and 2019:\nAudit Fees\n$ 124,200\n$ 104,743\nAudit-Related Fees\n76,925\n7,204\nTax Fees\n16,000\n18,500\nTotal Fees\n$ 217,125\n$ 130,447\nAudit Fees consist of fees billed for professional services rendered for the audit of our financial statements and review of the interim financial statements included in quarterly reports and services that are normally provided by our auditors in connection with statutory and regulatory filings or engagements.\nAudit-Related Fees consist of fees billed for assurance and related services that are reasonably related to the performance of the audit or review of our financial statements and which are not reported under audit fees. These fees relate primarily to services provided in connection with registration of securities and review of documents filed with the SEC.\nTax Fees consist of fees billed for professional services for tax compliance assistance rendered during the fiscal year.\nAudit Committee Pre-Approval Procedures\nThe audit committee of our board of directors consists of Robert J. Michel (Chairman), Pieter Knook, and Emmanuel Alia. The audit committee approves the engagement of our independent auditors to render audit and non-audit services before they are engaged. All of the fees for 2020 and 2019 shown above were pre-approved by the audit committee.\nThe audit committee pre-approves all audit and other permitted non-audit services provided by our independent auditors. Pre-approval is generally provided for up to one year, is detailed as to the particular category of services and is subject to a monetary limit. Our independent auditors and senior management periodically report to the audit committee the extent of services provided by the independent auditors in accordance with the pre-approval, and the fees for the services performed to date. The audit committee may also pre-approve particular services on a case-by-case basis.\nOur audit committee will not approve engagements of our independent registered public accounting firm to perform non-audit services for us if doing so will cause our independent registered public accounting firm to cease to be independent within the meaning of applicable SEC rules. In addition, our audit committee considers, among other things, whether our independent registered public accounting firm is able to provide the required services in a more or less effective and efficient manner than other available service providers.\nPART IV",
    "item_15": "ITEM 15. - EXHIBITS\n(a) The following documents are filed as part of this Report. Portions of Item 15 are submitted as separate sections of this Report:\n(1) Financial statements filed as part of this Report:\nReports of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as at December 31, 2020 and 2019\nConsolidated Statements of Operations-Years ended December 31, 2020 and 2019\nConsolidated Statements of Stockholders’ Equity (Deficit)-Years ended December 31, 2020 and 2019\nConsolidated Statements of Cash Flows-Years ended December 31, 2020 and 2019\nNotes to Consolidated Financial Statements-December 31, 2020 and 2019\n(b) The exhibits listed in the Exhibits Index immediately preceding such exhibits are filed as part of this Report\nITEM 16. - FORM 10-K SUMMARY\nNone.\nFINANCIAL STATEMENTS\nThe following financial statements of BIO-key International, Inc. are included herein at the indicated page numbers:\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as at December 31, 2020 and 2019\nConsolidated Statements of Operations-Years ended December 31, 2020 and 2019\nConsolidated Statements of Stockholders’ Equity (Deficit) -Years ended December 31, 2020 and 2019\nConsolidated Statements of Cash Flows-Years ended December 31, 2020 and 2019\nNotes to the Consolidated Financial Statements-December 31, 2020 and 2019\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and Board of Directors of\nBIO-key International, Inc.\nWall, NJ\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of BIO-key International, Inc. and Subsidiaries (the “Company”) as of December 31, 2020 and 2019, and the related consolidated statements of operations, stockholders’ equity (deficit) and cash flows for the years then ended, and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2020 and 2019, and the results of its operations and its cash flows for the years then ended in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on these financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (“PCAOB”) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current-period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) are especially challenging, subjective, or complex judgements. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nRevenue Recognition - Refer to Notes A and B of the consolidated financial statements\nDescription of the Matter\nThe Company’s revenues are generated pursuant to written contractual arrangements to provide software licenses and/or hardware and to provide related maintenance and support services or professional services. The Company’s performance obligations are either satisfied at a point in time when the customer obtains control of the hardware or is granted the software license or satisfied over time for maintenance revenue over the contractual period. Software licenses may be sold as perpetual licenses or subscription licenses. Contracts may include multiple performance obligations. Significant judgment is exercised by the Company in determining revenue recognition for these contractual arrangements, and includes the following:\n●\nDetermination of whether products and services are considered distinct performance obligations that should be accounted for separately versus together, such as software licenses and related services that are sold with cloud-based services.\n●\nThe pattern of delivery (i.e., timing of when revenue is recognized) for each distinct performance obligation.\n●\nIdentification and treatment of contract terms that may impact the timing and amount of revenue recognized (e.g., variable consideration and/or optional purchases).\n●\nDetermination of stand-alone selling prices for each distinct performance obligation and for products and services that are not sold separately.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures included:\n●\nWe obtained an understanding of the Company’s revenue recognition process including the various product and service offerings;\n●\nWe reviewed management’s assessment of the terms and conditions of contracts with customers which included an analysis of the distinct performance obligations and a review of the conclusion as to whether revenue from such performance obligations should be recognized over time or at a point in time;\n●\nWe selected a sample of contracts with customers and performed the following:\no Obtained and read customer sales orders and/or sales invoices and other documents that are part of the agreement.\no Tested management’s process for identifying distinct performance obligation(s) in the contract;\no Tested the allocation between software revenue and maintenance revenue including testing any carve out of maintenance from subscription based software and maintenance sales.\nThe outcome of the audit procedures resulted in determining the amounts of revenue and the application of ASC 606 is reasonable.\nPistolStar, Inc. Acquisition - Refer to Note C of the consolidated financial statements\nDescription of the Matter\nOn June 30, 2020, the Company acquired PistolStar, Inc. The total purchase price included a cash payment of $2,000,000 and the issuance of a $500,000 promissory note. The Company accounted for the acquisition under the acquisition method of accounting for business combinations. The promissory note component of the purchase price was adjusted to fair value of $464,000, resulting in total purchase consideration of $2,464,000. The purchase price was allocated to the assets acquired and liabilities assumed based on their respective fair values.\nManagement utilized the services of an outside business valuation and advisory firm to assist with determining the fair values of the purchase consideration, deferred revenue and identified intangible assets. The fair values of the identified intangible assets and deferred revenue were estimated by the outside firm using discounted cash flow analysis including the relief-from-royalty method for proprietary software and trade names, excess earnings method for customer relationship, and cost to recreate methodology for assembled workforce, the latter of which is included with residual goodwill. Determining the fair value of the identified intangible assets acquired requires significant judgment, including the amount and timing of expected future cash flows and the selected discount rate.\nWe identified the assumptions related to estimating the amount and timing of the expected future cash flows and discount rate to be a critical audit matters given the inherent judgement involved in estimating these amounts. Performing audit procedures to evaluate the reasonableness of these estimates and assumptions require a high degree of auditor judgement and an increased extent of effort.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures included:\n●\nWe obtained an understanding of the Company's process to determine the fair value of the net assets acquired.\n●\nWe read the stock purchase agreement;\n●\nWe evaluated the reasonableness of the following:\no Valuation methodologies utilized by the outside business valuation and advisory firm in estimating fair values of assets acquired and liabilities assumed;\no The discount rates utilized, including testing the source of information underlying the determination of the discount rates, testing the mathematical accuracy of the calculation, and developing a range of independent estimates and comparing those to the discount rates used by management.\nThe outcome of the audit procedures resulted in determining that the values recorded by management and provided by the outside business valuation and advisory firm are reasonable.\n/s/ Rotenberg Meril Solomon Bertiger & Guttilla,P.C.\nROTENBERG MERIL SOLOMON BERTIGER & GUTTILLA, P.C.\nWe have served as the Company's auditor since 2010.\nSaddle Brook, New Jersey\nMarch 29, 2021\nBIO-key International, Inc. and Subsidiaries\nCONSOLIDATED BALANCE SHEETS\nDecember 31,\nASSETS\nCash and cash equivalents\n$ 16,993,096\n$ 79,013\nAccounts receivable, net\n548,049\n126,000\nDue from factor\n60,453\n110,941\nNote receivable\n295,000\n-\nInventory\n330,947\n429,119\nPrepaid expenses and other\n201,507\n108,397\nInvestment - debt security\n512,821\n512,821\nTotal current assets\n18,941,873\n1,366,291\nResalable software license rights\n58,882\n73,802\nEquipment and leasehold improvements, net\n81,793\n95,509\nCapitalized contract costs, net\n165,315\n231,519\nDeposits and other assets\n8,712\n8,712\nOperating lease right-of-use assets\n487,325\n566,479\nIntangible assets, net\n1,514,146\n154,386\nGoodwill\n1,262,526\n-\nTotal non-current assets\n3,578,699\n1,130,407\nTOTAL ASSETS\n$ 22,520,572\n$ 2,496,698\nLIABILITIES\nAccounts payable\n$ 244,158\n$ 844,557\nLoans payable - related parties\n-\n188,737\nAccrued liabilities\n508,487\n572,885\nConvertible notes payable, net of debt discount and debt issuance costs\n-\n2,255,454\nNote payable - PistolStar acquisition, net of debt discount\n232,000\n-\nDeferred revenue - current\n657,349\n359,212\nOperating lease liabilities, current portion\n234,309\n170,560\nTotal current liabilities\n1,876,303\n4,391,405\nDeferred revenue - long term\n44,987\n-\nOperating lease liabilities, net of current portion\n264,163\n390,466\nTotal non-current liabilities\n309,150\n390,466\nTOTAL LIABILITIES\n2,185,453\n4,781,871\nCommitments\nSTOCKHOLDERS’ EQUITY (DEFICIT)\nCommon stock - authorized, 170,000,000 shares; issued and outstanding; 7,814,572 and 1,812,483 of $.0001 par value at December 31, 2020 and December 31, 2019, respectively\nAdditional paid-in capital\n119,844,026\n87,437,661\nAccumulated deficit\n(99,509,689\n)\n(89,723,016\n)\nTOTAL STOCKHOLDERS’ EQUITY (DEFICIT)\n20,335,119\n(2,285,173\n)\nTOTAL LIABILITIES AND STOCKHOLDERS’ EQUITY (DEFICIT)\n$ 22,520,572\n$ 2,496,698\nAll BIO-key shares issued and outstanding for all periods reflect BIO-key’s 1-for-8 reverse stock split, which was effective November 20, 2020.\nThe accompanying notes are an integral part of these statements.\nBIO-key International, Inc. and Subsidiaries\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYears ended December 31,\nRevenues\nServices\n$ 1,432,228\n$ 925,245\nLicense fees\n962,038\n442,649\nHardware\n442,516\n899,634\nTotal revenues\n2,836,782\n2,267,528\nCosts and other expenses\nCost of services\n502,214\n272,318\nCost of license fees\n49,891\n916,112\nCost of hardware\n242,721\n1,272,815\nTotal costs and other expenses\n794,826\n2,461,245\nGross Profit (Loss)\n2,041,956\n(193,717\n)\nOperating expenses\nSelling, general and administrative\n5,848,687\n5,036,820\nResearch, development and engineering\n1,396,436\n1,331,667\nTotal operating expenses before impairment\n7,245,123\n6,368,487\nImpairment of resalable software license rights\n-\n(6,957,516\n)\nOperating loss\n(5,203,167\n)\n(13,519,720\n)\nOther income (expense)\nInterest income\n30,649\nGovernment grant - Paycheck Protection Program\n340,819\n-\nInterest expense\n(4,343,212\n)\n(1,069,134\n)\nLoss on extinguishment of debt\n(499,076\n)\n-\nTotal other income (expense)\n(4,470,820\n)\n(1,068,980\n)\nNet loss\n(9,673,987\n)\n(14,588,700\n)\nDeemed dividend from trigger of anti-dilution provision feature\n(112,686\n)\n-\nNet loss available to common stockholders\n(9,786,673\n)\n(14,588,700\n)\nBasic and Diluted Loss per Common Share\n$ (2.08\n)\n$ (8.21\n)\nWeighted Average Shares Outstanding:\nBasic and Diluted\n4,700,787\n1,777,961\nAll BIO-key shares issued and outstanding for all periods reflect BIO-key’s 1-for-8 reverse stock split, which was effective November 20, 2020.\nThe accompanying notes are an integral part of these statements.\nBIO-key International, Inc. and Subsidiaries\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY (DEFICIT)\nCommon Stock\nAdditional\nPaid-in\nAccumulated\nShares\nAmount\nCapital\nDeficit\nTotal\nBalance as of December 31, 2018\n1,758,288\n$\n$ 85,600,362\n$ (75,134,316\n)\n$ 10,466,222\nIssuance of common stock for directors’ fees\n4,612\n35,012\n-\n35,013\nIssuance of common stock for commitment fees net of adjustments\n49,583\n594,995\n-\n595,000\nWarrant debt discount valuation\n-\n-\n595,662\n-\n595,662\nLegal and commitment fees\n-\n-\n(301,077\n)\n-\n(301,077\n)\nShare-based compensation\n-\n-\n912,707\n-\n912,707\nNet loss\n-\n-\n-\n(14,588,700\n)\n(14,588,700\n)\nBalance as of December 31, 2019\n1,812,483\n$\n$ 87,437,661\n$ (89,723,016\n)\n$ (2,285,173\n)\nIssuance of common stock for directors’ fees\n5,270\n-\n28,511\n-\n28,511\nIssuance of common stock pursuant to securities purchase agreements\n43,939\n277,828\n-\n277,833\nIssuance of common stock pursuant to public offering\n4,264,313\n22,173,999\n-\n22,174,425\nIssuance of common stock pursuant to warrant exercises\n918,538\n5,602,503\n-\n5,602,595\nIssuance of common stock for conversion of convertible note payable\n728,654\n3,788,927\n-\n3,789,000\nIssuance of restricted common stock to employees\n41,375\n(4\n)\n-\n-\nWarrants issued with convertible notes\n-\n-\n1,388,339\n-\n1,388,339\nWarrant issued for consulting fees\n-\n-\n107,576\n-\n107,576\nLegal and commitment fees\n-\n-\n(2,371,223\n)\n-\n(2,371,223\n)\nBeneficial conversion feature\n-\n-\n641,215\n-\n641,215\nDeemed dividends related to down-round features\n-\n-\n112,686\n(112,686\n)\n-\nShare-based compensation\n-\n-\n656,008\n-\n656,008\nNet loss\n-\n-\n-\n(9,673,987\n)\n(9,673,987\n)\nBalance as of December, 2020\n7,814,572\n$\n$ 119,844,026\n$ (99,509,689\n)\n$ 20,335,119\nAll BIO-key shares issued and outstanding for all periods reflect BIO-key’s 1-for-8 reverse stock split, which was effective November 20, 2020.\nThe accompanying notes are an integral part of these statements.\nBIO-key International, Inc. and Subsidiaries\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYears ended December 31,\nCASH FLOW FROM OPERATING ACTIVITIES:\nNet loss\n$ (9,673,987\n)\n$ (14,588,700\n)\nAdjustments to reconcile net loss to cash used for operating activities:\nBad debt expense\n-\n564,361\nDepreciation\n85,751\n81,852\nAmortization of intangible assets and write-off\n120,240\n43,256\nAmortization of resalable software license rights\n-\n843,287\nImpairment of resalable software license rights\n-\n6,957,516\nAmortization of debt discount\n1,425,040\n571,332\nAmortization of capitalized contract costs\n152,714\n138,679\nAmortization of debt issuance costs\n2,166,650\n424,980\nLoss on extinguishment of debt\n499,076\n-\nAmortization of beneficial conversion feature\n641,215\n-\nShare based and warrant compensation for employees and consultants\n763,584\n912,707\nStock based fees to directors\n28,511\n35,013\nAmortization of operating lease right-of-use assets\n220,915\n36,458\nChange in assets and liabilities:\nAccounts receivable\n(237,257\n)\n883,671\nDue from factor\n50,488\n(54,259\n)\nCapitalized contract costs\n(86,510\n)\n(50,999\n)\nInventory\n98,172\n569,710\nResalable software license rights\n14,920\n41,005\nPrepaid expenses and other\n(83,625\n)\n29,819\nAccounts payable\n(600,399\n)\n438,025\nAccrued liabilities\n(84,415\n)\n138,653\nDeferred revenue\n(246,876\n)\n162,603\nOperating lease liabilities\n(204,315\n)\n(29,316\n)\nNet cash used for operating activities\n(4,950,108\n)\n(1,850,347\n)\nCASH FLOWS FROM INVESTING ACTIVITIES:\nIssuance of note receivable\n(295,000\n)\n-\nPurchase of PistolStar\n(2,000,000\n)\n-\nCash acquired from purchase of PistolStar\n100,747\n-\nProceeds from maturity of debt security\n512,821\n-\nPurchase of debt security\n(512,821\n)\n(512,821\n)\nCash paid for patents\n-\n(1,736\n)\nCapital expenditures\n(35,568\n)\n(28,753\n)\nNet cash used for investing activities\n(2,229,821\n)\n(543,310\n)\nCASH FLOWS FROM FINANCING ACTIVITIES:\nProceeds from public offering\n22,174,425\n-\nProceeds from issuance of convertible notes\n3,958,000\n3,217,000\nRepayment of convertible notes\n(4,509,250\n)\n(707,000\n)\nProceeds from the exercise of warrants\n5,602,595\n-\nCosts to issue notes and common stock\n(2,693,021\n)\n(361,273\n)\nRepayment of note payable - PistolStar\n(250,000\n)\n-\nNet repayments of loans payable to related parties\n(188,737\n)\n-\nNet cash provided by financing activities\n24,094,012\n2,148,727\nNET INCREASE (DECREASE) IN CASH AND CASH EQUIVALENTS\n16,914,083\n(244,930\n)\nCASH AND CASH EQUIVALENTS, BEGINNING OF YEAR\n79,013\n323,943\nCASH AND CASH EQUIVALENTS, END OF YEAR\n$ 16,993,096\n$ 79,013\nThe accompanying notes are an integral part of these statements.\nSUPPLEMENTARY DISCLOSURES OF CASH FLOW INFORMATION\nYears ended December 31,\nCash paid for:\nInterest\n$ 109,426\n$ 72,822\nIncome taxes\n$ -\n$ -\nNoncash investing and financing activities:\nAccounts receivable acquired from PistolStar\n$ 184,792\n$ -\nPrepaid expenses acquired from PistolStar\n$ 9,485\n$ -\nEquipment acquired from PistolStar\n$ 36,467\n$ -\nIntangible assets acquired from PistolStar\n$ 1,480,000\n$ -\nGoodwill related to PistolStar acquisition\n$ 1,262,526\n$ -\nIssuance of note payable for PistolStar acquisition, net of discount\n$ 464,000\n$ -\nAccrued expenses acquired from PistolStar\n$ 20,017\n$ -\nDeferred revenue acquired from PistolStar\n$ 590,000\n$ -\nRight-of-use asset addition under ASC 842\n$ 141,761\n$ 719,812\nOperating lease liabilities under ASC 842\n$ 141,761\n$ 707,217\nIssuance of common stock for conversion of note payable\n$ 3,789,000\n$ -\nIssuance of common stock pursuant to securities purchase agreements\n$ 277,833\n$ 595,000\nWarrants issued with convertible notes\n$ 1,388,339\n$ 595,662\nBeneficial conversion feature\n$ 641,215\n$ -\nDeemed dividends related to down-round features\n$ 112,686\n$ -\nDebt issuance cost allocated to equity\n$ -\n$ 152,000\nDebt discount issued with convertible note\n$ -\n$ 550,000\nThe accompanying notes are an integral part of these statements.\nBIO-key International, Inc. and Subsidiaries\nNOTES TO THE FINANCIAL STATEMENTS\nDecember 31, 2020 and 2019\nNOTE A -THE COMPANY AND SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nNature of Business\nThe Company, founded in 1993, develops and markets proprietary fingerprint identification biometric technology and software solutions enterprise-ready identity access management solutions to commercial, government and education customers throughout the United States and internationally. The Company was a pioneer in developing automated, finger identification technology that supplements or compliments other methods of identification and verification, such as personal inspection identification, passwords, tokens, smart cards, ID cards, PKI, credit cards, passports, driver’s licenses, OTP or other form of possession or knowledge-based credentialing. Additionally, advanced BIO-key® technology has been, and is, used to improve both the accuracy and speed of competing finger-based biometrics.\nGoing Concern and Basis of Presentation\nWe have historically financed our operations through access to the capital markets by issuing secured and convertible debt securities, convertible preferred stock, common stock, and through factoring receivables. We currently require approximately $735,000 per month to conduct our operations, a monthly amount that we have been unable to consistently achieve through revenue generation. During 2020, we generated approximately $2,837,000 of revenue, which is below our average monthly requirements. During 2020, we raised approximately $24,000,000 from financing activities and at December 31, 2020 had approximately $17,000,000 in cash. As of the date of this report, the Company has enough cash for twelve to eighteen months of operations, and therefore, there is no longer uncertainty in our going concern status.\nEffective November 20, 2020, the Company implemented a reverse stock split of its outstanding common stock at a ratio of 1-for-8. All share figures and results are reflected on a post-split basis.\nSummary of Significant Accounting Policies\nA summary of the significant accounting policies consistently applied in the preparation of the accompanying consolidated financial statements follows:\n1. Principles of Consolidation\nThe accompanying consolidated financial statements include the accounts of BIO-key International, Inc. and its wholly-owned subsidiaries (collectively, the “Company”). Intercompany accounts and transactions have been eliminated in consolidation.\n2. Use of Estimates\nOur consolidated financial statements are prepared in accordance with GAAP as set forth in the Financial Accounting Standards Board’s (FASB) Accounting Standards Codification (ASC) and consider the various staff accounting bulletins and other applicable guidance issued by the U.S. Securities and Exchange Commission (SEC). These accounting principles require us to make certain estimates, judgments and assumptions. The Company believes that the estimates, judgments and assumptions upon which it relies are reasonable based upon information available to us at the time that these estimates, judgments and assumptions are made. These estimates, judgments and assumptions can affect the reported amounts of assets and liabilities as of the date of the financial statements as well as the reported amounts of revenues and expenses during the periods presented. Certain significant accounting policies that contain subjective management estimates and assumptions include those related to revenue recognition, accounts receivable, inventory, intangible assets and long-lived assets, and income taxes. To the extent there are material differences between these estimates, judgments or assumptions and actual results, its consolidated financial statements will be affected. In many cases, the accounting treatment of a particular transaction is specifically dictated by GAAP and does not require management’s judgment in its application. There are also areas in which management’s judgment in selecting among available alternatives would not produce a materially different result.\n3. Revenue Recognition\nIn accordance with ASC 606, revenue is recognized when a customer obtains control of promised goods or services. The amount of revenue recognized reflects the consideration to which the Company expects to be entitled to receive in exchange for these services. To achieve this core principle, the Company applies the following five steps:\n●\nIdentify the contract with a customer\n●\nIdentify the performance obligations in the contract\n●\nDetermine the transaction price\n●\nAllocate the transaction price to performance obligations in the contract\n●\nRecognize revenue when or as the Company satisfies a performance obligation\nAll of the Company's performance obligations, and associated revenues, are generally transferred to customers at a point in time, with the exception of support and maintenance, and professional services, which are generally transferred to the customer over time.\nSoftware licenses\nSoftware license revenue consist of fees for perpetual and subscription licenses for one or more of the Company’s biometric fingerprint solutions or identity access management solutions. Revenue is recognized at a point in time once the software is available to the customer for download. Software license contracts are generally invoiced in full on execution of the arrangement.\nHardware\nHardware revenue consists of fees for associated equipment sold with or without a software license arrangement, such as servers, locks and fingerprint readers. Customers are not obligated to buy third party hardware from the Company, and may procure these items from a number of suppliers. Revenue is recognized at a point in time once the hardware is shipped to the customer. Hardware items are generally invoiced in full on execution of the arrangement.\nSupport and Maintenance\nSupport and maintenance revenue consists of fees for unspecified upgrades, telephone assistance and bug fixes. The Company satisfies its support and maintenance performance obligation by providing “stand-ready” assistance as required over the contract period. The Company records deferred revenue (contract liability) at time of prepayment until the contracts term occurs. Revenue is recognized over time on a ratable basis over the contract term. Support and maintenance contracts are up to one to five years in length and are generally invoiced in advance at the beginning of the term. Support and Maintenance revenue for subscription licenses is carved out of the total license cost at 18% and recognized on a ratable basis over the license term.\nProfessional Services\nProfessional services revenues consist primarily of fees for deployment and optimization services, as well as training. The majority of the Company’s consulting contracts are billed on a time and materials basis, and revenue is recognized based on the amount billable to the customer in accordance with practical expedient ASC 606-10-55-18. For other professional services contracts, the Company utilizes an input method and recognizes revenue based on labor hours expended to date relative to the total labor hours expected to be required to satisfy its performance obligation.\nContracts with Multiple Performance Obligations\nSome contracts with customers contain multiple performance obligations. For these contracts, the Company accounts for individual performance obligations separately if they are distinct. The transaction price is allocated to the separate performance obligations on a relative standalone selling price basis. The standalone selling prices are determined based on overall pricing objectives, taking into consideration market conditions and other factors, including the value of the contracts, the cloud applications sold, customer demographics, geographic locations, and the number and types of users within the contracts.\nThe Company considered several factors in determining that control transfers to the customer upon shipment of hardware and availability of download of software. These factors include that legal title transfers to the customer, the Company has a present right to payment, and the customer has assumed the risks and rewards of ownership.\nAccounts receivable from customers are typically due within 30 days of invoicing. The Company does not record a reserve for product returns or warranties as amounts are deemed immaterial based on historical experience.\nCosts to Obtain and Fulfill a Contract\nCosts to obtain and fulfill a contract are predominantly sales commissions earned by the sales force and are considered incremental and recoverable costs of obtaining a contract with a customer. These costs are deferred and then amortized over a period of benefit determined to be four years. These costs are included as capitalized contract costs on the balance sheet. The period of benefit was determined by taking into consideration customer contracts, technology, and other factors based on historical evidence. Amortization expense is included in selling, general and administrative expenses in the accompanying consolidated statements of operations.\nDeferred Revenue\nDeferred revenue includes customer advances and amounts that have been paid by customer for which the contractual maintenance terms have not yet occurred. The majority of these amounts are related to maintenance contracts for which the revenue is recognized ratably over the applicable term, which generally is 12-60 months. Contracts greater than 12 months are segregated as long term deferred revenue. Maintenance contracts include provisions for unspecified when-and-if available product updates and customer telephone support services. At December 31, 2020 and 2019, amounts in deferred revenue were approximately $702,000 and $359,000, respectively.\n4. Business Combinations\nIn accordance with ASC 805, Business Combinations (ASC 805), the Company recognizes the tangible and intangible assets acquired and liabilities assumed based on their estimated fair values. Determining these fair values requires management to make significant estimates and assumptions, especially with respect to intangible assets.\nThe Company recognizes identifiable assets acquired and liabilities assumed at their acquisition date fair value. Goodwill as of the acquisition date is measured as the excess of consideration transferred over the net acquisition date fair value of the assets acquired and the liabilities assumed and represents the expected future economic benefits arising from other assets acquired that are not individually identified and separately recognized. While the Company uses its best estimates and assumptions as part of the purchase price allocation process to accurately value assets acquired and liabilities assumed at the acquisition date, its estimates are inherently uncertain and subject to refinement. Assumptions may be incomplete or inaccurate, and unanticipated events or circumstances may occur, which may affect the accuracy or validity of such assumptions, estimates or actual results. As a result, during the measurement period, which may be up to one year from the acquisition date, the Company records adjustments to the assets acquired and liabilities assumed with the corresponding offset to goodwill to the extent that it identifies adjustments to the preliminary purchase price allocation. Upon the conclusion of the measurement period or final determination of the values of assets acquired or liabilities assumed, whichever comes first, any subsequent adjustments are recorded to the consolidated statements of operations.\n5. Goodwill and acquired intangible assets\nGoodwill is not amortized, but is evaluated for impairment annually, or whenever events or changes in circumstances indicate that the carrying value may not be recoverable. The Company has determined that there is a single reporting unit for the purpose of conducting this goodwill impairment assessment. For purposes of assessing potential impairment, the Company estimates the fair value of the reporting unit, based on the Company’s market capitalization, and compares this amount to the carrying value of the reporting unit. If the Company determines that the carrying value of the reporting unit exceeds its fair value, an impairment charge would be required. The annual goodwill impairment test will be performed as of December 31st of each year. To date, the Company has not identified any impairment to goodwill.\nIntangible assets acquired in a business combination are recorded at their estimated fair values at the date of acquisition. The Company amortizes acquired definite-lived intangible assets over their estimated useful lives based on the pattern of consumption of the economic benefits or, if that pattern cannot be readily determined, on a straight-line basis.\n6. Cash Equivalents\nCash equivalents consist of liquid investments with original maturities of three months or less. At December 31, 2020 and 2019, cash equivalents consisted of a money market account.\n7. Accounts Receivable\nAccounts receivable are carried at original amount less an estimate made for doubtful receivables based on a review of all outstanding amounts on a monthly basis. Management determines the allowance for doubtful receivables by regularly evaluating individual customer receivables and considering a customer’s financial condition, credit history, and current economic conditions. Accounts receivable are written off when deemed uncollectible.\nAs a result of the payment delays for a large customer, the Company has reserved $1,720,000 at December 31, 2020 and 2019, which represents 100% of the remaining balance owed under the contract. Recoveries of accounts receivable previously written off are recorded when received. The Company made a license sale to a Chinese reseller in December 2018. Revenue was recognized in accordance with ASC 606 in the amount of $1.1 million in 2018. As of December 31, 2019, the second payment for $555,555 was still outstanding and payable. The Company wrote off directly to bad debt expense $555,555 that was promised to be paid in March 2019, but not received.\nAccounts receivable at December 31, 2020 and 2019 consisted of the following:\nDecember 31,\nAccounts receivable - current\n$ 561,834\n$ 139,785\nAccounts receivable - non current\n1,720,000\n1,720,000\n2,281,834\n1,859,785\nAllowance for doubtful accounts - current\n(13,785\n)\n(13,785\n)\nAllowance for doubtful accounts - non current\n(1,720,000\n)\n(1,720,000\n)\n(1,733,785\n)\n(1,733,785\n)\nAccounts receivable, net of allowances for doubtful accounts\n$ 548,049\n$ 126,000\nThe allowance for doubtful accounts for the years ended December 31, 2020 and 2019 is as follows:\nBalance at\nBeginning\nof Year\nCharged to\nCosts\nand\nExpenses\nDeductions\nFrom\nReserves\nBalance at\nEnd of Year\nYear Ended December 31, 2020\nAllowance for Doubtful Accounts\n$ 1,733,785\n$ -\n$ -\n$ 1,733,785\nYear Ended December 31, 2019\nAllowance for Doubtful Accounts\n$ 1,733,785\n$ -\n$ -\n$ 1,733,785\nBad debt expenses (if any) are recorded in selling, general, and administrative expense.\n8. Equipment and Leasehold Improvements, Intangible Assets and Depreciation and Amortization\nEquipment and leasehold improvements are stated at cost. Depreciation is provided for in amounts sufficient to relate the cost of depreciable assets to operations over the estimated service lives, principally using straight-line methods. Leasehold improvements are amortized over the shorter of the life of the improvement or the lease term, using the straight-line method.\nThe estimated useful lives used to compute depreciation and amortization for financial reporting purposes are as follows:\nYears\nEquipment and leasehold improvements\nEquipment (years)\n-\nFurniture and fixtures (years)\n-\nSoftware (years)\nLeasehold improvements\nlife or lease term\nIntangible assets other than goodwill consist of patents, trade name, proprietary software, and customer relationships. Patent costs are capitalized until patents are awarded. Upon award, such costs are amortized using the straight-line method over their respective economic lives. If a patent is denied, all costs are charged to operations in that year. Trade names, proprietary software, and customer relationships are amortized over the economic useful life.\n9. Impairment or Disposal of Long Lived Assets, including Intangible Assets\nThe Company reviews long-lived assets, including intangible assets subject to amortization, whenever events or changes in circumstances indicate that the carrying amount of such an asset may not be recoverable. Recoverability of these assets is measured by comparison of their carrying amount to the future undiscounted cash flows the assets are expected to generate. If such assets are considered impaired, the impairment to be recognized is equal to the amount by which the carrying value of the assets exceeds their fair value determined by either a quoted market price, if any, or a value determined by utilizing a discounted cash flow technique. In assessing recoverability, the Company must make assumptions regarding estimated future cash flows and discount factors. If these estimates or related assumptions change in the future, the Company may be required to record impairment charges. Intangible assets with determinable lives are amortized over their estimated useful lives, based upon the pattern in which the expected benefits will be realized, or on a straight-line basis, whichever is greater. The Company recorded an impairment charge in 2019 with respect to the FingerQ Resalable Software License Rights. Refer to Note I - Resalable License Rights for additional information.\n10. Advertising Expense\nThe Company expenses the costs of advertising as incurred. Advertising expenses for 2020 and 2019 were approximately $494,000 and $317,000, respectively.\n11. Research and Development Expenditures\nResearch and development expenses include costs directly attributable to the conduct of research and development programs primarily related to the development of our software products and improving the efficiency and capabilities of our existing software. Such costs include salaries, payroll taxes, employee benefit costs, materials, supplies, depreciation on research equipment, services provided by outside contractors, and the allocable portions of facility costs, such as rent, utilities, insurance, repairs and maintenance, depreciation and general support services. All costs associated with research and development are expensed as incurred.\n12. Earnings Per Share of Common Stock (“EPS”)\nThe Company’s EPS is calculated by dividing net income (loss) applicable to common stockholders by the weighted-average number of common shares outstanding during the reporting period. Diluted EPS includes the effect from potential issuances of common stock, such as stock issuable pursuant to the conversion of preferred stock, exercise of stock options and warrants, when the effect of their inclusion is dilutive.\n13. Accounting for Stock-Based Compensation\nThe Company accounts for share based compensation in accordance with the provisions of ASC 718-10, “Compensation - Stock Compensation,” which requires measurement of compensation cost for all stock awards at fair value on date of grant and recognition of compensation over the service period for awards expected to vest. The majority of its share-based compensation arrangements vest over either a three or four year vesting schedule. The Company expenses its share-based compensation under the ratable method, which treats each vesting tranche as if it were an individual grant. The fair value of stock options is determined using the Black-Scholes valuation model, and requires the input of highly subjective assumptions. These assumptions include estimating the length of time employees will retain their vested stock options before exercising them (the “expected option term”), the estimated volatility of its common stock price over the option’s expected term, the risk-free interest rate over the option’s expected term, and the Company’s expected annual dividend yield. Changes in these subjective assumptions can materially affect the estimate of fair value of stock-based compensation and consequently, the related amount recognized as an expense in the consolidated statements of operations. As required under the accounting rules, the Company reviews its valuation assumptions at each grant date and, as a result, the Company is likely to change its valuation assumptions used to value employee stock-based awards granted in future periods. The values derived from using the Black-Scholes model are recognized as expense over the service period, net of estimated forfeitures (the number of individuals that will ultimately not complete their vesting requirements). The estimation of stock awards that will ultimately vest requires significant judgment. The Company considers many factors when estimating expected forfeitures, including types of awards, employee class, and historical experience. Actual results, and future changes in estimates, may differ substantially from current estimates. Options and warrants to outsiders are accounted for under ASC 718.\nThe following table presents share-based compensation expenses included in the Company’s consolidated statements of operations:\nYear ended\nDecember 31,\nSelling, general and administrative\n$ 705,971\n$ 828,981\nResearch, development and engineering\n86,124\n118,739\n$ 792,095\n$ 947,720\nValuation Assumptions for Stock Options\nFor 2020 and 2019, 28,440 and 30,167 stock options were granted, respectively. The fair value of each option was estimated on the date of grant using the Black-Scholes option-pricing model with the following assumptions:\nYear ended\nDecember 31,\nWeighted average Risk free interest rate\n0.30\n%\n2.33\n%\nExpected life of options (in years)\n4.50\n4.50\nExpected dividends\n%\n%\nWeighted average Volatility of stock price\n%\n%\nThe stock volatility for each grant is determined based on the review of the experience of the weighted average of historical daily price changes of the Company’s common stock over the expected option term. The expected term was determined using the simplified method for estimating expected option life, which qualify as “plain-vanilla” options; and the risk-free rate is based on the U.S. Treasury yield curve in effect at the time of grant for periods corresponding with the expected life of the option.\n14. Derivative Liabilities\nIn connection with the issuances of equity instruments or debt, the Company may issue options or warrants to purchase common stock. In certain circumstances, these options or warrants may be classified as liabilities, rather than as equity. In addition, the equity instrument or debt may contain embedded derivative instruments, such as conversion options or listing requirements, which in certain circumstances may be required to be bifurcated from the associated host instrument and accounted for separately as a derivative liability instrument. The Company early-adopted the new provisions issued July 2017, for derivative liability instruments under FASB ASU 2017-11, Earnings Per Share (Topic 260), Distinguishing Liabilities from Equity (Topic 480) and Derivatives and Hedging (Topic 815): I. Accounting for Certain Financial Instruments with Down Round Features; II. Replacement of the Indefinite Deferral for Mandatorily Redeemable Financial Instruments of Certain Nonpublic Entities and Certain Mandatorily Redeemable Non-controlling Interests with a Scope Exception. Under ASU 2017-11, down round features do not meet the criteria for derivative accounting and no liability is to be recorded until an actual issuance of securities triggers the down-round feature. Prior to these provisions, the liabilities were recorded without the actual issuance of the securities triggering the down-round feature.\n15. Income Taxes\nThe provision for, or benefit from, income taxes includes deferred taxes resulting from the temporary differences in income for financial and tax purposes using the liability method. Such temporary differences result primarily from the differences in the carrying value of assets and liabilities. Future realization of deferred income tax assets requires sufficient taxable income within the carryback, carryforward period available under tax law. The Company evaluates, on a quarterly basis whether, based on all available evidence, if it is probable that the deferred income tax assets are realizable. Valuation allowances are established when it is more likely than not that the tax benefit of the deferred tax asset will not be realized. The evaluation, as prescribed by ASC 740-10, “Income Taxes,” includes the consideration of all available evidence, both positive and negative, regarding historical operating results including recent years with reported losses, the estimated timing of future reversals of existing taxable temporary differences, estimated future taxable income exclusive of reversing temporary differences and carryforwards, and potential tax planning strategies which may be employed to prevent an operating loss or tax credit carryforward from expiring unused. Because of the Company’s historical performance and estimated future taxable income, a full valuation allowance has been established.\nThe Company accounts for uncertain tax provisions in accordance with ASC 740-10-05, “Accounting for Uncertainty in Income Taxes.” The ASC clarifies the accounting for uncertainty in income taxes recognized in an enterprise’s financial statements. The ASC prescribes a recognition threshold and measurement attribute for the financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return. The ASC provides guidance on de-recognition, classification, interest and penalties, accounting in interim periods, disclosure and transition.\n16. Leases\nIn accordance with ASC 842, Leases (ASC 842), the Company records a right-of-use (ROU) asset and a lease liability on the balance sheet for all leases with terms longer than 12 months and classifies them as either operating or finance leases.\nAt the inception of an arrangement, the Company determines whether the arrangement is or contains a lease based on the unique facts and circumstances present and the classification of the lease including whether the contract involves the use of a distinct identified asset, whether the Company obtains the right to substantially all the economic benefit from the use of the asset, and whether the Company has the right to direct the use of the asset. Leases with a term greater than one year are recognized on the balance sheet as ROU assets, lease liabilities and, if applicable, long-term lease liabilities. The Company has elected not to recognize on the balance sheet leases with terms of one year or less under practical expedient in paragraph ASC 842-20-25-2. For contracts with lease and non-lease components, the Company has elected not to allocate the contract consideration, and to account for the lease and non-lease components as a single lease component.\nLease liabilities and their corresponding ROU assets are recorded based on the present value of lease payments over the expected lease term. The implicit rate within our operating leases are generally not determinable and, therefore, the Company uses the incremental borrowing rate at the lease commencement date to determine the present value of lease payments. The determination of the Company’s incremental borrowing rate requires judgment. The Company determines the incremental borrowing rate for each lease using our estimated borrowing rate, adjusted for various factors including level of collateralization, term and currency to align with the terms of the lease. The operating lease ROU asset also includes any lease prepayments, offset by lease incentives.\nAn option to extend the lease is considered in connection with determining the ROU asset and lease liability when it is reasonably certain we will exercise that option. An option to terminate is considered unless it is reasonably certain we will not exercise the option.\n17. Recent Accounting Pronouncements\nIn June 2016, the FASB issued ASU 2016-13, Financial Instruments-Credit Losses (Topic 326), referred to herein as ASU 2016-13, which significantly changes how entities will account for credit losses for most financial assets and certain other instruments that are not measured at fair value through net income. ASU 2016-13 replaces the existing incurred loss model with an expected credit loss model that requires entities to estimate an expected lifetime credit loss on most financial assets and certain other instruments. Under ASU 2016-13 credit impairment is recognized as an allowance for credit losses, rather than as a direct write-down of the amortized cost basis of a financial asset. The impairment allowance is a valuation account deducted from the amortized cost basis of financial assets to present the net amount expected to be collected on the financial asset. Once the new pronouncement is adopted by the Company, the allowance for credit losses must be adjusted for management’s current estimate at each reporting date. The new guidance provides no threshold for recognition of impairment allowance. Therefore, entities must also measure expected credit losses on assets that have a low risk of loss. For instance, trade receivables that are either current or not yet due may not require an allowance reserve under currently generally accepted accounting principles, but under the new standard, the Company will have to estimate an allowance for expected credit losses on trade receivables under ASU 2016-13. ASU 2016-13 is effective for annual periods, including interim periods within those annual periods, beginning after December 15, 2022 for smaller reporting companies. Early adoption is permitted. The Company is currently assessing the impact ASU 2016-13 will have on its consolidated financial statements.\nManagement does not believe that any other recently issued, but not yet effective, accounting standard if currently adopted would have a material effect on the accompanying consolidated financial statements.\nNOTE B-REVENUE FROM CONTRACTS WITH CUSTOMERS\nDisaggregation of Revenue\nThe following table summarizes revenue from contracts with customers for the years ended:\nNorth\nAmerica\nSouth\nAmerica\nEMEA*\nAsia\nDecember\n31,\nLicense fees\n$ 842,307\n$ -\n$ 46,922\n$ 72,809\n$ 962,038\nHardware\n267,996\n-\n144,647\n29,873\n442,516\nServices\n1,296,696\n18,300\n94,124\n23,108\n1,432,228\nTotal Revenues\n$ 2,406,999\n$ 18,300\n$ 285,693\n$ 125,790\n$ 2,836,782\nNorth\nAmerica\nSouth\nAmerica\nEMEA*\nAsia\nDecember\n31,\nLicense fees\n$ 208,827\n$ 46,717\n$ 117,401\n$ 69,704\n$ 442,649\nHardware\n388,938\n12,636\n342,304\n155,756\n899,634\nServices\n794,318\n8,514\n99,911\n22,502\n925,245\nTotal Revenues\n$ 1,392,083\n$ 67,867\n$ 559,616\n$ 247,962\n$ 2,267,528\n* EMEA - Europe, Middle East, Africa\nRevenue recognized during the year ended December 31, 2020 from amounts included in deferred revenue at the beginning of the period was approximately $290,000. The Company did not recognize any revenue from performance obligations satisfied in prior periods. Total deferred revenue (contract liability) was $702,336 and $359,212 at December 31, 2020 and 2019, respectively.\nTransaction Price Allocated to the Remaining Performance Obligations\nASC 606 requires that the Company disclose the aggregate amount of transaction price that is allocated to performance obligations that have not yet been satisfied as at December 31, 2020. The guidance provides certain practical expedients that limit this requirement, which the Company’s contracts meet as follows:\n●\nThe performance obligation is part of a contract that has an original expected duration of one year or less, in accordance with ASC 606-10-50-14.\nAt December 31, 2020, deferred revenue represents the Company’s remaining performance obligations related to prepaid support and maintenance, all of which is expected to be recognized from one to five years.\nNOTE C-PISTOLSTAR, INC. ACQUISITION\nOn June 30, 2020, the Company acquired PistolStar, Inc., a private company based in the United States, which provides enterprise-ready identity access management solutions, including multi-factor authentication, identity-as-a-service, single sign-on and self-service password reset to commercial, government and education customers throughout the United States and internationally.\nFrom April 10, 2020 until the Company acquired PistolStar, it licensed PortalGuard®, PistolStar’s authentication software, which the Company combines with its biometric authentication solutions offered to existing and prospective customers.\nThe total purchase price of $2.5 million included cash payment of $2.0 million and the issuance of a $500,000 promissory note.\nThe acquisition of PistolStar has been accounted for as a business combination and, in accordance with ASC 805, the Company has recorded the assets acquired and liabilities assumed at their respective fair values as of the acquisition date. The following table summarizes the final purchase price allocation:\nPurchase consideration:\nTotal cash paid, net of acquired cash\n$ 2,000,000\nPresent value of 4% Promissory note\n464,000\nTotal purchase price consideration\n$ 2,464,000\nFair value of assets acquired and liabilities assumed:\nCash and cash equivalents\n$ 100,747\nAccounts receivable\n184,792\nPrepaid expenses and other current assets\n9,485\nFixed assets\n36,467\nIntangible assets\n1,480,000\nGoodwill\n1,262,526\nTotal assets acquired\n3,074,017\nAccrued expenses and other current liabilities\nAccrued payroll\n19,279\nDeferred revenue\n590,000\nTotal fair value of assets acquired and liabilities assumed\n$ 2,464,000\nThe promissory note, which was issued to the previous owner of PistolStar, carries interest at 4% per annum and is payable in four installments over the 12-month period following the closing. The balance of the note at December 31, 2020 was $232,000, net of the unamortized debt discount. On January 21, 2021, the Company paid the $250,000 balance due on the note.\nIn the year ended December 31, 2020, acquisition-related expenses were immaterial. Acquisition-related expenses have been included primarily in general and administrative expenses in the consolidated statements of operations. The operating results of PistolStar have been included in the consolidated statements of operations beginning on July 1, 2020. Revenue from PistolStar for the period from July 1, 2020 through December 31, 2020 totaled $1,064,384. The income from PistolStar for the period from July 1, 2020 through December 31, 2020 was $202,558.\nThe significant intangible assets identified in the purchase price allocation discussed above include the trade name, proprietary software, and customer relationships. To value the trade name and proprietary software, the Company utilized the Relief from Royalty Method, which quantifies the cost savings associated with asset ownership via a discounted cashflow analysis. To value the customer relationships, the Company utilized the Excess Earnings Method, which isolates the value of the specific intangible asset by discounting its income stream to present value.\nThe fair value of the assets acquired and liabilities assumed reflected in the tables above is less than the purchase price, resulting in the recognition of goodwill. The goodwill reflects the value of the synergies the Company expects to realize and the assembled workforce.\nThe following table presents the final fair values and useful lives of the identifiable intangible assets acquired:\nAmount\nEstimated useful\nlife\n(in years)\nTrade Name\n$ 130,000\nProprietary Software\n420,000\nCustomer relationships\n930,000\n-\nTotal identifiable intangible assets\n$ 1,480,000\nNOTE D-FACTORING\nDue from factor consisted of the following as of December 31:\nOriginal Invoice\nValue\nFactored\nAmount\nFactored\nBalance due\nYear Ended December 31, 2020\nFactored accounts receivable\n$ 241,715\n$ 181,262\n$ 60,453\nYear Ended December 31, 2019\nFactored accounts receivable\n$ 233,005\n$ 122,064\n$ 110,941\nThe Company entered into an accounts receivable factoring arrangement with a financial institution (the “Factor”) which has been extended to October 31, 2021. Pursuant to the terms of the arrangement, the Company, from time to time, sells to the Factor a minimum of $150,000 per quarter of certain of its accounts receivable balances on a non-recourse basis for credit approved accounts. The Factor remits 35% of the foreign and 75% of the domestic accounts receivable balance to the Company (the “Advance Amount”), with the remaining balance, less fees, forwarded to the Company once the Factor collects the full accounts receivable balance from the customer. In addition, the Company, from time to time, receives over advances from the Factor. Factoring fees range from 2.75% to 15% of the face value of the invoice factored and are determined by the number of days required for collection of the invoice. The cost of factoring is included in selling, general and administrative expenses. The cost of factoring was as follows:\nYears Ended December 31,\nFactoring fees\n$ 98,748\n$ 203,950\nNOTE E-FAIR VALUES OF FINANCIAL INSTRUMENTS\nCash and cash equivalents, accounts receivable, due from factor, accounts payable and accrued liabilities are carried at, or approximate, fair value because of their short-term nature. The carrying value of the Company’s notes and loan payables approximated fair value as the interest rates related to the financial instruments approximated market.\nNOTE F-CONCENTRATION OF RISK\nFinancial instruments which potentially subject the Company to risk primarily consist of cash, and cash equivalents, investment in debt security, and accounts receivables.\nThe Company maintains its cash and cash equivalents with various financial institutions, which, at times may exceed insured limits. The exposure to the Company is solely dependent upon daily bank balances and the respective strength of the financial institutions. The Company was in excess of coverage of approximately $16,020,000 and $0 at December 31, 2020 and 2019, respectively. The Company has not incurred any losses on these accounts.\nThe Company extends credit to customers on an unsecured basis in the normal course of business. The Company’s policy is to perform an analysis of the recoverability of its receivables at the end of each reporting period and to establish allowances where appropriate. The Company analyzes historical bad debts and contract losses, customer concentrations, and customer credit-worthiness when evaluating the adequacy of the allowances.\nDuring the year ended December 31, 2020, one customer accounted for 18% of total revenue. During the year ended December 31, 2019, two customers accounted for 22% and 14% of total revenue, respectively.\nOne customer accounted for 31% of total accounts receivable, as of December 31, 2020. Three customers accounted for 18%, 16% and 14% of total accounts receivable, respectively, as of December 31, 2019.\nNOTE G-NOTE RECEIVABLE\nDuring the third quarter 2020, the Company loaned $295,000 as an advance to Technology Transfer Institute (“TTI”) to aid in fulfilling the African contracts. The note does not bear any interest if paid within the nine (9) monthly installments beginning December 31, 2020. The note bears a default rate of 5%. Currently, TTI is in the process of raising capital to repay the loan, and facilitate fulfilling the African contracts.\nNOTE H-INVENTORY\nInventory is stated at the lower of cost, determined on a first in, first out basis, or realizable value, and consists primarily of fabricated assemblies and finished goods. Inventory is comprised of the following as of December 31:\nFinished goods\n$ 221,130\n$ 287,761\nFabricated assemblies\n109,817\n141,358\nTotal inventory\n$ 330,947\n$ 429,119\nNOTE I-RESALABLE SOFTWARE LICENSES RIGHTS\nOn November 11, 2015, the Company entered into a license agreement for the rights to all software and documentation regarding the technology currently known as or offered under the FingerQ name. The license agreement grants the Company the exclusive right to reproduce, create derivative works and distribute copies of the FingerQ software and documentation, create new FingerQ related products, and grant sub-licenses of the licensed technology to end users. The license rights have been granted to the Company in perpetuity, with a stated number of end-user resale sub-licenses allowed under the contract for a total of $12,000,000.\nThe Company initially determined the software license rights to be a finite lived intangible asset and estimated that the software license rights shall be economically used over a 10-year period, with a weighting towards the beginning years of that time frame.\nDuring the fourth quarter of 2019, the Company re-evaluated the recoverability of the carrying amount of the balance of license rights and concluded that there were no significant undiscounted cash flows expected to be generated from the future sale of the license rights. Accordingly, an impairment charge of $6,957,516 was recorded in the fourth quarter of 2019, which reduced the carrying amount of the FingerQ license rights to zero. A total of $843,888 (prior to the impairment charge) was expensed during 2019.\nOn December 31, 2015, the Company purchased third-party software licenses in the amount of $180,000 in anticipation of a large pending deployment that has yet to materialize. The Company is amortizing the total cost over the same methodology described above with the greater of the two approaches being the actual unit cost per license sold. A total of $14,920 and $40,404 was charged to cost of sales during the years ended December 31, 2020 and 2019, respectively. Since the license purchase, the actual per unit cost (actual usage) of such license rights in the cumulative amount of $121,118 has been charged to cost of sales, with a carrying balance of $58,882 and $73,802 as of December 31, 2020 and 2019, respectively.\nThe Company has classified the balance as non-current until a larger deployment occurs.\nEstimated minimum amortization expense based on straight line amortization of the software license rights for each of the next five years and thereafter approximates the following:\nYears ending December 31\n$ 18,000\n18,000\n18,000\n4,882\nTotal\n$ 58,882\nNOTE J-INVESTMENT IN DEBT SECURITY\nDuring 2019, the Company purchased a 4,000,000 Hong Kong dollar denominated Bond Certificate with a financial institution in Hong Kong. The Bond Certificate translated to $512,821 U.S. Dollars on the June 2019 purchase date. The bond had a one-year term which matured in June 2020, bearing interest at 5% per annum. The Company redeemed the bond and recorded interest income of approximately $25,800.\nThe Company then purchased a new 4,000,000 Hong Kong dollar denominated Bond Certificate with a financial institution in Hong Kong in June 2020. The new Bond Certificate translated to $512,821 U.S. Dollars, based on the exchange rate at the purchase date. The Company can invest up to 20,000,000 Hong Kong dollars under the terms of the certificate, bearing interest at 5% per annum. The investment is recorded at amortized cost which approximates fair value and is currently planned to be held to maturity.\nNOTE K-EQUIPMENT AND LEASEHOLD IMPROVEMENTS\nEquipment and leasehold improvements consisted of the following as of December 31:\nEquipment\n$ 789,760\n$ 648,286\nFurniture and fixtures\n164,079\n164,079\nSoftware\n32,045\n32,045\nLeasehold improvements\n25,135\n23,403\n1,011,019\n867,813\nLess accumulated depreciation and amortization\n(929,226\n)\n(772,304\n)\nTotal\n$ 81,793\n$ 95,509\nDepreciation was $85,751 and $81,852 for 2020 and 2019, respectively. Amounts are recorded in selling, general, and administrative expense as well as in cost of services.\nNOTE L-INTANGIBLE ASSETS\nIntangible assets consisted of the following as of December 31:\nGross\nCarrying\nAmount\nAccumulated\nAmortization\nNet\nCarrying\nAmount\nGross\nCarrying\nAmount\nAccumulated\nAmortization\nWrite-\noffs\nNet\nCarrying\nAmount\nTrade name\n$ 130,000\n$ (4,333\n)\n$ 125,667\n$ -\n$ -\n$ -\n$ -\nProprietary software\n420,000\n(42,000 )\n378,000\n-\n-\n-\n-\nCustomer relationships\n930,000\n(51,667\n)\n878,333\n-\n-\n-\n-\nPatents and patents pending\n365,080\n(232,934\n)\n132,146\n380,080\n(210,694\n)\n(15,000\n)\n154,386\nTotal\n$ 1,845,080\n$ (330,934\n)\n$ 1,514,146\n$ 380,080\n$ (210,694\n)\n$ (15,000\n)\n$ 154,386\nAggregate amortization expense for 2020 and 2019 was $120,240 and $28,256, respectively. Estimated minimum amortization expense based on straight line amortization of the software license rights for each of the next five years and thereafter approximates the following:\nYears ending December 31\n$ 216,000\n215,000\n213,000\n209,000\n165,000\nThereafter\n496,146\nTotal\n$ 1,514,146\nNOTE M-ACCRUED LIABILITIES\nAccrued liabilities consisted of the following as of December 31:\nCompensation\n$ 87,015\n$ 193,823\nCompensated absences\n227,147\n155,962\nAccrued legal and accounting fees\n83,738\n105,933\nSales tax payable\n17,544\n17,248\nFactoring fees\n5,495\n31,458\nOther\n87,548\n68,461\nTotal\n$ 508,487\n$ 572,885\nNOTE N-RELATED PARTY TRANSACTIONS\nLicensing Agreement with Subsidiaries of GSFG.\nOn November 11, 2015, BIO-key Hong Kong Limited, a subsidiary of the Company, entered into a license purchase agreement with certain subsidiaries of China Goldjoy Group Limited (“CGG”). The license agreement provides for the grant of a perpetual, irrevocable, exclusive, worldwide, fully paid license to all software and documentation regarding the software code, toolkit, electronic libraries and related technology currently known as or offered under the name, together with perpetual license under all related patents held by the licensors and any other intellectual property rights owned by the licensors related to the forgoing software. The Company made a one-time payment of $12,000,000 to the licensors. Mr. Yao Jianhu is the chairman and chief executive officer of CGG and served as a director of the Company until August 6, 2020. Mr. Wong Kwok Fong served as the chief technology officer of CGG through October 2016 and is principal stockholder, a director and executive officer of the Company. During the fourth quarter of 2019, the Company recorded an impairment charge of approximately $7 million, bringing the carrying value of FingerQ license rights to zero. Refer to Note I - Resalable License Rights for additional information.\nNon-Interest-Bearing Advances\nDuring the 2019 fiscal year, the Company received a series of non-interest-bearing advances from Mr. Wong Kwok Fong, and Mr. Michael DePasquale, to pay current liabilities. The balance of the advances as at December 31, 2019 was $74,737 and $114,000, respectively, which were both repaid in full during 2020.\nNOTE O-CONVERTIBLE NOTES PAYABLE\nConvertible notes payable as of December 31, 2020 and December 31, 2019 consist of the following:\nDecember 31,\nDecember 31,\nSecurities Purchase Agreement dated July 10, 2019\n$ -\n$ 2,255,454\nJanuary 2020 Note\n-\n-\nFebruary 2020 Note\n-\n-\nMay 2020 Note\n-\n-\nJune 2020 Note\n-\n-\nConvertible notes payable, net\n$ -\n$ 2,255,454\nSecurities Purchase Agreement dated July 10, 2019\nOn July 10, 2019, the Company issued a $3,060,000 principal amount senior secured convertible note (the “Original Note”). At closing, a total of $2,550,000 was funded. The original issue discount was $510,000. The principal amount due of the Original Note was due and payable as follows: $918,000 was due 180 days after funding, $1,071,000 was due 270 days after funding, and the remaining balance due 12 months after the date of funding.\nThe Original Note was secured by a lien on substantially all of the Company’s assets and properties and was convertible at the option of the Investor in shares of common stock at a fixed conversion price of $12.00 per share.\nIn connection with the closing of the Original Note, the Company issued a five-year warrant to the Investor to purchase 250,000 shares of common stock at a fixed exercise price of $12.00 per share, paid a $50,000 commitment fee, and issued 33,334 shares of common stock in payment of a $400,000 due diligence fee. The Company also paid banker fees of $193,500 and legal fees of $71,330. The valuation of the warrant of $595,662 was recorded to debt discount and was amortized over the life of the Original Note. The fees associated with the agreement were allocated to debt issuance costs and additional paid-in capital based on the respective ratio of the valuation of the note and warrant. Amortization of the debt issuance costs and debt discount are included in interest expense on the statement of operations.\nOn March 12, 2020, the Company issued a $3,789,000 principal amount senior secured convertible note (the “Amended Note”), which replaced the Original Note and included an additional $729,000 in interest due to the debt restructuring. The principal amount was due and payable in full on April 13, 2020. The Amended Note was secured by a lien on substantially all of the Company’s assets and properties and was convertible at the option of the Investor into shares of common stock at a fixed conversion price of $5.20 per share. The Company accounted for the transaction as a debt extinguishment and, therefore, the balance of the fees and unamortized discount associated with the Original Note were written off and included as loss on extinguishment of debt. On the day of the amendment, the closing stock price for the day was $6.08, which resulted in a beneficial conversion of $0.88 per share outstanding or $641,215 to be amortized to interest expense over the term of the Amended Note, as adjusted for any debt conversion.\nOn April 12, 2020, and May 6, 2020, the Company entered into amendments (the “Amendments”) to the Amended Note. The Amendments extended the maturity date to June 12, 2020 and extended the Investor’s right to convert the Amended Note into shares of the Company’s common stock at a price of $5.20 per share through June 12, 2020. All other provisions of the Amended Note remained the same.\nUntil the second anniversary of the closing, the investor had the right to purchase up to 20% of the securities the Company issues in any future private placement, subject to certain exceptions for, among other things, strategic investments.\nOn June 10, 2020, the investor converted the last of the remaining principal into shares of common stock for payment in full, and the remaining principal balance was $0. The Amended Note amount of $3,789,000 was converted into 728,654 shares of common stock.\nSecured convertible note payable, net of unamortized debt discount and debt issuance costs was:\nDecember 31,\nDecember 31,\nPrincipal amount\n$ 3,789,000\n$ 3,060,000\nLess: conversion of principal into shares of common stock\n(3,789,000\n)\n-\nNet Principal amount\n-\n3,060,000\nLess: unamortized debt discount and beneficial conversion feature\n-\n(574,330\n)\nLess: unamortized debt issuance costs\n-\n(230,216\n)\nNotes payable, net of unamortized debt discount and debt issuance costs\n$ -\n$ 2,255,454\nJanuary 2020 Note\nOn January 13, 2020, the Company issued a $157,000 principal amount secured 10% convertible redeemable note (the “January 2020 Note”) to an institutional investor with a maturity date of June 13, 2020 which was convertible into common stock at a conversion price of $12.00 per share. The January 2020 Note was redeemable at any time by payment of a premium to the principal balance starting at 10% and increasing to 30%. At the closing, the Company agreed to issue 81,250 shares of common stock in lieu of payment of a $75,000 commitment fee which was reduced to 6,250 shares as the January 2020 Note was repaid prior to the maturity date. The Company paid $7,000 of legal fees for the January 2020 Note.\nOn June 12, 2020, the January 2020 Note was paid in full by payment of $211,984. The 75,000 shares were returned to the Company in July 2020.\nFebruary 2020 Note\nOn February 13, 2020, the Company issued a $126,000 principal amount secured 10% convertible redeemable note (the “February 2020 Note”) to an institutional investor with a maturity date of July 13, 2020 which was convertible into common stock at a conversion price of $9.20 per share. On March 12, 2020, the Original Note was amended to reduce the conversion price to $5.20 per share, which reduced the conversion price of the February Note to $5.20 and resulted in a deemed dividend of $70,998. The February 2020 Note was redeemable at any time by payment of a premium to the principal balance starting at 10% and increasing to 30%. The Company issued 6,250 shares of common stock to the investor in lieu of payment of a $57,500 commitment fee. The Company paid $6,000 of legal fees in connection with the issuance of February 2020 Note.\nThe February 2020 Note was paid in full on July 10, 2020 by payment of $170,442.\nMay 2020 Note\nOn May 6, 2020, the Company issued a $2,415,000 principal amount senior secured convertible note (the “May 2020 Note”). At closing, $2,100,000 was funded. The principal amount was due and payable in five equal monthly installments of $268,333 beginning seven months after the funding date with the remaining balance due on the twelfth month after the date of funding. The May 2020 Note was convertible at a fixed convertible price of $9.28 per share. In connection with the issuance of the May 2020 Note, the Company paid a $133,333 due diligence fee by issuing 14,368 shares of common stock to the Investor priced at $9.28 per share. The Company also paid a placement fee of 7% of the gross proceeds to a placement agent. In connection with the closing of the May 2020 Note, the Company issued a five-year warrant to the investor to purchase 237,500 shares of common stock at a fixed exercise price of $9.28 and was immediately exercisable. The valuation of the warrant of $876,937 was recorded to debt discount and was amortized over the life of the May 2020 Note. The fees associated with the agreement were allocated to debt issuance costs and additional paid-in-capital based on the respective ratio of the valuation of the note and warrant. Amortization of the debt issuance costs and debt discount were included in the interest expense on the statement of operations.\nFollowing the completion of the underwritten offering in July 2020, the principal balance of $2,415,000 was paid in full during the third quarter of 2020. As a result of the repayment, the Company expensed the remaining debt discounts and issuance costs of $1,218,163 in July 2020.\nJune 2020 Note\nOn June 29, 2020, the Company issued a $1,811,250 principal amount senior secured convertible note (the “June 2020 Note”). At closing, $1,575,000 was funded. The principal amount was due and payable in nine equal monthly installments of $201,250 beginning four months after the funding date with the remaining balance due on the twelfth month after the date of funding. The June 2020 Note was convertible at a fixed convertible price of $9.28 per share. In connection with the issuance of the June 2020 Note, the Company paid a $100,000 due diligence fee by issuing 17,071 shares to the Investor priced at $5.86 per share. The Company also paid a placement fee of 7% of the gross proceeds to a placement agent.\nIn connection with the closing of the June 2020 Note, the Company issued a five-year warrant to the Investor to purchase 178,125 shares of common stock at a fixed exercise price of $9.28 per share, and was immediately exercisable. The valuation of the warrant of $511,402 was recorded to debt discount and was amortized over the life of the June 2020 Note. The fees associated with the agreement were allocated to debt issuance costs and additional paid-in capital based on the respective ratio of the valuation of the note and warrant. Amortization of the debt issuance costs and debt discount are included in interest expense on the statement of operations.\nFollowing the completion of the underwritten offering in July 2020, the principal balance of $1,811,250 was paid in full during the third quarter of 2020. As a result of the repayment, the Company expensed the remaining debt discounts and issuance costs of $957,919 in July 2020.\nNOTE P-LEASES\nThe Company’s leases office space in New Jersey, Hong Kong, Minnesota, and New Hampshire with lease termination dates of 2023, 2022, 2022, and 2022, respectively. The leases include non-lease components with variable payments. The following tables present the components of lease expense and supplemental balance sheet information related to the operating leases, were:\nYear ended December 31,\nYear ended December 31,\nLease cost\nOperating lease cost\n$ 239,192\n$ 186,246\nShort-term lease cost\n-\n41,535\nTotal lease cost\n$ 239,192\n$ 227,781\nBalance sheet information\nOperating right-of-use assets\n$ 487,325\n$ 566,479\nOperating lease liabilities, current portion\n$ 234,309\n$ 170,560\nOperating lease liabilities, non-current portion\n264,163\n390,466\nTotal operating lease liabilities\n$ 498,472\n$ 561,026\nWeighted average remaining lease term (in years) - operating leases\n2.26\n3.33\nWeighted average discount rate - operating leases\n5.50\n%\n5.50\n%\nSupplemental cash flow information related to leases were as follows:\nCash paid for amounts included in the measurement of operating lease liabilities\n$ 235,186\n$ 179,105\nMaturities of operating lease liabilities were as follows as of December 31, 2020:\n$ 256,977\n187,594\n89,225\nTotal future lease payments\n$ 533,796\nLess: imputed interest\n(35,324\n)\nTotal\n$ 498,472\nNOTE Q-COMMITMENTS AND CONTINGENCIES\nSales Incentive Agreement with TTI\nOn March 25, 2020, the Company entered into a sales incentive agreement Technology Transfer Institute (“TTI”). Terms of the agreement include the following:\n1.\nThe term of the agreement is one year unless notice to terminate (as defined) is given. The agreement will be automatically extended for additional one-year terms unless terminated.\n2.\nFor each $5,000,000 in revenue (up to a maximum of $20,000,000) TTI generates during the first year that results in net income of at least 20% (as defined), the Company will pay TTI a sales incentive fee of $500,000 payable by the issuance of 62,500 shares of common stock.\n3.\nIn the event that TTI generates revenue in excess of $20,000,000 during the first year, the Company will issue TTI a five-year warrant to purchase 12,500 shares of Common Stock at an exercise price of $12.00 per share for each $1,000,000 of revenue in excess of $20,000,000 (up to a maximum of $25,000,000).\nIn no event will the Company be obligated to issue more than 250,000 shares of common stock or warrants to purchase more than 62,500 shares of common stock pursuant to this agreement.\nThere has been no revenue generated nor sales incentive fees paid during the period ended December 31, 2020.\nLitigation\nFrom time to time, we may be involved in litigation relating to claims arising out of our operations in the normal course of business. As of December 31, 2020, the Company was not a party to any pending lawsuits.\nNOTE R- EQUITY\n1. Preferred Stock\nWithin the limits and restrictions provided in the Company’s Certificate of Incorporation, the Board of Directors has the authority, without further action by the shareholders, to issue up to 5,000,000 shares of preferred stock, $.0001 par value per share, in one or more series, and to fix, as to any such series, any dividend rate, redemption price, preference on liquidation or dissolution, sinking fund terms, conversion rights, voting rights, and any other preference or special rights and qualifications.\n2. Common Stock\nEffective November 20, 2020, the Company implemented a reverse stock split of its outstanding common stock at a ratio of 1-for-8. The number of authorized shares and the par value of the Company's common stock and preferred stock were not affected by the reverse stock split. Stockholders who otherwise would be entitled to receive fractional shares were rounded up to the nearest whole share. The reverse stock split became effective at the opening of trading on November 20, 2020.\nHolders of common stock have equal rights to receive dividends when, as and if declared by the Board of Directors, out of funds legally available therefor. Holders of common stock have one vote for each share held of record and do not have cumulative voting rights.\nHolders of common stock are entitled, upon liquidation of the Company, to share ratably in the net assets available for distribution, subject to the rights, if any, of holders of any preferred stock then outstanding. Shares of common stock are not redeemable and have no preemptive or similar rights. All outstanding shares of common stock are fully paid and nonassessable.\nIssuances of Common Stock\nOn July 23, 2020, the Company completed an underwritten public offering of shares of common stock and warrants resulting in net proceeds of approximately $22.7 million, after deducting underwriting discounts and commissions and estimated offering expenses. 4,264,313 shares of common stock were issued as a result of this offering, and a further 797,038 shares of common stock were issued upon the exercise of 512,500 prefunded warrants and 284,538 warrants exercised in conjunction with the offering.\nOn March 30, 2020, the Company issued 121,500 shares of common stock upon exercise of warrants at $12.00 per share, resulting in proceeds of $1,458,000 to the Company.\nSee Note O Convertible Notes Payable for common stock issuances related to conversion of convertible notes payable and shares of common stock issued for fees in connection with the agreements during fiscal 2020 and 2019.\nIssuances of Nonvested Stock\nNonvested stock consists of shares of common stock that are subject to restrictions on transfer and risk of forfeiture until the fulfillment of specified conditions. The fair value of nonvested shares is determined based on the market price of the Company's common stock on the grant date. Nonvested stock is expensed ratably over the term of the restriction period.\nThe Company issued 38,250 and 3,125 shares of restricted common stock in August and November of 2020, respectively to certain employees and directors of the Company. These shares vest in equal annual installments over a three-year period from the date of grant, and had a fair value on the date of issuance of $198,900, and $11,250, respectively. Nonvested stock compensation for the year ended December 31, 2020 was $23,764.\nIssuances to Directors, Executive Officers & Consultants\nDuring the year ended December 31, 2020, the Company issued 5,270 shares of common stock to its directors in lieu of payment of board fees, valued at $28,511. During the year ended December 31, 2019, the company issued 4,612 shares of common stock to its directors in lieu of payment of board fees, valued at $35,013.\nEmployees’ exercise options\nDuring 2020 and 2019, no employee stock options were exercised.\n3. Warrants\nSecurities Purchase Agreement dated November 13, 2014:\nAs part of a Securities Purchase Agreement, dated November 13, 2014, by and between the Company and a number of private and institutional investors, the Company issued to certain private investors warrants to purchase 124,610 shares of common stock. The warrants expired in November 2019.\nSecurities Purchase Agreement dated September 23, 2015:\nOn September 23, 2015, the Company issued warrants (the “2015 Warrants”) to purchase 8,681 shares of common stock in connection with the issuance of a promissory note. The warrants were immediately exercisable at an initial exercise price of $28.80 per share and had a term of five years. The 2015 Warrants expired in September 2020.\nThe 2015 Warrants had a \"full ratchet\" anti-dilution adjustment provision which could be triggered in the event the Company sold or granted any additional shares of common stock, options, warrants or other securities that were convertible into common stock at a price lower than $28.80 per share. The anti-dilution was not triggered by certain “exempt issuances” which among other issuances, includes the issuance of shares of common stock, options or other securities to officers, employees, directors, consultants or service providers.\nAnti-dilution features were triggered as follows:\nOn February 14, 2020, the February 2020 Note was issued at a conversion price of $9.20 that triggered the anti-dilution provisions included in the 2015 Warrants. In addition, the amendments to the Original Note reduced the conversion price of the Original Note to $5.20 which also triggered the anti-dilution provision of the 2015 Warrants. As a result of the forgoing transactions, the number of shares of common stock issuable upon the full exercise of the 2015 Warrants increased to 48,078, the exercise was reduced to $5.20 per share, and the Company recorded a non-cash deemed dividend in amount of $41,688.\nWarrants Issued for Services:\nDuring the second quarter of 2020, the Company issued a warrant to purchase 15,625 shares of common stock to an investor in payment for a business referral valued at $94,655.\nDuring the third quarter of 2020, the Company issued a warrant to purchase 3,125 shares of common stock to a former employee for a business referral valued at $12,921.\nWarrants Issued with Convertible Notes:\nIn 2020, the Company issued warrants to purchase 415,625 shares in connection with the May 2020 and June 2020 Notes. In 2019, the Company issued a warrant to purchase 250,000 shares in connection with the Securities Purchase Agreement dated July 10, 2019.\nValuation Assumptions for Warrants:\nThe Company records the warrants at their fair value which is determined using the Black-Scholes valuation model on the date of the grant. The fair value of each warrant was estimated with the following assumptions:\nYear ended\nDecember 31,\nWeighted average Risk free interest rate\n0.33\n%\n1.82 %\nWeighted average price\n$ 9.25\n$ 12.00\nWeighted average exercise period\nWeighted average Volatility of stock price\n%\n%\nThe warrant volatility for each issuance is determined based on the review of the experience of the weighted average of historical daily price changes of the Company’s common stock over the expected exercise period. The risk-free rate is based on the U.S. Treasury yield curve in effect at the time of grant for periods corresponding with the years to maturity.\nA summary of warrant activity is as follows:\nTotal\nWarrants\nWeighted\naverage\nexercise\nprice\nWeighted\naverage\nremaining\nlife\n(in years)\nAggregate\nintrinsic\nvalue\nOutstanding, as of December 31, 2018\n472,622\n12.72\n2.05\nGranted\n250,000\n12.00\nExercised\n-\n-\nForfeited\n-\n-\nExpired\n(299,063\n)\n12.00\nOutstanding, as of December 31, 2019\n423,559\n12.80\n3.94\n-\nGranted - public offering\n4,264,313\n5.20\nGranted - prefunded warrants from the public offering\n512,500\n0.08\nGranted - other\n434,375\n9.25\nIncrease due to trigger of anti-dilution provision feature\n27,244\n5.20\nExercised - public offering\n(284,538\n)\n5.20\nExercised - prefunded warranted from the public offering\n(512,500\n)\n0.08\nExercised - other\n(121,500\n)\n12.00\nForfeited\n-\n-\nExpired\n(54,066\n)\n6.86\nOutstanding, as of December 31, 2020\n4,689,387\n6.04\n4.48\n-\nNOTE S-STOCK OPTIONS\n2004 Stock Option Plan\nOn October 12, 2004, the Board of Directors of the Company approved the 2004 Stock Option Plan (the “2004 Plan”). The 2004 Plan was not presented to stockholders for approval and thus incentive stock options were not available under this plan. Under the terms of this plan, 20,834 shares of common stock were reserved for issuance to employees, officers, directors, and consultants of the Company at exercise prices which may not be below 85% of fair market value. The term of stock options granted may not exceed ten years. Options issued under the 2004 Plan vest pursuant to the terms of stock option agreements with the recipients. In the event of a change in control, as defined, all options outstanding vest immediately. The 2004 Plan expired in October 2014.\n2015 Stock Option Plan\nOn January 27, 2016, the shareholders approved the 2015 Equity Incentive Plan (the “2015 Plan”). Under the terms of this plan, 187,500 shares of common stock are reserved for issuance to employees, officers, directors, and consultants of the Company at exercise prices which may not be below 100-110% of fair market value. At our annual shareholders meeting in 2019, we adopted an amendment to the 2015 Plan which increases the number of shares of common stock authorized for issuance under the 2015 Plan from 83,334 shares to 187,500 shares and also effected certain changes in light of the Tax Cuts and Jobs Act of 2017 and its impact on Section 162(m) of the United States Internal Revenue Code of 1986, as amended. The term of stock options granted may not exceed ten years. Options issued under the 2015 Plan vest pursuant to the terms of stock option agreements with the recipients. In the event of a change in control, certain stock awards issued under this plan may be subject to additional acceleration of vesting as may be provided in the participants’ written agreement. The 2015 Plan expires in December 2025.\nNon-Plan Stock Options\nPeriodically, the Company has granted options outside of the 2004 and 2015 Plans to various employees and consultants. In the event of change in control, as defined, certain of the non-plan options outstanding vest immediately.\nStock Option Activity\nInformation summarizing option activity is as follows:\nNumber of Options\nWeighted\naverage\nWeighted\naverage\nremaining\nAggregate\nPlan\nPlan\nNon\nPlan\nTotal\nexercise\nprice\nlife\n(in years)\nintrinsic\nvalue\nOutstanding, as of December 31, 2018\n4,167\n47,740\n146,596\n198,503\n$ 21.76\nGranted\n-\n30,167\n-\n30,167\n9.36\nExercised\n-\n-\n-\n-\n-\nForfeited\n-\n(5,077\n)\n(521\n)\n(5,598\n)\n18.16\nExpired\n(261\n)\n(1,839\n)\n(2,005\n)\n(4,105\n)\n24.64\nOutstanding, as of December 31, 2019\n3,906\n70,991\n144,070\n218,967\n$ 20.08\n5.00\n$\nGranted\n-\n28,440\n-\n28,440\n5.04\nExercised\n-\n-\n-\n-\n-\nForfeited\n-\n(4,545\n)\n-\n(4,545\n)\n17.34\nExpired\n(3,906\n)\n(703\n)\n(10,979\n)\n(15,588\n)\n29.17\nOutstanding, as of December 31, 2020\n-\n94,183\n133,091\n227,274\n$ 17.61\n3.87\n$\nVested or expected to vest at December 31, 2020\n209,427\n$ 18.51\n3.68\n$\nExercisable at December 31, 2020\n167,980\n$ 20.77\n3.21\n$\nThe options outstanding and exercisable at December 31, 2020 were in the following exercise price ranges:\nOptions Outstanding\nOptions Exercisable\nRange of exercise prices\nNumber of\nshares\nWeighted\naverage\nexercise\nprice\nWeighted\naverage\nremaining\nlife (in years)\nNumber\nexercisable\nWeighted\naverage\nexercise\nprice\n$ 3.60 - 5.20\n28,065\n$ 5.01\n6.67\n$ 4.08\n$ 5.21 - 15.68\n49,919\n12.16\n4.82\n23,814\n13.30\n$ 15.69 - 39.36\n149,290\n21.80\n3.06\n144,082\n22.01\n$ 3.60 - 39.36\n227,274\n167,980\nThe aggregate intrinsic value in the table above represents the total intrinsic value, based on the Company’s closing stock price of $3.52 as of December 31, 2020, which would have been received by the option holders had all option holders exercised their options as of that date. The total number of in-the-money options exercisable as of December 31, 2020 was 0.\nThe weighted average fair value of options granted during the years ended December 31, 2020 and 2019 was $3.16 and $8.24 per share, respectively. The total intrinsic value of options exercised during the years ended December 31, 2020 and 2019 was $0. The total fair value of shares vested during the years ended December 31, 2020 and 2019 was $899,750 and $891,760, respectively.\nAs of December 31, 2020, future forfeiture adjusted compensation cost related to nonvested stock options is $232,547 and will be recognized over an estimated weighted average period of 1.21 years.\nNOTE T-INCOME TAXES\nThere was no provision for federal or state taxes as at December 31, 2020 and 2019.\nThe Company has deferred taxes due to income tax credits, net operating loss carryforwards, and the effect of temporary differences between the carrying values of certain assets and liabilities for financial reporting and income tax purposes. Significant components of deferred taxes are as follows at December 31:\nAccrued compensation\n$ 81,000\n$ 84,000\nAccounts receivable allowance\n474,000\n474,000\nStock-based compensation\n1,073,000\n894,000\nBasis differences in fixed assets\n(14,000\n)\n(5,000\n)\nBasis differences in intangible assets\n65,000\n62,000\nNet operating loss and credit carryforwards\n13,337,000\n15,002,000\nValuation allowances\n(15,016,000\n)\n(16,511,000\n)\n$ -\n$ -\nThe Company has a valuation allowance against the full amount of its net deferred taxes due to the uncertainty of realization of the deferred tax assets due to operating loss history of the Company. The Company currently provides a valuation allowance against deferred taxes when it is more likely than not that some portion, or all of its deferred tax assets will not be realized. The valuation allowance could be reduced or eliminated based on future earnings and future estimates of taxable income. Similarly, income tax benefits related to stock options exercised have not been recognized in the financial statements.\nAs of December 31, 2020, the Company has federal net operating loss carryforwards of approximately $63 million. Approximately $52 million are subject to expiration between 2020 and 2037, and $11 million net operating loss carryforwards have no expiration date. These net operating loss carryforwards are subject to the limitations under Section 382 of the Internal Revenue Code due to changes in the equity ownership of the Company.\nA reconciliation of the effective income tax rate on operations reflected in the Statements of Operations to the US Federal statutory income tax rate is presented below.\nFederal statutory income tax rate\n%\n%\nPermanent differences\n(9\n)\n(2\n)\nEffect of net operating loss\n(12\n)\n(19\n)\nEffective tax rate\n-\n%\n-\n%\nThe Company has not been audited by the Internal Revenue Service (“IRS”) or any states in connection with income taxes. The Company files income tax returns in the U.S. federal jurisdiction and various state jurisdictions. The periods from 2017 through 2020 remain open to examination by the IRS and state jurisdictions. The Company believes it is not subject to any tax audit risk beyond those periods. The Company’s policy is to recognize interest and penalties accrued on any unrecognized tax benefits as a component of income tax expense. The Company does not have any accrued interest or penalties associated with any unrecognized tax benefits, nor was any interest expense incurred during the years ended December 31, 2020 and 2019.\nNOTE U-PROFIT SHARING PLAN\nThe Company has established a savings plan under section 401(k) of the Internal Revenue Code. All employees of the Company, after completing one day of service, are eligible to enroll in the 401(k) plan. Participating employees may elect to defer a portion of their salary on a pre-tax basis up to the limits as provided by the IRS Code. The Company is not required to match employee contributions but may do so at its discretion. The Company made no contributions during the years ended December 31, 2020 and 2019.\nNOTE V-EARNINGS PER SHARE (EPS)\nThe Company’s basic EPS is calculated using net income (loss) available to common shareholders and the weighted-average number of shares outstanding during the reporting period. Diluted EPS includes the effect from potential issuance of common stock, such as stock issuable pursuant to the exercise of stock options and warrants and the assumed conversion of preferred stock.\nThe reconciliation of the numerator of the basic and diluted EPS calculations for the following fiscal years ended December 31:\nBasic Numerator:\nNet Loss\n$ (9,673,987\n)\n$ (14,588,700\n)\nDeemed dividend from trigger of anti-dilution provision feature\n(112,686\n)\n-\nNet loss available to common stockholders (basic and diluted EPS)\n$ (9,786,673\n)\n$ (14,588,700\n)\nThe following table summarizes the weighted average securities that were excluded from the diluted per share calculation because the effect of including these potential shares was antidilutive due to net losses.\nYears ended December 31,\nStock options\n1,002\nRestricted stock\n3,098\n-\nConvertible notes\n-\n182,343\nPotentially dilutive securities\n4,100\n182,461\nItems excluded from the diluted per share calculation because the exercise price was greater than the average market price of the common shares:\nYears ended December 31,\nStock options\n223,899\n218,716\nWarrants\n4,689,387\n423,559\nTotal\n4,913,286\n642,275\nNOTE W-SUBSEQUENT EVENTS\nOn March 4, 2021, the Company issued 1,375 shares of common stock to its directors in payment of board fees. Additionally, the Company issued an aggregate of 1,250 shares of restricted common stock to two new employees which vest in equal annual installments over a three-year period from the date of grant.\nOn March 9, 2021, the Company issued 278 shares of common stock to its directors in payment of board committee fees.\nThe Company has reviewed subsequent events through the date of this filing.\nEXHIBIT INDEX\nExhibit\nExhibit\nNo.\n2.1\nStock Purchase Agreement by and among the Company, Thomas J. Hoey, and PistolStar, Inc. dated June 6, 2020 (incorporated by reference to Exhibit 2.1 to the Current Report on Form 8-K, filed with the SEC on July 7, 2020).\n3.1\nCertificate of Incorporation of BIO-key International, Inc., a Delaware corporation (incorporated by reference to Exhibit 3.1 to the current report on Form 8-K, filed with the SEC on January 5, 2005)\n3.2\nBylaws (incorporated by reference to Exhibit 3.3 to the current report on Form 8-K, filed with the SEC on January 5, 2005)\n3.3\nCertificate of Amendment to Certificate of Incorporation (incorporated by reference to Appendix A to the definitive proxy statement, filed with the SEC on January 18, 2006)\n3.4\nCertificate of Amendment of Certificate of Incorporation of Bio-key International, Inc., a Delaware corporation (incorporated by reference to Exhibit 3.4 to the annual report on Form 10-K, filed with the SEC on March 31, 2015)\n3.5\nCertificate of Elimination of BIO-key International, Inc. filed October 6, 2015 (incorporated by reference to Exhibit 3.5 to the registration statement on Form S-1 File No. 333-208747 filed with the SEC on December 23, 2015)\n3.6\nCertificate of Designation of Preferences, Rights and Limitations of Series A-1 Convertible Preferred Stock (incorporated by reference to Exhibit 3.1 to the current report on Form 8-K, filed with the SEC on November 2, 2015)\n3.7\nCertificate of Designation of Preferences, Rights and Limitations of Series B-1 Convertible Preferred Stock (incorporated by reference to Exhibit 3.1 to the quarterly report on Form 10-Q, filed with the SEC on November 16, 2015)\n3.8\nCertificate of Amendment of Certificate of Incorporation of Bio-key International, Inc., a Delaware corporation (incorporated by reference to Exhibit 3.1 to the current report on Form 8-K, filed with the SEC on December 28, 2016)\n3.9\nCertificate of Amendment of Certificate of Incorporation of Bio-Key International, Inc., a Delaware corporation (incorporated by reference to Exhibit 3.1 to the current report on Form 8-K, filed with the SEC on November 19, 2020)\n4.1\nSpecimen Stock Certificate (incorporated by reference to Exhibit 4.1 to the registration statement on Form SB-2, File No. 333-16451)\n4.2\nForm of Pre-Funded Warrant (incorporated by reference to Exhibit 4.2 to Amendment No. 1 to the Registration Statement on Form S-1/A, filed with the SEC on July 17, 2020).\n4.3\nForm of Warrant (incorporated by reference to Exhibit 4.3 to Amendment No. 1 to the Registration Statement on Form S-1/A, filed with the SEC on July 17, 2020).\n4.4\nForm of Warrant Agency Agreement (incorporated by reference to Exhibit 4.4 to Amendment No. 2 to the Registration Statement on Form S-1/A, filed with the SEC on July 20, 2020).\n10.1\nEmployment Agreement by and between BIO-key International, Inc. and Mira LaCous dated November 20, 2001 (incorporated by reference to Exhibit 10.39 to the current report on Form 8-K, filed with the SEC on January 22, 2002)***\n10.2\nBIO-key International, Inc. 2004 Stock Incentive Plan (incorporated by reference to Exhibit 10.48 to amendment no. 1 the registrant’s registration statement on Form SB-2, File No. 33-120104, filed with the SEC on December 14, 2004)***\n10.3\nEmployment Agreement, effective March 25, 2010, by and between the Company and Michael W. DePasquale (incorporated by reference to Exhibit 10.93 to the annual report on Form 10-K, filed with the SEC on March 26, 2010)***\n10.4\nEmployment Agreement by and between BIO-key International, Inc. and Cecilia Welch dated May 15, 2013 (incorporated by reference to Exhibit 10.42 to the annual report on Form 10-K, filed with the SEC on March 31, 2014)***\n10.5\nThird Amendment to Lease Agreement by and between BIO-key International, Inc. and Victor AOP, Inc. dated June 30, 2013 (incorporated by reference to Exhibit 10.43 to the annual report on Form 10-K, filed with the SEC on March 31, 2014)\n10.6\nFirst Amendment to Lease Agreement by and between BIO-key International, Inc. and BRE/DP MN LLC dated September 12, 2013 (incorporated by reference to Exhibit 10.44 to the annual report on Form 10-K, filed with the SEC on March 31, 2014)\n10.7\nBIO-key International, Inc. 2015 Equity Incentive Plan (incorporated by reference to Appendix B to the definitive proxy statement filed with the SEC on December 15, 2015)***\n10.9\nSoftware License Purchase Agreement Dated November 11, 2015 by and among BIO-key Hong Kong Limited, Shining Union Limited, WWTT Technology China, Golden Vast Macao Commercial Offshore Limited, Giant Leap International Limited (incorporated by reference to Exhibit 10.36 to the registration statement on Form S-1 File No. 333-208747 filed with the SEC on December 23, 2015)**\n10.11\nForm of Registration Rights Agreement (incorporated by reference to Exhibit 10.3 to the current report on Form 8-K, filed with the SEC on May 3, 2017)\n10.12\nForm Non-Plan Option Agreement between the Company and certain of its directors, officers, employees and contractors (incorporated by reference to Exhibit 10.4 to the quarterly report on Form 10-Q filed with the SEC on May 15, 2017)***\n10.13\nSecurities Purchase Agreement dated April 3, 2018 by and between the Registrant and Wong Kwok Fong (Kelvin) (incorporated by reference to Exhibit 10.1 to the current report on Form 8-K, filed with the SEC on April 4, 2018)\n10.14\nSecurities Purchase Agreement dated May 23, 2018 by and between the Registrant and Giant Leap International Limited (incorporated by reference to Exhibit 10.1 to the current report on Form 8-K, filed with the SEC on May 30, 2018)\n10.15\nSecurities Purchase Agreement dated May 23, 2018 by and between the Registrant and Micron Technology Development Limited (incorporated by reference to Exhibit 10.2 to the current report on Form 8-K, filed with the SEC on May 30, 2018)\n10.16\nSecurities Purchase Agreement dated May 31, 2018 by and between the Registrant and Wong Kwok Fong (Kelvin) (incorporated by reference to Exhibit 10.1 to the current report on Form 8-K, filed with the SEC on June 4, 2018)\n10.17\nUnderwriting Agreement dated August 22, 2018 by and between the Registrant and Maxim Group LLP (incorporated by reference to Exhibit 1.1 to the current report on Form 8-K, filed with the SEC on August 27, 2018)\n10.18\nForm of Common Stock Purchase Warrant dated August 24, 2018 (incorporated by reference to Exhibit 4.1 to the current report on Form 8-K, filed with the SEC on August 27, 2018)\n10.19\nGLP 2nd Amendment to Lease dated July 27, 2018 (incorporated by reference to Exhibit 10.26 to the annual report on Form 10-K, filed with the SEC on April 1, 2019)\n10.20\nMarlen 4th Amendment to Lease dated June 2, 2018 (incorporated by reference to Exhibit 10.27 to the annual report on Form 10-K, filed with the SEC on April 1, 2019)\n10.21\nSecurities Purchase Agreement dated July 10, 2019 by and between the Registrant and Lind Global Macro Fund, LP. (incorporated by reference to Exhibit 10.1 to the quarterly report on Form 10-Q, filed with the SEC on August 14, 2019)\n10.22\nSecurity Agreement dated July 10, 2019 by and between the Registrant and Lind Global Macro Fund, LP. (incorporated by reference to Exhibit 10.2 to the quarterly report on Form 10-Q, filed with the SEC on August 14, 2019)\n10.23\nCollateral Sharing Agreement dated July 10, 2019 by and among the Registrant, Lind Global Macro Fund, LP and Versant Funding LLC (incorporated by reference to Exhibit 10.3 to the quarterly report on Form 10-Q, filed with the SEC on August 14, 2019)\n10.24\n$3,060,00 Senior Secured Convertible Promissory Note dated July 10, 2019 (incorporated by reference to Exhibit 10.4 to the quarterly report on Form 10-Q, filed with the SEC on August 14, 2019)\n10.25\nCommon Stock Purchase Warrant dated July 10, 2019 (incorporated by reference to Exhibit 10.5 to the quarterly report on Form 10-Q, filed with the SEC on August 14, 2019)\n10.26\nBIO-key International, Inc. Amended and Restated 2015 Equity Incentive Plan (incorporated by reference to Appendix A to the definitive proxy statement filed with the SEC on April 30, 2019)***\n10.27\nSales Incentive Agreement with Technology Transfer Institute dated March 25, 2020. (incorporated by reference to Exhibit 10.1 to the quarterly report on Form 10-Q, filed with the SEC on June 8, 2020)\n10.28\nForm of Technology Transfer Institute Warrant. (incorporated by reference to Exhibit 10.2 to the quarterly report on Form 10-Q, filed with the SEC on June 8, 2020)\n10.29\nAmended and Restated Senior Secured Convertible Promissory Note, due April 13, 2020 issued by the Company to Lind Global Macro Fund, LP. (incorporated by reference to Exhibit 10.3 to the quarterly report on Form 10-Q, filed with the SEC on June 8, 2020)\n10.30\nAmendment to Amended and Restated Senior Secured Convertible Promissory Note, due April 13, 2020 by and between the Company and Lind Global Macro Fund, LP dated April 12, 2020. (incorporated by reference to Exhibit 10.4 to the quarterly report on Form 10-Q, filed with the SEC on June 8, 2020)\n10.31\nSecurities Purchase Agreement dated May 6, 2020 by and between the Company and Lind Global Macro Fund, LP. (incorporated by reference to Exhibit 10.5 to the quarterly report on Form 10-Q, filed with the SEC on June 8, 2020)\n10.32\n$2,415,000 Senior Secured Convertible Promissory Note dated May 6, 2020. (incorporated by reference to Exhibit 10.6 to the quarterly report on Form 10-Q, filed with the SEC on June 8, 2020)\n10.33\nCommon Stock Purchase Warrant dated May 6, 2020. (incorporated by reference to Exhibit 10.7 to the quarterly report on Form 10-Q, filed with the SEC on June 8, 2020)\n10.34\nAmended and Restated Security Agreement dated May 6, 2020 by and between the Company and Lind Global Macro Fund, LP. (incorporated by reference to Exhibit 10.8 to the quarterly report on Form 10-Q, filed with the SEC on June 8, 2020)\n10.35\nAmendment No. 2 to Amended and Restated Senior Secured Convertible Promissory Note, due April 13, 2020 by and between the Company and Lind Global Macro Fund, LP dated May 13, 2020. (incorporated by reference to Exhibit 10.9 to the quarterly report on Form 10-Q, filed with the SEC on June 8, 2020)\n10.36\nSecurities Purchase Agreement dated June 29, 2020 by and between the Company and Lind Global Macro Fund, LP (incorporated by reference to Exhibit 10.1 to the current report on Form 8-K, filed with the SEC on July 1, 2020)\n10.37\n$1,811,250 Senior Secured Convertible Promissory Note dated June 29, 2020. (incorporated by reference to Exhibit 10.2 to the current report on Form 8-K, filed with the SEC on July 1, 2020)\n10.38\nCommon Stock Purchase Warrant dated May 6, 2020. (incorporated by reference to Exhibit 10.3 to the current report on Form 8-K, filed with the SEC on July 1, 2020)\n10.39\nSecond Amended and Restated Security Agreement dated June 29, 2020 by and between the Company and Lind Global Macro Fund, LP (incorporated by reference to Exhibit 10.4 to the current report on Form 8-K, filed with the SEC on July 1, 2020)\n10.40\n$500,000 Promissory note, dated June 30, 2020 (Incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K, filed with the SEC on July 7, 2020).\n10.41\nForm of Restricted Stock Award Agreement under the BIO-key International, Inc. Amended & Restated 2015 Equity Incentive Plan (incorporated by reference to Exhibit 10.1 to the current report on Form 8-K, filed with the SEC on August 28, 2020)***\n10.42*\nEmployment Agreement by and between BIO-key International, Inc. and James Sullivan dated April 5, 2017 ***\n21.1*\nList of subsidiaries of BIO-key International, Inc.\n23.1*\nConsent of RMSBG\n31.1*\nCertification of the Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2*\nCertification of the Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1*\nCertification of the Chief Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2*\nCertification of the Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS*\nXBRL Instance\n101.SCH*\nXBRL Taxonomy Extension Schema\n101.CAL*\nXBRL Taxonomy Extension Calculation\n101.DEF*\nXBRL Taxonomy Extension Definition\n101.LAB*\nXBRL Taxonomy Extension Labels\n101.PRE*\nXBRL Taxonomy Extension Presentation\n* filed herewith\n** Confidential treatment has been requested with respect to certain portions of this exhibit. Omitted sections have been filed separately with the Securities and Exchange Commission\n*** Management compensatory plan.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nBIO-KEY INTERNATIONAL, INC.\nDate: March 29, 2021\nBy:\n/s/ MICHAEL W. DEPASQUALE\nMichael W. DePasquale\nCHIEF EXECUTIVE OFFICER\n(Principal Executive Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities on the dates indicated.\nSignature\nTitle\nDate\n/s/ MICHAEL W.\nDEPASQUALE\nChairman of the Board of Directors, Chief Executive Officer and Director\n(Principal Executive Officer)\nMarch 29, 2021\nMichael W. DePasquale\n/s/ CECILIA WELCH\nChief Financial Officer (Principal Financial and Accounting Officer)\nMarch 29, 2021\nCecilia Welch\n/s/ROBERT J. MICHEL\nDirector\nMarch 29, 2021\nRobert J. Michel\n/s/ THOMAS E. BUSH III\nDirector\nMarch 29, 2021\nThomas E. Bush\n/s/ THOMAS GILLEY\nDirector\nMarch 29, 2021\nThomas Gilley\n/s/ WONG KWOK FONG\nDirector\nMarch 29, 2021\nWong Kwok Fong\n/s/ PIETER KNOOK\nDirector\nMarch 29, 2021\nPieter Knook\n/s/ MANNY ALIA\nDirector\nMarch 29, 2021\nManny Alia\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934 as amended, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nBIO-KEY INTERNATIONAL, INC.\nDate: March 29, 2021\nBy:\n/s/ Michael DePasquale\nMichael DePasquale\nChief Executive Officer"
}