{
    "cik": "1021435",
    "company": "hopTo Inc.",
    "filing_type": "10-K",
    "filing_date": "2021-03-31",
    "period_of_report": "2020-12-31",
    "sic": "7372",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1021435/0001493152-21-007517-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1021435/000149315221007517/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1021435/0001493152-21-007517.txt",
    "filename": "1021435_10K_2020_0001493152-21-007517.htm",
    "item_1": "ITEM 1. BUSINESS\nIntroduction\nhopTo, Inc., through its wholly owned subsidiary GraphOn Corporation (collectively, “we”, “us,” “our” or the “Company”), is a developer of application publishing software which includes application virtualization software and cloud computing software for multiple computer operating systems including Windows, UNIX and several Linux-based variants. Our application publishing software solutions are sold under the brand name GO-Global, which is our sole revenue source. GO-Global is an application access solution for use by independent software vendors (“ISVs”), corporate enterprises, governmental and educational institutions, and others who wish to take advantage of cross-platform remote access and Web-enabled access to their existing software applications, as well as those who are deploying secure, private cloud environments.\nFor detailed historical information on the hopTo products and technologies, please refer to our previously filed Annual Report on form 10-K which are available at www.sec.gov. Such filings are being noted for historical information only; unless expressly noted, they are not incorporated herein by reference.\nCorporate Background\nWe are a Delaware corporation, founded in May 1996. Our headquarters are located at 6 Loudon Road, Suite 200, Concord, NH 03301, and our phone number is 408-688-2674. We also have remote employees located in various states, as well as internationally in the United Kingdom. Our corporate Internet Website is http://www.hopTo.com. The information on our Website is not part of this Annual Report on Form 10-K.\nOur Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and any amendments to such reports filed with or furnished to the SEC under sections 13(a) or 15(d) of the Securities Exchange Act of 1934 are made available free of charge on our corporate Internet Website investor webpage at www.hopto.com (click on “SEC Reporting” link) as soon as reasonably practicable after such reports are electronically filed with or furnished to the SEC. We may suspend our obligation to make such reports in the future.\nThe GO-Global Software Products\nOur GO-Global product offerings, which currently are our only revenue source, can be categorized into product families as follows:\n● GO-Global for Windows: Allows access to Windows-based applications from remote locations and a variety of connections, including the Internet connections. The Windows applications run on a central computer server along with GO-Global Windows Host software. This allows the applications to be accessed remotely via GO-Global Client software, or a Web browser, over many types of data connections, regardless of the bandwidth or operating system. Web-enabling is achieved without modifying the underlying application’s code or requiring costly add-ons.\n● GO-Global for UNIX: Allows access to UNIX and Linux-based applications from remote locations and a variety of connections, including the Internet and connections. The UNIX/Linux applications run on a central computer server along with the GO-Global for UNIX Host software. This allows the applications to be accessed and run remotely via GO-Global Client software or a Web browser without having to modify the application’s code or requiring costly add-ons.\n● GO-Global Client: We offer a range of GO-Global Client software that allows remote application access from a wide variety of local, remote and mobile platforms, including Windows, Linux, UNIX, Apple OS X and iOS, and Google Android. We plan to continue to develop GO-Global Client software for new portable and mobile devices.\nTarget Markets\nThe target market for our GO-Global products includes small to medium-sized companies, departments within large corporations, governmental and educational institutions and independent software vendors (ISVs). Our software enables these targeted organizations to move their existing applications to the public cloud and provide SaaS, or move them to a secure, private cloud environment. By using our software, organizations can give their remote users, partners and customers access to their native applications. Our software is designed to allow these organizations and enterprises to tailor the configuration of the end-user device for a particular purpose, rather than following a “one PC fits all” high-cost ownership model. We believe our opportunities are as follows:\n● ISVs. By Web-enabling their applications through use of our products, we believe that our ISV customers can accelerate their time to market without the risks and delays associated with rewriting applications or using other third-party software, thereby opening up additional revenue opportunities and securing greater satisfaction and loyalty from their customers.\nOur technology integrates with their existing software applications without sacrificing the full-featured look and feel of such applications, thereby providing ISVs with out-of-the-box Web-enabled applications with their own branding for licensed, volume distribution to their enterprise customers.\n● Enterprises Employing Windows and Unix/Linux. Enterprises ranging from small to medium-sized companies to departments in large companies use GO-Global software to allow users to access applications from remote locations and from different client devices. We believe that our software products reduce the cost and complexity of connecting PCs to various applications.\nSales and Marketing\nOur GO-Global products are primarily sold through resellers both domestically and internationally. The resellers consist of OEMs, system integrators, value-added resellers and distributors. The reseller channel acts as a sales force for our GO-Global products by creating awareness and also providing integration and support services for our current and potential customers. We support our existing reseller channel and seek to grow our reseller partners through direct marketing activities that include digital marketing, promotional materials, direct response and maintaining an active Web presence for marketing and sale purposes.\nFor the year ended December 31, 2020, we had one reseller that represented more than 14.5% of sales and one reseller that represented 44.7% of accounts receivable. For the year ended December 31, 2019, we had two resellers that represented 14.0% and 14.3% of sales, respectively and one reseller that represented 17.9% of accounts receivable. For the purposes of this description, “sales” refers to the dollar value of orders received from these customers and partners in the period indicated. The sales values do not necessarily equal recognized revenue for these periods due to our revenue recognition policies which require deferral of revenue associated with prepaid software service fees.\nOperations\nWe perform all purchasing, order processing and shipping of products and accounting functions related to our operations. We generally ship products and fulfill orders electronically so we do not maintain any prepackaged inventory. Additionally, we have relatively little backlog at any given time; thus, we do not consider backlog a significant indicator of future performance.\nCompetition\nThe software markets in which we participate are highly competitive. Competitive factors in our market space include price, product quality, functionality, product differentiation and the breadth and variety of product offerings and product features. We believe that our products offer certain advantages over our competitors, particularly in product performance and market positioning.\nGO-Global competes with developers of conventional server-based software for the individual PC, as well as with other companies in the cloud computing software market and the application virtualization software market. We believe our principal competitors in the cloud computing software market include Citrix Systems, Inc., OpenText Communications, Ltd. and Microsoft Corporation. Citrix is an established leading vendor of virtualization software, OpenText is an established market leader for remote access to UNIX applications and Microsoft is an established leading vendor of Windows operating systems and services for servers.\nEmployees\nAs of March 31, 2021, we had a full-time equivalent of 12.5 total employees, including 2 in marketing, sales and support, 8.5 in research and development (which is inclusive of employees who may also perform customer service related activities), 2 in administration and finance. We believe our relationship with our employees is good. None of our employees are covered by a collective bargaining agreement.\nRecent Developments",
    "item_1A": "Item 1A. Risk Factors\nThe risks and uncertainties described below could materially and adversely affect our business, financial condition and results of operations and could cause actual results to differ materially from our expectations. The risk factors described below include the considerable risks associated with the current economic environment and the related potential adverse effects on our financial condition and results of operations. You should read these risk factors in conjunction with “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Item 7 and our Consolidated Financial Statements and related notes in Item 8. There also may be other factors that we cannot anticipate or that are not described in this report generally because we do not currently perceive them to be material. Those factors could cause results to differ materially from our expectations.\nRisks Related to Our Business\nWe have a history of operating and net losses.\nWe have experienced significant operating and net losses since we began operations. After years of losses, we had net income for 2019 of $554,300 and 2020 of $693,700; however, such improvement in our financial performance could reverse if our GO-Global business, our only source of revenue, declines or if we are unable to maintain control over our expenses.\nThe coronavirus pandemic could adversely affect our results of operations.\nThe recent coronavirus pandemic throughout the United States and the world has resulted in the United States and other countries halting or sharply curtailing the movement of people, goods and services. All of this has caused extended shutdowns of businesses and the prolonged economic impact remains uncertain. At this point, we believe the conditions will have a material adverse effect on our business but given the rapidly changing developments we cannot accurately predict what effects these conditions will have on our business, which will depend on, among other factors, the ultimate geographic spread of the virus, the duration of the outbreak and travel restrictions and business closures imposed by the United States and various other governments.\nOur revenue is typically generated from a limited number of resellers.\nA material portion of our revenue, all of which is currently derived from our GO-Global products, during any reporting period is typically generated from a limited number of resellers in certain countries or geographic regions, all of which are unrelated third parties. We are seeking to expand the number of resellers of our GO-Global products to grow our revenues and diversify our revenue geographically. However, our inability to expand the number of resellers and/or a reduction in the orders from our current resellers could materially adversely impact our revenues.\nIf we are unable to develop new products and enhancements to our existing products, our business, results of operations, financial condition, and cash flows could be materially adversely impacted.\nThe market for our products and services is characterized by:\n● frequent new product and service introductions and enhancements;\n● rapid technological change;\n● evolving industry standards;\n● fluctuations in customer demand; and\n● changes in customer requirements.\nOur future success depends on our ability to continually enhance our current products and develop and introduce new features and capabilities that our customers choose to buy. If we are unable to satisfy our customers’ demands and remain competitive with other products that could satisfy their needs by introducing new features, capabilities and enhancements, our business, results of operations, financial condition, and cash flows could be materially adversely impacted. Our future success could be hindered by, among other factors:\n● the amount of cash we have available to fund investment in new products and enhancements;\n● the reduced level of research and development resources that we have available in the Company to perform the work necessary to develop new features and capabilities\n● delays in our introduction of new features, capabilities and/or enhancements of existing products;\n● disruptions in our operations or customer relations due to the coronavirus pandemic;\n● delays in market acceptance of new products and/or enhancements of existing products; and\n● a competitor’s announcement of new products and/or product enhancements or technologies that could replace or shorten the life cycle of our existing products.\nFor example, sales of our GO-Global software could be affected by the announcement from Microsoft of an intended release, and the subsequent actual release, of a new Windows-based operating system, or an upgrade to a previously released Windows-based operating system version. These new or upgraded systems may contain similar features to our products or they could contain architectural changes that would temporarily prevent our products from functioning properly within a Windows-based operating system environment.\nWe are subject to various liquidity risks.\nWe have incurred significant net losses since our inception. As of December 31, 2020, we had an accumulated deficit of $79,240,700 and a working capital of $3,281,600. Our ability to continue to generate net profits and positive cash flows from operations is dependent on our ability to continue to generate revenue from our legacy GO-Global business, which in turn is subject to a variety of risks, some of which are described in this Annual Report on Form 10-K. As a small company, we have limited ability to deploy new revenue increasing opportunities, and limited flexibility to respond to unforeseen adverse developments, such as customer losses, adverse market developments or unanticipated expenses. Although our current operating plan does not call for the raising of new capital, if we need to raise new capital, our ability to do so is extremely limited given our small market capitalization and the limited volume in the trading of our common stock.\nIf we do need to issue new equity, such issuances may be at a significant discount to market prices, would dilute existing stockholders and may give the purchasers of new capital stock additional rights, preferences and privileges relative to existing stockholders. There can be no assurance that additional capital necessary for any execution of our operations will be available on a timely basis, on reasonable terms or at all.\nChallenges to develop new business may reverse the improvements in our finances.\nOur management believes that any significant improvement in our cash flow must result from increases in revenues from existing sources and from new revenue sources. Our ability to develop new revenues depends on many factors not in our control, or only partially in its control, including available capital resources which affect the extent of our marketing activities and our research and development activities, all of which are limited by our small size and revenue base. We cannot assure you that the resources that we can devote to marketing and to research and development will be sufficient to increase its revenues to levels that will enable us to maintain positive operating cash flow in the future.\nSales of products within our GO-Global product families are likely to be our only source of revenue during 2021.\nSales of products within our GO-Global product families, and related enhancements, were our only source of revenue during 2020 and will continue to be our only source of revenue during 2021. The success, if any, of our new GO-Global releases may depend on a number of factors, including market acceptance of the new GO-Global releases and our ability to manage the risks associated with introducing such releases. Declines in demand for our GO-Global products could occur as a result of, among other factors:\n● lack of success with our strategic partners;\n● new competitive product releases and updates to existing competitive products;\n● decreasing or stagnant information technology spending levels;\n● price competition;\n● technological changes;\n● disruptions in our operations or customer relations due to the coronavirus pandemic; or\n● general economic conditions in the markets in which we operate.\nIf our customers do not continue to purchase GO-Global products as a result of these or other factors, our revenue would decrease and our results of operations, financial condition, and cash flows would be adversely affected.\nOur operating results in one or more future periods are likely to fluctuate significantly and may fail to meet or exceed the expectations of investors.\nOur operating results are likely to fluctuate significantly in the future on a quarterly and annual basis due to a number of factors, many of which are outside our control. Factors that could cause our operating results and therefore our revenues to fluctuate include the following, among other factors:\n● variations in the size of orders by our customers;\n● increased competition;\n● disruptions in our operations or customer relations due to the coronavirus pandemic; and\n● the proportion of overall revenues derived from different sales channels such as distributors, original equipment manufacturers (“OEMs”) and others.\nIn addition, our royalty and license revenues are impacted by fluctuations in OEM licensing activity from quarter to quarter, which may involve one-time orders from non-recurring customers, or customers who order infrequently. Our expense levels are based, in part, on expected future orders and sales; therefore, if orders and sales levels are below expectations, our operating results are likely to be materially adversely affected. Additionally, because significant portions of our expenses are fixed, a reduction in sales levels may disproportionately affect our net financial results. Also, we may reduce prices and/or increase spending in response to competition or to pursue new market opportunities. Because of these factors, our operating results in one or more future periods may fail to meet or exceed the expectations of investors. In that event, the trading price of our common stock would likely be adversely affected.\nWe will encounter challenges in recruiting, hiring and retaining new personnel and/or replacements for any members of key management or other personnel who depart.\nOur success and business strategy is dependent in large part on our ability to attract and retain key management and other personnel in certain areas of our business. If any of these employees were to leave, we would need to attract and retain replacements for them. We have lost employees, including at the officer level and in our new products engineering group, in the past. Without a successful replacement, the loss of the services of one or more key members of our management group and other key personnel could have a material adverse effect on our business.\nWe do not have long-term employment agreements with any of our key personnel and any officer or other employee can terminate their relationship with us at any time. We may also need to add key personnel in the future in order to successfully implement our business strategies. The market for such qualified personnel is highly competitive and it includes other potential employers whose financial resources for such qualified personnel are more substantial than ours. Consequently, we could find it difficult to attract, assimilate or retain such qualified personnel in sufficient numbers to successfully implement our business strategies.\nWe have sought to match our expenses structure with business opportunities, but this creates risks. We rely on the considerable expertise of our Board of Directors and the moderate use of professional advisors. This arrangement limits our ability to respond to challenges and develop opportunities. Should we revise our approach to management by hiring additional resources, this too, can create risks to the cost savings we have achieved, if any anticipated business opportunities are not realized.\nOur failure to adequately protect our proprietary rights may adversely affect us.\nOur commercial success is dependent, in large part, upon our ability to protect our proprietary rights. We rely on a combination of patent, copyright and trademark laws, as well as trade secrets, confidentiality provisions and other contractual provisions to protect our proprietary rights. These measures afford only limited protection. We cannot assure you that measures we have taken or may take in the future will be adequate to protect us from misappropriation or infringement of our intellectual property. Despite our efforts to protect proprietary rights, it may be possible for unauthorized third parties to copy aspects of our products or obtain and use information that we regard as proprietary. In addition, the laws of some foreign countries do not protect our intellectual property or other proprietary rights as fully as do the laws of the United States. Furthermore, we cannot assure you that the existence of any proprietary rights will prevent the development of competitive products. The infringement upon, or loss of, any proprietary rights, or the development of competitive products despite such proprietary rights, could have a material adverse effect on our business.\nOur business significantly benefits from strategic relationships and there can be no assurance that such relationships will continue in the future.\nOur business and strategy rely to a significant extent on our strategic relationships with other companies. There is no assurance that we will be able to maintain or further develop any of these relationships or to replace them in the event any of these relationships are terminated. In addition, any failure to renew or extend any license between any third party and us may adversely affect our business.\nWe rely on indirect distribution channels for our products and may not be able to retain existing reseller relationships or develop new reseller relationships.\nOur GO-Global products are primarily sold through several distribution channels. An integral part of our strategy is to strengthen our relationships with resellers such as OEMs, systems integrators, value-added resellers s, distributors and other vendors to encourage these parties to recommend or distribute our products and to add resellers both domestically and internationally. We currently invest, and intend to continue to invest, significant resources to expand our sales and marketing capabilities. We cannot assure you that we will be able to attract and/or retain resellers to market our products effectively. Our inability to attract resellers and the loss of any current reseller relationships could have a material adverse effect on our business, results of operations, financial condition, and cash flows. Additionally, we cannot assure you that resellers will devote enough resources to provide effective sales and marketing support to our products.\nThe markets in which we participate are highly competitive and have more established competitors.\nThe markets we participate in with GO-Global are intensely competitive, rapidly evolving and subject to continuous technological changes. We expect competition to increase in each of these markets as other companies introduce additional competitive products. In order to compete effectively, we must continually develop and market new and enhanced products and market those products at competitive prices. As markets for our products continue to develop, additional companies, including companies in the computer hardware, software and networking industries with significant market presence, may enter the markets in which we compete and further intensify competition. A number of our current and potential competitors have longer operating histories, greater name recognition and significantly greater financial, sales, technical, marketing and other resources than we do. We cannot give any assurance that our competitors will not develop and market competitive products that will offer superior price or performance features, or that new competitors will not enter our markets and offer such products. We believe that we will need to invest significant financial resources in research and development to remain competitive in the future in each of the markets in which we compete. Such financial resources may not be available to us at the time or times that we need them, or upon terms acceptable to us, or at all. We cannot assure you that we will be able to establish and maintain a significant market position in the face of our competition and our failure to do so would adversely affect our business.\nRisks Related to Our Common Stock\nOur stock is thinly traded and its price has been historically volatile.\nOur stock is thinly traded. As such, holders of our stock are subject to a high risk of illiquidity, e.g., you may not be able to sell as many shares at the price you would like, or you may not be able to purchase as many shares at the price you would like, due to the low average daily trading volume of our stock. Additionally, the market price of our stock has historically been volatile; it has fluctuated significantly to date. The trading price of our stock is likely to continue to be highly volatile and subject to wide fluctuations. Your investment in our stock could lose some or all of its value.\nFuture sales of our common stock could adversely affect its price and our future capital-raising activities, and could involve the issuance of additional equity securities, which would dilute current stockholder investments in our common stock and could result in lowering the trading price of our common stock.\nWe may sell securities in the public or private equity markets if and when conditions are favorable. Sales of substantial amounts of common stock, or the perception that such sales could occur, could adversely affect the prevailing market price of our common stock and our ability to raise capital. We may issue additional common stock in future financing transactions or as incentive compensation for our management team and other key personnel, consultants and advisors. Issuing any equity securities would be dilutive to the equity interests represented by our then-outstanding shares of common stock. The market price for our common stock could decrease as the market takes into account the dilutive effect of any of these issuances. Furthermore, we may enter into financing transactions and issue securities with rights and preferences senior to the rights and preferences of our common stock, and we may issue securities at prices that represent a substantial discount to the market price of our common stock. A negative reaction by investors and securities analysts to any discounted sale of our equity securities could result in a decline in the trading price of our common stock.\nWe may make acquisitions, which could require significant management attention, disrupt our business, dilute our stockholders, and seriously harm our business.\nAs part of our business strategy, we intend to make acquisitions in the future (although we do not currently have any probable acquisitions). Our ability to acquire and successfully integrate larger or more complex companies, products, and technologies is unproven. In the future, we may not be able to find other suitable acquisition candidates, and we may not be able to complete acquisitions on favorable terms, if at all. In addition, if we fail to successfully close transactions or integrate new teams, or integrate the products and technologies associated with these acquisitions into our company, our business could be seriously harmed. Any integration process may require significant time and resources, and we may not be able to manage the process successfully. We may not successfully evaluate or use the acquired products, technology, and personnel, or accurately forecast the financial impact of an acquisition transaction, including accounting charges. We may also incur unanticipated liabilities that we assume as a result of acquiring companies. We may have to pay cash, incur debt, or issue equity securities to pay for any acquisition, any of which could seriously harm our business. Selling equity to finance any such acquisitions would also dilute our stockholders. Incurring debt would increase our fixed obligations and could also include covenants or other restrictions that would impede our ability to manage our operations.\nIn addition, on average, it is difficult to finalize the purchase price allocation and accounting. Therefore, it is possible that our valuation of an acquisition may change and result in unanticipated write-offs or charges, impairment of our goodwill, or a material change to the fair value of the assets and liabilities associated with a particular acquisition, any of which could seriously harm our business.\nWe are not likely to have the capital to acquire large businesses. Therefore, the businesses we acquire may require significant investment in corporate infrastructure, repositioning, incremental sales, marketing or product development.\nOur acquisition strategy may not succeed if we are unable to remain attractive to target companies or expeditiously close transactions.\nWe have a significant number of outstanding warrants and options, and future sales of these shares could adversely affect the market price of our common stock.\nAs of December 31, 2020, we had outstanding warrants for an aggregate of 248,216 shares of common stock, at a weighted average exercise price of $0.01 per share. As of December 31, 2020, we had outstanding options exercisable for an aggregate of 93,076 shares of our common stock at a weighted average exercise price of $3.03 per share. The holders may sell these shares exercisable under warrants or options in the public markets from time to time. In addition, if our stock price rises, more outstanding warrants and options will be “in-the-money” and the holders may exercise their warrants and options and sell a large number of shares. This could cause the market price of our common stock to decline.\nOur common stock is quoted on the FINRA OTC Bulletin Board, which may have an unfavorable impact on our stock price and liquidity.\nOur common stock is currently quoted under the symbol “HPTO” on the OTC Bulletin Board market (“OTCBB”) operated by FINRA (Financial Industry Regulatory Authority) and on the OTC Markets Group QB tier (“OTCQB”). Neither the OTCBB nor the OTCQB is a “national securities exchange,” and in general, each is a significantly more limited market than the markets operated by the New York Stock Exchange and NASDAQ. The quotation of our shares on the OTCBB and the OTCQB could result in a less liquid market being available for existing and potential stockholders to trade shares of our common stock, which could depress the trading price of our common stock and have a long-term adverse impact on our ability to raise capital in the future. Because of the limited trading market for our common stock, and because of the significant price volatility, investors may not be able to sell their shares of common stock when they want to do so. We may not support any continued trading market for our shares.\nOur stock may lose access to a viable trading market.\nGiven the increasing cost and resource demands of being a public company, we may decide to “go dark,” or discontinue our obligation to make periodic filings with the SEC, by deregistering our securities, for a period of time until our assets and stockholder base are sufficient to warrant public trading again. During such time, there would be a substantial decrease in disclosure by us of our operations and prospects, and a substantial decrease in the liquidity in our common stock even though stockholders may still continue to trade our common stock in the OTC market or “pink sheets.” The market’s interpretation of a company’s motivation for “going dark” varies from cost savings, to negative changes in the firm’s prospects, to serving insider interests, which may affect the overall price and liquidity of a company’s securities.\nWe have never paid dividends on our common stock, and we do not anticipate paying any cash dividends in the foreseeable future.\nWe have never declared or paid dividends on our common stock, nor do we anticipate paying any cash dividends for the foreseeable future. We currently intend to retain future earnings, if any, to finance the operations and expansion of our business. Any future determination to pay cash dividends will be at the discretion of our Board of Directors and will be dependent upon the earnings, financial condition, operating results, capital requirements and other factors as deemed necessary by our Board of Directors.\nFINRA’s sales practice requirements may also limit a stockholder’s ability to buy and sell our stock.\nFINRA has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customer’s financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low priced securities will not be suitable for at least some customers. FINRA’s requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit your ability to buy and sell our stock and have an adverse effect on the market for our shares.\nProvisions in our Amended and Restated Certificate of Incorporation and Amended and Restated Bylaws and our Rights Agreement may prevent or discourage third parties or our stockholders from attempting to replace our management or influencing significant decisions.\nProvisions in our Amended and Restated Certificate of Incorporation and Second Amended and Restated Bylaws may have the effect of delaying or preventing a change in control of our company or our management, even if doing so would be beneficial to our stockholders. These provisions include, but are not limited to, authorizing our board of directors to issue preferred stock without stockholder approval and limiting the persons who may call special meetings of stockholders and providing that stockholders cannot take action by written consent in lieu of a meeting. In addition, our Rights Agreement, entered into by us and American Stock Transfer & Trust Company, LLC (as rights agent) on February 16, 2018, as amended on November 2, 2018 and February 16, 2021 (collectively, the “Rights Agreement”), works by imposing a significant penalty upon any person or group (including a group of persons that are acting in concert with each other) that acquires five percent (5%) or more of our common stock without the approval of our board of directors. As a result, the overall effect of the Rights Agreement and the issuance of the rights thereunder may be to render more difficult or discourage a merger, tender or exchange offer or other business combination involving that is not approved by our board of directors. The Rights Agreement is not intended to interfere with any merger, tender or exchange offer or other business combination approved by our board of directors. Nor does the Rights Agreement prevent the Board from considering any offer that it considers to be in the best interest of its stockholders. The Rights Agreement expired at or prior to the earlier of (i) February 16, 2031 or (ii) the redemption or exchange of the rights thereunder, as provided for in the Rights Agreement. Together, these charter and contractual arrangements could make the removal of management more difficult and may discourage transactions that otherwise could involve payment of a premium over prevailing market prices for our common stock.\nAnti-takeover provisions contained in our certificate of incorporation and bylaws, as well as provisions of Delaware law, could impair a takeover attempt.\nOur certificate of incorporation, bylaws and Delaware law contain provisions that could have the effect of rendering more difficult or discouraging an acquisition deemed undesirable by our board of directors. Our corporate governance documents include provisions:\n● authorizing blank check preferred stock, which could be issued with voting, liquidation, dividend and other rights superior to our common stock;\n● limiting the liability of, and providing indemnification to, our directors and officers;\n● limiting the ability of our stockholders to call and bring business before special meetings and to take action by written consent in lieu of a meeting;\n● requiring advance notice of stockholder proposals for business to be conducted at meetings of our stockholders and for nominations of candidates for election to our board of directors;\n● controlling the procedures for the conduct and scheduling of board of directors and stockholder meetings;\n● providing our board of directors with the express power to postpone previously scheduled annual meetings and to cancel previously scheduled special meetings;\n● limiting the determination of the number of directors on our board of directors and the filling of vacancies or newly created seats on the board to our board of directors then in office; and\n● requiring a supermajority of two-thirds of stockholders to amend certain provisions of our certificate of incorporation or to amend our bylaws.\nThese provisions, alone or together, could delay hostile takeovers and changes in control of our company or changes in our management.\nAs a Delaware corporation, we are also subject to provisions of Delaware law, including Section 203 of the Delaware General Corporation Law, which prevents some stockholders holding more than 15% of our outstanding common stock from engaging in certain business combinations without approval of the holders of substantially all of our outstanding common stock. Any provision of our amended and restated certificate of incorporation or bylaws or Delaware law that has the effect of delaying or deterring a change in control could limit the opportunity for our stockholders to receive a premium for their shares of our common stock, and could also affect the price that some investors are willing to pay for our common stock.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNone.",
    "item_2": "Item 2. Properties\nOur corporate headquarters currently occupies approximately 2,527 square feet of office space in Concord, New Hampshire, under a month-to-month lease arrangement for a monthly payment of $4,000 per month, which can be cancelled at any time by either party with a six-month advance notice.\nWe have certain employees who work remotely in various states. We believe our current facilities will be adequate to accommodate our needs for the foreseeable future.",
    "item_3": "Item 3. Legal Proceedings\nFrom time to time, we are party to various lawsuits, claims and other legal proceedings that arise in the ordinary course of our business. We are not currently a party to any legal proceedings that we believe would reasonably be expected to have a materially adverse effect on our business, financial condition or results of operations.",
    "item_4": "Item 4. Mine safety disclosures\nNot applicable.\nPART II",
    "item_5": "Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nSince March 27, 2003 our common stock has been quoted on the Over-the-Counter Bulletin Board under the symbol “HPTO.”\nOn March 31, 2021 there were approximately 47 holders of record of our common stock.\nDividends\nWe have never declared or paid dividends on our common stock, nor do we anticipate paying any cash dividends for the foreseeable future. We currently intend to retain future earnings, if any, to finance the operations and expansion of our business. Any future determination to pay cash dividends will be at the discretion of our Board of Directors and will be dependent upon the earnings, financial condition, operating results, capital requirements and other factors as deemed necessary by the Board of Directors.",
    "item_6": "Item 6. Selected Financial Data\nNot applicable for smaller reporting companies.",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nIntroduction\nWe are developers of application publishing software which includes application virtualization software and cloud computing software for multiple computer operating systems including Windows, UNIX and several Linux-based variants. Our application publishing software solutions are sold under the brand name GO-Global, which is our sole revenue source at this time. GO-Global is an application access solution for use and/or resale by independent software vendors (“ISVs”), corporate enterprises, governmental and educational institutions, and others who wish to take advantage of cross-platform remote access and Web-enabled access to their existing software applications, as well as those who are deploying secure, private cloud environments.\nThe following discussion should be read in conjunction with the consolidated financial statements and related notes provided in Item 8 “Financial Statements and Supplementary Data” in this Annual Report on Form 10-K.\nCritical Accounting Policies\nBasis of Presentation and Use of Estimates\nThe consolidated financial statements include the accounts of hopTo Inc. and its subsidiaries (collectively, “we”, “us”, “our”, or “Company”); significant intercompany accounts and transactions are eliminated upon consolidation. The preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States (“GAAP”) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. These estimates include: the amount of stock-based compensation expense; the allowance for doubtful accounts; the estimated lives of property of equipment, valuation and amortization of intangible assets (including capitalized software); depreciation of long-lived assets; valuation of warrants; post-employment benefits; and accruals for liabilities, deferred rent, and taxes. While the Company believes that such estimates are fair, actual results could differ materially from those estimates.\nRevenue Recognition\nThe Company markets and licenses its products indirectly through channel distributors, independent software vendors (“ISVs”), value-added resellers, hosting service providers, corporate enterprises, governmental and educational institutions and others. Our product licenses are perpetual. We also separately sell intellectual property licenses, maintenance contracts, which are comprised of license updates and customer service access, as well as other products and services.\nThere are no rights of return granted to purchasers of the Company’s software products.\nThe Company recognizes revenue in accordance with Accounting Standards Codification (“ASC”) 606, “Revenue from Contracts with Customers.” Revenues under ASC 606 are recognized when the promised goods or services are transferred to customers in an amount that reflects the consideration to which the Company expects to be entitled to in exchange for those goods or services.\nFor the years ended December 31, 2020 and 2019, revenue recognition was determined by\n● identifying the contract, or contracts, with a customer;\n● identifying the performance obligations in each contract;\n● determine the transaction price;\n● allocating the transaction price to the performance obligations in each contract; and\n● recognizing revenue when, or as, we satisfy performance obligations by transferring the promised goods or services\nWhen control of the promised products and services are transferred to our customers, we recognize revenue in the amount that reflects the consideration we expect to receive in exchange for these products and services.\nProduct Sales\nAll of our licenses are delivered to the customer electronically. The Company sends the license key to the customer to download the related software from Company portal. We recognize revenue upon delivery of these licenses. For stocking resellers who purchase licenses through inventory stocking orders with the intent to resell to an end-user, revenue is recognized when the resellers’ accounts have been credited, at their discretion, for the number of licenses purchased.\nMaintenance revenue is also recognized from service contracts ratably over the related contract period.\nCash and Cash Equivalents\nThe Company considers all highly liquid holdings with maturities of three months or less at the time of purchase to be cash equivalents. The Company had no cash equivalents as of December 31, 2020 or 2019.\nAllowance for Doubtful Accounts\nWe maintain an allowance for doubtful accounts that reflects our best estimate of potentially uncollectible trade receivables. The allowance is based on assessments of the collectability of specific customer accounts and the general aging and size of the accounts receivable. We regularly review the adequacy of our allowance for doubtful accounts by considering such factors as historical experience, credit worthiness, and current economic conditions that may affect a customer’s ability to pay. We specifically reserve for those accounts deemed uncollectible. We also establish, and adjust, a general allowance for doubtful accounts based on our review of the aging and size of our accounts receivable. As of December 31, 2020 and 2019, the allowance for doubtful accounts totaled $5,900 and $7,300, respectively.\nSoftware Development Costs\nUnder the criteria set forth in Financial Accounting Standards Board’s (FASB) Accounting Standards Codification (ASC) 985-20, “Costs of Software to be Sold, Leased or Marketed,” development costs incurred in the research and development of new software products are expensed as incurred until technological feasibility, in the form of a working model, has been established, at which time such costs are capitalized until the product is available for general release to customers. The Company did not capitalize any software development costs during 2020 or 2019. The Company makes ongoing evaluations of the recoverability of its capitalized software projects by comparing the net amount capitalized for each product to the estimated net realizable value of the product. If such evaluations indicate that the unamortized software development costs exceed the net realizable value, the Company writes off the amount by which the unamortized software development costs exceed net realizable value.\nLong-Lived Assets\nLong-lived assets are assessed for possible impairment whenever events or changes in circumstances indicate that the carrying amounts may not be recoverable, whenever we have committed to a plan to dispose of the assets or, at a minimum, annually. Typically, for long-lived assets to be held and used, measurement of an impairment loss is based on the fair value of such assets, with fair value being determined based on appraisals, current market value, comparable sales value, and discounted future cash flows, among other variables, as appropriate. Assets to be held and used (which assets are affected by an impairment loss) are depreciated or amortized at their new carrying amount over their remaining estimated life; assets to be sold or otherwise disposed of are not subject to further depreciation or amortization. No such impairment charge was recorded during the year ended December 31, 2020 or 2019.\nConcentration of Credit Risk\nFinancial instruments, which potentially subject the Company to concentration of credit risk, consist principally of cash and trade receivables. The Company places its cash with high quality financial institutions. As of December 31, 2020, the Company had approximately $4,125,300 of cash with financial institutions in excess of FDIC insurance limits. As of December 31, 2019, the Company had approximately $1,291,900 of cash with financial institutions in excess of FDIC insurance limits.\nFor the year ended December 31, 2020, we had one reseller that represented more than 14.5% of sales and one reseller that represented 44.7% of accounts receivable. For the year ended December 31, 2019, we had two resellers that represented 14.0% and 14.3% of sales, respectively and one reseller that represented 17.9% of accounts receivable. For the purposes of this description, “sales” refers to the dollar value of orders received from these customers and partners in the period indicated. The sales values do not necessarily equal recognized revenue for these periods due to our revenue recognition policies which require deferral of revenue associated with prepaid software service fees.\nIncome Taxes\nThe Company accounts for income taxes in accordance with ASC 740, “Income Taxes,” using the asset and liability method. Under this method, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of assets and liabilities and their respective tax bases. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment.\nBasic and Diluted Earnings Per Share\nIn accordance with ASC 260, “Earnings Per Share,” the basic income (loss) per common share is computed by dividing the net income (loss) available to common stockholders by the weighted average common shares outstanding during the period. Diluted income (loss) per share reflect per share amounts that would have resulted if diluted potential common stock had been converted to common stock. Dilutive common share equivalents as of December 31, 2020 and 2019, representing 248,216 and 481,335 outstanding in-the-money warrants respectively, were included in the computation of diluted net income (loss) per share using the Treasury Stock Method. During the year ended December 31, 2020 and 2019, the Company had total common stock equivalents of 93,076 and 106,077 shares, respectively, which excluded from the computation of net income per share because they are anti-dilutive.\nFair Value of Financial Instruments\nThe Company’s financial instruments consist of cash and cash equivalents, accounts receivable, accounts payable, and accrued expenses. The carrying amount of these financial instruments approximates fair value due to the nature of the accounts and their short-term maturities.\nResults of Operations for the Year Ended December 31, 2020 and 2019\nThe following is a comparison of the results of our operations for the years ended December 31, 2020 and 2019.\nFor the Year Ended\nDecember 31, 2020 December 31, 2019\nRevenues:\nSoftware licenses 853,300 952,600\nSoftware service fees 2,474,500 2,483,600\nOther 316,200 93,900\nTotal Revenue 3,644,000 3,530,100\nCost of Revenue:\nSoftware service costs 52,700 52,700\nSoftware product costs 102,300 97,100\nTotal cost of revenue 155,000 149,800\nGross profit $ 3,489,000 $ 3,380,300\nOperating expenses:\nSelling and marketing 509,300 442,400\nGeneral and administrative 900,500 864,700\nResearch and development 1,430,100 1,533,000\nTotal operating expenses 2,839,900 2,840,100\nIncome from operations 649,100 540,200\nOther income:\nOther income 44,600 14,100\nIncome before provision for income taxes 693,700 554,300\nProvision for income taxes - -\nNet income $ 693,700 $ 554,300\nNet income per share, basic $ 0.05 $ 0.06\nNet income per share, diluted $ 0.05 $ 0.05\nWeighted average number of common shares outstanding\nBasic 13,874,699 9,821,177\nDiluted 14,117,850 10,287,183\nSee accompanying notes to consolidated financial statements\nRevenues\nOur software revenue is entirely related to our GO-Global product line, and historically has been primarily derived from product licensing fees and service fees from maintenance contracts. The majority of this revenue has been earned, and continues to be earned, from a limited number of significant customers, most of whom are resellers. some of our resellers purchase software licenses that they hold in inventory until they are resold to the ultimate end user (a “stocking reseller”).\nWhen a software license is sold directly to an end user by us, or by one of our resellers who does not stock licenses into inventory, revenue is recognized immediately upon shipment, assuming all other criteria for revenue recognition are met. Consequently, if any significant end user customer substantially changes its order level, or fails to order during the reporting period, whether the order is placed directly with us or through one of our non-stocking resellers, our software licenses revenue could be materially impacted.\nThe following is a summary of our revenues by category for the year ended December 31, 2020 and 2019.\nFor the Year Ended\nDecember 31, December 31,\n$ Change % Change\nRevenue\nSoftware Licenses\nWindows $ 732,100 $ 906,300 $ (174,200 ) -19.2 %\nUNIX/Linux 121,200 46,300 74,900 161.8 %\nTotal 853,300 952,600 (99,300 ) -10.4 %\nSoftware Service Fees\nWindows 2,255,200 2,192,100 63,100 2.9 %\nUNIX/Linux 219,300 291,500 (72,200 ) -24.8 %\nTotal 2,474,500 2,483,600 (9,100 ) -0.4 %\nOther 316,200 93,900 222,300 236.7 %\n$ 3,644,000 $ 3,530,100 $ 113,900 3.2 %\nSoftware Licenses\nWindows software licenses revenue decreased by $174,200 or 19.2% to $732,100 during the year ended December 31, 2020, from $906,300 as compared to 2019. The decrease was due to a temporary reduction in perpetual license pricing in 2020 during the COVID pandemic and a certain partner that purchased a large order of Windows licenses from the Company during the three months ended March 31, 2019 and the three months ended September 30,2019 that did not recur during same periods of 2020.\nSoftware licenses revenue from our UNIX/Linux products increased by $74,900 or 161.8% to $121,200 during the year ended December 31, 2020 from $46,300 as compared to 2019. The increase was primarily due to higher revenue from higher stocking and standard order licenses.\nSoftware Service Fees\nService fees attributable to our Windows product service increased by $63,100 or 2.9% to $2,255,200 during the year ended December 31, 2020, from $2,192,100 as compared to 2019. The increase was primarily due higher subscription revenue offset by the timing of revenue recognition for maintenance support fees.\nService fees revenue attributable to our UNIX products decreased by $72,200 or 24.8% to $219,300 during the year ended December 31, 2020, from $291,500 as compared to 2019. The decrease was primarily due to the expiration of certain long-term maintenance contracts.\nOther\nOther revenue consists of private labeling fees, professional services, and non-recurring revenues. Other revenue increased by $222,300 or 236.7% to $316,200 for the year ended December 31, 2020, from $93,900 compared to 2019. The primary increase was related to revenue recognized from a one-time, non-recurring a license agreement with an existing customer for the use of our license, and some commission fee paid to a reseller for subscription license sale.\nCost of Revenues\nCost of revenue is comprised primarily of software service costs, which represent the costs of customer service. Also included in cost of revenue are software product costs, which are primarily comprised of the amortization of capitalized software development costs and costs associated with licenses to third party software included in our product offerings, and the required import tax withholdings from Brazil resellers. We incur no significant shipping or packaging costs as virtually all of our deliveries are made via electronic means over the Internet.\nCost of revenue for the year ended December 31, 2020 increased by $5,200, or 3.5%, to $155,000 as compared to $149,800 for 2019. Cost of revenue represented 4.3% and 4.2% of total revenue for the year ended December 31, 2020 and 2019, respectively. The primarily increase was due to increase import tax withholdings associated with higher revenue from Brazil resellers for the period ended December 31, 2020.\nSelling and Marketing Expenses\nSelling and marketing expenses primarily consisted of employee, outside services and travel and entertainment expenses.\nSelling and marketing expenses increased by $66,900, or 15.1%, to $509,300 for the year ended December 31, 2020 from $442,400 as compared to 2019. Selling and marketing expenses represented approximately 14.0% and 12.5% of total revenue for the year ended December 31, 2020 and 2019, respectively. The increase in selling and marketing expenses was due to an increase in marketing spend offset by lower employee benefit costs.\nGeneral and Administrative Expenses\nGeneral and administrative expenses primarily consist of employee costs, depreciation and amortization, legal, accounting, other professional services, rent, travel and entertainment and insurance. Certain costs associated with being a publicly held corporation are also included in general and administrative expenses, as well as bad debt expense.\nGeneral and administrative expenses increased by $35,800, or 4.1%, to $900,500 for the year ended December 31, 2020 from $864,700 as compared to 2019. The increase in general and administrative expense was due in part to fees paid to the board of directors for their service offset by a reduction in accounting fees and employee benefit costs compared to 2019 levels due to changes in service providers and improved cost controls.\nResearch and Development Expenses\nResearch and development expenses consist primarily of employee costs, payments to contract programmers, software subscriptions, travel and entertainment for our engineers, and all rent for our leased engineering facilities.\nResearch and development expenses decreased by $102,900, or 6.7% to $1,430,100 for the year ended December 31, 2020 from $1,533,000 as comparted to 2019. The decrease in research and development expense was primarily due to a decrease in employee benefit costs and consulting fees for outsourced software development.\nOther Income\nOther income increased by $30,500 for the year ended December 31, 2020, compared to same period in 2019 was primarily related to penalty fees from a one-time, non-recurring a license agreement with an existing customer for the use of our license.\nLiquidity and Capital Resources\nAs of December 31, 2020, we had cash of $4,375,300 and a working capital of $3,281,600 as compared to cash of $1,541,900 and a working capital deficit of $101,800 at December 31, 2019. The increase in cash as of December 31, 2020 was primarily the result of cash provided by the rights offering and operations during the period due to increased profitability. We expect our results from operations and capital resources will be sufficient to fund our operations for at least the next 12 months from the date of the filing of this annual report on Form 10-K.\nThe following is a summary of our cash flows from operating, investing and financing activities for the year ended December 31, 2020 and 2019.\nFor the Year Ended\nDecember 31, December 31,\nCash flows provided by operating activities $ 352,800 $ 649,200\nCash flows provided by investing activities $ - $ -\nCash flows provided by financing activities $ 2,480,600 $ 200\nDuring the year ended December 31, 2020, our operating cash flow of $352,800 was primarily the result of our net income for the period of $693,700 including non-cash expenses of $112,400 for contributed services, offset by a decrease in cash resulting from a decrease in accounts payable and accrued expenses. During the year ended December 31, 2019, our cash flows used in operations of $649,200 was primarily the result of our net income of $554,300, including non-cash expenses of $225,100 for contributed services, offset by decrease in accounts payable and accrued expenses.\nWe had no cash flow activity relating to investing activities for the year ended December 31, 2020 or 2019.\nIn 2020, we received net proceeds of $2,480,600 from the Rights Offering and Backstop Agreement. We intend to use the proceeds from the Rights Offering and the Backstop Agreement for general corporate purposes, which may include acquisitions (although we do not currently have any plans with respect to any acquisition).",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nNot applicable for smaller reporting companies.",
    "item_8": "ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nIndex to Consolidated Financial Statements\nPage\nReports of Independent Registered Public Accounting Firms\nConsolidated Balance Sheets as of December 31, 2020 and 2019\nConsolidated Statements of Operations for the Years Ended December 31, 2020 and 2019\nConsolidated Statements of Shareholders’ Equity (Deficit) for the Years Ended December 31, 2020 and 2019\nConsolidated Statements of Cash Flows for the Years Ended December 31, 2020 and 2019\nNotes to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and\nStockholders of hopTo, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of hopTo, Inc. and subsidiaries (collectively the “Company”) as of December 31, 2020 and 2019, and the related consolidated statements of operations, stockholders’ equity (deficit), and cash flows for each of the years then ended, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the consolidated financial position of the Company as of December 31, 2020 and 2019, and the results of their operations and their cash flows for each of the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenue Recognition - Deferral Period of Maintenance Contracts\nCritical Audit Matter Description\nAs described in Note 2 to the consolidated financial statements, revenue is recognized when the promised goods or services are transferred to customers in an amount that reflects the consideration the Company expects to be entitled to for those goods or services. In addition, the Company markets and licenses its products indirectly through resellers, as well as directly to end-customers. In providing maintenance contracts, the Company must make estimates as to the commencement and end dates for certain new and renewal periods for various reasons, including bulk activations and renewals from resellers who obtain and renew maintenance contracts on behalf of many end-users with varying renewal dates, and renewal periods that may lapse and later be renewed. Maintenance revenue is recognized ratably over the contract period, which is generally between one and five years.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to this critical audit matter included the following, among others:\nWe obtained an understanding, and evaluated the design and implementation, of key controls that address the risk of material misstatements relating to the timing and amounts of revenue recognition for maintenance contracts described above.\nWe obtained a sample of contracts with customers that included maintenance elements for both new and existing customers. We read the contract and the related terms and price, and the specified maintenance element. We agreed the price and term of the maintenance element to proper inclusion within the Company’s deferred revenue schedule management utilizes to control and record deferred revenue and relieve earned revenue. We then recalculated amounts recorded as revenue and deferred revenue based on the maintenance contract term and agreed the schedule to the Company’s general ledger.\n/s/ dbbmckennon\nWe have served as the Company’s auditor since 2019.\nNewport Beach, California\nMarch 31, 2021\nhopTo Inc.\nConsolidated Balance Sheets\nDecember 31, December 31,\nAssets\nCurrent assets\nCash and cash equivalents $ 4,375,300 $ 1,541,900\nAccounts receivable, net 417,300 271,200\nPrepaid expenses and other current assets 48,500 59,000\nTotal current assets 4,841,100 1,872,100\nProperty and equipment, net - -\nOther assets 17,800 17,800\nTotal assets $ 4,858,900 $ 1,889,900\nLiabilities and Stockholders’ Deficit\nCurrent liabilities\nAccounts payable $ 251,000 $ 271,900\nAccrued expenses 82,000 106,000\nAccrued wages 141,600 136,400\nDeferred revenue 1,084,900 1,256,000\nTotal current liabilities 1,559,500 1,770,300\nLong-term liabilities\nDeferred revenue 383,000 529,500\nTotal liabilities 1,942,500 2,299,800\nCommitments and contingencies\nStockholders’ equity (deficit)\nPreferred stock, $0.01 par value, 5,000,000 shares authorized, no shares issued and outstanding as of December 31, 2020 or 2019 - -\nCommon stock, $0.0001 par value, 195,000,000 shares authorized, 18,850,675 and 9,834,866 shares issued and outstanding as of December 31, 2020 and 2019, respectively 1,900 1,000\nAdditional paid-in capital 82,155,200 79,523,500\nAccumulated deficit (79,240,700 ) (79,934,400 )\nTotal stockholders’ equity (deficit) 2,916,400 (409,900 )\nTotal liabilities and stockholders’ equity (deficit) $ 4,858,900 $ 1,889,900\nSee accompanying notes to consolidated financial statements\nhopTo Inc.\nConsolidated Statements of Operations\nFor the Year Ended\nDecember 31, December 31,\nRevenues:\nSoftware licenses 853,300 952,600\nSoftware service fees 2,474,500 2,483,600\nOther 316,200 93,900\nTotal Revenue 3,644,000 3,530,100\nCost of Revenue:\nSoftware service costs 52,700 52,700\nSoftware product costs 102,300 97,100\nTotal cost of revenue 155,000 149,800\nGross profit $ 3,489,000 $ 3,380,300\nOperating expenses:\nSelling and marketing 509,300 442,400\nGeneral and administrative 900,500 864,700\nResearch and development 1,430,100 1,533,000\nTotal operating expenses 2,839,900 2,840,100\nIncome from operations 649,100 540,200\nOther income:\nOther income 44,600 14,100\nIncome before provision for income taxes 693,700 554,300\nProvision for income taxes - -\nNet income $ 693,700 $ 554,300\nNet income per share, basic $ 0.05 $ 0.06\nNet income per share, diluted $ 0.05 $ 0.05\nWeighted average number of common shares outstanding\nBasic 13,874,699 9,821,177\nDiluted 14,117,850 10,287,183\nSee accompanying notes to consolidated financial statements\nhopTo Inc.\nConsolidated Statements of Shareholders’ Equity (Deficit)\nCommon Stock Additional\nPaid-In Accumulated\nShares Amount Capital Deficit Total\nBalance at December 31, 2018 9,804,400 $ 1,000 $ 79,298,200 $ (80,488,700 ) $ (1,189,500 )\nContributed services - - 225,100 - 225,100\nCashless xercise of warrants 30,466 - -\nOther rounding - - (100 ) - (100 )\nNet loss - - - 554,300 554,300\nBalance at December 31, 2019 9,834,866 $ 1,000 $ 79,523,500 $ (79,934,400 ) $ (409,900 )\nContributed services - - 112,400 - 112,400\nCashless exercise of warrants 229,141 - - - -\nShares issued for accrued liabilities 120,000 - 39,600 - 39,600\nProceeds from rights offering 8,666,668 2,599,100 - 2,600,000\nIssuance cost for rights offering - - (119,400 ) - (119,400 )\nNet income - - - 693,700 693,700\nBalance at December 31, 2020 18,850,675 $ 1,900 $ 82,155,200 $ (79,240,700 ) $ 2,916,400\nSee accompanying notes to consolidated financial statements\nhopTo Inc.\nConsolidated Statements of Cash Flows\nFor the Year Ended\nDecember 31, December 31,\nCash flows from operating activities\nNet income $ 693,700 $ 554,300\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation -\nContributed services 112,400 225,100\nChanges in allowance for doubtful accounts (1,400 ) 3,700\nChanges in operating assets and liabilities:\nAccounts receivable (144,700 ) (64,100 )\nPrepaid expenses and other current assets 10,500 20,000\nAccounts payable (20,900 ) (46,800 )\nAccrued expenses 15,600 (15,600 )\nAccrued wages 5,200 (9,400 )\nDeposit liability - (12,100 )\nDeferred revenue (317,600 ) (6,300 )\nNet cash provided by operating activities 352,800 649,200\nCash flows from financing activities\nProceeds from rights offering 2,600,000 -\nIssuance cost for rights offering (119,400 ) -\nProceeds from exercise of warrants -\nOther rounding - (100 )\nNet cash provided by financing activities 2,480,600\nNet change in cash 2,833,400 649,400\nCash, beginning of the year 1,541,900 892,500\nCash, end of the year $ 4,375,300 $ 1,541,900\nSee accompanying notes to consolidated financial statements\nhopTo Inc.\nNotes to Consolidated Financial Statements\n1. Organization\nhopTo Inc., a Delaware corporation, through its wholly-owned subsidiary GraphOn Corporation (collectively, “we”, “us,” “our” or the “Company”) are developers of application publishing software which includes application virtualization software and cloud computing software for multiple computer operating systems including Windows, UNIX and several Linux-based variants.\nThe Company sells a family of products under the brand name GO-Global, which is a software application publishing business and is the Company’s sole revenue source at this time. GO-Global is an application access solution for use and/or resale by independent software vendors, corporate enterprises, governmental and educational institutions, and others, who wish to take advantage of cross-platform remote access and Web-enabled access to their existing software applications, as well as those who are deploying secure, private cloud environments.\n2. Significant Accounting Policies\nBasis of Presentation\nThe consolidated financial statements include the accounts of hopTo Inc. and its wholly-owned subsidiaries. All significant intercompany accounts and transactions are eliminated upon consolidation. The consolidated financial statements included herein have been prepared in accordance with accounting principles generally accepted in the United States (“GAAP”) applicable to financial information and the rules and regulations promulgated by the Securities and Exchange Commission (the “SEC”).\nUse of Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenues and expenses during the reported periods. Amounts could materially change in the future. These estimates include the allowance for doubtful accounts and contributed services. While the Company believes that such estimates are fair, actual results could differ materially from those estimates.\nLiquidity\nThe Company has incurred significant net losses since inception. As of December 31, 2020, we had working capital of $3,281,600, which includes deferred revenue of $1,084,900. Our ability to continue to generate net income and positive cash flows from operations is dependent on our ability to continue to generate revenue from our legacy GO-Global business, which in turn is subject to a variety of risks. The Company believes its current cash balances coupled with anticipated cash flow from operating activities will be sufficient to meet its working capital requirements for at least one year from the date of the issuance of the accompanying financial statements. The Company continues to control its cash expenses as a percentage of expected revenue on an annual basis and thus may use its cash balances in the short-term to invest in revenue growth. Based on current internal projections, the Company believes it has and/or will generate sufficient cash for its operational needs, for at least one year from the date of issuance of the accompanying financial statements. Management is focused on growing the Company’s existing product offering, as well as its customer base, to increase its revenues. The Company cannot give assurance that it can increase its cash balances or limit its cash consumption and thus maintain sufficient cash balances for its planned operations or future acquisitions. Future business demands may lead to cash utilization at levels greater than recently experienced. The Company may need to raise additional capital in the future. However, the Company cannot assure that it will be able to raise additional capital on acceptable terms, or at all.\nRevenue Recognition\nThe Company markets and licenses its products indirectly through channel distributors, value-added resellers, independent software vendors (“ISVs”), hosting service providers, corporate enterprises, governmental and educational institutions and others. Our product licenses are perpetual. We also separately sell intellectual property licenses, maintenance contracts, which are comprised of license updates and customer service access, as well as other products and services.\nThere are no rights of return granted to purchasers of the Company’s software products.\nThe Company recognizes revenue in accordance with Accounting Standards Codification (“ASC”) 606, “Revenue from Contracts with Customers.” Revenues under ASC 606 are recognized when the promised goods or services are transferred to customers in an amount that reflects the consideration to which the Company expects to be entitled to in exchange for those goods or services.\nFor the years ended December 31, 2020 and 2019, revenue recognition was determined by\n● identifying the contract, or contracts, with a customer;\n● identifying the performance obligations in each contract;\n● determine the transaction price;\n● allocating the transaction price to the performance obligations in each contract; and\n● recognizing revenue when, or as, we satisfy performance obligations by transferring the promised goods or services\nWhen control of the promised products and services are transferred to our customers, we recognize revenue in the amount that reflects the consideration we expect to receive in exchange for these products and services.\nProduct Sales\nAll of our licenses are delivered to the customer electronically. The Company sends the license key to the customer to download the related software from Company portal. We recognize revenue upon delivery of these licenses. For stocking resellers who purchase licenses through inventory stocking orders with the intent to resell to an end-user, revenue is recognized when the resellers’ accounts have been credited, at their discretion, for the number of licenses purchased.\nMaintenance revenue was also recognized from service contracts ratably over the related contract period.\nThe Company operates in one reportable segment. The Company’s product sales by geographic area are presented in Note 6.\nCash and Cash Equivalents\nThe Company considers all highly liquid holdings with maturities of three months or less at the time of purchase to be cash equivalents. The Company had no cash equivalents as of December 31, 2020 or 2019.\nAllowance for Doubtful Accounts\nWe maintain an allowance for doubtful accounts that reflects our best estimate of potentially uncollectible trade receivables. The allowance is based on assessments of the collectability of specific customer accounts and the general aging and size of the accounts receivable. We regularly review the adequacy of our allowance for doubtful accounts by considering such factors as historical experience, credit worthiness, and current economic conditions that may affect a customer’s ability to pay. We specifically reserve for those accounts deemed uncollectible. We also establish, and adjust, a general allowance for doubtful accounts based on our review of the aging and size of our accounts receivable. As of December 31, 2020 and 2019, the allowance for doubtful accounts totaled $5,900 and $7,300, respectively.\nLong-Lived Assets\nLong-lived assets are assessed for possible impairment whenever events or changes in circumstances indicate that the carrying amounts may not be recoverable, whenever we have committed to a plan to dispose of the assets or, at a minimum, annually. Typically, for long-lived assets to be held and used, measurement of an impairment loss is based on the fair value of such assets, with fair value being determined based on appraisals, current market value, comparable sales value, and discounted future cash flows, among other variables, as appropriate. Assets to be held and used (which assets are affected by an impairment loss) are depreciated or amortized at their new carrying amount over their remaining estimated life; assets to be sold or otherwise disposed of are not subject to further depreciation or amortization. No such impairment charge was recorded during the years ended December 31, 2020 or 2019.\nProperty and Equipment\nProperty and equipment are recorded at historical cost and depreciated on a straight-line basis over their estimated useful lives ranging from three to seven years. All of our existing property and equipment are fully depreciated.\nSoftware Development Costs\nUnder the criteria set forth in Financial Accounting Standards Board’s (FASB) Accounting Standards Codification (ASC) 985-20, “Costs of Software to be Sold, Leased or Marketed,” development costs incurred in the research and development of new software products are expensed as incurred until technological feasibility, in the form of a working model, has been established, at which time such costs are capitalized until the product is available for general release to customers. The Company did not capitalize any software development costs during 2020 or 2019. The Company makes ongoing evaluations of the recoverability of its capitalized software projects by comparing the net amount capitalized for each product to the estimated net realizable value of the product. If such evaluations indicate that the unamortized software development costs exceed the net realizable value, the Company writes off the amount by which the unamortized software development costs exceed net realizable value.\nConcentration of Credit Risk\nFinancial instruments, which potentially subject the Company to concentration of credit risk, consist principally of cash and trade receivables. The Company places its cash with high quality financial institutions and, by policy, limits the amount of credit exposure to any one financial institution. As of December 31, 2020, the Company had approximately $4,125,300 of cash with financial institutions in excess of FDIC insurance limits.\nFor the year ended December 31, 2020, we had one reseller that represented more than 14.5% of sales and one reseller that represented 44.7% of accounts receivable. For the year ended December 31, 2019, we had two resellers that represented 14.0% and 14.3% of sales, respectively and one reseller that represented 17.9% of accounts receivable. For the purposes of this description, “sales” refers to the dollar value of orders received from these customers and partners in the period indicated. The sales values do not necessarily equal recognized revenue for these periods due to our revenue recognition policies which require deferral of revenue associated with prepaid software service fees. The loss of one of these resellers would not have a material impact as the Company could take over the end customer relationship.\nIncome Taxes\nThe Company accounts for income taxes in accordance with ASC 740, “Income Taxes,” using the asset and liability method. Under this method, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of assets and liabilities and their respective tax bases. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment.\nBasic and Diluted Earnings Per Share\nIn accordance with ASC 260, “Earnings Per Share,” the basic income (loss) per common share is computed by dividing the net income (loss) available to common stockholders by the weighted average common shares outstanding during the period. Diluted income (loss) per share reflect per share amounts that would have resulted if diluted potential common stock had been converted to common stock. Dilutive common share equivalents as of December 31, 2020 and 2019, representing 248,216 and 481,335 outstanding in-the-money warrants respectively, were included in the computation of diluted net income (loss) per share using the Treasury Stock Method. During the year ended December 31, 2020 and 2019, the Company had total common stock equivalents of 93,076 and 106,077 shares, respectively, which excluded from the computation of net income per share because they are anti-dilutive.\nStock-Based Compensation\nThe Company applies the fair value recognition provisions of FASB ASC 718-10, “Compensation - Stock Compensation.”\nFair Value of Financial Instruments\nThe Company’s financial instruments consist of cash and cash equivalents, accounts receivable, accounts payable, and accrued expenses. The carrying amount of these financial instruments approximates fair value due to the nature of the accounts and their short-term maturities.\nThe fair value of the Company’s warrants are determined in accordance with FASB ASC 820, “Fair Value Measurement,” which establishes a fair value hierarchy that prioritizes the assumptions (inputs) to valuation techniques used to price assets or liabilities that are measured at fair value. The hierarchy, as defined below, gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities and the lowest priority to unobservable inputs. The guidance for fair value measurements requires that assets and liabilities measured at fair value be classified and disclosed in one of the following categories:\n● Level 1: Defined as observable inputs, such as quoted (unadjusted) prices in active markets for identical assets or liabilities.\n● Level 2: Defined as observable inputs other than quoted prices included in Level 1. This includes quoted prices for similar assets or liabilities in active markets, quoted prices for identical or similar assets and liabilities in markets that are not active, or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities.\n● Level 3: Defined as unobservable inputs to the valuation methodology that are supported by little or no market activity and that are significant to the measurement of the fair value of the assets or liabilities. Level 3 assets and liabilities include those whose fair value measurements are determined using pricing models, discounted cash flow methodologies or similar valuation techniques, as well as significant management judgment or estimation.\nWe do not have level 2 and 3 liabilities or assets.\n3. Accrued Expenses\nAccrued expenses as of December 31, 2020 and 2019 consisted of the following:\nConsulting services $ 6,200 $ 2,000\nBoard of director fees 46,000 85,600\nLegal fees 3,100 6,400\nReimbursements 20,300 -\nOther 6,400 12,000\n$ 82,000 $ 106,000\n4. Stockholders’ Equity\nStock-Based Compensation Plans\nIn November 2012, the Company’s 2012 Equity Incentive Plan (the “12 Plan”) was approved by the stockholders. Pursuant to the terms of the 12 Plan, stock options, stock appreciation rights, restricted stock and restricted stock units (sometimes referred to individually or collectively as “awards”) may be granted to officers and other employees, non-employee directors and independent consultants and advisors who render services to the Company. The Company is authorized to issue options to purchase up to 643,797 shares of common stock, stock appreciation rights, or restricted stock in accordance with the terms of the 12 Plan.\nIn the case of a restricted stock award, the entire number of shares subject to such award would be issued at the time of the grant and subject to vesting provisions based on time or other conditions specified by the Board or an authorized committee of the Board. For awards based on time, should the grantee’s service to the Company end before full vesting occurred, all unvested shares would be forfeited and returned to the Company. In the case of awards granted with vesting provisions based on specific performance conditions, if those conditions were not met, then all shares would be forfeited and returned to the Company. Until forfeited, all shares issued under a restricted stock award would be considered outstanding for dividend, voting and other purposes.\nUnder the 12 Plan, the exercise price of non-qualified stock options granted is to be no less than 100% of the fair market value of the Company’s common stock on the date the option is granted. The exercise price of incentive stock options granted is to be no less than 100% of the fair market value of the Company’s common stock on the date the option is granted provided, however, that if the recipient of the incentive stock option owns greater than 10% of the voting power of all shares of the Company’s capital stock then the exercise price will be no less than 110% of the fair market value of the Company’s common stock on the date the option is granted. The purchase price of the restricted stock issued under the 12 Plan shall also not be less than 100% of the fair market value of the Company’s common stock on the date the restricted stock is granted.\nAll options granted under the 12 Plan are immediately exercisable by the optionee; however, there is a vesting period for the options. The options (and the shares of common stock issuable upon exercise of such options) vest, ratably, over a 33-month period; however, no options (and the underlying shares of common stock) vest until after three months from the date of the option grant. The exercise price is immediately due upon exercise of the option. The maximum term of options issued under the 12 Plan is ten years. Shares issued upon exercise of options are subject to the Company’s repurchase, which right lapses as the shares vest. The 12 Plan will terminate no later than November 7, 2022. As of December 31, 2020, 411,593 shares of common stock remained available for issuance under the 12 Plan.\nThe following table summarizes the stock option activity for the year ended December 31, 2020 and 2019.\nWeighted-\nAverage\nWeighted- Remaining\nAverage Contractual\nExercise Life\nOptions Price (Years)\nOutstanding at December 31, 2018 117,675 $ 2.57 2.28\nGranted -\nForfeited/cancelled (11,598 )\nOutstanding at December 31, 2019 106,077 $ 2.77 1.53\nGranted -\nForfeited/cancelled (13,001 )\nExercised -\nOutstanding at December 31, 2020 93,076 $ 3.03 0.74\nVested and expected to vest at December 31, 2020 93,076 $ 3.03 0.74\nExercisable at December 31, 2020 93,076 $ 3.03 0.74\nThe following table summarizes information about stock options outstanding and exercisable as of December 31, 2020.\nOptions Outstanding Options Exercisable\nWeighted-\nWeighted-\nRange of\nAverage Average\nAverage\nExercise Number Remaining Exercise Number Exercise\nPrice of Shares Life (Years) Price of Shares Price\n$ 0.75 - 1.00 14,526 0.03 $ 0.75 14,526 $ 0.75\n1.79 - 4.00 63,684 0.87 3.21 63,684 3.21\n4.20 - 6.68 14,866 0.89 4.46 14,866 4.46\n93,076\n93,076\nWarrants\nDuring the year ended December 31, 2020, the Company issued 233,119 shares of common stock for the exercise of 233,119 warrants. During the year ended December 31, 2019, the Company issued 30,466 shares of common stock for the exercise of 30,466 warrants. As of December 31, 2020, and 2019, the Company had 248,216 and 481,335 warrants outstanding, respectively. The warrants outstanding at December 31, 2020 are all exercisable at $0.01 and have an expiration date of May 20, 2023.\nRights Offering\nSee Note 8.\nThe following summarized changes in the number of warrants outstanding for the year ended December 31, 2020 and 2019.\nWarrants\nOutstanding at December 31, 2018 622,912\nGranted -\nForfeited/cancelled (111,111 )\nExercised (30,466 )\nOutstanding at December 31, 2019 481,335\nExercised (233,119 )\nOutstanding at December 31, 2020 248,216\n5. Sales by Geographical Location\nRevenue by country for the year ended December 31, 2020 and 2019 was as follows.\nFor the Year Ended\nDecember 31, 2020 December 31, 2019\nRevenue by Country\nUnited States $ 1,276,700 $ 1,133,400\nBrazil 1,117,300 580,800\nJapan 338,300 410,000\nThe Netherlands 307,700 445,100\nOther Countries 604,000 960,800\nTotal $ 3,644,000 $ 3,530,100\n6. Income Taxes\nThe components of the provision (benefit) for income taxes for the years ended December 31, 2020 and 2019 consisted of the following:\nCurrent\nFederal $ - $ -\nState - -\nForeign - -\n$ - $ -\nDeferred\nFederal $ - $ -\nState - -\nForeign - -\n- -\nTotal $ - $ -\nThe following table summarizes the differences between income tax expense and the amount computed applying the federal income tax rate of 21% for the years ended December 31, 2020 and 2019, respectively:\nFederal income tax (benefit) at statutory rate $ 145,700 $ 116,400\nState income tax (benefit) at statutory rate 16,400 13,900\nSBC - NQ cancellations (2,700 ) (2,700 )\nChange in valuation allowance (2,763,100 ) (284,900 )\nMeals and entertainment (50%) 1,000\nAdjustments and NOL expirations 2,603,500 103,400\nContributed services - 52,900\nOther items - -\nProvision (benefit) for income tax $ - $ -\nDeferred income taxes and benefits result from temporary timing differences in the recognition of certain expense and income items for tax and financial reporting purposes. The following table sets forth those differences as of December 31, 2020 and 2019:\nNet operating loss carryforwards $ 11,031,900 $ 13,702,300\nTax credit carryforwards 977,500 977,500\nCompensation expense - non-qualified stock options 65,800 69,000\nDeferred revenue and maintenance service contracts 343,100 419,800\nDepreciation, amortization, and capitalized software - -\nReserves and other 53,300 58,200\nTotal deferred tax assets 12,471,600 15,226,800\nDeferred tax liability - depreciation, amortization and capitalized software - -\nNet deferred tax asset 12,471,600 15,226,800\nValuation allowance (12,471,600 ) (15,226,800 )\nNet deferred tax asset $ - $ -\nFor financial reporting purposes, with the exception of the years ended December 31, 2020 and 2019, the Company has incurred a loss in each year since inception. Based on the available objective evidence, management believes it is more likely than not that the net deferred tax assets will not be fully realizable. Accordingly, the Company has provided a full valuation allowance against its net deferred tax assets at December 31, 2020 and 2019. The net change in the valuation allowance was decreased by $2,755,000 and $276,000 for the years ended December 31, 2020 and 2019, respectively.\nAt December 31, 2020, the Company had approximately $50.3 million of federal net operating loss carryforwards and approximately $6.8 million of California state net operating loss carryforwards available to reduce future taxable income. The federal loss carryforwards began to expire in 2021 and the California state loss carry forwards begin to expire in 2028. Under the Tax Reform Act of 1986, the amount of benefits from net operating loss carryforwards may be impaired or limited if the Company incurs a cumulative ownership change of more than 50%, as defined, over a three-year period.\nAt December 31, 2020, the Company had approximately $1.0 million of federal research and development tax credits that began to expire in 2018.\n7. Commitments and Contingencies\nLeases\nOur headquarters in Concord, NH is a month-to-month rent basis, requiring a six-month notice from the lessor to terminate. Rent on the corporate headquarters continues at $4,000 per month. Rent expense aggregated approximately $48,000 for both years ended December 31, 2020 and 2019.\nContingencies\nUnder its Amended and Restated Certificate of Incorporation and Second Amended and Restated Bylaws and certain agreements with officers and directors, the Company has agreed to indemnify its officers and directors for certain events or occurrences arising as a result of the officer’s or director’s serving in such capacity. Generally, the term of the indemnification period is for the officer’s or director’s lifetime. The maximum potential amount of future payments the Company could be required to make under these indemnification agreements is limited as the Company currently has a directors and officers liability insurance policy that limits its exposure and enables it to recover a portion of any future amounts paid. The Company believes the estimated fair value of these indemnification agreements is minimal and has no liabilities recorded for these agreements as of December 31, 2020.\nThe Company enters into indemnification provisions under (i) its agreements with other companies in its ordinary course of business, including contractors and customers and (ii) its agreements with investors. Under these provisions, the Company generally indemnifies and holds harmless the indemnified party for losses suffered or incurred by the indemnified party as a result of the Company’s activities or, in some cases, as a result of the indemnified party’s activities under the agreement. These indemnification provisions often include indemnifications relating to representations made by the Company with regard to intellectual property rights, and often survive termination of the underlying agreement. The maximum potential amount of future payments the Company could be required to make under these indemnification provisions is unlimited. The Company has not incurred material costs to defend lawsuits or settle claims related to these indemnification agreements. As a result, the Company believes the estimated fair value of these agreements is minimal. Accordingly, the Company has no liabilities recorded for these agreements as of December 31, 2020.\nThe Company’s software license agreements also generally include a performance guarantee that the Company’s software products will operate substantially as described in the applicable program documentation for a period of 90 days after delivery. The Company also generally warrants that services that the Company performs will be provided in a manner consistent with reasonably applicable industry standards. To date, the Company has not incurred any material costs associated with these warranties and has no liabilities recorded for these agreements as of December 31, 2020.\nProfit Sharing Plans\nThe Company has adopted a 401(k) plan to provide retirement benefits for employees under which the Company makes discretionary matching contributions. During the years ended December 31, 2020 and 2019, the Company contributed a total of $16,000 and $14,100, respectively.\n8. Related Party Transactions\nOn September 30, 2020, the Company entered into an executive employment agreement with Jonathon R. Skeels, the Company’s Chief Executive Officer and Interim Chief Financial Officer, effective as of July 1, 2020.\nPursuant to the Agreement, Mr. Skeels is entitled to receive a base salary of $200,000 per year and other compensation to be determined from time to time by the Company in its sole discretion. The Agreement also entitles Mr. Skeels to participate in the Company’s employee benefit plans and be reimbursed for expenses incurred in connection with his service to the Company. If Mr. Skeels’ employment is terminated without cause (as defined in the Agreement) the Company will, against the receipt of a mutual release, pay Mr. Skeels an amount equal to 12 months of his annual base salary and pay the premiums for continuation of Mr. Skeels and his family’s health insurance for up to 12 months following his termination.\nMr. Skeels has served as the Company’s Chief Executive Officer and Interim Chief Financial Officer since September 2018, however, previously did not receive a salary or other forms of compensation. During the years ended December 31, 2020 and 2019, the Company recorded an expense and contributed capital of approximately $112,400, and $225,100, respectively for contributed services based on the estimated market rate for these services.\nMr. Skeels controls an entity named Novelty Capital Partners LP that is a significant shareholder in the Company. On January 31, 2020, we entered into the Backstop Agreement (the “Backstop Agreement”) with a consortium of accredited investors, including all of our directors and led by Novelty Capital Partners LP, pursuant to which such investors agreed to purchase in a private placement, at $0.30 per share, up to 2.41 million of shares of our common stock. The consummation of the investment pursuant to the Backstop Agreement was conditioned on the closing of our subscription rights offering to all of our stockholders (the “Rights Offering”). The Rights Offering expired on March 31, 2020, and we consummated the Backstop Agreement transactions on August 13, 2020.\nAt closing of the Rights Offering, we received net proceeds of $480,200 in exchange for 1.6 million shares of common stock. Pursuant to the Backstop Agreement, we received gross proceeds of $2.12 million in exchange for the issuance of 7.0 million restricted shares of common stock.",
    "item_9": "Item 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.",
    "item_9A": "Item 9A. CONTROLS AND PROCEDURES\nWe maintain disclosure controls and procedures that are designed to ensure that information required to be disclosed in the reports that we file under the Securities Exchange Act of 1934 (the “Exchange Act”) is recorded, processed, summarized and reported within the time periods specified in the Security and Exchange Commission’s rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and Interim Chief Financial Officer (Principal Financial Officer), as appropriate, to allow for timely decisions regarding required disclosures. In designing and evaluating the disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can only provide reasonable assurance of achieving the desired control objectives, and management is required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures.\nUnder the supervision and with the participation of our management, including our Chief Executive Officer and Interim Chief Financial Officer, we evaluated the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rule 13a-15(e) under the Exchange Act) as of the end of the period covered by this report. Based upon that evaluation, our Chief Executive Officer and Interim Chief Financial Officer concluded that our disclosure controls and procedures were effective as of December 31, 2020.\nChanges in Internal Control Over Financial Reporting\nThere has not been any change in our internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act) during the quarter ended December 31, 2020 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nManagement’s Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rules 13a-15(f) under the Exchange Act as a process designed by, or under the supervision of, our Chief Executive Officer and Interim Chief Financial Officer and effected by our Board of Directors, management and other personnel to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States and includes those policies and procedures that:\n● pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of our assets; and\n● provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with accounting principles generally accepted in the United States, and our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and\n● provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material impact on the financial statements.\nBecause of inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risks that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. Our evaluation of internal control over financial reporting includes using the criteria in Internal Control-Integrated Framework (2013), an integrated framework issued by the Committee of Sponsoring Organizations of the Treadway Commission, for the evaluation of internal control to identify the risks and control objectives related to the evaluation of our control environment.\nBased on our evaluation under the framework described above, our management has concluded that our internal control over financial reporting was effective as of December 31, 2020.\nThis Annual Report does not include an attestation report of our independent registered public accounting firm regarding internal control over financial reporting. Our management’s report was not subject to attestation by our independent registered public accounting firm pursuant to rules of the Securities and Exchange Commission that permit us to provide only management’s report in this Annual Report.",
    "item_9B": "Item 9B. Other Information\nNot applicable.\nPART III",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nThe information required by this item is incorporated by reference to hopTo’s Proxy Statement for its 2021 Annual Meeting of Stockholders to be filed with the SEC within 120 days after the end of the fiscal year ended December 31, 2020.\nhopTo has adopted a Code of Ethics that applies to all its employees, including its Chief Executive Officer and its Chief Financial Officer. hopTo will provide a copy of its Code of Ethics to any person without charge upon written request to:\nhopTo, Inc..\nLoudon Road, Suite 200\nConcord, NH 03301\nAttn: Chief Executive Officer",
    "item_11": "Item 11. Executive Compensation\nThe information required by this item is incorporated by reference to hopTo’s Proxy Statement for its 2021 Annual Meeting of Stockholders to be filed with the SEC within 120 days after the end of the fiscal year ended December 31, 2020.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this item is incorporated by reference to hopTo’s Proxy Statement for its 2021 Annual Meeting of Stockholders to be filed with the SEC within 120 days after the end of the fiscal year ended December 31, 2020.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by this item is incorporated by reference to hopTo’s Proxy Statement for its 2021 Annual Meeting of Stockholders to be filed with the SEC within 120 days after the end of the fiscal year ended December 31, 2020.",
    "item_14": "Item 14. Principal Accountant Fees and Services.\nThe information required by this item is incorporated by reference to hopTo’s Proxy Statement for its 2021 Annual Meeting of Stockholders to be filed with the SEC within 120 days after the end of the fiscal year ended December 31, 2020.\nPART IV",
    "item_15": "Item 15. Exhibits, Financial Statement Schedules\n(a) Financial Statements\nOur financial statements as set forth in the Index to Consolidated Financial Statements under Part II, Item 8 of this Annual Report on Form 10-K are hereby incorporated by reference.\n(b) Exhibits\nThe following exhibits, which are numbered in accordance with Item 601 of Regulation S-K, are filed as part of this Annual Report on Form 10-K or, as noted, incorporated by reference herein:\nExhibit\nNumber\nExhibit Description\n3.1\nAmended and Restated Certificate of Incorporation of Registrant, as amended (1)\n3.2\nCertificate of Amendment of Amended and Restated Certificate of Incorporation of GraphOn Corporation (19)\n3.3\nCertificate of Amendment of Amended and Restated Certificate of Incorporation of hopTo Inc. (28)\n3.4\nCertificate of Designation of Series A Junior Participating Preferred Stock of hopTo Inc. (31)\n3.5\nSecond Amended and Restated Bylaws of Registrant (2)\n4.1\nForm of certificate evidencing shares of common stock of Registrant (3)\n4.2\nForm of Warrant issued on September 1, 2011 (4)\n4.3\nWarrant to Purchase Common Stock, dated October 11, 2011 (5)\n4.4\nExercise Agreement, dated June 17, 2013 (including Allonge to 2011 warrants) (20)\n4.5\nForm of New Warrant issued on June 17, 2013 (20)\n4.6\nRegistration Rights Agreement, dated June 17, 2013 (20)\n4.7\nForm of Warrant issued on January 7, 2014 (21)\n4.8\nRegistration Rights Agreement, dated January 7, 2014 (21)\n4.9\nRights Agreement, dated as of February 16, 2018, by and between hopTo Inc. and American Stock Transfer & Trust Company, LLC, as rights agent (31)\n4.10\nDescription of the Capital Stock\n10.1*\nRestricted Stock Agreement (1 of 2) with Eldad Eilam dated August 15, 2012 (15)\n10.2*\nRestricted Stock Agreement (2 of 2) with Eldad Eilam dated August 15, 2012 (15)\n10.3*\nRestricted Stock Agreement with Christoph Berlin dated August 15, 2012 (15)\n10.4*\nRestricted Stock Agreement with Robert Dixon dated August 15, 2012 (15)\n10.5\nSeparation Agreement, dated April 12, 2012, between Registrant and Robert Dilworth (14)\n10.6\nRelease, dated April 12, 2012, between Registrant and Robert Dilworth (14)\n10.7\n1998 Stock Option/Stock Issuance Plan of Registrant (7)\n10.8\nSupplemental Stock Option Agreement, dated as of June 23, 2000 (7)\n10.9\n2005 Equity Incentive Plan (8)\n10.10\n2008 Equity Incentive Plan, as Amended (9)\n10.11*\nEmployment Agreement, dated August 21, 2013, by and between Registrant and Eldad Eilam (16)\n10.12*\nDirector Severance Plan (11)\n10.13*\nKey Employee Severance Plan (11)\n10.14\nSecurities Purchase Agreement, dated September 1, 2011 (4)\n10.15\nForm of Registration Rights Agreement, dated September 1, 2011 (4)\n10.16(a)*\nEngagement Agreement, dated October 11, 2011, by and between Registrant and ipCapital Group, Inc. (5)\n10.16(b)*\nFirst Addendum to the Engagement Agreement by and between Registrant and ipCapital Group, Inc., dated as of November 7, 2011 (12)\n10.16(c)*\nSecond Addendum to the Engagement Agreement by and between Registrant and ipCapital Group, Inc., dated as of November 14, 2011 (12)\n10.16(d)*\nThird Addendum to the Engagement Agreement by and between Registrant and ipCapital Group, Inc., dated as of January 20, 2012 (13)\n10.17\nFirst Amendment to Office Lease between Registrant and CA-Pruneyard Limited Partnership, dated as of October 7, 2013 (27)\n10.18\nConsulting Agreement, dated February 1, 2012, by and between Registrant and Steven Ledger/Tamalpais Partners LLC (22)\n10.19\nAmendment to Consulting Agreement, by and between Registrant and Steven Ledger/Tamalpais Partners, LLC, dated August 1, 2013 (16)\n10.20\nIntellectual Property Brokerage Agreement by and between Registrant and ipCapital Licensing Company I, LLC, dated as of February 4, 2013 (17)\n10.21*\nConsulting Agreement, dated March 29, 2013, by and between Registrant and Gordon Watson (23)\n10.22*\nConsulting Agreement, dated November 18, 2013, by and between Registrant and ipCreate, Inc. (24)\n10.23\nSecurities Purchase Agreement, dated January 7, 2014 (21)\n10.24*\nConsulting Agreement, dated March 17, 2014, by and between Registrant and Steven Ledger (25)\n10.25\nSeparation Agreement, dated March 12, 2014, by and between Registrant and Christoph Berlin (25)\n10.26\nEmployment Letter dated April 30, 2014 and executed May 5, 2014 between Registrant and Jean-Louis Casabonne (26)\n10.27\nSublease dated August 11, 2015, by and between Registrant and CDNetworks (32)\n10.28\nSecurities Purchase Agreement, dated as of July 24, 2015 (29)\n10.29\nRegistration Rights Agreement, dated as of July 28, 2015 (29)\n10.30\nLease Agreement effective October 1, 2015 between the Registrant and Heritage Village Offices (30)\n10.31\nPatent Purchase Agreement dated October 10, 2017 (33)\n14.1\nCode of Ethics (6)\n21.1\nSubsidiaries of Registrant\nCertification pursuant to Rule 13a-14(a) and Rule 15d-14(a) of the Securities Exchange Act, as amended.\nCertification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002. (furnished, not filed)\nThe following financial information from Registrant’s Annual Report on Form 10-K for the year ended December 31, 2018, formatted in eXtensible Business Reporting Language (XBRL): (i) Consolidated Balance Sheets as of December 31, 2018 and 2017, (ii) Consolidated Statements of Operations for the years ended December 31, 2018 and 2017, (iii) Consolidated Statements of Shareholders’ Equity (Deficit) for the years ended December 31, 2018 and 2017, (iv) Consolidated Statements of Cash Flows for the years ended December 31, 2018 and 2017, (v) Notes to Consolidated Financial Statements (18)\n*Management or compensatory plan or arrangement\n(1) Filed on April 2, 2007 as an exhibit to Registrant’s Annual Report on Form 10-KSB for the year ended December 31, 2006, and incorporated herein by reference. (File number 000-21683)\n(2) Filed on March 31, 2010 as an exhibit to the Registrant’s Annual Report on Form 10-K for the year ended December 31, 2009, and incorporated herein by reference. (File number 000-21683)\n(3) Filed on September 19, 1996 as an exhibit to the Registrant’s Registration Statement on Form S-1 and incorporated herein by reference. (File No. 333-11165)\n,\n(4) Filed on September 8, 2011 as an exhibit to Registrant’s Current Report on Form 8-K and incorporated herein by reference. (File number 000-21683)\n(5) Filed on October 13, 2011 as an exhibit to Registrant’s Current Report on Form 8-K and incorporated herein by reference. (File number 000-21683)\n(6) Filed on March 30, 2004 as an exhibit to the Registrant’s Annual Report on Form 10-K for the year ended December 31, 2003, and incorporated herein by reference. (File number 000-21683)\n(7) Filed on June 23, 2000 as an exhibit to the Registrant’s Registration Statement on Form S-8, and incorporated herein by reference. (File number 333-40174)\n(8) Filed on November 25, 2005 as an exhibit to the Registrant’s definitive Proxy Statement for the Registrant’s 2005 Annual Meeting, and incorporated herein by reference. (File number 000-21683)\n(9) Filed on September 29, 2011 as an exhibit to the Registrant’s Registration Statement on Form S-8 and incorporated herein by reference. (File No. 333-177069)\n(10) Reserved.\n(11) Filed on November 14, 2011 as an exhibit to the Registrant’s Quarterly Report on Form 10-Q for the quarterly period ended September 30, 2011, and incorporated herein by reference. (File number 000-21683)\n(12) Filed on November 23, 2011 as an exhibit to Amendment No. 1 to the Registrant’s Registration Statement on Form S-1, and incorporated herein by reference. (File number 333-177073)\n(13) Filed on February 14, 2012 as an exhibit to the Registrant’s Current Report on Form 8-K and incorporated herein by reference. (File number 000-21683)\n(14) Filed on May 21, 2012 as an exhibit to the Registrant’s Quarterly Report on Form 10-Q for the quarterly period ended March 31, 2012, and incorporated herein by reference. (File number 000-21683)\n(15) Filed on November 14, 2012 as an exhibit to the Registrant’s Quarterly Report on Form 10-Q for the quarterly reporting period ended September 30, 2012, and incorporated herein by reference. (File number 000-21683)\n(16) Filed on August 27, 2013 as an exhibit to the Registrant’s Current Report on Form 8-K, dated August 21, 2013, and incorporated herein by reference. (File number 000-21683)\n(17) Filed on February 19, 2013 as an exhibit to the Registrant’s Current Report on Form 8-K, and incorporated herein by reference. (File number 000-21683)\n(18) Submitted electronically with the original Form 10-K.\n(19) Filed on September 10, 2013 as an exhibit to the Registrant’s Current Report on Form 8-K, dated September 9, 2013, and incorporated herein by reference. (File number 000-21683)\n(20) Filed on June 24, 2013 as an exhibit to the Registrant’s Current Report on Form 8-K, dated June 17, 2013, and incorporated herein by reference. (File number 000-21683)\n(21) Filed on January 13, 2014 as an exhibit to the Registrant’s Current Report on Form 8-K, dated January 7, 2014, and incorporated herein by reference. (File number 000-21683)\n(22) Filed on April 16, 2012 as an exhibit to the Registrant’s Annual Report on Form 10-K for the year ended December 31, 2011, and incorporated herein by reference. (File number 000-21683)\n(23) Filed on April 3, 2013 as an exhibit to the Registrant’s Current Report on Form 8-K, dated March 29, 2013, and incorporated herein by reference. (File number 000-21683)\n(24) Filed on December 12, 2013 as an exhibit to the Registrant’s Current Report on Form 8-K, dated December 11, 2013, and incorporated herein by reference. (File number 000-21683)\n(25) Filed on March 18, 2014 as an exhibit to the Registrant’s Current Report on Form 8-K, dated March 12, 2014, and incorporated herein by reference. (File number 000-21683)\n(26) Filed on May 12, 2014 as an exhibit to the Registrant’s Current Report on Form 8-K, dated March 9, 2014, and incorporated herein by reference. (File number 000-21683)\n(27) Filed on March 31, 2014 as an exhibit to the Registrant’s Annual Report on Form 10-K for the year ended December 31, 2013, and incorporated herein by reference. (File number 000-21683)\n(28) Filed on February 1, 2016 as an exhibit to the Registrant’s Current Report on Form 8-K, dated January 27, 2016, and incorporated herein by reference. (File number 000-21683)\n(29) Filed on July 30, 2015 as an exhibit to the Registrant’s Current Report on Form 8-K, dated July 24, 2015, and incorporated herein by reference. (File number 000-21683)\n(30)\nFiled on September 10, 2015 as an exhibit to the Registrant’s Registration Statement on Form S-1 and incorporated herein by reference. (File No. 333-206861)\n(31) Filed on February 16, 2018 as an exhibit to the Registrant’s Current Report on Form 8-K, dated February 16, 2018 and incorporated herein by reference. (File number 000-21683)\n(32) Filed on March 30, 2016 as an exhibit to the Registrant’s Annual Report on Form 10-K for the year ended December 31, 2015 and incorporated herein by reference. (File number 000-21683)\n(33) Filed on April 1, 2019 as an exhibit to the Registrant’s Annual Report on Form 10-K for the year ended December 31, 2018 and incorporated herein by reference. (File number 000-21683)\n(c) Financial Statement Schedule\nNot applicable for smaller reporting companies.\nITEM 16. FORM 10-K SUMMARY.\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nhopTo Inc.\nMarch 31, 2021 By: /s/ Jonathon R. Skeels\nJonathon R. Skeels\nChief Executive Officer, Interim Chief Financial Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Jonathon R. Skeels\nChief Executive Officer, Interim Chief Financial Officer\nMarch 31, 2021\nJonathon R. Skeels\n(Principal Executive Officer, Principal Financial Officer and Principal Accounting Officer)\n/s/ Jean-Louis Casabonne\nDirector\nMarch 31, 2021\nJean-Louis Casabonne\n/s/ Richard S. Chernicoff\nDirector\nMarch 31, 2021\nRichard S. Chernicoff\n/s/ Thomas C. Stewart\nDirector\nMarch 31, 2021\nThomas C. Steward"
}