{
    "cik": "1022505",
    "company": "CIPHERLOC Corp",
    "filing_type": "10-K",
    "filing_date": "2021-12-21",
    "period_of_report": "2021-09-30",
    "sic": "7374",
    "state_of_inc": "TX",
    "state_location": "TX",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1022505/0001493152-21-032215-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1022505/000149315221032215/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1022505/0001493152-21-032215.txt",
    "filename": "1022505_10K_2021_0001493152-21-032215.htm",
    "item_1": "ITEM 1. BUSINESS\nOverview\nWe are developing products and services around our patented polymorphic encryption technology, which is designed to enable secure and private data transmission. Through our licensing program, we are offering what we believe to be the first secure, commercially viable, advanced Polymorphic Encryption Core, or PEC, data-in-motion product that can be used in virtually any commercial data security industry or in sensitive application. We believe that our PEC data-in-motion product allows our customers to securely send data, with little setup time required.\nBeginning in 2019, we retained an entirely new management team. Our current management restructured our business to focus our resources on only products and services that we believe are deliverable, have viable economic potential, and may be publicly disclosed without adversely affecting our competitive position. The core of our product and service offerings will continue to be built around our patents and encryption technology. We believe that our Cipherloc Polymorphic Encryption Engine Core technology is a highly secure data protection technology, which has received a validation certificate from the National Institute of Standards and Technology (NIST).\nPrior to September 30, 2021, we were a Texas corporation. We are now a Delaware corporation. Our headquarters is located at 6836 Bee Cave Road, Building 1, Suite 279, Austin, TX 78746.\nThe transition to becoming a Delaware corporation was approved by our shareholders at our 2021 annual meeting that was held on September 13, 2021. In addition to the reincorporation in Delaware, our shareholders approved other governance actions designed to reduce risk and accelerate our growth were approved by the shareholders. Other actions by our shareholders at the annual meeting included:\n● Election of Anthony Ambrose, Sammy Davis, David Chasteen and Tom Wilkinson to our board of directors;\n● Ratification of the appointment of Briggs & Veselka Co. as our independent auditor;\n● Approval and adoption of our 2021 Omnibus Equity Incentive Plan;\n● Granting discretionary authority to our board of directors to combine the outstanding shares of our common stock into a lesser number of outstanding shares in a reverse stock split, with the exact ratio to be determined by our board of directors, within a range of 1-for-2 to a maximum of 1-for-20;\n● Approval an amendment to our Amended and Restated Articles of Incorporation to eliminate the statutory preemptive rights pursuant to Section 21.208 of the Texas Business Organizations Code in the event that the reincorporation from the State of Texas to the State of Delaware is not consummated;\n● Approval, by non-binding advisory vote, of a resolution approving named executive officer compensation; and\n● Approval, by non-binding advisory vote, of future non-binding advisory votes regarding future named executive officer compensation to occur every three years.\nRecent Transaction\nBetween March 31, 2021 and April 16, 2021, we entered into a securities purchase agreement with certain accredited investors, pursuant to which we sold an aggregate of 55,549,615 shares of our common stock, and warrants to purchase an equal number shares of our common stock, for $0.18 per share of common stock sold, in a private placement. The price of $0.18 per share was equal to 80% of the closing sales price of our common stock on the OTCQB Market on March 30, 2021. The warrants issued with the shares of common stock have an exercise price of $0.36 per share, and may be exercised at any time prior to March 31, 2026. The warrants have anti-dilution protection that applies if we issue shares of our common stock at less than the $0.36 per share exercise price of the warrants.\nWe received approximately $10 million in gross proceeds from the sale of the shares and warrants. In connection with the private placement, we agreed to use the proceeds for working capital, and not for (i) debt repayment, other than the payment of trade payables in the ordinary course of our business or the repayment of funds we received under the paycheck protection program of the Cares Act, (ii) redemption of our stock, (iii) settlement of any litigation, or (iv) in violation of the law.\nPaulson Investment Company, LLC acted as the placement agent for the offering. Pursuant to our agreement then, we paid the placement agent a cash commission of $1,334,861, 13% of the gross proceeds we received from the placement, and we granted to the placement agent a ten-year warrant to purchase 8,332,439 shares of our common stock at the price of $0.18 per share.\nOn April 29, 2021, we filed a registration statement on Form S-1 with the SEC, registering the resale of up to 119,431,669 shares of our common stock, representing (i) the shares sold in the private placement referred to above, (i) the shares issuable upon exercise of warrants issued in that private placement, and (iii) the shares issuable upon exercise of warrants issued to the placement agent in the private placement. As a result of the filing of that registration statement, the holders of the registered shares may sell those shares into the market.\nProducts and Services\nWe have focused our development efforts on the commercial application of our technology by advancing a Software Development Kit or SDK, for our solution. We believe that this effort has advanced our technology from theory to commercial application in the form of several products, named Sentinel, Armor, and Shield, which we make available to licensees through our SDK. In the past, we have relied on indirect sales efforts. We are currently developing new products and services designed for direct sales to customers, rather than sales through third parties.\nOur core technology is protected by six patents that expire between 2034 and 2037.\nResearch and Development\nOur research and development expenditures for the fiscal years ended September 30, 2021 and September 30, 2020 were $616,746 and $1,689,455, respectively. During December of 2019, our management determined that the pending maturity of our patented technology justified a cessation of our academic research activities, including the elimination of our chief scientist’s role in leading various academic efforts. We allocated the cost savings from ceasing those activities entirely to product development, product engineering, and revenue-generating sales activities. Our management continued to emphasis these three areas during fiscal year 2021 and intends to continue that emphasis in our fiscal year 2022 and beyond.\nCompetition\nThe encryption software market sector is highly competitive, subject to rapid change, and significantly affected by new product introductions and other activities of market participants.\nSome of our competitors have greater financial, technical, sales, marketing and other resources than we do. Because of these and other factors, competitive conditions in the markets we compete in are likely to continue to intensify in the future. Increased competition could result in price reductions for our products and services, reductions in our net revenue and profit margins and the loss of our market share, any of which would likely harm our business.\nWe believe that our future results depend largely upon our ability to serve our customers better than our competitors, and by offering new product enhancements, whether by internal development or acquisition. We also believe that we must provide product offerings that compete favorably against those of our competitors with respect to ease of use, reliability, performance, range of useful features, reputation and price.\nWe anticipate that we will face increasing pricing pressures from our competitors in the future. Since there are low barriers to entry into the encryption software market, which is subject to rapid technological change, we believe that competition in our market will persist and intensify in the future.\nIntellectual Property\nProtective Measures\nWe believe that our intellectual property is an important and vital asset, which enables us to develop, market, and sell our products and services, and enhance our competitive position. Our intellectual property includes our proprietary business and technical know-how, inventions, works of authorship, and confidential information. To protect our intellectual property, we rely primarily upon legal rights in trade secrets, patents, copyrights, and trademarks, in addition to our policies and procedures, security practices, contracts, and relevant operational measures.\nWe protect the confidentiality of our proprietary information by entering into non-disclosure agreements with our employees, contractors, and other entities with which we do business. In addition, our license agreements related to our software and proprietary information includes confidentiality terms. These agreements are generally non-transferable. We also employ access controls and associated security measures to protect our facilities, equipment, and networks.\nPatents, Copyrights, Trademarks, and Licenses\nOur products, particularly our software and related documentation, are protected under domestic and international copyright laws and other laws related to the protection of intellectual property and proprietary rights. Currently, we have six patents filed with the U.S. Patent and Trademark Office. We employ procedures to label copyrightable works with the appropriate proprietary rights notices, and we actively enforce our rights in the United States and abroad. However, these measures may not provide us with adequate protection from infringement, and our intellectual property rights may be challenged.\nOur Cipherloc logo is a registered trademark with the U.S. Patent and Trademark Office. In the United States, we are generally able to maintain our trademark rights and renew trademark registrations for as long as the trademarks are in use.\nGovernment Regulation\nExport Control Regulations. We expect that all of our products will be subject to U.S. export control laws and applicable foreign government import, export and/or use requirements. The level of such control generally depends on the nature of the products in question. Often, the level of export control is impacted by the nature of the software and encryption incorporated into our products. In those countries where such controls apply, the export of our products may require an export license or authorization. However, even if a transaction qualifies for a license exception or the equivalent, it may still be subject to corresponding reporting requirements. For the export of some of our products, we may be subject to various post-shipment reporting requirements. Minimal U.S. export restrictions apply to all our products, whether or not they perform encryption functions. If we become a Department of Defense contractor in the future, certain registration requirements may be triggered by our sales. In addition, certain of our products and related services may be subject to the International Traffic in Arms Regulations (ITAR) if our software or services are specifically designed or modified for defense purposes. If we become engaged in manufacturing or exporting ITAR-controlled goods and services (even if we do not export such items), we will be required to register with the U.S. State Department.\nEnhancements to our existing products may be subject to review under the Export Administration Act to determine what export classification they will receive. In addition, any new products that we release in the future will also be subject to such review before we can export them. The U.S. Congress continues to discuss t the correct level of export control in possible anti-terrorism legislation. Such export regulations may be modified at any time. Modifications to these export regulations could reduce or eliminate our ability to export some or all of our products from the United States in the future, which could put us at a disadvantage in competing with companies located outside of the U.S. Modifications to U.S. export regulations could restrict us from exporting our existing and future products. Any such modifications to export regulations may put us at a competitive disadvantage with respect to selling our products internationally.\nPrivacy Laws. We may be subject to various international, federal and state regulations regarding the treatment and protection of personally identifying and other regulated information. Applicable laws may include U.S. federal laws and implementing regulations, such as the [GLBA and HIPAA], as well as state and international laws and regulations, including the European Union General Data Protection Regulation (GDPR). Some of these laws have requirements on the transmittal of data from one jurisdiction to another. In the event our systems are compromised, many of these privacy laws require that we provide notices to our customers whose personally identifiable data may have been compromised. Additionally, if we transfer data in violation of these laws, we could be subjected to substantial fines. To mitigate the risk of having such data compromised, we use encryption and other security to protect our databases.\nPersonnel\nAs of the date of this Annual Report on Form 10-K, we have three full-time employees and one part-time employee. We also have four independent contractors that provide services to us. We anticipate that we will need to increase our staffing in the foreseeable future.",
    "item_1A": "ITEM 1A. RISK FACTORS\nOutlined below are some of the risks that we believe could affect our business and financial statements, some of which are beyond our control. An investment in our common stock involves a high degree of risk. You should carefully consider the following information about these risks, together with the other information contained in this Annual Report on Form 10-K, before investing in our common stock. If any of the events anticipated by the risks described below occur, our results of operations and financial condition could be adversely affected, which could result in a decline in the market price of our common stock, causing you to lose all or part of your investment. Additional risks that we do not yet know of, or that we currently think are immaterial, may also affect our business and results of operations.\nRisks Related to Our Financial Position and Need for Capital\nWe have incurred net losses since our inception and may never be profitable.\nOur likelihood of success must be considered in light of the problems, expenses, difficulties, complications and delays frequently encountered in connection with development of a business enterprise in the technology sector. Our net losses for the year ended September 30, 2021 were $3,104,283, and for the year ended September 30, 2020 were $6,970,072, respectively, and our aggregate accumulated deficit as of September 30, 2021 was $71,530,891.\nWe cannot assure you that that any of our products currently under development will be successfully commercialized, and the extent of our future losses and the timing of our profitability, if ever achieved, are highly uncertain. If we are unable to achieve profitability, we may be unable to continue our operations.\nOur ability to continue as a going concern may depend upon our ability to raise additional capital and such capital may not be available on acceptable terms, or at all.\nWe may need to raise additional funds in order to support expansion, develop new or enhanced services and products, hire employees, respond to competitive pressures, acquire technologies or respond to unanticipated requirements, provided that we currently believe that funds from our recent private placement will allow us to support our operations until approximately September of 2023. Our management’s plans include attempting to improve our profitability and our ability to generate sufficient cash flow from operations to meet our operating needs on a timely basis, obtaining additional working capital funds through equity and debt financing arrangements, and restructuring on-going operations to eliminate inefficiencies to increase our cash balances. However, we cannot assure you that these plans and arrangements will be sufficient to fund our ongoing capital expenditures, working capital, and other requirements. Our management intends to make every effort to identify and develop sources of funds. The outcome of these matters cannot be predicted at this time. There can be no assurance that any additional financings will be available to us on satisfactory terms and conditions, if at all. If adequate funds are not available on acceptable terms, we may be unable to develop or enhance our services and products, take advantage of future opportunities or respond to competitive pressures or unanticipated requirements, which could have a material adverse effect on our business, financial condition and operating results. Further, we may seek to raise additional funds through the issuance of equity securities, in which case, the percentage ownership of our stockholders will be reduced, and holders may experience additional dilution in net book value per share.\nThe amount of capital we may need depends on many factors, including the progress, timing and scope of our product development programs; the time and cost necessary to obtain any necessary regulatory approvals; our ability to enter into and maintain collaborative, licensing and other commercial relationships; and our ability to secure commitment of time and resources from third parties to the development and commercialization of our products.\nThe capital markets have been unpredictable in the recent past for unprofitable companies such as ours. The amount of capital that we may be able to raise often depends on variables that are beyond our control. As a result, we may not be able to secure financing on terms attractive to us, or at all. Even if we are able to consummate a financing arrangement, the amount raised may not be sufficient to meet our future needs. If adequate funds are not available on acceptable terms, or at all, our business, including our results of operations, financial condition and our continued viability will be materially adversely affected.\nEven if we can raise additional funding, we may be required to do so on terms that are dilutive to our stockholders.\nFuture issuances of new equity by us may dilute the ownership percentage of our existing stockholders. The extent of such dilution will depend on the number of shares issued. The shares issued in such a transaction will be equal to the total dollars paid to us as an investment divided by the offering price. Neither the amount of funds that may be received in such an equity financing, nor the price per share of our equity securities issued are known at this time.\nWe may need to raise additional funds in order to support expansion, develop new or enhanced services and products, hire employees, respond to competitive pressures, acquire technologies or respond to unanticipated requirements. If such a need should arise, and issuing new equity is the vehicle we use to secure additional funds, then such issuances will likely further dilute the ownership percentages of our existing stockholders.\nRisks Related to Our Business and Results of Operations\nA pandemic, epidemic or outbreak of an infectious disease, such as COVID-19, has materially affected, and may in the future materially and adversely affect, our business and operations.\nOn March 11, 2020, the World Health Organization declared the COVID-19 outbreak a pandemic. The COVID-19 pandemic is affecting the United States and global economies and may affect our operations and those of third parties on which we rely. While the potential economic impact brought by, and the duration of, the COVID-19 pandemic is difficult to assess or predict, the impact of the COVID-19 pandemic on the global financial markets may reduce our ability to access capital, which could negatively impact our short-term and long-term liquidity. The ultimate impact of the COVID-19 pandemic is highly uncertain and subject to change. We do not yet know the full extent of potential delays or impacts of the pandemic on our business, financing or the global economy as a whole. However, these effects could have a material impact on our liquidity, capital resources, operations and business and those of third parties on which we rely.\nDuring 2020 and into 2021, the COVID-19 pandemic has interrupted our sales and marketing activities and restricted face-to-face interaction between our representatives and our potential partners. This slowed the pace of our development and the expansion of our deal pipeline. Government action related to the current pandemic, or the emergence of a new viral outbreak, may negatively impact the adjustments we, our customers (if any), the customers of our licensees, and our other business partners have made to resume business under the new protocols.\nWe depend significantly upon the continued involvement of our present management and on our ability to attract and retain talented employees.\nOur success depends significantly upon the involvement of our present management, who are involved in our strategic planning and operations. We may need to attract and retain additional talented individuals in order to carry out our business objectives. The competition for individuals with expertise in our industry is intense, and there are no assurances that such individuals will be available to us.\nOur business is based on successfully attracting and retaining talented employees and contractors. The market for highly skilled people in our industry is extremely competitive. If we are less successful in our recruiting efforts, or if we are unable to retain key existing employees, our ability to develop and deliver successful products and services may be adversely affected. Effective succession planning is also important to our long-term success. Our failure to ensure effective transfer of knowledge and smooth transitions involving key employees could hinder our strategic planning and execution.\nOur products face significant competition in the applicable markets, and if they are unable to compete successfully our business will suffer.\nOur proposed products face, and will continue to face, intense competition from larger companies, as well as from academic and research institutions. We compete in an industry that is characterized by: (i) rapid technological change, (ii) evolving industry standards, (iii) emerging competition, and (iv) new product introductions. Our competitors have existing products and technologies that will compete with our products and technologies and may develop and commercialize additional products and technologies that will compete with our products and technologies. Because many competing companies and institutions have greater financial resources than us, they may be able to: (i) provide broader services and product lines, (ii) make greater investments in research and development, and (iii) carry on larger research and development initiatives. Our competitors also generally have greater development capabilities than we do and have substantially greater experience in undertaking testing of products, obtaining regulatory approvals, and manufacturing and marketing their products. They also have greater name recognition and better access to customers/licensees than we do. Our chief competitors include companies such as HashiCorp, Inc., Palo Alto Networks, Inc., Barracuda Networks, Inc., Cisco Systems, Inc., and Cloudhesive LLC.\nIf we are unable to develop new and enhanced products, or if we are unable to continually improve the performance, features, and reliability of our existing products, our competitive position may weaken, and our business and operating results could be adversely affected.\nOur future success depends on our ability to effectively respond to evolving threats to consumers and potential customers, as well as competitive technological developments and industry changes, by developing or introducing new and enhanced products on a timely basis. In the past, we have incurred significant research and development expenses. We expect to continue to incur research and development expenses, but at a lower rate, as we strive to remain competitive, and as we focus on organic growth through internal innovation. If we are unable to anticipate or react to competitive challenges or if existing or new competitors gain market share in any of our markets, our competitive position could weaken, and we could experience a decline in our revenues, if any, which could adversely affect our business and operating results. If we do not achieve the benefits anticipated from these investments, or if the achievement of these benefits is delayed, our operating results may be adversely affected. Additionally, we must continually address the challenges of dynamic and accelerating market trends and competitive developments. Customers may require features and capabilities that our current products do not have. Our failure to develop new products and improve our existing products to satisfy customer preferences and effectively compete with other market offerings in a timely and cost-effective manner may harm our ability to retain our customers (if any), and the ability of our licensees to retain their customers, and to create or increase demand for our products, which may adversely impact our operating results. The development and introduction of our new products will involve a significant commitment of time and resources and will be subject to a number of risks and challenges, including but not limited to:\n● Lengthy development cycles;\n● Evolving industry and regulatory standards and technological developments by our competitors and customers (if any), and the customers of our licensees;\n● Rapidly changing customer preferences;\n● Evolving platforms, operating systems, and hardware products, such as mobile devices, and related product and service interoperability challenges;\n● Entering into new or unproven markets; and\n● Executing new product and service strategies.\nIf we are not successful in managing these risks and challenges, or if our new or improved products are not technologically competitive in the market, or do not achieve market acceptance, our business and operating results could be adversely affected.\nOur operating results may vary significantly from period to period and can be unpredictable, which could cause the market price of our common stock to decline.\nOur operating results, in particular, our revenues, gross margins, operating margins, and operating expenses, have historically varied from period to period, and we expect such variation to continue as a result of a number of factors, many of which are outside of our control and may be difficult to predict, including:\n● our ability to attract and retain customers (if any), and/or the ability of our licensees to retain customers or sell products;\n● the budgeting cycles, seasonal buying patterns, and purchasing practices of potential customers;\n● price competition;\n● the timing and success of new product and service introductions by us or our competitors or any other change in the competitive landscape of our industry, including consolidation among our competitors, licensees or customers, and strategic relationships entered into by and between our competitors;\n● changes in the mix of our products and support;\n● changes in the growth rate of the encryption technology market;\n● the timing and costs related to the development or acquisition of technologies or businesses or strategic partnerships;\n● lack of synergy, or the inability to realize expected synergies, resulting from any acquisitions or strategic partnerships;\n● our inability to execute, complete or integrate efficiently any acquisitions that we may undertake;\n● increased expenses, unforeseen liabilities, or write-downs and any impact on our operating results from any acquisitions we may consummate;\n● our ability to create a sizeable and productive distribution channel;\n● decisions by potential customers (if any), or the customers of our licensees, to purchase encryption solutions from larger, more established security vendors, or from their primary network vendors;\n● timing of any revenue recognition and any revenue deferrals;\n● insolvency or credit difficulties confronting customers (if any), our licensees, or the customers of our licensees, which could adversely affect their ability to purchase or pay for our products and offerings;\n● the cost and potential outcomes of any litigation, which could have a material adverse effect on our business;\n● seasonality or cyclical fluctuations in our markets;\n● future accounting pronouncements or changes in our accounting policies, including the potential impact of the adoption and implementation of the Financial Accounting Standards Board’s new standard regarding revenue recognition; and\n● general macroeconomic conditions, in some or all regions in which we operate.\nAny one of the factors above, or the cumulative effect of some of the factors referred to above, may result in significant fluctuations in our financial and other operating results. This variability and unpredictability could result in our failure to meet our revenue, margin, or other operating result expectations, or those of securities analysts or investors for a particular period. ,If we fail to meet or exceed such expectations for these or any other reasons, the market price of our common stock could fall substantially, and we could face costly lawsuits, including securities class action suits.\nWe face intense competition in our market, especially from larger, well-established companies, and we may lack sufficient financial or other resources to maintain or improve our competitive position.\nThe market for encryption technologies is intensely competitive, and we expect competition to increase in the future from established competitors and new market entrants. Our main competitors fall into three categories:\n● large companies that incorporate security or encryption features in their products, such as Google’s Cloud Platform, Amazon’s AWS services, and Microsoft’s Azure, or those that have acquired, or may acquire, encryption products or technologies and have the technical and financial resources to bring competitive solutions to the market;\n● independent security vendors, such as HashiCorp, that offer encryption products; and\n● small and large companies that offer encryption technologies that compete with some of the features proposed for our products.\nMany of our existing competitors have, and some of our potential competitors may have, substantial competitive advantages such as:\n● greater name recognition and longer operating histories;\n● larger sales and marketing budgets and resources;\n● broader distribution and established relationships with distributors and customers (if any), or the customers of our licensees;\n● greater customer support resources;\n● greater resources to make strategic acquisitions or enter into strategic partnerships; and\n● substantially greater financial, technical, and other resources.\nIn addition, some of our larger competitors have substantially broader and more diverse product and services offerings, which may make them less susceptible to downturns in a particular market and allow them to leverage their relationships based on other products or incorporate functionality into existing products to gain business in a manner that discourages users from purchasing our products and subscriptions, including through selling at zero or negative margins, offering concessions, product bundling, or closed technology platforms. Many of our smaller competitors that specialize in providing protection from a single type of security threat are often able to deliver these specialized encryption or security products to the market more quickly than we can.\nOrganizations that use legacy products and services may believe that these products and services are sufficient to meet their security needs, or that our platform only serves the needs of a portion of the encryption technology market. Accordingly, many organizations have invested substantial personnel and financial resources to design and operate their networks and have established deep relationships with other providers of encryption products. As a result, these organizations may prefer to purchase from their existing suppliers rather than add or switch to a new supplier such as us, regardless of product performance, features, or greater services offerings, or may be more willing to incrementally add solutions to their encryption infrastructure from existing suppliers than to replace it wholesale with our solutions.\nConditions in our market could change rapidly and significantly as a result of technological advancements, partnering or acquisitions by our competitors, or continuing market consolidation. New start-up companies that innovate and large competitors that are making significant investments in research and development may invent similar or superior products and technologies that compete with our products. Some of our competitors have made or could make acquisitions of businesses that may allow them to offer more directly competitive and comprehensive solutions than they had previously offered and adapt more quickly to new technologies and changing needs. Our current and potential competitors may also establish cooperative relationships among themselves or with third parties that may further enhance their resources. These competitive pressures in our market or our failure to compete effectively may result in price reductions, fewer orders, reduced revenue and gross margins, and loss of market share. Any failure to meet and address these factors could seriously harm our business and operating results.\nWe currently have only two licensees and have no direct end users and will need to obtain additional licensees and/or end users in the future to generate revenues.\nAs of the filing of this report, we don’t have any significant revenue generating licensees or customers. In order to generate revenue to support our operations we will need to obtain additional licensees and/or customers for our products in the future. If we are unable to obtain such licensees and/or customers, we will not be able to generate revenues and the value of our stock may decline in value or become worthless.\nOur future revenue and operating results will depend significantly on our ability to retain licensees and the ability of those licensees to retain customers, and add new customers, and any decline in our retention rates or failure to add new customers will harm our future revenue and operating results.\nWe anticipate that our future revenue and operating results will depend significantly on our ability to retain licensees and the ability of those licensees to retain customers and add new customers. In addition, we may not be able to predict or anticipate accurately future trends in customer/licensee retention or effectively respond to such trends. Our retention rates may decline or fluctuate due to a variety of factors, including the following:\n● our licensees or their customers’ levels of satisfaction or dissatisfaction with our products;\n● the quality, breadth, and prices of our products;\n● our general reputation and events impacting that reputation;\n● the services and related pricing offered by our competitors;\n● disruption by new services or changes in law are regulations that impact the need for efficacy of our products and services;\n● our customer service activities and responsiveness to any customer complaints;\n● customer dissatisfaction if they do not receive the full benefit of our services due to their failure to provide all relevant data;\n● customer dissatisfaction with the methods or extent of our remediation services; and\n● changes in target customers’ spending levels as a result of general economic conditions or other factors.\nIf we do not retain our existing licensees, or they do not retain their existing customers and add new customers, we may not generate revenue and/or our revenue may grow more slowly than expected, or decline, and our operating results and gross margins will be negatively impacted. In addition, our business and operating results may be harmed if we are unable to increase our retention rates.\nWe also must continually add new licensees and/or customers, both to replace licensees who cancel or elect not to renew their agreements with us and to grow our business beyond our current base. If we are unable to attract new licensees in numbers greater than the percentage who cancel or elect not to renew their agreements with us, our licensee base will decrease, and our business, operating results, and financial condition could be adversely affected.\nA network or data security incident may allow unauthorized access to our or our end users’ network or data, harm our reputation, create additional liability and adversely impact our financial results.\nIncreasingly, companies are subject to a wide variety of attacks on their networks on an ongoing basis. In addition to traditional computer “hackers,” malicious code (such as viruses and worms), phishing attempts, employee theft or misuse, and denial of service attacks, sophisticated nation-state and nation-state supported actors engage in intrusions and attacks (including advanced persistent threat intrusions) and add to the risks to internal networks, cloud deployed enterprise and customer-facing environments and the information they store and process. Despite significant efforts to create security barriers to such threats, it is virtually impossible for us to entirely mitigate these risks. We, and our third-party service providers, may face security threats and attacks from a variety of sources. Our data, corporate systems, third-party systems and security measures and/or those of our end users may be breached due to the actions of outside parties, employee error, malfeasance, a combination of these, or otherwise, and, as a result, an unauthorized party may obtain access to our data. Furthermore, as a provider of encryption technologies, we may be a more attractive target for such attacks. A breach in our data security or an attack against our service availability, or that of our third-party service providers, could impact our networks or networks secured by our products and subscriptions, creating system disruptions or slowdowns and exploiting security vulnerabilities of our products, and the information stored on our networks or those of our third-party service providers could be accessed, publicly disclosed, altered, lost, or stolen, which could subject us to liability and cause us financial harm. Any actual or perceived breach of network security in our systems or networks, or any other actual or perceived data security incident we or our third-party service providers suffer, could result in damage to our reputation, negative publicity, loss of channel partners, licensees, customers and sales, loss of competitive advantages over our competitors, increased costs to remedy any problems and otherwise respond to any incident, regulatory investigations and enforcement actions, costly litigation, and other liability. In addition, we may incur significant costs and operational consequences of investigating, remediating, eliminating and putting in place additional tools and devices designed to prevent actual or perceived security incidents, as well as the costs to comply with any notification obligations resulting from any security incidents. Any of these negative outcomes could adversely impact the market perception of our products and customer and investor confidence in our company and, moreover, could seriously harm our business or operating results.\nIt is essential to our business strategy that our technology and network infrastructure remain secure and are perceived by our potential licensees, their customers, any customers we have, and others to be secure. Despite security measures, however, any network infrastructure may be vulnerable to cyber-attacks by hackers and other security threats. We may face cyber-attacks that attempt to penetrate our network security, sabotage or otherwise disable our research, products and services, misappropriate our proprietary information, or that of our licensees, or their or our customers’ and partners’, which may include personally identifiable information, or cause interruptions of our internal systems and services. Any cyber-attacks could negatively affect our reputation, damage our network infrastructure and our ability to deploy our products and services, harm our business relationships, and expose us to financial liability.\nOur products, systems, and website and the data on these sources may be subject to intentional disruption that could materially harm our reputation and future sales.\nDespite our precautions and significant ongoing investments to protect against security risks, data protection breaches, cyber-attacks, and other intentional disruptions of our products, we expect to be an ongoing target of attacks specifically designed to impede the performance and availability of our offerings and harm our reputation as a company. Similarly, experienced computer programmers or other sophisticated individuals or entities, including malicious hackers, state-sponsored organizations, and insider threats including actions by employees and third-party service providers, may attempt to penetrate our network security or the security of our systems and websites and misappropriate proprietary information or cause interruptions of our services, including the operation of the global civilian cyber intelligence threat network. This risk may be increased during the current COVID-19 pandemic as more individuals are working from home and utilize home networks for the transmission of sensitive information. Such attempts are increasing in number and in technical sophistication, and if successful could expose us and the affected parties, to risk of loss or misuse of proprietary or confidential information or disruptions of our business operations. While we engage in a number of measures aimed to protect against security breaches and to minimize problems if a data breach were to occur, our information technology systems and infrastructure may be vulnerable to damage, compromise, disruption, and shutdown due to attacks or breaches by hackers or due to other circumstances, such as error or malfeasance by employees or third-party service providers or technology malfunction. The occurrence of any of these events, as well as a failure to promptly remedy these events should they occur, could compromise our systems, and the information stored in our systems could be accessed, publicly disclosed, lost, stolen, or damaged. Any such circumstance could adversely affect our ability to attract and maintain licensees, and/or for us or our licensees to retain customers, as well as strategic partners, cause us to suffer negative publicity, and subject us to legal claims and liabilities or regulatory penalties. In addition, unauthorized parties might alter information in our databases, which would adversely affect both the reliability of that information and our ability to market and perform our services. Techniques used to obtain unauthorized access or to sabotage systems change frequently, are constantly evolving and generally are difficult to recognize and react to effectively. We may be unable to anticipate these techniques or to implement adequate preventive or reactive measures. Several recent, highly publicized data security breaches at other companies have heightened consumer awareness of this issue and may embolden individuals or groups to target our systems or those of our licensees or strategic partners, or our or their customers.\nOur products are complex and operate in a wide variety of environments, systems and configurations, which could result in failures of our products to function as designed and negatively impact our brand recognition and reputation.\nBecause we offer very complex products, errors, defects, disruptions, or other performance problems with our products may and have occurred. For example, we may experience disruptions, outages, and other performance problems due to a variety of factors, including infrastructure changes, human or software errors, capacity constraints due to an overwhelming number of users accessing our websites simultaneously, fraud, or security attacks. In some instances, we may not be able to identify the cause or causes of these performance problems within an acceptable period of time. Interruptions in our products could impact our revenues or cause licensees/customers to cease doing business with us. Our operations are dependent upon our ability to protect our technology infrastructure against damage from business continuity events that could have a significant disruptive effect on our operations. We could potentially lose end user/customer data or experience material adverse interruptions to our operations or delivery of products to our clients in a disaster recovery scenario. Further, our business would be harmed if any of these types of events caused our licensees or customers, or our licensees’ customers or potential customers, to believe that our products are unreliable. We believe that our brand recognition and reputation are critical aspects of our business, to retaining existing licensees and customers, and attracting new licensees and customers. Furthermore, negative publicity, whether or not justified, relating to events or activities attributed to us, our employees, our strategic partners, our affiliates, or others associated with any of these parties, may tarnish our reputation and reduce the value of our brands. Damage to our reputation may reduce demand for our products and have an adverse effect on our business, operating results, and financial condition. Moreover, any attempts to rebuild our reputation and restore the value of our brands after such an event may be costly and time consuming, and such efforts may not ultimately be successful.\nIf our products do not work properly, our business, financial condition and financial results could be negatively affected, and we could experience negative publicity, declining sales and legal liability.\nWe produce complex products that incorporate leading-edge technology that must operate in a wide variety of technology environments. Software may contain defects or “bugs” that can interfere with expected operations. There can be no assurance that our testing programs will be adequate to detect all defects prior to the product being introduced, which might decrease customer satisfaction with our products and services. The product reengineering cost to remedy a product defect could be material to our operating results. Our inability to cure a product defect could result in the temporary or permanent withdrawal of a product or service, negative publicity, damage to our reputation, failure to achieve market acceptance, lost revenue and increased expense, any of which could have a material adverse effect on our business, financial condition and financial results.\nOutages or problems with systems and infrastructure supplied by third parties could negatively affect our business, financial condition and financial results.\nOur business relies on third-party suppliers of the telecommunications infrastructure. We and our licensees, and their customers, will use various communications service suppliers and the global internet to provide network access between our data centers and end-users of our services. If those suppliers do not enable us to provide our licensees and their customers with reliable, real-time access to our systems (to the extent required), we may be unable to gain or retain licensees. These suppliers periodically experience outages or other operational problems as a result of internal system failures or external third-party actions. Supplier outages or other problems could materially adversely affect our business, financial condition and financial results.\nCurrent global financial conditions have been characterized by increased volatility, which could negatively impact our business, prospects, liquidity and financial condition.\nCurrent global financial conditions and recent market events have been characterized by increased volatility, and the resulting tightening of the credit and capital markets has reduced the amount of available liquidity and overall economic activity. We cannot guaranty that debt or equity financing, or the ability to generate cash from operations, will be available or sufficient to meet or satisfy our initiatives, objectives or requirements. Our inability to access sufficient amounts of capital on terms acceptable to us for our operations will negatively impact our business, prospects, liquidity and financial condition.\nIf we experience delays and/or defaults in payments, we could be unable to recover all expenditures.\nBecause of the nature of our contracts, at times we will commit resources to projects prior to receiving payments from the counterparty in amounts sufficient to cover our expenditures on projects as they are incurred. Delays in payments may require us to make a working capital investment. Defaults by any of our licensees or their customers could have a significant adverse effect on our revenues, profitability and cash flow. Our licensees or their customers may in the future default on their obligations to us or them due to bankruptcy, lack of liquidity, operational failure or other reasons deriving from the current general economic environment. If a customer defaults on its obligations to us or our licensee, or a licensee defaults in its payments to us, it could have a material adverse effect on our business, financial condition, results of operations or cash flows.\nRisks Related to Our Industry\nWe face intense competition.\nWe expect to experience intense competition across all markets for our products and services. Our competitors that are focused on narrower product lines may be more effective in devoting technical, marketing, and financial resources to compete with us. In addition, barriers to entry in our businesses generally are low, and products, once developed, can be distributed broadly and quickly at a relatively low cost. Open-source software vendors are devoting considerable efforts to developing software that mimics the features and functionality of our anticipated products. These competitive pressures may result in decreased sales volumes, price reductions, and/or increased operating costs, such as for marketing and sales incentives, resulting in lower revenue, gross margins, and operating income.\nDelays in product development schedules may adversely affect our revenues.\nThe development of encryption products is a complex and time-consuming process. New products can require long development and testing periods. Future revenues may include the sale of new products that may not yet be developed. Significant delays in product development, including quality assurance testing or significant problems in creating new products, could adversely affect our revenue recognition from new products. Revenue in certain reporting periods could be lower than anticipated because product development problems could cause the loss of a competitive deal, a delay in invoicing a licensee/customer, or the renegotiation of terms to retain a deal.\nIf we do not accurately predict, prepare for, and respond promptly to rapidly evolving technological and market developments and successfully manage product introductions and transitions to meet changing needs in the encryption technology market, our competitive position and prospects will be harmed.\nThe encryption technologies market has grown quickly and is expected to continue to evolve rapidly. Moreover, many of our potential licensees and their customers operate in markets characterized by rapidly changing technologies and business plans, which require them to add numerous network access points and adapt increasingly complex enterprise networks, incorporating a variety of hardware, software applications, operating systems, and networking protocols. If we fail to accurately predict potential changing needs and emerging technological trends in the encryption technology industry, including in the areas of mobility, virtualization, and cloud computing, our business could be harmed. The technology in our platform is especially complex because it needs to effectively identify and respond to new and increasingly sophisticated methods of attack, while minimizing the impact on network performance. If we experience unanticipated delays in the availability of new products, platform features, and subscriptions, and fail to meet expectations for such availability, our competitive position and business prospects will be harmed.\nAdditionally, we must commit significant resources to developing new platform features before knowing whether our investments will result in products, subscriptions, and platform features that the market will accept. The success of new platform features depends on several factors, including appropriate new product definition, differentiation of new products, subscriptions, and platform features from those of our competitors, and market acceptance of these products, services and platform features. Moreover, successful new product introduction and transition depends on a number of factors including, our ability to manage the risks associated with new product production ramp-up issues, the availability of application software for new products, the effective management of purchase commitments and inventory, the availability of products in appropriate quantities and costs to meet anticipated demand, and the risk that new products may have quality or other defects or deficiencies, especially in the early stages of introduction. We cannot assure you that we will successfully identify opportunities for new products and subscriptions, develop and bring new products and subscriptions to market in a timely manner, or achieve market acceptance of our products and subscriptions, or that products, subscriptions, and technologies developed by others will not render our products, subscriptions, or technologies obsolete or noncompetitive.\nActual, possible or perceived defects or vulnerabilities in our products or services, the failure of our products or services to detect or prevent a security breach or the misuse of our products could harm our reputation and divert resources.\nBecause our products and services are complex, they may contain defects or errors that are not detected until after their commercial release and deployment. Defects or vulnerabilities may impede or block network traffic, cause our products or services to be vulnerable to electronic break-ins or cause them to fail to help secure networks. We are also susceptible to errors, defects, vulnerabilities or attacks that may arise at, or be inserted into our products in, different stages in our supply chain, or manufacturing processes, and which are out of our control. Attacks may target specific unidentified or unresolved vulnerabilities that exist or arrive only in the supply chain, making these attacks virtually impossible to anticipate and difficult to defend against. Different users deploy and use encryption products in different ways, and certain deployments and usages may subject our products to adverse conditions that may negatively impact the effectiveness and useful lifetime of our products. Our networks and products, including any cloud-based technology we utilize, could be targeted by attacks specifically designed to disrupt our business and harm our reputation. Our products may not prevent all security threats. Because the techniques used by computer hackers to access or sabotage networks change frequently and generally are not recognized until launched against a target, we may be unable to anticipate these techniques. An actual, possible or perceived security breach or infection of the network of one of the users of our products, regardless of whether the breach is attributable to the failure of our products or services to prevent the security breach, could adversely affect the market’s perception of our security products and services and, in some instances, subject us to potential liability that is not contractually limited. We may not be able to correct any security flaws or vulnerabilities promptly, or at all. Our products may also be misused by potential end users or third parties who obtain access to our products. For example, our products could be used to censor private access to certain information on the internet. Such use of our products for censorship could result in negative press coverage and negatively affect our reputation, even if we take reasonable measures to prevent any improper shipment of our products or if our products are provided by an unauthorized third party.\nAny actual, possible or perceived defects, errors or vulnerabilities in our products, or misuse of our products, could result in:\n● the expenditure of significant financial and product development resources in efforts to analyze, correct, eliminate or work around errors or defects or to address and eliminate vulnerabilities;\n● the loss of potential licensees, customers or distribution partners;\n● delayed or lost revenue;\n● delay or failure to attain market acceptance;\n● negative publicity and harm to our reputation; and\n● litigation, regulatory inquiries or investigations that may be costly and harm our reputation and, in some instances, subject us to potential liability that is not contractually limited.\nRisks Related to Our Intellectual Property\nOur proprietary rights may be difficult to enforce, which could enable others to copy or use aspects of our products without compensating us.\nWe rely primarily on patent, trademark, copyright and trade secrets laws and confidentiality procedures and contractual provisions to protect our technology. Valid patents may not issue from our pending applications, and the claims eventually allowed on any patents may not be sufficiently broad to protect our technology or products. Any issued patents may be challenged, invalidated or circumvented, and any rights granted under these patents may not actually provide adequate defensive protection or competitive advantages to us. Patent applications in the United States are typically not published until at least 18 months after filing, or, in some cases, not at all, and publications of discoveries in industry-related literature lag behind actual discoveries. We cannot be certain that we were the first to make the inventions claimed in our pending patent applications, or that we were the first to file for patent protection. Additionally, the process of obtaining patent protection is expensive and time-consuming, and we may not be able to prosecute all necessary or desirable patent applications at a reasonable cost or in a timely manner. In addition, recent changes to the patent laws in the United States, including but not limited to “first to file” and “post-grant review” provisions, may bring into question the validity of certain software patents and may make it more difficult and costly to prosecute patent applications. As a result, we may not be able to obtain adequate patent protection or effectively enforce our issued patents.\nDespite our efforts to protect our proprietary rights, unauthorized parties may attempt to copy aspects of our products or obtain and use information that we regard as proprietary. We generally enter into confidentiality or license agreements with our employees, consultants, vendors and licensees, as the case may be, and generally limit access to and distribution of our proprietary information. However, we cannot guarantee that the steps taken by us will prevent misappropriation of our technology. Policing unauthorized use of our technology or products is difficult. In addition, the laws of some foreign countries do not protect our proprietary rights to as great an extent as the laws of the United States, and many foreign countries do not enforce these laws as diligently as government agencies and private parties in the United States. From time to time, legal action by us may be necessary to enforce our patents and other intellectual property rights, to protect our trade secrets, to determine the validity and scope of the proprietary rights of others or to defend against claims of infringement or invalidity. Such litigation could result in substantial costs and diversion of resources and could negatively affect our business, operating results and financial condition. If we are unable to protect our proprietary rights (including aspects of our software and products protected other than by patent rights), we may find ourselves at a competitive disadvantage to others who need not incur the additional expense, time and effort required to create the innovative products that would compete with our products.\nIf our end users experience data losses, our brand, reputation and business could be harmed.\nA breach of our end users’ network security and systems, or other events that cause the loss or public disclosure of, or access by third parties to, our end users’ files or data, could have serious negative consequences for our business, including reduced demand for our services, an unwillingness of our licensees or their customers to use our services, harm to our brand and reputation. The techniques used to obtain unauthorized access, disable or degrade service, or sabotage systems change frequently, often are not recognized until launched against a target, and may originate from less regulated or remote areas around the world. As a result, our end users may be unable to proactively prevent these techniques, implement adequate preventative or reactionary measures, or enforce the laws and regulations that govern such activities. If our end users experience any data loss, data disruption, or any data corruption or inaccuracies, whether caused by security breaches or otherwise, our brand, reputation and business could be harmed.\nOur insurance (if any) may be inadequate or may not be available in the future on acceptable terms, or at all. In addition, our policy may not cover claims against us for loss of data or other indirect or consequential damages. Defending a suit based on any data loss or system disruption, regardless of its merit, could be costly and divert our management’s attention.\nClaims by others that we infringe their proprietary technology or other litigation matters could harm our business.\nPatent and other intellectual property disputes are common in the encryption and technology industries. Third parties may in the future assert claims of infringement of intellectual property rights against us. They may also assert such claims against our licensees, end users or partners whom we may have to indemnify against claims that our products infringe the intellectual property rights of third parties. As the number of products and competitors in our market increases and overlaps occur, infringement claims may increase. Any claim of infringement by a third party, even those without merit, could cause us to incur substantial costs defending against the claim and could distract our management from our business. In addition, litigation may involve patent holding companies, non-practicing entities or other adverse patent owners who have no relevant product revenue and against whom our own patents may therefore provide little or no deterrence or protection.\nAlthough third parties may offer a license to their technology, the terms of any offered license may not be acceptable, and the failure to obtain a license or the costs associated with any license could cause our business, financial condition and results of operations to be materially and adversely affected. In addition, some licenses may be non-exclusive and, therefore, our competitors may have access to the same technology licensed to us. Alternatively, we may be required to develop non-infringing technology, which could require significant time, effort and expense, and may ultimately not be successful. Furthermore, a successful claimant could secure a judgment or we may agree to a settlement that prevents us from distributing certain products or performing certain services or that requires us to pay substantial damages (including treble damages if we are found to have willfully infringed such claimant’s patents or copyrights), royalties or other fees. Any of these events could seriously harm our business, financial condition and results of operations.\nWe may be subject to lawsuits claiming patent infringement. We may also be subject to other litigation in addition to patent infringement claims, such as employment-related litigation and disputes, as well as general commercial litigation, and could become subject to other forms of litigation and disputes, including stockholder litigation. If we are unsuccessful in defending any such claims, our operating results and financial condition and results may be materially and adversely affected. For example, we may be required to pay substantial damages and could be prevented from selling certain of our products. Litigation, with or without merit, could negatively impact our business, reputation and sales in a material fashion.\nWe rely on the availability of third-party licenses and our inability to maintain those licenses could harm our business.\nMany of our products or products under development include software or other intellectual property licensed from third parties. It may be necessary in the future to renew licenses relating to various aspects of these products or to seek new licenses for existing or new products. Licensors may claim we owe them additional license fees for past and future use of their software and other intellectual property or that we cannot utilize such software or intellectual property in our products going forward. There can be no assurance that the necessary licenses would be available on acceptable terms, if at all.\nThe inability to obtain certain licenses or other rights or to obtain such licenses or rights on favorable terms or for reasonable pricing, or the need to engage in litigation regarding these matters, could result in delays in product releases until equivalent technology can be identified, licensed or developed, if at all, and integrated into our products and may result in significant license fees and have a material adverse effect on our business, operating results, and financial condition. Moreover, the inclusion in our products of software or other intellectual property licensed from third parties on a non-exclusive basis could limit our ability to differentiate our products from those of our competitors.\nWe also rely on technologies licensed from third parties in order to operate functions of our business. If any of these third parties allege that we have not properly paid for such licenses or that we have improperly used the technologies under such licenses, we may need to pay additional fees or obtain new licenses, and such licenses may not be available on terms acceptable to us or at all or may be costly. In any such case, or if we were required to redesign our internal operations to function with new technologies, our business, results of operations and financial condition could be harmed.\nOur use of open-source software in our products could negatively affect our ability to sell our products and subject us to possible litigation.\nOur current products, and/or those under development, contain software modules licensed to or used by us from third-party authors under “open source” licenses. Some open-source licenses contain requirements that we make available applicable source code for modifications or derivative works we create based upon the type of open-source software we use. If we combine our proprietary software with open-source software in a certain manner, we could be required to release the source code of our proprietary software to the public under certain open-source licenses. This would allow our competitors to create similar products with lower development effort and time, and ultimately could result in a loss of product sales for us.\nAlthough we monitor our use of open-source software to avoid subjecting our products and subscriptions to conditions we do not intend, the terms of many open-source licenses have not been interpreted by United States courts, and there is a risk that these licenses could be construed in a way that could impose unanticipated conditions or restrictions on our ability to commercialize our products. From time to time, there have been claims against companies that distribute or use open-source software in their products, asserting that open-source software infringes the claimants’ intellectual property rights. We could be subject to suits by parties claiming infringement of intellectual property rights in what we believe to be licensed open-source software. If we are held to have breached the terms of an open source software license, we could be required to seek licenses from third parties to continue offering our products on terms that are not economically feasible, to reengineer our products, to discontinue the sale of our products if reengineering could not be accomplished on a timely basis, or to make generally available, in source code form, our proprietary code, any of which could adversely affect our business, operating results, and financial condition.\nIn addition to risks related to license requirements, usage of open-source software can lead to greater risks than use of third-party commercial software, as open-source licensors generally do not provide warranties or assurance of title or controls on origin of the software. In addition, many of the risks associated with usage of open-source software, such as the lack of warranties or assurances of title, cannot be eliminated, and could, if not properly addressed, negatively affect our business. We have established processes to help alleviate these risks, including a review process for screening requests from our development organizations for the use of open-source software, but we cannot be sure that our processes for controlling our use of open-source software in our products will be effective.\nRisks Related to Our Common Stock\nHistorically, the market price for our common stock has been volatile, and you may not be able to sell our stock at a favorable price, or at all.\nYou should consider an investment in our common stock to be risky, and you should invest in our common stock and securities convertible into our common stock only if you can withstand a complete loss and wide fluctuations in the market value of your investment. Some factors that may cause the market price of our common stock to fluctuate, in addition to the other risks mentioned in this “Risk Factors” section and elsewhere are:\n● sale of our common stock by our stockholders, executives, and directors;\n● volatility and limitations in trading volumes of our shares of common stock;\n● our ability to obtain financings to conduct and complete research and development activities and other business activities;\n● the timing and success of introductions of new products by us or our competitors or any other change in the competitive dynamics of our industry, including consolidation among competitors;\n● our ability to attract new licensees;\n● changes in the development status of our products;\n● changes in our capital structure or dividend policy, future issuances of securities, sales of large blocks of common stock by our stockholders;\n● our cash position;\n● announcements and events surrounding financing efforts, including debt and equity securities;\n● our inability to enter into new markets or develop new products;\n● reputational issues;\n● announcements of acquisitions, partnerships, collaborations, joint ventures, new products, capital commitments, or other events by us or our competitors;\n● changes in industry conditions or perceptions;\n● analyst research reports, recommendation and changes in recommendations, price targets, and withdrawals of coverage;\n● departures and additions of key personnel;\n● disputes and litigations related to intellectual properties, proprietary rights, and contractual obligations;\n● changes in applicable laws, rules, regulations, or accounting practices and other dynamics; and\n● other events or factors, many of which may be out of our control.\nIn addition, if the market for stock of companies in our industry or industries related to our industry, or the stock market in general, experiences a loss of investor confidence, the trading price of our common stock could decline for reasons unrelated to our business, financial condition and results of operations. If any of the foregoing occurs, it could cause our stock price to fall and may expose us to lawsuits that, even if unsuccessful, could be costly to defend and a distraction to management.\nSubstantial sales of our common stock, or the perception that such sales might occur, could depress the market price of our common stock.\nWe cannot predict whether future issuances of our common stock, or resale of shares in the open market, will decrease the market price of our common stock. The consequence of any such issuances or resale of our common stock on our market price may be increased as a result of the fact that our common stock is thinly, or infrequently, traded. The exercise of any outstanding options, or the vesting of any restricted stock, that we may grant to directors, executive officers and other employees in the future, or the issuance of common stock in connection with acquisitions and other issuances of our common stock, may decrease the market price of our common stock.\nHolders of our common stock have a risk of potential dilution if we issue additional shares of common stock in the future.\nThe exercise of outstanding options and warrants to purchase our common stock will dilute existing stockholders’ ownership percentage. We currently have outstanding warrants to purchase 87,628,920 shares of our common stock, with a weighted average exercise price of $0.55. Our board of directors has authorized, and our stockholders have approved, an employee stock option plan, under which we may issue options to purchase or grant up to an aggregate of 8,000,000 shares of common stock. In the future, we may grant additional stock options, warrants, preferred stock or convertible securities. The exercise or conversion of stock options, warrants, preferred stock, or convertible securities will dilute the ownership percentage of our then existing stockholders. The dilutive effect of the exercise or conversion of these securities may adversely affect our ability to obtain additional capital. The holders of these securities may be expected to exercise or convert their securities when we are able to obtain additional equity capital on terms more favorable than these securities.\nThe anti-dilutive rights of certain warrants could result in significant dilution to our existing stockholders and/or require us to issue a substantially greater number of shares, which may adversely affect the market price of our common stock.\nThe warrants to purchase 55,549,615 shares of our common stock issued to investors in our recent private placement contain anti-dilution rights such that if we issue, or are deemed to have issued, common stock or common stock equivalents at a price less than the then exercise price of those warrants, the exercise price of those warrants will automatically be reduced to such lower value, and the number of shares of common stock issuable upon exercise thereafter will be adjusted proportionately, so that the aggregate exercise price payable upon exercise of such warrants is the same prior to and after such reduction in exercise price. As a result, the effect of the anti-dilution right may cause significant dilution to our other stockholders. The warrants to purchase 8,332,439 shares of our common stock issuable upon exercise of warrants issued to the placement agent in the private placement include a weighted average anti-dilution right in the event we issue any shares of common stock or equivalents with a value less than the then exercise price. As a result, the effect of the anti-dilution right may cause significant dilution to our other stockholders. The triggering of the anti-dilution rights in the warrants issued in the private placement may result in such securities being exercisable for a significant number of additional shares of common stock and/or exercisable for a reduced exercise price. As a result, the number of shares issuable could prove to be significantly greater than they are currently and could result in substantial dilution to our other stockholders.\nOur common shares are thinly traded, and in the future may continue to be thinly traded, and you may be unable to sell your shares at or near ask prices or at all, if you need to sell your shares to raise money or otherwise desire to liquidate such shares.\nWe cannot predict the extent to which an active public market for our common stock will develop or be sustained due to a number of factors, including the fact that we are a small company that is relatively unknown to stock analysts, stock brokers, institutional investors and others in the investment community that generate or influence sales volume, and that even if we came to the attention of such persons, they tend to be risk-averse and would be reluctant to follow an unproven company such as ours or purchase or recommend the purchase of our shares until such time as we become more seasoned and viable. As a consequence, there may be periods of several days or more when trading activity in our shares is minimal or non-existent, as compared to a seasoned issuer that has a large and steady volume of trading activity that will generally support continuous sales without an adverse effect on its share price. We cannot give you any assurance that a broader or more active public trading market for our common stock will develop or be sustained, or that even current trading levels will be sustained. You may be unable to sell your common stock at or above your purchase price, if at all, which may result in substantial losses to you. As a consequence of this lack of liquidity, the trading of relatively small quantities of shares by our stockholders may disproportionately influence the price of those shares in either direction. The price for our shares could, for example, decline precipitously in the event that a large number of our common shares are sold on the market without commensurate demand, as compared to a seasoned issuer that could better absorb those sales without adverse impact on its share price. As a consequence of this enhanced risk, more risk-adverse investors may, under the fear of losing all or most of their investment in the event of negative news or lack of progress, be more inclined to sell their shares on the market more quickly and at greater discounts than would be the case with the stock of a seasoned issuer.\nA significant number of our shares have been registered for resale, and their sale or potential sale may depress the market price of our common stock.\nAs of September 30, 2021, we had 82,927,311 shares of common stock outstanding. In November of this year, we filed a registration statement that registers the resale of 55,549,615 shares of our common stock and warrants to purchase an additional 63,882,054 shares of our common stock. As of September 30, 2021, the 55,549,615 registered shares constitute approximately 67.0% of our outstanding shares of common stock, and the 63,882,054 warrants shares would constitute 37.5% of our outstanding common stock, assuming the exercise of all of the total outstanding warrants for the purchase of 87,628,920 shares are exercised in full for cash. Sales of a significant number of shares of our common stock in the public market, or the potential or expectation of such sales, could harm the market price of our common stock. As large numbers of our common stock are sold, it would increase the supply of our common stock, which would thereby cause a decrease in its price.\nIn addition, the shares of our common stock that has been registered for resale and/or is issuable upon exercise of the warrants issued in the private placement may represent overhang that may also adversely affect the market price of our common stock. Overhang occurs when there is a greater supply of a company’s stock in the market than there is demand for that stock. When this happens, the price of the company’s stock will decrease, and any additional shares that stockholders attempt to sell in the market will only further decrease the share price. The exercise price of our outstanding warrants may be less than the trading price of our common stock or may create an artificial ceiling on the price of our common stock. In the event of such overhang, the holders of those warrants will have an incentive to sell their common stock as quickly as possible. If the share volume of our common stock cannot absorb the new shares issuable upon exercise of those warrants or made available for sale pursuant to the registration statement, then the value of our common stock will likely decrease.\nFuture sales and issuances of our securities could result in additional dilution of the percentage ownership of our stockholders and could cause our share price to fall.\nWe expect that we will need significant additional capital in the future to continue our planned operations, including research and development, increased marketing, hiring new personnel, commercializing our products, and continuing activities as an operating public company. To the extent that we raise additional capital by issuing equity securities, our existing stockholders may experience substantial dilution. We may sell common stock, convertible securities or other equity securities in one or more transactions, at prices and in a manner in which we determine from time to time. If we sell common stock, convertible securities or other equity securities in more than one transaction, investors may be materially diluted by subsequent sales. Such sales may also result in material dilution to our existing stockholders, and new investors could gain rights superior to our existing stockholders.\nOur common stock is subject to restrictions on sales by broker-dealers and penny stock rules, which may be detrimental to investors.\nOur common stock is subject to Rules 15g-1 through 15g-9 under the Exchange Act, which imposes certain sales practice requirements on broker-dealers who sell our common stock to persons other than established customers and “accredited investors” (as defined in Rule 501(a) of the Securities Act). For transactions covered by this rule, a broker-dealer must make a special suitability determination for the purchaser and receive the purchaser’s written consent to the transaction prior to the sale. This rule adversely affects the ability of broker-dealers to sell our common stock and holders of our common stock to sell their shares of our common stock.\nAdditionally, our common stock is subject to SEC regulations applicable to “penny stocks.” Penny stocks include any non-Nasdaq equity security that has a market price of less than $5.00 per share, subject to certain exceptions. The regulations require that, prior to any non-exempt buy/sell transaction in a penny stock, a disclosure schedule proscribed by the SEC relating to the penny stock market must be delivered by a broker-dealer to the purchaser of such penny stock. This disclosure must include the amount of commissions payable and the current price quotations for our common stock. The regulations also require that monthly statements be sent to holders of a penny stock that disclose recent price information for the penny stock and information regarding the limited market for penny stocks. These requirements adversely affect the market liquidity of our common stock.\nBecause our common stock is quoted on the OTCQB instead of a national exchange, our investors may have difficulty selling their stock or may experience negative volatility on the market price of our common stock.\nOur common stock is quoted on the OTCQB Market, operated by the OTC Markets Group. The OTCQB is often highly illiquid, in part because it does not have a national quotation system by which potential investors can follow the market price of shares, except through information received and generated by a limited number of broker-dealers that make markets in particular stocks. There is a greater chance of volatility for securities that trade on the OTCQB, as compared to a national exchange or quotation system. This volatility may be caused by a variety of factors, including the lack of readily available price quotations, the absence of consistent administrative supervision of bid and ask quotations, lower trading volume, and market conditions. Investors in our common stock may experience high fluctuations in the market price and volume of the trading market for our securities. These fluctuations, when they occur, have a negative effect on the market price for our securities. Accordingly, our stockholders may not be able to realize a fair price for their shares when they determine to sell them, or may have to hold them for a substantial period of time until the market for our common stock improves.\nRisks Related to Regulations and Our Compliance with Such Regulations\nWe previously identified material weaknesses in our disclosure controls and procedures and internal control over financial reporting. If not remediated, our failure to establish and maintain effective disclosure controls and procedures and internal control over financial reporting could result in material misstatements in our financial statements and a failure to meet our reporting and financial obligations, each of which could have a material adverse effect on our financial condition and the trading price of our common stock.\nMaintaining effective internal control over financial reporting and effective disclosure controls and procedures are necessary for us to produce reliable financial statements. While our disclosure controls and procedures and internal controls over financial reporting are currently effective, they have in the past been ineffective and subject to material weaknesses. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of a company’s annual or interim financial statements will not be prevented or detected on a timely basis. A control deficiency exists when the design or operation of a control does not allow management or employees, in the normal course of performing their assigned functions, to prevent or detect misstatements on a timely basis.\nMaintaining effective disclosure controls and procedures and effective internal control over financial reporting are necessary for us to produce reliable financial statements and we are committed to remediating our material weaknesses in such controls as promptly as possible. However, we cannot assure you as to when these material weaknesses will be remediated or that additional material weaknesses will not arise in the future. Any failure by us to remediate material weaknesses, or the development of new material weaknesses in our internal control over financial reporting, could result in material misstatements in our financial statements and cause us to fail to meet our reporting and financial obligations, which in turn could have a material adverse effect on our financial condition and the trading price of our common stock, and/or result in litigation against us or our management.\nWe are subject to changing laws and regulations.\nU.S. government agencies continue to implement extensive requirements on our industry. These regulations have both positive and negative impacts, with much remaining uncertainty as to how various provisions will ultimately affect our licensees, end users and our business. As to prospective legislation and regulation concerning collection, transmission, storage and use of personal data, we cannot determine what effect additional state or federal governmental legislation, regulations, or administrative orders would have on our business in the future. New legislation or regulation may require the reformulation of our business to meet new standards, require us to cease operations, impose stricter qualification and/or registration standards, impose additional record keeping, or require expanded consumer protection measures (such as heightened notification procedures and data subject access rights).\nOur failure to comply with laws and regulations applicable to our business could subject us to fines and penalties and could also cause us to lose potential licensees and/or for them to lose potential customers in the public sector or negatively impact our ability to contract with the public sector.\nOur business is subject to regulation by various federal, state, regional, local and foreign governmental agencies, including agencies responsible for monitoring and enforcing employment and labor laws, workplace safety, product safety, product labeling, environmental laws, consumer protection laws, anti-bribery laws, data privacy laws, import and export controls, federal securities laws and tax laws and regulations. In certain jurisdictions, these regulatory requirements may be more stringent than in the United States. Noncompliance with applicable regulations or requirements could subject us to investigations, sanctions, enforcement actions, disgorgement of profits, fines, damages and civil and criminal penalties or injunctions. If any governmental sanctions are imposed, or if we do not prevail in any possible civil or criminal litigation, our business, operating results and financial condition could be adversely affected. In addition, responding to any legal action will likely result in a significant diversion of our management’s attention and resources and an increase in professional fees. Enforcement actions and sanctions could harm our business, operating results and financial condition.\nAdditionally, we may be subject to other legal regimes throughout the world governing data handling, protection and privacy. For example, in June of 2018, California passed the California Consumer Privacy Act, or the “CCPA,” which provides new data privacy rights for consumers and new operational requirements for companies became effective in 2020, and in March 2021 Virginia passed a consumer data protection law, the “VCDPA,” which includes similar rights as set forth in the CCPA. Fines for noncompliance may be up to $7,500 per violation. The costs of compliance with, and other burdens imposed by, the CCPA, the VCDPA and other state or foreign laws, may limit the use and adoption of our products and services and could have an adverse impact on our business. These laws and regulations impose added costs on our business, and failure to comply with these or other applicable regulations and requirements, including non-compliance in the past, could lead to claims for damages from our channel partners, penalties, termination of contracts, loss of exclusive rights in our intellectual property and temporary suspension or permanent debarment from government contracting. Any such damages, penalties, disruptions or limitations in our ability to do business with the public sector could have an adverse effect on our business and operating results.\nGovernmental restrictions on the sale of our products and services in non-U.S. markets could negatively affect our business, financial condition and financial results.\nExports of software products and services using encryption technology such as ours are generally restricted by the U.S. government. In addition, some countries impose restrictions on the use of encryption products and services such as ours. The cost of compliance with U.S. and other export laws, or our failure to obtain governmental approvals to offer our products and services in non-U.S. markets, could affect our ability to sell our products and services and could impair our international expansion. We face a variety of other legal and compliance risks. If we or our distributors fail to comply with applicable law and regulations, we may become subject to penalties, fines or restrictions that could materially adversely affect our business, financial condition and financial results.\nRisks Related to Our Contractual Agreements\nWe owe amounts to our Chief Executive Officer upon the occurrence of certain change of control transactions.\nPursuant to the employment agreement of our chief executive officer, David Chasteen, if we sell all or substantially all of our assets or consummate a merger, reorganization or similar transaction in which a majority of the equity in the surviving company is not owned by our stockholders immediately prior to such a transaction, then Mr. Chasteen will receive a bonus equal to 5% of the “Net Proceeds” we receive from such a transaction. Net Proceeds are defined as the purchase price, less costs incurred to complete the sale, including but not limited to accounting, legal, due diligence, commissions, investment banking fees or similar costs that are necessitated by the applicable transaction. The requirement to pay 5% of the net proceeds to Mr. Chasteen may prevent a change of control that could be accretive to stockholders or decrease the amount of funds available to be paid to stockholders upon a change of control.\nThe accounting treatment of the recently issued warrants could have a material adverse impact on our financial statements.\nVarious provisions of the warrants we issued in the recent private placement, including, but not limited to, various price reset and anti-dilution provisions, will cause these instruments to be treated as derivative liabilities. As a result, we will be forced to value those warrants at the end of each fiscal quarter based upon complex accounting methods for the treatment of derivative liabilities, such as Monte Carlo or other similar valuation models, which will calculate the value of those warrants based upon a variety of factors, including price volatility in the market price of our common stock. We cannot predict the financial impact of the issuance of the warrants on our financial statements, specifically our balance sheet, and the deviation in the impact from quarter to quarter.\nOur stockholders are subject to significant dilution upon the occurrence of certain events which could result in a decrease in our stock price.\nAs of the date of this report, we had approximately 87,628,920 shares of our common stock reserved or designated for future issuance upon the exercise of outstanding options and warrants, and conversion of convertible instruments. Further, we may from time to time make an offer to our warrant holders to exchange their outstanding warrants for shares of our common stock, a fewer number of warrants with more favorable terms, or a combination thereof, subject to applicable rules and requirements.\nThe warrants issued in the recent private placement contain provisions that, subject to certain exceptions, reset the exercise price of such warrants if at any time while such warrants are outstanding we sell or issue (or are deemed to sell or issue) shares of our common stock or rights, warrants, options or other securities or debt convertible, exercisable or exchangeable for shares of our common stock at a price below the then current exercise price per share for such warrants ($0.36 per share for the warrants issued to investors and $0.18 per share for the warrants issued to the placement agent). Any future resets to the exercise price of those warrants will have a further dilutive effect on our existing stockholders and could result in a decrease in our stock price.\nThe purchase agreement related to our recent private placement includes various covenants, such that if we don’t comply with such covenants, we may suffer potential monetary and other penalties.\nThe securities purchase agreement we entered into in connection with the recent private placement contains certain covenants. If we do not comply with these covenants, we will be in breach of our obligations under the securities purchase agreement, which may lead to exercise by the investors of the remedies available to them under the securities purchase agreement, which may cause a material impact upon our financial condition.\nGeneral Risk Factors\nOur charter allows us to issue “blank check” preferred stock without stockholder approval.\nPursuant to our certificate of incorporation, our board of directors has the authority to issue up to [10 million] shares of “blank check” preferred stock and to determine the price, rights, preferences, privileges and restrictions, including voting rights, of those shares without any additional vote or action by our stockholders. Because our board of directors is able to designate the powers and preferences of the preferred stock without the vote of a majority of our stockholders, our stockholders will have no control over what designations and preferences our preferred stock will have. The issuance of shares of preferred stock or the rights associated therewith, could cause substantial dilution to our existing stockholders. Additionally, the dilutive effect of any preferred stock that we may issue may be exacerbated given the fact that such preferred stock may have voting rights and/or other rights or preferences that could provide the preferred stockholders with substantial voting control over us and/or give those holders the power to prevent or cause a change in control. As a result, the issuance of shares of preferred stock may cause the value of our common stock to decrease.]\nWe will continue to incur increased costs as a result of being a reporting company and, given our limited capital resources, such additional costs may have an adverse impact on our profitability.\nWe are a reporting company to the Securities and Exchange Commission, or SEC. The rules and regulations under the Exchange Act require reporting companies to provide periodic reports with interactive data files, which require that we engage legal, accounting and auditing professionals, and eXtensible Business Reporting Language (XBRL) and EDGAR (Electronic Data Gathering, Analysis, and Retrieval) service providers. The engagement of such services can be costly, and we may continue to incur additional financial losses, which may adversely affect our ability to continue as a going concern. In addition, the Sarbanes Oxley Act of 2002, as well as a variety of related rules implemented by the SEC, have required changes in corporate governance practices and generally increased the disclosure requirements of public companies. For example, as a result of being a reporting company, we are required to file periodic and current reports and other information with the SEC, and we have adopted policies regarding disclosure controls and procedures and regularly evaluate those controls and procedures.\nThe additional costs we continue to incur in connection with being a reporting company (expected to be approximately a hundred thousand dollars per year) will continue to further stretch our limited capital resources. Due to our limited resources, we have to allocate resources away from other productive uses in order to continue to comply with our obligations as an SEC reporting company. Further, there is no guarantee that we will have sufficient resources to continue to meet our reporting and filing obligations with the SEC as they come due.\nIf securities or industry analysts do not publish research or reports, or publish unfavorable research or reports, about our business, our stock price and trading volume may decline.\nThe trading market for our common stock will rely in part on the research and reports that industry or financial analysts publish about us, our business, our markets and our competitors. We do not control these analysts. If securities analysts do not cover our common stock, the lack of research coverage may adversely affect the market price of our common stock. Furthermore, if one or more of the analysts who do cover us downgrade our stock, or if those analysts issue other unfavorable commentary about us or our business, our stock price would likely decline. If one or more of these analysts cease coverage of us or fails to regularly publish reports on us, we could lose visibility in the market, and interest in our stock could decrease, which in turn could cause our stock price or trading volume to decline and may also impair our ability to expand our business and attract new licensees.\nMarket and economic conditions may negatively impact our business, financial condition and share price.\nConcerns over inflation, energy costs, geopolitical issues, unstable global credit markets and financial conditions, and volatile oil prices have in the past led to periods of significant economic instability, diminished liquidity and credit availability, declines in consumer confidence and discretionary spending, diminished expectations for the global economy and expectations of slower global economic growth going forward, increased unemployment rates, and increased credit defaults. Our general business strategy may be adversely affected by any such economic downturns, volatile business environments and continued unstable or unpredictable economic and market conditions. If these conditions continue to deteriorate, or do not improve once they occur, it may make any necessary debt or equity financing by us more difficult to complete, more costly, and more dilutive. Failure to secure any necessary financing in a timely manner and on favorable terms could have a material adverse effect on our growth strategy, financial performance, and share price, and could require us to delay or abandon development or commercialization plans.\nFailure to adequately manage our planned aggressive growth strategy may harm our business or increase our risk of failure.\nFor the foreseeable future, we intend to pursue an aggressive growth strategy for the expansion of our operations through increased product development and marketing. Our ability to rapidly expand our operations will depend upon many factors, including our ability to work in a regulated environment, market value-added products effectively to our target markets, establish and maintain strategic relationships with suppliers, and obtain adequate capital resources on acceptable terms. Any restrictions on our ability to expand may have a materially adverse effect on our business, results of operations, and financial condition. Accordingly, we may be unable to achieve our targets for sales growth, and our operations may not be successful or achieve anticipated operating results.\nAdditionally, our growth may place a significant strain on our managerial, administrative, operational, and financial resources and our infrastructure. Our future success will depend, in part, upon the ability of our management to manage growth effectively. This will require us to, among other things:\n● implement additional management information systems;\n● further develop our operating, administrative, legal, financial, and accounting systems and controls;\n● hire additional personnel;\n● develop additional levels of management within our company;\n● locate additional office space;\n● maintain close coordination among our engineering, operations, legal, finance, sales and marketing, and client service and support organizations; and\n● manage our expanding international operations.\nAs a result, we may lack the resources to deploy our services on a timely and cost-effective basis. Failure to accomplish any of these requirements could impair our ability to deliver services in a timely fashion or attract and retain new licensees.\nIf we do not successfully implement any acquisition strategies, our operating results and prospects could be harmed.\nWe face intense competition within our industry for acquisitions of businesses, technologies and assets. In the future, such competition may become more intense. As such, even if we are able to identify an acquisition target that we would like to acquire, we may not be able to complete the acquisition on commercially reasonable terms, or at all, because of such competition. Furthermore, if we enter into negotiations that are not ultimately consummated, those negotiations could result in diversion of management time and significant out-of-pocket costs. Even if we are able to complete such acquisitions, we may additionally expend significant amounts of cash or incur substantial debt to finance them, which indebtedness could result in restrictions on our business and use of available cash. In addition, we may finance or otherwise complete acquisitions by issuing equity or convertible debt securities, which could result in dilution of our existing stockholders. If we fail to evaluate and execute acquisitions successfully, we may not be able to realize their benefits. If we are unable to successfully address any of these risks, our business, financial condition or operating results could be harmed.\nIf we make any acquisitions, they may disrupt or have a negative impact on our business.\nIf we make acquisitions in the future, funding permitting, which may not be available on favorable terms, if at all, we could have difficulty integrating the acquired company’s assets, personnel and operations with our own. We do not anticipate that any acquisitions or mergers we may enter into in the future would result in a change of control of us. In addition, the key personnel of the acquired business may not be willing to work for us. We cannot predict the effect any expansion may have on our core business. Regardless of whether we are successful in making an acquisition, the negotiations could disrupt our ongoing business, distract our management and employees and increase our expenses. In addition to the risks described above, acquisitions are accompanied by a number of inherent risks, including, without limitation, the following:\n● the difficulty of integrating acquired products, services or operations;\n● the potential disruption of the ongoing businesses and distraction of our management and the management of any acquired companies;\n● difficulties in maintaining uniform standards, controls, procedures and policies;\n● the potential impairment of relationships with employees, licensees, and customers as a result of any integration of new management personnel;\n● the potential inability or failure to achieve additional sales and enhance our licensee and customer base through cross-marketing of the products to new and existing licensees and customers;\n● the effect of any government regulations that relate to the business acquired;\n● potential unknown liabilities associated with acquired businesses or product lines, or the need to spend significant amounts to retool, reposition or modify the marketing and sales of acquired products or operations, or the defense of any litigation, whether or not successful, resulting from actions of the acquired company prior to our acquisition; and\n● potential expenses under the labor, environmental and other laws of various jurisdictions.\nOur business could be severely impaired if and to the extent that we are unable to succeed in addressing any of these risks or other problems encountered in connection with an acquisition, many of which cannot be presently identified. These risks and problems could disrupt our ongoing business, distract our management and employees, increase our expenses and adversely affect our results of operations.\nWe may apply working capital and future funding to uses that ultimately do not improve our operating results or increase the value of our securities.\nIn general, we have complete discretion over the use of our working capital and any new investment capital we may obtain in the future. Because of the number and variety of factors that could determine our use of funds, our ultimate expenditure of funds (and their uses) may vary substantially from our current intended operating plan for such funds.\nWe intend to use existing working capital and future funding to support the development of our products and services, product purchases in our wholesale distribution division, the expansion of our marketing, or the support of operations to educate our end users. We will also use capital for market and network expansion, acquisitions, and general working capital purposes. However, we do not have more specific plans for the use and expenditure of our capital. Our management has broad discretion to use any or all of our available capital reserves. Our capital could be applied in ways that do not improve our operating results or otherwise increase the value of a stockholder’s investment.\nOur websites may encounter technical problems and service interruptions.\nOur websites may in the future experience slower response times or interruptions as a result of increased traffic or other reasons. These delays and interruptions resulting from failure to maintain Internet service connections to our site could frustrate visitors and reduce our future web site traffic, which could have a material adverse effect on our business.\nThe sale of shares by our directors and officers may adversely affect the market price for our shares.\nSales of significant amounts of shares held by our officers and directors, or the prospect of such sales, could adversely affect the market price of our common stock. Our management’s stock ownership may discourage a potential acquirer from making a tender offer or otherwise attempting to obtain control of us, which in turn could reduce our stock price or prevent our stockholders from realizing a premium over our stock price.\nStockholders may be diluted significantly through our efforts to obtain financing and satisfy obligations through the issuance of additional shares of our common stock.\nWhenever possible, our board of directors will attempt to use non-cash consideration to satisfy obligations. In many instances, we believe that the non-cash consideration will consist of restricted shares of our common stock, or when shares are issued to our officers, directors and applicable consultants as compensation. Our board of directors has authority, without action or vote of the stockholders to issue all or part of the authorized but unissued shares of our common stock. In addition, we may attempt to raise capital by selling shares of our common stock, possibly at a discount to market. These actions will result in dilution of the ownership interests of existing stockholders, which may further dilute our common stock book value, and that dilution may be material. Such issuances may also serve to enhance existing management’s ability to maintain control of us because the shares may be issued to parties or entities committed to supporting existing management.\nIf we do not effectively manage our growth, our existing infrastructure may become strained, and we may be unable to increase revenue growth.\nOur past growth that we have experienced, and in the future may experience, may provide challenges to our organization, requiring us to expand our personnel and our operations. Future growth may strain our infrastructure, operations and other managerial and operating resources. If our business resources become strained, our earnings may be adversely affected, and we may be unable to increase revenue growth. Further, we may undertake contractual commitments that exceed our labor resources, which could also adversely affect our earnings and our ability to increase revenue growth.\nOur growth depends in part on the success of our strategic relationships with third parties.\nIn order to grow our business, we anticipate that we will need to continue to depend on our relationships with third parties, including our technology providers. Identifying such third parties, and negotiating and documenting relationships with them, requires significant time and resources. Our competitors may be effective in providing incentives to third parties to favor their products or services, over utilization of our products and services. In addition, acquisitions of our business partners by our competitors could result in a decrease in the number of our current and potential licensees and end users. If we are unsuccessful in establishing or maintaining our relationships with third parties, our ability to compete in the marketplace or to grow our revenue could be impaired and our results of operations may suffer. Even if we are successful, we cannot assure you that these relationships will result in increased use of our products or increased revenue.\nClaims, litigation, government investigations, and other proceedings may adversely affect our business and results of operations.\nAs a company offering a wide range of products and services, we are regularly subject to actual and threatened claims, litigation, reviews, investigations, and other proceedings, including proceedings relating to goods and services offered by us and by third parties, and other matters. Any of these types of proceedings, including currently pending proceedings as discussed herein, may have an adverse effect on us because of legal costs, disruption of our operations, diversion of management resources, negative publicity, and other factors. The outcomes of these matters are inherently unpredictable and subject to significant uncertainties. Determining legal reserves and possible losses from such matters involves judgment and may not reflect the full range of uncertainties and unpredictable outcomes. Until the final resolution of such matters, we may be exposed to losses in excess of the amount recorded, and such amounts could be material. Should any of our estimates and assumptions change or prove to have been incorrect, it could have a material effect on our business, consolidated financial position, results of operations, or cash flows. In addition, it is possible that a resolution of one or more such proceedings, including as a result of a settlement, could require us to make substantial future payments, prevent us from offering certain products or services, require us to change our business practices in a manner materially adverse to our business, requiring development of non-infringing or otherwise altered products or technologies, damaging our reputation, or otherwise having a material effect on our operations.\nWe have never paid or declared any dividends on our common stock.\nWe have never paid or declared any dividends on our common stock or preferred stock. Likewise, we do not anticipate paying, in the near future, dividends or distributions on our common stock. Any future dividends on our common stock will be declared at the discretion of our board of directors and will depend on, among other things, our earnings, our financial requirements for future operations and growth, and other facts as we may then deem appropriate. Since we do not anticipate paying cash dividends on our common stock, return on your investment, if any, will depend solely on an increase, if any, in the market value of our common stock.\nFor all of the foregoing reasons and others set forth herein, an investment in our securities involves a high degree of risk.",
    "item_1B": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot applicable.",
    "item_2": "ITEM 2. PROPERTIES\nWe lease office space at 2107 Wilson Blvd. Suite 530, Arlington, Virginia. In February 2020, we entered into a lease agreement with our landlord for approximately 3,666 square feet. The lease was effective February 1, 2020, and has a term of five years and six months. The initial monthly rent is $13,289, and the lease agreement provides for annual rent increases of approximately 2.7%. The amount of future guaranteed payments is $822,082. We terminated the employment of all of our employees working in the Arlington office space during our restructure completed in April 2021. On June 9, 2021, we reached a settlement with 2111 Wilson Boulevard, Inc. to terminate the lease effective June 2021 in exchange for a payment by us of $150,000. Following the settlement with 2111 Wilson Boulevard, Inc., as discussed above, we did not have any office leases as of September 30, 2021. Tom Wilkinson, the Company’s Chairman of the Board of Directors, provides us with the use of office space that he rents, located at 6836 Bee Caves Road, Building 1, Suite 279, Austin, TX 78746, which we use as our corporate headquarters. As of December 1, 2021, we entered into a month-to-month lease agreement with Mr. Wilkinson, under which we pay Mr. Wilkinson $500 per month in rent.",
    "item_3": "ITEM 3. LEGAL PROCEEDINGS\nSee “Litigation” in Note 7 - Commitments and Contingencies of the Notes to the Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K.",
    "item_4": "ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II",
    "item_5": "ITEM 5. MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur common stock is traded on the over-the-counter market and is quoted on the OTCQB Venture Market run by OTC Markets Group under the symbol “CLOK.”\nAs of December 16, 2021, there were 82,927,311 shares of our common stock issued and outstanding, and there were 1,127 holders of our common stock.\nDividends\nWe did not declare any dividends for the fiscal year ended September 30, 2021. Our board of directors does not intend to declare dividends in the foreseeable future. The declaration, payment, and amount of any future dividends will be made at the discretion our board of directors, and will depend upon, among other things, the results of our operations, cash flows and financial condition, operating and capital requirements, and other factors as our board of directors considers relevant. We currently expect to use all available funds to finance the future development and expansion of our business, and do not anticipate paying dividends on our common stock in the foreseeable future.\nTransfer Agent\nThe Transfer Agent and Registrar for our common stock is Pacific Stock Transfer Company located in Las Vegas, Nevada.\nRecent Sales of Unregistered Securities\nStock Issued for Cash\nBetween March 31, 2021 and April 16, 2021, we sold an aggregate of 55,549,615 shares of our common stock, and warrants to purchase an equal number shares of our common stock, for $0.18 per share of common stock sold, in a private placement. We received gross proceeds of from the private placement of $9,998,931, $8,558,339 net of issuance costs. The offer and sale of these securities were exempt from registration under Section 4(a)(2) of the Securities Act. The resale of the shares were registered under the Securities Act through the filing of a registration statement on Form S-1, which became effective on May 7, 2021.",
    "item_6": "ITEM 6. [RESERVED]",
    "item_7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis should be read in conjunction with our financial statements, including the notes thereto, appearing elsewhere in this Annual Report on Form 10-K.\nOur Business\nWe are developing products and services around our patented polymorphic encryption technology, which is designed to enable secure and private data transmission. Through a licensing program, we are offering our Polymorphic Encryption Core, or PEC, which we believe to be the first secure commercially viable, advanced polymorphic data-in-motion product that is designed to be used in any commercial data security industry or in sensitive applications. To supplement our potential licensing revenue, we are building our own applications that leverage our PEC. We believe that our innovative and patented polymorphic technology provides resistant and performant solutions to the problem of quantum cracking through rapid deployment of our quantum encryption algorithm, which has been approved by the National Institute of Standards and Technology.\nWe anticipate that our operating expenses for the next twelve months will require between $2.5 and $3.5 million of cash, which will come from the net proceeds we received from a private placement of our securities held between March 31, 2021 and April 16, 2021. We intend to manage our business such that our current cash reserves will allow us to reach positive cash flow from our operations, but we cannot assure you that will occur. Our proposed approach to managing our cash will initially emphasize demonstrating our products’ capabilities with our current customers. We will follow those efforts with using our remaining cash to scale all of our functional areas, including product development, marketing, sales, customer support, and administration.\nWe intend to focus our product development efforts on building new software and services to work with our existing core technology, while continuing to support our existing licensees. These efforts will require more personnel, as well as more infrastructure. We expect the increase in product development activities will require approximately $1.0 million of our cash over the next 12 months. We plan to build the infrastructure we need to perform these new functions on modern technology, with scale and reliability. We plan to utilize cloud services to provide our customers with an interface that modern software provides, but also an ease of use that we believe encryption technologies desperately need. We believe that, if we are able to build our infrastructure, as described above, we will have a competitive advantage over most other participants in our market.\nWe intend to have our sales and marketing efforts emphasize qualified lead generation, using very focused industry messaging and engagement. We plan to participate in relevant cybersecurity and quantum computing industry events. We have also formed a board of advisors designed to help us identify the correct product focus areas and market segmentation. This board of advisors includes professionals from cybersecurity, technology business development and software marketing. We estimate that the expenses we will incur for sales and marketing during the next fiscal year will range between $500,000 and $750,000.\nOur administration costs are currently minimal. However, we expect that we will have to increase these costs if we are able to generate sufficient revenues and hire additional employees. Our administrative resources will have to be increased according to our demand to support our employees, increase accounting capacities, and expand our reporting and compliance capabilities. We expect that we will need additional personnel in our accounting and human resources functions to support these expected staff additions. We also plan to add software tools to help us manage our internal processes.\nWe expect that we will need to add customer support teams if and when potential customers adopt each of our product offerings. We project the costs of customer support for our fiscal year 2022 will likely range from $100,000 to $300,000. We believe that these funds will be used primarily for salaries and technology to support these efforts. These expenses will be included in our cost of goods sold.\nCritical Accounting Policies\nOur financial statements are prepared in accordance with accounting principles generally accepted in the United States of America (GAAP). The preparation of these financial statements requires the use of estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent liabilities at the date of the financial statements and the reported amount of revenues and expenses during the reporting period. Our management periodically evaluates the estimates and judgments made. Our management bases its estimates and judgments on historical experience and on various factors that are believed to be reasonable under the circumstances. Actual results may differ from these estimates as a result of different assumptions or conditions.\nThe methods, estimates, and judgment we use in applying our most critical accounting policies have a significant impact on the results we report in our financial statements. The SEC has defined “critical accounting policies” as those accounting policies that are most important to the portrayal of our financial condition and results and require us to make our most difficult and subjective judgments, often as a result of the need to make estimates of matters that are inherently uncertain. Based upon this definition, our most critical estimates are accounting for software revenue recognition, and stock issued to employees and non-employees. Our most critical accounting policies applicable to the periods presented are noted below. For additional information see Note 3 Significant Accounting Policies in the notes to our financial statements appearing elsewhere in this report. Although we believe that our estimates and assumptions are reasonable, they are based upon information presently available, and actual results may differ significantly from these estimates.\nOur critical accounting policies and estimates are those related to revenue recognition, deferred income taxes, accounting for share-based payments, and litigation.\nRevenue Recognition. We adopted the new accounting revenue standard for revenue recognition, effective October 1, 2018, using the modified retrospective transition method applied to those contracts that were not completed as of October 1, 2018. We present our results for reporting periods beginning after October 1, 2018 under this new guidance, while prior period amounts are not adjusted and continue to be reported in accordance with our historic accounting under previous revenue guidance. See Note 3 Significant Accounting Policies in the notes to our financial statements appearing elsewhere in this report.\nOur contracts with customers often include promises to transfer multiple products and services to a customer. Our determination whether products and services are considered distinct performance obligations that should be accounted for separately, versus together, may require significant judgment.\nOur judgment is required to determine the standalone selling price, or SSP, for each distinct performance obligation. For products and services aside from maintenance and support, we estimate SSP by adjusting the list price by historical discount percentages. SSP for software and hardware maintenance and support fees is based on the stated percentages of the fees charged for the respective products.\nOur perpetual and term software licenses have significant standalone functionality, and therefore revenue allocated to these performance obligations are recognized at a point in time upon electronic delivery of the download link and the license keys. For certain arrangements, we recognize revenue based upon usage or ratably over the term of the arrangement.\nOur product maintenance and support services are satisfied over time, as they are stand-ready obligations throughout the support period. As a result, we defer revenues associated with maintenance services and recognize the revenue ratably over the term of the applicable contract.\nWe recognize revenues associated with professional services upon customer acceptance.\nAccounting for Share-Based Payments. As discussed further in Note 8 (Stockholders Equity (Deficit)) to our financial statements appearing elsewhere in this report, we account for share-based awards in accordance with the authoritative guidance issued by the FASB on stock compensation.\nWe have used and expect to continue to use the Black-Scholes option-pricing model to compute the estimated fair value of share-based compensation expense. The Black-Scholes option-pricing model includes assumptions regarding dividend yields, expected volatility, expected option term and risk-free interest rates. The assumptions used in computing the fair value of share-based compensation expense reflect our best estimates, but involve uncertainties relating to market and other conditions, many of which are outside of our control. We estimate expected volatility based primarily on historical daily price changes of our stock and other factors. The expected option term is the number of years that we estimate that the stock options will be outstanding prior to exercise. We determine the estimated expected term of the stock awards issued pursuant to SEC Staff Accounting Bulletin SAB No. 110. If we had used other assumptions or estimates, the share-based compensation expense that we recorded for the years ended September 30, 2019 and September 30, 2018 could have been materially different. Furthermore, if we use different assumptions or estimates in future periods, our share-based compensation expense could be materially impacted.\nPursuant to ASC 718-20-35-7, Repurchase or Cancellation of Equity Awards, we charge to equity the amount of cash or other assets transferred (or liabilities incurred) to repurchase an equity award, to the extent that the amount paid does not exceed the fair value of the equity instruments repurchased at the repurchase date. We recognize any excess of the repurchase price over the fair value of the instruments repurchased as additional compensation cost.\nFiscal Year Ended September 30, 2021 Compared to Fiscal Year Ended September 30, 2020\nOur revenue for the year ended September 30, 2021 was $15,417, a decrease of $32,566 from revenue of $47,983 for the year ended September 30, 2020. Our revenue recognized during the year ended September 30, 2021 was from sales that occurred during the prior fiscal year, with the revenue being recognized over the 12 months following the invoice as cash was collected from the applicable customers. We had no new sales during our fiscal year ended September 30, 2021, even though we were expecting sales during the period based upon information we received from our licenses. We did not record any cost of revenues for the years ended September 30, 2021 or September 30, 2020.\nOur general and administrative expenses decreased from $4,573,673 for the year ended September 30, 2020, to $2,597,881 for the year ended September 30, 2021. The decrease in general and administrative expenses in 2021, compared to 2020, primarily resulted from lower legal expenses of $845,228, an impairment gain related to our operating leases of $824,559, a decrease in payroll related expenses of $390,788, and decreases in various other office expenses of $139,775, such as professional fees and subscriptions, partially offset by an increase in corporate insurance of $174,558.\nOur sales and marketing expenses decreased to $96,125 for the year ended September 30, 2021, from $710,595 for the year ended September 30, 2020. The decrease in sales and marketing expenses was primarily due to a decrease in payroll expense of $323,904, a decrease in consulting of $192,650, a decrease in marketing costs of $59,301 and a decrease in travel related expenses of $38,615.\nOur research and development expenses decreased to $616,746 for the year ended September 30, 2021, from $1,689,455 for the year ended September 30, 2020. The decrease in research and development expenses was primarily due to a decrease in consulting expense of $771,125 and a decrease in payroll expense of $301,584.\nOur total other income increased to $191,052 for the year ended September 30, 2021, from $44,332 of other expense for the year ended September 30, 2020. The income resulted from the partial forgiveness of our PPP loan. Our other expenses for the year ended September 30, 2020 was the result of losses be recognized on the disposal of some of our fixed assets.\nWe had a net loss of $3,104,283 for the year ended September 30, 2021, compared to a net loss of $6,970,072 for the year ended September 30, 2020. The decrease in our net loss was due to a significant reduction in expenses during the latter half of the year ended September 30, 2020.\nLiquidity and Capital Resources\nWe had an accumulated deficit as of September 30, 2021 of $71,530,891. We expect to continue to generate operating losses until we can generate revenues sufficient to exceed our operating expenses. As of September 30, 2021, we had $5,783,994 in cash. We believe that our existing cash balances are sufficient to fund our operations for the next 12 months.\nCash Flows\nThe following table summarizes, for the periods indicated, selected items in our Statements of Cash Flows:\nYear Ended September 30,\nNet cash (used in) provided by:\nOperating activities $ (3,630,806 ) $ (6,646,091 )\nInvesting activities $ - $ (28,972 )\nFinancing activities $ 8,334,961 $ (84,570 )\nOperating Activities\nFor the year ended September 30, 2021, we used $3,630,806 in operating activities, primarily attributable to our net loss of $3,104,283 during the period and negative non-cash items of $633,649, which were partially offset by a net positive change in net operating assets and liabilities of $107,126. Our non-cash items primarily consisted of an of impairment loss of $441,597 related to an operating lease that was terminated, and forgiveness of our PPP loan of $192,502. The change in our net operating assets and liabilities was primarily due to an increase in prepaid and other assets of $511,408, offset by an increase in accounts payable and accrued liabilities of $618,951. We used cash during the year to pay for the cost of general and administrative, sales and marketing, and research and development activities, totaling $3,310,752.\nFor the year ended September 30, 2020, we used $6,646,091in cash in operating activities, primarily attributable to our net loss of $6,970,072, non-cash items of $640,433 and a net change in net operating assets and liabilities of $316,452. Non-cash items primarily consisted of an impairment loss of $382,961 related to the termination of operating leases, stock compensation expense of $194,896, a net loss on disposal of assets of $44,332 and depreciation of $18,243. The change in our net operating assets and liabilities was primarily due to an increase in prepaid and other assets of $322,912 and an increase in accounts payable and accrued liabilities of $6,460. We used cash during the year to pay for the cost of general and administrative, sales and marketing, and research and development activities, which combined to be $6,973,723.\nInvesting Activities\nWe used no cash in investing activities for the year ended September 30, 2021. For the year ended September 30, 2020, we used $28,972 of cash in investing activities, attributable to purchases of property and equipment.\nFinancing Activities\nFor the year ended September 30, 2021, we received $8,334,961 in cash from financing activities, primarily derived from the net proceeds from our capital raise of $8,558,339 offset by a repayment of $173,378 of our PPP loan and payments for the repurchase of treasury stock and preferred stock of $40,000 and $10,000, respectively.\nFor the year ended September 30, 2020, we used $84,570 in cash due to financing activities, primarily due to a payment $450,000 we made for the repurchase of treasury stock, partially offset by the proceeds from the PPP loan of $365,430.\nOff-Balance Sheet Arrangements\nWe did not have during the periods presented, nor do we currently have, any off-balance sheet arrangements as defined under applicable SEC rules.",
    "item_7A": "ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nThe Company is not required to provide the information required by this Item as it is a “smaller reporting company,” as defined in Rule 229.10(f)(1).",
    "item_8": "ITEM 8. FINANCIAL STATEMENTS\nCIPHERLOC CORPORATION\nPage\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nFINANCIAL STATEMENTS:\nBalance Sheets as of September 30, 2021 and 2020\nStatements of Operations for the years ended September 30, 2021 and 2020\nStatements of Stockholders’ Equity (Deficit) for the years ended September 30, 2021 and 2020\nStatements of Cash Flows for the years ended September 30, 2021 and 2020\nNOTES TO FINANCIAL STATEMENTS\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nStockholders of Cipherloc Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Cipherloc Corporation (the “Company”) as of September 30, 2021, and 2020, and the related statements of operations, stockholders’ equity (deficit), and cash flows for each of the years in the two-year period ended September 30, 2021, and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2021, and 2020, and the results of its operations and its cash flows for each of the years in the two-year period ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (“PCAOB”) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\n/s/ Briggs & Veselka Co.\nWe have served as the Company’s auditor since 2019.\nHouston, Texas\nDecember 28, 2021\nCIPHERLOC CORPORATION\nBALANCE SHEETS\nSeptember 30, 2021 September 30, 2020\nASSETS\nCurrent assets\nCash $ 5,783,994 $ 1,079,839\nDeferred costs 180,0000 -\nPrepaid expenses 279,832 258,424\nTotal current assets 6,243,826 1,338,263\nOther assets - 200,000\nOperating lease ROU asset - 291,140\nDeferred costs 510,000 -\nTotal assets $ 6,753,826 $ 1,829,403\nLIABILITIES & STOCKHOLDERS’ EQUITY (DEFICIT)\nCurrent liabilities\nAccounts payable and accrued liabilities $ 1,462,732 $ 840,234\nAccrued compensation 25,000 10,000\nOperating lease liability - current portion - 132,608\nPaycheck protection program loan - current portion - 216,902\nDeferred revenue - 15,417\nTotal current liabilities 1,487,732 1,215,161\nPaycheck protection program loan - long term - 148,528\nOperating lease liability - long-term portion - 603,676\nTotal liabilities 1,487,732 1,967,365\nCommitments and contingencies\nSeries A convertible preferred stock, $0.01 par value, 10,000,000 shares\nauthorized; nil and 1,000,000 shares issued and outstanding as of September 30, 2021 and September 30, 2020, respectively - 10,000\nCommon stock, $0.01 par value, 681,000,000 shares authorized; 82,927,311\nand 27,505,196 shares outstanding; and 96,342,125 and 40,792,510 issued as of\nSeptember 30, 2021 and September 30, 2020, respectively 963,421 407,925\nTreasury stock, at cost, 13,414,814 and 13,287,314 shares as of September 30, 2021 and September 30, 2020, respectively (590,000 ) (550,000 )\nAdditional paid-in capital 76,423,564 68,420,721\nAccumulated deficit (71,530,891 ) (68,426,608 )\nTotal stockholders’ equity (deficit) 5,266,094 (137,962\nTotal liabilities and stockholders’ equity (deficit) $ 6,753,826 $ 1,829,403\nThe accompanying notes are an integral part of these financial statements.\nCIPHERLOC CORPORATION\nSTATEMENTS OF OPERATIONS\nFor the Year Ended\nSeptember 30,\nRevenues $ 15,417 $ 47,983\nCost of revenues - -\nGross profit 15,417 47,983\nOperating expenses:\nGeneral and administrative 2,597,881 4,573,673\nSales and marketing 96,125 710,595\nResearch and development 616,746 1,689,455\nTotal operating expenses 3,310,752 6,973,723\nOperating loss (3,295,335 ) (6,925,740 )\nOther (expenses) income:\nLoss on disposal of asset - (44,332 )\nPaycheck Protection Program Forgiveness Income 192,052 -\nInterest expense (1,000 ) -\nTotal other income (expense), net 191,052 (44,332 )\nNet loss $ (3,104,283 ) $ (6,970,072 )\nNet loss per common share - Basic and diluted: $ (0.05 ) $ (0.18 )\nWeighted average common shares outstanding - Basic and diluted 54,864,945 39,495,185\nThe accompanying notes are an integral part of these financial statements.\nCIPHERLOC CORPORATION\nSTATEMENTS OF STOCKHOLDERS’ EQUITY (DEFICIT)\nFOR THE YEARS ENDED SEPTEMBER 30, 2021, AND 2020\nShares Amount Shares Issued Amount Treasury Stock Paid-in Capital Accumulated Deficit Equity (Deficit)\nPreferred Stock Common Stock\nAdditional\nStockholders’\nShares Amount Shares Issued Amount Treasury Stock Paid-in Capital Accumulated Deficit Equity (Deficit)\nBalance at, September 30, 2019 1,000,000 $ 10,000 40,792,510 $ 407,925 $ - $ 68,225,825 $ (61,456,536 ) $ 7,187,217\nStock option issued to directors and officers - - - -\n194,896 - 194,896\nTreasury shares acquired - - - - (550,000 ) - - (550,000\nPreferred and treasury shares acquired\nPreferred and treasury shares acquired, shares\nIssuance of common stock for cash, net of issuance costs\nIssuance of common stock for cash, net of issuance costs, shares\nNet loss - - - -\n- (6,970,072 ) (6,970,072 )\nBalance at September 30, 2020 1,000,000 $ 10,000 40,792,510 $ 407,925 $ (550,000 ) $ 68,420,721 $ (68,426,608 ) $ (137,962 )\nPreferred and treasury shares acquired (1,000,000 ) (10,000 ) - - (40,000 ) - - (50,000 )\nIssuance of common stock for cash, net of issuance costs - - 55,549,615 555,496 - 8,002,843 - 8,558,339\nNet loss - - - -\n- (3,104,283 ) (3,104,283 )\nBalance at September 30, 2021 - $ - 96,342,125 $ 963,421 $ (590,000 ) $ 76,423,564 $ (71,530,891 ) $ 5,266,094\nThe accompanying notes are an integral part of these financial statements.\nCIPHERLOC CORPORATION\nSTATEMENTS OF CASH FLOWS\nFor the Year Ended\nSeptember 30,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet loss $ (3,104,283 ) $ (6,970,072 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nDepreciation - 18,244\nStock-based compensation - 194,896\nImpairment loss on ROU assets (gain on early termination of operating lease) (441,597 ) 382,961\nLoss on disposal of asset - 44,332\nPPP loan forgiveness income (192,052 ) -\nChanges in operating assets and liabilities:\nPrepaid expenses and other assets (511,408 ) (322,912 )\nAccounts payable and accrued liabilities 618,951 151,736\nAccrued compensation 15,000 (132,293 )\nDeferred revenue (15,417 ) (12,983 )\nNet cash used in operating activities (3,630,806 ) (6,646,091 )\nCASH FLOWS FROM INVESTING ACTIVITIES\nPurchase of fixed assets - (28,972 )\nNet cash used in investing activities - (28,972 )\nCASH FLOWS FROM FINANCING ACTIVITIES\nPurchase of treasury stock (40,000 ) (450,000 )\nProceeds from PPP loan - 365,430\nRepayment on PPP loan (173,378 ) -\nPurchase of preferred stock (10,000 ) -\nProceeds from the issuance of common stock, net of costs 8,558,339 -\nNet cash provided by (used in) financing activities 8,334,961 (84,570 )\nINCREASE (DECREASE) IN CASH 4,704,155 (6,759,633 )\nCASH, BEGINNING OF YEAR 1,079,839 7,839,472\nCASH, END OF YEAR $ 5,783,994 $ 1,079,839\nNON-CASH INVESTING AND FINANCING ACTIVITIES :\nCapitalization of ROU asset $ - $ 746,125\nST operating lease liability recorded $ - $ 61,264\nLT operating lease liability recorded $ - $ 684,861\nUnpaid treasury stock $ - 100,000\nThe accompanying notes are an integral part of these financial statements.\nCIPHERLOC CORPORATION\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2021, AND 2020\nNOTE 1 - DESCRIPTION OF BUSINESS\nCipherloc Corporation (the “Company” or “Cipherloc”) was incorporated in the State of Texas on June 22, 1953, under the name “American Mortgage Company.” Effective August 27, 2014, we changed our name to “Cipherloc Corporation.” Prior to September 30, 2021, the Company was a Texas corporation. The Company became a Delaware corporation effective September 30, 2021.\nOur headquarters are located at 6836 Bee Cave Road, Building 1, Suite279, Austin, Texas 78746. Our website is www.cipherloc.net.\nNOTE 2 - NEW EQUITY ISSUANCE\nFrom March 31, 2021, to April 16, 2021, we entered into a Securities Purchase Agreement (the “Purchase Agreement”), with certain accredited investors (the “Purchasers”), pursuant to which the Company sold the Purchasers an aggregate of (a) 55,549,615 shares of common stock (“Offering Shares”), and (b) warrants to purchase 55,549,615 shares of common stock of the Company (“Offering Warrants”). The Offering Shares and Offering Warrants were sold at a price of $0.18 per combined unit of an Offering Share and an Offering Warrant (the “Offering Price”), which was equal to 80% of the closing sales price of the Company’s common stock on the OTCQB Market on March 30, 2021, which was the last trading day prior to the initial closing under the Purchase Agreement.\nThe sale of the Offering Shares and Offering Warrants occurred at four closings as follows:\nSCHEDULE OF OFFERING SHARES AND OFFERING WARRANTS\nDate of Closing Shares Sold Warrants Sold Gross Proceeds\nMarch 31, 2021 35,757,942 35,757,942 $ 6,436,430\nApril 7, 2021 7,513,893 7,513,893 $ 1,352,501\nApril 9, 2021 8,683,336 8,683,336 $ 1,563,000\nApril 16, 2021 3,594,444 3,594,444 $ 647,000\nTotal 55,549,615 55,549,615 $ 9,998,931\nTotal gross proceeds from the offering of the Offering Shares and Offering Warrants (the “Private Placement”) were approximately $10 million (as shown above).\nPaulson Investment Company, LLC (the “Placement Agent”), served as placement agent for the Private Offering. The Company entered into a Placement Agent Agreement with the Placement Agent in connection therewith (the “Placement Agreement”, discussed below). As partial consideration for the services provided by the Placement Agent, the Company granted the Placement Agent and its assigns, warrants to purchase 8,332,439 shares of common stock (“Placement Warrants”, discussed in greater detail below).\nThe Company agreed to use the proceeds from the Private Placement for working capital purposes and not to use such proceeds: (a) for the satisfaction of any portion of the Company’s debt (other than (i) payment of trade payables in the ordinary course of the Company’s business and prior practices and (ii) the repayment of funds received by the Company under the “paycheck protection program” of the CARES Act), (b) for the redemption of any common stock or common stock equivalents, (c) for the settlement of any outstanding litigation, or (d) in violation of applicable regulations.\nIn connection with the Private Placement, each of our officers and directors entered into Lock-Up Agreements pursuant to which they agreed not to sell, offer, or transfer, any of our securities that they held for 180 days after the closing of the Private Placement, subject to customary exceptions.\nThe Offering Warrants, which are evidenced by Common Stock Purchase Warrants (the “Warrant Agreements”), have an exercise price of $0.36 per share (200% of the Offering Price), and may be exercised at any time after the grant date of the Offering Warrants (i.e., March 31, 2021, April 7, 2021, April 9, 2021, or April 16, 2021, as applicable), until five years thereafter. The Offering Warrants have cashless exercise rights that are exercisable if, when exercised, a registration statement registering the shares of the Company’s common stock issuable upon exercise thereof, is not then effective with the Securities and Exchange Commission. The exercise of each of the Offering Warrants is subject to a beneficial ownership limitation of 4.99%, preventing such exercise by the holder(s) thereof, if such exercise would result in such holder(s) and their affiliates, exceeding ownership of 4.99% of our common stock. The Offering Warrants contain anti-dilution rights such that, if we issue, or are deemed to have issued, common stock or common stock equivalents at a price less than the then exercise price of the Offering Warrants, the exercise price of the Offering Warrants is automatically reduced to such lower value, and the number of shares of common stock issuable upon exercise thereafter is adjusted proportionately so that the aggregate exercise price payable upon exercise of such Offering Warrants is the same prior to and after such reduction in exercise price.\nPursuant to a Registration Rights Agreement (“RR Agreement”), we agreed to file a registration statement to register the sale of the Offering Shares and the shares of common stock issuable upon exercise of the Warrants, prior to the tenth day after the end of the Private Offering (provided that the Placement Agent agreed that such ten day period began on April 19, 2021, regardless of the actual closing date of the Private Offering), and to obtain effectiveness of such registration statement by the 60th calendar day following the date of the RR Agreement (March 31, 2021)(provided that in the event we are required to file any additional registration statements under the RR Agreement, such required effectiveness date is the 90th day after such registration statement is required to be filed), which registration statement was timely filed and was timely declared effective.\nOn January 11, 2021, we entered into a Placement Agent Agreement with the Placement Agent, pursuant to which we engaged the Placement Agent as the Company’s exclusive placement agent in connection with the Private Offering. Pursuant to the Placement Agent Agreement, we agreed to pay the Placement Agent a cash commission of 13% of the gross proceeds received in the Private Offering ($1,334,861), and to grant the Placement Agent or its assigns, a warrant to purchase 15% of the Offering Shares sold in the Private Offering (i.e., warrants to purchase 8,332,439 shares in aggregate), which were granted to the Placement Agent effective on April 16, 2021. The warrants were priced at the issuance price of the Offering Shares in the Private Placement. The Placement Agent Agreement had a term expiring on August 31, 2021, and includes a three-year tail period, pursuant to which the Placement Agent is due the same fees payable in connection with the Private Offering, in the event the Company sells any securities to any investor or potential investor who received Private Offering documents as part of the Private Offering. In addition to the compensation payable upon completion of the Private Offering, the Company paid the Placement Agent a $35,000 cash retainer.\nThe Placement Warrants are evidenced by warrants similar to the Purchase Warrants, have a term of 10 years (i.e., through April 16, 2031), an exercise price of $0.18 per share (the Offering Price), and cashless exercise rights. We are required to pay the Placement Agent liquidated damages of $10 per day for each $1,000 of shares not timely delivered upon the exercise of the Placement Warrants. The Placement Warrants include a weighted average anti-dilution right in the event we issue any shares of common stock or equivalents with a value less than the then exercise price.\nOur management has evaluated the warrants for derivative status and concluded the warrants are freestanding equity instruments.\nNOTE 3 - SIGNIFICANT ACCOUNTING POLICIES\nThe Company prepares its financial statements in accordance with accounting principles generally accepted in the United States of America (“U.S. GAAP”). Significant accounting policies are as follows:\nUse of Estimates and Assumptions\nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect (i) the reported amounts of assets and liabilities, (ii) the disclosure of contingent assets and liabilities known to exist as of the date the financial statements are published, and (iii) the reported amount of net revenues and expenses recognized during the periods presented. Adjustments made with respect to the use of estimates often relate to improved information not previously available. Uncertainties with respect to such estimates and assumptions are inherent in the preparation of financial statements; accordingly, actual results could differ from these estimates.\nLegal\nThe Company is subject to legal proceedings, claims and liabilities which arise in the ordinary course of business. The Company accrues for losses associated with legal claims when such losses are probable and can be reasonably estimated. These accruals are adjusted as additional information becomes available or circumstances change. Legal fees are charged to expense as they are incurred.\nCash and Cash Equivalents and Concentration of Credit Risk\nThe Company considers all highly liquid investments with an original maturity of three months or less to be cash equivalents. The Company did not have any cash equivalents as of September 30, 2021 and 2020. As of September 30, 2021 and 2020, our cash included cash on hand and cash in the bank. The Company maintains its cash in accounts held by large, globally recognized banks which, at times, may exceed federally insured limits as guaranteed by the Federal Deposit Insurance Corporation (FDIC). The FDIC insures these deposits up to $250,000. As of September 30, 2021, $5,533,994 of the Company’s cash balance was uninsured. The Company has not experienced any losses on cash.\nLiquidity and Capital Resources\nThe Company had an accumulated deficit as of September 30, 2021 of $71,530,891. The Company expects to continue to generate operating losses until it can generate revenues sufficient to exceed its operating expenses. As of September 30, 2021, the Company had $5,783,994 in cash. The Company believes that its existing cash balances are sufficient to fund its operations for the next 12 months.\nFixed Assets\nFixed assets are recorded at cost and depreciation is provided over the estimated useful lives of the related assets using the straight-line method for financial statement purposes. Equipment and furniture are depreciated over an estimated useful life of three (3) to five (5) years. Leasehold improvements are depreciated over the lesser of the related lease term or a useful life of ten (10) years. Software is depreciated over an estimated useful life of three (3) years.\nThe Company does not have any fixed assets on its balance sheet as of September 30, 2021. The Company’s fixed assets were disposed of during 2020 as part of a downsizing and cash conservation effort.\nLong-Lived Assets\nLong-lived assets are evaluated for impairment whenever events or changes in our business circumstances indicate that the carrying amount of the assets may not be fully recoverable or that the useful lives of these assets are no longer appropriate. Each impairment test is based on a comparison of the undiscounted future cash flows to the recorded value of the asset. If impairment is indicated, the asset is written down to its estimated fair value. During the year ended September 30, 2020, the Company recorded an impairment loss of $382,961 related to its Virginia lease. In addition, the Company recorded a loss of $44,336 on the disposal of fixed assets.\nFair Value of Financial Instruments\nThe Company’s financial instruments consisted primarily of cash, accounts payable and accrued expenses, and embedded conversion features in stock warrants. The carrying amounts of such financial instruments approximate their respective estimated fair value due to the short-term maturities and approximate market interest rates of these instruments.\nFair value is focused on an exit price that would be received upon sale of an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. Within the measurement of fair value, the use of market-based information is prioritized over entity specific information and a three-level hierarchy for fair value measurements is used based on the nature of inputs used in the valuation of an asset or liability as of the measurement date.\nThe three-level hierarchy for fair value measurements is defined as follows:\n● Level 1 - inputs to the valuation methodology are quoted prices (unadjusted) for identical assets or liabilities in active markets;\n● Level 2 - inputs to the valuation methodology include quoted prices for similar assets and liabilities in active markets, and inputs that are observable for the asset or liability other than quoted prices, either directly or indirectly, including inputs in markets that are not considered to be active;\n● Level 3 - inputs to the valuation methodology are unobservable and significant to the fair value measurement.\nThe fair values of the embedded conversion features in the warrants issued by the Company were determined using level 2 measurements and are discussed in further detail in Note 8.\nCustomer Concentration\nDuring the year ended September 30, 2021, two customers accounted for 100% of the Company’s revenues. During the year ended September 30, 2020, two customers also accounted for 100% of the Company’s revenues.\nRevenue Recognition\nThe Company recognizes revenues in accordance with the provisions of Accounting Standards Update 2014-09, “Revenue from Contracts with Customers,” and a series of amendments which together we identify as “ASC Topic 606”. This new accounting standard, which we adopted on October 1, 2018, using the permitted modified retrospective method, outlines a single comprehensive model for entities to use in accounting for revenues arising from contracts with customers. The new standard supersedes most previous revenue recognition guidance, including industry-specific guidance. The effect of the adoption of ASC Topic 606 on retained earnings as of October 1, 2018, was not material. The differences between our reported operating results for the twelve months ended September 30, 2020, which reflect the application of the new standard on our contracts, and the results that would have been reported if the accounting was performed pursuant to the accounting standards previously in effect, also were not material.\nCentral to the new revenue recognition guidance is a five-step revenue recognition model that requires reporting entities to:\n1. Identify the contract,\n2. Identify the performance obligations of the contract,\n3. Determine the transaction price of the contract,\n4. Allocate the transaction price to the performance obligations, and\n5. Recognize revenue.\nThe Company accounts for a promise to provide a customer with a right to access the Company’s intellectual property as a performance obligation satisfied over time because the customer will simultaneously receive and consume the benefit from the entity’s performance of providing access to its intellectual property as the performance occurs.\nNature of Products and Services\nLicenses for on-premises software provide the customer with a right to use the software as it exists when made available to the customer. Customers may purchase perpetual licenses or subscribe to licenses, which provide customers with the same functionality and differ mainly in the duration over which the customer benefits from the software. Revenue from distinct on-premises licenses is recognized upfront at the point in time when the software is made available to the customer. In cases where the license is being modified at the direction of the customer the revenue is being recognized ratably over the term of the arrangement. Revenue allocated to software maintenance and support services is recognized ratably over the contractual support period.\nProfessional services are primarily related to software implementation services and associated revenue is recognized upon customer acceptance.\nContract Balances\nTiming of revenue recognition may differ from the timing of invoicing to customers. The Company records a contract asset or receivable when revenue is recognized prior to invoicing, or unearned revenue when revenue is recognized subsequent to invoicing. For perpetual licenses with multi-year product maintenance agreements, the Company generally invoices customers at the beginning of the coverage period. For multi-year subscription licenses, the Company generally invoices customers annually at the beginning of each annual coverage period. The Company records a contract asset related to revenue recognized for multi-year on-premises licenses as its right to payment is conditioned upon providing product support and services in future years.\nThere were no accounts receivable balances on September 30, 2021, and 2020. There was no adjustment needed to the accounts receivable for the cumulative effect of applying ASC 606 under the modified retrospective method. There was no impact on the opening balance contract assets and liabilities, for the cumulative effect of applying ASC 606 under the modified retrospective method as of October 1, 2018.\nDeferred revenue is comprised mainly of unearned revenue related maintenance and technical support on term and perpetual licenses. Maintenance and technical support revenue are recognized ratably over the coverage period. Deferred revenue also includes contracts for professional services to be performed in the future which are recognized as revenue when the company delivers the related service pursuant to the terms of the customer arrangement.\nChanges in deferred revenue were as follows:\nSCHEDULE OF CHANGES IN DEFERRED REVENUE\nYear Ended September 30, 2021\nBalance on September 30, 2020 $ 15,417\nDeferral of revenue -\nRecognition of revenue (15,417 )\nBalance at September 30, 2021 $ -\nYear Ended September 30, 2020\nBalance on September 30, 2019 $ 28,400\nDeferral of revenue 35,000\nRecognition of revenue (47,983 )\nBalance at September 30, 2020 $ 15,417\nDeferred revenue includes invoiced revenue allocated to remaining performance obligations that has not yet been recognized and will be recognized as revenue in future periods. Deferred revenue was zero as of September 30, 2021.\nPayment terms and conditions vary by contract type, although terms generally include a requirement of payment within 30 to 90 days. In instances where the timing of revenue recognition differs from the timing of invoicing, the Company has determined its contracts generally do not include a significant financing component. The primary purpose of the Company’s invoicing terms is to provide customers with simplified and predictable ways of purchasing its products and services, not to receive financing from our customers or to provide customers with financing. Examples include invoicing at the beginning of a subscription term with maintenance and support revenue recognized ratably over the contract period, and multi-year on-premises licenses that are invoiced annually with product revenue recognized upon delivery.\nSignificant Judgments\nThe Company’s contracts with customers often include promises to transfer multiple products and services to a customer. Determining whether products and services are considered distinct performance obligations that should be accounted for separately versus together may require significant judgment.\nJudgment is required to determine the standalone selling price (“SSP”) for each distinct performance obligation. For products and services aside from maintenance and support, the Company estimates SSP by adjusting the list price by historical discount percentages. SSP for software and hardware maintenance and support fees is based on the stated percentages of the fees charged for the respective products. The Company’s perpetual and term software licenses may have significant standalone functionality and therefore revenue allocated to these performance obligations are recognized at a point in time upon electronic delivery of the download link and the license keys. In cases where the license is being modified at the direction of the customer the revenue is being recognized ratably over the term of the arrangement. Product maintenance and support services are satisfied over time as they are stand-ready obligations throughout the support period. As a result, revenues associated with maintenance services are deferred and recognized as revenue ratably over the term of the contract.\nRevenues associated with professional services are recognized at a point in time upon customer acceptance.\nAssets Recognized from Costs to Obtain a Contract with a Customer\nThe Company recognizes an asset for the incremental costs of obtaining a contract with a customer if it expects the benefit of those costs to be longer than one year. The Company has determined that its sales commission program meets the requirements for cost capitalization. Total capitalized costs to obtain a contract were immaterial during the periods presented. The Company applies a practical expedient to expense costs as incurred for costs to obtain a contract with a customer when the amortization period would have been one year or less.\nSoftware license revenue is generally recognized when a signed contract or other persuasive evidence of an arrangement exists, the software has been electronically delivered, the license fee is fixed or is measured on a paid user basis, and collection of the resulting receivable is probable. When contracts contain multiple elements wherein Vendor-Specific Objective Evidence (“VSOE”) exists for all undelivered elements, we account for the delivered elements in accordance with the “Residual Method.” VSOE of fair value for maintenance and support is established by a stated renewal rate, if substantive, included in the license arrangement or rates charged in stand-alone sales of maintenance and support. Revenue from subscription license agreements, which include software, rights to unspecified future products and maintenance, is recognized ratably over the term of the subscription period. When the fair value of VSOE of post contract customer support cannot be determined, the revenue is recognized ratably over the contract period. The only remaining undelivered element was post contract support services, and accordingly, the revenues were recognized on a pro rata basis prospectively over the terms of the related contracts. Deferred revenue results from fees billed to or collected from customers for which revenue has not yet been recognized.\nThe Company had deferred revenue of zero and $15,417 as of September 30, 2021 and 2020, respectively.\nResearch and Development and Software Development Costs\nThe Company expenses all research and development costs, including patent and software development costs. Our research and development costs incurred for the years ended September 30, 2021 and 2020 were $616,746 and $1,689,455, respectively.\nStock-Based Compensation\nThe Company measures the cost of services provided by employees and non-employees in exchange for an award of an equity instrument based on the grant-date fair value of the award. The Company granted stock options during the year ended September 30, 2020, but those awards were subsequently forfeited. The Company had both fully vested stock grants and stock options granted to employees and non-employees during the year ended September 30, 2019. As such, the Company recognized compensation cost for grants, as well as a ratable portion for the stock options vesting over a three-year time frame during the years ended September 30, 2019 and 2020; however, no vesting occurred during fiscal year 2021 for these awards due to separation of employment by these employees during fiscal year 2020.\nThe Company made no award grants during the year ended September 30, 2021.\nThe Company accounts for share-based payments in accordance with the authoritative guidance issued by the FASB on share-based compensation, which establishes the accounting for transactions in which an entity exchanges its equity instruments for goods or services. Under the provisions of the authoritative guidance, share-based compensation expense is measured at the grant date, based on the fair value of the award, and is recognized as an expense over the requisite employee service period (generally the vesting period), net of actual forfeitures. The Company estimates the fair value of share-based payments using the Black-Scholes option-pricing model. Additionally, share-based awards to non-employees are expensed over the period in which the related services are rendered at their fair value. All share-based awards are expected to be fulfilled with new shares of common stock.\nUnder ASC 718-20-35-7, Repurchase or Cancellation of equity awards, the amount of cash or other assets transferred (or liabilities incurred) to repurchase an equity award shall be charged to equity, to the extent that the amount paid does not exceed the fair value of the equity instruments repurchased at the repurchase date. Any excess of the repurchase price over the fair value of the instruments repurchased shall be recognized as additional compensation cost.\nIncome Taxes\nThe Company utilizes the asset and liability method in accounting for income taxes. Under this method, deferred tax assets and liabilities are recognized for operating loss and tax credit carryforwards and for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the year in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in the results of operations in the period that includes the enactment date. A valuation allowance is recorded to reduce the carrying amounts of deferred tax assets unless it is more likely than not that the value of such assets will be realized.\nThe Company uses the two-step approach to recognize and measure uncertain tax positions. The first step is to evaluate the tax position for recognition by determining if the weight of available evidence indicates it is more likely than not, that the position will be sustained on audit, including resolution of related appeals or litigation processes, if any. The second step is to measure the tax benefit as the largest amount, which is more than 50% likely of being realized upon ultimate settlement. The Company considers many factors when evaluating and estimating the Company’s tax positions and tax benefits, which may require periodic adjustments. The Company did not record any liabilities for uncertain tax positions during the years ended September 30, 2021, or 2020.\nBasic and Diluted Net Loss per Common Share\nBasic loss per share is computed by dividing net loss available to common stockholders by the weighted average number of common shares outstanding during the reporting period. The weighted average number of shares is calculated by taking the number of shares outstanding and weighting them by the amount of time that they were outstanding. Diluted earnings per share reflects the potential dilution that could occur if stock options, warrants, and other commitments to issue common stock were exercised or equity awards vest resulting in the issuance of common stock that could share in the earnings of the Company. During the year ended September 30, 2021, 87,628,920 warrants were exclude from the calculation of diluted loss per share because their effect would be anti-dilutive.\nDiluted loss per share is the same as basic loss per share during periods where net losses are incurred since the inclusion of the potential common stock equivalents would be anti-dilutive as a result of the net loss. During the year ended September 30, 2020, 23,746,866 warrants, 800,000 stock options and 1,000,000 shares of convertible preferred stock were excluded from the calculation of diluted loss per share because their effect would be anti-dilutive. As of September 30, 2021, the Company had purchased the 1,000,000 shares of preferred stock outstanding which were outstanding as of September 30, 2020.\nRecent Accounting Announcements\nThe Financial Accounting Standards Board (“FASB”) issues Accounting Standards Updates (“ASU”) to amend the authoritative literature in the ASC. There have been several ASUs to date that amend the original text of the ASCs. Other than those discussed below, the Company believes those ASUs issued to date either (i) provide supplemental guidance, (ii) are technical corrections, (iii) are not applicable to the Company or (iv) are not expected to have a significant impact on the Company.\nIn December 2019, the FASB issued ASU 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes. This guidance removes certain exceptions to the general principles in Topic 740 and enhances and simplifies various aspects of the income tax accounting guidance, including requirements such as tax basis step-up in goodwill obtained in a transaction that is not a business combination, ownership changes in investments, and interim-period accounting for enacted changes in tax law. This standard is effective for fiscal years and interim periods within those fiscal years beginning after December 15, 2020. Early adoption is permitted. The Company are currently evaluating the impact of ASU 2019-12 on its financial statements, which is effective for the Company in its fiscal year and interim periods beginning on October 1, 2021.\nIn August 2018, the FASB issued ASU 2018-13, Fair Value Measurements (Topic 820) - Disclosure Framework - Changes to the Disclosure Requirements for Fair Value Measurement, to modify the disclosure requirements for fair value measurements. The ASU removes certain disclosure requirements related to transfers between fair value hierarchy levels and valuation processes for Level 3 fair value measurements. It modifies certain disclosure requirements for investments in entities that calculate net asset value. It adds certain disclosure requirements regarding gains and losses for recurring Level 3 fair value measurements and unobservable inputs used to develop Level 3 fair value measurements. ASU 2018-13 is effective for fiscal years, and interim periods within those fiscal years, beginning after December 15, 2019. The Company adopted ASU 2018-13 on October 1, 2019, and the adoption of this update did not have a material impact on the Company’s notes to the financial statements.\nIn June 2018, the FASB issued ASU 2018-07, Compensation - Stock Compensation (Topic 718) - Improvements to Nonemployee Share-Based Payment Accounting, to expand the scope of Topic 718, Compensation - Stock Compensation, which currently only includes share-based payments to employees, to include share-based payments issued to nonemployees for goods or services. Thus, accounting for share-based payments to nonemployees and employees will be substantially aligned. ASU 2018-07 is effective for fiscal years, and interim periods within those fiscal years, beginning after December 15, 2018. The Company adopted ASU 2018-07 on October 1, 2019, and the adoption of this update did not have a material impact on the Company’s financial position, results of operations and cash flows.\nIn February 2016, the FASB issued ASU 2016-02, Leases, which aims to make leasing activities more transparent and comparable and requires substantially all leases be recognized by lessees on their balance sheet as a right-of-use asset (ROU) and corresponding lease liability, including leases currently accounted for as operating leases. Leases of mineral reserves and related land leases have been exempted from the standard. We adopted ASU 2016-02, Leases, on October 1, 2019. We elected the “package of practical expedients” within the standard which permits us not to reassess prior conclusions about lease identification, lease classification and initial direct costs. We made an accounting policy election to not separate lease and non-lease components for all leases. The adoption of this standard resulted in the recognition of right-of-use assets and lease liabilities of $0.2 million, which were not previously recorded on our balance sheet.\nNOTE 4 - SOFTWARE LICENSES\nSoftware License Agreements\nDuring fiscal year 2019, the Company entered into a one-year agreement with SoundFi LLC (“SoundFi”) which will automatically renew for subsequent one-year periods unless otherwise terminated by either party. Cipherloc received $25,000 from SoundFi during the year ended September 30, 2020.\nThe Company executed an annual software licensing agreement with Castle Shield during the year ended September 30, 2020, which also include auto-renewing terms. Castle Shield made a $10,000 payment to the Company based on the terms of their agreement with Cipherloc.\nDuring the years ended September 30, 2021, and 2020, the Company recognized $15,417 and $47,983, respectively, in licensing revenue from the SoundFi and Castle Shield agreements.\nNOTE 5 - DEBT\nOn April 6, 2020, to supplement its cash balance, the Company submitted their application for a Paycheck Protection Program (“PPP”) loan (the “SBA loan”) sponsored by the U.S. Small Business Administration in the amount of $365,430. On April 12, 2020, Company’s SBA loan application was approved on April 12, 2020, and the Company received loan proceeds on April 22, 2020. The SBA loan had an interest rate of 1% and was scheduled to mature on April 12, 2022.\nSection 1106 of the Coronavirus Aid, Relief, and Economic Security Act (“CARES Act”) provides for forgiveness of up to the full principal amount of qualifying loans guaranteed under the PPP. The PPP and loan forgiveness are intended to provide economic relief to small businesses, such as the Company, that are adversely impacted under the COVID-19 Emergency Declaration issued by President Donald J. Trump on March 13, 2020.\nThe Paycheck Protection Program loan balance at September 30, 2020, was $365,430. The Company filed for partial loan forgiveness on January 29, 2021, which was approved in the amount of $192,052 on June 11, 2021. The staff reductions that occurred in 2020 prevented the Company from qualifying for full forgiveness of its principal balance.\nThe full principal balance of the loan, plus $1,000 of interest was set aside in an escrow account at Texas Capital Bank on April 15, 2021. Upon receipt of the partial forgiveness approval, the remaining amount of the Paycheck Protection Program Loan was repaid using funds in the escrow account and the remaining balance was returned to the Company’s operating account. The balance of the loan was $0 as of September 30, 2021.\nNOTE 6 - RELATED PARTY TRANSACTIONS\nNo related party transactions occurred during the years ending September 30, 2021 and September 30, 2020 other than those disclosed in Note 7.\nNOTE 7 - COMMITMENTS AND CONTINGENCIES\nLitigation\nThe Company is currently not involved in any litigation that it believes could have a material adverse effect on its financial condition or results of operations.\nCurrently Pending Litigation\nIn December 2017, Robert LeBlanc, filed a petition against the Company and Michael De La Garza, the Company’s former Chief Executive Officer and President, in the 20th Judicial District for Hays County, Texas (Cause No. 18-0005). Mr. LeBlanc claims that he is a former consultant, employee, and/or officer of the Company, Mr. LeBlanc’s petition (which has been amended) alleges causes of action against the Company for alleged violation of the Texas Securities Act, common law fraud against Mr. De La Garza; breach of fiduciary duty against Mr. De La Garza; breach of contract; as well as declaratory relief. Damages sought exceed $1,000,000 but are less than $10,000,000. The Company believes that the plaintiff was fully compensated for his services and that the plaintiff’s claims are without merit. Mr. LeBlanc is also asserting a claim of partial ownership of certain of the Company’s patents, which the Company believes is without merit. The Company believes it has meritorious defenses to the allegations, and the Company intends to continue to vigorously defend against the litigation.\nIn April 2020, Eric Marquez, the former Secretary/Treasurer and Chief Financial Officer of the Company, and certain other plaintiffs, filed a lawsuit against the Company and Michael De La Garza, the Company’s former Chief Executive Officer and President, in the 20th Judicial District for Hays County, Texas (Cause No. 20-0818). The lawsuit alleges causes of action for fraud against Mr. De La Garza (for misrepresentations allegedly made by Mr. De La Garza); breach of contract, for alleged breaches of Mr. Marquez’s alleged oral employment agreement, which Mr. Marquez claims required the Company pay him cash and shares of stock; unjust enrichment; quantum meruit; and rescission of certain stock purchases made by certain of the plaintiffs, as well as declaratory relief and fraud. Damages sought exceed $1,000,000. The Company believes it has made all required payments and delivered the stock to the plaintiffs. The case is currently being defended by the Company. The Company believes it has meritorious defenses to the allegations, and the Company intends to continue to vigorously defend against the litigation.\nLitigation Settled During the Year Ended September 30, 2021\nSemple, Marchal & Cooper, LLP (“SMC”), the Company’s former independent registered auditing firm, brought a demand for arbitration before the American Arbitration Association against the Company in October 2019, relating to amounts which SMC has alleged are due to SMC for services rendered, which amount was alleged to exceed $75,000, but to be less than $150,000. The parties entered arbitration regarding the amounts owed and subsequently entered into a Settlement Agreement and Release on April 26, 2021, to confidentially settle the matter and mutually release each other from any liabilities.\nOn August 28, 2020, the Company settled all litigation matters which had previously been pending with Michael De La Garza, a former chief executive officer of the Company. As a result of this settlement, De La Garza returned 13.1 million shares of common stock to the Company and the Company agreed to pay De La Garza $400,000 between September 30, 2020, and September 30, 2021. The final payment of the settlement balance was made on September 1, 2021.\nThe Company sought to invalidate the issuance of one million shares of the Company’s Series A preferred stock on or around 2011 to former director and chief financial officer, Pamela Thompson, which stock was being held by the Carmel Trust II. In connection therewith, the Company initiated an action against James LeGanke, as Trustee of Carmel Trust II, in federal district court as part of its efforts to invalidate those shares. The action was settled on January 11, 2021, for $50,000, in exchange for the return of the 1,000,000 shares of Series A preferred stock and 127,500 shares of the Company’s common stock.\nIn October 2020, Ageos, LLC, a Virginia limited liability company (“Ageos”), filed a Third-Party Complaint against the Company in connection with the pending action titled Scandium, LLC v. Ageos, LLC in the General District Court for Fairfax County in the Commonwealth of Virginia. The action related to an operating agreement, by and between the Company and Ageos, whereby the Company agreed to guarantee Ageos’s lease to enable the leasing of space in Fairfax County, VA. The Company subsequently terminated the agreement with Ageos and offered to take over the space as an accommodation. Ageos declined. This lawsuit was subsequently settled on April 29, 2021, and the Company paid Scandium $60,000 in exchange for a release from all past, present, and future liabilities associated with the lease.\nLeases\nIn February 2019, the Company and the landlord for its leased office space in Buda, Texas entered into a new lease agreement, and the Company reduced its rented space from approximately 3,900 to 1,302 square feet. The new lease became effective on February 1, 2019 and has a three-year term. The initial monthly rent is $2,566, and the lease agreement provided for annual rent increases of approximately 2.7%. The lease automatically renews for a three-year term, unless either party to the lease agreement notifies the other of the intent to terminate the lease in writing at least 180 days prior to the expiration of the current term. In July 2020, the Company executed a lease termination agreement with the landlord for an early termination fee of $10,546 and forfeited the existing security deposit of $2,566. There are no future payments related to this lease.\nIn October 2018, the Company leased approximately 3,900 square feet of office space on North Scottsdale Road in Scottsdale, Arizona. The lease for this facility began on October 4, 2018, and originally continued until October 31, 2021. Annual rent of $77,180 was prepaid for the first year from November 1, 2018, to October 31, 2019, and the lease agreement provides for annual rent increases of approximately 5.0%. In June 2020, the Company executed a lease termination agreement with the landlord for an early termination fee of $27,013 and forfeited the existing security deposit of $9,796. There are no future payments related to this lease.\nIn February 2020, the Company leased approximately 3,666 square feet of office space on 2107 Wilson Boulevard, Arlington, Virginia. The lease for this facility began on February 1, 2020, and continued until July 31, 2025. The base annual rent was $159,471, a $100,000 security deposit was paid, and abatement of monthly rent payments was provided until August 1, 2020, and the lease provided for annual rent increases of approximately 2.5%. As the result of restructuring actions intended to conserve cash during the COVID-19 crisis, the landlord of the Wilson Boulevard space was notified that the Company no longer needed the space and reached a termination agreement with the landlord. As part of this agreement, the company paid $150,000 on June 9, 2021.\nAs of September 30, 2021, the Company had no lease agreements for facilities.\nOperating Leases\nOperating leases were included in operating lease ROU] lease assets, and operating lease liabilities and operating long-term lease liabilities on the Balance Sheets. Lease expense for operating leases is recognized on a straight-line basis over the lease term. Variable lease expense is recognized in the period in which the obligation for those payments is incurred. Lease expense is included in general and administrative expense in the statements of operations and is reported net of lease income.\nAs a result of restructuring actions intended to conserve cash during the COVID-19 crisis, the Company stopped occupying the space in March 2020 and notified the landlord that the Company no longer needed the property and began seeking an amicable and reasonable termination of the lease agreement. On June 9, 2021, a settlement of $150,000 was reached with 2111 Wilson Boulevard, Inc. to terminate the lease effective June 2021. Following the settlement agreement with 2111 Wilson Boulevard, Inc., as discussed above, the Company does not have any operating leases as of September 30, 2021.\nThe early termination of the 2111 Wilson Boulevard operating lease resulted in recognizing a $441,597 gain in this reporting period due to the removal of the ROU assets and operating lease liabilities. The balance for ROU assets and liabilities at September 30, 2021, is $0 each.\nCash Flows\nAn initial right-of-use asset of $233,751 was recognized as a non-cash asset addition with the adoption of the new lease accounting standard. Cash paid for amounts included in the present value of operating lease liabilities was $80,402 during the fiscal year ended September 30, 2021 and is included in operating cash flows. The landlord agreed to an early termination and release from all past, present and future liabilities associated with the lease in exchange for a $150,000 one-time payment which the Company made during the quarter ended June 30, 2021.\nNOTE 8 - STOCKHOLDERS’ EQUITY (DEFICIT)\nCommon Stock\nAs of September 30, 2021 and 2020, the Company had 82,927,311 and 27,505,196 shares of common stock outstanding, respectively, and were authorized to issue 681,000,000 shares of common stock at a par value of $0.01.\nTreasury Stock\nManagement determines the fair value of stock issuances using the closing stock price on the grant date.\nDuring the year ended September 30, 2021, the Company came to a settlement with Mr. James LaGanke, as Trustee of Carmel Trust II and purchased back 127,500 shares and recorded such shares as Treasury Stock. Mr. James LaGanke received $50,000 in exchange for the 127,500 shares. The Company attributed $40,000 of this settlement to the repurchase of common stock and the remaining $10,000 to the repurchase of Series A Preferred Stock.\nDuring the year ended September 30, 2020, the Company came to a settlement with First Fire and purchased back 149,557 shares and recorded such shares as Treasury Stock. First Fire received $150,000 in exchange for the 149,557 shares.\nDuring the year ended September 30, 2020, the Company entered into to a settlement with Michael De La Garza and purchased 13,137,757 shares of common stock held by Mr. De La Garza in exchange for $400,000 in cash, of which $300,000 was paid at the time of settlement and the remaining $100,000 was paid through four quarterly payments of $25,000. The Company made the final payment was made on September 1, 2021.\nThe accumulated number of common stock recorded in Treasury Stock at September 30, 2021 is 13,414,814 shares versus 13,287,314 shares as of September 30, 2020.\nCommon Stock Issued for Cash\nDuring the year ended September 30, 2021, the Company issued 55,549,615 shares of common stock pursuant to the Private Offering. Each share was priced at $0.18 and the gross proceeds from the equity issuance were $9,998,931. The proceeds net of issuance costs were $8,558,339.\nAs of September 30, 2021, the Company had issued 96,342,125 shares of common stock, of which 13,414,814 are now in treasury stock. The amount of shares of common stock outstanding as of September 30, 2021, was 82,927,311.\nCommon Stock Issued for Services\nOn July 23, 2021, the Company entered into a financial advisory and consulting agreement with Paulson Investment Company, LLC (“Paulson”). Pursuant to the agreement, Paulson will provide the following services at the Company’s request: (a) familiarize itself with the Company’s business, assets and financial condition; (b) assist the Company in developing strategic and financial objectives; (c) assist the Company in increasing its exposure in the software industry; (d) assist the Company in increasing its profile in the investment and financial community through introductions to analysts and potential investors, participation in investment conferences and exploitation of reasonably available media opportunities; (e) identify potentially attractive merger and acquisition opportunities; (f) review possible innovative financing opportunities and (g) render other financial advisory services as may be reasonably requested. The term of the agreement is four years from the date of the agreement, unless terminated earlier by either party as provided therein. As compensation for these services, the Company is issuing to Paulson 4,000,000 shares of the Company’s common stock and agreed to reimburse Paulson for all reasonable and documented expenses incurred by Paulson in connection with providing such services. When the 4,000,000 shares are issued to Paulson, the Company’s total outstanding shares of common stock will increase to 86,297,311.\nCommon Stock and Stock Options Issued to Directors and Officers\nDuring 2020, 620,000 stock options were granted to employees. Also, during 2020, 920,000 stock options were cancelled due to the termination of employment of the holders. As of September 30, 2020, 800,000 stock options were outstanding. None of the stock options are in the money and the unamortized amount of stock compensation as of September 30, 2020, was $383,453. During 2021 the remaining options were canceled because the 2019 plan under which they were awarded was not approved by the Company’s shareholders, and none of the options holders were still employees, which is a requirement for vesting. Consequently, the Company recognized no stock compensation expense for the year ended September 30, 2021.\nNo stock or stock options were granted to employees, officers, and directors during the year ended September 30, 2021.\nSCHEDULE OF STOCK OPTIONS\nYear Ended September 30, 2020\nBalance on September 30, 2019 1,100,000\nNew Awards 620,000\nOptions Cancelled (920,000 )\nBalance at September 30, 2020 800,000\nThe Company’s board of directors authorized, and the shareholders approved, the Company’s 2021 Omnibus Equity Incentive Plan which provides for the award of up to 8,000,000 shares of common stock. See Note 10 - Subsequent Events for awards recently made as part of this plan.\nPreferred Stock\nAs of September 30, 2021 and 2020, the Company had zero and 1,000,000 shares of restricted preferred stock outstanding, respectively. The Company came to a settlement with James LeGanke, as Trustee of Carmel Trust II and purchased back 127,500 shares of common stock and recorded such shares as Treasury Stock. Mr. LeGanke received a total payment of $50,000 as a result of the settlement. The Company attributed $40,000 of this settlement to the repurchase of common stock and the remaining $10,000 to the repurchase of 1,000,000 shares of Series A Preferred stock.\nWarrants\nDuring the year ended September 30, 2021, the Company granted 63,882,054 warrants, see Note 2 above.\nWarrant activities for the years ended September 30, 2021 and 2020 are as follows:\nSCHEDULE OF WARRANT ACTIVITY\nNumber of Warrants Weighted Average Exercise\nPrice Weighted Average Remaining Life\nOutstanding at September 30, 24,290,866 $ 1.14 4.84\nGranted - - -\nExercised - - -\nCanceled/Forfeited (544,000 ) 2.11 -\nOutstanding at September 30, 2020 23,746,866 1.12 3.74\nGranted 63,882,054 0.34 5.15\nExercised - - -\nCanceled/Forfeited - - -\nOutstanding at September 30, 2021 87,628,920 $ 0.55 4.77\nNOTE 9 - INCOME TAXES\nThe provision (benefit) for income taxes from continued operations for the years ended September 30, 2021, and 2020 consist of the following:\nSCHEDULE OF PROVISION (BENEFIT) FOR INCOME TAXES FROM CONTINUED OPERATIONS\nSeptember 30,\nCurrent:\nFederal $ - $ -\nState - -\nCurrent Federal and State Income Tax Expense (Benefit) $ - $ -\nDeferred:\nFederal $ (692,230 ) $ (239,000 )\nState (591,835 ) -\nDeferred Federal and State Income Tax Expense (Benefit) (1,284,065 ) (239,000 )\nChange in valuation allowance 1,284,065 239,000\nProvision (benefit) for income taxes, net $ - $ -\nThe difference between income tax expense computed by applying the federal statutory corporate tax rate and actual income tax expense is as follows:\nSCHEDULE OF FEDERAL STATUTORY CORPORATE TAX RATE AND ACTUAL INCOME TAX EXPENSE\nSeptember 30,\nStatutory federal income tax rate 21.0 % 21.0 %\nNon-deductible stock-based compensation and other permanent differences 1.3 (0.1 )\nChange in state statutory tax rate 19.06 (0.0 )\nChange in valuation allowance (41.36 ) (20.90 )\nEffective tax rate 0.0 % 0.0 %\nFor the years ended September 30, 2021 and 2020, the difference between the amounts of income tax expense or benefit that would result from applying the statutory rates to pretax income to the reported income tax expense of $0 is the result of the net operating loss carry forward and the related valuation allowance, as well as non-deductible stock-based compensation.\nDeferred income taxes result from temporary differences in the recognition of income and expenses for the financial reporting purposes and for tax purposes. The tax effect of these temporary differences representing deferred tax asset and liabilities result principally from the following:\nSCHEDULE OF DEFERRED TAX ASSETS AND LIABILITIES\nSeptember 30,\nNet operating loss carry forward $ 6,961,203 $ 6,127,000\nDeferred compensation 3,126,502 2,696,000\nValuation allowance (10,087,705 ) (8,823,000 )\nDeferred income tax asset $ - $ -\nThe Company has a net operating loss carry forward of $32.9 million available to offset future taxable income. Of which, $3.7 million will expire within the next five years, and the remaining $29.2 million will expire thereafter. For income tax reporting purposes, the Company’s aggregate unused net operating losses were subject to the limitations of Section 382 of the Internal Revenue Code, as amended. The Company has adjusted the net operating losses incurred prior to 2015 to reflect only the losses not subject to limitation. The Company has provided for a valuation reserve against the net operating loss benefit, because in the opinion of management based upon the earning history of the Company; it is more likely than not that the benefits will not be realized. For income tax reporting purposes, Management has determined that net operating losses prior to February 5, 2015, are subject to an annual limitation of approximately $525,000.\nThe Company is current on all its federal income tax filings. An extension will be filed for the September 30, 2021, tax return.\nOn December 22, 2017, the Tax Cuts and Jobs Act (“Tax Act”) was signed into law in the U.S. The Tax Act has resulted in significant changes to the U.S. corporate income tax system. These changes include a federal statutory rate reduction from 35% to 21%, the elimination or reduction of certain domestic deductions and credits, and limitations on the deductibility of interest expense and executive compensation. These changes were effective beginning in 2018.\nNOTE 10 - SUBSEQUENT EVENTS\nOn October 12, 2021, through the filing of a Current Report on Form 8-K, the Company announced a new employment agreement with Ryan Polk, who serves as its Chief Financial Officer. The agreement provides for an annual salary of $150,000, annual equity incentive awards equal to $50,000, and a discretionary annual performance bonus target of $100,000.\nOn October 22, 2021, the Company filed a Form S-8 Registration Statement registering the issuance of the 8,000,000 shares of common stock under the Company’s 2021 Omnibus Equity Incentive Plan, which was approved by the shareholders at the annual meeting held on September 13, 2021.\nFollowing SEC acceptance of the Form S-8 for the Omnibus Equity Incentive Plan, the Company made the following awards, and the award recipients filed Form 4s with the SEC:\n● Tom Wilkinson, Chairman: 141,667 shares vesting immediately\n● Anthony Ambrose, Lead Independent Director: 141,667 shares vesting immediately\n● Sammy Davis, Director: 127,778 shares vesting immediately\n● David Chasteen, Chief Executive Officer: 1,111,111 shares vesting over 3 years with the first vesting anniversary on June 1, 2022\n● Nick Hnatiw, Chief Technology Officer: 277,778 shares vesting over 3 years with the first vesting anniversary on June 1, 2022\n● Ryan Polk, Chief Financial Officer: 277,778 shares vesting over 3 years with the first vesting anniversary on June 1, 2022\nOn November 12, 2021, the Company announced the formation of a Board of Advisors to its support product development, market entry and commercial applications of its disruptive polymorphic encryption technology. The founding members of the advisory board are Griffin Boyce, Privacy Lead at Google Fuchsia; Margaret Jones, Head of Content and Women’s ERG Lead at Airtable; and Travis Williams, Director of Product Management for Mind Tech at Hyperice.",
    "item_9": "ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.",
    "item_9A": "ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures that are designed to ensure that information required to be disclosed in the reports we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission’s (the “SEC”) rules and forms and that such information is accumulated and communicated to our Chief Executive Officer and Principal Financial Officer, as appropriate, to allow for timely decisions regarding required disclosure. In designing and evaluating the disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and management is required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures. Our disclosure controls and procedures have not been formally designed and evaluated to provide reasonable assurance that the controls and procedures would meet their objectives.\nAs required by SEC Rule 13a-15(b), our Chief Executive Officer and Principal Financial Officer need to carry out an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures as of the end of the period covered by this report. Based on the foregoing, our Chief Executive Officer and Principal Financial Officer concluded that our disclosure controls and procedures were not effective as of September 30, 2020, due to 1) no formal evaluation has been performed by us and 2) the existence of the material weaknesses in internal control over financial reporting described below (which we view as an integral part of our disclosure controls and procedures). Based on the performance of additional procedures designed to ensure the reliability of our financial reporting, we believe that the financial statements included in this Annual Report fairly present, in all material respects, our financial position, results of operations and cash flows as of the dates, and for the periods, presented, in conformity with U.S. GAAP.\nManagement’s Report on Internal Control over Financial Reporting\nOur Chief Executive Officer and the Principal Financial Officer are responsible for establishing and maintaining adequate internal control over financial reporting and for the assessment of the effectiveness of our internal control over financial reporting. Internal control over financial reporting (as defined in Rules 13a-15(f) and 15d(f) under the Exchange Act) is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external reporting purposes in accordance with U.S. GAAP. Internal control over financial reporting includes those policies and procedures that (a) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of assets, (b) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, (c) provide reasonable assurance that receipts and expenditures are being made only in accordance with appropriate authorization of management and the Board of Directors, and (d) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of assets that could have a material effect on the financial statements.\nIn connection with the preparation of the Annual Report on Form 10-K for the year ended September 30, 2021, our Chief Executive Officer and Principal Financial Officer evaluated the effectiveness of our internal control over financial reporting as of September 30, 2021 and concluded that we had not implemented effective internal control over financial reporting during the reporting year.\nRemediation Plan\nManagement executed a remediation plan to address the material weaknesses discussed above. These remediation efforts focused on:\n● Enhancing monitoring and review controls over financial reporting and disclosures;\n● Enhancing review and approval controls around transaction processing;\n● Enhancing controls around proving the delivery of software; and\n● Enhancing and maintaining written policies and procedures for accounting and financial reporting.\nSubsequent to September 30, 2019, management designed and implemented review and approval controls around transaction processing, including written policies and procedures. In addition, management has continued to train key accounting staff to improve controls that will eliminate the material weaknesses discussed above, as well as improve the accounting and financial reporting process.\nManagement has also evaluated the effectiveness of its internal control over financial reporting in accordance with generally accepted accounting principles within the guidelines of the Committee of Sponsoring Organizations of the Treadway Commission framework (2013). Based on the results of this evaluation, management has determined that the Company’s internal control over financial reporting was effective as of September 30, 2021.\nChanges in Internal Control over Financial Reporting\nDuring the year ended September 30, 2021, there were no changes in our internal control over financial reporting that have materially affected or are reasonably likely to materially affect our internal control over financial reporting, other than the remediation actions discussed above.\nInherent Limitations on Internal Controls\nIt should be noted that any system of controls, however well designed and operated, can provide only reasonable and not absolute assurance that the objectives of the control system are met. In addition, the design of any control system is based in part upon certain assumptions about the likelihood of certain events. Limitations inherent in any control system include the following:\n● Judgments in decision-making can be faulty, and control and process breakdowns can occur because of simple errors or mistakes;\n● Controls can be circumvented by individuals, acting alone or in collusion with others, or by management override;\n● The design of any system of controls is based in part on certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions;\n● Over time, controls may become inadequate because of changes in conditions or deterioration in the degree of compliance with associated policies or procedures; and\n● The design of a control system must reflect the fact that resources are constrained, and the benefits of controls must be considered relative to their costs.\nBecause of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected.",
    "item_9B": "ITEM 9B. OTHER INFORMATION\nNone.\nPART III",
    "item_10": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE [incorporate by reference to July 2021 proxy statement?]\nDirectors and Executive Officers\nSet forth below is information regarding the Company’s current directors and executive officers. There are no family relationships between any of our directors or executive officers. The directors are elected annually by our stockholders. The executive officers serve at the pleasure of the Board of Directors.\nName\nAge\nTitle\nTom Wilkinson\nChairman of the Board of Directors\nAnthony Ambrose\nLead Independent Director\nDavid Chasteen\nChief Executive Officer and Director\nSammy Davis DrPH\nDirector\nRyan Polk\nChief Financial Officer\nNicholas Hnatiw\nChief Technology Officer\nThe background and principal occupations of the directors and executive officers of the Company are as follows:\nBoard of Directors\nTom Wilkinson - Chairman of the Board of Directors\nMr. Wilkinson serves as the Company’s Chairman of the Board of Directors. He is a licensed CPA in Texas and Colorado. From 2014 to October 2015 he was the Chief Financial Officer of Amherst Holdings, LLC. Mr. Wilkinson joined Xplore Technologies Corp., a NASDAQ traded company, in 2015 where he served as the Chief Financial Officer until 2017 when he took on the position of Chief Executive Officer until the sale of the company to Zebra Technologies in August 2018. He presently owns and operates Wilkinson & Company, a financial and business consulting firm focused on emerging growth pre-IPO and public companies. Mr. Wilkinson has also been a member of the board of directors of Astrotech Corporation (NASDAQ: ASTC) since October 2018. He received his Bachelor of Business Administration and Master of Professional Accounting from the University of Texas in 1992. We believe Mr. Wilkinson is qualified to serve on our board of directors based on his financial experience.\nAnthony Ambrose - Lead Independent Director\nMr. Ambrose serves a director of the Company. Mr. Ambrose has served as a director, President and Chief Executive Officer of Data I/O, the leading global provider of advanced data and security programming solutions, and a NASDAQ listed company (NASDAQ: DAIO). Prior to Data I/O, Mr. Ambrose was Owner and Principal of Cedar Mill Partners, LLC, a strategy consulting firm since 2011. From 2007 to 2011, he was Vice President and General Manager at RadiSys Corporation, a leading provider of embedded wireless infrastructure solutions, where he established the telecom platform business and grew it to over $125M in annual revenues. He was previously general manager and held several other progressively responsible positions at Intel Corporation, where he led development and marketing of standards-based communications platforms and grew the industry standard server business to over $1B in revenues. Mr. Ambrose has a Bachelor of Science degree in Engineering from Princeton University and has completed the Stanford University Director Symposium. We believe Mr. Ambrose is qualified to serve on our board of directors based on his data security and industry experience.\nDavid Chasteen - Chief Executive Officer and Director\nMr. Chasteen serves as a director of the Company. Since 2018, Mr. Chasteen has been the Chief Information Security Officer for the City and County of San Francisco Police Department. From 2015 to 2018, Mr. Chasteen was a Threat Intelligence Strategist for the City and County of San Francisco where he was responsible for managing city, state and federal intelligence relationships and managing cybersecurity operations for the City and County of San Francisco. From 2015 to 2016 Mr. Chasteen was the Western Regional Director for Iraq and Afghanistan Veterans of America. From 2006 to 2014 Mr. Chasteen worked for the Central Intelligence Agency as a Collection Management Officer, Specialized Skills Officer, and finally an Executive Officer, Covert Action Staff. Mr. Chasteen received a B.S. in Political Science from Ball State University in 2000. We believe Mr. Chasteen is qualified to serve on our board of directors based on his cybersecurity and industry experience.\nSammy Davis DrPH - Director\nDr. Davis serves as a director of the Company. Dr. Davis has over 20 years’ experience in operations, finance, budgeting, financial reporting, revenue cycle management, inventory, payroll, accounts receivable and payable, and information systems in the healthcare industry. Since 2009 Dr. Davis has been a Senior Marketing Liaison with Physician Reliance Corporation. From 2005 to 2009, Dr. Davis was the Chief Executive officer of Renaissance Hospital in the Dallas/Fort Worth Area. From 2004 to 2005, Dr. Davis was the interim Chief Executive Officer of Transition Health Care LTAC in Corpus Christi, TX. Dr. Davis holds a Doctor of Public Health degree from the University of Texas. We believe Dr. Davis is qualified to serve on our board of directors based on his leadership experience.\nExecutive Officers\nRyan Polk - Chief Financial Officer\nRyan Polk serves as the Company’s Chief Financial Officer. Mr. Polk has served in leadership roles in both public and private companies after a brief time at accounting firm Ernst & Young. He is a part-time employee of Cipherloc and is engaged in providing CEO and CFO related services to other companies as an independent contractor. He is a graduate of Purdue University with two Bachelor of Science degrees from the Krannert School of Management. His career has focused on both the consumer products and technology industries.\nNicholas Hnatiw - Chief Technology Officer\nNicholas Hnatiw serves as the Company’s Chief Technology Officer. Mr. Hnatiw has more than 15 years of experience creating software technologies from network security to artificial intelligence. Mr. Hnatiw has led the design and development of a security risk assessment SaaS platform, run a security monitoring service with a custom-built next generation automation and SIEM system. Prior to the Company, Mr. Hnatiw served as the technical director for network operations supporting U.S. Cyber Command, U.S. Intelligence Agencies, and other Department of Defense research organizations from October 2010 to October 2014. From June 2015 to September 2019, Mr. Hnatiw was the Chief Executive Officer of Loki Labs, a cyber security firm. Mr. Hnatiw is also currently a consultant with Cuesta Partners (since January 2020); a partner and Chief Technology Officer of Sidechannel Security (since February 2020), and the Chief Technology Officer of RealCISO.io (since October 2020). Mr. Hnatiw earned a Bachelor of Science degree in computer engineering and computer science at the University of Massachusetts, Amherst.\nFamily Relationships and Other Arrangements\nThere are no family relationships among our directors and executive officers. Other than Mr. Chasteen’s appointment as a chief executive officer in connection with his employment agreement, there are no arrangements or understandings between or among our executive officers and directors pursuant to which any director or executive officer was or is to be selected as a director or executive officer.\nBoard Leadership Structure and Role in Risk Oversight\nOur Board has established an audit committee, a compensation committee, and a nominating and corporate governance committee, each of which operate pursuant to a charter adopted by our Board. Each committee has the composition and responsibilities described below. Our Board may establish other committees from time to time.\nThe following table identifies the current members of each of our committees:\nName Executive\nCommittee\nAudit Compensation Corporate Governance/\nNominating\nTom Wilkinson X* X X X\nAnthony Ambrose X X* X* X*\nDavid Chasteen X\nSammy Davis DrPH X X X X\n* Chairman of the committee\nDirector Independence\nOur Board has determined that a majority of the Board consists of members who are currently “independent” as that term is defined under the rules of the Nasdaq Stock Market LLC. As our common stock is traded over the counter on the OTCQB, we are not required to comply with such requirements. Nevertheless, the Board considers Ms. Young, Dr. Davis, and Mr. Ambrose to be “independent” under such rules.\nAudit Committee\nMessrs. Ambrose, Wilkinson, and Davis serve on the Audit Committee, which is chaired by Mr. Ambrose.\nThe audit committee’s responsibilities include:\n● appointing, approving the compensation of, and assessing the independence of our independent registered public accounting firm;\n● pre-approving auditing and permissible non-audit services, and the terms of such services, to be provided by our independent registered public accounting firm;\n● reviewing the overall audit plan with our independent registered public accounting firm and members of management responsible for preparing our financial statements;\n● reviewing and discussing with management and our independent registered public accounting firm our annual and quarterly financial statements and related disclosures as well as critical accounting policies and practices used by us;\n● coordinating the oversight and reviewing the adequacy of our internal control over financial reporting;\n● establishing policies and procedures for the receipt and retention of accounting-related complaints and concerns;\n● recommending based upon the audit committee’s review and discussions with management and our independent registered public accounting firm whether our audited financial statements will be included in our Annual Reports on Form 10-K;\n● monitoring the integrity of our financial statements and our compliance with legal and regulatory requirements as they relate to our financial statements and accounting matters;\n● preparing the audit committee report required by SEC rules to be included in our annual proxy statement;\n● reviewing all related person transactions for potential conflict of interest situations and approving all such transactions; and\n● reviewing quarterly earnings releases.\nCompensation Committee\nMessrs. Ambrose, Wilkinson, and Davis and serve on the Compensation Committee which is chaired by Mr. Ambrose.\nThe compensation committee’s responsibilities include:\n● annually reviewing and approving corporate goals and objectives relevant to the compensation of our chief executive officer;\n● evaluating the performance of our chief executive officer considering such corporate goals and objectives and determining the compensation of our chief executive officer;\n● reviewing and approving the compensation of our other executive officers;\n● reviewing and establishing our overall management compensation, philosophy and policy;\n● overseeing and administering our compensation and similar plans;\n● evaluating and assessing potential and current compensation advisors in accordance with the independence standards identified in the applicable Nasdaq rules;\n● retaining and approving the compensation of any compensation advisors;\n● reviewing and making recommendations to our Board about our policies and procedures for the grant of equity-based awards;\n● evaluating and making recommendations to the Board about director compensation;\n● preparing the compensation committee report required by SEC rules, if and when required, to be included in our annual proxy statement; and\n● reviewing and approving the retention or termination of any consulting firm or outside advisor to assist in the evaluation of compensation matters.\nCorporate Governance/Nominating Committee\nMessrs. Ambrose, Wilkinson, and Davis serve on the Corporate Governance/Nominating Committee, which is chaired by Mr. Ambrose.\nThe nominating and corporate governance committee’s responsibilities include:\n● developing and recommending to the Board criteria for board and committee membership;\n● establishing procedures for identifying and evaluating board of director candidates, including nominees recommended by stockholders;\n● reviewing the size and composition of the Board to ensure that it is composed of members containing the appropriate skills and expertise to advise us;\n● identifying individuals qualified to become members of the Board;\n● recommending to the Board the persons to be nominated for election as directors and to each of the board’s committees;\n● developing and recommending to the Board a code of business conduct and ethics and a set of corporate governance guidelines; and\n● overseeing the evaluation of our Board and management.\nConflicts of Interest\nMembers of our management are associated with other firms involved in a range of business activities. Consequently, there are potential inherent conflicts of interest in their acting as officers and directors of our company. Although the directors are engaged in other business activities, we anticipate they will devote an important amount of time to our affairs.\nOur officers and directors are now and may in the future become stockholders, officers or directors of other companies, which may be formed for the purpose of engaging in business activities similar to ours. Accordingly, additional direct conflicts of interest may arise in the future with respect to such individuals acting on behalf of us or other entities. Moreover, additional conflicts of interest may arise with respect to opportunities which come to the attention of such individuals in the performance of their duties or otherwise. Currently, we do not have a right of first refusal pertaining to opportunities that come to their attention and may relate to our business operations.\nOur officers and directors are, so long as they are our officers or directors, subject to the restriction that all opportunities contemplated by our plan of operation which come to their attention, either in the performance of their duties or in any other manner, will be considered opportunities of, and be made available to us and the companies that they are affiliated with on an equal basis. A breach of this requirement will be a breach of the fiduciary duties of the officer or director. If we or the companies with which the officers and directors are affiliated both desires to take advantage of an opportunity, then said officers and directors would abstain from negotiating and voting upon the opportunity. However, all directors may still individually take advantage of opportunities if we should decline to do so. Except as set forth above, we have not adopted any other conflict of interest policy with respect to such transactions.\nCode of Ethics\nWe have adopted a formal Code of Ethics applicable to all Board members, officers and employees. A copy of our Code of Ethics may be obtained without charge upon written request to Secretary, Cipherloc Corporation, 6836 Bee Cave Road, Bldg. 1, Suite 279, Austin, TX 78746.",
    "item_11": "ITEM 11. EXECUTIVE COMPENSATION\nSummary Compensation Table\nThe following tables set forth certain information concerning all compensation paid, earned or accrued for service by (i) our Principal Executive Officer and Principal Financial Officer and (ii) all other executive officers who earned in excess of $100,000 in the fiscal years ended September 30, 2021 and 2020, and each of the other two most highly compensated executive officers of the Company who served in such capacity at the end of the fiscal year whose total salary and bonus exceeded $100,000 (collectively, the “Named Executive Officers”):\nSUMMARY COMPENSATION TABLE\nName and Position Year Salary ($) Bonus ($) Stock\nAwards ($) All Other Compensation ($) (1) Change in Pension Value and Nonqualified Deferred Compensation Earnings ($) Total ($)\nDavid Chasteen(7)\nChief Executive Officer & Director $ 125,000 100,000 $ - $ 15,100 - $ 240,100\nExecutive Officer $ - - $ - $ 15,100 - $ 15,100\nAndrew Borene\nChairman & $ - - $ - $ - - $ -\nChief Executive Officer(2) $ 94,500 $ 100,000 - $ 175,000 - $ 369,500\nRyan Polk,\nChief Financial Officer(3) $ 75,000 100,000 - $ - - $ 175,000\n$ 49,760 - - $ - - $ 49,760\nNick Hnatiw,\nChief Technology Officer(8)\n$ 66,667 25,000 - $ 149,450 - $ 241,117\nGino Mauriello $\nChief Financial Officer(4) $ 72,917 - - $ 50,000 - $ 122,917\nAlbert Carlson, PhD\nDirector & $ - - $ - $ - - $ -\nChief Scientific Officer(6) $ 121,890 - - - - $ 121,890\nMilton Mattox $ 41,667 - $ - $ - - $ 41,667\nChief Operating Officer(5) $ 222,865 $ 15,000 $ - - - $ 237,865\n(1) All other compensation consists primarily of remunerations for legal settlements, severance, auto and health insurance costs.\n(2) Mr. Andrew Borene was terminated as Chief Executive Officer on April 3, 2020.\n(3) Mr. Polk was appointed as Chief Financial Officer on February 1, 2020.\n(4) Mr. Mauriello was terminated as Chief Financial Officer on December 13, 2019.\n(5) Mr. Mattox resigned from the Company on November 12, 2020.\n(6) Mr. Carlson resigned from the Company on December 17, 2019\n(7) Mr. Chasteen was appointed as Chief Executive Officer on November 1, 2020\n(8) Mr. Hnatiw was appointed as Chief Technology Officer on June 1, 2021\nCompensation of Directors\nThe Company’s compensation policy for directors includes quarterly fees as well as stock options. Annual director compensation will be $60,000 for the Chairman of the Board and Lead Independent Director, $40,000 for directors with an additional $4,000 for additional committees. In July 2020, the board of directors temporarily deferred cash payments to its members. We restored cash payments to directors in April 2021.\nBeginning with the quarter ended September 30, 2021, the Company’s directors received one-half of their compensation in cash and the remaining half in common stock. During the years ended September 30, 2021, and 2020, the Company paid $220,000 and $170,000 in board fees, respectively.\nEmployment Contracts\nBorene Employment Agreement\nThe Company entered into an Employment Agreement with Andrew Borene (the “Borene Employment Agreement”), our Chief Executive Officer, on November 25, 2019, pursuant to which he received a base annual salary of $350,000, payable in accordance with the Company’s standard payroll schedule, and other customary benefits. Mr. Borene also received options to purchase up to 500,000 shares of the Company’s common stock (the “Borene Options”). The Borene Options had an exercise price of $0.75 per share and were to vest as follows: 166,666 shares vest on November 26, 2020, 166,667 shares vest on November 26, 2021, and 166,667 shares vest on November 26, 2022. Additionally. Mr. Borene received a signing bonus in the amount of $150,000 which is payable in equal installments at the end of each of the first three months of his employment.\nMr. Andrew Borene’s employment with the Company was terminated on April 3, 2020. The Company expects no future payments under Mr. Boren’s employment contract.\nCarlson Employment Agreement\nThe Company previously entered into an employment agreement with Albert Carlson as its Chief Scientific Officer. Dr. Carlson resigned from his positions as Chief Scientific Officer and director on December 17, 2019. The employment agreement was for a term of one year, commencing on September 1, 2015, and initially expired on August 31, 2016, with three one-year extensions. The agreement provided that, in addition to receiving paid vacation in accordance with the Company’s policies as well as other customary benefits and provisions, Dr. Carlson received an annual base salary of $150,000. If, at any time during the term of the agreement, Dr. Carlson was terminated “without cause,” he was entitled to receive a cash payment equal to the aggregate compensation payable to him during the remaining term of the Agreement. During the year ended September 30, 2019, prior to his resignation, Dr. Carlson’s annual base salary was increased to $300,000.\nOmnibus Equity Incentive Plan\nThe Company’s Board of Directors approved the 2021 Omnibus Equity Incentive Plan (“2021 Plan”) on May 12, 2021, and it became effective upon approval by the Company’s shareholders at the annual meeting on September 13, 2021. The 2021 Plan is intended to align the interests of our stockholders and the recipients of awards under the 2021 Plan, and to advance the Company’s interests by attracting and retaining directors, officers, employees and other service providers and motivating them to act in our long-term best interests. The material terms of the 2021 Plan are as follows:\nPlan term. The 2021 Plan terminates on September 12, 2031 (the day before the tenth anniversary of the adoption of the plan), unless terminated earlier by our Board.\nEligible participants. All officers, directors, employees, consultants, agents and independent contractors, and persons expected to become officers, directors, employees, consultants, agents and independent contractors of our Company or any of our subsidiaries are eligible to receive awards under the 2021 Plan. The compensation committee of our Board will determine the participants under the 2021 Plan.\nShares authorized. 8,000,000 shares of common stock are available for awards granted under the 2021 Plan, subject to adjustment for stock splits and other similar changes in capitalization. The number of available shares will be reduced by the aggregate number of shares that become subject to outstanding awards granted under the 2021 Plan. To the extent that shares subject to an outstanding award granted under the 2021 Plan are not issued or delivered by reason of the expiration, termination, cancellation or forfeiture of such award or by reason of the settlement of an award in cash, then those shares will again be available under the 2021 Plan. In addition, any shares covered by an award that have been surrendered in connection with the payment of the award exercise or purchase price or in satisfaction of tax withholding obligations incident to the grant, exercise, vesting or settlement of an award will be deemed not to have been issued for purposes of determining the maximum number of shares which may be issued pursuant to all awards under the 2021 Plan.\nAward types. Awards include options (non-qualified and incentive stock options) and restricted stock.\nAdministration. The compensation committee will interpret and administer the 2021 Plan. The compensation committee’s interpretation, construction and administration of the 2021 Plan and all its determinations thereunder will be conclusive and binding on all persons.\nThe compensation committee shall have the authority to determine the participants in the 2021 Plan, the form, amount and timing of any awards, the performance goals, if any, and all other terms and conditions pertaining to any award. The compensation committee may take any action such that (i) any outstanding options become exercisable in part or in full, (ii) all or any portion of a restriction period on any restricted stock will lapse, (iii) all or a portion of any performance period applicable to any performance-based award will lapse and (iv) any performance measures applicable to any outstanding award will be deemed satisfied at the target level or any other level. Subject to the terms of the 2021 Plan relating to grants to our executive officers and directors, the compensation committee may delegate some or all of its powers and authority to the Chief Executive Officer or other executive officer as the compensation committee deems appropriate.\nStock options. The 2021 Plan provides for the grant of stock options. Stock options may be either tax-qualified incentive stock options or non-qualified stock options. The compensation committee will determine the terms and conditions to the exercisability of each option.\nThe period for the exercise of a non-qualified stock option will be determined by the compensation committee provided that no option may be exercised later than ten years after its date of grant. The exercise price of a non-qualified stock option will not be less than 100% of the fair market value of a share of our common stock on the date of grant.\nEach incentive stock option will be exercisable for not more than 10 years after its date of grant, unless the optionee owns greater than 10% of the voting power of all shares of our capital stock, or a “ten percent holder,” in which case the option will be exercisable for not more than five years after its date of grant. The exercise price of an incentive stock option will not be less than the fair market value of a share of our common stock on its date of grant, unless the optionee is a ten percent holder, in which case the option exercise price will be the price required by the Internal Revenue Code of 1986, as amended, or the “Code,” currently 110% of fair market value.\nUpon exercise, the option exercise price may be paid in cash, by the delivery of previously owned shares of our common stock, share withholding or through a cashless exercise arrangement, as permitted by the applicable award agreement. All of the terms relating to the exercise, cancellation or other disposition of an option upon a termination of employment, whether by reason of disability, retirement, death or any other reason, will be determined by the compensation committee.\nThe compensation committee, without stockholder approval, may (i) reduce the exercise price of any previously granted option, or (ii) cancel any previously granted option at a time when its exercise price exceeds the fair market value of the underlying shares, in exchange for another option, or other award or for cash.\nStock awards. The 2021 Plan provides for the grant of stock awards. The compensation committee may grant a stock award as a restricted stock award and the compensation committee may determine that such award will be subject to the attainment of performance measures over an established performance period. All of the terms relating to the satisfaction of performance measures and the termination of a restriction period, or the forfeiture and cancellation of a stock award upon a termination of employment, whether by reason of disability, retirement, death or any other reason, will be determined by the compensation committee.\nUnless otherwise set forth in a restricted stock award agreement, the holder of shares of restricted stock will have rights as our stockholder, including the right to vote and receive dividends with respect to the shares of restricted stock, except that distributions other than regular cash dividends and regular cash dividends with respect to shares of restricted stock subject to performance-based vesting conditions will be held by us and will be subject to the same restrictions as the restricted stock.\nPerformance goals. Under the 2021 Plan, the vesting or payment of performance-based awards will be subject to the satisfaction of certain performance goals. The performance goals applicable to a particular award will be determined by the compensation committee at the time of grant. The performance goals may be one or more of the following corporate-wide or subsidiary, division, operating unit or individual measures, stated in either absolute terms or relative terms.\nIndividual Limits. With respect to non-employee directors, the maximum grant date fair value of shares that may be granted to an individual non-employee director during any fiscal year of the Company is $150,000 in their first year of service and $120,000 thereafter.\nAmendment or termination of the 2021 Plan. Our Board may amend or terminate the 2021 Plan as it deems advisable, subject to any requirement of stockholder approval required by law, rule or regulation.\nChange in control. In the event there is a change in control and/or the Company is a party to a merger or acquisition or reorganization or Change in Control event or similar transaction, outstanding awards shall be subject to the merger agreement or other applicable transaction agreement. Such agreement may provide, without limitation, that subject to the consummation of the applicable transaction, for the assumption (or substitution) of outstanding awards by the surviving corporation or its parent, for their continuation by the Company (if the Company is a surviving corporation), for accelerated vesting or for their cancellation with or without consideration, or for the mandatory exercise or conversion of awards into shares and/or cash whether by net exercise or otherwise, in all cases without the consent of a participant of the 2021 Plan.\nAdditionally, in the event a change in control occurs and there is no assumption, substitution or continuation of awards, the compensation committee in its discretion may provide that all awards shall vest and become exercisable as of immediately before such change in control. The compensation committee may also in its discretion include in an award agreement a requirement that unless approval under Section 280G of the Code has been obtained, no acceleration of vesting shall occur with respect to an award to the extent that such acceleration would, after taking into account any other payments in the nature of compensation to which the participant would have a right to receive from the Company and any other person contingent upon the occurrence of such change in control, result in a “parachute payment” as defined under Code Section 280G.\nUnder the 2021 Plan, a change of control will occur upon: (i) the consummation of an acquisition, a merger or consolidation of the Company with or into another entity or any other corporate reorganization, if more than 50% of the combined voting power of the continuing or surviving entity’s securities outstanding immediately after such acquisition, merger, consolidation or other reorganization is owned by persons who in the aggregate owned less than 20% of the Company’s combined voting power represented by the Company’s outstanding securities immediately prior to such acquisition, merger, consolidation or other reorganization; (ii) A sale of more than fifty percent (50%) of the outstanding shares of each class of capital stock of the Company to a person, entity or group other than a person, entity or group affiliated with the Company, or (iii) he sale, transfer or other disposition of all or substantially all of the Company’s assets to a person, entity or group other than a person, entity or group affiliated with the Company.\nNew plan benefits. The benefits that might be received by officers, employees and non-employee directors cannot be determined at this time. All officers, employees and non-employee directors are eligible for consideration to participate in the 2021 Plan.",
    "item_12": "ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth certain information regarding beneficial ownership of our common stock as of December 17, 2021, by (i) each person (or group of affiliated persons) who is known by us to own more than five percent (5%) of the outstanding shares of our common stock, (ii) each director and executive officer, and (iii) all of our directors and executive officers as a group. As of December 17, 2021, there were 82,927,311 shares of our common stock issued and outstanding.\nExcept as otherwise indicated, the persons listed below have sole voting and investment power with respect to all shares of our common stock owned by them, except to the extent that power may be shared with a spouse.\nBeneficial ownership is determined in accordance with SEC rules and generally includes voting or investment power with respect to securities. For purposes of this table, a person or group of persons is deemed to have “beneficial ownership” of any shares of common stock that such person currently owns or has the right to acquire within 60 days of the date of this prospectus. With respect to options and warrants, this would include options and warrants that are currently exercisable within 60 days. With respect to convertible securities, this would include securities that are currently convertible within 60 days.\nExcept as indicated in footnotes to this table, we believe that the stockholders named in this table have sole voting and investment power with respect to all shares of common stock shown to be beneficially owned by them, based on information provided to us by such stockholders. Unless otherwise indicated, the address for each director and executive officer listed is c/o Cipherloc Corporation, 6836 Bee Cave Road, Bldg. 1, Suite 279, Austin, TX 78746.\nName of Beneficial Owners\nAmount\nPercent\nOwnership\nTom Wilkinson\n156,867\n0.18 %\nAnthony Ambrose\n141,667\n0.17 %\nDavid Chasteen\n-\n- %\nSammy Davis, DrPH\n137,778\n0.17 %\nRyan Polk\n-\n- %\nNicholas Hnatiw\n-\n- %\nAll Officers and Directors as a Group (6 persons)\n436,312\n0.52 %\n5% or greater\n%\nNone\n-\n- %",
    "item_13": "ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe following includes a summary of transactions during our fiscal years ended September 30, 2021 and September 30, 2020 to which we have been a party, including transactions in which the amount involved in the transaction exceeds the lesser of $120,000 or 1% of the average of our total assets at year-end for the last two completed fiscal years, and in which any of our directors, executive officers or, to our knowledge, beneficial owners of more than 5% of our capital stock or any member of the immediate family of any of the foregoing persons had or will have a direct or indirect material interest, other than equity and other compensation, termination, change in control and other arrangements, which are described elsewhere in this Annual Report on Form 10-K.\nDe La Garza Settlement\nOn August 28, 2020, we entered into a Settlement Agreement and Mutual General Release (the “Settlement”) with Michael De La Garza, a former director of the Company. The Settlement related to certain actions, including (i) Cipherloc Corporation vs. Michael De La Garza, MSR, LLC, and James LaGanke, as Trustee of the Caramel Trust II, Civil Action No. 1:19-CV-01147-LY in the United States District Court for the Western District of Texas, Austin Division, (ii) Cipherloc Corporation vs. Michael De La Garza, Cause No. D-1-GN-19-005253 in the 53rd Judicial District Court of Travis County, Texas, and (iii) Michael De La Garza and Cipherloc, Inc. v. Tom Wilkinson, Anthony Ambrose, Manchester PR, LLC and Manchester Explorer, LP; Cause No. D-1-GN-19-004708 in the 53rd Judicial District Court of Travis County, Texas. Under the Settlement, all of the foregoing actions were dismissed with prejudice. Pursuant to the Settlement, Mr. De La Garza, agreed to, among other things, (i) resign as a director of the Company and confirmed that he had no disagreements with the Board of Directors, and (ii) return 13,137,757 shares of the Company’s common stock, $0.01 par value per share (the “Forfeited Stock”), held by him to the Company’s treasury. We agreed to pay Mr. De La Garza an aggregate sum of $400,000 (the “Settlement Amount”), payable as follows: (A) $300,000 on or before ten (10) business days after the last to occur (the “Settlement Date”) of (i) the execution of the Settlement by Mr. De La Garza, (ii) actual receipt by the Company of the Forfeited Stock and consummation of the deliveries contemplated by the Settlement, and (iii) the receipt by the Company of a completed Internal Revenue Service Form W-9 from Mr. De La Garza; and (B) $25,000 on each of the four (4) succeeding quarterly anniversaries of the Settlement Date. Notwithstanding the foregoing, in the event that Mr. De La Garza is not in compliance with the Settlement on any such payment date, then no payment shall be due, and we will have the right to pursue any and all remedies against De La Garza including, without limitation, seeking the return of all amounts paid. In exchange for the consideration described above, and subject to the terms and conditions set forth in the Settlement, the Company and Mr. De La Garza mutually agreed to grant each other a general release.\nReview, Approval or Ratification of Transactions with Related Parties\nOur Board of Directors reviews and approves transactions with directors, officers and holders of five percent or more of our voting securities and their affiliates, each a related party. The material facts as to a related party’s relationship or interest in the transaction are disclosed to our Board of Directors prior to their consideration of such transaction. Further, when stockholders are entitled to vote on a transaction with a related party, the material facts of the related party’s relationship or interest in the transaction are disclosed to the stockholders, who must approve the transaction in good faith. The Company does not have a related party transactions policy in place.",
    "item_14": "ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe aggregate fees billed to the Company by its principal accountants for each of the last two fiscal years were as follows:\nAudit fees $ 83,200 $ 83,200\nOther fees 7,000 -\nTax fees $ 13,500 $ 12,250\nTotal fees $ 103,700 $ 95,450\nAudit Fees. The aggregate fee billed by Briggs & Veselka Co for the audit of the Company’s annual financial statements were $83,200 for the year ended September 30, 2021. The aggregate fees billed by Briggs & Veselka Co. for the audit of the Company’s annual financial statements were $83,200 for the year ended September 30, 2020.\nAudit-Related Fees. The aggregate fees billed by Briggs & Veselka Co., for assurance and related services that are reasonably related to the performance of the audit or review of the Company’s financial statements for the fiscal years ended September 30, 2021 and 2020 that are not disclosed in the paragraph captioned “Audit Fees” above, were $0.00.\nTax Fees. The aggregate fee billed by The Wenmohs Group for professional services rendered for tax compliance, tax advice and tax planning for the fiscal year ended 2020 were $13,500. The aggregate fee billed by The Wenmohs Group for professional services rendered for tax compliance, tax advice and tax planning for the fiscal year ended 2020 were $12,250.\nAll Other Fees. The aggregate fees billed by Briggs & Veselka Co. for products and services, other than the services described in the paragraphs “Audit Fees,” “Audit-Related Fees,” and “Tax Fees” above for the fiscal years ended September 30, 2021 and 2020 were $7,000 and $0.\nThe Board of Directors has received and reviewed the written disclosures and the letter from the Company’s independent registered public accounting firm required by Independence Standards Board Standard No. 1 (Independence Discussions with Audit Committees) and has discussed with its auditors its independence from the Company. The Board of Directors has considered whether the provision of services other than audit services is compatible with maintaining auditor independence.\nBased on the review and discussions referred to above, the Board of Directors approved the inclusion of the audited financial statements be included in the Company’s Annual Report on Form 10-K for its 2020 fiscal year for filing with the SEC.\nThe Board of Directors pre-approved all fees described above.\nPART IV",
    "item_15": "ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n2.1\nAgreement and Plan of Merger (incorporated by reference to Exhibit 2.1 to Current Report on Form 8-K filed September 13, 2021)\n3.1\nCertificate of Incorporation (incorporated by reference to the Company’s Current Report on Form 8-K filed on September 30, 2021).\n3.2\nBylaws (incorporated by reference to Exhibit 3.2 to the Company’s Current Report on Form 8-K, filed on September 30, 2021).\n4.1\nDescription of the Registrant’s Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934 (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K, filed on September 30, 2021).\n10.1\nRegistration Rights Agreement dated March 31, 2021 (incorporated by reference to Exhibit 10.3 to the Company’s Quarterly Report on Form 8-K filed on April 8, 2021.\n10.2\nEmployment Agreement of Dr. Albert Carlson (incorporated by reference to Exhibit 10.15 to the Company’s Current Report on Form 8-K filed on September 4, 2015).?\n10.3\nIndemnification Agreement by and between the Company and Paulson Investment Company, LLC (incorporated by reference to Exhibit 10.6 to the Company’s Current Report on Form 8-K filed on April 8, 2021).\n10.4\nTechnology Partnership and Authorized Reseller Licensing Agreement between the Company and ECS Federal, LLC (incorporated by reference to Exhibit 10.7 to the Company’s Registration Statement on Form S-1 filed on April 30, 2021)\n10.5\nDeveloper Agreement between the Company and Arnouse Digital Devices (incorporated by reference to Exhibit 10.7 to the Company’s Registration Statement on Form S-1 filed on April 30, 2021)\n10.6\nAuthorized Reseller/Developer Agreement with Arouse Digital Devices (incorporated by reference to Exhibit 10.21 to the Company’s Current Report on Form S-1 filed on April 30, 2021)\n10.7\nLetter Agreement with Paulson Investment Company, LLC (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed on July 28, 2021)\n10.8\nEmployment Agreement with Nick Hnatiw\n10.9\nExecutive Employment Agreement with Ryan Polk (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed on September 30, 2021)\n10.10\n2019 Stock Incentive Plan, Effective as of August 8, 2019 (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed on August 12, 2019.\n10.11\nExecutive Offer Letter accepted by David Chasteen\n14.1\nCode of Ethics for Directors, Officers and Employees of Cipherloc and its Affiliates, dated August 8, 2019 (filed as Exhibit 14.1 to a Current Report on Form 8-K, filed on August 12, 2019)\n31.1\nCertification of Principal Executive Officer Pursuant to the Securities Exchange Act of 1934, Rules 13a-14 and 15d-14, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2\nCertification of Principal Financial Officer Pursuant to the Securities Exchange Act of 1934, Rules 13a-14 and 15d-14, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, there unto duly authorized.\nCipherloc Corporation\nDate: December 20, 2021 By: /s/ David Chasteen\nDavid Chasteen\nChief Executive Officer, Director\nDate: December 20, 2021 By: /s/ Ryan Polk\nRyan Polk\nPrincipal Financial Officer\nIn accordance with the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Company and in the capacities and on the dates indicated.\nDate: December 20, 2021 By: /s/ David Chasteen\nDavid Chasteen\nChief Executive Officer, Director\nDate: December 20, 2021 By: /s/ Tom Wilkinson\nTom Wilkinson\nChairman of the Board of Directors\nDate: December 20, 2021 By: /s/ Anthony Ambrose\nAnthony Ambrose\nDirector\nDate: December 20, 2021 By: /s/ Sammy Davis\nSammy Davis\nDirector"
}