{
    "cik": "1023731",
    "company": "8X8 INC /DE/",
    "filing_type": "10-K",
    "filing_date": "2021-05-17",
    "period_of_report": "2021-03-31",
    "sic": "7374",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "0331",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1023731/0001023731-21-000091-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1023731/000102373121000091/eght-20210331.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1023731/0001023731-21-000091.txt",
    "filename": "1023731_10K_2021_0001023731-21-000091.htm",
    "item_1": "ITEM 1. BUSINESS\nOverview\n8x8 is transforming the future of business communications as a leading Software-as-a-Service (\"SaaS\") provider of voice, video, contact center, and communication APIs powered by a global cloud communications platform. 8x8 empowers workforces worldwide by connecting individuals and teams so they can collaborate faster and work smarter from anywhere. 8x8 provides real-time business analytics and intelligence giving its customers unique insights across all interactions and channels on our platform so they can support a distributed and hybrid working model while delighting their end-customers and accelerating their business. 8x8 has approximately 1.8 million paid business users.\nUntil recently, the unified communications market had been one of the last to move to the cloud. This past year's rapid acceleration of digital transformation has boards and executive leadership teams increasingly looking towards secure cloud communications as a core element of business resilience. Through seamless, personalized engagement, these organizations are able to drive differentiated customer experiences. We believe the ability for employees to communicate productively from either a single, easy-to-use application or directly within their existing business applications is quickly becoming a fundamental differentiator in digital transformation.\nThe 8x8 open communications platform is a highly available, fully redundant solution, supported by a single, standard and financially-backed Service Level Agreement across unified communications as a service (\"UCaaS\") and contact center as a service (\"CCaaS\"). It is one of the industry’s most complete cloud technology stack and operates in a SaaS business model. A consistent data layer across the platform powers 8x8 AI/ML (artificial intelligence/machine learning) algorithms to deliver data-driven business insights and intelligent, comprehensive, and integrated applications that drive employee productivity, resource optimization, and more effective end customer interactions. Our cloud communications, contact center, and collaboration solutions are designed for easy deployment, management, and use, operating across multiple devices and locations for any business workflow or global environment. Built from core cloud technologies that we own and manage internally, our platform solution enables 8x8 customers to rely on one provider for their global communications, video meetings, contact center and customer support requirements.\nThe 8x8 Platform Strategy\nWe offer a highly scalable and configurable cloud communications platform comprising voice, video meetings, chat and team collaboration, contact center, communication APIs, and analytics for businesses of all sizes across the globe. Customers can start out with an individual service or combination of services, for example, with video conferencing or phone service, and then scale their usage over time by enabling additional services, capabilities and analytics offerings when ready. The key attributes of the 8x8 solution include:\n•Unified Communications, Collaboration, and Contact Center on a single, API-based Cloud Technology Platform. We believe that a common platform for communication and collaboration drives more efficient employee and customer engagement and greater business productivity. Unlike many of our principal competitors, we own the core technology and manage the platform behind all of our services: voice, video meetings, contact center, chat and team collaboration, and communications APIs. We believe having control over our entire platform enables us to deliver a more consistent and seamless experience for our customers across all aspects of the service from the user interface to the technical support experience.\n•Big Data, Analytics, and Artificial Intelligence. We have developed a suite of web-based analytics tools to help customers make informed decisions based on underlying communications data associated with 8x8 services and supported devices. We continue to make strategic investments in Artificial Intelligence (AI) and Machine Learning (ML) to develop new capabilities and features for our customers such as context-rich customer engagements, intelligent call routing and faster first-call resolution.\n•Global Reach®. 8x8's Global Reach® technology provides enterprise-grade quality of service, reliability, security and support for our multinational customers. Our platform utilizes intelligent geo-routing technology and leverages data centers across globally dispersed regions - North America, South America, Continental Europe, Asia, and Australia - to provide consistently high call quality to customers worldwide.\n•Intuitive User Experience. Our web, desktop, and mobile interfaces act as the communications portal for all 8x8 services and provide customers with a familiar, consistent and integrated user experience across all endpoints.\n•Committed Service Quality and Availability over the Public Internet. We offer a single, standard Service Level Agreement (“SLA”) for our enterprise customers across our contact center and business communications services. This SLA includes meaningful uptime and voice quality commitments, backed by service credits and a no-penalty early termination right for the customer under specified conditions.\n•Configurability and Flexibility. Each service plan in our flagship offering, X Series, is designed for the different roles in a company so customers only pay for the features each role needs. No matter what the business communication or contact center needs are now, X Series has a service plan designed to meet them, while giving customers an easy way to expand and upgrade their communications options in the future. The simplicity and ease of configuration and deployment is due to all solutions being owned by 8x8 and sharing the same platform.\n•Rapid Deployment. Business agility in the global, modern economy is a competitive necessity, and we embrace the notion that communication services should be deployable as quickly as possible, including across highly distributed businesses with multiple facilities or remote workforces. Our services can generally be provisioned in minutes from web-based administrative tools, and we continue to increase the automation across our deployment, billing, and support systems to provide greater speed and flexibility for our customers. To ensure consistency and quality across our services and customer base, we have developed a standard, yet flexible, deployment methodology. We apply this systematic approach to all of our deployments, regardless of size or complexity.\n•Integration with Third-Party Business Applications. Our software uses a combination of open APIs and pre-built integrations to retrieve contextually relevant data from, and to enhance the functionality of, a wide variety of customers' third-party applications, including Salesforce, Microsoft Dynamics, Google, NetSuite, Okta, Zendesk, Oracle Sales Cloud, Bullhorn, Aryaka, and Hubspot.\n•Emphasis on Security and Compliance. Our security program is designed to protect the confidentiality, integrity and availability of our customers data. We believe we have created a top-down culture of security and compliance, including a commitment to secure architecture and development. As such, we have made significant investments in achieving compliance with various industry standards for data security and related third-party certifications.\n•Jitsi Open Source Video Project. 8x8 is the sponsor and primary contributor to the Jitsi secure video conferencing open source project. We operate jitsi.org and the Jitsi Meet service, and develop our Video Meetings portfolio based on this code. 8x8 offers the Jitsi community an intuitive upgrade path to rich, supported communications applications.\nOur Solutions Through our integrated technology platform, we offer our customers a portfolio of voice, video, contact center, chat and team collaboration, communication APIs and business analytics solutions which include:\n•8x8 Work: a self-contained, feature-rich, end-to-end United Communications solution that delivers enterprise voice with PSTN connectivity, secure video meetings and unified messaging powered by one global cloud communications platform.\n•8x8 Contact Center: a multi-channel cloud-based contact center solution that enables both large and small contact centers to enjoy the same customer experience and agent productivity benefits previously available only to large contact centers at a much higher cost.\n•8x8 Meet: a cloud-based video conferencing and collaboration solution that enables secure, continuous collaboration with borderless high definition (HD) video and audio communications from mobile and desktop devices anywhere in the world.\n•8x8 Team Messaging: an integrated open team messaging platform to facilitate modern modes of communication with support for direct messages, public and private team messaging rooms, short messaging service (\"SMS\"), presence, emojis, and “@ mentions” (i.e., embedded links directed at named users). With our team messaging technology, our customers can collaborate across more than twenty third-party messaging solutions.\n•8x8 CPaaS: a comprehensive set of global communications platform-as-a-service (\"CPaaS\") capabilities that enable business to directly integrate our platform services within their websites, mobile apps and business systems for personalized customer engagement at high scale. Our SMS, Chat App, Video Interaction, 8x8 Jitsi-as-a-Service, and Voice APIs enable companies to reach their customers anywhere with a proven, reliable global network. The AI-powered 8x8 Callstats Service provides real-time metrics and analytics on a WebRTC session to improve voice and video quality of service.\n8x8 X Series\nThe capabilities of our core communications solutions are integrated into a comprehensive bundled offering called 8x8 X Series in addition to being available on an individual basis. X Series service plans are designed so customers pay for only those capabilities the business needs while providing businesses with an upgrade path over time as their needs evolve and grow.\nDesignated X1 through X8, we offer the following service plans and capabilities in the 8x8 X Series:\n•X1 through X4 provide enterprise-grade voice, unified communications, video meetings and team collaboration functionality. Delivered from a single platform, these service plans provide one application for business voice, team messaging and meetings so that employees can quickly, easily and with just one click move from a chat message to a phone call to a video conference. Users can access the essential communication and collaboration features through the desktop app, mobile app or a desk phone. As a business grows, the details and features of plans can be mapped to business needs such as a lobby or store floor, a global caller organization, or to supervisor/analyst requirements. Features expected by demanding communications and collaboration customers today, such as: auto attendants; worldwide extension dialing; corporate directory with click-to-call functionality; presence, messaging and chat; call recording; call monitoring; internet fax; and the ability to interact contextually with inbound communication (email, call or chat) can be mixed and matched for customizable packages fit for business to most effectively meet the needs of individual users.\n•X5 through X8 generally provide the features of X1 through X4, plus contact center functionality. These service plans deliver employee experience and deep customer engagement through integrated cloud communication, contact center software and video meetings solutions. Whether the customer is managing a startup or a large enterprise, 8x8 X Series provides the communication capabilities that contact center agents need to respond faster using instant access to relevant information and subject matter experts. Designed to ensure that customers pay for only the requirements needed, there are four X Series Cloud Contact Center service plans: the Voice-Focused Contact Center with Predictive Dialer Plan; the Voice-Focused Contact Center with Advanced Reporting Plan; the Multichannel Contact Center with Advanced Reporting Plan; and the Multichannel Contact Center with Advanced Analytics and Predictive Dialer Plan, inclusive of quality management, speech analytics, and outbound predictive AI dialer.\nThe result is a communication, meeting, and contact center engagement platform that enables businesses to move at the speed of employee and customer expectations, leading to less churn and more revenue. While we believe in and continue to emphasize the power of the platform as the collective offering of our solutions, we also make our solutions available independently to introduce customers to our platform and expand their platform engagement over time.\nRoutes to Market\nWe sell directly to customers or through indirect sales channels . Our indirect sales channel consists of global and regional networks of value-added resellers (\"VARs\") and carriers, as well as a partner network consisting of master agents and the sub-agent community, independent software vendors (\"ISVs\"), system integrators, and service providers selling 8x8 solutions to small, mid-market, and enterprise businesses.\nOur Customers\nWe have a diverse and growing customer base of more than 58,000 companies in more than 150 countries, with no single customer representing 10% or more of our revenues in fiscal 2021, 2020, and 2019. This includes companies of every size and across a wide range of industries and use cases.\nMarketing and Promotional Activities\nWe market our services directly to end users through a variety of means, including search engine marketing and optimization, third-party lead generation sources, industry conferences, trade shows, webinars, and digital advertising channels. We primarily sell our solutions and subscriptions through a direct sales organization, consisting of inside and field-based sales agents based in the U.S. and internationally.\nResearch and Development\nThe cloud communications market is characterized by rapid technological changes and advancements, typical of most SaaS markets. Accordingly, we make substantial investments in the design and development of new products and services, as well as the development of enhancements and features to our existing products and services, and make these enhancements available to our customers frequently. We currently employ individuals in research, development, and engineering activities in the United States, United Kingdom, Romania, Singapore, and Philippines, as well as outsourced software development consultants around the world.\nIntellectual Property\nAs of March 31, 2021, we have been awarded more than 250 patents, with more than 100 U.S. and foreign patent applications pending. Our portfolio of patents, with expiration dates through 2038, and patent applications cover diverse aspects of our unified communications, video, API, collaboration and contact center services and infrastructure.\nOur business relies on a combination of trade secrets, patents, copyrights, trademarks laws and contractual restrictions, such as confidentiality agreements, licenses, and intellectual property assignment agreements. We require our employees, contractors, and other third parties to sign agreements providing for the maintenance of confidentiality and also the assignment of rights to inventions made by them while providing services to us. We also use software components in our platform that are licensed to the public under open source licenses.\nSee the section entitled “Risks Related to Intellectual Property” in Part I,",
    "item_1A": "ITEM 1A. RISK FACTORS\nOur operations and financial results are subject to various risks and uncertainties. You should consider carefully the risks and uncertainties described below, together with all of the other information in this report. If any of the following risks or other risks actually occur, our business, financial condition, results of operations, and future prospects could be materially harmed, and the price of our common stock could decline. Our business could also be materially and adversely affected by risks and uncertainties that are not presently known to us or that we currently believe are not material. Unless otherwise indicated, references to our business being harmed in these risk factors will include harm to our results of operations, financial condition, reputation and future prospects.\nRisk Factors Table of Contents\nRisks Related to our Business and Industry\nRisks Related to our Products and Operations\nRisks Related to Regulatory Matters\nRisks Related to Intellectual Property\nRisks Related to our Debt, our Stock, and our Charter\nGeneral Risk Factors\nRisks Related to our Business and Industry\nWe have a history of losses, have incurred significant negative cash flows in the past, and anticipate continuing losses in the future. As such, we may not be able to achieve or maintain profitability in the future.\nWe recorded a net operating loss of approximately $146.1 million for the twelve months ended March 31, 2021, and ended the period with an accumulated deficit of approximately $591.1 million. We expect to continue to incur operating losses in the near future as we continue to invest in our business. During our fiscal year ending March 31, 2022, we intend to invest in sales and marketing, and in research and development, among other areas of our business, in order to compete more successfully for the business of companies that are transitioning to cloud communications and otherwise position ourselves to take advantage of long-term revenue-generating opportunities.\nWe expect to continue to incur losses for at least the next fiscal year and later and we will need to increase our rate of revenue growth in order to generate and sustain operating profitability in future periods. The investments we have made in fiscal 2021 and beyond may not generate the returns that we anticipate, which could adversely impact our financial condition and make it more difficult for us to grow revenue and/or achieve profitability in the time period that we expect, or at all. In order to achieve profitability, we will need to manage our cost structure more efficiently, not incur significant liabilities, while continuing to grow our revenues. Despite these efforts, our revenue growth may slow, revenues may decline, or we may incur significant losses in the future due to the continuing impact of COVID-19 and any resulting downturn in general economic conditions, increasing competition (including competitive pricing pressures), decrease in the adoption or sustained use of cloud communications market, exiting lines of business, or our inability to execute on business opportunities. Given our history of fluctuating revenues and operating losses, we cannot be certain that we will be able to achieve or maintain operating profitability in the future.\nOur future operating results, including revenues, expenses, losses and profits, may vary substantially from period to period and may be difficult to predict. As a result, we may fail to meet or to exceed the expectations of market analysts or investors, which could negatively impact our stock price.\nOur historical operating results have fluctuated and will likely continue to fluctuate in the future, and a decline in our operating results could cause our stock price to fall. On an annual and a quarterly basis, there are a number of factors that may affect our operating results, some of which are outside our control. These include, but are not limited to:\n•changes in market demand;\n•customer cancellations, subscription downgrades and/or service credits;\n•changes in the competitive dynamics of our market, including consolidation among competitors or customers;\n•lengthy sales cycles and/or regulatory approval cycles;\n•new product introductions by us or our competitors;\n•the mix of our customer base, sales channels, and services sold;\n•the number of additional customers, on a net basis;\n•the amount and timing of costs associated with recruiting, training and integrating new employees;\n•unforeseen costs and expenses related to the expansion of our business, operations and infrastructure;\n•continued compliance with industry standards and regulatory requirements;\n•material security breaches or service interruptions due to cyber attacks or infrastructure failures or unavailability; and\n•introduction and adoption of our cloud software solutions in markets outside of the United States.\nDue to these and other factors, we believe that period-to-period comparisons of our results of operations are not meaningful and should not be relied upon as indicators of our future performance. It is possible that in some future periods our results of operations may be below the expectations of public market analysts and investors.\nIn addition, changes in regulations, accounting principles, and our interpretation of these and judgments used in applying them, could have a material effect on our results of operations. We also need to revise our business processes, systems, and controls which requires significant management attention and may negatively affect our financial reporting obligations. If any of these were to occur, the price of our common stock would likely decline significantly.\nChurn in our customer base adversely impacts our revenues and requires us to spend money to retain existing customers and to capture replacement customers. If we experience further increases in customer churn in the future, our revenue growth will be further adversely impacted and our customer retention costs will increase.\nOur customers may elect not to renew their subscriptions at the end of their contractual commitment. Because of churn, we must acquire new customers and sell additional 8x8 products and services to our existing customers on an ongoing basis in order to maintain our existing level of revenue. As a result, sales and marketing expenditures are an ongoing requirement of our business. Our ability to maintain and grow our revenues is adversely impacted by the rate at which our customers cancel or downgrade service. Churn reduces our revenue growth rate, and if our churn rate increases, we have to acquire even more new customers and/or sell more products and services to existing customers, in order to maintain and grow our revenues. We incur significant costs to acquire new customers, and those costs are a meaningful component in driving our net profitability. Churn may also prevent us from increasing the price of our services in the future as well as limiting our ability to sell additional 8x8 products and services to our existing customers and we may need to renew certain customers at a lower rate, each of which would adversely impact our revenues in the future. Therefore, if we are unsuccessful at managing our existing customer churn and/or our customer churn rate increases in the future, our revenue growth would decrease and our revenues may decline causing our net loss to increase.\nOur rate of customer cancellations or downgrades in services may increase in future periods due to a number of factors, some of which are beyond our control, such as the financial condition of our customers or the general economic environment. In addition, if we are unable to maintain the quality and performance of our service whether due to a lack of feature parity or quality of service relative to the products of our competitors or due to service outages or disruptions, we could experience potentially sharp increases in customer cancellations and/or downgrades or customer credits which would adversely impact our revenues.\nOur success depends on our ability to acquire new customers, and to retain and sell additional services to our existing customers.\nWe generate revenue primarily from the sale of subscriptions to our cloud communications services to our customers, which include small and mid-size businesses, mid-market and larger enterprises, government agencies and other organizations. We define a “customer” as the legal entity or entities to which we provide services pursuant to a single contractual arrangement. Our future success depends on our ability to continue to increase the amount of revenue we generate, and the rate at which our revenues increase, from new and existing customers.\nIf our sales and marketing efforts are not effective in identifying and qualifying prospective new customers, demonstrating the quality, value, features and capabilities of our solutions to those prospects, and promoting our brand generally, we may not be able to acquire new customers at the rate necessary to achieve our revenue targets. We must also continue to design, develop, offer and sell services whose quality, cost, features and capabilities compare favorably to those offered by our competitors. As our target markets mature, or as competitors introduce lower cost and/or more differentiated products or services that compete or are perceived to compete with ours, we may be unable to attract new customers, on favorable terms, or at all, which could have an adverse effect on our revenue and growth.\nIn addition to acquiring new customers, we generate new revenue by selling our existing customers additional quantities of subscribed services, or subscriptions to new or upgraded services. Particularly in the case of large enterprises, we often have opportunities to expand the sale of our services within an organization after we have completed an initial sale to one part of the organization (for example, a business unit, division or department, or personnel based in a particular country or region) and the organization has qualified us as a vendor. We invest in efforts to educate and train users on the features and capabilities of our services so that they can become advocates within their organization and encourage increased adoption of our solutions. However, if existing users within an organization are dissatisfied with any aspect of our cloud services, or the technical support, training or other professional services we provide, we may face challenges in up-selling or increasing our penetration of the organization.\nIntense competition for new customers and retaining existing customers (including pricing pressure) in the markets in which we compete may prevent us from increasing or sustaining our revenue growth, or achieving and maintaining profitability, which could materially harm our business.\nThe cloud communications industry is competitive and rapidly evolving. We expect the industry to be increasingly competitive in the future due to a number of factors including, but not limited to, the entry into the market of new competitors or the consolidation of existing competitors. Because we offer multiple services from a single platform, we compete with businesses in several overlapping industries, including voice, video meetings, chat, team messaging, contact center and enterprise-class API solutions.\nIn connection with our voice, video meetings, chat, team messaging, contact center, and enterprise-class API solutions, we face competition from other cloud service providers such as RingCentral, Inc., Genesys, Zoom Video Communications, Inc., Vonage Holdings Corp., Five9, Inc., NICE inContact, and Twilio Inc., among others as well as from legacy on-premises communications equipment providers such as Avaya, Cisco, and Mitel.\nWe may also face competition from Internet and cloud service companies such as Alphabet Inc. (Google Voice and Google Meet), Amazon Inc., and Microsoft Corporation, some of which are well established in the communications industry while others have only recently begun to market cloud communications solutions. Some of these competitors have developed software solutions for their respective communications and/or collaboration silos, such as Microsoft which is investing significantly in its Microsoft Teams unified communication and collaboration product. Any of these companies could launch a new cloud-based business communications service, expand its existing offerings to compete with features of our services, or enter into a strategic partnership with, or complete an acquisition of, one or more of our cloud communications competitors.\nMany of our current and potential competitors have greater resources and brand awareness, and a larger base of customers than we have. As a result, these competitors may have greater marketing credibility. They also may adopt more aggressive pricing policies and devote greater resources to the development, promotion and sale of their products and services. Our competitors may also offer bundled service arrangements that present a more differentiated or better integrated product and services to customers. Increased competition could require us to lower our prices, reduce our sales revenue, increase our gross losses or cause us to lose market share. Announcements, or expectations, as to the introduction of new products and technologies by our competitors or us could cause customers to defer purchases of our existing products and services, which also could have a material adverse effect on our business, financial condition or operating results.\nGiven the significant price competition in the markets for our services, we may be at a disadvantage compared with those competitors who have substantially greater resources than us or may otherwise be better positioned to withstand an extended period of downward pricing pressure. The harm to our business may be magnified if we are unable to adjust our expenses to compensate for such shortfall, or if we determine that we need to increase our marketing and sales efforts in order to attract new customers and retain existing customers.\nFailure to grow and manage our network of indirect sales channels partners could materially and adversely impact our revenues in the future.\nOur future business success, particularly to attract and support larger customers and expand into international markets, depends on our indirect sales channels. These channels consist of master agents and subagents, independent software vendors (\"ISVs\"), system integrators, value-added resellers (\"VARs\"), and internet service providers, among others. We typically contract directly with the end customer and use these channel partners to identify, qualify and manage prospects throughout the sales cycle-although we also have arrangements with partners who purchase our services for resale to their own customers. Our future success depends upon our ability to develop and maintain successful relationships with these business partners, many of whom also market and sell services of our competitors and increasing the portion of sales opportunities they refer to us. To do so, we must continue to offer services that have quality, price, features, and other elements that compare favorably to competing services, ensure our partners are adequately trained and knowledgeable about our services, and provide sufficient incentives for these partners to sell our services in preference to those of our competitors. If we are unable to persuade our existing business partners to increase their sales of our services, or to build successful partnerships with new organizations, or if our channel partners are unsuccessful in their marketing and sales efforts, we may not be able to grow our business and increase our revenues at the rate we predict, or at all, and our business may be materially, adversely affected.\nAs we increase sales to enterprise customers, our sales process has become more complex and resource-intensive, our average sales cycle has become longer, and we have more difficulty predicting when sales will be completed.\nWe currently derive a majority of our new revenue growth from sales of our cloud software solutions to mid-market and larger enterprises, and we believe that increasing our sales to these customers is the key to our future growth. Our sales cycle, which is the time between initial contact with a potential customer and the ultimate sale to that customer, is often lengthy and unpredictable for larger enterprise customers. Many of our prospective enterprise customers do not have prior experience with cloud-based communications and, therefore, typically spend significant time and resources evaluating our solutions before they purchase from us. Similarly, we typically spend more time and effort determining their requirements and educating these customers about the benefits and uses of our solutions. Enterprise customers also tend to demand more customizations, integrations, and additional features than smaller customers. As a result, we may be required to divert more sales and engineering resources to a smaller number of large transactions than we have in the past, which means that we will have less personnel available to support other sectors, or that we will need to hire additional personnel, which would increase our operating expenses.\nIt is often difficult for us to forecast when a potential enterprise sale will close, the size of the customer's initial service order and the period over which the implementation will occur, any of which may impact the amount of revenue we recognize or the timing of revenue recognition. Enterprise customers may delay their purchases from one quarter to another as they assess their budget constraints, negotiate early contract terminations with their existing providers or wait for us to develop new features. Any delay in closing, or failure to close, a large enterprise sales opportunity in a particular quarter or year could significantly harm our projected growth rates and cause the amount of new sales we book to vary significantly from quarter to quarter. We also may have to delay revenue recognition on some of these transactions until the customer's technical or implementation requirements have been met.\nThe market for cloud software solutions is subject to rapid technological change, and we depend on new product and service introductions in order to maintain and grow our business.\nWe operate in an emerging market that is characterized by rapid changes in customer requirements, frequent introductions of new and enhanced products and services, and continuing and rapid technological advancement. To compete successfully in this emerging market, we must continue to design, develop, manufacture, and sell highly scalable new and enhanced cloud software solutions products and services that provide higher levels of performance and reliability at lower cost. If we are unable to develop new products and services that address our customers' needs, to deliver our cloud software solution applications in one seamless integrated service offering that addresses our customers' needs, or to enhance and improve our products and services in a timely manner, we may not be able to achieve or maintain adequate market acceptance of our services.\nOur ability to grow is also subject to the risk of future disruptive technologies. If new technologies emerge that are able to deliver communications and collaboration solution services at lower prices, more efficiently, more conveniently, or more securely, such technologies could adversely impact our ability to compete.\nWe may have difficulty attracting or retaining senior management and other personnel with the industry experience and technical skills necessary to support our growth.\nCompanies in the cloud communications industry compete aggressively for top talent in all areas of business, but particularly senior management, sales and marketing, professional services, and engineering, where employees with industry experience, technical knowledge and specialized skill sets are particularly valued. Demand can be expected to increase if cloud communications continues to gain a greater share of the global communications market. Some of our competitors may respond to these competitive pressures by increasing employee compensation, paying more on average than we pay for the same position. Any such disparity in compensation could make us less attractive to candidates as a potential employer, which in turn may make it more difficult for us to hire and retain qualified employees. Training an individual who lacks prior cloud communications experience to be successful in a sales or technical role can take months or even years.\nIf an employee of 8x8 leaves to work for a competitor, not only are we impacted by the loss of the individual resource, but we also face the risk that the individual will share our trade secrets with the competitor in violation of their contractual and legal obligations to us. Our competitors have in the past and may in the future target their hiring efforts on a particular department, and if we lose a group of employees to a competitor over a short time period, our day-to-day operations may be impaired. While we may have remedies available to us through litigation, they would likely take significant time and expense and divert management attention from other areas of the business.\nIf we increase employee compensation (beyond levels that reflect customary performance-based and/or cost-of-living adjustments) in response to competitive pressures, we may sustain greater operating losses than we predicted in the near term, and we may not achieve profitability within the timeframe we had expected, or at all. In addition, we may need to issue equity at increased levels, now and in the future, to attract and retain key employees and executives, including weighting a greater percentage of our employees total compensation in the form of equity as opposed to cash, which will have the adverse effect of increasing dilution for our stockholders.\nTaxing authorities have asserted that we should have collected or in the future should collect sales and use, value added, or similar taxes, including where similar services from competitors may not be subject to the same obligations to collect taxes from customers, and we have been and could be in the future subject to liability with respect to past or future sales, which have and could adversely affect our business.\nThe applicability of state and local taxes, fees, surcharges or similar taxes to our services is complex, ambiguous and subject to interpretation and change. In the United States, for example, we collect state and local taxes, fees and surcharges based on our understanding of the applicable laws in the relevant jurisdiction. The taxing authorities may challenge our interpretation of the laws and may assess additional taxes, penalties and interests which could have adverse effects on the results of operations and, to the extent we pass these through to our customers, demand for our services. Additionally, the applicability of sales and use, value added, or similar taxes may differ between services such as unified communication, voice, video, contact center and platform communications such that the obligations to collect taxes from customers may vary between services and between companies such that we may be obligated to collect taxes at a higher rate that other services from our competitors impacting customer demand for our services. We currently file more than 1,000 state and municipal tax returns monthly. Periodically, we have received inquiries from state and municipal taxing agencies with respect to the remittance of state or municipal taxes, fees or surcharges. Currently, several jurisdictions are conducting audits of 8x8; in the event our positions are unsuccessful, we may be subject to tax payments, interest, and penalties in excess of those that we have accrued for. As of March 31, 2021, we have accrued for state or municipal taxes, fees or surcharges that we believe are required to be remitted.\nOur ability to use our net operating losses or research tax credits to offset future taxable income may be subject to certain limitations.\nAs of March 31, 2021, we had federal net operating loss (“NOL”) carryforwards related to fiscal 2019 and later of approximately $433.0 million which carryforward indefinitely and carryforwards related to prior years of $137.8 million which begin to expire in 2022. As of March 31, 2021, the Company had state net operating loss carryforwards $296.6 million, which expire at various dates between 2029 and 2041. We also had research and development credit carryforwards for federal and California tax purposes of approximately $15.3 million and $16.9 million, respectively. The federal income tax credit carryforwards related to research and development will expire at various dates between 2022 and 2041, while the California income tax credits will carry forward indefinitely, but are subject to an annual cap of $5 million for tax years beginning on or after January 1, 2020 and before January 1, 2023. Utilization of our NOL and tax credit carryforwards can become subject to a substantial annual limitation due to the ownership change limitations provided by Section 382 of the Internal Revenue Code and similar state provisions. A Section 382 ownership change generally occurs if one or more stockholders or groups of stockholders who own at least 5% of the stock increase their ownership by more than 50 percentage points over their lowest ownership percentage within a rolling three-year period. Similar rules may apply under state tax laws. Such an ownership change, or any future ownership change, could have a material effect on our ability to utilize the net operating loss or research credit carryforwards. In addition, under the Tax Cuts and Jobs Act, or the Tax Act, the amount of NOLs that we are permitted to deduct in any taxable year is limited to 80% of the taxable income in such year. Under the CARES Act, this 80% limitation has been eliminated for tax years beginning before January 1, 2021. There is a risk that due to changes under the Tax Act, regulatory changes, or other unforeseen reasons, the existing NOLs could expire or otherwise be unavailable to offset future income tax liabilities, which could have a material impact on our net income (loss) in future periods.\nRisks Related to our Products and Operations\nIf our platform or services experience significant or repeated disruptions, outages or failures due to defects, bugs, vulnerabilities or similar software problems, or if we fail to determine the cause of any disruption or failure and correct it promptly, we could lose customers, become subject to service performance or warranty claims or incur significant costs, reducing our revenues and adversely affecting our operating results.\nOur customers use our communications services to manage important aspects of their businesses, and any errors, defects, outages, or disruptions to our service or other performance problems with our service could hurt our reputation and may damage our customers' businesses, any of which may result in our granting of credits to customers that in turn would reduce our revenue. Our services and the systems infrastructure underlying our cloud communications platform incorporate software that is highly technical and complex. Our software has contained, and may now or in the future contain, undetected errors, bugs, or vulnerabilities to hackers, which have caused, and may in the future cause, temporary service outages or other disruptions for some customers. Some errors in our software code may not be discovered until after the code has been released. Any errors, bugs, or vulnerabilities discovered in our code after release could result in damage to our reputation, loss of customers, loss of revenue, or liability for service credits or damages, any of which could adversely affect our business and financial results. We implement bug fixes and upgrades as part of our regularly scheduled system maintenance, which may lead to system downtime. Even if we are able to implement the bug fixes and upgrades in a timely manner, any history of defects, or the loss, damage or inadvertent release of confidential customer data, could cause our reputation to be harmed, and customers may elect not to purchase or renew their agreements with us and subject us to service performance credits, warranty claims or increased insurance costs. The costs associated with any material defects or errors in our software or other performance problems may be substantial and could materially adversely affect our operating results.\nOur physical infrastructure is concentrated in a few facilities (data centers and public cloud providers) and any failure in our physical infrastructure or service outages could lead to significant costs and/or disruptions and could reduce our revenue, harm our business reputation and have a material adverse effect on our financial results.\nOur leased network and data centers as well as public cloud infrastructure are subject to points of failure. Problems with cooling equipment, generators, uninterruptible power supply, routers, switches, or other equipment, whether or not within our control, could result in service interruptions for our customers as well as equipment damage. Because our services do not require geographic proximity of our data centers to our customers, our infrastructure is consolidated into a few large data center facilities. Any failure or downtime in one of our data center facilities could affect a significant percentage of our customers. While our data center facilities are currently operating as essential businesses exempt from current shelter-in-place orders, further tightening of business closure orders or social distancing or COVID-19 outbreaks could negatively impact these facilities. The total destruction, closure, or severe impairment of any of our data center facilities could result in significant downtime of our services and the loss of customer data. Because our ability to attract and retain customers depends on our ability to provide customers with highly reliable service, even minor interruptions in our service could harm our reputation. Additionally, in connection with the expansion or consolidation of our existing data center facilities from time to time, there is an increased risk that service interruptions may occur as a result of server relocation or other unforeseen construction-related issues.\nWe have experienced interruptions in service in the past. The harm to our reputation is difficult to assess but has resulted and may result in the future in customer attrition. We have taken and continue to take steps to improve our infrastructure to prevent service interruptions, including upgrading our electrical and mechanical infrastructure. However, service interruptions continue to be a significant risk for us and could have a material adverse impact on our business.\nAny future service interruptions could:\n•cause our customers to seek service credits, or damages for losses incurred;\n•require us to replace existing equipment or add redundant facilities;\n•affect our reputation as a reliable provider of communications services;\n•cause existing customers to cancel or elect to not renew their contracts; or\n•make it more difficult for us to attract new customers.\nWe may be required to transfer our servers to new data center facilities or public cloud load to a different public cloud provider in the event that we are unable to renew our agreement or leases on acceptable terms, or at all, or the owners of the facilities decide to close their facilities, and we may incur significant costs and possible service interruption in connection with doing so. In addition, any financial difficulties, such as bankruptcy or foreclosure, faced by our third-party data center operators, or any of the service providers with which we or they contract, may have negative effects on our business, the nature and extent of which are difficult to predict. If our data centers or our public cloud providers are unable to keep up with our increasing needs for capacity, our ability to grow our business could be materially and adversely impacted.\nWe may not be able to scale our business efficiently or quickly enough to meet our customers' growing needs, leading to increased customer churn and damage to reputation and brand, each of which could harm our operating results.\nAs usage of our cloud software solutions by mid-market and larger enterprises expands and as customers continue to integrate our services across their enterprises, we are required to devote additional resources to improving our application architecture, integrating our products and applications across our technology platform, integrating with third-party systems, and maintaining infrastructure performance. As a result of the COVID-19 pandemic, we have seen increased usage of our services from our existing customers and may see further increases in usage from existing and new customers in the future if remote working trends continue to increase as a result of the COVID-19 pandemic or otherwise. To the extent we increase our customer base and as our customers gain more experience with our services, the number of users and transactions managed by our services, the amount of data transferred, processed and stored by us, the number of locations where our service is being accessed, and the volume of communications managed by our services have in some cases, and may in the future, expand rapidly. In addition, we will need to appropriately scale and modernize our internal business systems and our services organization, including customer support, sales operations, billing services and regulatory, privacy and cybersecurity compliance, to serve our growing customer base. Any failure or delay in these efforts could cause impaired system performance and reduced customer satisfaction. These issues could adversely impact our reputation and brand, reduce the attractiveness of our cloud software solutions to customers, resulting in decreased sales to new customers, lower renewal rates by existing customers, the issuance of service credits, or requested refunds, which could hurt our revenue growth and our reputation.\nBecause our long-term growth strategy involves continued expansion outside the United States, our business will be susceptible to risks associated with international operations.\nAn important component of our growth strategy involves the further expansion of our operations and customer base internationally. We have formed subsidiaries outside the United States, including a subsidiary in Romania that contributes significantly to our research and development efforts. Additionally, through acquisitions, we have expanded into the U.K. and Southeast Asia. The risks and challenges associated with sales and other operations outside the United States are different in some ways from those associated with our operations in the United States, and we have a limited history addressing those risks and meeting those challenges. Our current international operations and future initiatives, including Southeast Asia, will involve a variety of risks, including:\n•localization of our services, including translation into foreign languages and associated expenses;\n•regulation of our services as traditional telecommunications services, requiring us to obtain authorizations or licenses to operate in foreign jurisdictions, or alternatively preventing us from selling our full suite of services, or any services at all, in such jurisdictions;\n•changes in a specific country or region's regulatory requirements, taxes, trade laws, or political or economic conditions;\n•increased competition from regional and global cloud communications competitors in the various geographic markets in which we compete where such markets may have different sales cycles, selling processes, and feature requirements which may limit our ability to compete effectively in different regions globally;\n•more stringent regulations relating to data security and the unauthorized use of, access to, and transfer of, commercial and personal information, particularly in the European Union, or EU;\n•differing labor regulations, especially in the EU and Latin America, where labor laws are generally more advantageous to employees as compared to the United States, including deemed hourly wage and overtime regulations in these locations;\n•challenges inherent in efficiently managing an increased number of employees over large geographic distances, including the need to implement appropriate systems, policies, benefits and compliance programs;\n•difficulties in managing a business in new markets with diverse cultures, languages, customs, legal systems, alternative dispute systems and regulatory systems;\n•increased travel, real estate, infrastructure and legal compliance costs associated with international operations;\n•different pricing environments, longer sales cycles, longer accounts receivable payment cycles and other collection difficulties;\n•currency exchange rate fluctuations and the resulting effect on our revenue and expenses, and the cost and risk of entering into hedging transactions if we chose to do so in the future;\n•limitations on our ability to reinvest earnings from operations in one country to fund the capital needs of our operations in other countries;\n•laws and business practices favoring local competitors or general preferences for local vendors;\n•limited or insufficient intellectual property protection;\n•political instability or terrorist activities;\n•exposure to liabilities under anti-corruption and anti-money laundering laws, including the U.S. Foreign Corrupt Practices Act, the U.K. Bribery Act 2010, trade and export laws such as those enforced by the Office of Foreign Assets Control (OFAC) of the U.S. Department of the Treasury, and similar laws and regulations in other jurisdictions;\n•continuing uncertainty regarding social, political, immigration, and tax and trade policies in the U.S. and abroad, including as a result of the United Kingdom's vote to withdraw from the European Union;\n•regional travel restrictions, business closures and shelter-in-place orders and resulting from COVID-19; and\n•adverse tax burdens and foreign exchange controls that could make it difficult to repatriate earnings and cash.\nWe have limited experience in operating our business internationally, which increases the risk that any potential future expansion efforts that we may undertake will not be successful. We expect to invest substantial time and resources to expand our international operations. If we are unable to do this successfully and in a timely manner, our business and operating results could be materially adversely affected.\nWe face risks related to acquisitions now and in the future that may divert our management's attention, result in dilution to our stockholders and consume resources that are necessary to sustain and grow our existing business.\nAlthough we have acquired several small companies and business units in recent years, we have limited experience with purchasing and integrating other businesses. We may not be able to identify suitable acquisition candidates in the future or negotiate and complete acquisitions on favorable terms.\nIf appropriate opportunities present themselves, we may decide to acquire such companies, or their products, technologies or assets. Acquisitions involve numerous risks, and there is no guarantee that we will ultimately strengthen our competitive position or achieve other benefits expected from the transaction. Among other risks we may encounter in connection with acquisitions:\n•We may experience difficulty and delays in integrating the products, technology platform, operations, systems and personnel of the acquired business with our own, particularly if the acquired business is outside of our core competencies;\n•We may not be able to manage the acquired business, or the integration process, effectively, which may limit our ability to realize the financial and strategic benefits we expected from the transaction;\n•The acquisition and integration may divert management’s attention from our day-to-day operations and disrupt the ordinary functioning of our ongoing business;\n•We may have difficulty establishing and maintaining appropriate governance, reporting relationships, policies, controls and procedures for the acquired business, particularly if it is based in a country or region where we did not previously operate;\n•Any failure to successfully manage the integration process may also adversely impact relationships with our employees, suppliers, customers and business partners, or those of the acquired business, and may result in increased churn or the loss of key customers, business partners or employees for our business or those of the acquired business;\n•We may become subject to new or more stringent regulatory compliance obligations and costs by virtue of the acquisition, including risks related to international acquisitions that may operate in new jurisdictions or geographic areas where we may have no or limited experience;\n•We may become subject to litigation, investigations, proceedings, fines or penalties arising from or relating to the transaction or the acquired business, and any resulting liabilities may exceed our forecasts;\n•We may acquire businesses with different revenue models, customer concentration risks, and contractual relationships;\n•We may assume long-term contractual obligations, commitments or liabilities (for example, those relating to leased facilities), which could adversely impact our efforts to achieve and maintain profitability and impair our cash flow;\n•We may not successfully evaluate or utilize the acquired technology and accurately forecast the financial impact of an acquisition transaction, including accounting charges; and\n•The acquisition may create a drag on our overall revenue growth rate, which could lead analysts and investors to reduce their valuation of our company.\nIn addition, we may have to pay cash, incur debt, or issue equity securities to pay for any such acquisition, each of which could affect our financial condition or the value of our capital stock. The sale of equity to finance any such acquisitions could result in dilution to our stockholders. If we incur more debt, it would result in increased fixed obligations and could also subject us to covenants or other restrictions that would impede our ability to flexibly operate our business.\nAs a result of these potential problems and risks, among others, businesses that we may acquire or invest in may not produce the revenue, competitive advantages, or business synergies that we anticipate, and the results and effects of any such acquisition may not be favorable enough to justify the amount of consideration we pay or the other investments we make in the acquired business.\nIf we do not or cannot maintain the compatibility of our communications and collaboration software with third-party applications and mobile platforms that our customers use in their businesses, our revenue could decline.\nThe functionality and popularity of our cloud software solutions depends, in part, on our ability to integrate our services with third-party applications and platforms, including enterprise resource planning, customer relations management, human capital management, workforce management, and other proprietary application suites. Third-party providers of applications and application programmable interfaces, or APIs, may change the features of their applications and platforms, restrict our access to their applications and platforms or alter the terms governing use of their applications and APIs and access to those applications and platforms in an adverse manner. Such changes could functionally limit or terminate our customers’ ability to use these third-party applications and platforms in conjunction with our services, which could negatively impact our offerings and harm our business. If we fail to integrate our software with new third-party back-end enterprise applications and platforms used by our customers, we may not be able to offer the functionality that our customers need, which would negatively impact our ability to generate revenue and adversely impact our business.\nOur services also allow our customers to use and manage our cloud software solutions on smartphones, tablets and other mobile devices. As new smart devices and operating systems are released, we may encounter difficulties supporting these devices and services, and we may need to devote significant resources to the creation, support, and maintenance of our mobile applications. In addition, if we experience difficulties in the future integrating our mobile applications into smartphones, tablets or other mobile devices or if problems arise with our relationships with providers of mobile operating systems, such as those of Apple Inc. or Alphabet Inc. (Google), our future growth and our results of operations could suffer.\nTo provide our services, we rely on third parties for our network service and connectivity and any disruption or deterioration in the quality of these services or the increase in the costs we incur from these third parties could adversely affect our business, results of operations and financial condition.\nWe rely on third-party network service providers to originate and terminate substantially all of the PSTN calls using our cloud-based services. We leverage the infrastructure of third-party network service providers to provide telephone numbers, PSTN call termination and origination services, and local number portability for our customers rather than deploying our own network throughout the United States and internationally. We use the infrastructure of third-party network service providers, such as Equinix, Inc. and CenturyLink, Inc. and public cloud providers including AWS and Oracle, to provide our cloud services over their networks rather than deploying our own network connectivity. These decisions have resulted in lower capital and operating costs for our business in the short-term, but have reduced our operating flexibility and ability to make timely service changes. If any of these network service providers cease operations or otherwise terminate the services that we depend on or become unwilling to supply cost-effective services to us in the future, the delay in switching our technology to another network service provider, if available, and qualifying this new service provider could have a material adverse effect on our business, financial condition or operating results. In addition, the rates we pay to our network service providers and other intermediaries may also change more rapidly than we change the pricing we charge our customers, which may reduce our profitability and increase the retail price of our service.\nWe depend on third-party vendors for IP phones and certain software endpoints, and any delay or interruption in supply by these vendors would result in delayed or reduced shipments to our customers and may harm our business.\nWe rely on third-party vendors for IP phones and software endpoints required to utilize our service. We currently do not have long-term supply contracts with any of these vendors. As a result, most of these third-party vendors are not obligated to provide products or services to us for any specific period, in any specific quantities or at any specific price, except as may be provided in a particular purchase order. The inability of these third-party vendors to deliver IP phones of acceptable quality and in a timely manner, particularly the sole source vendors, could adversely affect our operating results or cause them to fluctuate more than anticipated. Additionally, some of our products and services may require specialized or high-performance component parts that may not be available in quantities or in time frames that meet our requirements due to COVID-19 pandemic or otherwise.\nDifficulty executing local number porting requests could negatively impact our business.\nThe FCC and foreign regulators require VoIP providers to support telephone number porting within specified timeframes. In order to port telephone numbers, we rely on third party telecommunications carriers to complete the process. Often number ports take longer than the specified timeframes. For many potential customers, the ability to quickly port their existing telephone numbers into our service in a timely fashion is a very important consideration. To the extent that we cannot quickly port telephone numbers in, our ability to acquire new customers may be negatively impacted. To the extent that we cannot quickly port telephone numbers out when a customer leaves our service to go to another provider, we could be subject to regulatory enforcement action.\nRisks Related to Regulatory Matters\nVulnerabilities to security breaches, cyber intrusions and other malicious acts could adversely impact our business.\nOur operations depend on our ability to protect our network from interruption by damage from hackers, social engineering and phishing, ransomware, computer viruses, worms, other malicious software programs or similar disruptive problems or other events beyond our control. In the past, we have been subject to denial or disruption of service (\"DDOS\"), and we may be subject to DDOS attacks in the future. We cannot assure you that our backup systems, regular data backups, security protocols, DDOS mitigation and other procedures that are currently in place, or that may be in place in the future, will be adequate to prevent significant damage, system failure or data loss.\nInherent in our provision of service are the storage, processing, and transmission of our customers' data, which may include confidential and sensitive information. Customers may use our services to store, process and transmit a wide variety of confidential and sensitive information such as credit card, bank account and other financial information, proprietary information, trade secrets or other data that may be protected by sector-specific laws and regulations like intellectual property laws, laws addressing the protection of personally identifiable information (or personal data in the European Union), as well as the Federal Communications Commission’s, or the FCC’s, customer proprietary network information (“CPNI”) rules. We may be targets of cyber threats and security breaches, given the nature of the information we store, process and transmit and the fact that we provide communications services to a broad range of businesses.\nIn addition, we use third-party vendors which in some cases have access to our data and our customers' data. Despite the implementation of security measures by us or our vendors, our computing devices, infrastructure or networks, or our vendors computing devices, infrastructure or networks may be vulnerable to hackers, social engineering and phishing, ransomware, computer viruses, worms, other malicious software programs or similar disruptive problems due to a security vulnerability in our or our vendors' infrastructure or network, or our vendors, customers, employees, business partners, consultants or other internet users who attempt to invade our or our vendors' public and private computers, tablets, mobile devices, software, data networks, or voice networks. If there is a security vulnerability in our or our vendors' infrastructure or networks that is successfully targeted, we could face increased costs, liability claims, government investigations, fines, penalties or forfeitures, class action litigation, reduced revenue, or harm to our reputation or competitive position.\nWe could be liable for breaches of security on our website, fraudulent activities by our users, or the failure of third-party vendors to deliver credit card transaction processing services.\nA fundamental requirement for operating an Internet-based, worldwide cloud software solution and electronically billing our customers is the secure transmission of confidential information and media over public networks. Although we have developed systems and processes that are designed to protect consumer information and prevent fraudulent credit card transactions and other security breaches, failure to mitigate such fraud or breaches may subject us to costly breach notification and other mitigation obligations, class action lawsuits, investigations, fines, forfeitures or penalties from governmental agencies that could adversely affect our operating results.\nThe law relating to the liability of providers of online payment services is currently unsettled and states may enact their own rules with which we may not comply. We rely on third-party providers to process and guarantee payments made by our subscribers up to certain limits, and we may be unable to prevent our customers from fraudulently receiving goods and services. Our liability risk will increase if a larger fraction of transactions affected using our cloud-based services involve fraudulent or disputed credit card transactions.\nWe may also experience losses due to subscriber fraud and theft of service. Subscribers have, in the past, obtained access to our service without paying for monthly service and international toll calls by unlawfully using our authorization codes or by submitting fraudulent credit card information. If our existing anti-fraud procedures are not adequate or effective, consumer fraud and theft of service could have a material adverse effect on our business, financial condition and operating results.\nFailure to comply with laws and contractual obligations related to data privacy and protection could have a material adverse effect on our business, financial condition and operating results.\nWe process many types of data, including personal data in the course of our business. As such, we are subject to the data privacy and protection laws and regulations adopted by federal, state and foreign governmental agencies, including the European Union’s General Data Protection Regulation (\"GDPR\") and the California Consumer Privacy Act (\"CCPA\"). Data privacy and protection is highly regulated in many jurisdictions and may become the subject of additional regulation in the future. For example, lawmakers and regulators worldwide are considering proposals that would require companies, like us, that encrypt users' data to ensure access to such data by law enforcement authorities. Privacy laws restrict our processing of personal information, provided to us by our customers as well as data we collect from our customers and employees. We strive to comply with all applicable laws, regulations, policies and legal obligations relating to privacy and data protection. However, if we fail to comply, we may be subject to fines, penalties and lawsuits, statutory damages at both the federal and state levels in the U.S., substantial fines and penalties under the European Union’s GDPR, class action lawsuits, and our reputation may suffer. We may also be required to make modifications to our data practices that could have an adverse impact on our business, including increasing our operating costs which may cause us to increase our prices making our services less competitive.\nWe are also subject to the privacy and data protection-related obligations in our contracts with our customers and other third parties. Any failure, or perceived failure, by us to comply with federal, state, or international laws, including laws and regulations regulating privacy, data or consumer protection, or to comply with our contractual obligations related to privacy, could result in proceedings or actions against us by governmental entities, contractual parties or others, which could result in significant liability to us, as well as harm our reputation. Additionally, third parties on which we rely enter into contracts to protect and safeguard our customers' data. Should such parties violate these agreements or suffer a breach, we could be subject to proceedings or actions against us by governmental entities, contractual parties or others, which could result in significant liability to us as well as harm to our reputation.\nOur products and services must comply with industry standards, FCC regulations, state, local, country-specific and international regulations, and changes may require us to modify existing services, potentially increase our costs or prices we charge customers, and otherwise harm our business.\nAs a provider of interconnected VoIP services, we are subject to various international, federal, state and local requirements applicable to our industry, including those that address, among other matters, acceptable marketing practices, the accessibility of 9-1-1 or other international emergency services, local number porting, robo-calling, and caller ID spoofing. The failure of our products and services to comply, or delays in compliance, with various existing and evolving standards could delay or interrupt our introduction of new products, subject us to fines or other imposed penalties, or harm our reputation, any of which would have a material adverse effect on our business, financial condition or operating results.\nRegulations to which we may be subject address the following matters, among others:\n•license requirements that apply to providers of communications services in many jurisdictions;\n•our obligation to contribute to various Universal Service Fund programs, including at the state level;\n•monitoring on rural call completion rates;\n•safeguarding and use of Customer Proprietary Network Information (\"CPNI\");\n•rules concerning access requirements for users with disabilities;\n•our obligation to offer 7-1-1 abbreviated dialing for access to relay services;\n•compliance with the requirements of U.S. and foreign law enforcement agencies, including the Communications Assistance for Law Enforcement Act (\"CALEA\"), and cooperation with local authorities in conducting wiretaps, pen traps and other surveillance activities;\n•the ability to dial 9-1-1 (or corresponding numbers in regions outside the U.S.), auto-locate E-911 calls (or corresponding equivalents) when required, and access emergency services;\n•the transmission of telephone numbers associated with calling parties between carriers and service providers like us;\n•regulations governing outbound dialing, including the Telephone Consumer Protection Act; and\n•FCC and other regulators efforts to combat robo-calling and caller ID spoofing.\nRegulation of our services as telecommunications services may require us to obtain authorizations or licenses to operate in foreign jurisdictions and comply with legal requirements applicable to traditional telephony providers. This regulation may impact our ability to differentiate ourselves from incumbent service providers and imposes substantial compliance costs on us. In addition, the reform of federal and state Universal Service Fund programs and payment of regulatory and other fees in international markets, could increase the cost of our service to our customers diminishing or eliminating any pricing advantage we may have.\nEfforts to address robo-calling and caller ID spoofing could cause us competitive harm.\nIn June 2019, the FCC ruled that providers of voice services may by default (subject to opt-out by subscribers) block voice traffic based on reasonable analytics designed to identify unwanted calls. In March 2020, the FCC required that all voice service providers implement the STIR/SHAKEN caller ID authentication framework in the Internet Protocol (IP) portions of their networks by June 30, 2021. There is significant uncertainty regarding how STIR/SHAKEN will work. For example, there is currently no accepted standard by which voice service providers that do not have authorization to directly obtain telephone numbers will be able to authenticate calls originated by their customers. We have obtained authorization to directly obtain telephone numbers in the U.S. in order to be able to authenticate calls under STIR/SHAKEN originated by our subscribers. The STIR/SHAKEN framework will likely be used throughout the world. It is likely that the standards to obtain STIR/SHAKEN signing authority in other countries will differ from the U.S. requirements and similar to the U.S., there are no accepted standards yet for how voice service providers that do not have direct STIR/SHAKEN signing authority will be able to authenticate calls originated by their customers. In addition, foreign regulators have allowed terminating voice service providers to block voice traffic to address robo-calling or other unwanted calls. If we do not have a solution in place for STIR/SHAKEN when STIR/SHAKEN becomes widely adopted, our business could be harmed as we would be unable to authenticate originating calls from our subscriber’s telephone numbers under STIR/SHAKEN. Call recipients would be less likely to answer non-authenticated calls. In addition, the terminating voice service providers may block calls that are not authenticated under STIR/SHAKEN as the lack of authentication could be viewed as a reasonable indication that the call is unwanted by the recipient. This would make our service less desirable for our customers. Further if we do not have STIR/SHAKEN caller ID authentication in place when required, we could be subject to regulatory enforcement action.\nRisks Related to Intellectual Property\nOur infringement of a third party's proprietary technology could disrupt our business.\nIf we are found to be infringing on the intellectual property rights of any third-party in lawsuits or proceedings that may be asserted against us, we could be subject to monetary liabilities for such infringement, which could be material. We could also be required to refrain from using, manufacturing or selling certain products or using certain processes, either of which could have a material adverse effect on our business and operating results. Our broad range of current and former technology, including IP telephony systems, digital and analog circuits, software, and semiconductors, increases the likelihood that third parties may claim infringement by us of their intellectual property rights. We have received and may continue to receive in the future, notices of claims of infringement, misappropriation or misuse of other parties' proprietary rights. There can be no assurance that we will prevail in these discussions and actions or that other actions alleging infringement by us of third-party patents will not be asserted or prosecuted against us. Furthermore, lawsuits like these may require significant time and expense to defend, may divert management's attention away from other aspects of our operations and, upon resolution, may have a material adverse effect on our business, results of operations, financial condition and cash flows.\nInability to protect our proprietary technology would disrupt our business.\nWe rely, in part, on patent, trademark, copyright, and trade secret law to protect our intellectual property in the United States and abroad. We seek to protect our software, documentation, and other written materials under trade secret and copyright law, which afford only limited protection. We currently have several United States patent applications pending. We cannot predict whether such pending patent applications will result in issued patents, and if they do, whether such patents will effectively protect our intellectual property. The intellectual property rights we obtain may not be sufficient to provide us with a competitive advantage, and could be challenged, invalidated, infringed or misappropriated. We may not be able to protect our proprietary rights in the United States or internationally (where effective intellectual property protection may be unavailable or limited), and competitors may independently develop technologies that are similar or superior to our technology, duplicate our technology or design around any patent of ours.\nLitigation may be necessary in the future to enforce our intellectual property rights, to determine the validity and scope of our proprietary rights or the rights of others, or to defend against claims of infringement or invalidity. Such litigation could result in substantial costs and diversion of management time and resources and could have a material adverse effect on our business, financial condition, and operating results. Any settlement or adverse determination in such litigation would also subject us to significant liability.\nOur inability to use software licensed from third parties, or our use of open source software under license terms that interfere with our proprietary rights, could disrupt our business.\nOur technology platform incorporates software licensed from third parties, including some software, known as open source software, which we use without charge. Although we monitor our use of open source software, the terms of many open source licenses to which we are subject have not been interpreted by U.S. or foreign courts, and there is a risk that such licenses could be construed in a manner that imposes unanticipated conditions or restrictions on our ability to provide our platform to our customers. In the future, we could be required to seek licenses from third parties in order to continue offering our platform, which licenses may not be available on terms that are acceptable to us, or at all. Alternatively, we may need to re-engineer our platform or discontinue use of portions of the functionality provided by our platform. In addition, the terms of open source software licenses may require us to provide software that we develop using such software to others on unfavorable license terms. Our inability to use third-party software could result in disruptions to our business, or delays in the development of future offerings or enhancements of existing offerings, which could impair our business.\nRisks Related to our Debt, our Stock, and our Charter\nServicing our debt, including the paying down of principal, requires the use of cash, and we may not have sufficient cash flow from our business to pay down our substantial debt.\nAs of November 21, 2019, we had issued $362.5 million aggregate principal amount of our 0.50% convertible senior notes due 2024 in a private placement. Pursuant to an indenture dated as of February 19, 2019 between us and Wilmington Trust, National Association, as trustee, the notes bear interest at a rate of 0.50% per annum, payable semi-annually in arrears in cash on February 1 and August 1 of each year, and they will mature on February 1, 2024, unless earlier converted, redeemed or repurchased.\nOur ability to make scheduled payments of the principal of, to pay interest on or to refinance our indebtedness, including the amounts payable under the notes, depends on our future performance, which is subject to economic, financial, competitive and other factors beyond our control. Our business may not continue to generate cash flow from operations in the future sufficient to service our debt, including paying off the principal when due, and make necessary capital expenditures. If we are unable to generate such cash flow, we may be required to adopt one or more alternatives, such as selling assets, restructuring debt or obtaining additional equity capital on terms that may be onerous or highly dilutive. Our ability to refinance our indebtedness will depend on the capital markets and our financial condition at such time. We may not be able to engage in any of these activities or engage in these activities on desirable terms, which could result in a default on our debt obligations.\nWe may not have the ability to raise the funds necessary to settle conversions of the notes in cash or to repurchase the notes upon a fundamental change, and our future debt may contain limitations on our ability to pay cash upon conversion or repurchase of the notes.\nHolders of the notes have the right to require us to repurchase their notes upon the occurrence of a fundamental change at a repurchase price equal to 100% of the principal amount of the notes to be repurchased, plus accrued and unpaid interest, if any. In addition, upon conversion of the notes, unless we elect to deliver solely shares of our common stock to settle such conversion (other than paying cash in lieu of delivering any fractional share), we will be required to make cash payments in respect of the notes being converted. However, we may not have enough available cash or be able to obtain financing at the time we are required to make repurchases of notes surrendered therefor or notes being converted. In addition, our ability to repurchase the notes or to pay cash upon conversions of the notes may be limited by law, by regulatory authority or by agreements governing our future indebtedness. Our failure to repurchase notes at a time when the repurchase is required by the indenture or to pay any cash payable on future conversions of the notes as required by the indenture would constitute a default under the indenture. A default under the indenture or the occurrence of the fundamental change may also lead to a default under agreements governing our future indebtedness. If the repayment of the related indebtedness were to be accelerated after any applicable notice or grace periods, we may not have sufficient funds to repay the indebtedness and repurchase the notes or make cash payments upon conversions thereof.\nThe conditional conversion feature of the notes, if triggered, may adversely affect our financial condition and operating results.\nIn the event the conditional conversion feature of the notes is triggered, holders of notes will be entitled to convert the notes at any time during specified periods at their option. If one or more holders elect to convert their notes, unless we elect to satisfy our conversion obligation by delivering solely shares of our common stock (other than paying cash in lieu of delivering any fractional share), we would be required to settle a portion or all of our conversion obligation through the payment of cash, which could adversely affect our liquidity. In addition, even if holders of notes do not elect to convert their notes, we could be required under applicable accounting rules to reclassify all or a portion of the outstanding principal of the notes as a current rather than long-term liability, which would result in a material reduction of our net working capital.\nThe accounting method for convertible debt securities that may be settled in cash, such as our notes, could have a material effect on our reported financial results.\nUnder Accounting Standards Codification 470-20, Debt with Conversion and Other Options (“ASC 470-20”), an entity must separately account for the liability and equity components of the convertible debt instruments (such as the notes) that may be settled entirely or partially in cash upon conversion in a manner that reflects the issuer’s economic interest cost. The effect of ASC 470-20 on the accounting for the notes is that the equity component is required to be included in the additional paid-in capital section of stockholders’ equity on our consolidated balance sheet at the issuance date and the value of the equity component would be treated as debt discount for purposes of accounting for the debt component of the notes. As a result, we will be required to record a greater amount of non-cash interest expense as a result of the amortization of the discounted carrying value of the notes to their face amount over the term of the notes. We will report larger net losses (or lower net income) in our financial results because ASC 470-20 will require interest to include both the amortization of the debt discount and the instrument’s non-convertible coupon interest rate, which could adversely affect our reported or future financial results, the trading price of our common stock and the trading price of the notes.\nIn addition, under certain circumstances, convertible debt instruments (such as the notes) that may be settled entirely or partly in cash may be accounted for utilizing the treasury stock method, the effect of which is that the shares issuable upon conversion of such notes are not included in the calculation of diluted earnings per share except to the extent that the conversion value of such notes exceeds their principal amount. Under the treasury stock method, for diluted earnings per share purposes, the transaction is accounted for as if the number of shares of common stock that would be necessary to settle such excess, if we elected to settle such excess in shares, are issued. We cannot be sure that the accounting standards in the future will continue to permit the use of the treasury stock method. If we are unable or otherwise elect not to use the treasury stock method in accounting for the shares issuable upon conversion of the notes, then our diluted earnings per share could be adversely affected.\nThe capped call transactions entered into in connection with our sale of notes may affect the market value of our common stock.\nIn connection with the offer and sale of the notes, we entered into capped call transactions with one or more of the initial purchasers or affiliates thereof and/or other financial institutions (the “option counterparties”). The capped call transactions are expected generally to reduce the potential dilution upon conversion of the notes at maturity and/or offset any cash payments we are required to make in excess of the principal amount of converted notes, as the case may be, with such reduction and/or offset subject to a cap.\nIn capped call transactions similar to the ones we entered into, the option counterparties or their respective affiliates typically enter into various derivative transactions with respect to the issuer's common stock and/or purchase shares of the issuer's common stock concurrently with or shortly after the pricing of the notes. The option counterparties or their respective affiliates in our capped call transactions may modify their hedge positions by entering into or unwinding various derivatives with respect to our common stock and/or purchasing or selling our common stock or other securities of ours in secondary market transactions following the pricing of the notes and prior to the maturity of the notes (and are likely to do so during the valuation period for the capped call transactions, which is expected to occur during the 40 trading day period beginning on the 41st scheduled trading day prior to the maturity of the notes). This activity could also cause or avoid an increase or a decrease in the market price of our common stock.\nFuture sales of our common stock or equity-linked securities in the public market could lower the market price of our common stock.\nIn the future, we may sell additional shares of our common stock or equity-linked securities to raise capital. In addition, a substantial number of shares of our common stock is reserved for issuance upon the exercise of stock options, upon the vesting and settlement of restricted stock units and performance units, stock purchases in connection with our Employee Stock Purchase Program, and upon conversion of our notes. We cannot predict the size of future issuances or the effect, if any, that they may have on the market price for our common stock. The issuance and sale of substantial amounts of common stock or equity-linked securities, or the perception that such issuances and sales may occur, could adversely affect the trading price of the notes and the market price of our common stock and impair our ability to raise capital through the sale of additional equity or equity-linked securities.\nCertain provisions in our charter documents and Delaware law could discourage takeover attempts.\nOur restated certificate of incorporation and by-laws contain provisions that could have the effect of delaying or preventing changes in control or changes in our management without the consent of our board of directors, including, among other things:\n•no cumulative voting in the election of directors, which limits the ability of minority stockholders to elect director candidates;\n•the ability of our board of directors to issue shares of preferred stock and to determine the price and other terms of those shares, including preferences and voting rights, without stockholder approval, which could be used to significantly dilute the ownership of a hostile acquirer;\n•the exclusive right of our board of directors to elect a director to fill a vacancy created by the expansion of our board of directors or the resignation, death or removal of a director, which prevents stockholders from being able to fill vacancies on our board of directors;\n•a prohibition on stockholder action by written consent, which forces stockholder action to be taken at an annual or special meeting of our stockholders;\n•the requirement that a special meeting of stockholders may be called only by a majority vote of our Board of Directors or by stockholders holdings shares of our common stock representing in the aggregate a majority of votes then outstanding, which could delay the ability of our stockholders to force consideration of a proposal or to take action, including the removal of directors;\n•the ability of our board of directors, by majority vote, to amend our by-laws, which may allow our board of directors to take additional actions to prevent a hostile acquisition and inhibit the ability of an acquirer to amend our by-laws to facilitate a hostile acquisition; and\n•advance notice procedures with which stockholders must comply to nominate candidates to our board of directors or to propose matters to be acted upon at a stockholders' meeting, which may discourage or deter a potential acquirer from conducting a solicitation of proxies to elect the acquirer's own slate of directors or otherwise attempting to obtain control of us.\nWe are also subject to certain anti-takeover provisions under the General Corporation Law of the State of Delaware (\"DGCL\"). Under Section 203 of the DGCL, a corporation may not, in general, engage in a business combination with any holder of 15% or more of its capital stock unless the holder has held the stock for three years or (a) our board of directors approves the transaction prior to the stockholder acquiring the 15% ownership position, (b) upon consummation of the transaction that resulted in the stockholder acquiring the 15% ownership position, the stockholder owns at least 85% of the outstanding voting stock (excluding shares owned by directors or officers and shares owned by certain employee stock plans) or (c) the transaction is approved by the board of directors and by the stockholders at an annual or special meeting by a vote of 66 2/3% of the outstanding voting stock (excluding shares held or controlled by the interested stockholder). These provisions in our restated certificate of incorporation and by-laws and under Delaware law could discourage potential takeover attempts.\nGeneral Risk Factors\nCOVID-19 and any economic difficulty it triggers could significantly harm our business.\nThe global spread of COVID-19 has created significant volatility, uncertainty and economic disruption, particularly for small and medium-sized businesses. Many of our existing and prospective customers have experienced economic hardship. This could reduce the demand for our cloud services, delay and lengthen sales cycles, increase customer churn, force us to lower the prices for our services and/or provide customers with service credits, and lead to slower growth or even a decline in our revenues, operating results and cash flows. The impact of COVID-19 on demand for our services depends on numerous evolving factors including: the duration and scope of the pandemic; governmental, business and individuals’ actions that have been and continue to be taken in response to the pandemic; the rate of vaccinations globally and the efficacy of available vaccines; the effect on our customers and customer demand and their ability to pay for our services; disruptions to third-party data centers and Internet service providers; and any decline in the quality and/or availability of our services. And it It is possible that as businesses return to in-person work the demand for some of our products could decline.\nThe impact of COVID-19 on macroeconomic conditions has at some periods also impacted the functioning of financial and capital markets, foreign currency exchange rates and interest rates. Since we are not cash flow positive, depending on the duration of the COVID-19 crisis and any economic recession that it triggers, we may need to access the capital markets at an unfavorable time. If we need to access the capital markets, there can be no assurance that financing may be available on attractive terms, if at all.\nWe may not be able to secure financing on favorable terms, or at all, to meet our future capital needs.\nWe may need to pursue financing in the future to make expenditures or investments to support the growth of our business (whether through acquisitions or otherwise) and may require additional capital to pursue our business objectives, respond to new competitive pressures, service our debt, pay extraordinary expenses such as litigation settlements or judgments or fund growth, including through acquisitions, among other potential uses. Additional funds, however, may not be available when we need them on terms that are acceptable to us, or at all. If we are unable to obtain adequate financing or financing on terms satisfactory to us when we require it, our ability to continue to grow and support our business and to respond to business challenges could be significantly limited.\nNatural disasters, war, terrorist attacks, global pandemics or malicious conduct, among other unforeseen events, could adversely impact our operations, could degrade or impede our ability to offer services, and may negatively impact our financial condition, revenues and costs going forward.\nOur cloud communications services rely on uninterrupted connection to the Internet through data centers and networks. Any interruption or disruption to our network, or the third parties on which we rely, could adversely impact our ability to provide service. Our network could be disrupted by circumstances outside of our control including natural disasters, acts of war, terrorist attacks, global pandemics or malicious acts, among other unforeseen events, including, but not limited to, cyber-attacks. For example, our headquarters, global networks operations center and one of our third-party data center facilities are located in the San Francisco Bay Area, a region known for seismic activity. Also, global pandemics, such as the one caused by COVID-19, may restrict travel by personnel, reduce the availability of materials required to maintain data centers that support our cloud communication services, and could require us or our partner data centers and Internet service providers to curtail operations in certain geographic regions. Such an event may also impede our customers' connections to our network, since these connections also occur over the Internet, and would be perceived by our customers as an interruption of our services, even though such interruption would be beyond our control. In addition, as a result of COVID-19, we have been experiencing changes to our normal business practices due to our employees working from home in compliance with shelter-in-place orders in many of our office locations. As we implement modifications to employee travel and employee work locations in response, among other business modifications, these changes could, in the future, negatively impact our normal provision of services, particularly in the areas of sales and marketing to new and prospective customers. Any of these events could have a material adverse impact on our business causing us to incur significant expenses, lose substantial amounts of revenue, suffer damage to our reputation, and lose customers.",
    "item_1B": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item_2": "ITEM 2. PROPERTIES\nOur principal operations are located in Campbell, California. Outside the United States our operations are conducted primarily in leased office space located in the United Kingdom (primarily used for sales and support in Europe), Romania (primarily used for support, research and development), and Singapore (primarily used for regional sales and marketing, procurement, product and engineering, and regional support functions).\nIn addition, we lease space from third-party data center hosting facilities under co-location agreements in the United States and in a number of countries across the globe, including those in South America, Europe, and Asia Pacific.\nFor additional information regarding our obligations under leases, see Note 5, Leases in the Notes to Consolidated Financial Statements contained in Part II, Item 8 of this Annual Report.",
    "item_3": "ITEM 3. LEGAL PROCEEDINGS\nInformation with respect to this item may be found in Note 6, Commitments and Contingencies in the Notes to Consolidated Financial Statements contained in Part II, Item 8 of this Annual Report, under “Legal Proceedings” which is incorporated herein by reference.",
    "item_4": "ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II",
    "item_5": "ITEM 5. MARKET FOR REGISTRANT'S COMMON EQUITY AND RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information for Common Stock\nSince December 8, 2017, our common stock has been traded under the symbol \"EGHT\" and is listed on the New York Stock Exchange, Inc. (NYSE). Previous to December 8, 2017, our common stock traded under the symbol \"EGHT\" and was listed on the Nasdaq Global Select Market of the Nasdaq Stock Market national securities exchange.\nDividend Policy\nWe have never paid cash dividends on our common stock and have no plans to do so in the foreseeable future.\nNumber of Common Stockholders\nAs of May 13, 2021, there were approximately 187 holders of record of our common stock. The actual number of stockholders is greater than this number of record holders and includes stockholders who are beneficial owners but whose shares are held in street name by brokers and other nominees.\nSee Item 12 of Part III of this Annual Report regarding information about securities authorized for issuance under our equity compensation plans.\nStock Performance Graph\nNotwithstanding any statement to the contrary in any of our previous or future filings with the Securities and Exchange Commission, the following information relating to the price performance of 8x8’s common stock shall not be deemed \"filed\" with the Commission or \"soliciting material\" under the Securities Exchange Act of 1934 and shall not be incorporated by reference into any such filings.\nThe graph below shows the cumulative total stockholder return over a five year period assuming the investment of $100 on March 31, 2016 in each of 8x8's common stock, the NYSE Composite Index, the Russell 2000 Index and the Nasdaq Composite Computer & Data Processing Index. The graph is furnished, not filed, and the historical return cannot be indicative of future performance.\nIssuer Purchases of Equity Securities\nThere was no activity under the Repurchase Plan for the year ended March 31, 2021. The value of shares that may yet to be purchased under the Repurchase Plan is approximately $7.1 million.",
    "item_6": "ITEM 6. SELECTED FINANCIAL DATA\nThe following table sets forth selected consolidated financial data of 8x8, Inc. for each year in the five year periods ended March 31, 2017 through March 31, 2021. The following selected consolidated financial data is qualified by reference to, and should be read in conjunction with, \"Management's Discussion and Analysis of Financial Condition and Results of Operations,\" and with the consolidated financial statements, related notes thereto, and other financial information included elsewhere in this Annual Report.\nYears Ended March 31,\n2021 2020 2019 2018 2017\n(in thousands, except per share amounts)\nTotal revenues $ 532,344 $ 446,237 $ 352,586 $ 296,500 $ 253,388\nNet loss $ (165,585) $ (172,368) $ (88,739) $ (104,497) $ (4,751)\nNet loss per share:\nBasic and diluted $ (1.57) $ (1.72) $ (0.94) $ (1.14) $ (0.05)\nTotal assets $ 678,409 $ 700,641 $ 546,358 $ 277,209 $ 333,855\nAccumulated deficit $ (591,055) $ (422,670) $ (250,302) $ (201,464) $ (114,610)\nTotal stockholders' equity $ 160,504 $ 190,731 $ 249,390 $ 218,774 $ 288,601",
    "item_7": "ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOVERVIEW\nWe are a leading SaaS provider of voice, video, contact center, and communication APIs powered by a global cloud communications platform. From our proprietary cloud technology platform, organizations across all their locations and employees have access to unified communications, team collaboration, video conferencing, contact center, data and analytics, communication APIs, and other services, enabling them to be more productive and responsive to their customers.\nOur customers range from small businesses to large enterprises and their users are spread across more than 150 countries. In recent years, we have increased our up-market focus on the mid-market and enterprise customer sectors.\nWe have a portfolio of cloud-based offerings that are subscription based, made available at different rates varying by the specific functionalities, services and number of users. We generate service revenue from communications services subscriptions and platform usage. We generate other revenue from professional services and the sale of office phones and other hardware equipment. We define a “customer” as one or more legal entities to which we provide services pursuant to a single contractual arrangement. In some cases, we may have multiple billing relationships with a single customer (for example, where we establish separate billing accounts for a parent company and each of its subsidiaries).\nOur flagship service is our 8x8 X Series, a suite of UCaaS and CCaaS solutions, which consist of service plans of increasing functionality designated X1, X2, etc., through X8. With 8x8 X Series, we provide enterprise-grade voice, unified communications, video meetings, team collaboration, and contact center functionalities from a single platform. We also offer standalone SaaS services for contact center, video meetings, and enterprise communication APIs. Through our July 2019 acquisition of Wavecell Pte. Ltd., an Asia-based global communication platform as a service CPaaS provider of SMS, messaging, voice and video APIs to enterprises, we expanded our API offerings both geographically and in scope. We expect to continue integrating these services into our platform, as we believe in the value of the collective solutions.\nThroughout fiscal 2021, the Company incurred professional services and related engineering costs to upgrade our customers to the 8x8 X Series platform. As of March 31, 2021, we have upgraded substantially all of our customers to X Series, and intend to complete remaining upgrades in fiscal 2022. While we may not be able to recover these costs from our customers, we believe that we will realize other benefits including reducing the number of platforms that we are required to support and improved customer retention.\nSUMMARY AND OUTLOOK\nIn fiscal 2021, our total service revenue grew approximately 20% year-over-year to $496.0 million. We continued to show an increase in our average annualized service revenue per customer, which grew to $8,439 in fiscal 2021, from $7,876 in fiscal 2020, as we are selling more to mid-market and enterprise customers. Annual service revenue from mid-market and enterprise customers represented 47% of total annual service revenue and grew 31% over the prior year. We also increased the number of deals where customers purchase our integrated communications and contact center solutions, which we have referred to as bundled deals, 67% of our new bookings greater than $12,000 of annualized recurring revenue were from customers that selected bundled UCaaS and CCaaS, as compared to 60% one year ago.\nOur continued business focus is on achieving improved operating efficiencies while delivering revenue growth. In fiscal 2021, while we continued to make important investments in our products and technology platform, management recognized the importance of driving toward profitability for sustainable scale. We focused on key areas of spend in our go-to-market strategy and improving gross margin and operating margin through increased spend discipline. Additionally, we looked to drive improved efficiencies in our customer acquisition and operations, and focused on expanding our business upmarket with mid-market and enterprise customers. We believe that this approach will enable the Company to grow and capture market share during this phase of industry disruption, in a cost-effective way, and support the Company in pursuit of its path to profitability and operating cashflow improvement.\nIn prior years, we made strategic investments in R&D and marketing, which we considered necessary and important for delivering a robust platform to our customers and establishing the appropriate demand generation channels to connect our customers to our solutions. In fiscal 2019, we launched 8x8 X Series, our single-technology platform, and re-aligned our channel and marketing functions to support a more scalable, higher-growth, go-to-market strategy, in response to the shift of businesses from legacy on-premise communication solutions to cloud-based services. We believe that this industry trend continued throughout our fiscal 2021. Accordingly, we continued to invest in our business, but with a concurrent focus on scale and managing costs with the goal of driving to profitability.\nIn fiscal 2022, we plan to continue making investments in activities to acquire more customers, including investing in our marketing efforts, internal and field sales capacity, and research and development. We also intend to continue investing in our indirect channel programs to acquire more third-party selling agents to help sell our solutions, including VARs and master agent programs.\nNEW CEO APPOINTMENT\nOn December 10, 2020, we appointed David Sipes as Chief Executive Officer and a member of the board of directors.\nIMPACTS OF COVID-19\nThe full extent of the impact of the COVID-19 pandemic on our business, operations and financial results will depend on numerous evolving factors that we may not be able to accurately predict, including those set forth under the section entitled \"Risk Factors.\" In an effort to contain COVID-19 or slow its spread, governments around the world have enacted various measures, including orders to close non-essential businesses, isolate residents to their homes, and practice social distancing. To protect the health and safety of our employees, our workforce has spent significant time working from home and travel has been curtailed for our employees as well as our customers. Small and medium-sized customers have been particularly impacted by the COVID-19 pandemic. We have also experienced significant increases in usage by existing customers as our customers’ workforces are required to work from home in response to the COVID-19 pandemic accelerating trends we have seen in distributed workforces increasingly relying on cloud communication systems like ours. While we anticipate that the global health crisis caused by COVID-19 and the measures enacted to slow its spread will negatively impact business activity across the globe, it is not clear what its potential effects will be on our business, including the effects on our customers, suppliers or vendors, or on our financial results.\nCOMPONENTS OF RESULTS OF OPERATIONS\nService Revenue\nService revenue consists of communication services subscriptions, platform usage revenue, and related fees from our UCaaS, CCaaS, and CPaaS offerings. We plan to continue driving our business to increase service revenue through a combination of increased sales and marketing efforts, geographic expansion of our customer base outside the United States, innovation in product and technology, and through strategic acquisitions of technologies and businesses.\nOther Revenue\nOther revenue consists of revenues from professional services, primarily in support of deployment of our solutions and/or platform, and revenues from sales and rentals of IP telephones in conjunction with our cloud telephony service. Other revenue is dependent on the number of customers who choose to purchase or rent an IP telephone in conjunction with our service instead of using the solution on their cell phone, computer or other compatible device, and/or choose to engage our services for implementation and deployment of our cloud services.\nCost of Service Revenue\nCost of service revenue consists primarily of costs associated with network operations and related personnel, technology licenses, amortization of capitalized internal-use software, other communication origination and termination services provided by third-party carriers and outsourced customer service call center operations, and other costs such as customer service, and technical support costs. We allocate overhead costs such as IT and facilities to cost of service revenue, as well as to each of the operating expense categories, generally based on relative headcount. Our IT costs include costs for IT infrastructure and personnel. Facilities costs primarily consist of office leases and related expenses.\nCost of Other Revenue\nCost of other revenue consists primarily of direct and indirect costs associated with the purchasing of IP telephones as well as the scheduling, shipping and handling, personnel costs, expenditures incurred in connection with the professional services associated with the deployment and implementation of our products, and allocated IT and facilities costs.\nResearch and Development\nResearch and development expenses consist primarily of personnel and related costs, third-party development, software and equipment costs necessary for us to conduct our product, platform development and engineering efforts, and allocated IT and facilities costs.\nSales and Marketing\nSales and marketing expenses consist primarily of personnel and related costs, sales commissions, including those to the channel, trade shows, advertising and other marketing, demand generation, promotional expenses, and allocated IT and facilities costs.\nGeneral and Administrative\nGeneral and administrative expenses consist primarily of personnel and related costs, professional services fees, corporate administrative costs, tax and regulatory fees, and allocated IT and facilities costs.\nOther Income (Expense), net\nOther income (expense), net, consists primarily of interest expense related to the convertible notes, offset by income earned on our cash, cash equivalents, investments, and foreign exchange gain/losses.\nProvision for Income Taxes\nProvision for income taxes consists primarily of foreign income taxes and state minimum taxes in the United States. As we expand the scale of our international business activities, any changes in the U.S. and foreign taxation of such activities may increase our overall provision for income taxes in the future. We have a valuation allowance for our U.S. deferred tax assets, including federal and state net operating loss carryforwards (\"NOLs\"). We expect to maintain this valuation allowance until it becomes more likely than not that the benefit of our federal and state deferred tax assets will be realized by way of expected future taxable income in the United States.\nRESULTS OF OPERATIONS\nThe following discussion should be read in conjunction with our consolidated financial statements and related notes included elsewhere in this Annual Report.\nWe have minimal seasonality in our business, but typically, sales of new subscriptions in our fourth fiscal quarter are greater than in any of the first three quarters of the fiscal year. We believe this occurs because the customers we target tend to spend a relatively greater portion of their annual capital budgets at the beginning of the calendar year compared with each of the last three quarters of the year.\nRevenue\nService revenue\nFor the years ended March 31, Change\n2021 2020 2019 2021 vs 2020 2020 vs 2019\nService revenue $495,985 $414,078 $325,305 $ 81,907 19.8 % $ 88,773 27.3 %\nPercentage of total revenue 93.2 % 92.8 % 92.3 %\nService revenue increased for fiscal 2021, as compared with fiscal 2020, primarily due to a net increase in our customer base, expanded offerings to existing customers, and growth in related usage; service revenue from new customers was primarily driven by sales of standalone and bundled UCaaS and CCaaS deals, globally, to our mid-market and enterprise customers. The increase in service revenue was also attributable to growth in usage revenue generated by our CPaaS products primarily in the APAC region. Our service subscriber base grew from approximately 55,000 customers on March 31, 2020 to approximately 58,000 customers on March 31, 2021.\nService revenue increased for fiscal 2020, as compared with fiscal 2019, primarily due to a net increase in our customer subscriber base, with the largest part of the increase coming from our mid-market and enterprise customers, who are our fastest growing customer sector, contributing to an increase in the average annual service revenue per customer. This increase was primarily due to organic growth and, to a lesser extent, CPaaS revenue generated in connection with our acquisition of Wavecell in July 2019. Our service subscriber base grew from approximately 52,000 customers on March 31, 2019 to approximately 55,000 customers on March 31, 2020.\nWe expect total service revenue to grow over time with our diverse platform offering as our business continues to expand globally and across broader customer categories.\nOther revenue\nFor the years ended March 31, Change\n2021 2020 2019 2021 vs 2020 2020 vs 2019\nOther revenue $36,359 $32,159 $27,281 $ 4,200 13.1 % $ 4,878 17.9 %\nPercentage of total revenue 6.8 % 7.2 % 7.7 %\nOther revenue increased in fiscal 2021, as compared to fiscal 2020, primarily due to increased professional services revenue resulting from the overall growth in our business and customer base, partially offset by a decrease in product revenue as a result of a shift toward our hardware rental program.\nOther revenue increased in fiscal 2020, as compared to fiscal 2019, primarily due to increased professional services revenue resulting from the overall growth in our business and customer base and increased product revenue.\nWe expect other revenue to grow over time as our customer base grows, particularly in mid-market and enterprise, as we focus on delivering enhanced platform offerings to existing and new customers.\nNo single customer represented more than 10% of our total revenues during fiscal years 2021, 2020, or 2019.\nRevenues are attributed to countries based on the shipment destination and the customer's service address. The following table illustrates our revenues by geographic area:\nFor the years ended March 31,\n2021 2020 2019\nUnited States 73 % 79 % 86 %\nInternational 27 % 21 % 14 %\nTotal 100 % 100 % 100 %\nRevenue generated from international customers increased in fiscal years 2021 and 2020, as compared to fiscal 2019 due to expansion in both EMEA and APAC regions, including those added in connection with our acquisition of Wavecell.\nCost of Revenue\nCost of service revenue\nFor the years ended March 31, Change\n2021 2020 2019 2021 vs 2020 2020 vs 2019\nCost of service revenue $180,082 $145,013 $86,122 $ 35,069 24.2 % $ 58,891 68.4 %\nPercentage of service revenue 36.3 % 35.0 % 26.5 %\nCost of service revenue increased in fiscal 2021, as compared to fiscal 2020, primarily due to a $33.6 million increase in communication infrastructure costs incurred to deliver our services, including those in connection with CPaaS, a $6.4 million increase in amortization of capitalized internal-use software, and a $3.4 million increase in stock-based compensation expense. These increases were partially offset by a decrease of $5.3 million in employee and consulting related expenditures and a decrease of $2.5 million in depreciation and amortization of intangible assets.\nCost of service revenue increased in fiscal 2020, as compared to fiscal 2019, primarily due to a $33.8 million increase in communication infrastructure costs incurred to deliver our services, including those in connection with CPaaS, a $7.1 million increase in amortization of capitalized internal-use software costs, a $6.5 million increase in facilities and other allocated expenses, a $6.8 million increase in employee and consulting related expenditures, $1.9 million increase in amortization of intangibles, and a $1.1 million increase in software expense.\nWe expect cost of service revenue will increase in absolute dollars in future periods as revenue continues to grow.\nCost of other revenue\nFor the years ended March 31, Change\n2021 2020 2019 2021 vs 2020 2020 vs 2019\nCost of other revenue $ 50,068 $ 56,215 $ 43,850 $ (6,147) (10.9) % $ 12,365 28.2 %\nPercentage of other revenue 137.7 % 174.8 % 160.7 %\nCost of other revenue decreased in fiscal 2021, as compared to fiscal 2020, primarily due to reductions in hardware shipment volume, improved pricing, and increase in our hardware rental program, which has better margins than hardware sales.\nCost of other revenue increased in fiscal 2020, as compared to fiscal 2019, primarily due to increased product shipments and personnel and other costs associated with customer deployments.\nOperating Expenses\nResearch and development\nFor the years ended March 31, Change\n2021 2020 2019 2021 vs 2020 2020 vs 2019\nResearch and development $ 92,034 $ 77,790 $ 62,063 $ 14,244 18.3 % $ 15,727 25.3 %\nPercentage of total revenue 17.3 % 17.4 % 17.6 %\nResearch and development expenses increased in fiscal 2021, as compared to fiscal 2020, primarily due to an $11.9 million increase in stock-based compensation expense, a $3.0 million reduction in capitalized internal-use software costs, and a $1.2 million increase in depreciation and amortization of software. These increases were partially offset by a $1.2 million decrease in travel related costs.\nResearch and development expenses increased in fiscal 2020, as compared to fiscal 2019, primarily due to an $8.6 million increase in stock-based compensation expenses, a $3.7 million increase in payroll and related expenses, net of capitalized internal-use software costs, a $2.2 million increase in amortization of capitalized internal-use software costs, and a $1.5 million increase in software expenses.\nWe plan to continue to invest in research and development to support our efforts to expand the capabilities and scope of our platform and to enhance the user experience. While we expect to continue to improve our cost structure and achieve operational efficiencies, we expect that research and development expenses will increase in absolute dollars in future periods as we continue to invest in our development efforts, and vary from period-to-period as a percentage of revenue.\nSales and marketing\nFor the years ended March 31, Change\n2021 2020 2019 2021 vs 2020 2020 vs 2019\nSales and marketing $256,231 $240,013 $177,976 $ 16,218 6.8 % $ 62,037 34.9 %\nPercentage of total revenue 48.1 % 53.8 % 50.5 %\nSales and marketing expenses increased in fiscal 2021, as compared to fiscal 2020, primarily due to a $14.9 million increase in channel commissions, a $13.7 million increase in stock-based compensation expense, a $8.3 million increase in amortization of deferred sales commission costs, a $3.7 million increase in marketing software and application costs, and a $3.2 million increase in employee and consulting related expenditures. These increases were partially offset by a decrease of $27.2 million in marketing program and public cloud expenses due to gained efficiencies in lead generation and brand awareness, along with a reduction in travel related costs.\nSales and marketing expenses increased in fiscal 2020, as compared to fiscal 2019, primarily due to a $20.4 million increase in advertising and marketing expenses, a $16.1 million increase in payroll and related expenses from expansion of our sales force, an $8.3 million increase in stock-based compensation expenses, a $7.2 million increase in commission expenses, a $5.3 million increase in amortization of deferred sales commissions, a $1.5 million increase in recruiting and outside services, a $1.3 million increase in licenses and fees, and a $0.9 million increase in depreciation and amortization of intangibles.\nWe plan to continue investing in sales and marketing to attract and retain customers on our platform and to increase our brand awareness. While we expect to continue to improve our cost structure and achieve operational efficiencies, we expect that sales and marketing expenses will increase in absolute dollars in future periods and vary from period-to-period as a percentage of revenue.\nGeneral and administrative\nFor the years ended March 31, Change\n2021 2020 2019 2021 vs 2020 2020 vs 2019\nGeneral and administrative $100,078 $87,025 $72,208 $ 13,053 15.0 % $ 14,817 20.5 %\nPercentage of total revenue 18.8 % 19.5 % 20.5 %\nGeneral and administrative expenses increased in fiscal 2021, as compared to fiscal 2020, primarily due to a $6.4 million increase in stock-based compensation expense, a $5.7 million increase in professional services and payroll and related expenses, including CEO succession costs, a $1.3 million higher allowance for credit losses, partially in response to external market factors and uncertainties in connection with the COVID-19 pandemic, and a $1.8 million increase in depreciation expense. These increases were partially offset by a $2.2 million decrease in acquisition and integration costs.\nGeneral and administrative expenses increased in fiscal 2020, as compared to fiscal 2019, primarily due to an $11.8 million increase in payroll and related expenses, a $7.9 million increase in stock-based compensation expenses, a $3.5 million increase in rent expense related to additional office spaces, a $2.4 million increase in bad debt expense, and a $2.4 million increase in acquisition and integration related expenses. These increases were partially offset by a decrease in allocated costs of $7.0 million, and the non-recurrence of sales and use tax expenses of $7.6 million that the Company recognized in fiscal 2019.\nWe expect to continue improving our cost structure and achieve operational efficiencies, and therefore also expect that general and administrative expenses as a percentage of total revenue will decline over time.\nOther income (expense), net\nFor the years ended March 31, Change\n2021 2020 2019 2021 vs 2020 2020 vs 2019\nOther income (expense), net $(18,593) $ (11,717) $ 1,463 $ (6,876) 58.7 % $ (13,180) (900.9) %\nPercentage of total revenue (3.5) % (2.6) % 0.4 %\nThe change in Other income (expense), net in fiscal 2021, as compared to fiscal 2020, was primarily due to $4.0 million of lower interest income and a $3.1 million increase in expense related to contractual interest, amortization of debt discount, and amortization of issuance costs associated with additional convertible notes issued in November 2019. These amounts were partially offset by an increase in other income of $0.6 million.\nThe change in Other income (expense), net in fiscal 2020, as compared to fiscal 2019, primarily related to recognition of interest, amortization of debt discount, and amortization of issuance costs associated with our convertible senior notes issued in the fourth quarter of fiscal 2019 and the third quarter of fiscal 2020, which totaled $15.6 million in fiscal 2020, as compared to $1.5 million in fiscal 2019. This increase in other expense was partially offset by an increase in interest income of $1.6 million.\nWith the recognition of interest expense and amortization of debt discount and issuance costs in connection with our convertible senior notes, we expect Other income (expense), net to continue to be in a net expense position for the foreseeable future.\nProvision for income taxes\nFor the years ended March 31, Change\n2021 2020 2019 2021 vs 2020 2020 vs 2019\nProvision for income taxes $ 843 $ 832 $ 569 $ 11 1.3 % $ 263 46.2 %\nPercentage of total revenue 0.2 % 0.2 % 0.2 %\nFor the years ended March 31, 2021 and 2020, we recorded income tax expense of $0.8 million and $0.8 million, respectively, mostly related to the current tax liabilities of profitable foreign subsidiaries and U.S. state minimum taxes. Our effective tax rate for each period differs from the statutory rate primarily due to a full valuation allowance against our deferred tax assets.\nWe record deferred taxes based on differences between the financial statement basis and tax basis of assets and liabilities and available tax loss and credit carryforwards. In evaluating our ability to utilize our deferred tax assets, we consider available evidence, both positive and negative, in determining future taxable income on a jurisdiction-by-jurisdiction basis. We record a valuation allowance against deferred tax assets if, based on the weight of the evidence, it is more likely than not that some portion or all of the deferred tax assets will not be realized. A significant item of objective negative evidence considered was the historical three-year cumulative pretax loss reached in fiscal 2018. We continue to remain in a cumulative pretax loss position, and therefore, continued to maintain a full valuation allowance against our U.S., U.K., and Singapore deferred tax assets.\nLiquidity and Capital Resources\nAs of March 31, 2021, we had $152.9 million of cash and cash equivalents and short-term investments. In addition, we had $8.6 million in restricted cash in support of letters of credit securing leases for office facilities in California and New York. During fiscal 2021, $10.4 million previously held in escrow for our acquisition of Wavecell was released.\nAs of March 31, 2020, we had $170.9 million of cash and cash equivalents and short-term investments. In addition, we had $19.0 million in restricted cash, of which $8.6 million was in support of letters of credit securing leases for office facilities in California and New York and $10.4 million was held in escrow for our acquisition of Wavecell, pursuant to the terms of the acquisition agreement.\nOn March 27, 2020, the Coronavirus Aid, Relief, and Economic Security Act (the \"CARES Act\") was passed into law, which amended portions of relevant tax laws and provided relief to certain qualifying entities. In connection with the CARES Act, the Company elected to defer certain employer payroll taxes, which reduced cash usage by approximately $5.0 million through December 31, 2020, of which approximately $2.5 million will be remitted to tax authorities during the third quarter of fiscal 2022 and the remaining amount due will be remitted in the third quarter of fiscal 2023. Other jurisdictions around the world have also provided similar tax relief, which the Company has elected to receive, where applicable; these benefits have a lesser impact to our cash flows during fiscal 2021.\nIn June 2020, the Company offered its employees an opportunity to receive a portion of their future cash salary for fiscal 2021 in shares of the Company's common stock, which resulted in lower cash usage from payroll compensation of approximately $4 million during fiscal 2021. In addition, for fiscal 2021, the Company's executives received performance share units in place of a cash bonus plan and the timing of bonus payments for all other eligible employees was changed to semi-annually (in the third and first quarter of each fiscal year) from quarterly as in prior fiscal years.\nDuring the fourth quarter of fiscal 2021, we received $6.4 million of operating cash inflows from our Lease Assignment. Refer to Note 5. Leases, in the Notes to Consolidated Financial Statements included in this Annual Report.\nIn March 2021, the Company offered its employees another opportunity to receive a portion of their fiscal 2022 cash salary and/or cash bonus in shares of the Company's common stock. Based on employee elected participation, we expect lower cash usage from payroll compensation of over $9 million during fiscal 2022.\nWe believe that our existing cash, cash equivalents and investment balances, and our anticipated cash flows from operations will be sufficient to meet our working capital and expenditure requirements for the next 12 months. Although we believe we have adequate sources of liquidity over the next 12 months, the success of our operations, the global economic outlook, and the pace of sustainable growth in our markets, in each case, in light of the market volatility and uncertainty as a result of the COVID-19 pandemic, among other factors, could impact our business and liquidity.\nYear over Year Changes\nNet cash used in operating activities for fiscal 2021 was $14.1 million, as compared with $93.9 million for fiscal 2020. Cash used in or provided by operating activities is primarily affected by:\n•net income or loss;\n•non-cash expense items such as depreciation, amortization, and impairments;\n•expense associated with stock options and stock-based awards; and\n•changes in working capital accounts, particularly in the timing of collections from receivable and payments of obligations, such as commissions.\nIn fiscal 2021, net cash used in operating activities was primarily related to our net loss of $165.6 million, net cash outflow from sales commissions payments and recognition of deferred sales commissions of $25.1 million, and other smaller working capital changes, which were partially offset by non-cash charges such as stock-based compensation expense of $107.6 million, amortization of capitalized internal-use software costs of $26.9 million, amortization of debt discount of $16.9 million, and operating lease expenses of $15.2 million.\nIn fiscal 2020, net cash used in operating activities was primarily related to our net loss of $172.4 million, net cash outflow from sales commissions of $26.9 million, and other smaller working capital changes, which were partially offset by non-cash charges such as stock-based compensation expense of $70.9 million, amortization of capitalized internal-use software costs of $19.0 million, amortization of the debt discount of $14.0 million, and operating lease expenses of $15.0 million.\nNet cash used in investing activities was $36.3 million in fiscal 2021, as compared to $106.3 million in fiscal 2020. The cash used in investing activities during fiscal 2021, was primarily related to capitalized internal-use software development costs of $28.8 million, net cash paid of $10.4 million in connection with our acquisition of Wavecell, and purchases of property and equipment of $6.4 million. This was partially offset by the proceeds from the sales and maturities of investments, net of purchases, of $9.3 million.\nNet cash used in investing activities was $106.3 million during fiscal 2020, as compared to $10.9 million provided by investing activities in fiscal 2019. The cash used in investing activities during fiscal 2020 was primarily related to purchases of property and equipment of $35.8 million, largely in connection with the build out of our corporate office, capitalized internal-use software development costs of $31.6 million, and net cash paid of $59.1 million in connection with our acquisitions. This was partially offset by proceeds from sales and maturities of investments, net of purchases, of $20.2 million.\nNet cash provided by financing activities was $13.2 million in fiscal 2021, as compared to $72.1 million in fiscal 2020. The cash provided by financing activities in fiscal 2021, was primarily from the issuance of common stock of $13.3 million, primarily from employee stock purchase plans and employee option exercises.\nNet cash provided by financing activities was $72.1 million in fiscal 2020, as compared to $249.2 million provided by financing activities in fiscal 2019. The cash provided by financing activities in fiscal 2020, was primarily from the issuance of convertible debt of $73.9 million and from the issuance of common stock under employee stock purchase plans of $14.3 million. These inflows were partially offset by $9.3 million in capped call transactions and $6.6 million to settle payroll tax obligations.\nOff-Balance Sheet Arrangements\nAs of March 31, 2021, we did not have any off-balance sheet arrangements, as defined in Item 303(a)(4)(ii) of SEC Regulation S-K, such as the use of unconsolidated subsidiaries, structured finance, special purpose entities or variable interest entities.\nAs set forth below in our contractual obligations table, we do have inventory purchases and other commitments incurred in the normal course of business. We may also agree in the normal course of business to indemnify other parties, including customers, lessors and parties to other transactions with us with respect to matters such as breaches of representations or covenants or intellectual property infringement or other claims made by third parties. See Note 6, Commitments and Contingencies, in the Notes to Consolidated Financial Statements included in this Annual Report for further information about our indemnification arrangements.\nContractual Obligations\nObligations related to our convertible senior notes, operating lease payments, and purchase obligations at March 31, 2021 for the next five years were as follows:\nPayments Due by Period\nTotal Less than\n1 year 1-3 years 3-5 years More than\n5 years\nConvertible senior notes $ 362,500 $ - $ 362,500 $ - $ -\nOperating lease obligations(1)\n113,049 16,341 27,000 22,015 47,693\nLease assignment contract(1)\n868 868 - - -\nPurchase obligations 18,625 5,051 13,574 - -\nTotal $ 495,042 $ 22,260 $ 403,074 $ 22,015 $ 47,693\n(1) See Note 5, Leases, in the Notes to Consolidated Financial Statements included in this Annual Report for further information.\nCRITICAL ACCOUNTING POLICIES & ESTIMATES\nOur consolidated financial statements are prepared in accordance with U.S. GAAP. Refer to Note 1, The Company and Significant Accounting Policies, in the Notes to Consolidated Financial Statements included in this Annual Report, which describes the significant accounting policies and methods used in the preparation of our consolidated financial statements.\nWe have identified the policies below as critical to our business and the understanding of our results of operations. These policies may involve a higher degree of judgment and complexity in their application and represent the critical accounting policies used in the preparation of our consolidated financial statements. Although we believe our judgments and estimates are appropriate, actual future results may differ from our estimates. If different assumptions or conditions were to prevail, the results could be materially different from our reported results. The impact and any associated risks related to these policies on our business operations is discussed throughout Management's Discussion and Analysis of Financial Condition and Results of Operations where such policies affect our reported and expected financial results.\nRevenue Recognition\nSignificant management judgments and estimates must be made and used in connection with the revenue recognized in any accounting period. Material differences may result in the amount and timing of our revenue for any period if management made different judgments or utilized different estimates.\nRevenue is recognized when performance obligations are satisfied, based on the transaction price. We generally bill our customers on a monthly basis. Contracts typically range from annual to multi-year agreements, generally with payment terms of net 30 days.\nWe record reductions to revenue for estimated sales returns and customer credits at the time the related revenue is recognized. Sales returns and customer credits are estimated based on our historical experience, current trends, and our expectations regarding future service delivery and platform performance. We monitor the accuracy of its sales reserve estimates by reviewing actual returns and credits and adjusts them for its future expectations to determine the adequacy of its current and future reserve needs. If actual future returns and credits differ from past experience, additional reserves may be required.\nService Revenue Recognition\nService revenue from subscriptions to our cloud-based technology platform is recognized on a ratable basis over the contractual subscription term beginning on the date that the platform is delivered to the customer until the end of the contractual period. Payments received in advance of subscription services being rendered are recorded as deferred revenue; revenue recognized for services rendered in advance of payments received are recorded as contract assets. Usage fees, when bundled, are billed in advance and recognized over time on a ratable basis over the contractual subscription term. Non-bundled usage fees are recognized as actual usage occurs.\nOther Revenue Recognition\nOther revenue is primarily comprised of product revenue and professional services revenue. We recognize product revenue for telephony equipment at a point in time, when transfer of control has occurred, which is generally upon shipment. Sales returns are recorded as a reduction to revenue estimated based on historical experience. Professional services for deployment, configuration, system integration, optimization, customer training or education are primarily billed on a fixed-fee basis and are performed by us directly. Professional services revenue is recognized as services are performed or upon completion of the deployment.\nAllowance for Credit Losses\nWe account for allowances for credit losses under the current expected credit loss (“CECL”) impairment model for our financial assets, including accounts receivable, and present the net amount of the financial instrument expected to be collected. The CECL impairment model requires an estimate of expected credit losses, measured over the contractual life of an instrument, that considers forecasts of future economic conditions in addition to information about past events and current conditions. Using this model, we estimate the adequacy of the allowance for credit losses at the end of each reporting period based on the aging of the receivable balance, current and historical customer trends, communications with customers, and macro-economic conditions. Amounts are written off after considerable collection efforts have been made and the amounts are determined to be uncollectible.\nCapitalized Internal-Use Software Costs\nCertain software development costs for computer software developed internally or obtained for internal use are capitalized during the application development stage. We begin to capitalize our costs to develop software when preliminary development efforts are successfully completed, management has authorized and committed project funding, and it is probable that the project will be completed and the software will be used as intended. Once the project has been completed, these costs are amortized on a straight-line basis over the estimated useful life of the related asset, generally estimated to be three years. Costs incurred prior to meeting these criteria together with costs incurred for training and maintenance are expensed as incurred and recorded in the applicable income statement category, typically research and development, in our consolidated statements of operations.",
    "item_7A": "ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nInterest Rate Fluctuation Risk\nWe had cash, cash equivalents, and investments totaling $152.9 million as of March 31, 2021. Cash equivalents and investments were invested primarily in money market funds, U.S. treasury, commercial paper, and corporate bonds. Our investment policy is focused on the preservation of capital and supporting our liquidity needs. Under the policy, we invest in highly rated securities, while limiting the amount of credit exposure to any one issuer other than the U.S. government. We do not invest in financial instruments for trading or speculative purposes, nor do we use leveraged financial instruments. We utilize external investment managers who adhere to the guidelines of our investment policy. A hypothetical 10% change in interest rates would not have a material impact on the value of our cash, cash equivalents, or available-for-sale investments.\nThe Company has issued $362.5 million aggregate principal amount of convertible senior notes. The fair value of the convertible senior notes is subject to interest rate risk, market risk and other factors due to the conversion feature. The fair value of the convertible senior notes will generally increase as our common stock price increases and will generally decrease as our common stock price declines. The interest and market value changes affect the fair value of the convertible senior notes but do not impact our financial position, cash flows or results of operations due to the fixed nature of the debt obligation. Additionally, we carry the convertible senior notes at face value less unamortized discount on our consolidated balance sheets, and we present the fair value for required disclosure purposes only.\nForeign Currency Exchange Risk\nWe have foreign currency risks related to our revenue and operating expenses denominated in currencies other than the U.S. dollar, primarily the British Pound, causing both our revenue and our operating results to be impacted by fluctuations in the exchange rates.\nGains or losses from the revaluation of certain cash balances, accounts receivable balances and intercompany balances that are denominated in these currencies impact our net income (loss). A hypothetical decrease in all foreign currencies against the U.S. dollar of 10%, would not result in a material foreign currency loss on foreign-denominated balances, at March 31, 2021. As our foreign operations expand, our results may be more impacted by fluctuations in the exchange rates of the currencies in which we do business.\nAt this time, we do not, but we may in the future, enter into financial instruments to hedge our foreign currency exchange risk.",
    "item_8": "ITEM 8. CONSOLIDATED FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nINDEX TO FINANCIAL STATEMENTS AND FINANCIAL STATEMENT SCHEDULE\nPage\nFINANCIAL STATEMENTS:\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets\nConsolidated Statements of Operations\nConsolidated Statements of Comprehensive Loss\nConsolidated Statements of Stockholders' Equity\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and the Board of Directors\n8x8, Inc.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of 8x8, Inc. (the “Company”) as of March 31, 2021 and 2020, the related consolidated statements of operations, comprehensive loss, stockholders’ equity, and cash flows for each of the three years in the period ended March 31, 2021, and the related notes and Schedule II - Valuation and Qualifying Accounts (collectively referred to as the “consolidated financial statements”). We also have audited the Company’s internal control over financial reporting as of March 31, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the consolidated financial position of the Company as of March 31, 2021 and 2020, and the consolidated results of its operations and its cash flows for each of the three years in the period ended March 31, 2021, in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of March 31, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by COSO.\nChange in Accounting Principle\nAs discussed in Note 1 to the consolidated financial statements, in 2021 the Company changed its method of accounting for allowances for credit losses due to the adoption of Accounting Standards Codification Topic No. 326.\nBasis for Opinions\nThe Company’s management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the Management’s Report on Internal Control over Financial Reporting under Item 9A. Our responsibility is to express an opinion on the Company’s consolidated financial statements and an opinion on the Company’s internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (“PCAOB”) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures to respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ Moss Adams LLP\nCampbell, California\nMay 17, 2021\nWe have served as the Company's auditor since 2008.\n8X8, INC.\nCONSOLIDATED BALANCE SHEETS\n(Dollars in thousands, except share and per share amounts)\nAs of March 31,\n2021 2020\nASSETS\nCurrent assets:\nCash and cash equivalents $ 112,531 $ 137,394\nRestricted cash, current 8,179 10,376\nShort-term investments 40,337 33,458\nAccounts receivable, net 51,150 37,811\nDeferred sales commission costs, current 30,241 22,444\nOther current assets 34,095 35,679\nTotal current assets 276,533 277,162\nProperty and equipment, net 93,076 94,382\nOperating lease, right-of-use assets 66,664 78,963\nIntangible assets, net 17,130 24,001\nGoodwill 131,520 128,300\nRestricted cash, non-current 462 8,641\nLong-term investments - 16,083\nDeferred sales commission costs, non-current 72,427 53,307\nOther assets, non-current 20,597 19,802\nTotal assets $ 678,409 $ 700,641\nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent liabilities:\nAccounts payable $ 31,236 $ 40,261\nAccrued compensation 29,879 22,656\nAccrued taxes 12,129 10,251\nOperating lease liabilities, current 12,942 5,875\nDeferred revenue, current 20,737 7,105\nOther accrued liabilities 14,455 37,277\nTotal current liabilities 121,378 123,425\nOperating lease liabilities, non-current 82,456 92,452\nConvertible senior notes, net 308,435 291,537\nOther liabilities, non-current 5,636 2,496\nTotal liabilities 517,905 509,910\nCommitments and contingencies (Note 6)\nStockholders' equity:\nPreferred stock: $0.001 par value, 5,000,000 shares authorized, none issued and outstanding at both March 31, 2021 and 2020\n- -\nCommon stock: $0.001 par value, 200,000,000 shares authorized, 109,134,740 shares and 103,178,621 shares issued and outstanding at March 31, 2021 and 2020, respectively\n109 103\nAdditional paid-in capital 755,643 625,474\nAccumulated other comprehensive loss (4,193) (12,176)\nAccumulated deficit (591,055) (422,670)\nTotal stockholders' equity 160,504 190,731\nTotal liabilities and stockholders' equity $ 678,409 $ 700,641\nThe accompanying notes are an integral part of these consolidated financial statements.\n8X8, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(Dollars in thousands, except per share amounts)\nFor the years ended March 31,\n2021 2020 2019\nService revenue $ 495,985 $ 414,078 $ 325,305\nOther revenue 36,359 32,159 27,281\nTotal revenue 532,344 446,237 352,586\nOperating expenses:\nCost of service revenue 180,082 145,013 86,122\nCost of other revenue 50,068 56,215 43,850\nResearch and development 92,034 77,790 62,063\nSales and marketing 256,231 240,013 177,976\nGeneral and administrative 100,078 87,025 72,208\nTotal operating expenses 678,493 606,056 442,219\nLoss from operations (146,149) (159,819) (89,633)\nOther (expense) income, net (18,593) (11,717) 1,463\nLoss before provision for income taxes (164,742) (171,536) (88,170)\nProvision for income taxes 843 832 569\nNet loss $ (165,585) $ (172,368) $ (88,739)\nNet loss per share:\nBasic and diluted $ (1.57) $ (1.72) $ (0.94)\nWeighted average number of shares:\nBasic and diluted 105,700 99,999 94,533\nThe accompanying notes are an integral part of these consolidated financial statements.\n8X8, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE LOSS\n(Dollars in thousands)\nFor the years ended March 31,\n2021 2020 2019\nNet loss $ (165,585) $ (172,368) $ (88,739)\nOther comprehensive income (loss), net of tax\nUnrealized gain (loss) on investments in securities 247 (203) 473\nForeign currency translation adjustment 7,736 (4,620) (2,181)\nComprehensive loss $ (157,602) $ (177,191) $ (90,447)\nThe accompanying notes are an integral part of these consolidated financial statements.\n8X8, INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS' EQUITY\n(Dollars in thousands, except shares)\nCommon Stock Additional Paid-in Capital Accumulated Other Comprehensive Income (Loss) Accumulated Deficit Total\nShares Amount\nBalance at March 31, 2018 92,847,354 $ 93 $ 425,790 $ (5,645) $ (201,464) $ 218,774\nAdjustment to opening balance for change in accounting principle - - - - 39,901 39,901\nIssuance of common stock under stock plans, less withholding 3,272,534 3 4,483 - - 4,486\nStock-based compensation expense - - 45,548 - - 45,548\nUnrealized investment gain - - - 473 - 473\nForeign currency translation adjustment - - - (2,181) - (2,181)\nEquity component of convertible senior notes, net of issuance costs - - 31,128 - - 31,128\nNet loss - - - - (88,739) (88,739)\nBalance at March 31, 2019 96,119,888 96 506,949 (7,353) (250,302) 249,390\nIssuance of common stock under stock plans, less withholding 4,452,267 4 7,773 - - 7,777\nIssuance of common stock related to acquisition 2,606,466 3 35,837 - - 35,840\nStock-based compensation expense - - 71,821 - - 71,821\nUnrealized investment loss - - - (203) - (203)\nForeign currency translation adjustment - - - (4,620) - (4,620)\nEquity component of convertible senior notes, net of issuance costs - - 3,094 - - 3,094\nNet loss - - - - (172,368) (172,368)\nBalance at March 31, 2020 103,178,621 103 625,474 (12,176) (422,670) 190,731\nAdjustment to opening balance for change in accounting principle - - - - (2,800) (2,800)\nIssuance of common stock under stock plans, less withholding 6,067,672 6 13,263 - - 13,269\nStock-based compensation expense - - 108,417 - - 108,417\nIssuance of common stock related to acquisition (111,554) - 8,489 - - 8,489\nUnrealized investment gain (loss) - - - 247 - 247\nForeign currency translation adjustment - - - 7,736 - 7,736\nNet loss - - - - (165,585) (165,585)\nBalance at March 31, 2021 109,134,739 $ 109 $ 755,643 $ (4,193) $ (591,055) $ 160,504\nThe accompanying notes are an integral part of these consolidated financial statements.\n8X8, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(Dollars in thousands)\nFor the years ended March 31,\n2021 2020 2019\nCash flows from operating activities:\nNet loss $ (165,585) $ (172,368) $ (88,739)\nAdjustments to reconcile net loss to net cash used in operating activities:\nDepreciation 11,297 9,360 8,748\nAmortization of intangible assets 6,886 8,842 6,175\nAmortization of capitalized internal-use software costs 26,934 19,025 9,748\nAmortization of debt discount and issuance costs 16,898 14,045 1,355\nAmortization of deferred sales commission costs 27,817 19,541 14,204\nAllowance for credit losses 4,471 3,479 1,115\nOperating lease expense, net of accretion 15,210 14,971 -\nNon-cash lease expense - - 4,802\nStock-based compensation expense 107,638 70,878 44,508\nOther 1,521 3,522 178\nChanges in assets and liabilities:\nAccounts receivable (14,869) (12,737) (5,393)\nDeferred sales commission costs (52,960) (46,421) (25,286)\nOther current and non-current assets (3,963) (33,137) (4,337)\nAccounts payable and accruals (10,033) 2,159 17,252\nDeferred revenue 14,672 4,936 802\nNet cash used in operating activities (14,066) (93,905) (14,868)\nCash flows from investing activities:\nPurchases of property and equipment (6,430) (35,834) (9,096)\nCapitalized internal-use software costs (28,816) (31,573) (25,622)\nPurchases of investments (52,172) (42,223) (54,127)\nSales of investments 1,018 36,515 54,642\nProceeds from maturities of investments 60,479 25,950 50,700\nAcquisition of businesses, net of cash acquired (10,400) (59,129) (5,625)\nNet cash (used in) provided by investing activities (36,321) (106,294) 10,872\nCash flows from financing activities:\nFinance lease payments (78) (315) (949)\nTax-related withholding of common stock (69) (6,550) (7,823)\nProceeds from issuance of common stock under employee stock plans 13,339 14,330 12,202\nPurchases of capped calls - (9,288) (33,724)\nNet proceeds from issuance of convertible senior notes - 73,918 279,532\nNet cash provided by financing activities 13,192 72,095 249,238\nEffect of exchange rate changes on cash 1,956 (168) (362)\nNet increase (decrease) in cash, cash equivalents and restricted cash (35,239) (128,272) 244,880\nCash, cash equivalents and restricted cash, beginning of year 156,411 284,683 39,803\nCash, cash equivalents and restricted cash, end of year $ 121,172 $ 156,411 $ 284,683\nSupplement and non-cash disclosures:\nFor the years ended March 31,\n2021 2020 2019\nRight-of-use assets obtained in exchange for new and modified operating lease liabilities $ - $ 79,100 $ -\nInterest paid 1,813 1,553 -\nIncome taxes paid 555 934 356\nEquipment acquired under capital leases - - 68\nReconciliation of cash, cash equivalents and restricted cash to the consolidated balance sheets:\nAs of March 31,\n2021 2020 2019\nCash and cash equivalents $ 112,531 $ 137,394 $ 276,583\nRestricted cash, current 8,179 10,376 -\nRestricted cash, non-current 462 8,641 8,100\nTotal cash, cash equivalents and restricted cash $ 121,172 $ 156,411 $ 284,683\nThe accompanying notes are an integral part of these consolidated financial statements.\n8X8, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1. THE COMPANY AND SIGNIFICANT ACCOUNTING POLICIES\nTHE COMPANY\n8x8, Inc. (\"8x8\" or the \"Company\") was incorporated in California in February 1987 and was reincorporated in Delaware in December 1996.\nThe Company is a leading Software-as-a-Service (\"SaaS\") provider of contact center, voice, video, chat, and enterprise-class API solutions powered by one global cloud communications platform. 8x8 empowers workforces worldwide by connecting individuals and teams so they can collaborate faster and work smarter from anywhere. 8x8 provides real-time business analytics and intelligence giving its customers unique insights across all interactions and channels on our platform so they can support a distributed and hybrid working model while delighting their end-customers and accelerating their business. A majority of all revenue is generated from communication services subscriptions and platform usage. The Company also generates revenue from sales of hardware and professional services, which are complimentary to the delivery of the our integrated technology platform.\nThe Company's fiscal year ends on March 31 of each calendar year. Each reference to a fiscal year in these Notes to Consolidated Financial Statements refers to the fiscal year ended March 31 of the calendar year indicated (for example, fiscal 2021 refers to the fiscal year ended March 31, 2021).\nAll dollar amounts herein are in thousands of U.S. Dollars (\"Dollars\") unless otherwise noted.\nPRINCIPLES OF CONSOLIDATION\nThe consolidated financial statements include the accounts of 8x8 and its subsidiaries. All material intercompany accounts and transactions have been eliminated.\nUSE OF ESTIMATES\nThe preparation of the consolidated financial statements in conformity with U.S. generally accepted accounting principles generally (\"U.S. GAAP\") requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities and equity, disclosure of contingent assets and liabilities at the date of the consolidated financial statements, and the reported amounts of revenues and expenses during the reporting period. On an ongoing basis, the Company evaluates its estimates, including, but not limited to, those related to current expected credit losses, returns reserve for expected cancellations, fair value of and/or potential impairment of goodwill and intangible assets, capitalized internal-use software costs, benefit period for deferred commissions, stock-based compensation, incremental borrowing rate used to calculate operating lease liabilities, income and sales tax liabilities, convertible senior notes fair value, litigation, and other contingencies. The Company bases its estimates on known facts and circumstances, historical experience, and various other assumptions. Actual results could differ from those estimates under different assumptions or conditions.\nREVENUE RECOGNITION\nAs described below, significant management judgments and estimates must be made and used in connection with the recognition of revenue. Material differences may result in the amount and timing of our revenue if management were to make different judgments or utilize different estimates.\nThe Company recognizes revenue using the five-step model prescribed by U.S. GAAP, as follows:\n•identification of the contract, or contracts, with a customer;\n•identification of the performance obligations in the contract;\n•determination of the transaction price;\n•allocation of the transaction price to the performance obligations in the contract; and\n•recognition of revenue when, or as, the Company satisfies a performance obligation.\nThe Company identifies performance obligations in contracts with customers, which may include subscription services and related usage, product revenue, and professional services. The transaction price is determined based on the amount we expect to be entitled to receive in exchange for transferring the promised services or products to the customer. The transaction price in the contract is allocated to each distinct performance obligation in an amount that represents the relative amount of consideration expected to be received in exchange for satisfying each performance obligation. Revenue is recognized when performance obligations are satisfied, based on the transaction price, excluding amounts collected on behalf of third parties such as sales and telecommunication taxes, which are collected on behalf of and remitted to governmental authorities. We generally bill our customers on a monthly basis. Contracts typically range from annual to multi-year agreements with payment terms of net 30 days. We occasionally allow a 30-day period to cancel a subscription and return products shipped for a full refund.\nThe Company records reductions to revenue for estimated sales returns and customer credits at the time the related revenue is recognized. Sales returns and customer credits are estimated based on its historical experience, current trends and its expectations regarding future experience. The Company monitors the accuracy of its sales reserve estimates by reviewing actual returns and credits and adjusts them for its future expectations to determine the adequacy of its current and future reserve needs. If actual future returns and credits differ from past experience, additional reserves may be required.\nWhen the Company's services do not meet certain service level commitments, customers are entitled to receive service credits, and in certain cases, refunds, each representing a form of variable consideration. The Company historically has not experienced any significant incidents affecting the defined levels of reliability and performance as required by our subscription contracts. Accordingly, the amount of any estimated refunds related to these agreements in the consolidated financial statements is not material during the periods presented.\nJudgments and Estimates\nThe estimation of variable consideration for each performance obligation requires the Company to make subjective judgments. The Company has service-level agreements with customers warranting defined levels of uptime reliability and performance. Customers may get credits or refunds if the Company fails to meet such levels. If the services do not meet certain criteria, fees are subject to adjustment or refund representing a form of variable consideration. The Company may impose minimum revenue commitments (\"MRC\") on its customers at the inception of the contract. Thus, in estimating variable consideration for each of these performance obligations, the Company assesses both the probability of MRC occurring and the collectability of the MRC, both of which represent a form of variable consideration.\nThe Company enters into contracts with customers that regularly include promises to transfer multiple services and products, such as subscriptions, products, and professional services. For arrangements with multiple services, the Company evaluates whether the individual services qualify as distinct performance obligations. In its assessment of whether a service is a distinct performance obligation, the Company determines whether the customer can benefit from the service on its own or with other readily available resources, and whether the service is separately identifiable from other services in the contract. This evaluation requires the Company to assess the nature of each individual service offering and how the services are provided in the context of the contract, including whether the services are significantly integrated, highly interrelated, or significantly modify each other, which may require judgment based on the facts and circumstances of the contract.\nWhen agreements involve multiple distinct performance obligations, the Company allocates arrangement consideration to all performance obligations at the inception of an arrangement based on the relative standalone selling prices (\"SSP\") of each performance obligation. Usage fees deemed to be variable consideration meet the allocation exception for variable consideration. Where the Company has standalone sales data for its performance obligations which are indicative of the price at which the Company sells a promised good or service separately to a customer, such data is used to establish SSP. In instances where standalone sales data is not available for a particular performance obligation, the Company estimates SSP by the use of observable market and cost-based inputs. The Company continues to review the factors used to establish list price and will adjust standalone selling price methodologies as necessary on a prospective basis.\nService Revenue\nService revenue from subscriptions to the Company's cloud-based technology platform is recognized ratably over the contractual subscription term, beginning on the date that the platform is delivered to the customer until the end of the contractual period. Payments received in advance of subscription services being rendered are recorded as deferred revenue; revenues recognized for services rendered in advance of payments received are recorded as contract assets. Usage fees, when bundled, are billed in advance and recognized over time on a ratable basis over the contractual subscription term, which is usually the monthly contractual billing period. Non-bundled usage fees are recognized as actual usage occurs.\nOther Revenue\nOther revenue comprises primarily product revenue and professional services revenue.\nThe Company recognizes product revenue for telephony equipment at the point in time when transfer of control has occurred, which is generally upon shipment. Sales returns are recorded as a reduction to revenue estimated based on historical experience. Professional services for deployment, configuration, system integration, optimization, customer training or education are primarily billed on a fixed-fee basis and are performed by the Company directly. Professional services revenue is recognized as services are performed or upon completion of the deployment.\nContract Assets\nContract assets are recorded for contract consideration not yet invoiced but for which the performance obligations are completed. The revenue is recognized when the customer receives services or equipment for a reduced consideration at the onset of an arrangement, for example, when the initial month's services or equipment are discounted. Contract assets are included in other current assets or other assets in the Company's consolidated balance sheets, depending on if their reduction will be recognized during the succeeding twelve-month period or beyond.\nDeferred Revenue\nDeferred revenue represents billings or payments received in advance of revenue recognition and are recognized upon transfer of control. Balances consist primarily of annual plan subscription services and professional and training services not yet provided as of the balance sheet date. Revenue that will be recognized during the twelve month period in which the Company is providing services are recorded as deferred revenue, current in the consolidated balance sheets, with the remainder recorded as other liabilities, non-current in the Company's consolidated balance sheets.\nDeferred Sales Commission Costs\nSales commissions are considered incremental and recoverable costs of acquiring customer contracts. These costs are capitalized as deferred sales commission costs and amortized on a straight-line basis over the anticipated benefit period of five years. The benefit period was estimated by taking into consideration the length of customer contracts, technology lifecycle, and other factors. This amortization expense is recorded in sales and marketing expense within the Company's consolidated statement of operations.\nThe Company applies a practical expedient that permits it to apply an anticipated benefit period to a portfolio of contracts, instead of on a contract-by-contract basis, as they are similar in their characteristics, and the financial statement effects of that application to the portfolio would not differ materially from applying it to the individual contracts within that portfolio.\nCASH, CASH EQUIVALENTS, AND INVESTMENTS\nThe Company considers all highly liquid investments with an original maturity of three months or less to be cash equivalents.\nInvestments are classified as available-for-sale and reported at fair value, based either upon quoted prices in active markets, quoted prices in less active markets, or quoted market prices for similar investments, with unrealized gains and losses, net of related tax, if any, included in other comprehensive income (loss) and disclosed as a separate component of stockholders' equity. Realized gains and losses on sales of all such investments are reported within the caption of other income (expense), net in the consolidated statements of operations and computed using the specific identification method. The Company classifies its investments as short-term or long-term based on the nature of the investments and their availability for use in current operations. The Company's investments in marketable securities are monitored on a periodic basis for impairment. In the event the carrying value of an investment exceeds its fair value and the decline in value is determined to be other-than-temporary, an impairment charge is recorded and a new cost basis for the investment is established. These available-for-sale investments are primarily held in the custody of two major financial institutions.\nALLOWANCE FOR CREDIT LOSSES\nThe Company accounts for allowance for credit losses under the current expected credit loss (“CECL”) impairment model for its financial assets, including accounts receivable, and presents the net amount of the financial instrument expected to be collected. The CECL impairment model requires an estimate of expected credit losses, measured over the contractual life of an instrument, that considers forecasts of future economic conditions in addition to information about past events and current conditions. Based on this model, the Company estimates the amount of uncollectible accounts receivable at the end of each reporting period based on the aging of the receivable balance, current and historical customer trends, communications with its customers, and macro-economic conditions. Amounts are written off after considerable collection efforts have been made and the amounts are determined to be uncollectible.\nOPERATING LEASE, RIGHT-OF-USE ASSETS, AND LEASE LIABILITIES\nThe Company primarily leases facilities for office and data center space under non-cancellable operating leases for its U.S. and international locations that expire at various dates through 2030. For leases with a term greater than 12 months, the Company recognizes a right-of-use asset and a lease liability based on the present value of lease payments over the lease term. Variable lease payments are not included in the lease payments to measure the lease liability and are expensed as incurred.\nThe Company’s leases have remaining terms of one to 10 years. Some of the leases include a Company option to extend the lease term for less than 12 months to five years, or more, which if reasonably certain to exercise, the Company includes in the determination of lease payments. The lease agreements do not contain any material residual value guarantees or material restrictive covenants.\nAs most of the Company's leases do not provide a readily determinable implicit rate, the Company uses its incremental borrowing rate at lease commencement, which is determined using a portfolio approach, based on the rate of interest that the Company would have to pay to borrow an amount equal to the lease payments on a collateralized basis over a similar term. The Company uses the implicit rate when a rate is readily determinable. Operating lease expense is recognized on a straight-line basis over the lease term.\nLeases with an initial term of 12 months or less are not recognized on the Company's consolidated balance sheets, and the expense for these short-term leases is recognized on a straight-line basis over the lease term.\nPROPERTY AND EQUIPMENT\nProperty and equipment are stated at cost less accumulated depreciation and amortization. Depreciation and amortization are computed using the straight-line method. Estimated useful lives of three years are used for equipment, capitalized internal-use software and software development costs, and five years for furniture and fixtures. Amortization of leasehold improvements is computed using the shorter of the remaining facility lease term or the estimated useful life of the improvements.\nMaintenance, repairs, and ordinary replacements are charged to expense. Expenditures for improvements that extend the physical or economic life of the property are capitalized. Gains or losses on the disposition of property and equipment are recorded in the consolidated statements of operations.\nConstruction in progress primarily relates to costs to acquire or internally develop internal-use software not fully completed as of March 31, 2021 and 2020.\nCAPITALIZED INTERNAL-USE SOFTWARE COSTS\nCertain costs of software developed or obtained for internal use is capitalized during the application development stage. The Company begins to capitalize costs to develop software when preliminary development efforts are successfully completed, management has authorized and committed project funding, it is probable that the project will be completed, and the software will be used as intended.\nCapitalized internal-use software development costs are included in property and equipment. Once the project has been completed, these costs are amortized to cost of service revenue on a straight-line basis over the estimated useful life of the related asset, generally estimated to be three years. Costs incurred prior to meeting these criteria together with costs incurred for training and maintenance are expensed as incurred and recorded in research and development expense. The Company tests capitalized internal-use software development costs for impairment on an annual basis, or as events occur or circumstances change that could impact the recoverability of the capitalized costs.\nACCOUNTING FOR LONG-LIVED ASSETS\nThe Company reviews the recoverability of its long-lived assets, such as property and equipment, right-of-use assets, definite lived intangibles or capitalized internal-use software costs, when events or changes in circumstances occur that indicate that the carrying value of the asset or asset group may not be recoverable. Examples of such events could include a disposal of a significant portion of such assets, an adverse change in the market involving the business employing the related asset or a significant change in the operation or use of an asset. The assessment of possible impairment is based on the Company's ability to recover the carrying value of the asset or asset group from the expected future cash flows (undiscounted and without interest charges) of the related operations. If these cash flows are less than the carrying value of such asset or asset group, an impairment loss is recognized for the difference between estimated fair value and carrying value. The measurement of impairment requires management to estimate the fair value of long-lived assets and asset groups through future cash flows.\nGOODWILL AND OTHER INTANGIBLE ASSETS\nGoodwill represents the excess fair value of consideration transferred over the fair value of net assets acquired in business combinations. Goodwill and intangible assets with indefinite useful lives are not amortized but are tested annually for impairment and more often if there is an indicator of impairment.\nThe Company performs testing for impairment of goodwill on an annual basis, or as events occur or circumstances change that would more likely than not reduce the fair value of the Company’s single reporting unit below its carrying amount. Goodwill is considered impaired if the carrying value of the reporting unit exceeds its fair value.\nIntangible assets, consisting of acquired developed technology, domain names, and customer relationships, acquired in a business combinations are initially measured at fair value and were determined to have definite lives. Thereafter, intangible assets are amortized on a straight-line basis over their estimated useful lives. Amortization expense related to developed technology is included in cost of revenue. Amortization expense related to customer relationships and domain names are included in sales and marketing expense. Intangible assets are reviewed for impairment whenever events or changes in circumstances indicate an asset’s carrying value may not be recoverable.\nRESEARCH AND DEVELOPMENT EXPENSES\nResearch and development expenses consist primarily of personnel and related costs, third-party development and related work, software and equipment costs necessary for us to conduct our product and platform development and engineering efforts, and allocated IT and facilities costs. Research and development costs are expensed as incurred.\nADVERTISING COSTS\nAdvertising costs are expensed as incurred and were $9.0 million, $32.2 million and $25.0 million for the years ended March 31, 2021, 2020, and 2019, respectively.\nFOREIGN CURRENCY TRANSLATION\nThe Company has determined that the functional currency of each of its foreign subsidiaries is the subsidiary's local currency. The Company believes that this most appropriately reflects the current economic facts and circumstances of the subsidiaries' operations. The assets and liabilities of the subsidiaries are translated at the applicable exchange rate as of the end of the balance sheet period and revenue and expense amounts are translated at an average rate over the period presented. Resulting currency translation adjustments are recorded as a component of accumulated other comprehensive income or loss within the stockholder's equity.\nSEGMENT INFORMATION\nThe Company has determined its chief executive officer is the chief operating decision maker. The chief executive officer reviews financial information presented on a consolidated basis for purposes of assessing performance and making decisions on how to allocate resources. The Company has determined that it operates in a single reportable segment.\nCONCENTRATIONS\nFinancial instruments that potentially subject the Company to significant concentrations of credit risk consist principally of cash and cash equivalents, investments and trade accounts receivable. The Company has cash equivalents and investment policies that limit the amount of credit exposure to any one financial institution and restrict placement of these funds to financial institutions evaluated as highly credit-worthy. The Company has not experienced any material losses relating to its investments.\nThe Company sells its products to customers and distributors. The Company performs credit evaluations of its customers' financial condition and generally does not require collateral from its customers. As of, and for the years ending, March 31, 2021 and 2020, no customer accounted for more than 10% of accounts receivable or revenues.\nThe Company purchases all of its hardware products from suppliers that manufacture the hardware directly, and from their distributors. The inability of any supplier to fulfill supply requirements of the Company could materially impact future operating results, financial position or cash flows.\nThe Company also relies primarily on third-party network service providers to provide telephone numbers and public switched telephone network (\"PSTN\") call termination and origination services for its customers. If these service providers failed to perform their obligations to the Company, such failure could materially impact future operating results, financial position and cash flows.\nFAIR VALUE OF FINANCIAL INSTRUMENTS\nThe Company defines fair value as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. When determining the fair value measurements for assets and liabilities required or permitted to be recorded at fair value, the Company considers the principal market or the most advantageous market in which it would transact.\nThe Company maximizes the use of observable inputs and minimizes the use of unobservable inputs when measuring fair value. Observable inputs are inputs that reflect the assumptions market participants would use in valuing the asset or liability and are developed based on market data obtained from sources independent of the Company. Unobservable inputs are inputs that reflect the Company's assumptions about the factors that market participants would use in valuing the asset or liability developed based on the best information available in the circumstances.\nThe standard establishes a fair value hierarchy based on the level of independent, objective evidence surrounding the inputs used to measure fair value by requiring that the most observable inputs be used when available. A financial instrument's categorization within the fair value hierarchy is based upon the lowest level of input that is significant to the fair value measurement. The fair value hierarchy is as follows:\n• Level 1 applies to assets or liabilities for which there are quoted prices in active markets for identical assets or liabilities that the Company has the ability to access at the measurement date.\n• Level 2 applies to assets or liabilities for which there are inputs other than quoted prices included in Level 1 that are observable for the asset or liability, either directly or indirectly, such as quoted prices for similar assets or liabilities in active markets; quoted prices for identical assets or liabilities in markets with insufficient volume or infrequent transactions (less active markets).\n• Level 3 applies to assets or liabilities for which fair value is derived from valuation techniques in which one or more significant inputs are unobservable, including the Company's own assumptions.\nThe estimated fair value of financial instruments is determined by the Company using available market information and valuation methodologies considered to be appropriate. The carrying amounts of the Company's cash and cash equivalents, accounts receivable and accounts payable approximate their fair values due to their short maturities. The Company's investments are recorded at fair value and convertible senior notes payable are recorded at net carrying value.\nACCOUNTING FOR STOCK-BASED COMPENSATION\nThe Company accounts for the fair value of restricted stock units (“RSUs”) using the closing market price of the Company’s common stock on the date of grant. For new-hire grants and annual refresh grants, one-third of the RSUs typically vest on the first anniversary of grant date, and remainder vest on a one-eighth basis quarterly over the subsequent two years.\nStock-based compensation cost for RSUs is measured at the grant date based on the estimated fair value of the award and is recognized as expense over the requisite service period (generally the vesting period), net of estimated forfeitures.\nThe Company accounts for the fair value of performance stock units (\"PSUs\") using Monte Carlo simulations.\nThe Company estimates the fair value of the rights to acquire stock under its 1996 Employee Stock Purchase Plan (the “ESPP”) using the Black-Scholes option pricing formula. The ESPP provides for consecutive six-month offering periods with a one-year lookback period and the Company uses its own historical volatility data in the valuation of shares that are purchased under the ESPP.\nCOMPREHENSIVE INCOME (LOSS)\nComprehensive income (loss), as defined, includes all changes in equity (net assets) during a period. The difference between net income (loss) and comprehensive income (loss) is due to foreign currency translation adjustments and unrealized gains or losses on investments classified as available-for-sale.\nNET INCOME (LOSS) PER SHARE\nBasic net income (loss) per share is computed by dividing net income (loss) available to common stockholders (numerator) by the weighted average number of vested, unrestricted common shares outstanding during the period (denominator). Diluted net income (loss) per share is computed on the basis of the weighted average number of shares of common stock plus the effect of dilutive potential common shares outstanding during the period using the treasury stock method unless their effect is anti-dilutive. Dilutive potential common shares include outstanding stock options, ESPP, RSUs and PSUs.\nRECENTLY ADOPTED ACCOUNTING PRONOUNCEMENTS\nIn June 2016, the Financial Accounting Standards Board (\"FASB\") issued ASU 2016-13, Financial Instruments-Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments, as amended, which replaces the existing impairment model with a forward-looking expected loss method. Under this update, on initial recognition and at each reporting period, an entity is required to recognize an allowance that reflects the entity's current estimate of credit losses expected to be incurred over the life of the financial instrument. For trade receivables, loans, and other financial instruments, an entity is required to use a forward-looking expected loss model to recognize credit losses that are probable. The Company adopted ASU 2016-13 on a modified retrospective basis as of April 1, 2020, through a cumulative-effect adjustment to the Company's beginning accumulated deficit balance; the impact of the adoption was not material to the Company's consolidated financial statements. Credit losses are not expected to be significant based on historical collection trends, the financial condition of the Company’s customers, and external market factors, including those related to the COVID-19 pandemic. The Company will continue to actively monitor the impact of the recent COVID-19 pandemic on expected credit losses.\nIn August 2018, the FASB issued ASU 2018-13, Fair Value Measurement (Topic 820), which makes modifications to disclosure requirements on fair value measurements. The Company adopted ASU 2018-13 on April 1, 2020. The impact of the adoption was immaterial to the Company's consolidated financial statements.\nIn August 2018, the FASB issued ASU 2018-15, Intangibles-Goodwill and Other-Internal Use Software (Subtopic 350-40), which reduces complexity for the accounting for costs of implementing a cloud computing service arrangement. The Company adopted this guidance on a prospective basis effective April 1, 2020. The impact of the adoption was immaterial to the Company's consolidated financial statements.\nRECENT ACCOUNTING PRONOUNCEMENTS NOT YET EFFECTIVE\nIn December 2019, the FASB issued ASU 2019-12, Income Taxes (Topic 740), which enhances and simplifies various aspects of the income tax accounting guidance, including requirements such as tax basis step-up in goodwill obtained in a transaction that is not a business combination, ownership changes in investments, and interim-period accounting for enacted changes in tax law. The amendment will be effective for public companies with fiscal years beginning after December 15, 2020, which is fiscal 2022 for the Company; early adoption is permitted. The Company is currently assessing the impact of this pronouncement to its consolidated financial statements.\nIn August 2020, the FASB issued ASU 2020-06, Debt - Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging-Contracts in Entity’s Own Equity (Subtopic 815-40), which simplifies accounting for convertible instruments by eliminating two of the three accounting models available for convertible debt instruments and convertible preferred stock. The guidance also addresses how convertible instruments are accounted for in the diluted earnings per share calculation. The guidance is effective for fiscal years beginning after December 15, 2021, which is fiscal 2023 for the Company; early adoption is permitted. The Company is currently assessing the impact of this pronouncement to its consolidated financial statements.\n2. REVENUE RECOGNITION\nDisaggregation of Revenue\nThe Company disaggregates its revenue by geographic region. See Note 11. Geographical Information.\nContract Balances\nThe following table provides amounts of receivables, contract assets and deferred revenue from contracts with customers:\nMarch 31, 2021 March 31, 2020\nAccounts receivable, net $ 51,150 $ 37,811\nContract assets, current 12,840 10,425\nContract assets, non-current 17,987 13,698\nDeferred revenue, current 20,737 7,105\nDeferred revenue, non-current 2,999 1,119\nContract assets, current, contract assets, non-current, and deferred revenue, non-current are recorded on the Consolidated Balance Sheets in Other current assets, Other assets, and Other liabilities, non-current, respectively.\nThe change in contract assets was primarily driven by the recognition of revenue that has not yet been billed. The increase in deferred revenue was due to billings in advance of performance obligations being satisfied. During the year ended March 31, 2021, the Company recognized revenues of approximately $6.1 million that was included in deferred revenue at the beginning of the year.\nRemaining Performance Obligations\nThe Company's subscription terms typically range from one to five years. Contract revenue from the remaining performance obligations that had not yet been recognized as of March 31, 2021, was approximately $500.0 million. This amount excludes contracts with an original expected length of less than one year. The Company expects to recognize revenue on approximately 70% of the remaining performance obligation over the next 36 months and approximately 30% thereafter.\nAs of March 31, 2021, the Company updated this disclosure to exclude contracts with an original expected length of less than one year. Previously, this disclosure excluded contracts with an original expected length of one year or less. As the new and renewal contracts the Company enters into with its customers are generally for terms of one year or longer, management determined that updating this disclosure to include contracts with a term of one year or more presents a more appropriate measure of the Company's remaining performance obligation.\nDeferred Sales Commission Costs\nAmortization of deferred sales commission costs for the years ended March 31, 2021, 2020, and 2019 was $27.8 million, $19.5 million, and $14.2 million, respectively. There were no material write-offs during the years ended March 31, 2021, 2020, and 2019.\n3. FAIR VALUE MEASUREMENTS\nCash, cash equivalents and available-for-sale investments were as follows:\nAs of March 31, 2021 Amortized\nCosts Gross\nUnrealized\nGain Gross\nUnrealized\nLoss Estimated\nFair Value Cash and\nCash\nEquivalents Restricted Cash\n(Current & Non-current) Short-Term\nInvestments Long-Term\nInvestments\nCash $ 39,070 $ - $ - $ 39,070 $ 39,070 $ - $ - $ -\nLevel 1:\nMoney market funds 67,712 - - 67,712 67,712 - - -\nTreasury securities 6,177 17 - 6,194 - - 6,194 -\nSubtotal 112,959 17 - 112,976 106,782 - 6,194 -\nLevel 2:\nCertificate of deposit 8,641 - - 8,641 - 8,641 - -\nCommercial paper 17,656 42 - 17,698 700 - 16,998 -\nCorporate debt 22,193 1 - 22,194 5,049 - 17,145 -\nSubtotal 48,490 43 - 48,533 5,749 8,641 34,143 -\nTotal assets $ 161,449 $ 60 $ - $ 161,509 $ 112,531 $ 8,641 $ 40,337 $ -\nAs of March 31, 2020 Amortized\nCosts Gross\nUnrealized\nGain Gross\nUnrealized\nLoss Estimated\nFair Value Cash and\nCash\nEquivalents Restricted Cash\n(Current & Non-current) Short-Term\nInvestments Long-Term\nInvestments\nCash $ 21,002 $ - $ - $ 21,002 $ 21,002 $ 10,376 $ - $ -\nLevel 1:\nMoney market funds 110,796 - - 110,796 110,796 - - -\nTreasury securities 6,192 116 - 6,308 - - - 6,308\nSubtotal 137,990 116 - 138,106 131,798 10,376 - 6,308\nLevel 2:\nCertificate of deposit 8,641 - - 8,641 - 8,641 - -\nCommercial paper 14,979 6 - 14,985 5,596 - 9,389 -\nCorporate debt 34,153 32 (341) 33,844 - - 24,069 9,775\nSubtotal 57,773 38 (341) 57,470 5,596 8,641 33,458 9,775\nTotal assets $ 195,763 $ 154 $ (341) $ 195,576 $ 137,394 $ 19,017 $ 33,458 $ 16,083\nCertificate of deposit represents the Company's letter of credits securing leases for office facilities, the balance of which is included in Restricted cash, current and Restricted cash, non-current on the Company's Consolidated Balance Sheet.\nThe Company considers its investments available to support its current operations and has classified all investments as available-for-sale securities. The Company does not intend to sell any of its investments that are in unrealized loss positions and, as of March 31, 2021, has determined that it is not more likely than not that it will be required to sell any of these investments before recovery of the entire amortized cost basis.\nThe Company regularly reviews the changes to the rating of its securities at the individual security level by rating agencies and reasonably monitors the surrounding economic conditions to assess the risk of expected credit losses. As of March 31, 2021, the Company did not record any allowance for credit losses on its investments.\nAs of March 31, 2021 and 2020, the estimated fair value of the Company's Notes was $502.9 million and $309.6 million, respectively, which was determined based on the closing price for the Notes on the last trading day of the reporting period and is considered to be Level 2 in the fair value hierarchy due to limited trading activity of the Notes. See Note 7, Convertible Senior Notes and Capped Call.\n4. INTANGIBLE ASSETS AND GOODWILL\nThe carrying value of intangible assets consisted of the following:\nMarch 31, 2021 March 31, 2020\nGross\nCarrying\nAmount Accumulated\nAmortization Net Carrying\nAmount Gross\nCarrying\nAmount Accumulated\nAmortization Net Carrying\nAmount\nTechnology $ 33,960 $ (21,458) $ 12,502 $ 33,932 $ (16,312) $ 17,620\nCustomer relationships 11,969 (7,341) 4,628 11,409 (5,412) 5,997\nTrade names and domains 988 (988) - 983 (599) 384\nTotal acquired identifiable intangible assets $ 46,917 $ (29,787) $ 17,130 $ 46,324 $ (22,323) $ 24,001\nAs of March 31, 2021, the weighted average remaining useful life for technology, customer relationship, and trade names and domains was 4.4 years, 5.2 years, and 0.0 years, respectively.\nAmortization expense for related intangible assets was $6.9 million, $8.8 million, and $6.2 million for the years ended March 31, 2021, 2020 and 2019, respectively.\nDuring the year ended March 31, 2020, the Company wrote off approximately $11.3 million of fully amortized intangible assets and the corresponding accumulated amortization.\nAt March 31, 2021, annual amortization of definite lived intangible assets, based upon existing intangible assets and current useful lives, is estimated to be the following:\nAmount\n2022 $ 4,708\n2023 3,156\n2024 2,851\n2025 2,851\n2026 and thereafter 3,564\nTotal $ 17,130\nThe following table provides a summary of the changes in the carrying amounts of goodwill:\nTotal\nBalance at March 31, 2019 $ 39,694\nAdditions due to acquisitions 91,060\nForeign currency translation (2,454)\nBalance at March 31, 2020 128,300\nForeign currency translation 3,220\nBalance at March 31, 2021 $ 131,520\nThe Company conducted its annual impairment tests of goodwill in the fourth quarters of fiscal years 2021, 2020, and 2019, and determined that no adjustment to the carrying value of goodwill was required.\n5. LEASES\nOperating Leases\nThe following table provides balance sheet information related to operating leases:\nMarch 31, 2021 March 31, 2020\nAssets\nOperating lease, right-of-use assets $ 66,664 $ 78,963\nLiabilities\nOperating lease liabilities, current $ 12,942 $ 5,875\nOperating lease liabilities, non-current 82,456 92,452\nTotal operating lease liabilities $ 95,398 $ 98,327\nThe components of lease expense were as follows:\nFor the years ended March 31,\n2021 2020\nOperating lease expense $ 15,210 $ 14,971\nVariable lease expense 2,462 1,602\nShort-term lease expense was immaterial during the years ended March 31, 2021 and 2020.\nCash outflows from operating leases were $9.9 million and $9.9 million, respectively, for the years ended March 31, 2021 and 2020.\nThe following table presents supplemental lease information:\nMarch 31, 2021 March 31, 2020\nWeighted average remaining lease term 8.4 years 8.9 years\nWeighted average discount rate 4.0% 4.0%\nThe following table presents maturity of lease liabilities under the Company's non-cancellable operating leases as of March 31, 2021:\n2022 $ 16,341\n2023 15,155\n2024 11,845\n2025 11,508\n2026 10,507\nThereafter 47,693\nTotal lease payments 113,049\nLess: imputed interest (17,651)\nPresent value of lease liabilities $ 95,398\nLease Assignment\nIn the fourth quarter of fiscal 2018, the Company entered into a 132-month lease agreement (the \"Agreement\") with CAP Phase I, a Delaware limited liability company (the \"Landlord\"), to rent approximately 162,000 square feet of office space in a new building in San Jose, California. The lease term began on January 1, 2019. On April 30, 2019, due to the Company's rapid growth and greater than anticipated future space needs, the Company entered into an assignment and assumption (the \"Assignment\") of the Agreement with the Landlord, and Roku Inc., a Delaware corporation (\"Roku\"), whereby the Company assigned to Roku the Agreement. Pursuant to the Assignment, the Company expects to be released from all of its obligations under the lease and related standby letter of credit by the end of the Company’s year ending March 31, 2022, or shortly thereafter. The Company received the reimbursement of base rent and direct expenses of $6.4 million from Roku in the fourth quarter of fiscal 2021 in accordance with the Assignment. The obligations related to the Agreement are not included in the right-of-use asset or lease liabilities as of March 31, 2021. The remaining obligations related to the Assignment of $0.8 million, including the termination fee of $0.8 million, are recorded in Other accrued liabilities in the Company's Consolidated balance sheet.\n6. COMMITMENTS AND CONTINGENCIES\nIndemnifications\nIn the normal course of business, the Company may agree to indemnify other parties, including customers, lessors and parties to other transactions with the Company, with respect to certain matters such as breaches of representations or covenants or intellectual property infringement or other claims made by third parties. These agreements may limit the time within which an indemnification claim can be made and the amount of the claim. In addition, the Company has entered into indemnification agreements with its officers and directors.\nIt is not possible to determine the maximum potential amount of the Company's exposure under these indemnification agreements due to the limited history of prior indemnification claims and the unique facts and circumstances involved in each particular agreement. Historically, payments made by the Company under these agreements have not had a material impact on the Company's operating results, financial position or cash flows. Under some of these agreements, however, the Company's potential indemnification liability might not have a contractual limit.\nOperating Leases\nThe Company's lease obligations consist of the Company's principal facility and various leased facilities under operating lease agreements. See Note 5. Leases, for more information on the Company's leases and the future minimum lease payments.\nPurchase Obligation\nThe Company's purchase obligations include contracts with third-party customer support vendors and third-party network service providers. These contracts include minimum monthly commitments and the requirements to maintain the service level for several months. The total contractual minimum commitments were approximately $18.6 million at March 31, 2021.\nLegal Proceedings\nThe Company may be involved in various claims, lawsuits, investigations and other legal proceedings, including intellectual property, commercial, regulatory compliance, securities and employment matters that arise in the normal course of business. The Company determines whether an estimated loss from a contingency should be accrued by assessing whether a loss is deemed probable and can be reasonably estimated. The Company regularly evaluates current information to determine whether any accruals should be adjusted and whether new accruals are required. Actual claims could settle or be adjudicated against the Company in the future for materially different amounts than the Company has accrued due to the inherently unpredictable nature of litigation. Legal costs are expensed as incurred.\nThe Company believes it has recorded adequate provisions for any such lawsuits and claims and proceedings as of March 31, 2021. The Company believes that damage amounts claimed in these matters are not meaningful indicators of potential liability. Some of the matters pending against the Company involve potential compensatory, punitive or treble damage claims or sanctions, that, if granted, could require the Company to pay damages or make other expenditures in amounts that could have a material adverse effect on its Consolidated Financial Statements. Given the inherent uncertainties of litigation, the ultimate outcome of the ongoing matters described herein cannot be predicted, and the Company believes it has valid defenses with respect to the legal matters pending against it. Nevertheless, the Consolidated Financial Statements could be materially adversely affected in a particular period by the resolution of one or more of these contingencies.\nWage and Hour Litigation. On September 21, 2020, the Company received a copy of a letter filed by a former employee, Plaintiff Denise Rivas, with the California Labor and Workforce Development Agency (“LWDA”) providing notice of the Plaintiff’s intent to bring a Private Attorney General Act (“PAGA”) claim, on behalf of the Company’s non-exempt employees based in California, for alleged California wage and hour practices violations. On September 25, 2020, the Plaintiff filed a separate class action complaint (“Class Complaint”) in Santa Clara County Superior Court against the Company in which she alleges 10 causes of action, on behalf of herself and all of the Company’s non-exempt employees based in California for the last four years, related to violations of California state wage and hour practices and the federal Fair Credit Reporting Act. The Class Complaint was served on the Company on September 29, 2020. On October 28, 2020, the Company filed a general denial of all claims and asserted various affirmative defenses. On October 29, 2020, the Company removed the matter to Federal Court. On December 1, 2020, Plaintiff filed a companion PAGA lawsuit complaint (“PAGA Complaint”) in Santa Clara County Superior Court against the Company, in which she alleges 6 violations of California state wage and hour practices for all of the Company's current and former non-exempt employees based in California from September 16, 2019 to the present. The PAGA Complaint was served on the Company on December 11, 2020. On January 26, 2021, the Company filed a general denial of all claims and asserted various affirmative defenses to the PAGA Complaint. Both actions are scheduled for a joint mediation in September 2021, and discovery is stayed in both actions pending completion of the mediation.\nState and Local Taxes and Surcharges\nFrom time to time, the Company has received inquiries from a number of state and local taxing agencies with respect to the remittance of sales, use, telecommunications, excise, and income taxes. Several jurisdictions currently are conducting tax audits of the Company's records. The Company collects or has accrued for taxes that it believes are required to be remitted. The amounts that have been remitted have historically been within the accruals established by the Company. The Company adjusts its accrual when facts relating to specific exposures warrant such adjustment. During the second quarter of fiscal 2019, the Company conducted a periodic review of the taxability of its services and determined that certain services may be subject to sales, use, telecommunications or other similar indirect taxes in certain jurisdictions. Accordingly, the Company recorded contingent indirect tax liabilities. As of March 31, 2021 and 2020, the Company had accrued contingent indirect tax liabilities of $3.1 million and $4.5 million, respectively.\n7. CONVERTIBLE SENIOR NOTES AND CAPPED CALL\nConvertible Senior Notes\nIn February 2019, the Company issued $287.5 million aggregate principal amount of 0.50% convertible senior notes (the \"Initial Notes\") due 2024 in a private placement, including the exercise in full of the initial purchasers' option to purchase additional notes. The total net proceeds from the debt offering, after deducting initial purchase discounts, debt issuance costs, and costs of the capped call transactions described below, were approximately $245.8 million.\nIn November 2019, the Company issued an additional $75 million aggregate principal amount of 0.50% convertible senior notes (the \"Additional Notes\" and together with the Initial Notes, the \"Notes\") due 2024 in a registered offering under the same indenture as the Initial Notes. The total net proceeds from the Additional Notes, after deducting initial purchase discounts, debt issuance costs and costs of the capped call transactions described below, were approximately $64.6 million. The Additional Notes constitute a further issuance of, and form a single series with, the Initial Notes. Immediately after giving effect to the issuance of the Additional Notes, the Company had $362.5 million aggregate principal amount of convertible senior notes.\nThe Notes are senior unsecured obligations of the Company and interest is payable semiannually in arrears on February 1 and August 1 of each year, beginning on August 1, 2019. The Notes will mature on February 1, 2024, unless earlier repurchased, redeemed, or converted.\nEach $1,000 principal amount of the Notes is initially convertible into 38.9484 shares of the Company’s common stock, par value $0.001, which is equivalent to an initial conversion price of approximately $25.68 per share. The conversion rate is subject to adjustment upon the occurrence of certain specified events but will not be adjusted for any accrued and unpaid interest. In addition, upon the occurrence of certain corporate events that occur prior to the maturity date or following the Company's issuance of a notice of redemption, in each case as described in the Indenture, the Company will, in certain circumstances, increase the conversion rate for a holder that elects to convert its Notes in connection with such a corporate event or during the relevant redemption period.\nPrior to the close of business on the business day immediately preceding October 1, 2023, the Notes will be convertible only under the following circumstances:\n1.At any time during any calendar quarter commencing after the fiscal quarter ending on June 30, 2019 (and only during such calendar quarter), if the last reported sale price of the Common Stock for at least 20 trading days (whether or not consecutive) during the period of 30 consecutive trading days ending on the last trading day of the immediately preceding calendar quarter is greater than or equal to 130% of the conversion price on each applicable trading day;\n2.During the five business day period immediately after any ten consecutive trading day period (the measurement period), if the trading price per $1,000 principal amount of the Notes for each trading day of the measurement period was less than 98% of the product of the last reported sale price of the common stock on each such trading day and the conversion rate on each such trading day;\n3.If the Company calls any or all of the Notes for redemption, at any time prior to the close of business on the scheduled trading day immediately preceding the redemption date; or\n4.Upon the occurrence of specified corporate events (as set forth in the indenture governing the Notes).\nOn or after October 1, 2023, until the close of business on the second scheduled trading day immediately preceding the maturity date, holders may convert all or any portion of their Notes, regardless of the foregoing circumstances. Upon conversion, the Company will satisfy its conversion obligation by paying or delivering, as the case may be, cash, shares of common stock, or a combination of cash and shares of common stock, at the Company's election. The Company’s current intent is to settle the principal amount of the Notes in cash upon conversion. During the year ended March 31, 2021, the conditions allowing holders of the Notes to convert were not met.\nThe Company may not redeem the Notes prior to February 4, 2022. On or after February 4, 2022, the Company may redeem for cash all or part of the Notes, at the redemption price equal to 100% of the principal amount thereof, plus accrued and unpaid interest, if the last reported sale price of the common stock has been at least 130% of the conversion price then in effect for at least 20 trading days (whether or not consecutive) during any 30 consecutive trading day period (including the last trading day of such period) ending on, and including, the trading day immediately preceding the date on which the Company provides a redemption notice. If a fundamental change (as defined in the indenture governing the notes) occurs at any time, holders of Notes may require the Company to repurchase for cash all or any portion of their Notes at a repurchase price equal to 100% of the principal amount of the Notes to be repurchased, plus accrued and unpaid interest to, but excluding, the fundamental change repurchase date.\nThe Notes are senior unsecured obligations and will rank senior in right of payment to any of the Company’s indebtedness that is expressly subordinated in right of payment to the Notes; equal in right of payment with the Company’s existing and future liabilities that are not so subordinated; effectively junior in right of payment to any of the Company’s secured indebtedness to the extent of the value of the assets securing such indebtedness; and structurally junior to all indebtedness and other liabilities (including trade payables) of current or future subsidiaries of the Company.\nUpon issuance, the Company separated the Notes into liability and equity components. The carrying amount of the liability component was calculated by measuring the fair value of similar debt instruments, which do not have an associated convertible feature. The carrying amounts of the equity components representing the conversion option for the Initial Notes and the Additional Notes were $64.9 million and $12.4 million, respectively, and were determined by deducting the fair value of the liability component from the par value of the Notes. The equity components are not remeasured as long as they continues to meet the condition for equity classification. The excess of the principal amounts of the liability components over the carrying amounts (“debt discount”) in connection with the Initial Notes and Additional Notes are amortized to interest expense at the effective interest rates of 6.5% and 5.3%, respectively, over the terms of the Notes.\nThe Company allocated the total issuance cost incurred to the liability and equity components of the Notes based on their relative value. Issuance costs attributable to the liability component of $0.6 million for each of the Initial Notes and Additional Notes were recorded as additional reduction to the liability portion of the Notes and are being amortized to interest expense over the terms of the Notes. Issuance costs attributable to the equity component were netted with the equity component in stockholders’ equity.\nThe following table presents the net carrying amount and fair value of the liability component of the Notes:\nMarch 31, 2021 March 31, 2020\nPrincipal $ 362,500 $ 362,500\nUnamortized debt discount (53,323) (69,987)\nUnamortized issuance costs (742) (976)\nNet carrying amount $ 308,435 $ 291,537\nUnamortized debt discount and issuance costs will be amortized over the remaining life of the Notes, which is approximately 34 months.\nInterest expense recognized related to the Notes was as follows:\nFor the years ended March 31,\n2021 2020\nContractual interest expense $ 1,813 $ 1,572\nAmortization of debt discount 16,664 13,901\nAmortization of issuance costs 234 145\nTotal interest expense $ 18,711 $ 15,618\nCapped Call\nIn connection with the pricing of the Notes, the Company entered into privately negotiated capped call transactions (\"Capped Calls\") with certain counterparties. The Capped Calls each have an initial strike price of approximately $25.68 per share, subject to certain adjustments, which corresponds to the initial conversion price of the Notes. The Capped Calls have initial cap prices of $39.50 per share, subject to certain adjustments. The Capped Calls are expected to partially offset the potential dilution to the Company’s Common Stock upon any conversion of the Notes, with such offset subject to a cap based on the cap price. The Capped Calls cover, subject to anti-dilution adjustments, approximately 14.1 million shares of the Company’s Common Stock. The Capped Calls are subject to adjustment upon the occurrence of specified extraordinary events affecting the Company, including merger events, tender offers, and announcement events. In addition, the Capped Calls are subject to certain specified additional disruption events that may give rise to a termination of the Capped Calls, including nationalization, insolvency or delisting, changes in law, failures to deliver, insolvency filings, and hedging disruptions. For accounting purposes, the Capped Calls are separate transactions, and not part of the terms of the Notes. As these transactions meet certain accounting criteria, the Capped Calls are recorded in stockholders' equity and are not accounted for as derivatives. The costs of $33.7 million incurred to purchase the Capped Calls in connection with the Initial Notes and $9.3 million in connection with the Additional Notes were recorded as a reduction to additional paid-in capital and will not be remeasured.\nThe net impact to the Company’s stockholders’ equity, included in additional paid-in capital, relating to the issuance of the Initial and Additional Notes was as follows:\nAdditional Notes Initial Notes\nConversion option $ 12,810 $ 66,700\nPayments for capped call transactions (9,288) (33,724)\nIssuance costs (436) (1,848)\nTotal $ 3,086 $ 31,128\n8. STOCK-BASED COMPENSATION AND STOCKHOLDERS' EQUITY\n2006 Stock Plan\nIn May 2006, the Company's board of directors approved the 2006 Stock Plan (\"2006 Plan\"). The Company's stockholders subsequently adopted the 2006 Plan in September 2006, which became effective in October 2006. The Company reserved 7.0 million shares of the Company's common stock for issuance under this plan. The 2006 Plan provides for granting incentive stock options to employees and non-statutory stock options to employees, directors or consultants. The stock option price of incentive stock options granted may not be less than the fair market value on the effective date of the grant. Other types of options and awards under the 2006 Plan may be granted at any price approved by the administrator, which generally will be the compensation committee of the board of directors. Options generally vest over four years and expire ten years after grant. In 2009, the 2006 Plan was amended to provide for the granting of stock purchase rights. The 2006 Plan expired in May 2016. As of March 31, 2021, there were no shares available for future grants under the 2006 Plan.\n2012 Equity Incentive Plan\nIn June 2012, the Company's board of directors approved the 2012 Equity Incentive Plan (\"2012 Plan\"). The Company's stockholders subsequently adopted the 2012 Plan in July 2012, which became effective in August 2012. The Company reserved 4.1 million shares of the Company's common stock for issuance under this plan. In August 2014, 2016, 2018 and 2019, the 2012 Plan was amended to allow for an additional 6.8 million shares, 4.5 million shares, 16.3 million shares, and 12.0 million shares reserved for issuance, respectively. The 2012 Plan provides for granting incentive stock options to employees and non-statutory stock options to employees, directors or consultants, and granting of stock appreciation rights, restricted stock, restricted stock units and performance units, qualified performance-based awards, and stock grants. The stock option price of incentive stock options granted may not be less than the fair market value on the effective date of the grant. Other types of options and awards under the 2012 Plan may be granted at any price approved by the administrator, which generally will be the compensation committee of the board of directors. Options, restricted stock, and restricted stock units generally vest over three or four years and expire ten years after grant. The 2012 Plan expires in June 2029. As of March 31, 2021, 12.9 million shares remained available under the 2012 Plan.\n2013 New Employee Inducement Incentive Plan\nIn September 2013, the Company's board of directors approved the 2013 New Employee Inducement Incentive Plan (\"2013 Plan\"). The Company reserved 1.0 million shares of the Company's common stock for issuance under this plan. In November 2014, the 2013 Plan was amended to allow for an additional 1.2 million shares reserved for issuance. In July 2015, the 2013 Plan was amended to allow for an additional 1.2 million shares reserved for issuance. In connection with its approval of the August 2016 amendments to the 2012 Plan, the Board of Directors has approved the suspension of future grants under the 2013 Plan, which became effective immediately upon stockholder approval of the proposed 2012 Plan amendments in August 2016. In addition, the 2013 Plan was amended to reduce the number of shares reserved for issuance under the 2013 Plan to the number of shares that are then subject to outstanding awards under the 2013 Plan, leaving no shares available for future grant. The 2013 Plan provided for granting non-statutory stock options, stock appreciation rights, restricted stock, restricted stock and performance units, and stock grants solely to newly hired employees as a material inducement to accepting employment with the Company. Options were granted at market value on the grant date under the 2013 Plan, unless determined otherwise at the time of grant by the administrator, which generally will be the compensation committee of the board of directors. Grants generally vest over four years and expire ten years after grant.\n2017 New Employee Inducement Incentive Plan\nIn October 2017, the Company's board of directors approved the 2017 New Employee Inducement Incentive Plan (\"2017 Plan\"). The Company reserved 1.0 million shares of the Company's common stock for issuance under this plan. In January 2018, the 2017 Plan was amended to allow for an additional 1.5 million shares to be reserved for issuance. In December 2020, the 2017 Plan was further amended to allow for an additional 1.4 million shares to be reserved. The 2017 Plan provides for granting non-statutory stock options, stock appreciation rights, restricted stock, and performance units and stock grants solely to newly hired employees as a material inducement to accepting employment with the Company. Options are granted at market value on the grant date under the 2017 Plan, unless determined otherwise at the time of grant by the administrator, which generally will be the compensation committee of the board of directors. Grants generally vest over three years and expire ten years after grant. As of March 31, 2021, 1.1 million shares remained available under the 2017 plan.\nStock-Based Compensation\nThe following table presents stock-based compensation expense:\nYears Ended March 31,\n2021 2020 2019\nCost of service revenue $ 8,811 $ 5,330 $ 3,752\nCost of other revenue 4,384 3,051 1,775\nResearch and development 31,641 19,712 12,313\nSales and marketing 33,869 20,205 11,951\nGeneral and administrative 28,933 22,580 14,717\nTotal $ 107,638 $ 70,878 $ 44,508\nStock Options\nThe following table presents the stock option activity during the years ended March 31, 2021, 2020, and 2019 (shares in thousands):\nNumber of\nShares Weighted Average Exercise Price Per Share\nOutstanding at March 31, 2018 3,998 $ 8.93\nGranted 237 21.65\nExercised (760) 7.70\nCanceled/Forfeited (361) 15.41\nOutstanding at March 31, 2019 3,114 9.45\nExercised (785) 8.77\nCanceled/Forfeited (55) 17.01\nOutstanding at March 31, 2020 2,274 9.50\nExercised (426) 8.67\nCanceled/Forfeited (35) 22.05\nOutstanding at March 31, 2021 1,813 9.46\nVested and expected to vest March 31, 2021 1,809 9.43\nExercisable at March 31, 2021 1,751 $ 9.09\nThe total intrinsic value of options exercised in the years ended March 31, 2021, 2020, and 2019, was $8.0 million, $10.1 million and $10.0 million, respectively.\nAs of March 31, 2021, there was $0.4 million of total unrecognized compensation cost related to stock options, which is expected to be recognized over a weighted average period of approximately 1.1 years.\nThe Company did not grant any stock options during fiscal years 2021 or 2020.\nThe fair value of each of the Company's option grants has been estimated on the date of grant using the Black-Scholes pricing model with the following assumptions:\nYears Ended March 31,\n2021 2020 2019\nExpected volatility -% -% 41%\nRisk-free interest rate - - 2.5% to 3.0%\nWeighted average expected term (in years) 0 0 4.5 years\nWeighted average fair value of options granted $- $- $8.19\nStock Purchase Rights\nThe following table presents the stock purchase rights' activity during the years ended March 31, 2021, 2020, and 2019 (shares in thousands):\nNumber of\nShares Weighted\nAverage Grant\nDate Fair Value Weighted Average\nRemaining Contractual\nTerm (in Years)\nBalance at March 31, 2018 4,975 $ 8.10 1.09\nVested and released (4,625) 7.88\nForfeited (350) 7.88\nBalance at March 31, 2019, 2020, and 2021 - $ -\nThere were no activities related to stock purchase rights during the years ended March 31, 2021 and 2020.\nAs of March 31, 2021, there was no unrecognized compensation cost related to stock purchase rights.\nRestricted Stock Units\nThe following table presents the RSU activity during the years ended March 31, 2021, 2020, and 2019 (shares in thousands):\nNumber of\nShares Weighted\nAverage Grant\nDate Fair Value Weighted Average\nRemaining Contractual\nTerm (in Years)\nBalance at March 31, 2018 5,006 $ 13.05\nGranted 5,061 19.80\nVested and released (1,899) 12.69\nForfeited (1,332) 16.62\nBalance at March 31, 2019 6,836 17.45 2.38\nGranted 5,592 20.50\nVested and released (2,771) 16.87\nForfeited (1,545) 19.13\nBalance at March 31, 2020 8,112 19.43 1.96\nGranted 6,256 18.73\nVested and released (4,579) 18.90\nForfeited (1,143) 18.96\nBalance at March 31, 2021 8,646 $ 19.27 1.85\nAs of March 31, 2021, there was $118.9 million of total unrecognized compensation cost related to RSUs.\nDuring fiscal 2021, the Company offered its employees an opportunity to receive a portion of their future cash salary for the year in shares of the Company's common stock, which resulted in the release of approximately 203,000 shares during the year.\nPerformance Stock Units\nPSUs are issued to a group of executives with vesting that is contingent on both market performance and continued service. The PSUs generally vest over periods ranging from one to three years based on Total Shareholder Return (\"TSR\"), as measured relative to specified market indices during the period from grant date through vesting date. A 2x multiplier will be applied for each percentage point of positive or negative relative TSR, such that the number of shares of common stock earned will increase or decrease by 2% of the target number of shares, subject to a maximum of 200% of the target number of shares. In the event that the Company’s relative TSR performance is less than negative 30%, relative to the specified index, no shares will be earned for the applicable performance period. All PSU awards vest 100% at the end of the respective performance periods.\nThe following table presents the PSU activity during the years ended March 31, 2021, 2020, and 2019 (shares in thousands):\nNumber of\nShares Weighted\nAverage Grant\nDate Fair Value Weighted Average\nRemaining Contractual\nTerm (in Years)\nBalance at March 31, 2018 924 $ 15.95\nGranted 474 19.52\nGranted for performance achievement1\n192 19.52\nVested and released (506) 13.47\nForfeited (100) 19.94\nBalance at March 31, 2019 984 19.23 1.39\nGranted 293 21.40\nGranted for performance achievement1\n547 21.40\nVested and released (673) 17.61\nForfeited (72) 17.52\nBalance at March 31, 2020 1,079 22.05 1.40\nGranted 1,013 29.00\nGranted for performance achievement1\n43 29.00\nVested and released (350) 19.05\nForfeited (209) 22.38\nBalance at March 31, 2021 1,576 $ 27.33 1.24\n1 Represents additional PSUs awarded as a result of the achievement of performance goals above the performance targets established at grant.\nAs of March 31, 2021, there was $24.4 million of total unrecognized compensation cost related to PSUs.\nThe PSUs granted during fiscal 2021 were valued for compensation expense purposes at $29.07 per weighted average share as determined by Monte Carlo simulations using volatility factors ranging from 55.66% to 60.68% and risk-free rates ranging from 0.15% to 0.18%.\n1996 Employee Stock Purchase Plan\nThe Company's Amended & Restated 1996 Stock Purchase Plan (\"Employee Stock Purchase Plan\") was adopted in June 1996 and became effective upon the closing of the Company's initial public offering in July 1997. In May 2006, the Company's board of directors approved a ten-year extension of the Employee Stock Purchase Plan. Stockholders approved a ten-year extension of the Employee Stock Purchase Plan at the 2006 Annual Meeting of Stockholders held September 18, 2006. The Board of Directors approved a second ten-year extension in May 2017. Stockholders approved the second ten-year extension in August 2017. As a result of these extensions, the Employee Stock Purchase Plan is effective until August 2027. During fiscal 2021, 2020 and 2019, approximately 0.7 million, 0.6 million and 0.5 million shares, respectively, were issued under the Employee Stock Purchase Plan.\nThe Employee Stock Purchase Plan permits eligible employees to purchase common stock through payroll deductions at a price equal to 85% of the fair market value of the common stock at the beginning of each one-year offering period or the end of each six month purchase period, whichever is lower. When the Employee Stock Purchase Plan was reinstated in fiscal 2005, the offering period was reduced from two years to one year. Commencing with the purchase period beginning in August 2020, the contribution amount may not exceed 20% of an employee's base compensation, including commissions and standard incentive cash bonuses, but not including non-standard bonuses and overtime wages. Prior to the August 2020 purchase period, the contribution amount was limited to 10% of an employee's base compensation, including commissions, but not including bonuses and overtime wages. In the event of a merger of the Company with or into another corporation or the sale of all or substantially all of the assets of the Company, the Employee Stock Purchase Plan provides that a new exercise date will be set for each purchase right under the plan which exercise date will occur before the date of the merger or asset sale.\nAs of March 31, 2021, there was approximately $2.5 million of unrecognized compensation cost related to employee stock purchases. This cost is expected to be recognized over a weighted average period of 0.4 years.\nThe estimated fair value of stock purchase rights granted under the Employee Stock Purchase Plan was estimated using the Black-Scholes pricing model with the following weighted-average assumptions:\nYears Ended March 31,\n2021 2020 2019\nExpected volatility 84% 32% 41%\nExpected dividend yield - - -\nRisk-free interest rate 0.11% 1.79% 2.43%\nWeighted average expected term (in years) 0.7 years 0.7 years 0.8 years\nWeighted average fair value of rights granted $8.00 $5.66 $5.74\nStock Repurchases\nIn May 2017, the Company's board of directors authorized the Company to purchase $25.0 million of its common stock from time to time under the 2017 Repurchase Plan (\"Repurchase Plan\"). There were no repurchases under the Repurchase Plan in fiscal 2021. The Repurchase Plan expires when the maximum purchase amount is reached, or upon the earlier revocation or termination by the board of directors. The remaining amount available under the Repurchase Plan at March 31, 2021 was approximately $7.1 million.\n9. INCOME TAXES\nFor the years ended March 31, 2021, 2020 and 2019, the Company recorded a provision for income taxes of approximately $0.8 million, $0.8 million, and $0.6 million, respectively. The components of the consolidated provision for income taxes for fiscal 2021, 2020 and 2019 consisted of the following:\nMarch 31,\nCurrent: 2021 2020 2019\nFederal $ - $ - $ -\nState 31 185 291\nForeign 812 647 278\nTotal current tax provision\n843 832 569\nDeferred\nFederal - - -\nState - - -\nForeign - - -\nTotal deferred tax provision\n- - -\nIncome tax provision\n$ 843 $ 832 $ 569\nThe Company's income (loss) from continuing operations before income taxes included $15.3 million, $9.0 million, and $0.2 million of foreign subsidiary income for the years ended March 31, 2021, 2020 and 2019, respectively. The Company is permanently reinvesting the earnings of its profitable foreign subsidiaries. The Company intends to reinvest these profits in expansion of overseas operations. If the Company were to remit these earnings, the tax impact would be immaterial.\nDeferred tax assets and (liabilities) were comprised of the following:\nMarch 31,\n2021 2020\nDeferred tax assets\nNet operating loss carryforwards $ 145,655 $ 109,734\nResearch and development and other credit carryforwards 22,794 19,413\nStock-based compensation 12,669 10,343\nReserves and allowances 6,198 3,974\nLease liability 22,424 24,492\nFixed assets and intangibles 6,091 5,314\nGross deferred tax assets 215,831 173,270\nValuation allowance (160,450) (115,435)\nTotal deferred tax assets\n$ 55,381 $ 57,835\nDeferred tax liabilities\nDeferred sales commissions (27,166) (21,608)\nConvertible debt (12,695) (16,626)\nLease asset (15,520) (19,601)\nNet deferred taxes $ - $ -\nThe Company assesses the realizability of deferred tax assets based on the available evidence, including a history of taxable income and estimates of future taxable income. In assessing the realizability of deferred tax assets, the Company considers whether it is more likely than not that all or some portion of deferred tax assets will not be realized. For the year ended March 31, 2021, the Company continues to maintain a full valuation allowance against its deferred tax assets as it considered the cumulative losses in recent periods to be substantial negative evidence. At March 31, 2021, management determined that a valuation allowance of approximately $160.5 million was needed compared with approximately $115.4 million as of March 31, 2020.\nAt March 31, 2021, the Company had federal net operating loss carryforwards related to fiscal 2019, 2020 and 2021 of approximately $433.0 million, which carryforward indefinitely, and had carry-forwards related to prior years of $137.8 million, which begin to expire in 2022. As of March 31, 2021, the Company has state net operating loss carry-forwards of $296.6 million, which expire at various dates between 2029 and 2041. In addition, at March 31, 2021, the Company had research and development credit carryforwards for federal and California tax reporting purposes of approximately $15.3 million and $16.9 million, respectively. The federal income tax credit carryforwards will expire at various dates between 2022 and 2041, while the California income tax credits will carry forward indefinitely, but are subject to an annual cap of $5 million for tax years beginning on or after January 1, 2020 and before January 1, 2023. A reconciliation of the Company's provision (benefit) for income taxes to the amounts computed using the statutory U.S. federal income tax rate is as follows:\nYears Ended March 31,\n2021 2020 2019\nTax benefit at statutory rate $ (34,492) $ (36,163) $ (18,441)\nState income taxes before valuation allowance, net of federal effect\n(7,445) (7,680) (3,612)\nForeign tax rate differential (2,206) (1,422) 71\nResearch and development credits (4,078) (3,892) (3,744)\nChange in valuation allowance 47,225 51,741 30,558\nCompensation/option differences (5,045) (6,584) (7,277)\nNon-deductible compensation 6,194 3,017 1,200\nOther 690 1,815 1,814\nTotal income tax provision (benefit)\n$ 843 $ 832 $ 569\nFor the years ended March 31, 2021, 2020 and 2019, the statutory federal rate of 21% was used.\nThe Company recognizes the tax benefit from uncertain tax positions if it is more likely than not that the tax positions will be sustained on examination by the tax authorities, based on the technical merits of the position. The tax benefit is measured based on the largest benefit that has a greater than 50% likelihood of being realized upon ultimate settlement. A reconciliation of the beginning and ending amount of unrecognized tax benefits is as follows:\nUnrecognized Tax Benefits\n2021 2020 2019\nBalance at beginning of year $ 6,115 $ 5,033 $ 3,980\nGross increases - tax position in prior period - - 17\nGross increases - tax position related to the current year 1,140 1,082 1,036\nLapse of statute of limitations (202) - -\nBalance at end of year $ 7,053 $ 6,115 $ 5,033\nAt March 31, 2021, the Company had unrecognized tax benefits of $7.1 million, all of which, if recognized, would favorably affect the company's effective tax rate. The Company does not expect its unrecognized tax benefits to change significantly over the next 12 months.\nThe Company's policy for recording interest and penalties associated with tax examinations is to record such items as a component of operating expense income before taxes. During the years ended March 31, 2021, 2020 and 2019, the Company did not recognize any interest or penalties related to unrecognized tax benefits.\nUtilization of the Company's net operating loss and tax credit carryforwards can become subject to a substantial annual limitation due to the ownership change limitations provided by Section 382 of the Internal Revenue Code and similar state provisions. Such an annual limitation could result in the expiration or elimination of the net operating loss and tax credit carryforwards before utilization. The Company has performed an analysis of its changes in ownership under Section 382 of the Internal Revenue Code. The Company currently believes that the Section 382 limitation will not limit utilization of the carryforwards prior to their expiration, with the exception of certain acquired loss and tax credit carryforwards.\nThe Company files U.S. federal and state income tax returns in jurisdictions with varying statutes of limitations. Due to the Company’s net operating loss and tax credit carryforwards, the fiscal years 2002 and forward generally remain subject to examination by federal and most state tax authorities.\n10. NET LOSS PER SHARE\nThe following is a reconciliation of the weighted average number of common shares outstanding used in calculating basic and diluted net loss per share (dollars in thousands, except per share data):\nFor the years ended March 31,\n2021 2020 2019\nNet loss $ (165,585) $ (172,368) $ (88,739)\nWeighted average common shares outstanding - basic and diluted 105,700 99,999 94,533\nNet loss per share - basic and diluted $ (1.57) $ (1.72) $ (0.94)\nThe following potentially dilutive common shares were excluded from the calculation of diluted earnings per share because their inclusion would have been anti-dilutive (shares in thousands):\nFor the years ended March 31,\n2021 2020 2019\nStock options 1,813 2,274 3,114\nRestricted stock units 10,221 9,191 7,820\nPotential shares attributable to the ESPP 555 582 473\nTotal anti-dilutive shares 12,589 12,047 11,407\n11. GEOGRAPHICAL INFORMATION\nThe following tables set forth the geographic information for each period:\nRevenue for the Years Ended March 31,\n2021 2020 2019\nUnited States $ 390,758 $ 350,368 $ 304,378\nInternational 141,586 95,869 48,208\nTotal revenue $ 532,344 $ 446,237 $ 352,586\nProperty and Equipment as of March 31,\n2021 2020\nUnited States $ 87,945 $ 87,673\nInternational 5,131 6,709\nTotal property and equipment, net $ 93,076 $ 94,382\n12. ACQUISITIONS\nMarianaIQ\nOn April 12, 2018, the Company entered into an Asset Purchase Agreement with MarianaIQ Inc. (\"MarianaIQ\") for the purchase of certain assets of MarianaIQ to strengthen the artificial intelligence and machine learning capabilities of the Company's X Series product suite.\nThe Company recorded the acquired developed technology at fair value as an identifiable intangible asset with an estimated useful life of two years. The fair value of the technology was based on estimates and assumptions made by management using a cost approach method. The intangible asset was amortized on a straight-line basis over two years.\nThe excess of the consideration transferred over the fair value of the asset acquired was recorded as goodwill. The amount of goodwill recognized was primarily attributable to the expected contributions of the acquired assets to the overall corporate strategy in addition to the acquired workforce.\nMarianaIQ did not contribute materially to revenue or net loss for the period of acquisition to March 31, 2021. The goodwill recognized upon acquisition was deductible for income tax purposes.\nJitsi\nOn October 29, 2018, the Company entered into an Asset Purchase Agreement with Atlassian Corporation PLC (\"Atlassian\"), through which the Company purchased certain assets from Atlassian relating to Jitsi open source video communications technology (\"Jitsi\"). The Company intends to integrate Jitsi's video collaboration capabilities into its technology platform to further enhance the Company's video and X Series platform offerings.\nThe Company recorded the acquired developed technology at fair value as an identifiable intangible asset with an estimated useful life of two years. The fair value of the technology was based on estimates and assumptions made by management using a cost approach method. The intangible asset was amortized on a straight-line basis over two years.\nThe excess of the consideration transferred over the fair value of the asset acquired was recorded as goodwill. The amount of goodwill recognized was primarily attributable to the expected contributions of the entity to the overall corporate strategy in addition to the acquired workforce.\nJitsi did not contribute materially to revenue or net loss for the period of acquisition to March 31, 2021. Goodwill recognized upon acquisition is deductible for income tax purposes.\nWavecell\nOn July 17, 2019, the Company entered into a Share Purchase Agreement (the “Share Purchase Agreement”) with Wavecell Pte. Ltd., a corporation incorporated under the laws of the Republic of Singapore (“Wavecell”), the equity holders of Wavecell (collectively, the “Sellers”), and Qualgro Partners Pte. Ltd., in its capacity as the representative of the equity holders of Wavecell. Pursuant to the Share Purchase Agreement, the Company acquired all of the outstanding shares and other equity interests of Wavecell (the “Transaction”). This Transaction extends 8x8’s technology advantage as a fully-owned, cloud technology platform with UCaaS, CCaaS, VCaaS, and CPaaS solutions able to natively offer pre-packaged communications, contact center and video solutions, and open APIs to embed these and other communications into an organization’s core business processes.\nThe total fair value of the purchase consideration of $117.1 million was comprised of $72.8 million in cash and $44.3 million in shares of common stock of the Company. Additionally, in connection with the Transaction, the Company issued $13.2 million in time-based restricted stock awards and $6.6 million in performance-based restricted stock awards, all of which vest over three years from the Transaction. As of March 31, 2021, the total unrecognized compensation cost related to these awards was approximately $8.5 million, which is expected to be recognized over the next 1.3 years.\nThe major classes of assets and liabilities to which the Company allocated the fair value of purchase consideration were as follows:\nJuly 17, 2019\nCash $ 4,473\nAccounts receivable 9,438\nIntangible assets 21,010\nOther assets 787\nGoodwill 91,060\nAccounts payable (9,548)\nDeferred revenue (90)\nTotal consideration $ 117,130\nThe acquisition was accounted for as a business combination under the acquisition method and, accordingly, the total purchase price was allocated to the tangible and intangible assets acquired and the liabilities assumed based on their estimated fair value on the acquisition date. The goodwill recognized was primarily attributed to increased synergies that are expected to be achieved from the integration of Wavecell and is not expected to be deductible for income tax purposes.\nThe value of the acquired intangible assets acquired were as follows:\nFair Value Useful life (in Years)\nTrade and domain names $ 990 0.8\nDeveloped technology 13,830 7\nCustomer relationships 6,190 7\nTotal intangible assets $ 21,010\nThe Company incurred costs related to this acquisition of approximately $1.9 million. All acquisition related costs were expensed as incurred and have been recorded in general and administrative expenses in the accompanying consolidated statements of operations.\n13. UNAUDITED SELECTED CONSOLIDATED QUARTERLY FINANCIAL DATA\nThe following tables summarize selected consolidated quarterly financial data for the years ended March 31, 2021 and 2020, (dollars In thousands, except per share amounts):\nThree Months Ended\nMarch 31,\n2021 December 31,\n2020 September 30,\n2020 June 30,\nFiscal 2021\nTotal revenues $ 144,719 $ 136,685 129,133 $ 121,807\nGross profit 83,606 76,277 72,637 69,674\nLoss from operations (40,036) (35,255) (33,098) (37,760)\nNet loss (45,034) (40,225) (38,413) (41,913)\nNet loss per share:\nBasic and diluted $ (0.42) $ (0.38) $ (0.37) $ (0.40)\nThree Months Ended\nMarch 31,\n2020 December 31,\n2019 September 30,\n2019 June 30,\nFiscal 2020\nTotal revenues $ 121,478 $ 118,567 109,517 $ 96,675\nGross profit 63,857 62,348 59,820 58,984\nLoss from operations (46,154) (43,168) (37,944) (32,553)\nNet loss (50,100) (47,071) (40,932) (34,265)\nNet loss per share:\nBasic and diluted $ (0.49) $ (0.47) $ (0.42) $ (0.36)\n14. SUPPLEMENTAL FINANCIAL INFORMATION\nProperty and equipment consisted of the following:\nMarch 31,\n2021 2020\nComputer equipment $ 40,905 $ 38,105\nSoftware development costs 91,816 77,635\nSoftware licenses 7,798 1,569\nLeasehold improvements 28,714 31,706\nFurniture and fixtures 5,565 5,485\nConstruction in progress 10,651 13,852\nTotal property and equipment 185,449 168,352\nLess: accumulated depreciation and amortization (92,373) (73,970)\nTotal property and equipment, net $ 93,076 $ 94,382\nDepreciation and amortization expense was $39.0 million, $28.4 million, and $18.5 million for the years ended March 31, 2021, 2020 and 2019, respectively.\nOther current asset consisted of the following:\nMarch 31,\n2021 2020\nPrepaid expense $ 17,971 $ 14,489\nContract assets, current 12,840 10,425\nReceivable related to lease assignment - 6,853\nOther current assets 3,284 3,912\nTotal other current assets $ 34,095 $ 35,679\nOther current liabilities consisted of the following:\nMarch 31,\n2021 2020\nLiability related to lease assignment $ 869 $ 8,969\nAcquisition-related holdback cash and shares - 18,864\nAccrued liabilities 13,586 9,444\nTotal other current liabilities $ 14,455 $ 37,277",
    "item_9": "ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.",
    "item_9A": "ITEM 9A. CONTROLS AND PROCEDURES\nChanges in Internal Control Over Financial Reporting\nThere have not been any changes in the Company's internal control over financial reporting, as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934, as amended (the \"Exchange Act\") during the most recent fiscal quarter that have materially affected, or are reasonably likely to materially affect, the Company's internal control over financial reporting. We have not experienced any material impact to our internal controls over financial reporting despite the fact that most of our employees are working remotely due to the COVID-19 pandemic. We are continually monitoring and assessing the COVID-19 situation on our internal controls to minimize the impact on their design and operating effectiveness.\nConclusion Regarding the Effectiveness of Disclosure Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nOur management, with the participation of our Chief Executive Officer and Chief Financial Officer, has evaluated the effectiveness of our disclosure controls and procedures, as such term is defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act, as of March 31, 2021. Based on such evaluation, our Chief Executive Officer and Chief Financial Officer have concluded that, as of March 31, 2021, our disclosure controls and procedures were effective.\nManagement's Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rules 13a-15(f) or 15d-15(f) under the Exchange Act. Under the supervision and with the participation of our management, including our chief executive officer and chief financial officer, we conducted an assessment of the effectiveness of our internal control over financial reporting based on criteria established in the framework in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nBased on our assessment, management has concluded that its internal control over financial reporting was effective as of March 31, 2021.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risks that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nMoss Adams LLP, an independent registered public accounting firm, has audited and reported on the consolidated financial statements of 8x8, Inc. and on the effectiveness of our internal control over financial reporting. The report of Moss Adams LLP is contained in Item 8 of this Annual Report on Form 10-K.",
    "item_9B": "ITEM 9B. OTHER INFORMATION\nOn May 13, 2021, upon the recommendation of the Company’s management team, the 8x8, Inc.’s (the “Company”) Board of Directors (the “Board”) approved the establishment of a compensation program for the Company’s executive officers for the fiscal year ending March 31, 2022 (“Fiscal 2022”) whereby executive officers may elect to receive from 5% to 50% of each individual’s base salary compensation for a portion of Fiscal 2022 in shares of the Company’s common stock. Pursuant to the program, the Company’s executive officers would receive their elected percentage of base salary for the final nine (9) months of Fiscal 2022 in shares of Company’s common stock in equal portions on August 15, 2021, November 15, 2021, and February 15, 2022 valued at the lower of the first day of the prior quarter or the last trading day prior to grant. Our Chief Executive Officer has elected to receive 50% of his base salary and our other named executive officers have elected between 5-20% of their base salaries for Fiscal 2022.\nIn addition, for Fiscal 2022, our Board adopted an executive bonus plan (the “Plan”) that is administered by the Compensation Committee of the Board (the “Compensation Committee”) for our executive officers, except for our Chief Executive Officer, for whom our Board makes all compensation decisions. Under the Plan, each of our executive officers is eligible to receive bonus awards during the fiscal year tied to the Company’s performance in relation to financial targets and, in certain cases, the executive’s achievement of individual goals. Performance is measured and bonuses are payable on a semiannual basis for the first six months and the last six months of the fiscal year. Executive officers are eligible to earn bonus payments in amounts ranging from 0% to 200% of the executive officer’s semiannual target bonus amount (which is 50% of such executive officer’s full year target bonus amount). If the Company performs below a minimum threshold during either semiannual payout period, bonuses are not payable to executive officers for such period. For our Chief Executive Officer and Chief Financial Officer, the bonus target for each semiannual payout is based 100% on the Company’s performance in relation to one or more financial target(s). For all other executive officers, the bonus target for each semiannual payout will be based on a combination of Company performance in relation to financial target(s) and achievement of individual goals. For all executive officers in fiscal year ending March 31, 2022, the Company financial performance targets are a revenue-based target and non-GAAP pre-tax income target.\nFor Fiscal 2022, our named executive officers will receive 100% of their bonus payments, if any, in the form of immediately vested stock. Bonus payments in the form of stock will be made as soon as practicable following the measurement of the Company’s performance and individual performance during each semiannual payout, as described above, by our Compensation Committee or, in the case of our Chief Executive Officer, by our Board and valued at the lower of the Company’s stock price on the first day of the fiscal year or each semiannual bonus period payment date. The board of directors reserves the right to terminate the Plan at any time at its discretion.\nOn May 13, 2021 (the “Effective Date”), upon the recommendation of the Compensation Committee, the Board approved an amended and restated 2017 Executive Change-in-Control and Severance Policy (the “Policy”). The Policy supersedes and replaces the prior policy, previously adopted by our Board in October 2017 and amended effective January 31, 2019 (the “Prior Policy”), except for those named executive officers who are participants under the Prior Policy as of the Effective Date who will continue to receive the greater of the benefits offered under the Prior Policy or the Policy (the “Grandfathered Executives”). Under the Policy, each named executive officer is entitled to specific benefits upon the following events: a change-in-control; a constructive termination in connection with a change-in-control; and a constructive termination not in connection with a change-in-control. The three separate tiers under the Prior Policy were removed and replaced in the Policy with all Executives now receiving the same benefits (other than those Grandfathered Executives). The benefits provided to Executives for a constructive termination in connection with a change-in-control were amended to include 100% of target bonus. The severance benefits provided in the event of a constructive termination not in connection with a change-in control were amended to decrease the benefits provided to only COBRA benefits and decreased from twelve (12) months to six (6) months coverage post-termination. The cash severance was also decreased from 100% of Base Salary plus a pro-rated bonus to 50% of Base Salary and no pro-rated bonus. “Severance” as used in the column headings refers only to the constructive termination scenario, where a named executive officer is terminated without cause or resigns for good reason. The Policy does not provide for any “single trigger” change-in-control cash payments. The Policy provides for the following benefits payable to or realizable by the named executive officers:\nTier Change-in-Control Benefits Change-in-Control Severance Benefits Severance Benefits\nExecutive Stock Performance-Based Equity Awards: Performance condition satisfied for 100% of shares subject to a per-share target price no higher than Transaction Price; any service-based vesting applies thereafter\nTSR Performance-Based Equity Awards: Performance condition satisfied for that number of shares determined by relative appreciation of Company common stock through Change-of-Control date; any service-based vesting applies thereafter Cash: 100% of Base Salary + 100% of Target Bonus\nCOBRA, Group Benefits and Other Company Sponsored Benefits: 12 months after date of termination\nTime-Based Equity Awards: 100% acceleration (50% acceleration, if within 12 months of hire date)\nPerformance-Based Equity Awards: 100% acceleration for shares for which performance criteria deemed satisfied as Change- in-Control benefit\nCash: 50% of Base Salary\nCOBRA Benefits: 6 months after date of termination\nTime-Based Equity Awards: 0% acceleration\nPerformance-Based Equity Awards: 0% acceleration\nThe foregoing description of the Policy does not purport to be complete and is qualified in its entirety by reference to the full text of the Policy, a copy of which is attached hereto as Exhibit 10.4, and hereby incorporated by reference herein.\nPART III\nCertain information required by Part III is omitted from this Annual Report on Form 10-K. The Registrant will file its definitive Proxy Statement for its Annual Meeting of Stockholders pursuant to Regulation 14A of the Securities Exchange Act of 1934, as amended, not later than 120 days after the end of the fiscal year covered by this Annual Report, and certain information included in the 2021 Proxy Statement is incorporated herein by reference.",
    "item_10": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nInformation regarding our directors and corporate governance will be presented in our definitive proxy statement for our 2021 Annual Meeting of Stockholders to be held on or about August 10, 2021, which information is incorporated into this Annual Report by reference. However, certain information regarding current executive officers found under the heading \"Information About Our Executive Officers\" in Item 1 of Part I hereof is also incorporated by reference in response to this Item 10.\nWe have adopted a Code of Conduct and Ethics that applies to our principal executive officer, principal financial officer and all other employees at 8x8, Inc. This Code of Conduct and Ethics is posted in the corporate governance section of our website at http://investors.8x8.com. We intend to satisfy the disclosure requirement under Item 5.05 of Form 8-K regarding an amendment to, or waiver from, a provision of this Code of Conduct and Ethics by posting such information in the corporate governance section on our website at http://investors.8x8.com.",
    "item_11": "ITEM 11. EXECUTIVE COMPENSATION\nInformation relating to executive compensation will be presented in our definitive proxy statement for our 2021 Annual Meeting of Stockholders to be held on or about August 10, 2021, which information is incorporated into this Annual Report by reference.",
    "item_12": "ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nInformation relating to securities authorized for issuance under equity compensation plans and other information required to be provided in response to this item will be presented in our definitive proxy statement for our 2021 Annual Meeting of Stockholders to be held on or about August 10, 2021, which information is incorporated into this Annual Report by reference. In addition, descriptions of our equity compensation plans are set forth in Note 8, Stock-Based Compensation and Stockholders' Equity, in the Notes to Consolidated Financial Statements included in this Annual Report.",
    "item_13": "ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nInformation required to be provided in response to this item will be presented in our definitive proxy statement for our 2021 Annual Meeting of Stockholders to be held on or about August 10, 2021, which information is incorporated into this Annual Report by reference.",
    "item_14": "ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nInformation required to be provided in response to this item will be presented in our definitive proxy statement for our 2021 Annual Meeting of Stockholders to be held on or about August 10, 2021, which information is incorporated into this Annual Report by reference.\nPART IV",
    "item_15": "ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a)(1) Financial Statements. The information required by this item is included in Item 8.\nSCHEDULE II\nVALUATION AND QUALIFYING ACCOUNTS\n(Dollars in Thousands)\nDescription Balance at\nBeginning\nof Year Additions\nCharged to\nExpenses Deductions (a) Balance\nat End\nof Year\nTotal Allowance for Credit Losses:\nYear ended March 31, 2019: $ 904 $ 1,115 $ (1,155) $ 864\nYear ended March 31, 2020: $ 864 $ 3,067 $ (825) $ 3,106\nYear ended March 31, 2021 (b): $ 3,106 $ 7,374 $ (2,302) $ 8,178\n(a) The deductions related to allowance for credit losses represent financial assets which were written off.\n(b) In fiscal 2021, the Company adopted ASU 2016-13, Financial Instruments-Credit Losses; for the year ended March 31, 2021, Additions Charged to Expenses includes $2.8 million, which was the cumulative effect adjustment for the change in accounting principle to the opening balance of fiscal 2021 retained earnings.\n(a)(3) Exhibits. The following exhibits are included herein or incorporated herein by reference.\nIncorporated by Reference\nExhibit Number Exhibit Description Company Form Filing Date Exhibit Number Filed Herewith\n2.2 Share Purchase Agreement, dated as of July 17, 2019, by and among, 8x8, Inc., Wavecell Pte. Ltd., the Sellers named herein, and Qualgro Partners Pte. Ltd.+\n10-Q 7/31/2019 2.1\n3.1 Restated Certificate of Incorporation of Registrant, dated August 22, 2012\n10-K 5/28/2013 3.1\n3.2 Amended and Restated By-Laws of 8x8, Inc.\n8-K 7/28/2015 3.2\n4.1 Description of Capital Stock\nX\n4.2 Indenture dated as of February 19, 2019, between 8x8, Inc. and Wilmington Trust, National Association, as trustee (including form of Note)\n8-K 2/19/2019 4.1\n10.1 Form of Indemnification Agreement for Directors and Certain officers*\n10-Q 7/31/2015 10.3\n10.2 Form of Capped Call Confirmation\n8-K 2/19/2019 10.1\n10.3 Form of Capped Call Confirmation\n8-K 11/21/2019 10.1\n10.4 Amended and Restated 2017 Executive Change-In-Control and Severance Policy*\nX\n10.5 8x8, Inc. Amended and Restated 2012 Equity Incentive Plan, effective July 27, 2020*\n10-Q 10/29/2020 10.1\n10.6 Form of Stock Option Agreement under the 8x8, Inc. Amended and Restated 2012 Equity Incentive Plan*\nS-8 8/28/2012 10.2\n10.7 Form of Notice of Grant of Restricted Stock Unit Award and Agreement under the 8x8, Inc. Amended and Restated 2012 Equity Incentive Plan*\n10-Q 10/29/2020 10.5\n10.8 8x8, Inc. Third Amended and Restated 1996 Employee Stock Purchase Plan, effective August 10, 2020*\n10-Q 1/29/2021 10.3\n10.9 8x8, Inc. Amended and Restated 2017 New Employee Inducement Incentive Plan*\nS-8 12/18/2020 10.1\n10.10 Form of Stock Option Agreement under the 8x8, Inc. Amended and Restated 2017 New Employee Inducement Incentive Plan*\nS-8 11/2/2017 10.24\n10.11 Form of Notice of Grant of Restricted Stock Unit Award and Agreement under the 8x8, Inc. Amended and Restated 2017 New Employee Inducement Incentive Plan*\nS-8 11/2/2017 10.25\n10.12 8x8, Inc. 2006 Stock Plan, as amended*\n10-K 5/26/2009 10.7\n10.13 Form of Stock Option under the 8x8, Inc. 2006 Stock Plan, as amended*\n10-Q 2/7/2007 10.1\n10.14 8x8, Inc. Amended and Restated 2013 New Employee Inducement Incentive Plan*\n10-Q 10/29/2020 10.3\n10.15 Form of Stock Option Agreement under the 8x8, Inc. Amended and Restated 2013 New Employee Inducement Incentive Plan*\nS-8 9/10/2013 10.24\n10.16 Form of Notice of Grant of Restricted Stock Unit Award and Agreement under the 8x8, Inc. Amended and Restated 2013 New Employee Inducement Incentive Plan*\nS-8 9/10/2013 10.25\n10.17 Employment Agreement dated September 4, 2017 between 8x8, Inc. and Dejan Deklich*\n10-Q 11/2/2017 10.36\n10.18 Employment Agreement dated August 27, 2018, as amended October 23, 2018, between 8x8, Inc. and Matthew Zinn*\n10-Q 11/7/2018 10.37\n10.19 Transition Agreement, between Steven Gatoff and 8x8, Inc., effective June 8, 2020.*+\n10-Q 8/4/2020 10.2\n10.20 Temporary Secondment Agreement, between Samuel Wilson and 8x8, Inc., dated as of January 13, 2020*\n10-Q 8/4/2020 10.3\nIncorporated by Reference\nExhibit Number Exhibit Description Company Form Filing Date Exhibit Number Filed Herewith\n10.21 Employment Agreement dated December 9, 2020 between 8x8, Inc. and David Sipes*\n8-K 12/10/2020 10.1\n10.22 Separation, Transition and General Release Agreement dated December 9, 2020, between 8x8, Inc. and Vikram Verma*\n8-K 12/10/2020 10.2\n10.23 Employment Agreement, dated October 23, 2019, between 8x8, Inc. and Germaine Cota*\n10-Q 1/29/2021 10.4\n21.1 Subsidiaries of 8x8, Inc.\nX\n23.1 Consent of Independent Registered Public Accounting Firm\nX\n24.1 Power of Attorney (included in signature page)\nX\n31.1 Certification of Chief Executive Officer of the Registrant pursuant to Rule 13a-14\nX\n31.2 Certification of Chief Financial Officer of the Registrant pursuant to Rule 13a-14\nX\n32.1 Certification of Chief Executive Officer of the Registrant pursuant to 18 U.S.C. 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n32.2 Certification of Chief Financial Officer of the Registrant pursuant to 18 U.S.C. 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n101 The following financial statements from the Company's Annual Report on Form 10-K for the year ended March 31, 2021, formatted in Inline XBRL: (i) Consolidated Balance Sheets, (ii) Consolidated Statements of Operations, (iii) Consolidated Statements of Comprehensive Loss, (iv) Consolidated Statements of Stockholders’ Equity, (v) Consolidated Statements of Cash Flows and (vi) Notes to Consolidated Financial Statements, tagged as blocks of text and including detailed tags XBRL Instance Document X\n104 The cover page from the Company's Annual Report on Form 10-K for the year ended March 31, 2020, formatted in Inline XBRL X\n+ Certain schedules and exhibits to this agreement have been omitted in accordance with Item 601(b)(2) of Regulation S-K. A copy of any omitted schedule and/or exhibit will be furnished to the Securities and Exchange Commission on request.\n* Indicates management contract or compensatory plan or arrangement.\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant, 8x8, Inc., a Delaware corporation, has duly caused this Annual Report on Form 10-K to be signed on its behalf by the undersigned, thereunto duly authorized, in the City of Campbell, State of California, on May 17, 2021.\n8X8, INC.\nBy: /s/ David Sipes\nDavid Sipes,\nChief Executive Officer\nPOWER OF ATTORNEY\nKNOW ALL PERSONS BY THESE PRESENT, that each person whose signature appears below constitutes and appoints David Sipes and Samuel Wilson and, jointly and severally, his or her attorneys-in-fact, each with the power of substitution, for him or her in any and all capacities, to sign any amendments to this Annual Report on Form 10-K, and to file the same, with exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission, hereby ratifying and confirming all that each of said attorneys-in-fact, or his substitute or substitutes, may do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities and Exchange Act of 1934, this Annual Report on Form 10-K has been signed by the following persons in the capacities and on the date indicated:\nSignature\nTitle Date\n/s/ David Sipes\nDavid Sipes\nChief Executive Officer and Director\n(Principal Executive Officer) May 17, 2021\n/s/ Samuel Wilson\nSamuel Wilson\nChief Financial Officer\n(Principal Financial Officer) May 17, 2021\n/s/ Germaine Cota\nGermaine Cota\nChief Accounting Officer\n(Principal Accounting Officer) May 17, 2021\n/s/ Jaswinder Pal Singh\nJaswinder Pal Singh\nChairman and Director May 17, 2021\n/s/ Bryan Martin\nBryan Martin\nDirector and Chief Technology Officer May 17, 2021\n/s/ Eric Salzman\nEric Salzman\nDirector May 17, 2021\n/s/Todd Ford\nTodd Ford\nDirector May 17, 2021\n/s/ Vladimir Jacimovic\nVladimir Jacimovic\nDirector May 17, 2021\n/s/ Monique Bonner\nMonique Bonner\nDirector May 17, 2021\n/s/ Elizabeth Theophille\nElizabeth Theophille\nDirector May 17, 2021"
}