{
    "cik": "1029744",
    "company": "SONIC FOUNDRY INC",
    "filing_type": "10-K",
    "filing_date": "2021-12-09",
    "period_of_report": "2021-09-30",
    "sic": "3663",
    "state_of_inc": "MD",
    "state_location": "WI",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1029744/0001437749-21-028230-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1029744/000143774921028230/sofo20210930_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1029744/0001437749-21-028230.txt",
    "filename": "1029744_10K_2021_0001437749-21-028230.htm",
    "item_1": "ITEM 1. BUSINESS\nWho We Are\nSonic Foundry (OTC Pink Sheets: SOFO) (the “Company”) is a global leader in video creation management solutions as well as virtual and hybrid events through its Mediasite™ video platform. The Mediasite Video Platform automates the capture, management, and delivery of live and on-demand streaming videos for more than 5,200 educational institutions, corporations, healthcare organizations and government entities in over 65 countries around the world. The Company is poised to capture market share in the highly fragmented enterprise video market, which is expected to grow at an 11.6% continuous annual growth rate (CAGR) to $33 billion by 2027.\nSonic Foundry, Inc. was founded in 1991, incorporated in Wisconsin in March 1994 and merged into a Maryland corporation of the same name in October 1996. Our executive offices are located at 222 West Washington Ave., Madison, Wisconsin 53703 and our telephone number is (608) 443-1600. Our Sonic Foundry International B.V. (\"Sonic Foundry International\") (formerly Media Mission B.V.) office is located in the Netherlands, and our Mediasite K.K. (\"Mediasite KK\" or \"MSKK\") office is located in Japan. Our corporate website is www.sonicfoundry.com. In the “Investors” section of our website we make available, free of charge, our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to reports required to be filed pursuant to Sections 13(a) and 15(d) of the Securities Exchange Act of 1934, as soon as reasonably practicable after the filing of such reports with the Securities and Exchange Commission.\nOur Products Address Today's Communication Challenges\nWith the onset of COVID-19 in early 2020, organizations of all types have been compelled to embrace a digital-first world where video adoption and utilization are at the core of every remote working and learning solution for education, communication, and collaboration. With Sonic Foundry’s 30-year reputation as a leader in video technology, the Company is well-positioned to capitalize on the new fundamental needs for rapid and remote communication in a post-pandemic world as well as aligning organizations with the tech-savvy generations now in the workplace. Sonic Foundry’s products and services can help customers efficiently and cost-effectively address the challenge of sharing information whenever and wherever content is consumed through our award-winning Mediasite video platform.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nMediasite Video Capture Solutions\nMediasite provides the following primary flexible hardware and software solutions to record and upload any video-based content from anywhere, automatically:\n•\nMediasite Recorder and Recorder Pro: The Recorder and Recorder Pro are built-in room appliances that use schedule-based capture and advanced audio/video integration to fully automate high-quality video and content recording in lecture halls, training rooms, simulation labs and auditoriums. The room can be scheduled to automatically record and publish to Mediasite, so instructors and speakers can focus on teaching and presenting, free from technology worries and confident that everything said and presented is being captured.\n•\nMediasite Mobile Recorders: The Mobile Recorder is a portable recording device used to capture and stream broadcast-quality video from any environment when portability is key. Designed for on-the-go webcasting, hybrid events, guest speakers and conferences, the lightweight design moves easily from location to location and can be set up and ready to record in only a few minutes.\n•\nMediasite Mosaic: Formerly known as My Mediasite, Mosaic allows instructors, employees and students to create high quality videos, screencasts and slideshows from their computers or mobile devices with just one click. From demos and video training to flipped classes, lectures and assignments, everything needed to record, upload, manage and publish personal videos is in one simple-to-use tool, requiring no pro video skills\n• Mediasite Catch: Mediasite Catch is a video capture software solution that is scalable, reliable, and economical for classrooms not equipped with extensive audio/video capabilities. Mediasite Catch expands automation to classrooms with little to no audio/video capabilities and complements the existing Mediasite suite of content capture solutions. It can accommodate as many classrooms as needed.\nAs a result of COVID, many of our customers switched to remote work and teaching, and the need for traditional in-room video capture slowed. While this caused a temporary dislocation for Sonic Foundry’s customary offerings, the Company’s medium, and long-term opportunity for providing enhanced digital capabilities multiplied. The way we live, work and play has been permanently disrupted, ushering a new era of being connected on-demand. Sonic Foundry offers its customers an end-to-end solution that can be rapidly and efficiently deployed with its Mediasite Video Management and Delivery Solutions.\nMediasite Video Management and Delivery Solutions\nMediasite is a scalable, reliable, and secure solution to manage, search, analyze, publish, and stream video content. With Mediasite, government, businesses, and education institutions can:\n•\nAutomatically publish video to a learning management system (LMS), content management system (CMS), training portal or any website\n•\nCentrally manage and secure any video\n• Create an enterprise or campus YouTube channel\n•\nDeepen engagement and improve learning with quizzing, annotations, comments, polls, surveys and other interactive tools\n• Analyze viewing metrics to measure learner engagement and outcomes\n•\nSearch everything with fully indexed audio, video and slide content\n•\nStream live and on-demand video to any device\nMediasite On-Premises or Mediasite Cloud\nMediasite is available as either an on-premises license or as a SaaS (Software as a Service) offering within our Mediasite Cloud. Customers can conveniently host and manage all their content with Mediasite Cloud, or use it as needed for large events to divert heavy viewing traffic from their on-premises Mediasite deployment. Our co-located and high availability data centers and experienced team successfully manage customers’ cloud-based video streaming in a secure, fault-tolerant environment. During 2020, the Company made an investment in a new dual redundant, high availability data center in the United Kingdom, which went online at the end of September 2020. The Company also upgraded its existing US data centers, which went online during the first calendar quarter of 2021.\nCOVID Accelerated the Use of Video as a Key Communications Tool by Possibly Ten Years\nEven before COVID, companies were increasingly focused on becoming digital-forward enterprises. Anticipating this new market paradigm, Sonic Foundry invested in its data center infrastructure to help customers achieve their IT support objectives prior to COVID. Consequently, the Company was prepared to immediately support customer needs for handling the dramatic and rapid increase in data storage by migrating them to Mediasite Cloud. This accelerated customer adoption of Sonic Foundry’s cloud strategy and generated additional cloud revenue.\nAny further hardware investment required would be offset by an increase in revenue from hosting. The Company believes the significant increase in video content creation will proliferate as video conferencing systems like Zoom and Teams are used to record meetings and presentations. Between 2019-2021, Sonic Foundry developed and released an advanced integration to seamlessly automate workflow between Zoom or Teams, Mediasite, and a school's LMS. This allows all video content to be edited and managed in one secure location regardless of how it was recorded. Given the ongoing supply chain disruption, the Company believes any delays and uncertainty in hardware orders will be offset by increasing software licenses and cloud contracts.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nOur Service Offerings Address the New Virtual World\nMediasite Events\nMediasite Events provides live and on-demand webcasting services for conferences, hybrid events and high-profile broadcasts, supplying turnkey streaming solutions for hundreds of events each year. Fortune 500 companies, universities, associations, sporting events and charitable organizations use Mediasite Events to capture, produce, and deliver high-quality event experiences, both in-person and virtually.\nOur Mediasite Events business, both in the United States (US) and Japan, was significantly impacted by COVID. In early March 2020, all near-term, in-person events started to cancel due to concerns over the virus. While the Company’s in-person pipeline for the remainder of March and April shrunk to zero, it quickly replaced in-person events with virtual events. Since late March 2020, the US team has been helping customers continue to hold high-quality events via our virtual events platform, which utilizes Mediasite technology. In-person events did not resume at a typical level in fiscal 2021 based on continued concern over virus variants. As in-person events resume, the Company is optimistic that virtual events will remain an ongoing solution for the event industry.\nMediasite Professional Services\nCustomers maximize their return on video with additional Mediasite Services including integration services, installation assistance, custom development, training, and monitoring services\n. While COVID impacted the Company’s ability to do onsite services, it has been able to provide the majority of our professional services remotely, allowing the opportunity to provide uninterrupted year-round professional services support to new users and existing customers.\nMediasite Customer Care\nMediasite Customer Care plans include software upgrades for Mediasite and Mediasite capture solutions, technical support, warranty extensions and advanced replacement on hardware, as well as access to the Mediasite Community and other online resources. Nearly all our customers purchase a Customer Care plan when they purchase Mediasite or Mediasite capture solutions. Annual service contracts for Mediasite Video Cloud include a Standard Customer Care plan. COVID has not had an immediate impact on our Customer Care plans. It is, however, difficult to predict the long-term impact should the pandemic persist.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nSegment Information\nIn accordance with the Financial Accounting Standards Board (“FASB”) Accounting Standards Codification (“ASC”) 280-10, Segment Reporting, the Company has three operating segments; however, these segments meet the criteria for aggregation for reporting purposes as one reporting segment as of September 30, 2021.\nBillings\nOur services are typically billed and collected in advance of providing the service. Billings, which are a non-GAAP measure, are an important indicator of customer activity and cash flow in addition to revenue, and is therefore used by management as a key operational indicator. Billings are computed by combining revenue with the change in unearned revenue.\nOur largest individual customers can be either value added resellers (“VARs”) or end users in the case of large higher education institutions. No single customer represented over 10% of billings or revenue in 2021 or 2020.\nSales\nWe sell and market our offerings through a sales force that manages a channel of value-added resellers, system integrators, and consultants. These third-party representatives specialize in understanding both audio/video systems and IT networking. We also sold to approximately 300 resellers, and over 1,150 total end users.\nMarket expansion:\nHistorically, over two-thirds of our revenue has been realized from the education market. However, COVID escalated the rapid adoption of video as a remote work and learning solution across all industry sectors. This development represents an exciting trend that can extend Sonic Foundry’s market opportunity beyond the traditional academic customer base into new verticals.\nFor our higher education as well as corporate, government and association clients, we anticipate economic conditions will expand market demand for more outsourced services versus licensed, on-premises sales. Over the last two years, the Company has made extensive capital and technology investments to advance its services model with turnkey event webcasting, a comprehensive cloud-based Software as a Service (SaaS) datacenter, and e-commerce capabilities that position us to diversify our customer base as well as generate more recurring revenues.\nFor our Mediasite Events business both in the US and Japan, we continue to see growing demand for virtual events that we believe will extend beyond COVID. These event-based communication, education and training platforms are expected to help drive the Company’s corporate sales activities going forward.\nWhile the competitive landscape has grown in the past two years, we believe our services offerings, particularly as it relates to high-touch white glove event services, give us a distinct advantage over the many virtual event platforms that have launched opportunistically since COVID. As enterprises and education institutions return to a new normal mixed audiences of in person and virtual, we are confident our experience and reputation automating and recording from mixed spaces will position us well over offerings that cater to in person only or virtual only.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nOperations\nWe do not own or operate any manufacturing facilities. Instead we contract with a third party to build the hardware for our Mediasite Recorders and purchase quantities sufficient to fill specific customer orders, including purchases of inventory by resellers. Quantities are maintained in inventory by the third-party provider and shipped directly to the end customer or reseller. The hardware manufacturer provides a limited one-year warranty on the hardware, which is passed on to our customers who purchase a Mediasite Customer Care support and maintenance plan. While we have long standing relationships with our contract manufacturers, there are other manufacturing alternatives if needed.\nResearch and Development\nWe believe that our future success will depend on our ability to deepen our relationship with current customers and attract new customers by offering a compelling value proposition that enhances their workplace and business objectives. Accordingly, we invest a significant amount of our resources in research and development activities, with a particular focus on our SaaS offerings. During the fiscal years ended September 30, 2021 and 2020, we spent $7.2 million and $6.3 million, respectively, on internal research and development activities in our business. These amounts represent 20% in 2021 and 18% in 2020 of total revenue.\nGlobal Expansion\nIn fiscal 2014, we acquired MediaMission B.V.in the Netherlands and Mediasite KK in Japan. With these acquisitions, we significantly expanded our global market reach in Europe and the Asia-Pacific Region and accelerated our commitment to enterprise video communication worldwide. The investment in maintaining a local presence in these regions has allowed us to better serve the ongoing sales and support demands of our customers and prospective customers in those markets. Additionally, we’ve been able to deploy customer care and cloud hosting services more quickly in each of those markets to capitalize on the trend to move data intensive applications, such as video, to the cloud.\nHuman Capital\nAt September 30, 2021 and 2020, we had 180 and 177 full-time employees, respectively. Our employees are not represented by a labor union, nor are they subject to a collective bargaining agreement.\nWe have a competitive compensation plan and benefits plan that is designed to attract, retain, and reward individuals and includes an employee stock purchase plan and a 401k plan with a matching contribution. Through our volunteer program, employees are granted 3 days of PTO per calendar year to volunteer and support the local and global community.",
    "item_1A": "ITEM 1A. RISK FACTORS\nYOU SHOULD CAREFULLY CONSIDER THE RISKS DESCRIBED BELOW BEFORE MAKING AN INVESTMENT DECISION. THE RISKS DESCRIBED BELOW ARE NOT THE ONLY ONES WE FACE. ADDITIONAL RISKS THAT WE ARE NOT PRESENTLY AWARE OF OR THAT WE CURRENTLY BELIEVE ARE IMMATERIAL MAY ALSO IMPAIR OUR BUSINESS OPERATIONS. OUR BUSINESS COULD BE HARMED BY ANY OR ALL OF THESE RISKS. THE TRADING PRICE OF OUR COMMON STOCK COULD DECLINE SIGNIFICANTLY DUE TO ANY OF THESE RISKS, AND YOU MAY LOSE ALL OR PART OF YOUR INVESTMENT. IN ASSESSING THESE RISKS, YOU SHOULD ALSO REFER TO THE OTHER INFORMATION CONTAINED OR INCORPORATED BY REFERENCE IN THIS ANNUAL REPORT ON FORM 10-K, INCLUDING OUR CONSOLIDATED FINANCIAL STATEMENTS AND RELATED NOTES.\nOn August 26, 2020, the Securities and Exchange Commission (“Commission”) announced the adoption of amendments to modernize certain disclosures registrants are required to make pursuant to Regulation S-K. The amendments are intended to reflect the Commission’s commitment to a principles-based, registrant-specific approach to disclosure, rooted in materiality. The modernization of Item 105 Risk Factor Disclosures includes the following:\n●\nThe requirement for inclusion of a summary risk factor disclosure of no more than two pages if the risk factor section exceeds 15 pages.\n●\nRefining the principles-based approach by requiring disclosure of “material” risk factors versus “most significant.”\n●\nThe requirement to organize risk factors under relevant headings for ease of understanding, with generic risk factors placed at the end of the section. The amendments do not specify the risk factor headings.\nThe Company has reviewed its current risk factors and will organize them under the primary categories of company risk, industry risk, and investor risk.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nRisk Factor Summary Disclosure\nA.\nCompany Risks consist of both internal and external items and events that impact Sonic Foundry as a company. These are further categorized as follows:\n1.\nFinancial Risks impact the financial well-being of the Company. Those risks include, but are not limited to the following:\na.\nWe have a history of losses.\nb.\nWe may need to raise additional capital.\nc.\nIf customer adoption has barriers, our business may not succeed.\nd.\nLarge, multi-unit deals are needed for continued success.\ne.\nBecause most of our service contracts are renewable on an annual basis, a reduction in our service renewal rate could significantly reduce our revenues.\nf.\nIf we are viewed only as a commodity supplier, our margins and valuations will shrink.\ng.\nOur operating results are hard to predict as a significant amount of our sales typically occur at the end of a quarter, and the mix of product and service orders may vary significantly.\nh.\nAccounting regulations and related interpretations and policies, particularly those related to revenue recognition, cause us to defer revenue recognition into future periods for all or portions of our products and services.\ni.\nBecause we generally recognize revenues ratably over the term of our service contracts, a decrease or increase in service transactions will not be fully reflected in our operating results until future periods.\nj.\nCurrency exchange rate fluctuations could result in higher costs and decreased margins and earnings.\nk.\nOur ability to utilize our net operating loss carryforwards may be limited.\n2.\nOperational Risks disrupt fundamental daily operations of the Company. Those risks include, but are not limited to the following:\na.\nOperational failures in our network infrastructure could disrupt our remote hosting services, cause us to lose clients and sales to potential clients and result in increased expenses and reduced revenues.\nb.\nOur business is susceptible to risks associated with international operations.\nc.\nSupporting our existing and growing customer base and implementing large customer deployments could strain our personnel resources and infrastructure, and if we are unable to scale our operations and increase productivity, customer satisfaction and our business will be harmed.\nd.\nIf we lose key personnel or fail to integrate replacement personnel successfully, our ability to manage our business could be impaired.\ne.\nManufacturing disruption or capacity constraints would harm our business.\n3.\nStrategic Risks prevent the Company from achieving its strategic objectives. Those risks include, but are not limited to the following:\na.\nThe technology underlying our products and services is complex and may contain unknown defects that could harm our reputation, result in product liability or decrease market acceptance of our products.\nb.\nOur success depends upon the proprietary aspects of our technology.\nc.\nWe may not be able to innovate to meet the needs of our target market.\nd.\nIf potential customers or competitors use open source software to develop products that are competitive with our products and services, we may face decreased demand and pressure to reduce the prices for our products.\ne.\nWe also rely upon trademark, copyright and trade secret laws, which may not be sufficient to protect our intellectual property.\nf.\nIf other parties bring infringement or other claims against us, we may incur significant costs or lose customers.\ng.\nThere is a great deal of competition in the market for our products, which could lower the demand for our products and have a negative impact on our operations.\nh.\nIf our marketing and lead generation efforts are not successful, our business will be harmed.\ni.\nThe length of our sales and deployment cycles are uncertain, which may cause our revenue and operating results to vary significantly from quarter to quarter and year to year.\nj.\nWe depend in part on the success of our relationships with third-party resellers and integrators.\nk.\nWe may need to make acquisitions or form strategic alliances or partnerships in order to remain competitive in our market, and acquisitions, strategic alliances or partnerships, could be difficult to integrate, disrupt our business and dilute stockholder value.\nl. Our Mediasite events and cloud businesses are an area of emphasis for us and carry challenging delivery requirements. The cloud offering requires significant investment in infrastructure, willingness of our customers to move from on-premise installations to our cloud and carry increased cyber and privacy risks. Our events business has been very successful in pivoting from in-person to virtual events as a result of COVID but future growth relies on a greater willingness of companies to hold events, both virtual and in-person.\nm. Our fiscal 2022 business plan includes an expectation that we begin to develop and introduce new product and service offerings in areas where we can leverage our product development skills, understanding of video technologies and strength in the higher education vertical. These offerings will likely take significant investment in key engineering, sales and management resources with little, if any, impact on fiscal 2022 revenue.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\n4.\nCompliance Risks result from non-compliance of laws and regulations from various governing bodies. Those risks include, but are not limited to the following:\na.\nOur customers may use our products to share confidential and sensitive information, and if our system security is breached, our reputation could be harmed and we may lose customers.\nb.\nOur business is subject to changing regulations regarding corporate governance and public disclosure that will increase both our costs and the risk of noncompliance.\n5.\nIndustry Risks are items and events that have macro-level impacts on our industry. Those risks include, but are not limited to the following:\na.\nEconomic conditions could materially adversely affect the Company.\nb.\nEconomic conditions may have a disproportionate effect on the sale of our products and services.\nc.\nWe could lose revenues if there are changes in the spending policies or budget priorities for government funding of colleges, universities, schools and other education providers.\nd.\nChanges in U.S. trade policy, including the imposition of tariffs and the resulting consequences, may have a material adverse impact on our business, operating results and financial condition.\ne.\nPrivacy concerns and laws, evolving regulation of cloud computing, cross-border data transfer restrictions and other domestic or foreign regulations may limit the use and adoption of our solutions and adversely affect our business.\nf.\nWe face risks associated with government regulation of the internet and related legal uncertainties.\ng. COVID has negatively impacted interest and ability to hold in-person events and while virtual events are often held in place of in-person events, some companies and attendees are less likely to hold or attend virtual events.\n6.\nInvestor Risks are both internal and external risks that impact an investment made in the Company’s stock. Those risks include, but are not limited to the following:\na.\nThe market price of our common stock may be subject to volatility.\nb.\nOur common stock is subject to low trading volume and broad price swings.\nc.\nExercise of outstanding options and warrants will result in further dilution.\nd.\nProvisions of our charter documents, and Maryland law, could also discourage an acquisition of our Company that would benefit our stockholders and, due to our insiders control of a substantial percentage of our stock, our officers, directors, and major stockholders will have a substantial amount of control over whether to approve or disapprove of a transaction.\nFollowing is a more detailed discussion of each risk factor outlined in the summary.\nCompany Risks - Financial\nWe have a history of losses.\nAlthough we achieved positive net income in the current year, our operations have generated losses in most other years. Similarly, while we were able to grow revenue in the current year above $35 million for the first time since fiscal 2017, we still need to generate greater growth in order to be successful. While we continue to invest in our events and cloud businesses which we believe have greater opportunities for growth and are identifying and vetting additional revenue streams with greater likelihood for growth, we may not realize sufficient revenues to achieve success in these areas. We initiated a plan for reducing costs in fiscal 2019 that began with eliminating certain headcount and functions, including a reduction in senior executive positions. In 2020, we continued that focus on cost reduction and also executed on an executive leadership change in the fourth quarter of 2020. In that same quarter, we eliminated three additional mid to senior level sales and marketing positions, and in the first quarter of 2021, eliminated additional headcount, primarily within sales and marketing that were not aligned with our strategy for growth. To achieve future growth and increases to profitability, we have begun to hire for certain targeted positions and will likely need to invest more significantly in certain aspects of our business model, including adding additional headcount in strategic areas. As such, we face risks, expenses and uncertainties related to our specific business model, as well as those typically encountered by similar companies. Those risks include, but are not limited to our ability to successfully achieve the following:\n●\nManage the growth and profitability of our business, including known and unknown challenges and expenses;\n●\nAcquire new customers and retain and expand existing customers;\n●\nDevelop new and complimentary price competitive product and service offerings, both internally and in partnership with third parties;\n●\nMaintain and develop relationships with strategic partners including dealers, A/V integrators, large institutional end-users, and other channel partners;\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\n●\nCompete successfully with companies offering similar products and services;\n●\nDevelop targeted marketing efforts to expand our reach into new markets and deepen penetration into existing markets;\n●\nManage and scale a high-performance technology infrastructure;\n●\nEnsure a highly secure and reliable product platform;\n●\nAttract and retain highly skilled personnel to execute in a fast-paced, rapidly changing environment;\n●\nNavigate the ongoing evolution of changing regulatory requirements, such as privacy laws and tax laws, and how it impacts our business, including our products and services; and\n●\nExpand our competitive reach into international markets.\nWe have experienced some of these risks already and will continue to encounter them as the business evolves. Failure to successfully manage them could adversely affect our financial condition and results of operations.\nWe may need to raise additional capital.\nAt September 30, 2021, we had cash of $10.0 million, $3.8 million of which was in our foreign operations compared to total cash of $7.6 million and foreign operations cash of $2.3 million at September 30, 2020. We have a new revolving credit facility which requires compliance with certain covenants, and while it provides for a maximum debt outstanding of $3.0 million, it must be supported by certain collateral. At September 30, 2021 the collateral supported the maximum $3.0 million and no amounts were outstanding. There can be no assurances the line of credit will be available to support any financing needs beyond our available cash and cash generated from operations, and, there can be no assurances that other sources of financing will be available, or if available, on acceptable terms. The Company has a history of losses and has historically financed its operations primarily through cash from sales of equity or debt securities, and to a limited extent, cash from operations and through credit facilities. The Company was able to grow fiscal 2021 revenue over fiscal 2020 and maintained fiscal 2020 revenue consistent with fiscal 2019, despite the impacts of COVID-19, while reducing operating expenses to the lowest level since fiscal 2013. We cannot ensure that revenue will continue to grow, even with strategic investment of resources in business lines where we believe there is a greater opportunity for growth. If revenue is determined to be growing at a rate less than anticipated and expenses are not sufficiently matched, our cash resources may not be sufficient to support working capital needs, and we may have to attempt to borrow additional funds from our line of credit, other debt providers or attempt to raise equity capital. In addition, our financial condition may, in the future, cause us to be in non-compliance with certain provisions of our debt facilities or new facilities we may establish in the future.\nIn the event we need to borrow additional money or raise additional equity capital, we may not be able to do so on acceptable terms and conditions including discounts from market, warrants, convertible securities or preferred stock. In that event, we may seek to raise money from entities that are affiliated with the Company, as we have done in the past. The Company has had to rely on its Chairman, Mark Burish, (\"Mr. Burish\") to provide capital on terms reasonable and acceptable to the independent members of the Board of Directors. There is no assurance, however, that Mr. Burish, or any other affiliated party, will be willing to provide additional capital.\nAs a result of the non-cash goodwill and other intangible assets impairment charges recorded in fiscal 2018, the Company was no longer able to satisfy the NASDAQ requirement to maintain $2.5 million of stockholders' equity and voluntarily transferred to the OTCQB on December 18, 2018. Subsequently the Company transferred its listing to the OTC Pink Sheets on February 18, 2019, a market with limited trading. With an improved balance sheet, the Company applied for listing on the Nasdaq Capital Market in March 2021. While the Company believes it meets all the requirements for initial listing on NASDAQ, there can be no assurance we are approved by NASDAQ for listing, nor that we will be able to maintain a listing on the Nasdaq Capital Market. If the Company is unable to list on NASDAQ, our ability to raise equity capital may be adversely affected.\nIn the event we have a need to borrow money, we may incur significant interest charges, or fees, which could harm our profitability. Holders of debt would also have rights, preferences or privileges senior to those of existing holders of our common stock. In the event we are able to raise additional equity, the terms of such financing may dilute the ownership interests of current investors and cause our stock price to fall significantly. In the event additional capital is provided by executive officers or directors, then, due to the low price levels of our common stock, control by such executive officers or directors may substantially increase.\nWe may not be able to secure debt or equity financing upon acceptable terms, if at all. If we cannot raise funds on acceptable terms, our business, operating results, and financial condition could be negatively impacted. The Company believes its cash position is adequate to accomplish its business plan through at least the next twelve months.\nIf the funds held by our foreign subsidiaries are needed for our operations in the United States, the repatriation of some of these funds to the United States could require payment of additional U.S. taxes.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nIf customer adoption has barriers, our business may not succeed.\nPart of our strategic challenge is to convince enterprise customers of the stability, productivity, improved communications, cost savings, suitability and other benefits of our products. The market for content delivery solutions is very complex, includes many products and solutions that address various aspects of customer needs and as a result it is often difficult for customers and channel partners to understand how our products and services compare. Further, corporate customers may use video as a tool, but may choose to rely upon their own IT infrastructure and resources to manage their video content. Because many companies generally are predisposed to maintaining control of their IT systems and infrastructure, there may be resistance to using software as a service provided by a third party. Our future revenue and revenue growth rates will depend in large part on our success in delivering these products effectively, creating market acceptance for these products in existing markets that we sell into and in new markets, and meeting customer’s needs for new or enhanced products. If we fail to do so, our products will not achieve widespread market acceptance, or will no longer be used by our customers, and we may not generate sufficient revenue to offset our product development and selling and marketing costs, which will adversely impact the valuation of the Company, the price of our stock, and will harm our business.\nLarge, multi-unit deals are needed for continued success.\nWe need to sell multiple units or large software and service solutions to educational, corporate and government institutions in order to sell most efficiently and become profitable. Sales of large solutions to corporate customers have lagged behind results achieved in the higher education market; consequently, we have allocated more resources to the higher education market. While we have addressed a strategy to leverage existing customers, better address the needs of potential new customers, and close multiple unit and large software and service transactions, a customer may choose not to make expected purchases of our products. Despite our strategy to focus on a customer base with a recurring need to purchase our products and services, we need to identify and sell more products and services to new customers, enter new markets and reduce the rate of attrition from certain existing customers, typically those with smaller deployments. The failure to develop effective strategies to enter new markets, and increase sales will adversely impact the valuation of the Company and the price of our stock, and will harm our business.\nBecause most of our service contracts are renewable on an annual basis, a reduction in our service renewal rate could significantly reduce our revenues.\nOur clients have no obligation to renew their content hosting agreements, customer support contracts or other annual service contracts after the expiration of the initial period, which is typically one year, and some clients have elected not to do so. A decline in renewal rates could cause our revenues to decline. Our renewal rates may decline or fluctuate as a result of a number of factors, including client dissatisfaction with our products and services, our slow response to customer technical inquiries, our failure to update our products to maintain their attractiveness in the market, deteriorating economic conditions or budgetary constraints or changes in budget priorities faced by our clients. If our retention rates decrease, we may need to provide more incentives, reduce pricing or increase marketing costs to improve lead generation through marketing in order to increase revenues, all of which could reduce profitability.\nIf we are viewed only as a commodity supplier, our margins and valuations will shrink.\nWe need to provide value-added services in order to avoid being viewed as a commodity supplier, which could adversely impact the valuation of the Company, and the price of our stock. This entails building long-term customer relationships and developing features that will distinguish our products. Our technology is complex and is often confused with other products and technologies in the market place, including video conferencing, streaming and collaboration.\nWe have developed lower cost hardware, software products and cloud solutions to better address the more cost-conscious customers. Such products have more limited features compared to our existing products. While we believe we can preserve the market for our full-featured products due to differentiation between the two and migration to full featured products, release of lower cost products has and could continue to reduce gross margins and demand for products sold at higher prices, which could adversely affect our business and operating results. Potential large-scale deployments of our products often include the lower cost products we sell, putting greater pressure on gross margin due to expectations for greater volume discounts.\nOur events business is currently pursuing a greater percentage of virtual events than in the past. Some attendees and companies are less likely to attend virtual events which could negatively impact the number of events held.\nIf we fail to build long-term customer relationships, develop features that distinguish our products in the marketplace and address the market for lower function and cost solutions, our margins will shrink, and our stock may be adversely impacted.\nOur operating results are hard to predict as a significant amount of our sales typically occur at the end of a quarter and the mix of product and service orders may vary significantly.\nRevenue for any particular quarter is extremely difficult to predict with any degree of certainty. We typically ship products within a short time after we receive an order and therefore, we do not have an order backlog with which to estimate future revenue. Any decline or uncertainty in end-user demand could negatively impact end-user orders. Accordingly, our expectations for both short and long-term future revenue is based almost exclusively on our own estimate of future demand based on history and the pipeline of sales opportunities we manage, rather than on firm orders. The mix of product demand varies significantly from quarter to quarter, further complicating our estimated product needs. Our expense and inventory levels are based largely on these estimates. In addition, our events business is particularly unpredictable and subject to variation due to the short time-frame between when we learn of an opportunity and when the event occurs. Further, the majority of our product orders are received in the last month of a quarter; thus, the unpredictability of the receipt of these orders could negatively impact our future results. Accordingly, any significant shortfall in demand for our products or services in relation to our expectations, even if the result was a short-term delay in orders, would have an adverse impact on our operating results.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nWe have experienced growing demand for our hosting and event services as well as a growing preference from our customers in purchasing our annually licensed software. As a result, we have seen an increase in service billings and recurring revenue as a percentage of total billings, and a decrease in hardware billings. We expect this trend to continue, which we expect to help improve predictability of revenue and gross margins but will delay the impact on revenue of any increase or decrease in billings during any particular quarter. We subcontract for some services required by our events customers, such as onsite management labor and closed captioning. We typically charge for such services at a lower margin than other services. The percentage of billings represented by services, provided either directly or indirectly, is also likely to fluctuate from quarter to quarter due to seasonality of event services and other factors. Since content hosting and support services are typically billed in advance of providing the service, revenue is initially deferred, leading to reduced current period revenue with a corresponding negative impact to profits or losses in periods of significant increase in the percentage of our billings for deferred services.\nAccounting regulations and related interpretations and policies, particularly those related to revenue recognition, cause us to defer revenue recognition into future periods for all or portions of our products and services.\nRevenue recognition for our products and services is complex and subject to multiple sources of authoritative guidance, some of which are new, as well as, varied interpretations and implementation practices for such rules. These rules require us to apply judgment in determining revenue recognition. In certain situations, we may have to defer the entire amount of revenue from a transaction, even when the product has already shipped. This may occur when the customer has delayed payment on the transaction, or in certain other circumstances, such as when we agree to extend payment terms on other invoices from such customer. In addition, we always defer revenue when services are included in a transaction, and not performed. Other factors that are considered in revenue recognition include those such as standalone selling price (SSP), best estimate of selling price and the inclusion of other services and contingencies to payment terms. We expect that we will continue to defer portions or, in certain circumstances with respect to a particular customer, all of our product or service billings because of these factors, and to the extent that management’s judgment is incorrect it could result in an increase in the amount of revenue deferred in any one period. The amounts deferred may be significant and may vary from quarter to quarter depending on, among other factors, compliance with payment terms, the mix of products sold, combination of products and services sold together or contractual terms.\nAdditional changes in authoritative guidance, including the interpretation of \"Revenue from Contracts with Customers (Topic 606)\", or changes in practice in applying such rules could also cause us to defer the recognition of revenue to future periods or recognize lower revenue. See Note 1 - Accounting Policies of the Notes to Financial Statements (Part II, Item 8 of this Form 10-K) for further discussion.\nBecause we generally recognize revenues ratably over the term of our service contracts, decrease or increase in service transactions will not be fully reflected in our operating results until future periods.\nWe recognize most of our revenues from service contracts monthly over the terms of their agreements, which are typically 12 months, although terms have ranged from less than one month to 48 months. As a result, much of the service revenue we report in each quarter is attributable to agreements entered into during previous quarters. Consequently, a decline in sales, client renewals or market acceptance of our products in any one quarter will not necessarily be fully reflected in the revenues in that quarter and will negatively affect our revenues and profitability in future quarters. This ratable revenue recognition also makes it difficult for us to rapidly increase our revenues through additional sales in any period, as revenues from new clients must be recognized over the applicable agreement term.\nCurrency exchange rate fluctuations could result in higher costs and decreased margins and earnings.\nThe functional currency of our foreign subsidiaries in the Netherlands is the Euro and in Japan is the Japanese Yen. They are subject to foreign currency exchange rate risk. The conversion rate of the Yen to the US Dollar varied from about 102 to approximately 114 during fiscal 2021. Similarly, the Euro varied from about 0.81 to approximately 0.86 to the US Dollar during fiscal 2021. The strength of the dollar impacts our ability to export profitably to other countries and will likely continue to fluctuate. Any increase in the exchange rate of the US Dollar compared to the Euro or the Japanese Yen will impact our future operating results and financial position.\nOur ability to utilize our net operating loss carryforwards may be limited.\nThe use of our net operating loss carryforwards may have limitations resulting from certain future ownership changes or other factors under the Internal Revenue Code and other taxing authorities. The Tax Cuts and Jobs Act of 2017 changed both the federal deferred tax value of the net operating loss carryforwards and the rules of utilization of federal net operating loss carryforwards. The Tax Cuts and Jobs Act of 2017 lowered the corporate tax rate from 35% to 21% effective for our 2018 fiscal year. For net operating loss carryforwards generated in years prior to 2018, there is no annual limitation on the utilization and the carryforward period remains at 20 years. There could be a limitation if a change in ownership occurs. However, net operating loss carryforwards generated in years after 2017 will only be available to offset 80% of future taxable income in any single year, but will not expire.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nIf our net operating loss carryforwards are limited, and we have taxable income which exceeds the available net operating loss carryforwards for that period, we would incur an income tax liability even though net operating loss carryforwards may be available in future years prior to their expiration. Any such income tax liability may adversely affect our future cash flow, financial position and financial results.\nCompany Risks - Operational\nOperational failures in our network infrastructure could disrupt our remote hosting services, cause us to lose clients and sales to potential clients and result in increased expenses and reduced revenues.\nUnanticipated problems affecting our network systems could cause interruptions or delays in the delivery of the hosting services we provide to some of our clients. We are not equipped to provide full disaster recovery to all of our hosted clients. If there are operational failures in our network infrastructure that cause interruptions, slower response times, loss of data or extended loss of service for our remotely hosted clients, we may be required to issue credits or pay penalties, current clients may terminate their contracts or elect not to renew them and we may lose sales to potential clients. We have recently acquired additional hardware and systems, expect to make more significant investments in hardware and outsourced most aspects of our network infrastructure to multiple providers. We also rely on Internet systems and infrastructure to operate our business and provide our services. As a result, we are reliant on third parties for network availability, so outages may be outside our control and we may need to acquire additional hardware in order to provide an appropriate level of redundancy required by our customers. These hardware, data, and cloud computing platforms may not be available at reasonable terms or prices.\nOur business is susceptible to risks associated with international operations.\nInternational product and service billings were 36% of our total billings in each of the past two years and are expected to continue to account for a significant portion of our business in the future. International sales are subject to a variety of risks, including:\n●\nDifficulties in establishing and managing international subsidiaries, distribution channels and operations;\n●\nDifficulties in selling, servicing and supporting overseas products, translating products into foreign languages and compliance with local hardware requirements;\n● Restrictions related to COVID on traveling to support our international customers\n●\nDifficulties in managing the demands of large international deployments, many of which distract key sales personnel from opportunities in other parts of the world;\n●\nChallenges associated with management transition;\n●\nChallenges related to language or cultural differences;\n●\nThe uncertainty of laws and enforcement in certain countries, such as China, relating to the protection of intellectual property or requirements for product certification, protection of personal data or other restrictions;\n●\nCompetitive pressure impacting other parts of the world;\n●\nMultiple and possibly overlapping tax structures;\n●\nCurrency and exchange rate fluctuations and imposition of tariffs or quotas;\n●\nDifficulties in collecting accounts receivable in foreign countries, including complexities in documenting letters of credit;\n●\nEconomic or political changes in international markets;\n●\nRestrictions on access to the Internet; and\n●\nDifficulty in complying with international employment related requirements\nSupporting our existing and growing customer base and implementing large customer deployments could strain our personnel resources and infrastructure, and if we are unable to scale our operations and increase productivity, customer satisfaction and our business will be harmed.\nFrequent enhancements to our software put pressure on our customers to install, maintain and train their personnel on its use. Further, frequent releases of the software can lead to less product stability. As a result, our customer care and engineering resources have come under, and are expected in the future to come under significant pressure in providing the high-quality of technical support our customers expect during periods of high demand. We may be unable to respond quickly enough to accommodate short-term increases in customer demand for support services. Increased customer demand for these services, without corresponding revenues, could increase costs and adversely affect our operating results. In addition, our sales process is highly dependent on our applications and business reputation and on positive recommendations from our existing customers. Any failure to maintain high-quality technical support, or a market perception that we do not maintain high-quality support, could adversely affect our reputation, our ability to sell our products and services to existing and prospective customers, and our business, operating results and financial position.\nAs we target more of our sales efforts at larger initial transactions, we face increasingly complex deployments requiring substantial technical and management resources, including in some cases significant product customization and integration with other applications or hardware. Customers making large expenditures for our products and services typically have higher expectations of product and service operability and response time if issues arise. Some of these customers have asked us to host their content and have significant amounts of legacy content to transfer to our datacenter. Such increased activity and storage demand on our data centers put additional strain on our personnel and hosting infrastructure. Our hosting customers typically require a high level of access, data security and need to capture and store multiple high definition streams. Such requirements require costly enhancements to our infrastructure. If we do not accurately plan for our infrastructure capacity requirements and we experience significant strains on our data center capacity, our customers could experience performance degradation or service outages that may subject us to financial penalties, result in customer losses and harm our business. As we add or change data centers or capacity, we may move or transfer our data and our customers’ data. Despite precautions taken during this process, any unsuccessful data transfers may impair the delivery of our services, which may damage our business. High demand on technical and management resources to manage large transactions distract personnel from existing customers, development of new products and other important activities which could lead to potential customer dissatisfaction, product development delays or other issues associated with the distraction.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nIf a customer is not satisfied with the quality of work performed by us or a third party in performing our events services, we could incur additional costs to address the situation and delay recognition of revenue, the profitability of that work might be impaired, and the customer’s dissatisfaction with our services could damage our ability to obtain additional work from that customer. We could face equipment or Internet connection failure outside our control but could regardless result in the customer being dissatisfied with our performance. In addition, negative publicity related to our customer relationships, regardless of its accuracy, may further damage our business by affecting our ability to compete for new business with current and prospective customers.\nIf we lose key personnel or fail to integrate replacement personnel successfully, our ability to manage our business could be impaired.\nOur future success depends upon the continued service of our key management, technical, sales and other critical personnel, including our Chief Executive Officer. Most of our officers and other key personnel are employees-at-will, and we cannot assure that we will be able to retain them. Key personnel have left our Company in the past, sometimes to accept employment with companies that sell similar products or services to existing or potential customers of ours. The technology industry is subject to substantial and continuous competition for engineers with high levels of experience in designing, developing and managing software and Internet-related services, as well as competition for sales and operations personnel. There will likely be additional departures of key personnel from time to time in the future and such departures could result in additional competition, loss of customers or confusion in the marketplace. As we seek to replace such departures, or expand our business, the hiring of qualified sales, technical and support personnel is difficult due to the limited number of qualified professionals. Training of new sales, technical and support personnel can take six months or longer before they become productive. Sales and technical strategies have changed and will likely change further in the future and require different skills to sell to different customer types and develop new and changing products. The loss of any key employee could result in significant disruptions to our operations, including adversely affecting the timeliness of product releases, the successful implementation and completion of Company initiatives and the results of our operations. In addition, we do not have life insurance policies on any of our key employees. If we lose the services of any of our key employees, the integration of replacement personnel could be time consuming, may cause disruptions to our operations and may be unsuccessful.\nManufacturing disruption or capacity constraints would harm our business.\nWe subcontract the manufacturing of our recorders to a third-party contract manufacturer. Although we believe there are multiple sources of supply from other contract manufacturers, as well as, multiple suppliers of component parts required by our contract manufacturer, there is currently a global shortage of most component parts. Inability to get parts or completed systems required to satisfy customer demand would have a material negative impact on our revenues. Likewise, we are susceptible to any material change in terms; such as pricing, level of services performed or changes to payment terms by our contract manufacturer. In particular, the cost of our products increased this year as a result of increased tariffs, an imbalance between supply and demand, inflation and challenges finding sources of distribution. Many component parts currently have long delivery lead times or cease production of certain components with limited notice in which to evaluate or obtain alternate supply, requiring conservative estimation of production requirements. Lengthening lead times, product design changes and other third-party manufacturing disruptions have caused delays in delivery in the past and will likely continue to occur. In order to compensate for supply delays, we have sourced components from increased order lead-time from approximately three months to fifteen months, shopped other off-shore locations, used cross component parts, paid significantly higher prices or premium fees to expedite delivery for short supply components, produced alternate versions and converted inventory from one version to another. We have typically maintained greater amounts of inventory as insurance against delays but currently hold substantially lower quantities of inventory as a result of delays in several components required in the production of our recorders. Our inventory levels at September 30, 2021 were $442 thousand compared to $1.2 million at September 30, 2020. Many of these strategies have increased our costs or require substantial resources to maintain and may not be sufficient to ensure against a product shortage. We depend on our subcontract manufacturer to produce our products efficiently while maintaining high levels of quality despite frequent changes in configuration and scheduling imposed by us. Any manufacturing or component defects, delay in production or changes in product features will likely cause customer dissatisfaction and may harm our reputation. Moreover, any incapacitation of the manufacturing site due to destruction, natural disaster or similar events could result in a loss of product inventory. As a result of any of the foregoing, we may not be able to meet demand for our products, which could negatively affect revenues in the quarter of the disruption or longer depending upon the magnitude of the event, and could harm our reputation.\nWe license technology from third parties. If we are unable to maintain these licenses, our operations and financial condition may be negatively impacted.\nWe license technology from third parties. The loss of, our inability to maintain, or changes in material terms of these licenses could result in increased cost or delayed sales of our software, and services, or may cause us to remove features from our products or services. We anticipate that we will continue to license technology from third parties in the future. This technology may not continue to be available on commercially reasonable terms, if at all. Although we do not believe that we are substantially dependent on any individual licensed technology, some of the component technologies that we license from third parties could be difficult for us to replace. The impairment of these third-party relationships, especially if this impairment were to occur in unison, could result in delays in the delivery of our software and services until equivalent technology, if available, is identified, licensed and integrated. This delay could adversely affect our operating results and financial condition.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nCompany Risks - Strategic\nThe technology underlying our products and services is complex and may contain unknown defects that could harm our reputation, result in product liability or decrease market acceptance of our products.\nThe technology underlying our products and services is complex and includes software that is internally developed, software licensed from third parties and hardware purchased from third parties. These products have, and will in the future, contain errors or defects, particularly when first introduced or when new versions or enhancements are released. We may not discover defects that affect our current or new applications or enhancements until after they are sold, and our insurance coverage may not be sufficient to cover our exposure. Further, there are third-party applications our products and services are dependent on, or integrate with, such as operating systems and learning management systems. These integrations require specialized knowledge that is difficult and expensive to maintain. Failure to maintain compatibility with such applications or identification of defects in our products and services could:\n●\nDamage our reputation;\n●\nCause our customers to initiate product liability suits against us;\n●\nIncrease our product development resources;\n●\nCause customers to cancel orders, ask for partial refunds or potential customers to purchase competitive products or services;\n●\nDelay release or market acceptance of our products, or otherwise adversely impact our relationships with our customers; and/or\n●\nCause us to allocate valuable engineering resources to fix our existing products, which may cause us to allocate fewer resources toward developing new products, or toward adding features to our existing products.\nOur success depends upon the proprietary aspects of our technology.\nOur success and ability to compete depend to a significant degree upon the protection of our proprietary technology. We currently have three U.S. patents that have been issued to us. We may seek additional patents in the future. However, it is possible that:\n● ﻿Any patents acquired by or issued to us may not be broad enough to protect us.\n● Any issued patent could be successfully challenged by one or more third parties, which could result in our loss of the right to prevent others from exploiting the inventions claimed in those patents.\n● Current and future competitors may independently develop similar technology, duplicate our services or design around any of our patents.\n● Effective patent protection, including effective legal-enforcement mechanisms against those who violate our patent-related assets, may not be available in every country in which we do or plan to do business.\n● We may not have the resources to enforce our patents or may determine the potential benefits are not worth the cost and risk of ultimately being unsuccessful.\nWe may not be able to innovate to meet the needs of our target markets.\nOur future success will continue to depend upon our ability to create an effective product development strategy, to develop new products, product enhancements and service offerings that address future and rapidly changing needs of our existing target markets and enable us to expand the market for our products and service offerings. Our success is also dependent upon our ability to respond to changing standards and practices on a timely basis, particularly as customers move away from hardware to software solutions. The success of new strategies, products, product enhancements and service offerings depend on several factors, including timely completion, quality and stability, and market acceptance. Our fiscal 2022 business plan includes an expectation that we begin to develop and introduce new product and service offerings in areas where we can leverage our product development skills, understanding of video technologies and strength in the higher education vertical. These offerings will likely take significant investment in key engineering, sales and management resources with little, if any, impact on fiscal 2022 revenue. While the Company believes that investment in areas where it believes there is a much greater opportunity for growth will yield significant revenue improvement in future years, there can be no assurance we will be successful due to market acceptance, correct identification of opportunity markets, speed to market, unknown competitors, stability of educational and learning needs and other relevant new product development risks.\nOur revenue could be adversely impacted if we do not capitalize on opportunities to develop innovative new products, product enhancements and service offerings that will increase the likelihood that our products and services will be accepted in preference to the products and services of our current and future competitors. Some of our prospective customers may delay the purchase of our products or services until certain features are completed, may require custom development of certain features as part of the purchase decision, or may condition additional payments tied to completion of such features. Prioritizing such custom features can be difficult to adapt to other customers and distracts our engineering team from implementing features required by other customers.\nIf potential customers or competitors use open source software to develop products that are competitive with our products and services, we may face decreased demand and pressure to reduce the prices for our products.\nThe growing acceptance and prevalence of open source software may make it easier for competitors or potential competitors to develop software applications that compete with our products, or for customers and potential customers to internally develop software applications that they would otherwise have licensed from us. One of the aspects of open source software is that it can be modified or used to develop new software that competes with proprietary software applications, such as ours. Such competition can develop without the degree of overhead and lead time required by traditional proprietary software companies. As open source offerings become more prevalent, customers may defer or forego purchases of our products, which could reduce our sales and lengthen the sales cycle for our products or result in the loss of current customers to open source solutions. If we are unable to differentiate our products from competitive products based on open source software, demand for our products and services may decline, and we may face pressure to reduce the prices of our products, which would hurt our profitability. If our use of open-source is challenged and construes unfavorably, our operating results could be adversely impacted.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nWe use open source software in our application suite. Although we monitor our use of open source software closely, the terms of many open source licenses have not been interpreted by United States courts, and there is risk that such licenses could be construed in a manner that imposes unanticipated conditions or restrictions on our ability to commercialize our products. In such event, we could be required to re-engineer our technology or to discontinue offering all or a portion of our products in the event re-engineering cannot be accomplished on a timely basis, any of which could adversely affect our business, operating results and financial condition.\nWe also rely upon trademark, copyright and trade secret laws, which may not be sufficient to protect our intellectual property.\nWe also rely on a combination of laws, such as copyright, trademark and trade secret laws and contractual restrictions, such as confidentiality agreements and licenses, to establish and protect our technology. We have registered three U.S. and four foreign country trademarks. These forms of intellectual property protection are critically important to our ability to establish and maintain our competitive position. However, it is possible that:\n●\nThird parties may infringe or misappropriate our copyrights, trademarks and similar proprietary rights.\n●\nLaws and contractual restrictions may not be sufficient to prevent misappropriation of our technology or to deter others from developing similar technologies, particularly in foreign countries where the laws may not protect our proprietary rights as fully or as readily as Unites States laws.\n●\nThere have been attacks on certain patent systems, increasing the likelihood of changes to established laws, including in the United States. We cannot predict the long-term effects of any potential changes, which could be detrimental to our licensing program.\n●\nEffective trademark, copyright and trade secret protection, including effective legal-enforcement mechanisms against those who violate our trademark, copyright or trade secret assets, may be cost prohibitive or unavailable or limited in foreign countries.\n●\nContractual agreements may not provide meaningful protection for our trade secrets, know-how or other proprietary information in the event of any unauthorized use, misappropriation or disclosure of such trade secrets, know-how or other proprietary information.\n●\nOther companies may claim common law trademark rights based upon state or foreign laws that precede the federal registration of our marks.\n●\nPolicing unauthorized use of our services and trademarks is difficult, expensive and time-consuming, and we may be unable to determine the extent of any unauthorized use.\n●\nReverse engineering, unauthorized copying or other misappropriation of our proprietary technology could enable third parties to benefit from our technology without paying us for it, which would significantly harm our business.\nIf other parties bring infringement or other claims against us, we may incur significant costs or lose customers.\nOther companies may obtain patents or other proprietary rights that would limit our ability to conduct our business and could assert that our technologies infringe their proprietary rights. We have incurred substantial costs to defend against such claims in the past and could incur legal costs in the future, even if without merit, and intellectual property litigation could force us to cease using key technology, obtain a license or redesign our products. In the course of our business, we may sell certain systems to our customers, and in connection with such sale, we may agree to indemnify these customers from claims made against them by third parties for patent infringement related to these systems, which could harm our business.\nThere is a great deal of competition in the market for our product and services, which could lower the demand for our offerings and have a negative impact on our operations.\nThe market for our products and services is intensely competitive, dynamic and subject to rapid technological change. The intensity of the competition and the pace of change are expected to increase in the future, and likely will require the Company to compete on price and our offerings more than in the past, which could adversely affect our business and operating results. Increased competition has reduced gross margins, has resulted in new customer losses and may result in loss of market share, any one of which could seriously harm our business. Competitors vary in size and in the scope and breadth of the products and services offered, many of which have greater financial resources, greater name recognition, more employees and greater financial, technical, marketing, public relations and distribution resources than we have. In addition, new competitors with greater financial resources may arise through partnerships, distribution agreements, mergers, acquisitions or other types of transactions at any time. In particular, large companies have begun to make investments in and/or partner with smaller companies to enter the lecture capture and video management markets.\nVarious vendors provide lecture capture, enterprise webcasting or video content management capabilities, but few offer an end-to-end solution that addresses all phases of the video content lifecycle (capture, delivery, transformation and management) in a single platform like Mediasite.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nLecture capture solutions designed specifically for higher education differ in their technology approach.\n●\nAppliance- or room-based lecture capture provides a fully integrated system with complete recording automation for live or on-demand content. The automated, pre-scheduled workflow results in the greatest faculty and staff adoption and largest volumes of recorded content in the shortest amount of time.\n●\nSoftware-based lecture capture that resides on a podium or computer in the classroom also captures and publishes rich media content, but relies on campus- or user-supplied hardware.\n●\nDesktop capture tools reside on individual users’ laptops or computers allowing them to record user-generated content.\nFew lecture capture vendors offer a mix of all lecture capture approaches to best suit customers’ needs. Most vendors, including Extron and Panopto, support only one approach to lecture capture. Likewise, a very small number of vendors provide an integrated platform like Mediasite to archive and manage video and rich media recorded with their solution. Most rely on a third-party platform, typically the institution’s learning or course management system, to publish, search and secure content.\nEnterprise video management solutions serve as centralized media repositories that facilitate the delivery, publishing and management of on-demand video. Unlike Mediasite, most platforms do not include a video capture, webcasting or live streaming component, but instead ingest or import video-based content captured by other third-party devices or solutions. Also, most other platforms focus on ingesting video-only content rather than rich video which combines multiple synchronous video and/or slide streams into an interactive media experience.\nSome current and potential customers develop their own home-grown lecture capture, webcasting or video content solutions which may also compete with Mediasite. However, we often find many of these organizations are now looking for a commercial solution that offers comprehensive management capabilities, requires fewer resources and internal maintenance and delivers a less cumbersome workflow.\nThe competitive environment has required us to make changes in our products, pricing, licensing, services, or marketing to maintain and extend our current technology. Price concessions or the emergence of other pricing, licensing, and distribution strategies or technology solutions of competitors has impacted revenue growth and may in the future further reduce our revenue, margins or market share. Other changes we have to make in response to competition, such as our desktop user interface or changes to address privacy concerns, could cause us to expend significant financial and other resources, disrupt our operations, strain relationships with partners, release products and enhancements before they are thoroughly tested or result in customer dissatisfaction, any of which could harm our operating results and stock price.\nIf our marketing and lead generation efforts are not successful, our business will be harmed.\nWe believe that continued marketing efforts will be critical to achieve widespread acceptance of our products. Our marketing strategies and campaigns may not be successful, and we may not be able to generate sufficient cash flow from operations to cover the expenses required to implement effective strategies and campaigns. For example, failure to adequately generate and develop qualified sales leads could cause our future revenue to decrease. In addition, our inability to generate and cultivate qualified sales leads into large organizations, or significant cost to attain and maintain leads, where there is the potential for significant use of our products, could have a material adverse effect on our business. We may not be able to identify and secure the number of strategic qualified sales leads necessary to help generate marketplace acceptance of our products. If our marketing or lead-generation efforts are not successful, our business and operating results will be harmed.\nThe length of our sales and deployment cycles are uncertain, which may cause our revenue and operating results to vary significantly from quarter to quarter and year to year.\nDuring our sales cycle, we spend considerable time and expense providing information to prospective customers about the use and benefits of our products without generating corresponding revenue. Our expense levels are relatively fixed in the short-term and based in part on our expectations of future revenue. Therefore, any delay in our sales cycle could cause significant variations in our operating results, particularly because a relatively small number of customer orders represent a large portion of our revenue.\nOur largest potential sources of revenue are educational institutions, large corporations and government entities that often require long testing and approval processes before making a decision to purchase our products, particularly when evaluating our products for inclusion in new buildings under construction, high dollar transactions or competitive bids. In general, the process of selling our products to a potential customer may involve lengthy negotiations, collaborations with consultants, designers and architects, time consuming installation processes and changes in network infrastructure in excess of what we or our VARs are able to provide. In addition, educational institutions that started with small pilots are committing to more complex installations and expanding to include undergraduate classrooms, which, due to the increased size of these types of transactions, typically require a longer sales cycle. Also, our enterprise accounts are less motivated by seasonal sales and promotions, and therefore are frequently difficult to finalize. As a result of these factors, our sales and deployment cycles are unpredictable. Our sales and deployment cycles are also subject to delays as a result of customer-specific factors over which we have little or no control, including budgetary constraints, existing infrastructure technical issues and internal approval procedures, particularly with customers or potential customers that rely on government funding.\nOur products are aimed toward a broadened user base within our key markets and these products are relatively early in their product life cycles. We cannot predict how the market for our products will develop, and part of our strategic challenge will be to convince targeted users of the productivity, improved communications and test scores, cost savings and other benefits. Accordingly, it is likely that delays in our sales cycles with these products will occur and this could cause significant variations in our operating results.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nSales of some of our products have experienced seasonal fluctuations which have affected sequential growth rates for these products, particularly in our first fiscal quarter. For example, there is generally a slowdown for sales of our products in the higher education and corporate markets in the first fiscal quarter of each year. Seasonal fluctuations could negatively affect our business, which could cause our operating results to fall short of anticipated results for such quarters. As such, we believe that quarter-to-quarter comparisons of our revenues, operating results and cash flows may not be meaningful and should not be relied upon as an indication of future performance.\nWe depend in part on the success of our relationships with third-party resellers and integrators.\nOur success depends on various third-party relationships, particularly in our non-higher education business, with certain international geographies and our events services operations. The relationships include third party resellers, as well as, system integrators that assist with implementations of our products and sourcing of our products and services. Identifying partners, negotiating and documenting relationships with them and maintaining their relationships require significant time and resources from us. In addition, our agreements with our resellers and integrators are typically non-exclusive and do not prohibit them from working with our competitors or from offering competing products or services. We have limited control, if any, as to whether these strategic partners devote adequate resources to promoting, selling and implementing our products as compared to our competitor’s products. Our competitors may be effective in providing incentives to third parties to favor their products or services. If we are unsuccessful in establishing or maintaining our relationships with these third parties, our ability to compete in the marketplace or to maintain or grow our revenue could be impaired and our operating results would suffer.\nWe may need to make acquisitions or form strategic alliances or partnerships in order to remain competitive in our market, and such acquisitions, strategic alliances or partnerships, could be difficult to integrate, disrupt our business and dilute stockholder value.\nWe completed the acquisitions of Mediasite KK in Japan and MediaMission (now Sonic Foundry International) in the Netherlands in fiscal 2014. In the future, we may acquire or form strategic alliances or partnerships with other businesses in order to remain competitive or to acquire new technologies. Acquisitions, alliances and investments involve numerous risks, including:\n●\nThe potential failure to achieve the expected benefits of the combination or acquisition;\n●\nDifficulties in and the cost of integrating operations, technologies, services and personnel;\n●\nDiversion of financial and managerial resources from existing operations;\n●\nRisk of entering new markets in which we have little or no experience or where competitors may have stronger market positions;\n●\nPotential write-offs of acquired assets or investments, and potential financial and credit risks associated with acquired customers;\n●\nPotential loss of key employees;\n●\nInability to generate sufficient revenue to offset acquisition or investment costs;\n●\nThe inability to maintain relationships with customers and partners of the acquired business;\n●\nThe difficulty of transitioning the acquired technology onto our existing platforms and maintaining the security standards consistent with our other services for such technology;\n●\nPotential unknown liabilities associated with the acquired businesses;\n●\nUnanticipated expenses related to acquired technology and its integration into existing technology;\n●\nNegative impact to our results of operations because of the depreciation and amortization of amounts related to acquired intangible assets, fixed assets and deferred compensation, and the loss of acquired deferred revenue and unbilled deferred revenue;\n●\nDelays in customer purchases due to uncertainty related to any acquisition;\n●\nThe need to implement controls, procedures and policies at the acquired company;\n●\nChallenges caused by distance, language and cultural differences;\n●\nIn the case of foreign acquisitions, the challenges associated with integrating operations across different cultures and languages and currency, technological, employee and other regulatory risks and uncertainties in the economic, social and political conditions associated with specific countries; and\n●\nThe tax effects of any such acquisitions.\nOur failure to successfully manage the acquisitions of Mediasite KK and Sonic Foundry International, or other future acquisitions, strategic alliances or partnerships could seriously harm our operating results. In addition, our stockholders would be diluted if we finance the future acquisitions, strategic alliances or partnerships by incurring convertible debt or issuing equity securities.\nCompany Risks - Compliance\nOur customers may use our products to share confidential and sensitive information, and if our system security is breached, our reputation could be harmed and we may lose customers.\nOur customers may use our products and services to share confidential and sensitive information, the security of which is critical to their business. Third parties may attempt to breach our security for customer hosted content or the networks of our customers.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nMalicious third-parties may also conduct attacks designed to temporarily deny customers access to our services. Customers may take inadequate security precautions with their sensitive information and may inadvertently make that information public. We may be liable to our customers or subject to fines for a breach in security, and any breach could harm our reputation and cause us to lose customers. In addition, customers are vulnerable to computer viruses, physical or electronic break-ins and similar disruptions, which could lead to interruptions, delays or loss of data. We may be required to expend significant capital and other resources to further protect against security breaches or to resolve problems caused by any breach, including litigation-related expenses if we are sued.\nOur business is subject to changing regulations regarding corporate governance and public disclosure that will increase both our costs and the risk of noncompliance.\nAs a publicly traded company we are subject to significant regulations, including the Sarbanes-Oxley Act of 2002. While we have developed and instituted a corporate compliance program based on what we believe are the current best practices and continue to update the program in response to newly implemented regulatory requirements and guidance, we cannot assure that we are or will be in compliance with all potentially applicable regulations. If we fail to comply with any of these regulations, we could be subject to a range of regulatory actions, fines, or other sanctions or litigation.\nThe SEC has changed the rules multiple times on which companies are required to have auditor attestations in its system of internal controls. While these more recent changes make it less likely the Company will be required to have such an attestation, the SEC may in the future require us to have such an attestation. We have found material weaknesses in our internal control over financial reporting in the past and cannot assure that in the future we will not find additional material weaknesses in connection with our internal control over financial reporting pursuant to Section 404 of the Sarbanes-Oxley Act. We also cannot assure that we could correct all such weaknesses to allow our management to attest that we have maintained effective internal controls over financial reporting as of the end of our fiscal year in time to enable our independent registered public accounting firm to attest that such assessment will have been fairly stated in our Annual Report on Form 10-K to be filed with the Securities and Exchange Commission or attest that we have maintained effective internal control over financial reporting as of the end of our fiscal year. In addition, the disclosure of any material weakness in our internal control over financial reporting could have a negative impact on our stock price.\nIndustry Risks\nEconomic conditions could materially adversely affect the Company.\nWeakness in domestic markets and global uncertainties exist in many areas of focus for us including the United Kingdom, Japan and the Middle East. In particular COVID 19 has created significant uncertainty in the world and specifically in the learning, educational, video, instructional global markets. Many of our customers rely on local, state or Federal government funding, both domestic and international. The Japanese government provides subsidies to support higher education from time to time but has not been consistent. Any future delay or elimination of government programs will have a negative impact on our operations in Japan. Any continuing unfavorable economic conditions could continue to negatively affect our business operating results or financial condition, which could in turn affect our stock price. Weak economic conditions and the resulting impact on the availability of public funds along with the possibility of state and local budget cuts and reduced university enrollment could lead to a reduction in demand for our products and services. In addition, a prolonged economic downturn could cause insolvency of key suppliers resulting in product delays, inability of customers to obtain credit to finance purchases of the Company’s products and inability or delay of our channel partners and other customers to pay accounts receivable owed to us.\nEconomic conditions may have a disproportionate effect on the sale of our product and services.\nMany of our product customers will look at the total A/V equipment and labor cost to outfit a typical conference room or lecture hall as one amount for budgetary purposes. Consequently, although our products represent only a portion of the total cost, the cost of the entire project of outfitting a room or conference hall may be considered excessive and may not survive budgetary constraints. Alternatively, our resellers may modify their quotes to end customers by eliminating our products or substituting less expensive products supplied by our competitors in order to win opportunities within budget constraints. Event service partners may similarly suggest that customers eliminate recording and webcasting as a means of reducing event cost. Consequently, declines in spending by government, educational or corporate institutions due to budgetary constraints may have a disproportionate impact on the Company and result in a material adverse impact on our financial condition. Many events are facing limited attendance or have gone completely virtual which could lead to more event cancellations.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nWe could lose revenues if there are changes in the spending policies or budget priorities for government funding of colleges, universities, schools and other education providers.\nMost of our customers and potential customers are public colleges, universities, schools and other education providers who depend substantially on government funding. Accordingly, any general decrease, delay or change in federal, state or local funding for colleges, universities, schools and other education providers could cause our current and potential customers to reduce or delay their purchases of our products and services, or to decide not to renew service contracts, either of which could cause us to lose revenues. In addition, a specific reduction in governmental funding support for products such as ours would also cause us to lose revenues. Unfavorable economic conditions may result in further budget cuts and lead to lower overall spending, including information technology spending, by our current and potential clients, which may cause our revenues to decrease.\nChanges in U.S. trade policy, including the imposition of tariffs and the resulting consequences, may have a material adverse impact on our business, operating results and financial condition.\nThe U.S. government has adopted new approaches to trade policy and in some cases to renegotiate, or potentially terminate, certain existing bilateral or multi-lateral trade agreements. It has also initiated tariffs on certain foreign goods and has raised the possibility of imposing significant, additional tariff increases or expanding the tariffs to capture other types of goods. In response, certain foreign governments have imposed retaliatory tariffs on goods that their countries import from the U.S. Changes in U.S. trade policy have resulted in one or more foreign governments, including China, adopting responsive trade policies that make it more difficult or costly for us to do business in or import our products from those countries. As a result of tariffs in China, the cost of our products has increased. Additional trade restrictions may lead to increased prices to our customers, which may reduce demand, or, if we are unable to achieve increased prices, result in lowering our margin on products sold.\nWe cannot predict the extent to which the U.S. or other countries will impose quotas, duties, tariffs, taxes or other similar restrictions upon the import or export of our products in the future, nor can we predict future trade policy or the terms of any renegotiated trade agreements and their impact on our business. The adoption and expansion of trade restrictions, the occurrence of a trade war, or other governmental action related to tariffs or trade agreements or policies has the potential to adversely impact demand for our products, our costs, our customers, our suppliers, and the U.S. economy, which in turn could have a material adverse effect on our business, operating results and financial condition.\nPrivacy concerns and laws, evolving regulation of cloud computing, cross-border data transfer restrictions and other domestic or foreign regulations may limit the use and adoption of our solutions and adversely affect our business.\nRegulation related to the provision of services on the Internet is increasing, as Federal, state and foreign governments continue to adopt new laws and regulations addressing data privacy and the collection, processing, storage and use of personal information, including health data. In some cases, foreign data privacy laws and regulations, such as the European Union’s General Data Protection Regulation that was enacted in May 2018, and an amended Act on the Protection of Personal Information in Japan, impose new obligations directly on us both as a data controller and a data processor, as well as on many of our customers. These new laws may require us to make changes to our services and/or our customers to meet the new legal requirements, and may also increase our potential liability exposure through higher potential penalties for non-compliance. Further, laws such as the European Union’s proposed e-Privacy Regulation are increasingly aimed at the use of personal information for marketing purposes, and the tracking of individuals’ online activities. These new or proposed laws and regulations are subject to differing interpretations and may be inconsistent among jurisdictions. These and other requirements could reduce demand for our services, require us to take on more onerous obligations in our contracts, restrict our ability to store, transfer and process data or, in some cases, impact our ability to offer our services in certain locations or our customers' ability to deploy our solutions globally. For example, ongoing legal challenges in Europe to the mechanisms allowing companies to transfer personal data from the European Economic Area to the United States could result in further limitations on the ability to transfer data across borders, particularly if governments are unable or unwilling to reach new or maintain existing agreements that support cross-border data transfers, such as the EU-U.S. and Swiss-U.S. Privacy Shield framework. Additionally, certain countries have passed or are considering passing laws requiring local data residency. In addition, domestic data privacy laws, such as the California Consumer Privacy Act (“CCPA”), which took effect in January 2020, continue to evolve and could expose us to further regulatory burdens. Further, laws such as the European Union’s proposed e-Privacy Regulation are increasingly aimed at the use of personal information for marketing purposes, and the tracking of individuals’ online activities. The costs of compliance with, and other burdens imposed by, privacy laws, regulations and standards may limit the use and adoption of our services, reduce overall demand for our services, make it more difficult to meet expectations from or commitments to customers, lead to significant fines, penalties or liabilities for noncompliance, or slow the pace at which we close sales transactions, any of which could harm our business.\nWe likely will need to acquire software and hardware in order to enhance our ability to defend and to detect intrusions to our network infrastructure and may need to seek certifications we currently do not have such as SOC2, ISO 27001 or both. These enhancements will be expensive and require significant staff time to deploy and develop. These risks are mitigated, to the extent possible, by our ability to maintain and improve business and data governance policies, enhanced processes and internal security controls, including our ability to escalate and respond to known and potential risks. Our executive management are regularly briefed on our cyber-security policies and practices and ongoing efforts to improve security, as well as periodic updates on cyber-security events. In addition, we update our Audit Committee at least annually regarding our processes for evaluating and mitigating risks including cyber related risks. Although we have developed systems and processes designed to protect our customers’ and our customers’ customers’ proprietary and other sensitive data, we can provide no assurances that such measures will be effective.\nIn addition to government activity, privacy advocacy and other industry groups have established, or may establish, new self-regulatory standards that may place additional burdens on us. Many of our customers in the European Union face increasingly complex procurement requirements that have delayed some projects and caused us not to be successful in winning other opportunities. If we are unable to maintain these certifications or meet these standards, it could adversely affect our ability to provide our solutions to certain customers and could harm our business.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nOur customers and potential customers do business in a variety of industries, including financial services, the public sector, healthcare and telecommunications. Regulators in certain industries have adopted and may in the future adopt regulations or interpretive positions regarding the use of cloud computing and other outsourced services. The costs of compliance with, and other burdens imposed by, industry-specific laws, regulations and interpretive positions may limit customers’ use and adoption of our services and reduce overall demand for our services.\nThe costs of compliance with, and other burdens imposed by laws, regulations and standards, may limit the use and adoption of our service and reduce overall demand for it, or lead to significant fines, penalties or liabilities for any noncompliance.\nFurthermore, concerns regarding data privacy may cause the users of our customers’ data to resist providing the data necessary to allow our customers to use our service effectively. Even the perception that the privacy of personal information is not satisfactorily protected or does not meet regulatory requirements could inhibit sales of our products or services, and could limit adoption of our cloud-based solutions.\nWe face risks associated with government regulation of the internet and related legal uncertainties.\nCurrently, few existing laws or regulations specifically apply to the Internet, other than laws generally applicable to businesses. Many Internet-related laws and regulations, however, are pending and may be adopted in the United States, in individual states and local jurisdictions and in other countries. These laws may relate to many areas that impact our business, including encryption, network and information security, and the convergence of traditional communication services, such as telephone services, with Internet communications, taxes and wireless networks. These types of regulations could differ between countries and other political and geographic divisions both inside and outside the United States. Non-U.S. countries and political organizations may impose, or favor, more and different regulation than that which has been proposed in the United States, thus furthering the complexity of regulation. Certain countries have implemented, or may implement, legislative and technological actions that either do or can effectively regulate access to the Internet, including the ability of Internet Service Providers to limit access to specific websites or content. In addition, state and local governments within the United States may impose regulations in addition to, inconsistent with, or stricter than federal regulations. The adoption of such laws or regulations, and uncertainties associated with their validity, interpretation, applicability and enforcement, may affect the available distribution channels for, and the costs associated with, our products and services. The adoption of such laws and regulations may harm our business.\nInvestor Risks\nThe market price of our common stock may be subject to volatility.\nIn the past and through 2021, the trading prices of the securities of technology companies have been more volatile than the broader market. Factors affecting the market price of our common stock include:\n●\nVariations in our operating results, earnings per share, cash flows from operating activities, deferred revenue and other financial metrics and non-financial metrics, and how those results compare to investor expectations;\n●\nOur announcement of actual results for a fiscal period that are higher or lower than expected results;\n●\nChanges in the estimates of our operating results or changes in recommendations by securities analysts that elect to follow our common stock;\n●\nAnnouncements of technological innovations, new services or service enhancements, strategic alliances or significant agreements by us or by our competitors;\n●\nAnnouncements by us or by our competitors of mergers or other strategic acquisitions, or rumors of such transactions involving us or our competitors;\n●\nAnnouncements of customer additions and customer cancellations or delays in customer purchases;\n●\nRecruitment or departure of key personnel;\n●\nDisruptions in our service due to computer hardware, software, network or data center problems;\n●\nThe economy, market conditions in our industry and the industries of our customers;\n●\nThe issuance of shares of common stock and preferred stock by us, whether in connection with an acquisition or a capital raising transaction;\n●\nLow trading volumes of our shares and inconsistent trading activity;\n●\nIssuance of debt, changes to, defaults or non-renewal of debt facilities and other convertible securities;\n●\nFailure to meet Nasdaq Exchange or OTC market requirements; and\n●\nAny other factors discussed herein.\n●\nIn addition, if the market for technology stocks or the stock market in general experiences uneven investor confidence, the market price of our common stock could decline for reasons unrelated to our business, operating results or financial condition. The market price of our common stock might also decline in reaction to events that affect other companies within, or outside, our industry even if these events do not directly affect us.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nOur common stock is subject to low trading volume and broad price swings.\nOur common stock is currently quoted on the OTC Market (“OTC Pink Sheets”) administered by the Financial Industry Regulatory Authority under the symbol “SOFO” since February 18, 2019. Prior to that, our common stock was traded on the OTCQB since December 31, 2018 and before that, the NASDAQ exchange under the same symbol. Trading of our stock on the OTC Pink Sheets has often been subject to very low volumes, broad price swings and often with no Company news. We applied for listing on the Nasdaq Capital Market in March 2021 are continuing to respond to questions of the NASDAQ listing qualifications team. There can be no assurance we are ultimately approved for listing on the NASDAQ Capital market.\nExercise of outstanding options and warrants will result in further dilution.\nThe issuance of shares of common stock upon the exercise of our outstanding options and warrants will result in dilution to the interests of our stockholders, and may reduce the trading price of our common stock.\nAt September 30, 2021, we had 440 thousand outstanding warrants and 1.9 million of outstanding stock options granted under our stock option plans, 1.3 million of which are immediately exercisable.\nWhile a substantial portion of our outstanding warrants and options are currently priced above the market price of our common stock, dilution to the interests of our stockholders will likely occur if or when they are exercised. Additional options and warrants may be issued in the future at prices not less than 85% of the fair market value of the underlying security on the date of grant. Exercises of these options, or even the potential of their exercise may have an adverse effect on the trading price of our common stock. The holders of our options are likely to exercise them at times when the market price of the common stock exceeds the exercise price of the securities. Accordingly, the issuance of shares of common stock upon exercise of the options will likely result in dilution of the equity represented by the then outstanding shares of common stock held by other stockholders. Holders of our options can be expected to exercise or convert them at a time when we would, in all likelihood, be able to obtain any needed capital on terms, which are more favorable to us than the exercise terms provided, by these options.\nProvisions of our charter documents and Maryland law could also discourage an acquisition of our Company that would benefit our stockholders and, due to our insiders control of a substantial percentage of our stock, our officers, directors, and major stockholders will have a substantial amount of control over whether to approve or disapprove of a transaction.\nProvisions of our articles of incorporation and by-laws may make it more difficult for a third party to acquire control of our company, even if a change in control would benefit our stockholders. Our articles of incorporation authorize our board of directors, without stockholder approval, to issue one or more series of preferred stock, which could have voting and conversion rights that adversely affect or dilute the voting power of the holders of common stock. Furthermore, our articles of incorporation provide for a classified board of directors, which means that our stockholders may vote upon the retention of only one or two of our five directors each year. Moreover, Maryland corporate law restricts certain business combination transactions with “interested stockholders” and limits voting rights upon certain acquisitions of “control shares.” In addition, even when there are no interested stockholders involved in a transaction, Maryland law requires that a transaction involving a merger, consolidation, transfer of assets, or share exchange, must be approved by the affirmative vote of at least two-thirds of the Company’s stockholders.\nOur executive officers and directors together beneficially own, on an “as converted basis”, approximately 45% of our outstanding common stock, and Mr. Burish, individually, owns approximately 40% on an as converted basis. As a result, these stockholders, if they act together or in a block, or individually in the case of Mr. Burish, could have significant influence over most matters that require approval by our stockholders, including the approval of significant corporate transactions, even if other stockholders oppose them. In addition, under federal law, in many circumstances a company such as Sonic Foundry is not required to disclose that negotiations relating to a merger or to a sale of its stock or assets are occurring until a material definitive agreement has been reached. Concentration of ownership as described here might also have the effect of delaying or preventing a change of control of our Company that other stockholders may view as beneficial.",
    "item_1B": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item_2": "ITEM 2. PROPERTIES\nOur principal office is located in Madison, Wisconsin in a leased facility of approximately 26,000 square feet. The building serves as our corporate headquarters, accommodating our general and administrative, product development and selling and marketing departments. We believe this facility is adequate for our needs. The current lease term for this office expires on December 31, 2021, and the renewed lease term expires on June 30, 2024. The rent for the remainder of the current lease period is approximately $60 thousand per month, and $56 thousand, $58 thousand, and $60 thousand for the calendar years of 2022, 2023, and January to June 2024, respectively.\nOur operations in Japan are managed in Tokyo, Japan in a leased facility of approximately 9,874 square feet with a term expiring on December 31, 2021. Effective January 1, 2022, the operations will move to a new leased facility of 7,870 square feet which will expire on December 31, 2023. The facility includes sales, technical and administrative functions. The rent through December 31, 2021 is approximately $48 thousand per month. Beginning on January 1, 2022, the monthly rent will decrease to approximately $33 thousand per month.\nOur European operations are managed in Utrecht, Netherlands in a leased facility of approximately 3,886 square feet with a term expiring on January 31, 2022, which is expected to be extended for one year with an option to extend for one additional year. The facility includes sales, technical and administrative functions. The rent for the remainder of the lease period is approximately $6 thousand per month.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021",
    "item_3": "ITEM 3. LEGAL PROCEEDINGS\nNone.",
    "item_4": "ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nPART II",
    "item_5": "ITEM 5. MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS, AND ISSUER PURCHASES OF EQUITY SECURITIES\nPrice Range of Common Stock\nOur common stock was initially traded on the American Stock Exchange under the symbol “SFO,” beginning with our initial public offering in April of 1998. On April 24, 2000, our common stock began trading on the NASDAQ Global Market under the symbol “SOFO.” Effective September 16, 2009, we transferred the listing of our common stock to the NASDAQ Capital Market. Effective December 31, 2018, we transferred the listing of our common stock to the OTCQB Market under the symbol \"SOFO\". Effective February 18, 2019, we transferred the listing of our common stock to the OTC Pink Sheets under the symbol \"SOFO\". The following table sets forth, for the periods indicated, the high and low sale prices per share of our common stock as reported on the OTC Pink Sheets.\nHigh\nLow\nYear Ended September 30, 2022:\nFirst Quarter (through November 12, 2021)\n3.81\n3.74\nYear Ended September 30, 2021:\nFirst Quarter\n3.26\n3.09\nSecond Quarter\n4.28\n4.18\nThird Quarter\n5.10\n4.61\nFourth Quarter\n3.88\n3.60\nYear Ended September 30, 2020:\nFirst Quarter\n1.40\n0.92\nSecond Quarter\n3.95\n1.28\nThird Quarter\n5.23\n2.00\nFourth Quarter\n4.96\n3.07\nDividends\nThe Company has not paid any cash dividends and does not intend to pay any cash dividends in the foreseeable future. The Company is prohibited from paying any cash dividends pursuant to the terms of the loan and security agreement with U.S. Bank National Association.\nConversion of Related-Party Debt to Equity\nOn March 5, 2020, the Company announced that its special committee of disinterested and independent directors retained Silverwood Partners LLC, an investment banking firm specializing in digital media technology, to evaluate strategic alternatives for the Company.\nOn April 8, 2020, the company received an offer from Mr. Mark Burish, the current Chairman of the Board, to purchase all outstanding shares of the Company’s common stock not presently held by Mr. Burish for $5.00 per share. After concluding no other strategic alternatives existed for the Company at that time, the Company announced on April 27, 2020 that its special committee of disinterested and independent directors had accepted the offer from Mr. Burish.\nShortly following the announcement, however, a number of shareholders advised they were opposed to the transaction and felt opportunities available to the company now, in view of the video-first, distance learning environment resulting from the COVID crisis, may provide pathways to achieve greater value. Concerned that a proposal would not obtain the required shareholder approval, the company and Mr. Burish agreed to not pursue the transaction at that time, and instead, continue to pursue other strategic alternatives to enhance both Company and shareholder value, improve the Company’s financial position, and provide the Company with resources to further its growth opportunities.\nOn May 14, 2020, the Company announced it had agreed to convert $5.6 million of existing secured debt to Mr. Burish into 1,114,723 shares of its common stock at $5.00 per share. The transaction was recommended by the Company’s special committee of disinterested and independent directors and unanimously approved by all disinterested directors of the Company. Silverwood Partners LLC issued a fairness opinion in connection with the transaction.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nThe Company relied on Section 4(a)(2) of the Securities Act of 1933, as amended, to issue the Promissory Notes and stock, inasmuch as the director and the affiliated party both received from the Company information that registration would provide and neither the Company nor any person acting on its behalf offered or sold the Notes or stock by any form of general solicitation or general advertising.\nHolders\nAt November 22, 2021, there were 211 common stockholders of record and approximately 2,800 total shareholders. Many shares are held by brokers and other institutions on behalf of shareholders.\nEquity Compensation Plan Information\nNumber of\nNumber of securities\nWeighted average\nsecurities\nto be issued upon\nexercise price of\nremaining\nexercise of\noutstanding\navailable for\nPlan category\noutstanding options\noptions\nfuture issuance\nEquity compensation plans approved by security holders (1)\n1,853,479\n$ 4.44\n1,634,960\nTotal\n1,853,479\n$ 4.44\n1,634,960\n(1)\nConsists of the 2009 Stock Incentive Plan, the 2020 Equity Incentive Stock Option Plan and the 2008 Non-Employee Directors Stock Option Plan. For further information regarding these plans, reference is made to Note 5 of the financial statements.",
    "item_6": "ITEM 6. SELECTED CONSOLIDATED FINANCIAL DATA\nThe selected financial and operating data were derived from our consolidated financial statements. The selected financial data set forth below is qualified in its entirety by, and should be read in conjunction with, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and our financial statements and notes thereto appearing elsewhere in this annual report on Form 10-K (in thousands except per share data).\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nYears Ended September 30,\nStatement of Operations Data:\nRevenue\n$ 35,167\n$ 34,753\n$ 34,781\n$ 34,544\n$ 36,000\nCost of revenue\n10,294\n9,634\n9,280\n9,656\n9,867\nGross margin\n24,873\n25,119\n25,501\n24,888\n26,133\nOperating expenses\n24,066\n24,383\n28,009\n29,118\n30,091\nImpairment of goodwill & intangible assets\n-\n-\n-\n11,809\nIncome (loss) from operations\n(2,508 )\n(16,039 )\n(4,558 )\nOther income (expense), net\n(109 )\n(117 )\n(65 )\nGain on debt forgiveness\n2,325\n-\n-\n-\n-\nInterest expense, net\n(44 )\n(658 )\n(897 )\n(601 )\n(495 )\nBenefit (provision) for income taxes\n(15 )\n(148 )\n(90 )\n4,332\nNet income (loss)\n$ 3,077\n$ (179 )\n$ (3,612 )\n$ (12,166 )\n$ (5,039 )\nDividends on preferred stock\n$ -\n$ -\n$ (122 )\n$ (257 )\n$ (169 )\nNet income (loss) attributable to common shareholders\n$ 3,077\n$ (179 )\n$ (3,734 )\n$ (12,423 )\n$ (5,208 )\nBasic net income (loss) per common share\n$ 0.37\n$ (0.02 )\n$ (0.64 )\n$ (2.67 )\n$ (1.17 )\nDiluted net income (loss) per common share\n$ 0.36\n$ (0.02 )\n$ (0.64 )\n$ (2.67 )\n$ (1.17 )\nWeighted average common shares:\n- Basic\n8,230,100\n7,216,135\n5,833,301\n4,655,520\n4,436,333\n- Diluted\n8,650,384\n7,216,135\n5,833,301\n4,655,520\n4,436,333\nBalance Sheet Data at September 30:\nCash and cash equivalents\n$ 9,989\n$ 7,619\n$ 4,295\n$ 1,189\n$ 1,211\nWorking capital (deficit)\n3,389\n(1,488 )\n(847 )\n(5,765 )\n(4,833 )\nTotal assets\n24,015\n22,629\n15,180\n13,583\n28,356\nLong-term liabilities\n3,859\n5,373\n7,602\n3,451\n8,147\nStockholders’ equity (deficit)\n6,140\n(1,048 )\n(6,253 )\n(6,458 )\n3,118",
    "item_7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe financial and business analysis below provides information that Sonic Foundry, Inc. (the “Company”) believes is relevant to an assessment and understanding of the Company’s consolidated financial position and results of operations. This financial and business analysis should be read in conjunction with the consolidated financial statements and related notes.\nThis report includes estimates, projections, statements relating to our business plans, objectives, and expected operating results that are “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements may appear throughout this report, including the following sections: “Management’s Discussion and Analysis,” and “Risk Factors.” These forward-looking statements generally are identified by the words “believe,” “project,” “expect,” “anticipate,” “estimate,” “intend,” “strategy,” “future,” “opportunity,” “plan,” “may,” “should,” “will,” “would,” “will be,” “will continue,” “will likely result,” and similar expressions. Forward-looking statements are based on current expectations and assumptions that are subject to risks and uncertainties that may cause actual results to differ materially. We describe risks and uncertainties that could cause actual results and events to differ materially in “Risk Factors” (Part 1, Item 1A of this Form 10-K), “Quantitative and Qualitative Disclosures about Market Risk” (Part II,",
    "item_7A": "ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nDerivative Financial Instruments\nPursuant to Item 305 of Regulation S-K, the Company, as a smaller reporting company, is not required to provide the information required by this item.\nInterest Rate Risk\nOur cash equivalents, which consist of overnight money market funds, are subject to interest rate fluctuations, however, we believe this risk is minimal due to the short-term nature of these investments.\nAt September 30, 2021, the Company didn't carry outstanding debt with variable rate, therefore an increase in the level of interest rates would not have a material impact on our Consolidated Financial Statements. We monitor our positions with, and the credit quality of, the financial institutions that are party to any of our financial transactions.\nForeign Currency Exchange Rate Risk\nThe functional currency of our foreign subsidiaries in the Netherlands is the Euro and in Japan is the Japanese Yen. They are subject to foreign currency exchange rate risk. Any increase or decrease in the exchange rate of the U.S. Dollar compared to the Euro or Japanese Yen will impact our future operating results and financial position.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021",
    "item_8": "ITEM 8. CONSOLIDATED FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders, Audit Committee and Board of Directors\nSonic Foundry, Inc. and Subsidiaries\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Sonic Foundry, Inc. and Subsidiaries (the “Company”) as of September 30, 2021 and 2020, and the related statements of operations, comprehensive income (loss), stockholders’ equity (deficit), and cash flows for the years ended September 30, 2021 and 2020, and the related notes (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material aspects, the financial position of the Company at September 30, 2021 and 2020 and the results of its operations and its cash flows for the years ended September 30, 2021 and 2020, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and the significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgements. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matter or on the accounts or disclosure to which it relates.\nRevenue Recognition - Evaluation of the allocation of the transaction price to distinct performance obligations\nAs described in Note 1 to the consolidated financial statements, the Company’s contracts with customers often include multiple distinct performance obligations, including hardware products, software licenses, hosting arrangements, maintenance services, events and other professional services. The accounting for contracts with multiple performance obligations requires the contract’s transaction price to be allocated to each distinct performance obligation based on relative stand-alone selling price (SSP). Because the Company rarely sells its products and services on a standalone basis, significant judgement is required to determine SSP for each distinct performance obligation. We identified the determination of the SSP of performance obligations as a critical audit matter.\nThe primary audit procedures we performed to address this critical audit matter included:\n●\nWe evaluated the appropriateness of the Company’s methodology to identify performance obligations with contracts and allocate the transaction price based on each performance obligation’s relative SSP.\n●\nWe tested the completeness and accuracy of the data used by the Company to calculate each performance obligation’s SSP. We recalculated and validated the pricing inputs used by the Company in the calculation.\n●\nWe selected a sample of revenue transactions and performed the following procedures to test the Company’s application of allocating the transaction price to each distinct performance obligation based on its relative SSP:\n■\nObtained and read contract source documents to assess that all performance obligations were appropriately identified.\n■ Compared the SSP indicated by the Company’s analysis to each performance obligation within the selected contract to ensure it agreed. We then recalculated the Company’s allocation of relative SSP to each of the performance obligations.\n/s/ Wipfli LLP\nWe have served as the Company’s auditor since 2019.\nMinneapolis, Minnesota\nDecember 9, 2021\nSonic Foundry, Inc.\nConsolidated Balance Sheets\n(in thousands, except for share and per share data)\nSeptember 30,\nAssets\nCurrent assets:\nCash and cash equivalents\n$ 9,989 $ 7,619\nAccounts receivable, net of allowances of $261 and $236\n5,167 6,250\nInventories, net\n442 1,167\nInvestment in sales-type lease, current\n294 275\nCapitalized commissions, current\n360 440\nPrepaid expenses and other current assets\n1,153 1,065\nTotal current assets\n17,405 16,816\nProperty and equipment:\nLeasehold improvements\n1,111 1,128\nComputer equipment\n8,527 7,960\nFurniture and fixtures\n1,528 1,366\nTotal property and equipment\n11,166 10,454\nLess accumulated depreciation and amortization\n8,368 7,295\nProperty and equipment, net\n2,798 3,159\nOther assets:\nInvestment in sales-type lease, long-term\n490 76\nCapitalized commissions, long-term\n76 100\nRight-of-use assets under operating leases\n2,441 2,081\nOther long-term assets\n805 397\nTotal assets\n$ 24,015 $ 22,629\nLiabilities and stockholders’ equity (deficit)\nCurrent liabilities:\nAccounts payable\n1,072 2,689\nAccrued liabilities\n2,522 2,565\nCurrent portion of unearned revenue\n9,413 10,678\nCurrent portion of finance lease obligations\n79 119\nCurrent portion of operating lease obligations\n930 1,425\nCurrent portion of notes payable and warrant debt, net of discounts\n- 1,104\nTotal current liabilities\n14,016 18,580\nLong-term portion of unearned revenue\n1,614 1,460\nLong-term portion of finance lease obligations\n26 89\nLong-term portion of operating lease obligations\n1,583 665\nLong-term portion of notes payable and warrant debt, net of discounts\n556 2,673\nDerivative liability, at fair value\n53 66\nOther liabilities\n27 144\nTotal liabilities\n17,875 23,677\nCommitments and contingencies\nStockholders’ equity (deficit):\nPreferred stock, $.01 par value, authorized 500,000 shares; none issued\n- -\n9% Preferred stock, Series A, voting, cumulative, convertible, $.01 par value (liquidation preference of $1,000 per share), authorized 4,500 shares; zero shares issued and outstanding, at amounts paid in\n- -\n5% Preferred stock, Series B, voting, cumulative, convertible, $.01 par value (liquidation preference at par), authorized 1,000,000 shares, none issued\n- -\nCommon stock, $.01 par value, authorized 15,000,000 shares; 9,064,821 and 7,965,325 shares issued and 9,052,105 and 7,952,609 shares outstanding\n91 80\nAdditional paid-in capital\n213,278 209,022\nAccumulated deficit\n(206,442 ) (209,519 )\nAccumulated other comprehensive loss\n(618 ) (462 )\nTreasury stock, at cost, 12,716 shares\n(169 ) (169 )\nTotal stockholders’ equity (deficit)\n6,140 (1,048 )\nTotal liabilities and stockholders’ equity (deficit)\n$ 24,015 $ 22,629\nSee accompanying notes to the consolidated financial statements.\nSonic Foundry, Inc.\nConsolidated Statements of Operations\n(in thousands, except for share and per share data)\nYears Ended September 30,\nRevenue:\nProduct and other\n$ 10,473\n$ 10,339\nServices\n24,694\n24,414\nTotal revenue\n35,167\n34,753\nCost of revenue:\nProduct and other\n4,042\n4,430\nServices\n6,252\n5,204\nTotal cost of revenue\n10,294\n9,634\nGross margin\n24,873\n25,119\nOperating expenses:\nSelling and marketing\n11,970\n13,025\nGeneral and administrative\n4,870\n5,055\nProduct development\n7,226\n6,303\nTotal operating expenses\n24,066\n24,383\nIncome from operations\nNon-operating income (expenses):\nInterest expense, net\n(44 )\n(658 )\nGain on debt forgiveness\n2,325\n-\nOther income (expense), net\n(109 )\nTotal non-operating income (expense)\n2,285\n(767 )\nIncome (loss) before income taxes\n3,092\n(31 )\nIncome tax benefit (expense)\n(15 )\n(148 )\nNet income (loss)\n$ 3,077\n$ (179 )\nDividends on preferred stock\n-\n-\nNet income (loss) attributable to common stockholders\n$ 3,077\n$ (179 )\nIncome (Loss) per common share:\nBasic net income (loss) per common share\n$ 0.37\n$ (0.02 )\nDiluted net income (loss) per common share\n$ 0.36\n$ (0.02 )\nWeighted average common shares - Basic\n8,230,100\n7,216,135\n- Diluted\n8,650,384\n7,216,135\nSee accompanying notes to the consolidated financial statements.\nSonic Foundry, Inc.\nConsolidated Statements of Comprehensive Income (Loss)\n(in thousands)\nYears Ended September 30,\nNet income (loss)\n$ 3,077\n$ (179 )\nOther comprehensive loss\nForeign currency translation adjustment\n(156 )\nComprehensive income (loss)\n$ 2,921\n$ (95 )\nSee accompanying notes to the consolidated financial statements.\nSonic Foundry, Inc.\nConsolidated Statements of Stockholders’ Equity (Deficit)\n(in thousands)\nAccumulated\nAdditional\nother\nPreferred\nCommon\npaid-in\nAccumulated\ncomprehensive\nTreasury\nstock\nstock\ncapital\ndeficit\nloss\nstock\nTotal\nBalance, September 30, 2019\n$ -\n$\n$ 203,735\n$ (209,340 )\n$ (546 )\n$ (169 )\n$ (6,253 )\nStock compensation\n-\n-\n-\n-\n-\nIssuance of common stock and warrants\n-\n-\n-\n-\nCommon stock issued for extinguishment of related-party debt\n-\n4,994\n-\n-\n-\n5,005\nForeign currency translation adjustment\n-\n-\n-\n-\n-\nNet loss\n-\n-\n-\n(179 )\n-\n-\n(179 )\nBalance, September 30, 2020\n-\n209,022\n(209,519 )\n(462 )\n(169 )\n(1,048 )\nStock compensation\n-\n-\n-\n-\n-\nIssuance of common stock and warrants\n-\n3,769\n-\n-\n-\n3,780\nForeign currency translation adjustment\n-\n-\n-\n-\n(156 )\n-\n(156 )\nNet income\n-\n-\n-\n3,077\n-\n-\n3,077\nBalance, September 30, 2021\n-\n213,278\n(206,442 )\n(618 )\n(169 )\n6,140\nSee accompanying notes to the consolidated financial statements.\nSonic Foundry, Inc.\nConsolidated Statements of Cash Flows\n(in thousands)\nYears Ended\nSeptember 30,\nOperating activities\nNet Income (Loss)\n$ 3,077\n$ (179 )\nAdjustments to reconcile net loss to net cash provided by (used in) operating activities:\nAmortization of other intangibles\nDepreciation and amortization of property and equipment\n1,263\nLoss on sale of fixed assets\n-\nProvision for doubtful accounts\n(Recovery of ) Provision for inventory reserve\n(16 )\nLoss on extinguishment of related party debt for equity\n-\nStock-based compensation expense related to stock options\nStock issued for board of director's fees\nDeferred loan interest to related party\n-\nRemeasurement (gain) loss on derivative liability\n(13 )\nGain on debt forgiveness\n(2,325 )\n-\nChanges in operating assets and liabilities:\nAccounts receivable\nInventories\n(729 )\nInvestment in sales-type lease\n(452 )\n(48 )\nCapitalized commissions\nPrepaid expenses and other current assets\n(121 )\n(57 )\nRight-of-use assets under operating leases\n(387 )\nOperating lease obligations\n(528 )\nOther long-term assets\n(438 )\n-\nAccounts payable and accrued liabilities\n(989 )\n1,503\nOther long-term liabilities\n(110 )\n(2 )\nUnearned revenue\n(1,015 )\nNet cash provided by (used in) operating activities\n1,246\n3,341\nInvesting activities\nPurchases of property and equipment\n(1,482 )\n(1,736 )\nNet cash used in investing activities\n(1,482 )\n(1,736 )\nFinancing activities\nProceeds from notes payable\n-\n3,157\nPayments on notes payable\n(935 )\n(1,358 )\nProceeds from issuance of common stock\n3,710\nPayments on capital lease and financing arrangements\n(120 )\n(202 )\nNet cash provided by financing activities\n2,655\n1,670\nChanges in cash and cash equivalents due to changes in foreign currency\n(49 )\nNet increase in cash and cash equivalents\n2,370\n3,324\nCash and cash equivalents at beginning of year\n7,619\n4,295\nCash and cash equivalents at end of year\n$ 9,989\n$ 7,619\nSupplemental cash flow information:\nSonic Foundry, Inc.\nConsolidated Statements of Cash Flows\n(in thousands)\nInterest paid\n$\n$\nIncome taxes paid, foreign\nNon-cash financing and investing activities:\nProperty and equipment financed by finance lease or accounts payable\nCommon stock issued for extinguishment of related party debt\n-\n5,005\nSee accompanying notes to the consolidated financial statements.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\n1. Basis of Presentation and Significant Accounting Policies\nBusiness\nSonic Foundry, Inc. (the Company) is in the business of providing video enterprise solutions and services for the digital-first, distance learning and corporate communications market.\nPrinciples of Consolidation\nThe accompanying consolidated financial statements include the accounts of the Company and its wholly-owned subsidiaries, Sonic Foundry Media Systems, Inc., Sonic Foundry International B.V. (formerly Media Mission B.V.) and Mediasite K.K. All significant intercompany transactions and balances have been eliminated. Certain prior year amounts have been reclassified to conform with current year presentation.\nUse of Estimates\nIn preparing financial statements in conformity with accounting principles generally accepted in the United States of America (US GAAP), management is required to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenue and expense during the period. Actual results could differ from those estimates.\nAssets Recognized from the Costs to Obtain a Contract with a Customer\nSales commissions and related expenses are considered incremental and recoverable costs of acquiring customer contracts. These costs are capitalized and amortized on a straight-line basis over the anticipated period of benefit, which we have determined to be the contract period, typically around 12 months. Assets recorded are included in current assets and other long-term assets. Amortization expense is recorded in sales and marketing expense within our consolidated statement of operations. We calculate a quarterly average percentage based on actual commissions incurred on billings during the same period and apply that percentage to the respective periods’ unearned revenues to determine the capitalized commission amount.\nRevenue Recognition\nWe generate revenues in the form of hardware sales of our Mediasite recorder and Mediasite related products, such as our server software and other software licenses and related customer support and services fees, including hosting, installations and training, and events services. Software license revenues include fees from sales of perpetual and term licenses. Maintenance and services revenues primarily consist of fees for maintenance services (including support and unspecified upgrades and enhancements when and if they are available), hosting, installation, training and other professional services.\nInvoices are billed when a customer contract, purchase order or signed quote is obtained from the customer. No revenue is recognized prior to such a customer authorization. In some renewal circumstances, we continue to provide services, typically customer support, during the period when our sales team is working to obtain a customer authorization to avoid customer attrition. Typically, we would bill for this period such that the customer support contract does not lapse. Consistent with historical company practices, we would recognize revenue for the periods where services have already been rendered once customer authorization has occurred.\nProducts\nProducts are considered delivered, and revenue is recognized, when title and risk of loss have been transferred to the customer or upon customer acceptance if non-delivered products or services are essential to the functionality of delivered products. Under the terms and conditions of the sale, this occurs at the time of shipment to the customer. Product revenue currently represents sales of our Mediasite recorder and Mediasite related products such as our server software and other software licenses.\nServices\nThe Company sells support and content hosting contracts to our customers, typically one year in length, and records the related revenue ratably over the contractual period. Our support contracts cover phone and electronic technical support availability over and above the level provided by our dealers, software upgrades on a when-and-if-available basis, advance hardware replacement and an extension of the standard hardware warranty from 90 days to one year. The manufacturers the Company contracts with to build the units provide a limited one-year warranty on the hardware. The Company also sells installation, training, event webcasting, and customer content hosting services. Revenue for those services is recognized when performed in the case of installation, training and event webcasting services. Occasionally, the Company will sell customization services to enhance the server software. Revenue from those services is recognized when performed, if perfunctory, or under contract accounting. Service amounts invoiced to customers in excess of revenue recognized are recorded as deferred revenue until the revenue recognition criteria are met.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nRevenue Recognition\nIn accordance with ASC Topic 606, Revenue from Contracts with Customers (\"ASC 606\"), revenues are recognized when control of the promised goods or services is transferred to our customers, in an amount that reflects the consideration to which we expect to be entitled in exchange for those goods and services. To achieve this core principle, we apply the following five steps:\n1.\nIdentify the contract with a customer. A contract with a customer exists when: (1) we and the customer have approved the contract and both parties are committed to perform their respective obligations; (2) we can identify each party’s rights regarding the products or services to be transferred; (3) we can identify the payment terms for the products or services to be transferred; (4) the contract has commercial substance as our future cash flows are expected to change; and (5) it is probable that we will collect substantially all of the consideration to which we are entitled in exchange for the products or services. Any subsequent contract modifications are analyzed to determine the treatment of the contract modification as a separate contract, prospectively or through a cumulative catch-up adjustment.\n2.\nIdentify the performance obligations in the contract. Performance obligations are promises to transfer a good or service to the customer. Performance obligations may be each individual promise in a contract, or may be groups of promises within a contract that significantly affect one another. To the extent a contract includes multiple promises, we must apply judgment to determine whether promises are capable of being distinct and distinct in the context of the contract. If these criteria are not met, the promises are accounted for as a combined performance obligation.\n3.\nDetermine the transaction price. The transaction price is the total amount of consideration to which we expect to be entitled in exchange for transferring promised products and services to a customer.\n4.\nAllocate the transaction price to performance obligations in the contract. The allocation of the transaction price to performance obligations is generally done in proportion to their standalone selling prices (“SSP”). SSP is the price that we would sell a distinct product or service separately to a customer and is determined at contract inception. If SSP is not available through the analysis of observable inputs, this step is subject to significant judgment and additional analysis so that we can establish an estimated SSP. The estimated SSP considers historical information, including demand, trends and information about the customer or class of customers.\n5.\nRecognize revenues when or as the company satisfies a performance obligation. We recognize revenues when, or as, distinct performance obligations are satisfied by transferring control of the product or service to the customer. A performance obligation is considered transferred when the customer obtains control of the product or service. Transfer of control is typically evaluated from the customer's perspective. At contract inception, we determine whether we satisfy the performance obligation over time or at a point in time. Revenue is recognized when performance obligations are satisfied.\nOur contract payment terms are typically net 30 days. We assess collectability based on a number of factors including collection history and creditworthiness of the customer, and we may mitigate exposures to credit risk by requiring payments in advance. If we determine that collectability related to a contract is not probable, we may not record revenue until collectability becomes probable later.\nOur revenues are recorded based on the transaction price excluding amounts collected on behalf of third parties such as sales taxes, which are collected on behalf of and remitted to governmental authorities.\nNature of Products and Services\nCertain software licenses are sold either on-premise or through term-based hosting agreements. These hosting arrangements provide customers with the same product functionality and differ mainly in the duration over which the customer benefits from the software. We deliver our software licenses electronically. Electronic delivery occurs when we provide the customer with access to the software and license key via a secure portal. Revenue from on-premise software licenses is generally recognized upfront at the point in time when the software is made available to the customer. Revenue from term-based hosted licenses are recognized ratably over the term of the agreement.\nOur contracts with customers for on-premise and hosted software licenses include maintenance services and may also include training and/or professional services. Maintenance services agreements consist of fees for providing software updates on an if and when available basis and for providing technical support for software products for a specified term. We believe that our software updates and technical support each have the same pattern of transfer to the customer and are substantially the same. Therefore, we consider these updates and technical support to be a single distinct performance obligation. Revenues allocated to maintenance services are recognized ratably over the term of the agreement. Revenues related to training services are billed on a fixed fee basis and are recognized as the services are delivered. Payments received in advance of services performed are deferred and recognized when the related services are performed. Revenues related to professional services are recognized as the services are performed.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nIn the case of the Company’s hardware products with embedded software, the Company has determined that the hardware and software components function together to deliver the product’s essential functionality, and therefore, are considered to be one performance obligation. The revenue from the sale of these products along with other products and services we provide requires an allocation of transaction price based on the stand-alone selling price of each component.\nThe Company also offers hosting services bundled with events services. The Company recognizes events revenue when the event takes place and recognizes the hosting revenue over the term of the hosting agreement.\nJudgments and Estimates\nOur contracts with customers often include promises to transfer multiple products and services. Determining whether products and services are considered distinct performance obligations that should be accounted for separately from one another sometimes requires judgment.\nJudgment is required to determine standalone selling prices (“SSP”) for each distinct performance obligation. We typically have more than one SSP for each of our products and services based on customer stratification, which is based on the size of the customer, their geographic region and market segment. We use a cost plus margin approach to determine SSPs for hardware. We use historical sales data to determine SSPs for perpetual software licenses. For both on-premise and term-hosted agreements, events services, training and professional services, SSPs are generally observable using internally developed pricing calculators and/or price sheets. For maintenance services, SSPs are generally observable using historical renewal data.\nConcentration of Credit Risk and Other Risks and Uncertainties\nAt September 30, 2021, $6.2 million is deposited with one major U.S. financial institution of the $10.0 million total cash and equivalents. At times, deposits in the institution exceed the amount of insurance provided on such deposits. The Company has not experienced any losses on such amounts and believes that it is not exposed to any significant credit risk on these balances. The remaining $3.8 million of cash and cash equivalents is held by our foreign subsidiaries in financial institutions in Japan and the Netherlands and held in their local currency. The cash held in foreign financial institutions is not insured. If the funds held by our foreign subsidiaries were needed for our operations in the United States, the repatriation of some of these funds to the United States could require payment of additional U.S. taxes.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nThe Company’s wholly-owned subsidiaries operate in Japan and the Netherlands, and utilize the Japanese Yen and Euro, respectively, as their functional currency. Assets and liabilities of the Company’s foreign operations are translated into US dollars at period end exchange rates while revenues and expenses are translated using average rates for the period. Gains and losses from the translation are deferred and included in accumulated other comprehensive loss on the consolidated statements of comprehensive gain (loss).\nDuring fiscal 2021, the Company recorded an aggregate transaction gain of $16 thousand compared to an aggregate loss of $36 thousand during fiscal 2020. The aggregate transaction gain or loss is included in the other expense, net line of the consolidated statements of operations.\nWe assess the realization of our receivables by performing ongoing credit evaluations of our customers’ financial condition. Through these evaluations, we may become aware of a situation where a customer may not be able to meet its financial obligations due to deterioration of its financial viability, credit ratings or bankruptcy. Our reserve requirements are based on the best information available to us and are reevaluated and adjusted as additional information is received. Our reserves are also based on amounts determined by using percentages applied to certain aged receivable categories. These percentages are determined by a variety of factors including, but not limited to, current economic trends, historical payment and bad debt write-off experience. Allowance for doubtful accounts for accounts receivable was $261 thousand at September 30, 2021 and $236 thousand at September 30, 2020.\nCurrently the majority of our product inventory purchases are from one third-party contract manufacturer. Although we believe there are multiple sources of supply from other contract manufacturers as well as multiple suppliers of component parts required by the contract manufacturers, a disruption of supply of component parts or completed products, even if short term, would have a material negative impact on our revenues. At September 30, 2021, this supplier represented less than 1% of accounts payable while totaling approximately 33% at September 30, 2020. We also license technology from third parties that is embedded in our software. We believe there are alternative sources of similar licensed technology from other third parties that we could also embed in our software, although it could create potential programming related issues that might require engineering resources.\nCash and Cash Equivalents\nThe Company considers all highly liquid investments purchased with an original maturity of three months or less to be cash equivalents.\nTrade Accounts Receivable\nThe majority of the Company’s accounts receivable are due from entities in, or distributors or value-added resellers to, the education, corporate and government sectors. Credit is extended based on evaluation of a customer’s financial condition and, generally, collateral is not required. Accounts receivable are typically due within 30 days and are stated at amounts due from customers net of an allowance for doubtful accounts. Accounts outstanding longer than the contractual payment terms are considered to be past due. The Company determines its allowance by considering a number of factors, including the length of time trade accounts receivable are past due, the Company’s previous loss history, the customer’s current ability to pay its obligation to the Company, and the condition of the general economy and the industry as a whole. The Company writes-off accounts receivable when they become uncollectible, and payments subsequently received on such receivables are credited to the allowance for doubtful accounts. Interest is not accrued on past due receivables.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nInvestment in Sales-Type Lease\nThe Company has entered into sales-type lease arrangements with certain customers, consisting of recorders leased with terms ranging from 3-5 years.\nInvestment in sales-type leases consisted of the following (in thousands) as of September 30, 2021:\nInvestment in sales-type lease, gross:\n$ 294\nGross investment in sales-type lease\nLess: Unearned income\n-\nTotal investment in sales-type lease\n$ 783\nCurrent portion of total investment in sales-type lease\n$ 294\nLong-term portion of total investment in sales-type lease\n$ 784\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nInventory\nInventory consists of raw materials and supplies used in the assembly of Mediasite recorders and finished units. Inventory of completed units and spare parts are carried at the lower of cost or net realizable value, with cost determined on a first-in, first-out basis.\nInventory consists of the following (in thousands):\nSeptember 30,\nRaw materials and supplies\n$ 301 $ 267\nFinished goods\n247 1,022\nLess: Obsolescence reserve\n(106 ) (122 )\nInventories\n$ 442 $ 1,167\nSoftware Development Costs\nSoftware development costs incurred in conjunction with product development are charged to research and development expense until technological feasibility is established. Thereafter, until the product is released for sale, software development costs are capitalized and reported at the net realizable value of the related product. Typically, the period between achieving technological feasibility of the Company’s products and the general availability of the products has been short. Consequently, software development costs qualifying for capitalization are typically immaterial and are generally expensed to research and development costs.\nProperty and Equipment\nProperty and equipment are recorded at cost and are depreciated using the straight-line method for financial reporting purposes. The estimated useful lives used to calculate depreciation are as follows:\nYears\n(In Years)\nLeasehold improvements\n5 to 15\nComputer equipment\n1.5 to 5\nFurniture and fixtures\n3 to 15\nDepreciation expense is not included in cost of good sold.\nImpairment of Long-Lived Assets\nLong-lived assets are evaluated for impairment whenever events or changes in circumstances indicate that the carrying value of an asset may not be recoverable based on expected undiscounted cash flows attributable to that asset. Key assumptions utilized in the analysis of undiscounted cash flows for each asset or asset group being tested included 1) whether cash flows were attributable solely to the asset or group, or to an entire reporting unit; and 2) the useful lives of the asset or asset group. Forecasts used in the analysis were also consistent with those used in determining fair value of reporting units during goodwill impairment testing.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nAsset Retirement Obligation\nAn asset retirement obligation (“ARO”) associated with the retirement of a tangible long-lived asset is recognized as a liability in the period in which it is incurred or becomes determinable, with an associated increase in the carrying amount of the related long-term asset. The cost of the tangible asset, including the initially recognized asset retirement cost, is depreciated over the useful life of the asset. As of September 30, 2021, the Company has recorded a liability of $129 thousand for retirement obligations associated with returning the MSKK leased property to the respective lessors upon the termination of the lease arrangement.\nA summary of the changes in the ARO is included in the table below (amounts in thousands):\nAsset retirement obligation at September 30, 2019\n$ 129\nAccretion expense\nForeign currency changes\nAsset retirement obligation at September 30, 2020\nAccretion expense\nForeign currency changes\n(7 )\nAsset retirement obligation at September 30, 2021\n$ 129\nComprehensive Income (Loss)\nComprehensive income (loss) includes disclosure of financial information that historically has not been recognized in the calculation of net income. Our comprehensive income (loss) encompasses net income (loss) and foreign currency translation adjustments. Assets and liabilities of international operations that have a functional currency that is not in U.S. dollars are translated into U.S. dollars at year-end exchange rates, and revenue and expense items are translated using weighted average exchange rates. Any adjustments arising on translation are included in stockholders’ equity (deficit) as an element of accumulated other comprehensive loss.\nAdvertising Expense\nAdvertising costs included in selling and marketing, are expensed when the advertising first takes place. Advertising expense was $439 thousand and $395 thousand for years ended September 30, 2021 and 2020, respectively.\nResearch and Development Costs\nResearch and development costs represent product development and are expensed in the period incurred, unless they meet the criteria for capitalized software development costs.\nIncome Taxes\nDeferred tax assets and liabilities are determined based on differences between the financial statement and tax basis of assets and liabilities using enacted tax rates in effect in the years in which the differences are expected to reverse. We do not provide for U.S. income taxes on the undistributed earnings of our foreign subsidiaries, which we consider to be permanently invested outside of the U.S.\nWe make judgments regarding the realizability of our deferred tax assets. The balance sheet carrying value of our net deferred tax assets is based on whether we believe that it is more likely than not that we will generate sufficient future taxable income to realize these deferred tax assets after consideration of all available evidence. We regularly review our deferred tax assets for recoverability considering historical profitability, projected future taxable income, the expected timing of the reversals of existing temporary differences and tax planning strategies. In assessing the need for a valuation allowance, we consider both positive and negative evidence related to the likelihood of realization of the deferred tax assets. The weight given to the positive and negative evidence is commensurate with the extent to which the evidence may be objectively verified. As such, it is generally difficult for positive evidence regarding projected future taxable income exclusive of reversing taxable temporary differences to outweigh objective negative evidence of recent financial reporting losses. Generally, cumulative losses in recent years is a significant piece of negative evidence that is difficult to overcome in determining that a valuation allowance is not needed.\nAs of September 30, 2021 and 2020, valuation allowances have been established for all U.S. and for certain foreign deferred tax assets which we believe do not meet the “more likely than not” criteria for recognition.\nThe Company also accounts for the uncertainty in income taxes related to the recognition and measurement of a tax position and measurement of a tax position taken or expected to be taken in an income tax return. The Company follows the applicable accounting guidance on derecognition, classification, interest and penalties, accounting in interim periods and disclosure related to the uncertainty in income tax positions.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nFair Value of Financial Instruments\nIn determining the fair value of financial assets and liabilities, the Company currently utilizes market data or other assumptions that it believes market participants would use in pricing the asset or liability in the principal or most advantageous market, and adjusts for non-performance and/or other risk associated with the Company as well as counterparties, as appropriate. When considering market participant assumptions in fair value measurements, the following fair value hierarchy distinguishes between observable and unobservable inputs, which are categorized in one of the following levels:\nLevel 1 Inputs: Unadjusted quoted prices which are available in active markets for identical assets or liabilities accessible to the Company at the measurement date.\nLevel 2 Inputs: Inputs other than quoted prices included in Level 1 inputs that are observable for the asset or liability, either directly or indirectly, for substantially the full term of the asset or liability.\nLevel 3 Inputs: Unobservable inputs for the asset or liability used to measure fair value to the extent that observable inputs are not available, thereby allowing for situations in which there is little, if any, market activity for the asset or liability at measurement date.\nThe hierarchy gives the highest priority to Level 1, as this level provides the most reliable measure of fair value, while giving the lowest priority to Level 3.\nFinancial Liabilities Measured at Fair Value on a Recurring Basis\nThe fair value of the bifurcated conversion feature represented by the warrant derivative liability associated with the PFG debt is measured at fair value on a recurring basis based on a Black Scholes option pricing model with assumptions for stock price, exercise price, volatility, expected term, risk free interest rate and dividend yield similar to those described for share-based compensation which were generally observable (Level 2).\nFinancial liabilities measured at fair value on a recurring basis are summarized below (in thousands):\nSeptember 30, 2021\nLevel 1\nLevel 2\nLevel 3\nFair Value\nDerivative liability\n$ - $ 53 $ - $ 53\nTotal\nSeptember 30, 2020\nLevel 1\nLevel 2\nLevel 3\nFair Value\nDerivative liability\n$ - $ 66 $ - $ 66\nThe gain or loss related to the fair value remeasurement on the derivative liability is included in the other income (expense) line on the Consolidated Statements of Operations.\nFinancial Liabilities Measured at Fair Value on a Nonrecurring Basis\nThe initial fair values of PFG debt and warrant debt (see Note 3) were based on the present value of expected future cash flows and assumptions about current interest rates and the creditworthiness of the Company (Level 3).\nThe Burish warrant was measured at fair value using a Black Scholes model and the remaining fair value was allocated to the related Burish note purchase agreement (see Note 3) which management believes materially approximated the fair value based on calculating the present value of expected future cash flows (Level 3). The non-recurring fair value measurements were performed as of the date of issuance of the note purchase agreement and warrant. The discount was being amortized over the life of the related debt until the May 2020 Burish debt to equity conversion.\nFinancial Instruments Not Measured at Fair Value\nThe Company's other financial instruments consist primarily of cash and cash equivalents, accounts receivable, investment in sales-type lease, accounts payable and debt instruments and lease obligations. The book values of cash and cash equivalents, accounts receivable, investment in sales-type lease, and accounts payable are considered to be representative of their respective fair values due their short term nature. The carrying value of lease obligations and debt including the current portion, approximates fair market value as the variable and fixed rate approximates the current market rate of interest available to the Company.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nLegal Contingencies\nWhen legal proceedings are brought or claims are made against the Company and the outcome is uncertain, we are required to determine whether it is probable that an asset has been impaired or a liability has been incurred. If such impairment or liability is probable, and the amount of loss can be reasonably estimated, the loss must be charged to earnings.\nNo legal contingencies were recorded for either of the years ended September 30, 2021 or 2020.\nStock-Based Compensation\nThe Company uses a lattice valuation model to account for all employee stock options granted. The lattice valuation model is a more flexible analysis to value options because of its ability to incorporate inputs that change over time, such as actual exercise behavior of option holders. The Company uses historical data to estimate the option exercise and employee departure behavior in the lattice valuation model. Expected volatility is based on historical volatility of the Company’s stock. The Company considers all employees to have similar exercise behavior and therefore has not identified separate homogeneous groups for valuation. The expected term of options granted is derived from the output of the option pricing model and represents the period of time that options granted are expected to be outstanding. The risk-free rate for periods the options are expected to be outstanding is based on the U.S. Treasury yields in effect at the time of grant. Forfeitures are based on actual behavior patterns. The expected exercise factor and forfeiture rates are calculated using historical exercise and forfeiture activity for the previous three years.\nThe fair value of each option grant is estimated using the assumptions in the following table:\nYears Ending September 30,\nExpected life (years)\n4.3-5.3 years 4.5 - 4.8\nRisk-free interest rate\n0.33% - 0.59% 0.24% - 1.63%\nExpected volatility\n65.00% - 83.29% 72.40% - 82.38%\nExpected forfeiture rate\n14.18%-16.41% 12.76% - 15.38%\nExpected exercise factor\n1.2 - 1.87 1.2\nExpected dividend yield\n-%\n-%\nPreferred Stock and Dividends\nThe Company considered relevant guidance when accounting for the issuance of preferred stock, and determined that the preferred shares met the criteria for equity classification. Dividends accrued on preferred shares will be shown as a reduction to net income (or an increase in net loss) for purposes of calculating earnings per common share. See Note 5 - Stockholders' Equity (Deficit) for further details.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nPer Share Computation\nBasic earnings (loss) per share has been computed using the weighted-average number of shares of common stock outstanding during the period, less shares that may be repurchased, and excludes any dilutive effects of options and warrants. In periods where the Company reports net income, diluted net income per share is computed using common equivalent shares related to outstanding options and warrants to purchase common stock. The numerator for the calculation of basic and diluted earnings per share is net income (loss) attributable to common stockholders. The following table sets forth the computation of basic and diluted weighted average shares used in the earnings per share calculations:\nYears Ending\nSeptember 30,\nDenominator for basic earnings (loss) per share\n-weighted average common shares\n8,230,100 7,216,135\nEffect of dilutive options and warrants (treasury method)\n420,284 -\nDenominator for diluted earnings (loss) per share\n-adjusted weighted average common shares\n8,650,384 7,216,135\nOptions and warrants outstanding during each year, but not included in the computation of diluted earnings (loss) per share because they are antidilutive\n1,333,174 2,006,073\nLiquidity\nAt September 30, 2021 approximately $3.8 million of cash and cash equivalents was held by the Company’s foreign subsidiaries.\nThe Company believes its cash position plus available resources is adequate to accomplish its business plan through at least the next twelve months. We will likely evaluate operating and finance lease opportunities to finance equipment purchases in the future. We may also seek additional equity financing, but there are no assurances that these will be on terms acceptable to the Company.\nRestructuring and exit activities\nThe determination of when the Company accrues for involuntary termination benefits under restructuring plans depends on whether the termination benefits are provided under an on-going benefit arrangement or under a one-time benefit arrangement. The Company accounts for on-going benefit arrangements, such as those documented by employment agreements, in accordance with Accounting Standards Codification 712 (\"ASC 712\") Nonretirement Postemployment Benefits. Under ASC 712, liabilities for postemployment benefits are recorded at the time the obligations are probable of being incurred and can be reasonably estimated. The Company accounts for one-time employment benefit arrangements in accordance with ASC 420 Exit or Disposal Cost Obligations. When applicable, the Company records such costs into operating expense.\nDuring the year ended September 30, 2021, the Company had no involuntary termination benefits under ASC 712, compared to $705 thousand in the prior year.\nDuring the year ended September 30, 2021, the Company expensed $157 thousand termination benefits under ASC 420, compared to none in the prior year.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nRecent Accounting Pronouncements\nIn December 2019, the FASB issued ASU 2019-12, \"Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes\", (\"ASU 2019-12\"). The amendments in this ASU affect entities within the scope of Topic 740. For public business entities, the amendments in this ASU are effective for fiscal years beginning after December 15, 2020, and interim periods within fiscal years beginning after December 15, 2020. Early adoption of the amendments is permitted, including adoption in any interim period for public entities for periods for which financial statements have not yet been issued. An entity that elects to early adopt the amendments in an interim period should reflect any adjustments as of the beginning of the annual period that includes that interim period. An entity that elects early adoption much adopt all the amendments in the same period. The Company is currently evaluating the guidance and no material impact on the financial statements is expected.\nIn June 2016, the FASB issued ASU 2016-13, \"Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments\", (\"ASU 2016-13\"). The amendments in this ASU affect entities holding financial assets and net investment in leases that are not accounted for at fair value through net income. The amendments affect loans, debt securities, trade receivables, net investments in leases, off-balance-sheet credit exposures, reinsurance receivables, and any other financial assets not excluded from the scope that have the contractual right to receive cash. The amendments are effective for the Company for fiscal years beginning after December 15, 2022, including interim periods within those fiscal years. Early adoption of the amendment is permitted, including adoption in any interim periods for which financial statement have not yet issued. The Company is currently evaluating the guidance and its impact to the financial statements.\nAccounting standards that have been issued but are not yet effective by the FASB or other standards-setting bodies that do not require adoption until a future date, which are not discussed above, are not expected to have a material impact on the Company’s financial statements upon adoption.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\n2. Commitments\nLeases\nThe Company has operating leases for corporate office space with various expiration dates. Our leases have remaining lease terms of up to three years, some of which include escalation clauses, renewal options for up to twelve years or termination options within one year.\nWe determine if an arrangement is a lease upon contract inception. The Company has both operating and finance leases. Right-of-use assets represent our right to use an underlying asset for the lease term, and lease liabilities represent our obligation to make lease payments according to the arrangement.\nA contract contains a lease if the contract conveys the right to control the use of the identified property, plant or equipment for a period of time in exchange for consideration. At commencement, contracts containing a lease are further evaluated for classification as an operating or finance lease where the Company is a lessee, or as an operating, sales-type or direct financing lease where the Company is a lessor, based on their terms.\nLease right-of-use assets and lease liabilities are recognized as of the commencement date based on the present value of the lease payments over the lease term. The lease right-of use asset is reduced for tenant incentives and includes any initial direct costs incurred. We use the implicit rate when it is readily determinable. Otherwise, the present value of future minimum lease payments is determined using the Company's incremental borrowing rate. The incremental borrowing rate is based on the interest rate of the Company's most recent borrowing.\nThe lease term we use for the valuation of our right-of-use assets and lease liabilities may include options to extend or terminate the lease when it is reasonably certain that we will exercise those options. Lease expense is recognized on a straight-line basis over the expected lease term for operating leases. Amortization expense of the right-of-use asset for finance leases is recognized on a straight-line basis over the lease term and interest expense for finance leases is recognized based on the incremental interest rate.\nRight-of-use assets and lease liabilities are recognized for our leases. Right-of-use assets under finance leases are included in property and equipment on the consolidated balance sheets and have a net carrying value of $90 at September 30, 2021 and $191 thousand at September 30, 2020.\nWe have operating lease arrangements with lease and non-lease components. The non-lease components in our arrangements are not significant when compared to the lease components. For all operating leases, we account for the lease and non-lease components as a single component.\nAs of September 30, 2021, future maturities of operating and finance lease liabilities for the fiscal years ended September 30 are as follows (in thousands):\nOperating Leases\nFinance Leases\n$ 1,008 $ 83\n862 11\n697 9\n33 4\n8 3\nThereafter\n57 -\nTotal\n2,665 110\nLess: imputed interest\n(152 ) (5 )\nTotal\n$ 2,513 $ 105\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nSupplemental information related to leases is as follows (in thousands, except lease term and discount rate):\nFiscal Year Ended\nSeptember 30, 2021\nSeptember 30, 2020\nOperating lease costs\n$ 1,493 $ 1,383\nVariable operating lease costs\n(254 ) 37\nTotal operating lease cost\n$ 1,239 $ 1,420\nFinance lease cost:\nAmortization of right-of-use assets\n$ 121 $ 186\nInterest on lease liabilities\n10 21\nTotal finance lease cost\n$ 131 $ 207\nVariable lease costs include operating costs for U.S. office lease based on square footage and Consumer Price Index (\"CPI\") rent escalation and related VAT for office lease in the Netherlands. The negative amount for variable operating lease costs is due to the COVID-19 rent credit the Company received.\nSupplemental cash flow information related to operating and finance leases were as follows (in thousands):\nFiscal Year Ended\nSeptember 30, 2021\nSeptember 30, 2020\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash outflows for operating leases\n$ 1,163 $ 1,387\nOperating cash outflows for finance leases\n10 21\nFinancing cash outflows for finance leases\n120 202\nOther information related to leases was as follows:\nSeptember 30, 2021\nSeptember 30, 2020\nWeighted average remaining lease term (in years)\nOperating leases\n2.9 2.3\nFinance leases\n1.9 1.9\nWeighted average discount rate\nOperating leases\n4.05 % 9.11 %\nFinance leases\n6.41 % 8.65 %\nOther Commitments\nThe Company enters into unconditional purchase commitments on a regular basis for the supply of Mediasite product for hardware inventory, as well as services to support our hosting environment, which are not recorded on the Company’s Consolidated Balance Sheet. At September 30, 2021, the Company has an obligation to purchase $3,155 thousand of Mediasite product and $245 thousand of services during fiscal year 2022, and $168 thousand in services during fiscal 2023.\nEffective January 1, 2022, the Company's operations in Japan will move to a new leased facility of 7,870 square feet which will expire on December 31, 2023. The monthly rent will be approximately $33 thousand per month. This lease liability is not included on the balance sheet nor is it part of the future minimum lease payments shown above.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\n3. Credit Arrangements\nPartners for Growth V, L.P.\nOn May 11, 2018, Sonic Foundry, Inc., entered into a Loan and Security Agreement (the “2018 Loan and Security Agreement”) with Partners for Growth V, L.P. (“PFG V”).\nThe 2018 Loan and Security Agreement provided for a Term Loan (\"Term Loan\") in the amount of $2,500,000, which was disbursed in two (2) Tranches as follows: Tranche 1 was disbursed on May 14, 2018 in the amount of $2,000,000; and Tranche 2 in the amount of $500,000, was disbursed on November 8, 2018. Each tranche of the Term Loan beared interest at 10.75% per annum. Tranche 1 of the Term Loan was payable interest only until November 30, 2018. Thereafter, principal was due in 30 equal monthly principal installments, plus accrued interest, beginning December 1, 2018 through May 1, 2021, when the principal balance was due in full. Tranche 2 of the Term Loan was payable using the same repayment schedule as Tranche 1. Upon maturity, Sonic Foundry was required to pay PFG V a cash fee of $150,000. The principal of the Term Loan may have been prepaid at any time without penalty as of May 14, 2019. The Term Loan was collateralized by substantially all the Company’s assets, including intellectual property.\nCoincident with execution of the 2018 Loan and Security Agreement, the Company entered into a Warrant Agreement (“Warrant”) with PFG V. Pursuant to the terms of the Warrant, the Company issued to PFG V a warrant to purchase up to 66,000 shares of common stock of the Company at an exercise price of $2.57 per share, subject to certain adjustments. Pursuant to the Warrant, PFG V is also entitled, under certain conditions, to require the Company to exchange the Warrant for the sum of $250,000. All warrants issued in connection with PFG V expire on May 11, 2023.\nAt September 30, 2021, and September 30, 2020, the estimated fair value of the derivative liability associated with the warrants issued in connection with the 2018 Loan and Security Agreement, was $53 thousand and $66 thousand, respectively. Included in other expense, the remeasurement gain on the derivative liability during fiscal year 2021 was $12 thousand, compared to remeasurement loss of $57 thousand during fiscal year, 2020.\nThe proceeds from the 2018 Loan and Security Agreement were allocated between the PFG V Debt and the Warrant Debt (inclusive of its conversion feature) based on their relative fair value on the date of issuance which resulted in carrying values of $2.3 million and $156 thousand, respectively. The warrant debt is treated together as a debt discount on the PFG V Debt and is being accreted to interest expense under the effective interest method over the three-year term of the PFG V Debt and the five year term of the Warrant Debt. During fiscal 2021, the Company recorded accretion of discount expense associated with the warrants issued with PFG V loan of $27 thousand compared to $23 thousand in fiscal 2020.\nIn addition, $34 thousand of amortization of the debt discount was recorded for the year ended September 30, 2021, compared to $56 thousand last year. Effective May 11, 2021, the PFG V Debt fully matured and the carrying value of the Warrant Debt (inclusive of its conversion feature) was $198 thousand. In addition, the Company paid PFG V a cash fee of $150,000 at the time of maturity (the “back-end fee”). At September 30, 2021, there was no balance outstanding on the term debt with PFG V. At September 30, 2020, a gross balance of $667 thousand was outstanding with PFG V.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nFebruary 28, 2019 Burish Note Purchase Agreement\nOn January 4, 2019, Sonic Foundry, Inc. and Mr. Mark Burish (\"Mr. Burish\") entered into a Promissory Note (the \"Promissory Note\") pursuant to which Mr. Burish purchased a 9.25% Unsecured Promissory Note for $1,000,000 in cash. Interest accrued and outstanding principal on the Promissory Note was due and payable on January 4, 2020. The Promissory Note could be prepaid at any time without penalty. The Promissory Note was later included in the Note Purchase Agreement, dated February 28, 2019, as detailed below.\nOn January 31, 2019, Sonic Foundry, Inc. and Mr. Burish entered into a Promissory Note (the \"January 31, 2019 Promissory Note\") pursuant to which Mr. Burish purchased a 9.25% Unsecured Promissory Note for $1,000,000 in cash. Interest accrued and outstanding principal on the January 31, 2019 Promissory Note was due and payable on January 31, 2020. The January 31, 2019 Promissory Note could be prepaid any time without penalty. The note could be paid by the Company by issuing common stock to Mr. Burish, with each share valued at $1.30 per share. The January 31, 2019 Promissory Note was later included in the Note Purchase Agreement, dated February 28, 2019, as detailed below.\nOn February 14, 2019, Sonic Foundry, Inc. and Mr. Burish entered into a Promissory Note (the \"February 14, 2019 Promissory Note\") pursuant to which Mr. Burish purchased a 9.25% Unsecured Promissory Note for $1,000,000 in cash. Interest accrued and outstanding principal on the February 14, 2019 Promissory Note was due and payable on February 14, 2020. The February 14, 2019 Promissory Note could be prepaid any time without penalty. The note could be paid by the Company by issuing common stock to Mr. Burish with each share valued at $1.30 per share. The February 14, 2019 Promissory Note was later included in the Note Purchase Agreement, dated February 28, 2019, as detailed below.\nMr. Burish beneficially owns more than 5% of the Company's common stock and also serves as the Chairman of the Board of Directors.\nFebruary 28, 2019 Note Purchase Agreement\nOn February 28, 2019, Sonic Foundry, Inc. entered into a Note Purchase Agreement (the \"Note Purchase Agreement\") with Mr. Burish.\nThe Note Purchase Agreement provided for subordinated secured promissory notes (the \"Subordinated Promissory Notes\") in an aggregate original principal amount of up to $5,000,000. Mr. Burish acquired from the Company (a) on the initial closing date, the notes in an aggregate principal amount of $3,000,000 (the \"Initial Notes\") and (b) two additional tranches, each in the amount of $1,000,000 and payable at any time prior to the first anniversary of the Agreement (the \"Additional Notes\" and together with the Initial Notes, collectively, the \"Purchase Price\"). The Initial Notes were previously disbursed in January and February of 2019, as detailed above (the Promissory Note, the January 31st, 2019 Promissory Note, and the February 14, 2019 Promissory Note, collectively referred to as the \"Initial Notes\"). The fourth tranche was disbursed on March 13, 2019 and the fifth and final tranche was disbursed on April 4, 2019.\nThe Subordinated Promissory Notes accrued interest at the variable per annum rate equal to the Prime Rate (as defined) plus four percent (4.00%). The outstanding principal balance of the Subordinated Promissory Notes, plus all unpaid accrued interest, plus all outstanding and unpaid obligations, was set to mature on February 28, 2024 (the \"Maturity Date\"). Principal installments of $100,000 began monthly on August 31, 2020 and continued through the Maturity Date. The Note Purchase Agreement dated February 28, 2019 was subordinated to the existing PFG loan.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nAt each anniversary of the Closing, an administration fee was payable to Mr. Burish equal to 0.5% of the purchase price less principal payments made.\nThe proceeds from the Note Purchase Agreement were allocated between the Subordinated Promissory Notes and the Warrant debt based on their relative fair value on the date of issuance. The warrant debt was treated together as a debt discount on the Subordinated Notes Payable and was accreted to interest expense under the effective interest rate method over the five-year term of the Subordinated Notes Payable. During fiscal 2021, the Company recorded accretion of discount expense associated with the Subordinated Promissory Notes of $0 compared to $87 thousand in fiscal 2020.\nMay 13, 2020 Debt Conversion Agreement\nOn May 13, 2020, the Company entered into a debt conversion agreement with Mr. Burish to convert all outstanding debt owed to Mr. Burish into common stock at a conversion price of $5.00 per share. The net carrying value of $5.0 million, including principal and accrued interest of $5.6 million less debt discount and loan origination fees of $596 thousand, was converted into 1,114,723 shares of common stock. The debt conversion was treated as a debt extinguishment and resulted in a net loss of $26 thousand.\nFebruary 28, 2019 Warrant\nCoincident with execution of the Note Purchase Agreement, the Company entered into a Warrant Agreement (\"Warrant\") with Mr. Burish. Pursuant to the terms of the Warrant, the Company issued to Mr. Burish a warrant to purchase up to 728,155 shares of common stock of the Company at an exercise price of $1.18 per share, subject to certain adjustments.\nOn April 25, 2019, Mr. Burish exercised his warrant to purchase 728,155 shares of common stock of the Company at an exercise price of $1.18 per share. A special committee of disinterested and independent directors approved the issuance of the Subordinated Promissory Notes and the Warrant.\nPaycheck Protection Program (PPP) Loan Dated April 20, 2020\nFollowing the approval of the Board of Directors, the Company and First Business Bank entered into a $2.3 million Promissory Note (the \"Promissory Note\") under the Paycheck Protection Program (PPP) contained within the new Coronavirus Aid, Relief, and Economic Security (CARES) Act. The PPP loan had a term of two years for those companies receiving loan proceeds prior to June 5, 2020, is unsecured, and is guaranteed by the U.S. Small Business Administration (\"SBA\"). The loan carried a fixed interest rate of 1% per annum. Under the terms of the CARES Act, the Company was eligible for and submitted its application for forgiveness of all loan proceeds on March 2, 2021. On June 14, 2021 the Company received SBA approval for forgiveness for the loan principal of $2,314,815 and $26,382 in interest.\nWhen PPP Loan was received, US GAAP guidance for debt (ASC 470) was followed by the Company. Liability was recognized and interest was accrued over the term of the loan. Therefore, according to the guidance, the amount forgiven is recorded as gain from forgiveness of debt and the gain from forgiveness is presented on its own line within the statement of operations as other income. Previously recorded interest expense was reversed during the year ended September 30, 2021.\nLine of Credit dated July 28, 2021\nThe Company entered into a Revolving Credit Agreement (the “Credit Agreement”) with U.S. Bank National Association (the “Bank”) on July 28, 2021. Under the Credit Agreement the Company may borrow the lesser of $3,000,000 or the applicable Borrowing Base comprised of (1) 80% of Qualified Accounts Receivable; (2) 50% of Qualified Inventory; and (3) an available over-advance of $500,000.\nThe Credit Agreement matures on July 28, 2022, is secured by all assets of the Company and accrues an interest rate equal to the one-month LIBOR rate plus 1.35% per annum, paid monthly. The Credit Agreement requires compliance with typical warranties and covenants including financial covenants of (1) Fixed Charge Coverage Ratio, as defined in the agreement, of at least 1.20:1 at the end of each quarter and (2) Senior Cash Flow Coverage Ratio, as defined in the agreement, of no more than 3.00:1 for each fiscal quarter.\nIn connection with the Credit Agreement, the Company entered into the Stock Pledge Agreement with the Bank, as a condition of the Credit Loan. Upon default, the Bank shall have the right to transfer and claim the securities of the subsidiaries, Sonic Foundry International B.V. in Netherland and Mediasite K.K. in Japan.\nOther Indebtedness\nOn January 30, 2020, Mediasite K.K. entered into a Term Loan (\"Term Loan\") with Sumitomo Mitsui Banking Corporation for $460 thousand in cash. The Term loan accrues interest at an annual rate of 1.475%. Beginning in January 2020, principal payments in 12 equal monthly installments, plus accrued interest were made. The principal balance was paid in full as of December 30, 2020.\nAt September 30, 2021 and September 30, 2020, no balance was outstanding on the line of credit with Mitsui Sumitomo Bank. The credit facility is related to Mediasite K.K., and accrues interest at an annual rate of approximately one-and-one half percent (1.575%). The available line of credit at September 30, 2021 was $448 thousand and matures on February 28,2022.\nOn August 20, 2020, Mediasite K.K. and Sumitomo Mitsui Banking Corporation entered into a $379 thousand Promissory Note under an initiative by the Japanese Finance Corporation government institution in response to the Cabinet Decision entitled \"Emergency Economic Measures to Cope With COVID-19.\" Extending financial relief to organizations impacted by COVID-19, the loan has a term of three years and carries a fixed interest rate of 0.46% per annum. Government subsidies provided through the Japanese Finance Corporations will provide interest relief throughout the term of the loan. In addition, the loan agreement includes a three year grace period with principal payments deferred through the end of the loan, which is September 30, 2023. As of September 30, 2021 the full amount of the loan has been included in long-term notes payable.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nIn the years ended September 30, 2021 and 2020, respectively, no foreign currency gain or loss was realized related to re-measurement of the subordinated notes payable related to the Company’s foreign subsidiaries.\nThe annual principal payments on the outstanding notes payable and warrant debt are as follows:\nFiscal Year (in thousands)\n$ -\nTotal principal payments\nTotal notes payable, net of discount\n$ 556\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\n4. Balance Sheet\nPrepaid Expenses and Other Current Assets\nPrepaid expenses and other current assets consists of the following (in thousands):\nSeptember 30,\nPrepaid expenses\n$ 1,097 $ 873\nPrepaid insurance\n11 157\nOther current assets\n45 35\nTotal\n$ 1,153 $ 1,065\nPrepaid expenses are amounts paid for services covering periods of performance beyond the balance sheet date such as tradeshow fees and service agreements. Prepaid insurance represents fees paid for insurance covering periods beyond the balance sheet date.\nAccrued Liabilities\nAccrued liabilities consists of the following (in thousands):\nSeptember 30,\nAccrued compensation\n$ 1,530 $ 1,939\nAccrued expenses\n590 289\nAccrued interest & taxes\n241 316\nOther accrued liabilities\n161 21\nTotal\n$ 2,522 $ 2,565\nThe Company accrues expenses as they are incurred. Accrued compensation includes wages, vacation, commissions, bonuses, and severance. Accrued expenses is mainly related to professional fees and amounts owed to suppliers. Other accrued liabilities includes employee-related expenses.\n5. Stockholders' Equity (Deficit)\nStock Options and Employee Stock Purchase Plan\nOn January 28, 2021, Stockholders approved adoption of the 2020 Equity Incentive Plan, (the “2020 Plan”) which replaced our 2009 Stock Incentive Plan (the \"2009 Plan\"). The 2009 Plan terminated coincident with the effectiveness of the 2020 Plan. The Company maintains a directors’ stock option plan under which options may be issued to purchase up to an aggregate of 150,000 shares of common stock. Each non-employee director, who is re-elected or who continues as a member of the board of directors on each annual meeting date and on each subsequent meeting of Stockholders, will be granted options to purchase 2,000 shares of common stock under the directors’ plan, or at other times or amounts at the discretion of the Board of Directors. See Note 9 - Related Party Transactions for more details on the affiliated party.\nEach option entitles the holder to purchase one share of common stock at the specified option price. The exercise price of each option granted under the plans was set at the fair market value of the Company’s common stock at the respective grant date. Options vest at various intervals and expire at the earlier of termination of employment, discontinuance of service on the board of directors, ten years from the grant date or at such times as are set by the Company at the date of grant.\nThe Company has applied a graded (tranche-by-tranche) attribution method and expenses share-based compensation on an accelerated basis over the vesting period of the share award, net of estimated forfeitures.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nThe number of shares available for grant under these stockholder approved plans at September 30, is as follows:\nQualified\nEmployee\nDirector\nStock Option\nStock Option\nPlans\nPlan\nShares available for grant at September 30, 2019\n1,013,201 45,000\nOptions granted\n(228,750 ) -\nOptions forfeited\n127,166 10,500\nShares available for grant at September 30, 2020\n911,617 55,500\nShareholder approval of 2020 Equity Incentive Stock Option Plan\n1,000,000 -\nOptions granted\n(550,467 ) (28,000 )\nOptions forfeited\n258,448 46,500\nShares available for grant at September 30, 2021\n1,619,598 74,000\nThe following table summarizes information with respect to outstanding stock options under all plans:\nYears Ended September 30,\nWeighted\nWeighted\nAverage\nAverage\nExercise\nExercise\nOptions\nPrice\nOptions\nPrice\nOutstanding at beginning of year\n1,707,515 $ 5.09 1,654,429 $ 5.62\nGranted\n578,467 3.42 228,750 1.86\nExercised\n(127,555 ) 2.14 (37,998 ) 1.53\nForfeited\n(304,948 ) 6.89 (137,666 ) 6.82\nOutstanding at end of year\n1,853,479 $ 4.44 1,707,515 $ 5.09\nExercisable at end of year\n1,269,854 1,367,618\nWeighted average fair value of options granted during the year\n$ 1.57 $ 0.84\nThe weighted-average remaining contractual life of exercisable shares is 5.0 years.\nThe options outstanding at September 30, 2021 have been segregated into three ranges for additional disclosure as follows:\nOptions Outstanding\nOptions Exercisable\nOptions\nWeighted\nOutstanding\nAverage\nWeighted\nOptions\nWeighted\nat\nRemaining\nAverage\nExercisable at\nAverage\nSeptember 30,\nContractual\nExercise\nSeptember 30,\nExercise\nExercise Prices\nLife\nPrice\nPrice\n$0.66 to $4.81\n1,334,544 7.72 $ 2.92 751,419 $ 2.86\n$5.08 to $8.92 332,408 2.46 7.48 331,908 7.48\n$9.08 to $10.92\n186,527 2.19 9.95 186,527 9.95\n1,853,479 1,269,854\nAs of September 30, 2021, there was $551 thousand of total unrecognized compensation cost related to non-vested stock-based compensation, with total forfeiture adjusted unrecognized compensation costs of $409 thousand. The cost is expected to be recognized over a weighted-average life of 2.2 years. As of September 30, 2020, there was $154 thousand of total unrecognized compensation cost related to non-vested stock-based compensation, with total forfeiture adjusted unrecognized compensation costs of $122 thousand.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nA summary of the status of the Company’s non-vested shares under all plans at September 30, 2021 and for the year then ended is presented below:\nWeighted Average\nGrant Date\nOptions\nFair Value\nNon-vested options at October 1, 2019\n357,114 $ 0.77\nGranted\n228,750 0.84\nVested\n(219,966 ) 1.12\nForfeited\n(26,001 ) 0.54\nNon-vested options at September 30, 2020\n339,897 0.60\nGranted\n578,467 1.57\nVested\n(283,741 ) 0.98\nForfeited\n(51,165 ) 1.09\nNon-vested options at September 30, 2021\n583,458 $ 1.43\nStock-based compensation recorded in the year ended September 30, 2021 was $487 thousand. Stock-based compensation recorded in the year ended September 30, 2020 was $158 thousand. Cash received from exercises under all stock option plans and warrants for the years ended September 30, 2021 and 2020 was $273 thousand and $58 thousand, respectively. There were no tax benefits realized for tax deductions from option exercises for the years ended September 30, 2021 and 2020. The Company currently expects to satisfy stock-based awards with registered shares available to be issued.\nThe Company also has an Employee Stock Purchase Plan (Purchase Plan) under which an aggregate of 300,000 common shares may be issued. All employees who have completed 90 days of employment with the Company on the first day of each offering period and customarily work twenty hours per week or more are eligible to participate in the Purchase Plan. An employee who, after the grant of an option to purchase, would hold common stock and/or hold outstanding options to purchase stock possessing 5% or more of the total combined voting power or value of the Company will not be eligible to participate. Eligible employees may make contributions through payroll deductions of up to 10% of their compensation. No participant in the Purchase Plan is permitted to purchase common stock under the Purchase Plan if such option would permit his or her rights to purchase stock under the Purchase Plan to accrue at a rate that exceeds $25,000 of the fair market value of such shares, or that exceeds 1,000 shares, for each calendar year. The Company makes a bi-annual offering to eligible employees of options to purchase shares of common stock under the Purchase Plan on the first trading day of January and July. Each offering period is for a period of 6 months from the date of the offering, and each eligible employee as of the date of offering is entitled to purchase shares of common stock at a purchase price equal to the lower of 85% of the fair market value of common stock on the first or last trading day of the offering period. A total of 99,673 shares are available to be issued under the plan at September 30, 2021.\nThere were 9,773 and 16,227 shares purchased by employees during fiscal 2021 and 2020, respectively. The Company recorded stock compensation expense under this plan of $9 thousand and $2 thousand during fiscal 2021 and 2020, respectively. Cash received from issuance of stock under this plan was $31 thousand and $17 thousand during fiscal 2021 and 2020, respectively.\nCommon Stock Warrants\nOn April 16, 2018, the Company issued 232,558 shares of common stock to an affiliated party. The shares were issued at a price of $2.15 per share, representing the closing price on April 13, 2018. The affiliated party also received warrants to purchase 232,558 shares of common stock at an exercise price of $2.50 per share, which expire on April 16, 2025.\nOn April 25, 2019, Mr. Burish exercised his warrant, described in Note 3 ( February 28, 2019 Warrant) to purchase 728,155 shares of common stock of the Company at an exercise price of $1.18 per share.\nOn July 27, 2021, the Company and investors entered in to warrant agreements pursuant to which the investors have the right to purchase 141,892 shares at a price of $5.50 per share on or before July 20, 2026. One of these warrants was issued to Mr. Burish for the right to purchase 50,676 shares, see Note 9 - Related Party Transactions for more details.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nPreferred stock and dividends\nIn May 2017, the Company created a new series of preferred stock entitled \"9% Cumulative Voting Convertible Preferred Stock, Series A\" (the \"Preferred Stock, Series A\"). As of September 30, 2021 and 2020, an aggregate total of 4,500 shares were authorized, respectively. Holders of the Preferred Stock, Series A will receive monthly dividends at an annual rate of 9%, payable in additional shares of Preferred Stock, Series A. Dividends declared on the preferred stock were earned monthly as additional shares and accounted for as a reduction to paid-in capital since the Company is currently in an accumulated deficit position. Each share of Preferred Stock, Series A was convertible into that number of shares of common stock determined by dividing $4.23 into the liquidation amount.\nThe Company considered relevant guidance when accounting for the issuance of preferred stock, and determined that the preferred shares meet the criteria for equity classification. Dividends accrued on preferred shares have been shown as a reduction to net income (or an increase in net loss) for purposes of calculating earnings per share.\nA total of zero shares of Preferred Stock, Series A were issued and outstanding as of September 30, 2021 and 2020, respectively.\nCapital raise\nOn July 20, 2021, the Company entered into a transaction with four investors on identical terms pursuant to which they agreed to purchase, and the Company agreed to issue and sell, an aggregate of 945,946 shares at a price of $3.70 per share (total of $3,500,000). The Company closed on the issuance and sale on July 27, 2021. The Company and the investors also entered into (i) warrant agreements pursuant to which the investors have the right to purchase 141,892 shares at a price of $5.50 per share on or before July 20, 2026 and, (ii) registration rights agreements (“Rights Agreement”) whereby the Company agreed to file a registration statement with the U.S. Securities and Exchange Commission (the “Commission”) within six months after the effective date of the Rights Agreement and further agreed to use its commercially reasonable efforts to have the registration statement declared effective and to ensure that the registration statement remains effective throughout the term of the Rights Agreement.\nThe investors above included Mr. Mark Burish, the Company’s chairman and largest shareholder who purchased $1,250,000 of common stock for a total of 337,838 shares and 50,676 warrants. The Company’s special committee of disinterested directors met several times to discuss and negotiate the terms of the above transactions, including the participation of Mr. Burish. The special committee unanimously approved such terms.\n6. Income Taxes\nProvision for income taxes consists of the following (in thousands):\nYears Ended September 30,\nCurrent income tax expense U.S.\n$ -\n$ -\nCurrent income tax expense foreign\nDeferred income tax expense (benefit)\n(5 )\nProvision for income taxes\n$\n$\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nU.S. and foreign components of income (loss) before income taxes were as follows (in thousands):\nYears Ended September 30,\nU.S.\n$ 2,702\n$ (184 )\nForeign\nIncome (Loss) before income taxes\n$ 3,092\n$ (31 )\nThe reconciliation of income tax expense (benefit) computed at the appropriate country specific rate to income tax benefit is as follows (in thousands):\nYears Ended September 30,\nIncome tax expense (benefit) at statutory rate\n$\n$ (39 )\nState income tax expense\nForeign rate differential\n(31 )\n-\nForeign tax activity\n-\nPPP loan forgiveness\n(488 )\n-\nPermanent differences, net\nExpiration of net operating losses\n3,945\n3,666\nChange in valuation allowance\n(4,255 )\n(4,298 )\nReturn to provision true-up\n-\nOther\n(47 )\nIncome tax expense\n$\n$\nThe significant components of the deferred tax accounts recognized for financial reporting purposes are as follows (in thousands):\nSeptember 30,\nDeferred tax assets:\nNet operating loss and other carryforwards\n$ 16,893\n$ 20,069\nCommon stock options\n1,003\nUnearned revenue\nInterest expense limitation\nOther\nTotal deferred tax assets\n18,584\n22,363\nDeferred tax liabilities:\nOther\n(321 )\n(339 )\nTotal deferred tax liabilities\n(321 )\n(339 )\nNet deferred tax asset\n18,263\n22,024\nValuation allowance\n(18,215 )\n(21,981 )\nNet deferred tax asset\n$\n$\nThe Company has a $48 thousand and $43 thousand deferred tax asset at September 30, 2021 and 2020, respectively, recorded within other long-term assets lines on the consolidated balance sheet and is primarily related to net operating losses of MSKK.\nAt September 30, 2021, the Company had net operating loss carryforwards of approximately $61 million for U.S. Federal and $64 million for state tax purposes. For Federal tax purposes, the carryforwards have a range of lives from 20 years to indefinite and begin expiring in 2021. For state tax purposes, the carryforwards expire in varying amounts between 2021 and 2041. Utilization of the Company’s net operating loss may be subject to substantial annual expirations due to the ownership change limitations provided by the Internal Revenue Code and similar state provisions. Approximately $18.8 million of the net operating loss carryforwards expired during the year ended September 30, 2021.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nThe Company maintains an additional paid-in-capital (APIC) pool which represents the excess tax benefits related to share-based compensation that are available to absorb future tax deficiencies. If the amount of future tax deficiencies is greater than the available APIC pool, the Company records the excess as income tax expense in its consolidated statements of income. For fiscal 2021 and fiscal 2020, the Company had a sufficient APIC pool to cover any tax deficiencies recorded and as a result, these deficiencies did not affect its results of operations. At September 30, 2021, the Company has $1.1 million of net operating loss carry forwards for which a benefit would be recorded in APIC when realized.\nEarnings of the Company’s foreign subsidiaries are generally subject to U.S. taxation upon repatriation to the U.S. and the Company’s tax provision reflects the related incremental U.S. tax except for certain foreign subsidiaries whose unremitted earnings are considered to be indefinitely reinvested. No deferred tax liability has been recognized with regard to the remittance of such earnings after MSKK and Sonic Foundry International BV acquisitions were completed. At September 30, 2021, unremitted earnings of $1.6 million for foreign subsidiaries were deemed to be indefinitely reinvested.\nIn accordance with accounting guidance for uncertainty in income taxes, the Company has concluded that a reserve for income tax contingencies is not necessary. The Company’s practice is to recognize interest and/or penalties related to income tax matters in income tax expense. The Company had no accruals for interest and penalties on the Company’s Consolidated Balance Sheets at September 30, 2021 or September 30, 2020 and has not recognized any interest or penalties in the Consolidated Statements of Operations for either of the years ended September 30, 2021 or 2020.\nThe Company is subject to taxation in the U.S., Netherlands, Japan and various state jurisdictions. All of the Company’s tax years are subject to examination by the U.S., Dutch, Japanese and state tax authorities due to the carryforward of unutilized net operating losses.\n7. Savings Plan\nThe Company’s defined contribution 401(k) savings plan covers substantially all employees meeting certain minimum eligibility requirements. Participating employees can elect to defer a portion of their compensation and contribute it to the plan on a pretax basis. The Company may also match certain amounts and/or provide additional discretionary contributions, as defined. The Company made matching contributions of $400 thousand and $428 thousand during the years ended September 30, 2021 and 2020, respectively. The Company made no additional discretionary contributions during 2021 or 2020.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\n8. Revenue\nDisaggregation of Revenues\nThe following table summarizes revenues from contracts with customers for the twelve months ended September 30, 2021 and 2020, respectively, (in thousands):\nFiscal Year Ended September 30, 2021\nSOFO\nSFI\nMSKK\nEliminations\nTotal\nRevenue:\nHardware\n$ 5,760 $ 607 $ 1,423 $ (984 ) $ 6,806\nSoftware\n2,663 458 863 (396 ) 3,588\nShipping\n74 5 - - 79\nProduct and other total\n8,497 1,070 2,286 (1,380 ) 10,473\nSupport\n6,587 631 924 (844 ) 7,298\nHosting\n5,786 1,014 1,954 (458 ) 8,296\nEvents\n3,982 99 2,310 - 6,391\nInstalls and training\n809 268 1,632 - 2,709\nServices total\n17,164 2,012 6,820 (1,302 ) 24,694\nTotal revenue\n$ 25,661 $ 3,082 $ 9,106 $ (2,682 ) $ 35,167\nFiscal Year Ended September 30, 2020\nSOFO\nSFI\nMSKK\nEliminations\nTotal\nRevenue:\nHardware\n$ 5,452 $ 718 $ 759 $ (612 ) $ 6,317\nSoftware\n3,201 456 704 (566 ) 3,795\nShipping\n218 9 - - 227\nProduct and other total\n8,871 1,183 1,463 (1,178 ) 10,339\nSupport\n7,638 603 1,965 (694 ) 9,512\nHosting\n4,934 623 1,375 - 6,932\nEvents\n3,533 121 2,250 - 5,904\nInstalls and training\n1,655 21 390 - 2,066\nServices total\n17,760 1,368 5,980 (694 ) 24,414\nTotal revenue\n$ 26,631 $ 2,551 $ 7,443 $ (1,872 ) $ 34,753\nTransaction price allocated to future performance obligations\nAs of September 30, 2021, the aggregate amount of the transaction price that is allocated to our future performance obligations was approximately $3.5 million in the next three months compared to $4.1 million last year, $9.5 million in the next twelve months compared to $10.7 million last year , and the remaining $1.6 million thereafter compared to $1.7 million last year.\nDisclosures related to our contracts with customers\nTiming may differ between the satisfaction of performance obligations and the invoicing and collection of amounts related to our contracts with customers. We record assets for amounts related to performance obligations that are satisfied but not yet billed and/or collected. Liabilities are recorded for amounts that are collected in advance of the satisfaction of performance obligations. These liabilities are classified as current and non-current unearned revenue.\nUnearned revenues\nUnearned revenues represent our obligation to transfer products or services to our client for which we have received consideration, or an amount of consideration is due, from the client. During the twelve months ended September 30, 2021, revenues recognized related to the amount included in the unearned revenues balance at the beginning of the period was $10.5 million compared to $9.9 million at September 30, 2020.\nAssets recognized from the costs to obtain our contracts with customers\nWe recognize an asset for the incremental costs of obtaining a contract with a customer. We amortize these deferred costs proportionate with related revenues over the period of the contract. During the twelve months ended September 30, 2021, amortization expense recognized related to the amount included in the capitalized commissions at the beginning of the period was $462 thousand compared to $491 thousand at September 30, 2020.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\n9. Related-Party Transactions\nThe Company incurred fees of $121 thousand and $424 thousand during the years ended September 30, 2021 and 2020, respectively, to a law firm whose partner is a director and stockholder of the Company. The Company had accrued liabilities for unbilled services to the same law firm of $16 thousand and $36 thousand at September 30, 2021 and 2020, respectively.\nOn May 13, 2020, the Company entered into a debt conversion agreement with Mr. Burish to convert all outstanding debt owed to Mr. Burish into common stock at a conversion price of $5.00 per share. The total debt amount, including accrued interest and fees, of $5.6 million was converted into 1,114,723 shares of common stock. The transaction was recommended by the Company's Special Committee of Independent and Disinterested Directors and unanimously approved by all disinterested directors of the Company. Silverwood Partners, the Special Committee's financial advisor, issued a fairness opinion in connection with the transaction. The debt conversion was also ratified at the annual shareholders meeting held on January 28, 2021.\nOn July 20, 2021, the Company entered into a transaction with four investors on identical terms pursuant to which they agreed to purchase, and the Company agreed to issue and sell, an aggregate of 945,946 shares at a price of $3.70 per share (total of $3,500,000). The Company closed on the issuance and sale on July 27, 2021. The Company and the investors also entered into (i) warrant agreements pursuant to which the investors have the right to purchase 141,892 shares at a price of $5.50 per share on or before July 20, 2026 and, (ii) registration rights agreements (“Rights Agreement”) whereby the Company agreed to file a registration statement with the U.S. Securities and Exchange Commission (the “Commission”) within six months after the effective date of the Rights Agreement and further agreed to use its commercially reasonable efforts to have the registration statement declared effective and to ensure that the registration statement remains effective throughout the term of the Rights Agreement. The investors above included Mr. Mark Burish, who purchased $1,250,000 of common stock for a total of 337,838 shares and 50,676 warrants. The Company’s special committee of disinterested directors met several times to discuss and negotiate the terms of the above transactions, including the participation of Mr. Burish. The special committee unanimously approved such terms.\nMr. Burish beneficially owns more than 5% of the Company’s common stock. Mr. Burish also serves as the Chairman of the Board of Directors. An affiliated party beneficially owns more than 5% of the Company's common stock. All transactions with Mr. Burish and with the affiliated party were approved by a Special Committee of Disinterested and Independent Directors.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\n10. Segment Information\nWe have determined that in accordance with the Financial Accounting Standards Board (“FASB”) Accounting Standards Codification (“ASC”) 280-10, Segment Reporting, we operate in three operating segments, however these segments meet the criteria for aggregation for reporting purposes as one reporting segment as of September 30, 2021 and 2020.\nThe following summarizes revenue and long-lived assets by geographic region (in thousands):\nRevenues\nYears Ended\nLong-Lived Assets\nSeptember 30,\nSeptember 30,\nUnited States\n$ 18,114 $ 18,714 $ 3,555 $ 3,412\nEurope and Middle East\n6,732 7,245 1,234 1,447\nAsia\n9,291 7,714 796 1,449\nOther\n1,030 1,080 - -\nTotal\n$ 35,167 $ 34,753 $ 5,585 $ 6,308\n11. Legal Proceedings\nFrom time to time, the Company is subject to legal proceedings or claims arising from its normal course of operations. The Company accrues for costs related to loss contingencies when such costs are probable and reasonably estimable. As of September 30, 2021, the Company is not aware of any material pending legal proceedings or threatened litigation that would have a material adverse effect on the Company’s financial condition or results of operations.\n12. Impacts of COVID-19﻿\nOn March 11, 2020, the World Health Organization declared the outbreak of a novel coronavirus (COVID-19) as a pandemic, which has resulted in authorities implementing numerous measures to contain the virus, including travel bans and restrictions, quarantines, shelter-in-place orders, and business limitations and shutdowns. While we are unable to accurately predict the full impact that COVID-19 will have on our results from operations, financial condition, liquidity and cash flows due to numerous uncertainties, including the duration, severity and impact of the pandemic and containment measures, our compliance with these measures has impacted our day-to-day operations and could disrupt our business and operations, as well as those of our key business partners, vendors and other counterparties for an indefinite period of time. To support the health and well-being of our employees, business partners and communities, a vast majority of our employees have been working remotely since mid- March 2020 and continue to do so. The Company continues to follow guidelines outlined by the CDC and local county protocol. On August 2, 2021, the Company returned to in-person working.\nThe Company implemented a newly developed hybrid module to allow 60% in office and 40% work from home.\nCOVID-19 has had both positive and negative near-term impacts on our operations and the future impacts of the pandemic and any corresponding economic results are largely unknown and rapidly evolving. Beginning in March 2020 and continuing through this year and beyond, the in-person events portion of our business continues to be impacted by cancellations and/or postponements due to social distancing protocols enacted to stop the spread of the virus. While there was a return during the year to the type of smaller, in-person web events that are common for our Japan subsidiary, the events business in the US remains primarily a virtual events initiative, which has been a growing portion of our events business. In addition, the closure of educational institutions globally and the negative financial impact on their funding, could impact our sales in the upcoming quarters. While the virus has increased awareness of the need for distance learning tools and the adoption of video as a necessary communication medium, it is impossible for us to predict with confidence the long-term financial impact on our business including results of operations and liquidity.",
    "item_9": "ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNot applicable.",
    "item_9A": "ITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nBased on evaluations at September 30, 2021, our principal executive officer and principal financial officer, with the participation of our management team, have evaluated the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15 (e) and 15d-15 (e) under the Securities Exchange Act). Disclosure controls and procedures ensure that information required to be disclosed by us in reports that we file or submit under the Securities Exchange Act is recorded, processed, summarized and reported within the time periods specified in the rules and forms of the SEC, and that material information relating to the Company is accumulated and communicated to management, including our principal executive officer and our principal financial officer, as appropriate to allow timely decisions regarding required disclosures. Based on this evaluation, our principal executive officer and principal financial officer concluded that our disclosure controls and procedures were effective as of September 30, 2021.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nLimitations on the effectiveness of Controls and Permitted Omission from Management’s Assessment\nOur internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. All internal control systems, no matter how well designed, have inherent limitations, including the possibility of human error and the circumvention or overriding of controls. Accordingly, even effective internal controls can only provide reasonable assurance with respect to financial statement preparation. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement’s Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rules 13a-15(f).\nUnder the supervision and with the participation of our management, including our principal executive officer and principal financial officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in the 2013 Internal Control- Integrated Framework, issued by the Committee of Sponsoring Organizations of the Treadway Commission (the “2013 COSO Framework”) on May 14, 2013. The 2013 COSO Framework outlines the 17 underlying principles and the following fundamental components of a company’s internal control: (i) control environment, (ii) risk assessment, (iii) control activities, (iv) information and communication, and (v) monitoring. The 2013 Framework was adopted in the fiscal year ended September 30, 2015.\nBased on evaluations at September 30, 2021, our principal executive officer and principal financial officer, with the participation of our management team, have evaluated the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15 (e) and 15d-15 (e) under the Securities Exchange Act). Disclosure controls and procedures ensure that information required to be disclosed by us in reports that we file or submit under the Securities Exchange Act is recorded, processed, summarized and reported within the time periods specified in the rules and forms of the SEC, and that material information relating to the Company is accumulated and communicated to management, including our principal executive officer and our principal financial officer, as appropriate to allow timely decisions regarding required disclosures. Based on this evaluation, our principal executive officer and principal financial officer concluded that our disclosure controls and procedures were effective as of September 30, 2021.\nThis Annual Report on Form 10-K does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Management’s report was not subject to attestation by the Company’s independent registered public accounting firm, as allowed by the SEC.\nChanges in Internal Control Over Financial Reporting\nWe have not made any change to our internal control over financial reporting that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.",
    "item_9B": "ITEM 9B. OTHER INFORMATION\nNone.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nPART III",
    "item_10": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\nThe information required by Item 10 of Form 10-K with respect to directors and executive officers is incorporated herein by reference to the information contained in the section entitled “Proposal One: Election of Directors” and “Executive Officers of Sonic”, respectively, in the Company’s definitive Proxy Statement to be filed with the Securities and Exchange Commission in connection with the solicitation of proxies for the Company’s 2021 and 2022 Annual Meeting of Stockholders.\nItem 405 of Regulation S-K calls for disclosure of any known late filings or failure by an insider to file a report required by Section 16(a) of the Securities Act. This information is contained in the Section entitled “Section 16(a) Beneficial Ownership Reporting Compliance” in the Proxy Statement and is incorporated herein by reference.\nItem 401 of Regulation S-K calls for disclosure of whether or not the Company has a financial expert serving on the audit committee of its Board of Directors, and if so who that individual is. This information is contained in the Section entitled “Meetings and Committees of Directors” in the Proxy Statement and is incorporated herein by reference.\nItem 407 of Regulation S-K calls for disclosure of whether or not the Company has an audit committee and a financial expert serving on the audit committee of the Board of Directors, and if so, who that individual is. Item 407 also requires disclosure regarding the Company’s nominating committee and the director nomination process and whether or not the audit committee has a charter. This information is contained in the section entitled “Meetings and Committees of Directors” in the Proxy Statement and is incorporated herein by reference.\nSonic Foundry has adopted a code of ethics that applies to all officers and employees, including Sonic Foundry’s principal executive officer, its principal financial officer, and persons performing similar functions. This code of ethics is available, without charge, to any investor who requests it. Requests should be addressed in writing to Ken Minor, Corporate Secretary, 222 West Washington Avenue, Madison, Wisconsin 53703.",
    "item_11": "ITEM 11. EXECUTIVE COMPENSATION\nThe information required by Item 11 of Form 10-K is incorporated herein by reference to the information contained in the sections entitled “Directors Compensation”, “Executive Compensation and Related Information” and “Compensation Committee Interlocks and Insider Participation” in the Proxy Statement.",
    "item_12": "ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by Item 12 of Form 10-K is incorporated herein by reference to the information contained in the sections entitled “Security Ownership of Certain Beneficial Owners and Management” in the Proxy Statement. Information related to equity compensation plans is set forth in Item 5 herein.",
    "item_13": "ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by Item 13 of Form 10-K is incorporated herein by reference to the information contained in the section entitled “Certain Transactions” and “Meetings and Committees of Directors” in the Proxy Statement.",
    "item_14": "ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe information required by Item 14 of Form 10-K is incorporated herein by reference to the information contained in the section entitled “Ratification of Appointment of Independent Auditors - Fiscal 2020 and 2021 Audit Fee Summary” in the Proxy Statement.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nPART IV",
    "item_15": "ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a)\nThe following financial statements are filed as part of this report:\nFinancial Statements furnished are listed in the Table of Contents provided in response to Item 8.\nExhibits.\nNUMBER\nDESCRIPTION\n3.1\nArticles of Amendment of Amended and Restated Articles of Incorporation, effective November 16, 2009, Amended and Restated Articles of Incorporation, effective January 26, 1998, and Articles of Amendment, effective April 9, 2000, filed as Exhibit No. 3.1 to the Annual Report on Form 10-K for the year ended September 30, 2009, and hereby incorporated by reference.\n3.2\nArticles Supplementary to the Company Charter of the Registrant, as relates to Series A Preferred Stock, dated May 30, 2017, filed as Exhibit 5.03 to the 8-K filed on June 5, 2017, and hereby incorporated by reference.\n3.3\nArticles Supplementary to the Company Charter of the Registrant, as relates to Series A Preferred Stock, dated November 6, 2017, filed as Exhibit 3.1 to the Form 8-K filed on November 21, 2017, and hereby incorporated by reference.\n3.4\nAmended and Restated By-Laws of the Registrant, filed as Exhibit No. 3.1 to the Form 8-K filed on January 25, 2018, and hereby incorporated by reference.\n3.5\nArticles Supplementary to the Company Charter of the Registrant, as relates to Series A Preferred Stock, filed as Exhibit 3.1 to the Form 8-K filed on May 23, 2018, and hereby incorporated by reference.\n3.6\nArticle of Amendment to the Company Charter of Registrant, filed with the June 30, 2021 Form 10-Q and hereby incorporated by reference.\n4.1\nForm of Warrant Agreement between registrant and four investors, dated July 20, 2021, filed as Exhibit 4.1 to the 8-K, filed on July 30, 2021 and here by incorporated by reference.\n10.1*\nRegistrant’s 2008 Non-Employee Directors’ Stock Option Plan, as amended, filed as Exhibit 3 to the Form 14A filed on January 26, 2017, and hereby incorporated by reference.\n10.2*\nRegistrant’s 2008 Employee Stock Purchase Plan, as amended, filed as Exhibit 1 to the Form 14A filed on January 26, 2017, and hereby incorporated by reference.\n10.3*\nRegistrant’s 2009 Stock Incentive Plan, as amended, filed as Exhibit 2 to the Form 14A filed on January 26, 2017, and hereby incorporated by reference.\n10.4\nLease Agreement between Registrant, as tenant, and West Washington Associates, LLC as landlord, dated June 28, 2011, filed as Exhibit 10.1 to the Form 8-K filed on July 1, 2011, and hereby incorporated by reference.\n10.5*\nEmployment Agreement dated March 21, 2014 between Sonic Foundry, Inc. and Kenneth A. Minor, filed as Exhibit 10.2 to the Form 8-K filed on March 26, 2014, and hereby incorporated by reference.\n10.6\nForms of Subscription Agreements, Lock-Up Agreements and Warrant Agreements dated December 22, 2014 among Sonic Foundry, Inc. and Mark Burish, and Sonic Foundry, Inc. and Andrew Burish, filed as Exhibits 10.1, 10.2, and 10.3 to the Form 8-K filed on December 30, 2014 and hereby incorporated by reference.\n10.7\nLease Agreement between Sonic Foundry International, as tenant, and Prinsen Geerligs as landlord, dated February 1, 2014, filed as Exhibit 10.25 to the form 10-Q on February 6, 2015, and hereby incorporated by reference.\n10.8\nLoan and Security Agreement, dated May 13, 2015 among Registrant, Sonic Foundry, Inc. and Partners for Growth IV, L.P., filed as Exhibit 10.27 to the form 10-Q filed on May 14, 2015, and hereby incorporated by reference.\n10.9\nWarrant, dated as of May 13, 2015, between Registrant and Partners for Growth IV, L.P., filed as Exhibit 10.28 to the form 10-Q filed on May 14, 2015, and hereby incorporated by reference.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\n10.10\nWarrant dated as of May 13, 2015, between Registrant and PFG Equity Investors, LLC, filed as Exhibit 10.30 to the form 10-Q filed on May 14, 2015, and hereby incorporated by reference.\n10.11\nIntellectual Property Security Agreement, dated as of May 13, 2015, between Registrant and Partners for Growth IV, L.P., filed as Exhibit 10.31 to form 10-Q filed on May 14, 2015, and hereby incorporated by reference.\n10.12\nModification No. 1 to Loan and Security Agreement, dated September 30, 2015 among Registrant, Sonic Foundry, Inc. and Partners for Growth IV, L.P., filed as Exhibit No. 10.2 to the Form 8-K filed on October 9, 2015, and hereby incorporated by reference.\n10.13\nLease Agreement between Mediasite KK, as tenant, and Sumitomo Metal Mining Co., Ltd., as landlord, dated August 1, 2016, filed as Exhibit 10.1 to the Form 8-K filed on August 3, 2016, and hereby incorporated by reference.\n10.14\nModification No. 2 to Loan and Security Agreement, dated February 8, 2017 among Registrant, Sonic Foundry, Inc. and Partners for Growth IV, L.P., filed as Exhibit 10.28 to the Form 10-Q filed on February 9, 2017, and hereby incorporated by reference.\n10.15\nWaiver and Modification No. 3 to Loan and Security Agreement, dated May 11, 2017 among Registrant Sonic Foundry, Inc. and Partners for Growth IV, L.P., filed as Exhibit 10.31 to the Form 10-Q filed on May 11, 2017, and hereby incorporated by reference.\n10.16\nSubscription Agreement between Registrant and Mark D. Burish, dated May 30, 2017, filed as Exhibit 3.02 to the 8-K filed on June 5, 2017, and hereby incorporated by reference.\n10.17\nAgreement Not to Convert between Registrant and Mark D. Burish, dated November 17, 2017, filed as Exhibit 10.1 to the Form 8-K filed on November 21, 2017, and hereby incorporated by reference.\n10.18\nSubscription Agreement between Registrant and Mark D. Burish, dated August 23, 2017, filed as Exhibit 10.1 to the 8-K filed on August 25, 2017, and hereby incorporated by reference.\n10.19\nModification No. 4 to Loan and Security Agreement, dated December 28, 2017 among Registrant, Sonic Foundry, Inc. and Partners for Growth IV, L.P., filed as Exhibit 10.2 to the Form 8-K filed on December 29, 2017, and hereby incorporated by reference.\n10.20\nSubscription Agreement between Registrant and Mark D. Burish, dated January 19, 2018, filed as Exhibit 10.1 to the Form 8-K filed on January 25, 2018, and hereby incorporated by reference.\n10.21\n10.75% Convertible Secured Subordinated Promissory Note between Registrant and Mark D. Burish, filed as Exhibit 10.2 to the Form 8-K filed on January 25, 2018, and hereby incorporated by reference.\n10.22\nSubscription Agreement between Registrant and Andrew D. Burish, dated April 16, 2018, filed as Exhibit 10.1 to the Form 8-K filed on April 18, 2018, and hereby incorporated by reference.\n10.23\nWarrant, dated April 16, 2018, filed as Exhibit 10.2 to the Form 8-K filed on April 18, 2018, and hereby incorporated by reference.\n10.24\nLoan and Security Agreement, dated May 11, 2018 among Registrant, Sonic Foundry, Inc. and Partners for Growth V, L.P., filed as Exhibit 10.41 to the Form 10-Q filed on May 15, 2018, and hereby incorporated by reference.\n10.25\nWarrant, dated as of May 11, 2018, between Registrant and Partners for Growth V, L.P., filed as Exhibit 10.42 to the Form 10-Q filed on May 15, 2018, and hereby incorporated by reference.\n10.26\nPromissory Note between Registrant and Mark D. Burish, dated January 4, 2019, filed as Exhibit 10.1 to the Form 8-K filed on January 8, 2019, and hereby incorporated by reference.\n10.27\nPromissory Note between Registrant and Mark D. Burish, dated January 31, 2019, effective upon receipt of funds on February 5, 2019, filed as Exhibit 10.1 to the Form 8-K filed on February 12, 2019, and hereby incorporated by reference.\n10.28\nPromissory Note between Registrant and Mark D. Burish, dated February 14, 2019, filed as Exhibit 10.1 to the Form 8-K filed on February 20, 2019, and hereby incorporated by reference.\n10.29\nNote Purchase Agreement between the Company and Mark Burish, dated February 28, 2019, filed as Exhibit 10.1 to the Form 8-K filed on March 6, 2019, and hereby incorporated by reference.\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\n10.30\nWarrant between the Company and Mark Burish, dated February 28, 2019, filed as Exhibit 10.2 to the Form 8-K filed on March 6, 2019, and hereby incorporated by reference.\n10.31\nConsent, Waiver & Modification to Loan and Security Agreement dated March 11, 2019 between Sonic Foundry, Inc. and Partners for Growth V, L.P., filed as Exhibit 10.1 to the Form 8-K filed on March 12, 2019, and hereby incorporated by reference.\n10.32\nEmployment Agreement dated April 22, 2019 between Sonic Foundry, Inc. and Michael Norregaard, filed as Exhibit 10.1 to the Form 8-K filed on April 24, 2019, and hereby incorporated by reference.\n10.33\nRetirement and Transition Agreement dated April 22, 2019 between Sonic Foundry, Inc. and Gary Weis, filed as Exhibit 10.2 to the Form 8-K filed on April 24, 2019, and hereby incorporated by reference.\n10.34\nRetirement and Transition Agreement dated August 5, 2019 between Sonic Foundry, Inc. and Kenneth Minor, filed as Exhibit 10.1 to the Form 8-K filed on August 9, 2019, and hereby incorporated by reference.\n10.35\nAmended and Restated Employment Agreement dated as of August 23, 2019 by and between Sonic Foundry, Inc. and Michael Norregaard, filed as Exhibit 10.1 to the Form 8-K filed on August 29, 2019, and hereby incorporated by reference.\n10.36\nNote Modification Agreement dated November 22, 2019 between Sonic Foundry, Inc. and Mark Burish, filed as Exhibit 10.36 to Form 10-Q filed on February 13, 2020, and hereby incorporated by reference.\n10.37\nLease Agreement between Mediasite KK, as tenant, and Sanji Kato, as landlord, dated November 2, 2019, filed with the March 31, 2020 Form 10-Q and hereby incorporated by reference\n10.38\nLease Agreement between Mediasite KK, as tenant, and Maida Housing Corporation, as landlord, dated April 1, 2014, filed with the March 31, 2020 Form 10-Q and hereby incorporated by reference.\n10.39\nTerm Loan Agreement dated January 30, 2020 between Mediasite KK and Sumitomo Mitsui Banking, filed with the March 31, 2020 Form 10-Q and hereby incorporated by reference.\n10.40\nFirst Amendment to Note Modification Agreement dated March 24, 2020 between Sonic Foundry, Inc. and Mark Burish, filed with the March 31, 2020 Form 10-Q and hereby incorporated by reference.\n10.41\nTerm Loan Agreement dated April 20, 2020 between Sonic Foundry, Inc. and First Business Bank filed as Exhibit 10.1 to the Form 8-K filed on April 23, 2020 and herby incorporated by reference.\n10.42\nDebt Conversion Agreement dated May 13, 2020 between Sonic Foundry, Inc. and Mark Burish filed with the March 31, 2020 Form 10-Q and herby incorporated by reference.\n10.43\nEmployment Agreement dated October 8, 2020 between Sonic Foundry, Inc. and Kelsy Boyd, filed as Exhibit 10.1 to the Form 8-K filed on October 15, 2020, and hereby incorporated by reference.\n10.44\nEmployment Agreement dated October 20, 2020 between Sonic Foundry, Inc. and Joseph Mozden, Jr., filed as Exhibit 10.1 to Form 8-K on October 22, 2020, and hereby incorporated by reference.\n10.45\nEngagement Letter dated as of February 25, 2021 by and between Sonic Foundry, Inc. and Kenneth Minor, filed as Exhibit 10.1 to the Form 8-K filed on March, 1, 2021, and hereby incorporated by reference.\n10.46\nRetirement Transition Agreement dated February 25, 2021 between Sonic Foundry, Inc. and Kelsy Boyd.\n10.47\nForm of Registration Right Agreement between Registrant and four investors, dated July 20, 2021, filed as Exhibit 10 to the Form 8-K on July 30, 2021, and hereby incorporated by reference.\n10.48\nRevolving Credit Agreement, dated July 28, 2021, between Registrant and U.S. Bank National Associated, filed as Exhibit 10.48 to the Form 8-K on August 3, 2021 and hereby incorporated by reference.\n10.49\nLease Agreement between Registrant, as tenant, and West Washington Associates, LLC as landlord, dated June 15, 2021, filed with the June 30, 2021 Form 10-Q and hereby incorporated by reference.\nList of Subsidiaries\n23.1\nConsent of Wipfli LLP, Independent Registered Public Accounting Firm\n31.1\nSection 302 Certification of Chief Executive Officer\n31.2\nSection 302 Certification of Chief Financial Officer\nSection 906 Certification of Chief Executive Officer and Chief Financial Officer\nThe following materials from the Sonic Foundry, Inc. Form 10-K for the year ended September 30, 2021 formatted in Inline Extensible Business Reporting Language (iXBRL): (i) the Consolidated Statements of Operations, (ii) the Consolidated Balance Sheets, (iii) the Consolidated Statements of Comprehensive Loss, (iv) the Consolidated Statements of Stockholder’s Equity, (v) the Consolidated Statements of Cash Flows and (vi) Notes to Consolidated Financial Statements.\nCover Page Interactive Data File (embedded within the Inline XBRL and contained in Exhibit 101)\nRegistrant will furnish upon request to the Securities and Exchange Commission a copy of all exhibits, annexes and schedules attached to each contract referenced in item 10.\n*\nCompensatory Plan or Arrangement\nSonic Foundry, Inc.\nAnnual Report on Form 10-K\nFor the Year Ended September 30, 2021\nSIGNATURES\nPursuant to the requirement of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized.\nSonic Foundry, Inc.\n(Registrant)\nBy:\n/s/ Joe Mozden, Jr.\nJoe Mozden, Jr.\nChief Executive Officer\nDate:\nDecember [ ], 2021\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed by the following persons in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Joe Mozden, Jr.\nChief Executive Officer\nDecember [ ], 2021\n/s/ Ken Minor\nInterim Chief Financial Officer\nDecember [ ], 2021\n/s/ Mark D. Burish\nChair and Director\nDecember [ ], 2021\n/s/ Frederick H. Kopko, Jr.\nDirector and Secretary\nDecember [ ], 2021\n/s/ Brian T. Wiegand\nDirector\nDecember [ ], 2021\n/s/ Nelson A. Murphy\nDirector\nDecember [ ], 2021\n/s/ Taha Jangda\nDirector\nDecember [ ], 2021\n/s/ Bill St. Lawrence\nDirector\nDecember [ ], 2021"
}