{
    "cik": "1046327",
    "company": "REALNETWORKS INC",
    "filing_type": "10-K",
    "filing_date": "2021-03-15",
    "period_of_report": "2020-12-31",
    "sic": "7371",
    "state_of_inc": "WA",
    "state_location": "WA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1046327/0001046327-21-000018-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1046327/000104632721000018/rnwk-20201231.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1046327/0001046327-21-000018.txt",
    "filename": "1046327_10K_2020_0001046327-21-000018.htm",
    "item_1": "Item 1. Business\nOverview\nRealNetworks invented the streaming media category in 1995 and continues to build on its foundation of digital media expertise and innovation, creating a new generation of products and services to enhance and secure our daily lives. In recent years, we have increasingly focused on developing artificial intelligence (AI)-based products and services such as our Secure Accurate Facial Recognition (SAFR) computer vision platform and our Kontxt natural language processing-based message classification and analysis product. We provide our software and services to consumers, mobile carriers, device manufacturers, system integrators, and other businesses.\nConsumers use our digital media products and services to store, organize, play, manage and enjoy their digital media content, either directly from us or through our distribution partners. For 25 years, RealNetworks has advanced the renowned RealPlayer, which has provided millions of people worldwide a powerful way to download, store, organize, and experience the rapidly expanding universe of digital media content, regardless of format. Our SAFR computer vision platform, a key investment initiative for us, enables new applications for security, convenience, and analytics, and is optimized for live video. Our consumer products feature GameHouse Original Stories, a unique IP portfolio of free-to-play mobile games. Our consumer products also include ringback tones, which we license to mobile operators, and our video compression and enhancement technology, which we primarily license to OEMs, including manufacturers of mobile devices, smart TVs, and set-top boxes. Our product line also includes Kontxt, our AI-based platform for categorizing Application to Person (A2P) messages to help messaging aggregators and mobile carriers provide a better customer experience, strengthen customer loyalty, and drive new revenue through text message management, classification and anti-spam.\nThe monetization, distribution, and licensing of our technology products and services are heavily dependent on contracts with third parties, such as mobile carriers, system integrators, and device manufacturers.\nWe were incorporated in 1994 in the State of Washington. Our common stock is listed on the NASDAQ Stock Market under the symbol \"RNWK.\"\nIn this Annual Report on Form 10-K (\"10-K\") for the year ended December 31, 2020, RealNetworks, Inc., together with its subsidiaries, is referred to as \"RealNetworks,\" the \"Company,\" \"we,\" \"us,\" or \"our.\" \"RealPlayer,\" \"RMHD,\" \"RealMedia,\" \"GameHouse,\" \"Kontxt,\" \"SAFR\" and other trademarks of ours appearing in this report are our property.\nSegments\nWe report revenue and operating income (loss) in three segments: (1) Consumer Media, (2) Mobile Services, and (3) Games. RealNetworks allocates to its Consumer Media, Mobile Services, and Games segments certain corporate expenses which are directly attributable to supporting these businesses, including but not limited to a portion of finance, IT, legal, human resources and headquarters facilities. Remaining expenses, which are not directly attributable to supporting these businesses, are reported as corporate items. These corporate items also can include restructuring charges and stock compensation expense.\nAs described in Note 4. Acquisitions and Dispositions, RealNetworks acquired an additional 42% interest in Rhapsody International, Inc. (doing business as Napster) on January 18, 2019, which brought our ownership of Napster's outstanding stock to 84%, thus giving us a majority voting interest. For fiscal periods following the closing of the acquisition, we consolidated Napster's financial results into our financial statements, where Napster was reported as a separate segment. In August 2020, we entered into a Support Agreement in connection with the execution by Napster of a definitive agreement pursuant to which Napster would become a wholly owned subsidiary of MelodyVR Group PLC. The transaction closed on December 30, 2020, resulting in our full disposition of our Napster stake. Effective on the execution of the Napster/MelodyVR merger agreement on August 25, 2020, Napster was treated as discontinued operations for accounting and disclosure purposes. As such, Napster's operating results for the years ended December 31, 2020 and 2019 and financial condition as of December 31, 2019 have been recast to conform to this presentation.\nConsumer Media\nIn our Consumer Media segment, revenue is primarily derived from the licensing of our portfolio of video compression and enhancement technology, also known as codec technology. Codecs are an encoding and decoding technology designed to reduce the amount of bits required to stream or store media content, and modern codecs achieve significant savings in streaming bandwidth and storage costs. Our main codec products are RealMedia High Definition, which we refer to as RealMedia HD or RMHD, and RealMedia Variable Bitrate, or RMVB. Our codec technologies business is primarily focused on the Chinese market, where RMVB remains a prevalent, though declining format.\nWe continue to develop and innovate our video compression and enhancement technology to meet or exceed user demands for increasing compression efficiency and visual quality. We license our codec technology to a variety of electronic equipment, microchip, and integrated circuit manufacturers who embed our codec in their products, including mobile devices,\nlaptops, smart TVs and other devices. To ensure a robust ecosystem for our codec technologies, we also promote the use of our codec technology to producers of media content and users of RealPlayer, thus encouraging the widespread adoption by device manufacturers.\nWe also generate revenue through online sales to consumers of our PC-based RealPlayer subscription products, including our SuperPass service, which provides consumers with access to digital entertainment content for a monthly fee. The RealPlayer media player, our enduring yet continually evolving software product, includes features and services that enable consumers to discover, play, download, manage and edit digital video, stream audio and video, download and save photos and videos from the web, transfer and share content on social networks, and edit their own photo and video content. As part of our RealPlayer download process, we also offer distribution of third-party software products to consumers, which generates additional revenue.\nMobile Services\nMobile Services consists of the various digital media services we provide to mobile and online service providers as software as a service (SaaS) offerings. In recent years, we have increasingly focused on AI-based products and services such as SAFR and Kontxt.\nIncluded in our SaaS offerings are our messaging products, which include our Metcalfe intercarrier messaging service; Kontxt, our AI-based text message management, anti-spam, and classification product; and our ringback tone service. We provide these services to a large number of mobile carriers around the world, although a significant portion of our revenue for this segment results from contracts with a few mobile carriers and one service partner. We also offer business intelligence, subscriber management and billing for the carriers who make our offerings available to their customers. Also included in this segment is our computer vision platform, SAFR (Secure Accurate Facial Recognition) and our RealTimes platform.\nOur Metcalfe intercarrier messaging platform enables operators to send and receive SMS messages worldwide between networks and service providers, regardless of network technology, typically processing billions of SMS messages per day between users on hundreds of different networks. A portion of the revenue we earn from our intercarrier messaging service is based on a revenue-sharing arrangement with one service partner. Our next-generation AI-based mobile messaging platform, Kontxt, evaluates message streams sent from an application to a person (A2P) and classifies those messages into various categories allowing network operators and other service providers to create policies for prioritization and delivery of messages and blocking spam and fraudulent messages, resulting in more efficient text message delivery.\nOur ringback tone services enable callers to hear subscriber-selected music or messages instead of the traditional electronic ringing sound while waiting for the person they have called to answer. We primarily offer ringback tone services via mobile carriers, where, in return for providing, operating and managing the ringback tone service for the carrier customers, we generally enter into revenue-sharing arrangements with the carriers based on monthly subscription fees, content download fees or a combination of such fees paid by subscribers.\nOur photo and video sharing platform, RealTimes, is offered to wireless carriers for integration in their hosted cloud solutions. Within our Mobile Services group, we focus on leveraging current and prospective wireless carrier relationships to increase integration of the RealTimes platform.\nOur computer vision platform, SAFR, detects faces and other types of objects by leveraging AI-based machine learning. We continue to invest in and build industry partnerships for SAFR, typically licensing it to technology partners and system integrators through third-party resellers and directly to end customers. Our SAFR platform is a key investment initiative for us.\nGames\nOur Games segment is focused on the development, publishing, and distribution of casual games, which are offered via mobile devices, digital downloads, and subscription play. Casual games typically have simple graphics, rules and controls, are quick to learn, and often include time-management, board, card, puzzle, word and hidden-object games. Our primary focus is our free-to-play mobile games, most notably our Delicious Bed and Breakfast and our Delicious World games. These free-to-play games generate revenue from player purchases of in-game goods and from advertising displayed to consumers during play.\nOur mobile games are digitally distributed through third-party application storefronts, such as the Apple App Store and Google Play, and are principally offered in North America, Europe and Latin America. Historically, we have also offered premium games that we typically introduce to consumers upon release on a free-trial basis. After reaching a certain level of game play, consumers then have the option of purchasing the full game. Although games previously offered for individual purchase will continue to be available, during 2019, we began to shift our strategy to free-to-play games and away from premium mobile games.\nPC consumers can access and play both our Original Stories and hundreds of third-party games through individual purchases or a subscription service offered through our GameHouse and Zylom websites, and through websites owned or\nmanaged by third parties. Consistent with our mobile offerings, we have historically introduced new games by offering a free trial before purchase on an individual-game basis or as part of one of our subscription services.\nSee Note 18. Segment Information, in this 10-K for additional details on our segments and geographic concentrations.\nCustomers\nOur customers include consumers and businesses located throughout the world. Sales to customers outside the U.S., primarily in Europe and Asia, were 36% and 40% of our revenue during the years ended December 31, 2020 and 2019, respectively. See Note 18. Segment Information, for details on geographic concentrations, and see Note 6. Allowance for Doubtful Accounts Receivable and Sales Returns, for details on customer revenue concentrations.\nResearch and Development\nWe devote a substantial portion of our resources to developing new products, enhancing existing products, expanding and improving our fundamental technology, and strengthening our technological expertise in all our businesses.\nSales, Marketing and Distribution\nOur marketing programs are aimed at increasing brand awareness of our products and services and stimulating demand. We use a variety of methods to market our products and services, including paid search advertising, affiliate marketing programs, electronic and other online media, and email offers to qualified potential and existing customers, and providing product specific information through our websites. We also cross-market products and services offered by some of our businesses through the RealPlayer and Games marketing and distribution channels. We have subsidiaries and offices in several countries that market and sell our products outside the U.S.\nOur products and services are marketed through direct and indirect channels. We use public relations, trade shows, events and speaking opportunities to market our products and services. We also use a variety of online channels, including social media, to promote and sell our products and services directly.\nIn our Consumer Media business, we market and sell our various RealPlayer services directly through our own websites such as Real.com, as well as indirectly through third party distribution partners. We also employ a sales team in China which works with distribution partners on marketing our codec technologies.\nOur Mobile Services sales, marketing and business development teams works closely with many of our enterprise, infrastructure, wireless, broadband, media and governmental customers to identify new business opportunities for our entertainment applications, services and systems. Through ongoing communications with the product and marketing divisions of our customers, we tailor our SaaS offerings to their strategic needs and the needs of their subscribers.\nIn our Games business, we market directly from our GameHouse and Zylom websites and through third-party distribution channels, such as application storefronts, search engines, online portals, and content publishers.\nCustomer Support\nCustomer support is integral to the provision of nearly all of our consumer products and services. Consumers who purchase and use our consumer software products and services can get assistance primarily via the Internet or email, depending on the product or service. For some of our consumer products, we contract with third-party outsource support vendors to provide the primary staffing for our first-tier customer support globally. We also provide various support service options for our business customers and for software developers using our software products and associated services. Support service options include online support services and on-site support personnel covering technical and business-related support topics.\nCompetition\nThe market for software and services for digital media delivery over the Internet and wireless networks is intensely competitive. Many of our current and potential competitors have longer operating histories, greater name recognition or brand awareness, more employees or significantly greater resources than we do.\nIn our Consumer Media segment, our codec technology faces competition from other next-generation video codecs, and many of our competitors have come together in patent pools to market and license a shared codec solution that competes with our own codecs. This coalition of multiple companies, which include some of the largest global technology companies, benefits from a significant inherent market penetration and, thus, a substantial competitive advantage over us. In addition, our RealPlayer media player continues to face competition from alternative streaming media playback applications that have obtained very broad market penetration.\nIn our Mobile Services segment, our SaaS business competes with a large and diverse number of domestic and international companies, and each of our SaaS offerings tends to face competitors specific to that product or service. Our SaaS\nbusiness continues to experience significant competitive pricing pressure from carriers and the proliferation of smartphone applications and services, some of which do not depend on our carrier customers for distribution to consumers. Many of our SaaS services require a high degree of integration with carrier or service provider networks and thus require a high degree of operational expertise. Our ability to enhance services with new features as the digital entertainment market evolves is critical to our competitive position, as is our knowledge of the consumer environment to which these services are targeted. Also within our Mobile Services segment, our computer vision SAFR platform competes with a wide variety of companies, including small startups and well established, heavily resourced global companies. These competitors continue to develop technologies and launch products in the artificial intelligence and facial recognition markets.\nOur Games business competes with a variety of distributors and publishers of casual games for PC and mobile platforms. Our in-house game development studios compete with other developers and publishers of mobile games based on our ability to create high quality games that resonate with consumers, and our ability to secure broad distribution.\nIntellectual Property\nWe maintain patents in the U.S. and other jurisdictions relating to various aspects of our technology. We regularly analyze our patent portfolio and prepare additional patent applications on current and anticipated features of our technology, or sell or abandon patents or applications that are no longer relevant or valuable to our operations.\nIn addition to our patent portfolio, we have assembled, over time, an international portfolio of trademarks and service marks that covers certain of our products and services. We also have applications pending for additional trademarks and service marks in jurisdictions around the world, and have several unregistered trademarks. Many of our marks begin with the word “Real” (such as RealPlayer). We are aware of other companies that use “Real” in their marks alone or in combination with other words, and we do not expect to be able to prevent all third-party uses of the word “Real” for all goods and services.\nOur ability to compete across our businesses partly depends on the superiority, uniqueness and value of the technology that we both develop and license from third parties. To protect our proprietary rights, we rely on a combination of patent, trademark, copyright and trade secret laws, confidentiality agreements with our employees and third parties, and protective contractual provisions. These efforts to protect our intellectual property rights may not be effective in preventing misappropriation of our technology, or may not prevent the development and design by others of products or technologies similar to or competitive with those we develop.\nHuman Capital\nRecognizing that our employees are the company’s most meaningful asset, RealNetworks is committed to employing great people, treating each other with respect, and strictly adhering to the highest ethical and legal principles in its business activities. Each of our business units - Mobile Services, Consumer Media, and Games - have unique brands and products tied together by a workforce that is focused on excellence and on providing industry-leading technologies, applications, and products. This structure strongly informs our corporate culture: We strive to run a lean, agile organization that prioritizes innovation in all facets of our work.\nGuiding Management Principles\nPart of the fabric of the organization and key to the operation of a performance-based environment are our management principles including commitment to innovation, delivering results, raising the bar in all facets of our work, being inclusive and respectful, being great teammates for each other, and embracing the journey by working hard and celebrating our successes. We consider our workforce a significant competitive advantage and actively seek opportunities to reinforce behaviors that exemplify our management principles. We celebrate employees whose work and actions reflect and embody our management principles with company-wide acknowledgment and awards.\nRespectful and Safe Workplace\nWe want RealNetworks to be a workplace that is open, respectful and safe. RealNetworks encourages and expects the individual actions of its employees at all levels to be consistent with our commitment to a respectful workplace including annual reconfirmation of individual employees’ adherence to our Global Code of Conduct and Ethics. RealNetworks has been and will continue to be fully committed to providing a work environment free from unlawful discrimination or harassment. Our global policies include prohibition of harassment, threatened or actual workplace violence, or any conduct that undermines an employee’s integrity or creates an intimidating, hostile or offensive work environment even if it does not rise to the level of illegal harassment under the law.\nRealNetworks is committed to providing a safe and healthy work environment for all employees in compliance with occupational health, safety, and environmental laws. To accomplish this, RealNetworks and its employees adhere to work practices that will prevent accidents, injuries, and illnesses. We consider safety and health issues to be the responsibility of every employee of RealNetworks and we strive to maintain a preventative and cooperative attitude relating to safety issues.\nWe have had a heightened focus on the safety of our employees and their families during the COVID-19 pandemic. In early March 2020, we quickly pivoted to a predominantly remote workforce and restricted employee travel. We have since followed guidance from local health experts to ensure our staff across the globe remain safe. We helped our employees with home office set up and added new system applications to foster virtual collaboration. We have also implemented mitigation practices in all offices to ensure employees are safe when on-site. We will continue to prioritize the well-being of our employees as the pandemic continues.\nCompensation and Benefits\nWe operate in a highly competitive, global, and technologically challenging environment. We provide competitive compensation and benefits programs for our employees. In addition to market competitive salaries, we offer additional compensation in the forms of bonuses and stock, which will vary based on job level and location.\nOur U.S. benefit programs include a 401(k) plan with employer matching, medical, dental and vision insurance, health savings and flexible spending accounts, group and voluntary life and disability insurance, business/travel and accident coverage, subsidized transit programs, paid time off, paid family leave including bonding time for new parents, financial literacy programs, and employee assistance programs. Our benefit programs in our international locations are tailored to local practices and compliant with local labor laws.\nTalent Acquisition and Retention\nRealNetworks strives to attract and retain a highly skilled, highly talented, and diverse work force. We recognize that we operate in a highly competitive, globally diverse marketplace when it comes to finding top talent. As a result, talent acquisition and the retention of employees continue to be a priority initiative for RealNetworks, and the Company complies with all applicable local, state, federal, and international laws governing nondiscrimination in employment in every location in which RealNetworks operates. All applicants and employees are treated with the same high level of respect regardless of their gender, ethnicity, religion, national origin, age, marital status, political affiliation, sexual orientation, gender identity, disability or protected veteran status.\nIn 2020, we implemented an Affirmative Action Plan, or AAP, as required by our new U.S. government contractor status. As part of our AAP, we will conduct annual internal reporting and auditing to ensure we are providing equal employment and pay opportunities for all applicants and existing employees. Equally important, we hope that this regular focus on the diversity of our U.S. workforce will make for a more dynamic culture and inclusive workplace.\nRealNetworks maintains a global, ongoing performance review program, and encourages mentoring, stretch assignments, and other opportunities for internal career and occupational growth. Our median employee tenure is just over 5 years. We have a long-demonstrated history of employee advancement and promotion from within the organization. We also provide a variety of tools and methods for employees to provide feedback to managers and company leadership including global and local town hall forums, employee surveys, performance review discussions, and anonymous reporting tools.\nCorporate Giving\nRealNetworks has a strong history of giving back to the community. In 2000, the Company created the RealNetworks Foundation, which in recent years has generally made two annual grants to multiple charities, totaling about $1 million in annual charitable grants. The Foundation also makes ad hoc, emergency grants when deemed needed to support an urgent issue in the community. In 2020, our Foundation donated $500,000 to charities supporting racial justice and $500,000 to charities supporting COVID-19 relief. In addition, the Foundation's matching program supports the dollars and time that RealNetworks employees devote to eligible 501(c)(3) nonprofits.\nRealNetworks also regularly supports participation by employees in activities of service to our local communities, including Day of Caring, local food drives and holiday toy and gift donations.\nEmployees\nAt December 31, 2020, we had approximately 325 employees, of which 101 were based in the Americas, 59 were based in Asia, and 165 were based in Europe. The number of our employees represented by unions is not significant.\nAvailable Information\nOur corporate Internet address is www.realnetworks.com. We make available free of charge on www.investor.realnetworks.com our annual reports on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K, and amendments to these reports, as soon as reasonably practicable after we electronically file such material with, or furnish it to, the Securities and Exchange Commission (SEC). However, the information found on our corporate website is not part of this or any other report.",
    "item_1A": "Item 1A. Risk Factors\nYou should carefully consider the risks described below together with all of the other information included in this Form 10-K. The risks and uncertainties described below are not the only ones facing our company. Additional risks and uncertainties not presently known to us or that we presently deem less significant may also impair our business operations. If any of the following risks actually occurs, our business, financial condition or operating results, and the trading price of our common stock, could be materially harmed.\nRisks Related to the COVID-19 Pandemic\nOur operating plans and financial condition have been adversely affected by the various impacts of the COVID-19 pandemic, and we expect to experience continued adverse effects in future periods in connection with the ongoing public health and safety, governmental, and economic implications.\nIn March 2020, the World Health Organization declared the outbreak of the novel coronavirus that causes COVID-19 to be a global pandemic. As the virus spread throughout 2020, across the U.S. and the world, authorities implemented numerous measures to contain the virus, including travel bans and restrictions, quarantines, shelter-in-place orders, business limitations, and shutdowns. In addition to the pandemic's widespread impact on public health and global society, reactions to the pandemic as well as measures taken to contain the virus initially caused significant turmoil to the global economy and financial markets. To address the public health and safety concerns, we have taken steps to support the health and well-being of our employees, customers, partners and communities, which include working remotely and learning to operate our businesses in a fundamentally different way.\nTo date, we have had to change certain strategy and product plans in order to address implications of the pandemic to our businesses, in particular, to our growth initiatives. Although forced to furlough some employees in the early days of the pandemic, we were able to bring those employees back to work during the second quarter of 2020. We also reduced expenditures during the year in an effort to efficiently manage our businesses in the restricted and uncertain climate, although we continue to face risk related to fixed facilities costs given the uncertain post-pandemic future of the use of physical office space. In addition, the initial turmoil in financial markets contributed to significant downward pressure on our stock price early in the pandemic. We cannot provide assurance that the actions we have taken will be sufficient, or that conditions will improve as the pandemic, and reactions thereto, continue to evolve.\nThe COVID-19 pandemic and the resultant economic instability and financial market turmoil has added complexity, uncertainty and risk to nearly all aspects of our business. We are unable to fully predict the near-term and long-term impacts that the pandemic will have on our results from operations, financial condition, liquidity and cash flows for fiscal 2021 or beyond.\nRisks Related to our Strategy\nOur growth initiatives could take longer than planned, be unsuccessful, or deplete our cash resources, any of which would have a material adverse effect on the performance of our businesses and financial results, and could cause us to pursue additional debt or other funding sources.\nIn recent years, we have developed new products and technologies, and funded initiatives, intended to create growth in our businesses, while simultaneously taking steps to reduce costs and increase profitability. These growth initiatives, several of which have been unsuccessful over recent years, have impacted all segments of our organization, requiring us to allocate limited resources among our diverse business units. Our financial sustainability is largely dependent on the success of our growth initiatives, and there are many risks to that success, some of which are internal to our company, including our ability to develop and monetize our products and services, and some of which are externally driven and outside of our control, such as the potential impact of macroeconomic pressures and global pandemics. In particular, we expect that progress with our growth initiatives will be negatively impacted by various reactions to the global outbreak of the coronavirus that causes COVID-19, such as travel restrictions, community lockdowns, tightening of corporate budgets, reduction in consumer confidence, and instability in financial markets. We cannot predict the duration or severity of these reactions or impacts to our business and, if prolonged, our cash reserves may prove insufficient, requiring us to pursue additional debt or other funding sources.\nGiven the ambitious and significant nature of our growth initiatives, there is substantial risk that we may be unsuccessful in implementing our plans in a timely manner, our cash reserves may be depleted or insufficient to fully implement our plans, our growth initiatives may not gain adequate momentum, or the combination of our growth initiatives and cost reductions may not prove to be profitable. Moreover, our acceptance of outside funding for any of our growth businesses, such as Scener's 2020 fundraising, exposes us to new risks and potential liabilities, including possible payment obligations and securities liability. Our business would suffer, and our operational results and financial outlook would be negatively impacted to a significant degree in the event that any of our growth initiatives fail.\nIn August 2019, RealNetworks and Napster entered into a loan agreement with a third-party financial institution. Following the December 2020 sale of Napster to MelodyVR, the loan agreement was amended to remove Napster as a co-borrower and, among other modifications, to reduce the amount available under the revolving line of credit to a maximum of $6.5 million. The loan agreement, as amended, matures August 1, 2022 and contains customary covenants, including financial covenants, minimum EBITDA levels, and maintaining an unrestricted cash balance of $1.5 million. We have not had a debt facility in our recent past, therefore the entry into this facility has introduced new risks to the company, including the risk that constraints around covenants may lead to less flexibility in operational decision making, the risk of default and various implications thereof, and the potential increase in liabilities on our balance sheet in the event that we draw down the line of credit.\nIn April 2020, following an assessment of eligibility and upon approval by our Board of Directors, RealNetworks issued a promissory note in the principal amount of $2.9 million pursuant to the Paycheck Protection Program, or PPP, of the CARES Act. In May 2020, Napster, then-majority owned by RealNetworks though it maintained distinct legal status and control, issued its own promissory note in the principal amount of $1.7 million pursuant to the PPP. On April 23, 2020, the Small Business Administration issued new guidance that introduced some uncertainty as to whether a public company with substantial market value and access to capital markets would qualify for participation in the PPP. Subsequently, on April 28, 2020 the Secretary of the Treasury and Small Business Administration announced that the government would review all PPP loans of more than $2 million for which the borrower applied for forgiveness. While we believe that RealNetworks and Napster fully qualified for the loans, should we be audited or reviewed by the U.S. Department of the Treasury as a result of filing an application for forgiveness or otherwise, such audit or review could result in the diversion of management’s time and attention and legal and reputational costs. RealNetworks applied for forgiveness of its PPP loan in January 2021; Napster applied for forgiveness of its PPP loan in December 2020. If an audit were to be conducted and an adverse finding received, all or a portion of the PPP loan could be required to be returned, which would reduce our liquidity and potentially result in fines and penalties.\nThe inability to obtain additional debt, whether through draws on our current line of credit or through a new debt facility, or the raising of funds through other means, could negatively impact our liquidity and ability to invest in our growth initiatives, or cause us to consider funding that would impact our governance structure. The occurrence of these or any of the risks described above would impair our financial results and stock price.\nWe need to successfully monetize our new products and services in order to sustain and grow our businesses, and manage our cash resources.\nIn order to sustain our current level of business and to implement our growth initiatives, we must successfully monetize our new products and services, including through existing and new relationships with distribution partners, establishing new sales channels, and managing new supply chains. Our digital media products and services must be attractive and useful to distribution partners and end users. The successful acceptance and monetization of these products and services, therefore, is subject to unpredictable and volatile factors beyond our control, including end-user preferences, competing products and services, the rapid pace of change in the market, the effectiveness of our distribution channels, and significant global crises. Any failure by us to timely and accurately anticipate consumers’ changing needs and preferences, emerging technological trends and data privacy norms, or changes in the competitive or regulatory landscape for our products and services could result in a failure to monetize our new products or the loss of market opportunities, both of which we have experienced at various times in our past.\nMoreover, in order to grow our new businesses, we must make long-term investments, develop or obtain appropriate intellectual property and commit significant resources before knowing whether the products and services that we are developing or have introduced will meet the demands of the relevant market. As we have experienced, we may not realize a sufficient return, or may experience losses, on these investments, thereby further straining our limited cash resources and negatively affecting our ability to pursue other needed growth or strategic opportunities.\nSustaining and growing our businesses, and managing our cash resources, are subject to these risks inherent in developing, distributing and monetizing our new products and services. Our failure to manage these risks could further impair our operations and financial results to a material degree, and could cause an unsustainable depletion of our cash resources.\nFurthermore, our products and services have been in the past and may be in the future subject to legal challenge. Responding to any such claims may require us to enter into royalty and licensing agreements on unfavorable terms, require us to stop distributing or selling, or to redesign our products or services, or to pay damages, any of which could constrain our growth plans and cash resources.\nOur businesses, including in connection with our growth initiatives, face substantial competitive challenges that may impair our success, thus negatively impacting our future growth.\nOur digital media products and services, including legacy and products/services central to our growth initiatives, face a wide variety of competitors, many of which have longer operating histories, greater name or brand recognition, deeper and more expansive market penetration, more employees, and significantly greater resources than we do. In addition, current and potential competitors may include relatively new businesses that develop or use innovative technologies, products or features that could disrupt the market for technologies, products or features that we currently develop and market or seek to develop and market. In attempting to compete with any or all of these competitors, we may experience, as we have in the past, some or all of the following consequences, any of which would adversely affect our operating results and the trading price of our stock:\n•reduced prices or margins;\n•loss of current and potential customers, or partners and potential partners who distribute our products and services or who provide content that we distribute to our customers;\n•changes to our products, services, technologies, licenses or business practices or strategies;\n•lengthened sales cycles;\n•inability to meet demands for more rapid sales or development cycles;\n•industry-wide changes in content distribution to customers or in trends in consumer consumption of digital media products and services;\n•pressure to prematurely release products or product enhancements; or\n•degradation in our stature or reputation in the market.\nOur Consumer Media technologies for media playback and production (RealPlayer, RealMedia VB and RealMedia HD) compete with alternative media playback technologies and audio and video content formats that have obtained broad market penetration. RealMedia VB and RealMedia HD are codecs, technology that enables compression and decompression of the media content in a (usually proprietary) format. We license our codec technology primarily to computer, smartphone and other mobile device manufacturers, and also to other partners that can support our efforts to build a strong ecosystem, like content providers and integrated circuit developers. To compete effectively, codec technologies must appeal to, and be adopted for use by, a wide range of parties: producers and providers of media content, consumers of media content, and device manufacturers who pre-load codec technologies onto their devices. Our ability to sustain or grow this business, which has recently experienced downward pressure, is dependent on the successful promotion and adoption of our codec technologies to a wide and diverse target market, which is a complex and highly uncertain undertaking. If we are unable to compete successfully, our Consumer Media business could decline as it has in the recent past or on a more accelerated basis.\nThe market for our Mobile Services business is highly competitive and continues to rapidly evolve. Our SaaS services face competition from a proliferation of applications and services, many of which carriers can deploy or offer to their subscribers, or which consumers can acquire independently of their carrier. We expect pricing pressure in this business to continue to materially impact our operating results in this business. Our Mobile Services growth initiatives compete with a wide variety of companies, as small startups and well established, heavily resourced global companies race to develop AI-based technologies and launch products in the computer vision market. The success of these initiatives is highly dependent on our ability to differentiate our product offering within this highly competitive environment.\nThe branded services in our Games business compete with other developers, aggregators and distributors of mobile, online, and downloadable games. Our competitors vary in size and capabilities, some of which have high volume distribution channels and greater financial resources than we do; while others may be smaller and more able to quickly or efficiently adjust to market conditions. We also face significant price competition in the casual games market, as our competitors increasingly focus on free-to-play games or reduce prices more aggressively. We expect competition to continue to intensify in this market. Our games development studios compete primarily with other developers of mobile, online, and downloadable games, and must continue to develop popular and high-quality game titles. Our Games business must also continue to execute on opportunities to expand the play of our games on a variety of non-PC platforms, including mobile, in order to maintain our competitive position and to grow the business. Moreover, continued growth in our Games business is in part dependent on the availability of funds to invest in marketing, which availability cannot be assured.\nRisks Related to our Operations\nThe distribution and license of our technology products and services are governed by contracts with third parties, the terms of which subject us to significant risks that could negatively impact our revenue, expenses and assumption of liability related to such contracts.\nIn our Consumer Media and Mobile Services segments, we distribute and license most of our technology products and services pursuant to contracts with third parties, such as mobile carriers and their partners, online service providers, and OEMs and device manufacturers, many of whom may have stronger negotiating leverage due to their size and reach. These contracts govern the calculation of revenue generated and expenses incurred, how we recognize revenue and expenses in our financial statements, and the allocation of risk and liabilities arising from the product or service or distribution thereof. Terms impacting revenue, over which we may have limited if any control, may involve revenue sharing arrangements, end user pricing, usage levels, and exclusivity, all of which significantly affect the level of revenue that we may realize from the relationship.\nMoreover, contract terms around marketing and promotion of our products and other expense allocation could result in us bearing higher expenses or achieving weaker performance than we had anticipated from the relationship.\nIn addition, although our contracts with third parties are typically for a fixed duration, they could be terminated early; and they may be renegotiated on less favorable terms or may not be renewed at all by the other party. We must, therefore, seek additional contracts with third parties on an ongoing basis to sustain and grow our business. We expect to face continuing and increased competition for the technology products and services we provide, and there is no assurance that the parties with which we currently have contracts will continue or extend current contracts on the same or more favorable terms, or that we will obtain alternative or additional contracts for our technology products and services. As we have experienced over the past several years relating to our technology sales in China, the further loss of existing contracts, the failure to enter new contracts, or the deterioration of customer creditworthiness or the terms in our contracts with third parties could continue to materially harm our operating results, financial condition, and cash flow.\nNearly all of our contracts in which we provide to another party services or rights to use our technology include some form of obligation by us to indemnify the other party for certain liabilities and losses incurred by them, including liabilities resulting from third party claims for damages that arise out of the use of our technology. These indemnification terms provide us with certain procedural safeguards, including the right to control the defense of the indemnified party. We have in the past incurred costs to defend and settle such claims. Claims against which we may be obligated to defend others pursuant to our contracts could in the future result in payments that could materially harm our business and financial results.\nIn our Games segment, we rely on third-party platforms to distribute our games and collect revenue from players. We are subject to the standard terms and conditions that these platform providers have for application developers, which govern the content, promotion, distribution, operation of games and other applications on their platforms, as well as the terms of the payment processing services provided by the platforms, and which the platform providers can change unilaterally on short notice or without notice. If our platform providers do not perform their obligations in accordance with our platform agreements, our operations and financial condition could be adversely impacted. Moreover, Internet-connected devices and operating systems controlled by third parties increasingly contain features that allow device users to disable functionality that allows for the delivery of advertising on their devices, including through Apple’s Identifier for Advertising, or IDFA, or Google’s Advertising ID, or AAID, for Android devices. Device and browser manufacturers may include or expand these features as part of their standard device specifications. For example, Apple's upcoming iOS update is expected to require app users to affirmatively opt in for their IDFA to be accessed by an app. In the likely event that a significant percentage of players decline to opt in, our ability to run effective user acquisition campaigns may be challenged potentially causing our spending to increase, and our advertising revenue may decline, thus harming our financial results.\nOur operating results are difficult to predict and may fluctuate, which may contribute to weakness or volatility in our stock price.\nThe trading price for our common stock has been in steady decline for many years, though, particularly more recently, has also been vulnerable to significant volatility caused by general market conditions or unusual stock-specific trading activity. There can be no assurance that our common stock will not experience additional, and potentially more significant, volatility in the future caused by unpredictable external factors. In addition, as a result of the rapidly changing markets in which we compete, and restructuring, impairment and other one-time events specific to us, our operating results may fluctuate or decline from period to period, which may contribute to weakness or volatility in our stock price. Moreover, the general difficulty in forecasting our operating results and identifying meaningful performance metrics, especially when factoring in our growth initiatives, could result in actual results that differ materially from expected results, again causing weakness and volatility in our stock price. Compounding these internal factors are external factors, such as the significant instability in global financial markets experienced over the past year, that will impact our operating results and stock price, potentially driving our stock price to record lows as occurred in 2020 or to significant activity levels as occurred in early 2021.\nThe difficulty in forecasting our operating results may also cause over or under investment in certain growth initiatives, as such investment is often planned based on expected financial results, thus causing more severe fluctuations in operating results and, likely, further volatility in our stock price.\nFurther, because our common stock is listed on the Nasdaq Global Market, we must meet Nasdaq's continued listing requirements, in particular, financial requirements that include maintaining a minimum bid price of at least $1.00. In April 2020, we received a letter from the Listing Qualifications Department of the Nasdaq Global Market indicating that, based upon the closing bid price of our common stock for the 30 consecutive business day period from March 11, 2020 to April 23, 2020, we did not meet the minimum bid price of $1.00 per share required for continued listing on Nasdaq. In June 2020, we received a second letter from Nasdaq Staff indicating that we had regained compliance with Nasdaq Listing Rule 5450(a)(1) based on its determination that the closing bid price of our common stock had been at $1.00 per share or greater for the 10 business days from May 15 to May 29, 2020. Although we are currently in compliance with all applicable continued listing requirements and have received no contradictory notification from Nasdaq, our stock price could again fall below the $1.00 minimum as a result of valuation pressure, stock-specific trading activity or general declines in the stock market. We regularly monitor our\ncompliance with Nasdaq's continued listing requirements, and, as necessary, our Board will consider the implementation of various measures intended to support continued compliance.\nAny impairment to our goodwill, definite-lived, and right-of-use operating lease assets could result in a material charge to our earnings.\nIn accordance with GAAP, we test goodwill for possible impairment on an annual basis or more frequently in the event of certain indications of possible impairment. We review definite-lived and operating lease assets for impairment whenever events or changes in circumstances indicate the carrying amount of such assets may not be recoverable. These events or circumstances could include a significant change in the business climate, including a significant sustained decline in a reporting unit’s fair value, changes in our operating plans and forecasts, legal factors, operating performance indicators, competition, sale or disposition of a significant portion of our business, a significant sustained decline in our market capitalization and other factors. If we were to determine that an impairment had occurred, we would be required to record an impairment charge, which could have a material negative, and unanticipated, impact on our financial results.\nContinued loss of revenue from our subscription services is likely to cause further harm to our operating results.\nOur operating results have been and will continue to be adversely impacted by the loss of subscription revenue related to our more traditional products and services. Subscribers cancel their subscriptions to our services for many reasons, including a perception that they do not use the services sufficiently or that the service does not provide enough value, a lack of attractive or exclusive content generally or as compared with competitive service offerings, or because customer service issues are not satisfactorily resolved. Revenue from our SuperPass subscription service, for example, has continued to decline over several periods, due to changes in consumer preferences and changes on our part to focus on other products and services we offer, and we expect this trend to continue.\nDifficulty recruiting and retaining key personnel could significantly impair our operations or jeopardize our ability to meet our growth objectives.\nOur success depends substantially on the contributions and abilities of certain key personnel, and we cannot provide assurance that we will be able to retain them in the near term or recruit them in the future. In 2020, we experienced a significant level of executive turnover, as we have experienced in the past and could experience in the future, which could impact our ability to retain key personnel. Also, qualified individuals are in high demand and competition for such qualified personnel in our industry, particularly engineering talent, is extremely intense, and we may incur significant costs to attract or retain them. Changes in immigration or other policies in the U.S. or other jurisdictions that make it more difficult to hire and retain key talent, or to assign individuals to any of our locations as needed to meet business needs, could adversely affect our ability to attract key talent or deploy individuals as needed, and thereby adversely affect our business and financial results. Further, repeated restructuring of our businesses and related cost-reduction efforts, as well as declines and volatility in our stock price, have caused instability in our workforce that makes it more difficult to retain and recruit key personnel. Given these factors, there can be no assurance that we will be able to attract and retain the key personnel necessary to sustain our business or support future growth.\nAcquisitions and divestitures involve costs and risks that could harm our business and impair our ability to realize potential benefits from these transactions.\nAs part of our business strategy, we have acquired and sold technologies and businesses in the past and expect that we will continue to do so in the future. The failure to adequately manage transaction costs and address the financial, legal and operational risks raised by acquisitions and divestitures of technology and businesses could harm our business and prevent us from realizing the benefits of these transactions. In addition, we may identify and acquire target companies, but those companies may not be complementary to our current operations and may not leverage our existing infrastructure or operational experience, which may increase the risks associated with completing acquisitions.\nFor example, our January 18, 2019 acquisition of a controlling interest in Napster represented a significant acquisition for RealNetworks. To effectuate the acquisition and incorporate Napster's financial results into our financial statements, we incurred significant transaction-related costs throughout fiscal year 2019 and early in 2020. Moreover, the 2020 sale of our Napster stake in connection with the merger of Napster and MelodyVR resulted in further significant transaction-related expenses, certain ongoing indemnification obligations, and the payment of a portion of proceeds to a third party.\nTransaction-related costs and financial risks related to completed and potential future purchase or sale transactions may harm our financial position, reported operating results, or stock price. Previous acquisitions have resulted in significant expenses, including amortization of purchased technology, amortization of acquired identifiable intangible assets and incurring charges for the impairment of goodwill and other intangible assets, which are reflected in our operating expenses. New acquisitions and any potential additional future impairment of the value of purchased assets, including goodwill, could have a material negative impact on our future operating results. In compliance with GAAP, we evaluate these assets for impairment at least annually. Factors that may be considered a change in circumstances, indicating that our goodwill or definite-lived assets may not be recoverable, include reduced future revenue and cash flow estimates due to changes in our forecasts, and\nunfavorable changes to valuation multiples and discount rates due to changes in the market. If we were to conclude that any of these assets were impaired, we would have to recognize an impairment charge that could materially impact our financial results.\nPurchase and sale transactions also involve operational risks that could harm our existing operations or prevent realization of anticipated benefits from a transaction. These operational risks include:\n•difficulties and expenses in assimilating the operations, products, technology, information systems, and/or personnel of the acquired company;\n•retaining key management or employees of the acquired company;\n•entrance into unfamiliar markets, industry segments, or types of businesses;\n•operating, managing and integrating acquired businesses in remote locations or in countries in which we have little or no prior experience;\n•diversion of management time and other resources from existing operations;\n•impairment of relationships with employees, affiliates, advertisers or content providers of our business or acquired business;\n•assumption of known and unknown liabilities of the acquired company, including intellectual property claims; and\n•potential impacts to our system of internal controls and disclosure controls and procedures.\nRisks Related to Regulations and Other External Factors\nGovernment regulation of the Internet, facial recognition technology, artificial intelligence and other related technologies is evolving, and unfavorable developments could have an adverse effect on our operating results.\nWe are subject to regulations and laws specific to the marketing, sale and delivery of goods and services. These laws and regulations, which continue to evolve, cover taxation, user privacy, data collection and protection, copyrights, electronic contracts, sales procedures, automatic subscription renewals, credit card processing procedures, consumer protections, digital games distribution, broadband Internet access and content restrictions. We cannot guarantee that we have been or will be fully compliant in every jurisdiction, as it is not entirely clear how existing laws and regulations governing issues such as privacy, taxation and consumer protection apply or will be enforced with respect to the products and services we sell. Moreover, as Internet commerce continues to evolve, increasing regulation and/or enforcement efforts by federal, state and foreign agencies and the prospects for private litigation claims related to our data collection, privacy policies or other e-commerce practices become more likely. In addition, the adoption of any laws or regulations or the imposition of other legal requirements that adversely affect our ability to market, sell, and deliver our products and services could decrease our ability to offer or customer demand for our service offerings, resulting in lower revenue. Moreover, in the U.S., certain states have and more states may impose stricter privacy laws that may impact accepted business practices. We cannot provide assurance that the changes that we have adopted to our business practices will be compliant or that new compliance frameworks such as this will not have a negative impact on our financial results.\nIn addition, through the operation of our SAFR product, we are subject to regulations and laws generally and specifically applicable to the provision of facial recognition technology. New laws and regulations are under discussion and those that exist are untested, thus we cannot guarantee that we have been or will be fully compliant in every jurisdiction. Moreover, the voluntary development of norms, standards, and best practices by companies providing facial recognition and similar technology could require modifications to our technology or practices that may be costly or incompatible with our financial model. Moreover, as we pursue further sales of our SAFR product to governmental agencies, such as the Small Business Innovation Research (SBIR) contracts with the U.S. Air Force in 2020, we may become subject to more extensive contracting rules and standards.\nFuture regulations, or changes in laws and regulations or their existing interpretations or applications, could require us to further change our business practices, raise compliance costs or other costs of doing business and result in additional historical or future liabilities for us, resulting in adverse impacts on our business and our operating results.\nAs a consumer-facing business, we receive complaints from our customers regarding our consumer marketing efforts and our customer service practices. Some of these customers may also complain to government agencies, and from time to time, those agencies have made inquiries to us about these practices. In addition, we may receive complaints or inquiries directly from governmental agencies that have not been prompted by consumers. We cannot provide assurance that governmental agencies will not bring future claims, as they have on occasion in the past, regarding our marketing, or consumer services or other practices.\nWe face financial and operational risks associated with doing business in non-U.S. jurisdictions and operating a global business, that have in the past and could in the future have a material adverse impact on our business, financial condition and results of operations.\nA material portion of our revenue is derived from sales outside of the U.S. and most of our employees are located outside of the U.S. Consequently, our business and operations depend significantly on global and national economic conditions and on\napplicable trade regulations and tariffs. For example, our business in China could be negatively affected by an actual or perceived lack of stability or consistency in U.S.-China trade policy. The growth of our business is also dependent in part on successfully managing our international operations. Our non-U.S. sales, purchases and operations are subject to risks inherent in conducting business abroad, many of which are outside our control, including the following:\n•periodic local or geographic economic downturns and unstable political conditions;\n•price and currency exchange controls;\n•fluctuation in the relative values of currencies;\n•difficulty in repatriating funds, whether as a result of tax laws or otherwise;\n•compliance with current and changing tax laws, and the coordination of compliance with U.S. tax laws and the laws of any of the jurisdictions in which we do business;\n•difficulties protecting intellectual property;\n•compliance with labor laws and other laws governing employees;\n•local labor disputes;\n•changes in trading policies, regulatory requirements, tariffs and other barriers, or the termination or renegotiation of existing trade agreements;\n•impact of changes in immigration or other policies impacting our ability to attract, hire, and retain key talent;\n•potential implications resulting from the outbreak of disease on a global scale or localized in countries in which we do business or have employees; and\n•difficulties in managing a global enterprise, including staffing, collecting accounts receivable, and managing suppliers, distributors and representatives.\nBecause consumers may consider the purchase of our digital entertainment products and services to be a discretionary expenditure, their decision whether to purchase our products and services may be influenced by macroeconomic factors that affect consumer spending such as unemployment, access to credit, negative financial news, and declines in income. In addition, mobile telecommunication carriers and other business partners may reduce their business or advertising spending with us or for our products and services they distribute to users in the face of adverse macroeconomic conditions, such as financial market volatility, government austerity programs, tight credit, and declines in asset values. We have in the past recorded material asset impairment charges due in part to weakness in the global economy, and we may need to record additional impairments to our assets in future periods in the event of renewed weakness and uncertainty in the global or a relevant national economy. Accordingly, any significant weakness in the national and/or global economy could materially impact our business, financial condition and results of operations in a negative manner.\nOur international operations involve risks inherent in doing business globally, including difficulties in managing operations due to distance, language, cultural differences, local economic conditions, outbreak of diseases, different or conflicting laws and regulations, taxes, and exchange rate fluctuations. The functional currency of our foreign subsidiaries is typically the local currency of the country in which each subsidiary operates. We translate our subsidiaries’ revenues into U.S. dollars in our financial statements, and continued volatility in foreign exchange rates may result in lower reported revenue or net assets in future periods. If we do not effectively manage any of the risks inherent in running our international businesses, our operating results and financial condition could be harmed. As another example, the COVID-19 pandemic has resulted in travel and work restrictions globally, and may further disrupt our ability to produce and sell products. We continue to monitor the impacts of the pandemic to our business, as well as rapidly evolving expectations regarding its severity and duration. We are unable to predict the full effects of this pandemic on our operations and financial results.\nOur business is conducted in accordance with existing international trade relationships, and trade laws and regulations. Changes in geopolitical relationships and laws or policies governing the terms of foreign trade, such as the recent rise in protectionist politics and economic nationalism, could create uncertainty regarding our ability to operate and conduct commercial relationships in affected jurisdictions, which could have a material adverse effect on our business and financial results. Additionally, our global operations may also be adversely affected by political events, domestic or international terrorist events and hostilities or complications due to natural or human-caused disasters. These uncertainties could have a material adverse effect on the continuity of our business and our results of operations and financial condition.\nWe may be unable to adequately protect our proprietary rights or leverage our technology assets, and may face risks associated with third-party claims relating to intellectual property rights associated with our products and services.\nOur ability to compete across our businesses partly depends on the superiority, uniqueness and value of our technology, including both internally developed technology and technology licensed from third parties. To protect our proprietary rights, we rely on a combination of patent, trademark, copyright and trade secret laws, confidentiality agreements with our employees and third parties, and protective contractual provisions. Our efforts to protect our intellectual property rights may not assure our ownership rights in our intellectual property, protect or enhance the competitive position of our products, services and technology, or effectively prevent misappropriation of our technology.\nFrom time to time, we receive claims and inquiries from third parties alleging that our technology used in our business may infringe the third parties’ proprietary rights. These claims, even if not meritorious, could force us to make significant investments of time, attention and money in defense, and give rise to monetary damages, penalties or injunctive relief against us. We may be forced to litigate, to enforce or defend our patents, trademarks or other intellectual property rights, or to determine the validity and scope of other parties' proprietary rights in intellectual property. To resolve or avoid such disputes, we may also be forced to enter into royalty or licensing agreements on unfavorable terms or redesign our product features, services and technology to avoid actual or claimed infringement or misappropriation of technology. Any such dispute would likely be costly and distract our management, and the outcome of any such dispute (such as additional licensing arrangements or redesign efforts) could fail to improve our business prospects or otherwise harm our business or financial results.\nNearly all of our contracts by which we provide to another party services or rights to use our technology include some form of obligation by us to indemnify the other party for certain liabilities and losses incurred by them, including liabilities resulting from third party claims for damages that arise out of the use of our technology. Claims against which we may be obligated to defend others pursuant to our contracts expose us to the same risks and adverse consequences described above regarding claims we may receive directly alleging that our trademarks or technology used in our business may infringe a third party's proprietary rights.\nDisputes regarding the validity and scope of patents or the ownership of technologies and rights associated with streaming media, digital distribution, and online businesses are common and likely to arise in the future. We also routinely receive challenges to our trademarks and other proprietary intellectual property that we are using in our business activities. We are likely to continue to receive claims of third parties against us, alleging contract breaches, infringement of copyrights or patents, trademark rights, trade secret rights or other proprietary rights, or alleging unfair competition or violations of privacy rights.\nOur business and operating results will suffer and we may be subject to market risk and legal liability if our systems or networks fail, become unavailable, unsecured or perform poorly so that current or potential users do not have adequate access to our products, services and websites.\nOur ability to provide our products and services to our customers and operate our business depends on the continued operation and security of our information systems and networks and those of our service providers. A significant or repeated reduction in the performance, security or availability of our information systems and network infrastructure or that of our service providers could harm our ability to conduct our business, and harm our reputation and ability to attract and retain users, customers, advertisers and content providers. Many of our products are interactive Internet applications that by their very nature require communication between a client and server to operate.\nWe sell many of our products and services through online sales transactions directly with consumers, and their credit card information is collected and stored by our payment processors. The systems of our third party service providers may not prevent future improper access or disclosure of credit card information or personally identifiable information. We have an extensive privacy policy concerning the collection, use and disclosure of user data involved in interactions between our client, third party payment providers, and server products. A security breach that leads to disclosure of consumer account information, or any failure by us to comply with our posted privacy policy or existing or new privacy legislation, could harm our reputation, impact the market for our products and services, or subject us to litigation. We have on occasion experienced system errors and failures that caused interruption in availability of products or content or an increase in response time. Problems with our systems and networks, or the third party systems and networks that we utilize, could result from a failure to adequately maintain and enhance these systems and networks, natural disasters and similar events, power failures, intentional actions to disrupt systems and networks and many other causes. Many of our services do not currently have fully redundant systems or a formal disaster recovery plan, and we may not have adequate business interruption insurance to compensate us for losses that may occur from a system outage.\nChanges in regulations applicable to the Internet and e-commerce that increase the taxes on the services we provide could materially harm our business and operating results.\nAs Internet commerce continues to evolve, increasing taxation by state, local or foreign tax authorities becomes more likely. For example, taxation of electronically delivered products and services or other charges imposed by government agencies may also be imposed. We collect transactional taxes and we believe we are compliant and current in all jurisdictions where we have a collection obligation for transaction taxes. Any regulation imposing greater taxes or other fees for products and services could result in a decline in the sale of products and services and the viability of those products and services, harming our business and operating results. A successful assertion by one or more states or foreign tax authorities that we should collect and remit sales or other taxes on the sale of our products or services could result in substantial liability for past sales.\nIn those countries where we have a tax obligation, we collect and remit value added tax, or VAT, on sales of “electronically supplied services” provided to European Union residents. The collection and remittance of VAT subjects us to additional currency fluctuation risks.\nChanges in accounting standards and subjective assumptions, estimates, and judgments by management related to complex accounting matters could significantly affect our financial results or financial condition.\nWe prepare our financial statements in conformity with GAAP. These accounting principles are subject to interpretation or changes by the Financial Accounting Standards Board, or FASB, and the SEC, and new accounting pronouncements and varying interpretations of accounting standards and practices have occurred in the past and are expected to occur in the future. Moreover, our financial statements require the application of judgments and estimates regarding a wide range of matters that are relevant to our business, such as revenue recognition, asset impairment and fair value determinations, and the acquisition method of accounting and its related estimated fair value amounts. Changes in accounting standards or practices, or in our judgments and estimates underlying accounting standards and practices, could harm and/or materially impact our operating results and/or financial condition. Changes to existing accounting rules or to our judgments and estimates underlying those rules could materially impact our reported operating results and financial condition.\nWe may be subject to additional income tax assessments and changes in applicable tax regulations could adversely affect our financial results.\nWe are subject to income taxes in the U.S. and numerous foreign jurisdictions. Significant judgment is required in determining our worldwide provision for income taxes, income taxes payable, and net deferred tax assets. In the ordinary course of business, there are many transactions and calculations where the ultimate tax determination is uncertain. Although we believe our tax estimates are reasonable, the final determination of tax audits and any related litigation could be materially different than that which is reflected in our historical financial statements. An audit or litigation can result in significant additional income taxes payable in the U.S. or foreign jurisdictions which could have a material adverse effect on our financial condition and results of operations.\nRisks Related to our Governance and Capital Structure\nOur Chairman of the Board and Chief Executive Officer beneficially owns 38.5% of our common stock, which gives him significant control over certain major decisions on which our shareholders may vote or which may discourage an acquisition of us.\nRobert Glaser, our Chairman of the Board and Chief Executive Officer, beneficially owns 38.5% of our common stock. As a result, Mr. Glaser and his affiliates will have significant influence to:\n•elect or defeat the election of our directors;\n•amend or prevent amendment of our articles of incorporation or bylaws;\n•effect or prevent a merger, sale of assets or other corporate transaction; and\n•control the outcome of any other matter submitted to the shareholders for vote.\nFurthermore, on February 10, 2020, we entered into a Series B Preferred Stock Purchase Agreement with Mr. Glaser pursuant to which Mr. Glaser invested approximately $10.0 million in RealNetworks in exchange for the issuance to him of approximately 8 million shares of our Series B Preferred Stock, par value $0.001 per share. The rights, preferences, limitations, and powers of the Series B Preferred Stock are set forth in and governed by the designation of rights and preferences of Series B Preferred Stock filed with the Secretary of State of the State of Washington. Those rights, preferences, limitations, and powers include the right to proportional adjustment and the right to any dividends or distributions declared with regard to our common stock, but the Series B Preferred Stock has no voting or consent rights, has no liquidation preference, has no preferred dividend, and has limitations on transferability. Each share of Series B Preferred Stock is convertible into one share of our common stock, however no conversion is permitted in the event that it would cause Mr. Glaser’s beneficial ownership of our common stock to exceed the 38.5% threshold set forth in our shareholder rights plan dated November 30, 2018.\nThe stock ownership of Mr. Glaser may discourage a potential acquirer from making a tender offer or otherwise attempting to obtain control of RealNetworks, which in turn could reduce our stock price or prevent our shareholders from realizing a premium over our stock price.\nProvisions of our charter documents, shareholder rights plan, and Washington law could discourage our acquisition by a third party.\nOur articles of incorporation provide for a strategic transactions committee of the board of directors. Without the prior approval of this committee, and subject to certain limited exceptions, the board of directors does not have the authority to:\n•adopt a plan of merger;\n•authorize the sale, lease, exchange or mortgage of assets representing more than 50% of the book value of our assets prior to the transaction or on which our long-term business strategy is substantially dependent;\n•authorize our voluntary dissolution; or\n•take any action that has the effect of any of the above.\nMr. Glaser has special rights under our articles of incorporation to appoint or remove members of the strategic transactions committee at his discretion that could make it more difficult for RealNetworks to be sold or to complete another change of control transaction without Mr. Glaser’s consent. RealNetworks has also entered into an agreement providing Mr. Glaser with certain contractual rights relating to the enforcement of our charter documents and Mr. Glaser’s roles and authority within RealNetworks. These rights and his role as Chairman of the Board of Directors, together with Mr. Glaser’s significant beneficial ownership, create unique potential for concentrated influence of Mr. Glaser over potentially material transactions involving RealNetworks and decisions regarding the future strategy and leadership of RealNetworks.\nWe adopted a shareholder rights plan in December 1998, which was amended and restated in December 2008, amended in April 2016 and February 2018, and again amended and restated in November 2018. The plan provides that shares of our common stock have associated preferred stock purchase rights, the exercise of which would make the acquisition of RealNetworks by a third party more expensive to that party, having the effect of discouraging third parties from acquiring RealNetworks without the approval of our board of directors, which has the power to redeem these rights and prevent their exercise.\nWashington law imposes restrictions on some transactions between a corporation and certain significant shareholders. The foregoing provisions of our charter documents, shareholder rights plan, our agreement with Mr. Glaser, and Washington law, as well as our charter provisions that provide for a classified board of directors and the availability of “blank check” preferred stock, could have the effect of making it more difficult or more expensive for a third party to acquire, or of discouraging a third party from attempting to acquire, control of us. These provisions may therefore have the effect of limiting the price that investors might be willing to pay in the future for our common stock.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNone.",
    "item_2": "Item 2. Properties\nOur corporate and administrative headquarters and certain research and development and sales and marketing personnel are located at our facility in Seattle, Washington.\nWe lease properties primarily in the following locations that are utilized by all of our business segments, unless otherwise noted below, to house our research and development, sales and marketing, and general and administrative personnel:\nLocation Area leased\n(sq. feet)\nLease expiration\nSeattle, Washington (1) 73,000 August 2024, with an option to\nrenew for two five-year periods\nEindhoven, Netherlands (2) 23,000 June 2022\n(1)This facility is utilized only by headquarters. We have reduced our use of the facility by 63%. The space which we no longer occupy as of December 31, 2020 is currently under sublease for all or a portion of the remaining lease term.\n(2)This facility is utilized only by our Games segment.\nIn addition, we lease smaller facilities in the U.S. and foreign countries, some of which support the operations of all of our business segments while others are dedicated to a specific business segment. We believe that our properties are in good condition, adequate and suitable for the conduct of our business. For additional information regarding our obligations under leases, see Note 15. Leases, in this 10-K.",
    "item_3": "Item 3. Legal Proceedings\nSee Note 16. Commitments and Contingencies in this 10-K.",
    "item_4": "Item 4. Mine Safety Disclosures\nNot applicable.\nPART II.",
    "item_5": "Item 5. Market for Registrant’s Common Equity, Related Shareholder Matters and Issuer Purchases of Equity Securities\nOur common stock is traded on The NASDAQ Stock Market under the symbol RNWK.\nAs of January 29, 2021, there were approximately 162 holders of record of our common stock. Most shares of our common stock are held by brokers and other institutions on behalf of shareholders.\nThe declaration and payment of any future dividends, as well as the amount thereof, are subject to the discretion of our board of directors and will depend upon our results of operations, financial condition, capital levels, cash requirements, future prospects and other factors deemed relevant by our board of directors. Accordingly, there can be no assurance that we will declare and pay any dividends in the future. No cash dividends were paid in 2020 or 2019.",
    "item_6": "Item 6. Selected Financial Data\nNot applicable.",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nOverview\nRealNetworks invented the streaming media category in 1995 and continues to build on its foundation of digital media expertise and innovation, creating a new generation of products and services to enhance and secure our daily lives. We manage our business and report revenue and operating income (loss) in three segments: (1) Consumer Media (2) Mobile Services, and (3) Games.\nWithin our Consumer Media segment, revenue is derived from the software licensing of our video compression and enhancement, or codec, technologies, including primarily from our prior-generation codec RealMedia Variable Bitrate, or RMVB, as well as our newer codec technology, RealMedia High Definition, or RMHD. We also generate revenue from the sale of our PC-based RealPlayer products, including RealPlayer Plus and related products. These products and services are delivered directly to consumers and through partners, such as OEMs and mobile device manufacturers.\nOur Mobile Services business generates revenue primarily from the sale of subscription services, which include our intercarrier messaging service and ringback tones, as well as through software licenses for the integration of our RealTimes platform and certain system implementations. We generate a significant portion of our revenue from sales within our Mobile Services business to a few mobile carriers. Our Mobile Services segment also includes our computer vision platform, SAFR, which includes facial recognition technology that leverages artificial intelligence-based machine learning.\nOur Games business generates revenue primarily through the development, publishing, and distribution of casual games under the GameHouse and Zylom brands. Games are offered via mobile devices, digital downloads, and subscription play. We derive revenue from player purchases of in-game virtual goods within our free-to-play games and from advertising on games sites. In addition, we derive revenue from the sale of individual games and subscription offerings.\nRealNetworks allocates to its Consumer Media, Mobile Services, and Games reportable segments certain corporate expenses which are directly attributable to supporting these businesses, including, but not limited to, a portion of finance, IT, legal, human resources and headquarters facilities. Remaining expenses, which are not directly attributable to supporting these businesses, are reported as corporate items. These corporate items also can include restructuring charges and stock compensation expense.\nAs described in Note 4, Acquisitions and Dispositions, RealNetworks acquired an additional 42% interest in Rhapsody International, Inc. (doing business as Napster) on January 18, 2019 bringing our ownership of Napster's outstanding stock to 84%, thus giving us a majority voting interest. For fiscal periods following the closing of the acquisition, we consolidated Napster's financial results into our financial statements, where Napster was reported as a separate segment. RealNetworks entered into a Support Agreement dated August 25, 2020 by and among its 84%-owned subsidiary, Napster, and MelodyVR Group PLC, referred to as MelodyVR, an English public limited company. The Support Agreement was executed in connection with an Agreement and Plan of Merger, or Merger Agreement, by and among Napster, MelodyVR, and a wholly owned subsidiary of MelodyVR that effectuated the merger. The Merger Agreement called for the merger of MelodyVR's merger sub\nwith and into Napster, with Napster surviving and becoming a wholly owned subsidiary of MelodyVR. Other than as Securityholder Representative, RealNetworks is not a party to the Merger Agreement.\nThe transaction closed on December 30, 2020 at which time MelodyVR assumed Napster's assets and liabilities, primarily relating to music licensing. MelodyVR paid consideration of approximately $26 million to certain holders of debt and equity of Napster, comprised of $12 million in cash, shares of MelodyVR, and a $3 million 18-month indemnity escrow. The shares of MelodyVR that RealNetworks received may not be sold or transferred, except in limited circumstances, for a period of one year. Certain proceeds from the transaction were used to fully repay the advance to Napster on the revolving line of credit, as discussed in Note 9. Debt, pay Napster's transaction expenses, and pay amounts to certain of Napster's common stockholders. The final value to RealNetworks from the transaction is subject to the eventual payout of the indemnity escrow.\nEffective on the execution of the Agreement and Plan of Merger on August 25, 2020, Napster was treated as discontinued operations for accounting and disclosure purposes. As such, Napster's operating results for the years ended December 31, 2020 and 2019 and financial condition as of December 31, 2019 have been recast to conform to this presentation. Upon the close of the transaction, a gain on sale of approximately $1.9 million was recognized in discontinued operations.\nCOVID-19\nIn March 2020, the World Health Organization declared the outbreak of the novel coronavirus that causes COVID-19 to be a global pandemic. As the virus spread throughout the U.S. and the world, authorities implemented numerous measures to contain the virus, including travel bans and restrictions, quarantines, shelter-in-place orders, business limitations, and shutdowns. In addition to the pandemic's widespread impact on public health and global society, reactions to the pandemic as well as measures taken to contain the virus have caused significant turmoil to the global economy and financial markets. Moreover, similar to other companies, we have taken steps to support the health and well-being of our employees, customers, partners and communities, which include working remotely and learning to operate our business in a fundamentally different way.\nAs the pandemic and containment measures generally evolved throughout 2020, we have had to reevaluate our operating plans, resulting in some significant pivots for our growth initiatives. Moreover, as we continue to operate our business as efficiently as possible, we have taken steps to more aggressively reduce costs and reallocate resources. We are unable to predict the impacts that the COVID-19 pandemic will have on our results from operations, financial condition, liquidity and cash flows for fiscal 2021, due to the numerous uncertainties, including the duration and severity of the pandemic and containment measures. We will continue to monitor and evaluate the effects to our businesses and adjust our plans as needed.\nFinancial Results\nAs of December 31, 2020, we had $23.9 million in unrestricted cash and cash equivalents compared to $8.5 million as of December 31, 2019. The 2020 increase in cash and cash equivalents from December 31, 2019 was primarily due to $10.0 million in cash proceeds from the first quarter 2020 issuance of Series B Preferred Stock and proceeds from a promissory note issued in the second quarter of 2020 pursuant to the Payment Protection Program (PPP) of the CARES Act, with RealNetworks receiving $2.9 million. A subsidiary of RealNetworks, Scener, also received $2.1 million in the third quarter of 2020, in return for issuing SAFE Notes, as described in Note 5. Fair Value Measurements. During the fourth quarter of 2020, we received cash proceeds from the sale of Napster as described in Note 4. Acquisitions and Dispositions. The increase was partially offset by funds used in our operations, which totaled $8.1 million.\nThe following discussion reflects RealNetworks' results from continuing operations. Consolidated results of operations were as follows (dollars in thousands):\n2020 2019 2020-2019\nChange %\nChange\nTotal revenue $ 68,062 $ 65,802 $ 2,260 3 %\nCost of revenue 16,465 17,226 (761) (4) %\nGross profit 51,597 48,576 3,021 6 %\nGross margin 76 % 74 % 2 %\nTotal operating expenses 56,621 75,640 (19,019) (25) %\nOperating loss $ (5,024) $ (27,064) $ 22,040 81 %\n2020 compared with 2019\nIn 2020, our consolidated revenue increased by $2.3 million, or 3%. The increase in revenue was primarily due to increases in our Games segment of $3.1 million, which was partially offset by decreases of $0.6 million in Consumer Media revenue and $0.3 million in Mobile Services revenue. See below for further information regarding fluctuations by segment. Gross margin increased to 76% from 74% due to the combination of higher revenues and cost reduction efforts.\nOperating expenses decreased by $19.0 million in 2020 compared with 2019 primarily due to reductions to the contingent consideration liability of $9.6 million, lower salaries and other people related expenses of $7.2 million, decreased professional fees of $1.1 million, and lower facility costs of $0.9 million. See Note 5. Fair Value Measurements for additional information on the change in the contingent consideration liability.\nSegment Operating Results\nConsumer Media\nConsumer Media segment results of operations were as follows (dollars in thousands):\n2020 2019 2020-2019\nChange %\nChange\nTotal revenue $ 12,581 $ 13,170 $ (589) (4) %\nCost of revenue 2,273 3,031 (758) (25) %\nGross profit 10,308 10,139 169 2 %\nGross margin 82 % 77 % 5 %\nTotal operating expenses 8,889 11,186 (2,297) (21) %\nOperating income (loss) $ 1,419 $ (1,047) $ 2,466 NM\nTotal Consumer Media revenue decreased by $0.6 million, or 4% as compared to the prior year, due to decreased software license revenues of $0.6 million and decreased subscription services of $0.6 million, partially offset by increased product sales of $0.5 million from RealPlayer Plus. Advertising and other revenue increased $0.1 million when compared to the prior year due to the non-recurring recognition of previously deferred third-party software product distribution revenue in the amount of $0.6 million, which was largely offset by lower advertising revenue.\nSoftware License\nFor our software license revenues, the $0.6 million decrease was primarily due to the recognition of revenue on a contract that was effectuated and fully recognized for $1.0 million in 2019. Also contributing to the decrease was the timing of shipments and payments for approximately $0.9 million in 2019. These decreases were partially offset by renewals from existing customers in 2020. The bulk of these licenses for our codec technology are with companies based in China and, in the near term, it is possible we may see continued pressure on pricing and renewals, and potential further declines in sales.\nSubscription Services\nFor our subscription services revenues, the decrease of $0.6 million was primarily due to further declines in our legacy subscription products, which we expect to continue.\nCost of revenue decreased by $0.8 million, or 25%. This was primarily due to reductions in salaries and other people related expenses of $0.7 million.\nOperating expenses decreased by $2.3 million, or 21%, compared to the prior year, primarily due to lower salaries and benefits, from headcount reductions, of $1.9 million as well as lower infrastructure costs of $0.5 million.\nMobile Services\nMobile Services segment results of operations were as follows (dollars in thousands):\n2020 2019 2020-2019\nChange %\nChange\nTotal revenue $ 26,889 $ 27,143 $ (254) (1) %\nCost of revenue 6,725 7,500 (775) (10) %\nGross profit 20,164 19,643 521 3 %\nGross margin 75 % 72 % 3 %\nTotal operating expenses 24,787 29,340 (4,553) (16) %\nOperating loss $ (4,623) $ (9,697) $ 5,074 52 %\nMobile Services revenue declined by $0.3 million, or 1%, and was primarily driven by a decrease of $2.2 million in subscription services revenue, offset by an increase of $2.0 million in software license revenue.\nSoftware license\nFor our software license revenues, the $2.0 million increase was primarily the result of revenue from sales of our SAFR product, with a $1.9 million increase over the prior year.\nSubscription service\nFor our subscription services, the $2.2 million decrease was driven by fewer subscribers to our ringback tones resulting in a decrease in revenue of $2.7 million. These decreases were offset by an increase in revenue from our intercarrier messaging platform business of $0.4 million.\nCost of revenue decreased by $0.8 million or 10% as compared to the prior year, due primarily to reductions in salaries and benefits of $0.6 million related to headcount reductions.\nOperating expenses decreased by $4.6 million or 16% primarily due to decreased salaries, benefits and other people related costs of $2.8 million, lower marketing costs of $1.4 million, and lower infrastructure costs of $0.7 million.\nGames\nGames segment results of operations were as follows (dollars in thousands):\n2020 2019 2020-2019\nChange %\nChange\nTotal revenue $ 28,592 $ 25,489 $ 3,103 12 %\nCost of revenue 7,451 6,975 476 7 %\nGross profit 21,141 18,514 2,627 14 %\nGross margin 74 % 73 % 1 %\nTotal operating expenses 19,936 20,220 (284) (1) %\nOperating income (loss) $ 1,205 $ (1,706) $ 2,911 NM\nGames revenue increased by $3.1 million, or 12% as compared to the prior year primarily due to increases of $4.4 million in product sales revenues and other revenues, partially offset by a decrease of $1.3 million in subscription services revenues, described more fully below. Our Games segment has shifted its focus toward free-to-play games that offer in-game purchases of virtual goods, the revenue from which is included within product sales, and away from premium mobile games that require a one-time purchase or subscription.\nSubscription Services\nOur subscription sales decreased $1.3 million as a result of lower subscribers in 2020 as compared to 2019.\nProduct sales\nOur product sales increased $4.1 million as a result of higher in-game purchases of $6.5 million compared to the prior-year period, offset by lower sales of games of $2.4 million as we have shifted toward free-to-play games that offer in-game purchases of virtual goods and away from premium mobile games that require a one-time purchase.\nAdvertising and other\nOur advertising and other revenues increased $0.4 million as compared to the prior-year period primarily as a result of offering more in-game advertising within our free-to-play games, partially offset by decreases in advertising revenue from premium mobile games.\nCost of revenue increased by $0.5 million, or 7%, due to higher app store fees of $1.0 million, partially offset by lower publisher license and service royalties.\nOperating expenses decreased by $0.3 million, primarily due to lower salaries and other people related costs of $1.0 million, professional services fees and development costs of $1.0 million and infrastructure expenses of $0.2 million, partially offset by higher marketing fees of $1.9 million.\nCorporate\nCorporate segment results of operations were as follows (dollars in thousands):\n2020 2019 2020-2019\nChange %\nChange\nCost of revenue $ 16 $ (280) $ 296 NM\nTotal operating expenses 3,009 14,894 (11,885) (80) %\nOperating income (loss) $ (3,025) $ (14,614) $ 11,589 79 %\nOperating expenses decreased by $11.9 million, or 80%. The decrease was primarily due to lower salaries and other people related costs of $1.6 million and lower professional service fees of $0.6 million. The overall decrease was also impacted by $9.6 million related to the change in fair value of the contingent consideration liability. See Note 5. Fair Value Measurements for additional information.\nConsolidated Operating Expenses\nOur operating expenses consist primarily of salaries and related personnel costs including stock-based compensation, consulting fees associated with product development, sales commissions, amortization of certain intangible assets capitalized in our acquisitions, professional service fees, advertising costs, restructuring charges, and lease exit costs. Operating expenses were as follows (dollars in thousands):\n2020 2019 2020-2019\nChange %\nChange\nResearch and development $ 24,319 $ 27,850 $ (3,531) (13) %\nSales and marketing 21,042 23,016 (1,974) (9) %\nGeneral and administrative 17,331 21,820 (4,489) (21) %\nFair value adjustments to contingent consideration liability (8,600) 1,000 (9,600) NM\nRestructuring and other charges 2,529 1,954 575 29 %\nTotal consolidated operating expenses $ 56,621 $ 75,640 $ (19,019) (25) %\nResearch and development expenses decreased by $3.5 million, or 13%, in the year ended 2020 as compared to 2019 primarily due to a decrease in salaries and other people related costs of $2.0 million, lower professional service fees and development costs of $1.2 million and lower infrastructure costs of $0.4 million.\nSales and marketing expenses decreased by $2.0 million, or 9%, in the year ended 2020, compared with 2019. The decrease was primarily due to a decrease in salaries and other people related costs of $2.9 million. The decrease was partially offset by higher marketing and professional fees of $0.8 million.\nGeneral and administrative expenses decreased by $4.5 million, or 21%, in the year ended 2020, compared with 2019. The decrease was primarily due to lower salaries and other people related costs of $2.4 million, lower professional fees of $1.1 million and lower facility expenses of $0.8 million.\nThe fair value adjustments to the contingent consideration liability changed by $9.6 million in the year ended 2020, compared with 2019. See Note 5. Fair Value Measurements for additional information.\nRestructuring and other charges consist of costs associated with the ongoing reorganization of our business operations and our ongoing expense re-alignment efforts. For additional details on these charges, see Note 10. Restructuring and Other Charges.\nOther Income (Expenses)\nOther income (expenses), net was as follows (dollars in thousands):\n2020 2019 2020-2019\nChange %\nChange\nInterest expense $ (20) $ - $ (20) NM\nInterest income 38 98 (60) (61) %\nGain on equity and other investments, net 111 12,338 (12,227) (99) %\nOther income (expense), net (164) 102 (266) NM\nTotal other income (expense), net $ (35) $ 12,538 $ (12,573) NM\nInterest expense relates to RealNetworks long-term debt, as described in detail in Note 9. Debt.\nGain on equity and other investments, net for the year ended December 31, 2020 includes unrealized gains on equity securities of $0.7 million, partially offset by net losses in equity investments of $0.6 million. Gain on equity and other investments, net for the year ended December 31, 2019 includes $12.3 million related to RealNetworks' gain on consolidation of Napster, as described in more detail in Note 4. Acquisitions and Dispositions.\nThe fluctuation in Other income (expense), net primarily relates to foreign exchange gains and losses.\nIncome Taxes\nDuring the years ended December 31, 2020 and 2019, we recognized income tax expense from continuing operations of $0.1 million and $0.7 million, respectively, related to U.S. and foreign income taxes.\nIn general, the amount of tax expense or benefit allocated to continuing operations is determined without regard to the tax effects of other categories of income or loss, such as discontinued operations. However, an exception to the general rule is provided in Topic 740 when there is a pre-tax loss from continuing operations and there are items charged or credited to other\ncategories, including discontinued operations, in the current year. Pursuant to Topic 740, the gain from discontinued operations was considered in determining the $0.1 million tax expense allocated to the loss from continuing operations.\nThe income tax expense from continuing operations for the year ended December 31, 2020 and 2019 was largely the result of foreign withholding taxes and income taxes in foreign jurisdictions.\nWe assess the likelihood that our deferred tax assets will be recovered based upon our consideration of many factors, including the current economic climate, our expectations of future taxable income, our ability to project such income, and the appreciation of our investments and other assets. We maintain a partial valuation allowance of $128.3 million for our deferred tax assets due to uncertainty regarding their realization as of December 31, 2020. The net decrease in the valuation allowance since December 31, 2019 of $32.5 million was the result of a decrease in current year deferred tax assets, mainly related to the disposition of Napster, for which the Company maintained a valuation allowance.\nWe generate income in a number of foreign jurisdictions, some of which have higher tax rates and some of which have lower tax rates relative to the U.S. federal statutory rate. Changes to the blend of income between jurisdictions with higher or lower effective tax rates than the U.S. federal statutory rate could affect our effective tax rate. For the year ended December 31, 2020, decreases in tax expense from income generated in foreign jurisdictions with lower tax rates in comparison to the U.S. federal statutory rate were offset by increases in tax expense from income generated in foreign jurisdictions having comparable, or higher tax rates in comparison to the U.S. federal statutory rate.\nAs of December 31, 2020 and 2019, RealNetworks had $0.7 million and $5.0 million in uncertain tax positions, respectively. The decrease in uncertain tax positions is primarily the result of the Napster Disposition, for which unrecognized tax positions were removed relating to federal research and development tax credit carryforward risks, as well as transfer pricing risks in certain foreign jurisdictions. The remaining unrecognized tax benefits are due to federal research and development tax credit carryforward risks. As of December 31, 2020, there are no unrecognized tax benefits remaining that would affect our effective tax rate if recognized, as the offset would increase the valuation allowance. We do not anticipate that the total amount of unrecognized tax benefits will significantly change within the next twelve months.\nWe file numerous consolidated and separate income tax returns in the U.S. including federal, state and local, as well as foreign jurisdictions. With few exceptions, we are no longer subject to U.S. federal income tax examinations for tax years before 2013 or state, local, or foreign income tax examinations for years before 1993. We are currently under audit by various states and foreign jurisdictions for certain tax years subsequent to 1993.\nLiquidity and Capital Resources\nThe following summarizes working capital, cash and cash equivalents, and restricted cash (in thousands):\nDecember 31,\n2020 2019\nWorking capital, excluding cash and cash equivalents $ 1,148 $ (5,808)\nCash and cash equivalents 23,940 8,472\nRestricted cash equivalents 1,630 4,880\nThe 2020 improvement in working capital from December 31, 2019 was primary due to the investment in MelodyVR received as proceeds on the sale of Napster, partially offset by the reclassification of the contingent consideration liability from other long-term liabilities to current liabilities.\nCash and cash equivalents increased $15.5 million from December 31, 2019 due to $10.0 million in cash proceeds from the first quarter 2020 issuance of Series B Preferred Stock, cash proceeds received from the sale of Napster during the fourth quarter of 2020, as described in Note 4. Acquisitions and Dispositions, proceeds of $2.9 million from the PPP promissory note, and issuance of SAFE Notes of $2.1 million. These increases were partially offset by cash used in operations.\nThe decrease in restricted cash equivalents is due to a reduction in the restricted amounts required by our amended Loan Agreement of $2.0 million and the release of restricted funds held for the corporate headquarters lease, which have been satisfied with a letter of credit. See Note 9. Debt for additional information on amendments to our revolving line of credit.\nThe following summarizes cash flow activity from continuing operations (in thousands):\nYears Ended December 31,\n2020 2019\nCash used in operating activities $ (8,083) $ (21,315)\nCash provided by (used in) investing activities (408) 11,324\nCash provided by financing activities 11,034 4,068\nCash used in operating activities consisted of net loss from continuing operations adjusted for certain non-cash items such as depreciation and amortization, stock-based compensation, gain on equity and other investments, fair value adjustments to the\ncontingent consideration liability, loss on impairment of operating lease assets and the effect of changes in certain operating assets and liabilities.\nCash used in operating activities was $13.2 million lower in the year ended December 31, 2020 as compared to 2019. Cash used in operations was lower primarily due to our lower operating loss recorded for year 2020 compared to the prior year.\nFor the year ended December 31, 2020, cash used in investing activities of $0.4 million was primarily due to fixed asset purchases.\nFor the year ended December 31, 2019, cash provided by investing activities of $11.3 million was due primarily to the net cash received from the Napster acquisition in January 2019. Our initial cash consideration paid at closing of $0.2 million was offset by the cash, cash equivalents and restricted cash on Napster's balance sheet at the acquisition date. The increase was offset in part by fixed asset purchases of $0.9 million.\nFinancing activities for the year ended December 31, 2020 provided cash totaling $11.0 million. This cash inflow was primarily due to the issuance of Series B preferred stock of $10.0 million and proceeds of $2.9 million from the PPP promissory note, and the receipt by Scener, a subsidiary of RealNetworks, of $2.1 million from the issuance of SAFE Notes. These inflows were partially offset by repayment on our revolving credit facility of $3.9 million. See Note 9. Debt and Note 19. Related Party Transactions for additional details.\nFinancing activities for the year ended December 31, 2019 provided cash totaling $4.1 million, which was primarily from borrowings on our revolving credit facility of $3.9 million. See Note 9. Debt for additional details.\nWhile we currently have no planned significant capital expenditures for 2021 other than those in the ordinary course of business, we do have contractual commitments for future payments related to office leases. See Note 15. Leases for additional details.\nRealNetworks is a party to a Loan Agreement with a third-party financial institution, as discussed in Note 9. Debt. Under the Agreement, as amended, borrowings may not exceed $6.5 million and are reduced by a $1.0 million standby letter of credit entered into with the bank in connection with certain lease agreements. At December 31, 2020, we had no outstanding draws on the revolving line of credit.\nIn February 2020, we entered into a Series B Preferred Stock Purchase Agreement with Mr. Glaser, Chairman of the Board and Chief Executive Officer of RealNetworks, pursuant to which Mr. Glaser invested approximately $10.0 million in RealNetworks in exchange for the issuance to him of 8,064,516 shares of Series B Preferred Stock. The Series B Preferred Stock is non-voting and is convertible into common stock on a one-to-one basis, provided, however, that no conversion is permitted in the event that such conversion would cause Mr. Glaser’s beneficial ownership of our common stock to exceed the 38.5% threshold set forth in our Second Amended and Restated Shareholder Rights Plan dated November 30, 2018. The Series B Preferred Stock has no liquidation preference and no preferred dividend.\nIn 2019, Mr. Glaser directly invested $0.8 million in one of our subsidiaries, Scener, in exchange for shares of preferred stock of that entity. The subsidiary is developing a platform that transforms the experience of viewing video entertainment into a social, connected playground. As of December 31, 2020, RealNetworks owned approximately 82% of the subsidiary's outstanding equity, and we consolidate its financial results into our financial statements. The financial results of the subsidiary are reported in our Consumer Media segment.\nIn the near term, we expect to see continued net negative cash flow from operating activities. We believe that our unrestricted current cash and cash equivalents and unused capacity on our revolving line of credit will be sufficient to meet our anticipated cash needs for working capital and capital expenditures for at least the next 12 months. Notwithstanding this availability of cash and access to additional funding, management has considered and will continue to evaluate implementation of a variety of cash conservation measures.\nIn the future, we may seek to raise additional funds through public or private equity financing, or through other sources. Such sources of funding may or may not be available to us at commercially reasonable terms. The sale of additional equity securities could result in dilution to our shareholders. In addition, in the future, we may enter into cash or stock acquisition transactions or other strategic transactions that could reduce cash available to fund our operations or result in dilution to shareholders.\nContractual Obligations\nWe have contractual obligations for Long-term debt and for Long-term lease liabilities, both of which are recorded on our balance sheet. For details on the maturity of Long-term debt, please refer to Note 9. Debt and for future minimum lease payments please refer to Note 15. Leases. Please also refer to Note 16. Commitments and Contingencies. For income tax liabilities for uncertain tax positions, we cannot make a reasonably reliable estimate of the amount and period of any related future payments. As of December 31, 2020, we had $0.7 million of gross unrecognized tax benefits for uncertain tax positions.\nOff-Balance Sheet Arrangements\nWe do not maintain accruals associated with certain guarantees, as discussed in Note 17. Guarantees; those guarantee obligations constitute off-balance sheet arrangements.\nCritical Accounting Policies and Estimates\nThe preparation of our financial statements requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reported period. Our critical accounting policies and estimates are as follows:\n•Revenue recognition;\n•Valuation of definite-lived assets, right-of-use operating lease assets, and goodwill; and\n•Accounting for income taxes.\nRevenue Recognition. We recognize revenue from contracts with customers as control of the promised good or service is transferred. Please refer to Note 3. Revenue Recognition for further details regarding our recognition policies.\nValuation of Definite-Lived Assets, Right-of-Use Operating Lease Assets, and Goodwill. Assets acquired and liabilities assumed in a business acquisition are measured at fair value under the purchase accounting method and any goodwill is recognized as the excess of the total purchase price over the fair value of assets acquired and liabilities assumed. The fair value estimates are based upon estimates and assumptions relating to future revenues, cash flows, operating expenses and costs of capital. These estimates and assumptions are complex and subject to a significant degree of judgment with respect to certain factors including, but not limited to, the cash flows of long-term operating plans and risk-commensurate discount rates and cost of capital.\nOur definite-lived assets consist primarily of property, plant and equipment. Definite-lived assets are amortized on a straight line basis over their estimated useful lives. We review definite-lived assets and right-of-use operating lease assets for impairment whenever events or changes in circumstances indicate the carrying amount of such assets may not be recoverable. Recoverability of these assets is measured by comparison of their carrying amount to future undiscounted cash flows the assets are expected to generate. If definite-lived assets or right-of-use operating lease assets are considered to be impaired, the impairment to be recognized equals the amount by which the carrying value of the assets exceeds their fair market value.\nWe test goodwill for impairment on an annual basis, in our fourth quarter, or more frequently if circumstances indicate reporting unit carrying values may exceed their fair values. As part of this test, we first perform a qualitative assessment to determine if the fair value of a reporting unit is more likely than not less than the reporting unit's carrying amount including goodwill. If this assessment indicates impairment is more likely than not, we then compare the carrying value of the reporting unit to the estimated fair value of the reporting unit. If the carrying value of the reporting unit exceeds the estimated fair value, we then calculate the implied estimated fair value of goodwill for the reporting unit and compare it to the carrying amount of goodwill for the reporting unit. If the carrying amount of goodwill exceeds the implied estimated fair value, an impairment charge to current operations is recorded to reduce the carrying value to implied estimated value.\nThe impairment analysis of definite-lived assets, right-of-use operating lease assets, and goodwill may be based upon estimates and assumptions relating to our future revenue, cash flows, operating expenses, costs of capital and capital purchases. These estimates and assumptions are complex and subject to a significant degree of judgment with respect to certain factors including, but not limited to, the cash flows of our long-term operating plans, market and interest rate risk, and risk-commensurate discount rates and cost of capital. Significant or sustained declines in future revenue or cash flows, or adverse changes in our business climate, among other factors, and their resulting impact on the estimates and assumptions relating to the value of our definite-lived, right-of-use lease, and goodwill assets could result in the need to perform an impairment analysis in future periods which could result in a significant impairment. While we believe our estimates and assumptions are reasonable, due to their complexity and subjectivity, these estimates and assumptions could vary from period to period. Changes in these estimates and assumptions could materially affect the estimate of future cash flows and related fair values of these assets and result in significant impairments, which could have a material adverse effect on our financial condition or results of operations. For further discussion, please see the risk factor entitled, \"Any impairment to our goodwill, definite-lived, and right-of-use operating lease assets could result in a material charge to our earnings\" under Item 1A Risk Factors.\nAccounting for Income Taxes. We use the asset and liability method of accounting for income taxes. Under this method, income tax expense is recognized for the amount of taxes payable or refundable for the current year. In addition, deferred income tax expense and deferred tax assets and liabilities are recognized for the expected future tax consequences of temporary differences between the financial reporting and tax basis of assets and liabilities and for operating losses and tax credit carryforwards. Deferred tax assets and liabilities and operating loss and tax credit carryforwards are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences and operating loss and tax credit\ncarryforwards are expected to be recovered or settled. We must make assumptions, judgments and estimates to determine the current and deferred provision for income taxes, deferred tax assets and liabilities and any valuation allowance to be recorded against deferred tax assets. Our judgments, assumptions, and estimates relative to the current provision for income tax take into account current tax laws, our interpretation of current tax laws and possible outcomes of future audits conducted by foreign and domestic tax authorities. Changes in tax law or our interpretation of tax laws and future tax audits could materially impact the amounts provided for income taxes in our consolidated financial statements.\nEach reporting period we must periodically assess the likelihood that our deferred tax assets will be recovered from future sources of taxable income, and to the extent that recovery is not more likely than not, a valuation allowance must be established. The establishment of a valuation allowance and increases to such an allowance result in either increases to income tax expense or reduction of income tax benefit in the statement of operations and comprehensive income. In certain instances, changes in the valuation allowance may be allocated directly to the related components of shareholders' equity on the consolidated balance sheet. Factors we consider in making such an assessment include, but are not limited to, past performance and our expectation of future taxable income, macroeconomic conditions and issues facing our industry, existing contracts, our ability to project future results and any appreciation of our investments and other assets.\nAs of December 31, 2020, approximately $8.4 million of the $23.9 million of cash and cash equivalents are held by our foreign subsidiaries outside the U.S. We have reevaluated our historical assertion that undistributed foreign earnings were indefinitely reinvested and for which deferred taxes were not provided. As a result of the enactment of the Tax Act and as of December 31, 2020, we are no longer indefinitely reinvesting substantially all of the Company's foreign earnings outside of the U.S. As a result of this change, we have recorded deferred taxes of $0.9 million as of December 31, 2020 to reflect local country and foreign withholding taxes associated with a future repatriation of such foreign earnings.\nRecently Issued Accounting Standards\nSee Note 2. Recent Accounting Pronouncements.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nThe following discussion about our market risk involves forward-looking statements. All statements that do not relate to matters of historical fact should be considered forward-looking statements. Actual results could differ materially from those projected in any forward-looking statements.\nInterest Rate Risk. Our exposure to interest rate risk from changes in market interest rates relates primarily to RealNetworks' revolving line of credit. RealNetworks' borrowing arrangement has a floating rate interest payments and thus has a degree of interest rate risk, if interest rates increase. Based on the available total balance of the revolving line of credit, a hypothetical 10% increase/decrease in interest rates would not increase/decrease our annual interest expense or cash flows by more than a nominal amount.\nInvestment Risk. As of December 31, 2020, we had an equity investment in common shares of a foreign publicly traded technology company. These common shares were acquired as a portion of the proceeds received in the sale of Napster. The equity investment is subject to fluctuation in the market price as well as being exposed to changes in foreign currency exchange rates. A hypothetical 10% increase/decrease in the common share price or foreign currency exchange rate would result in an increase/decrease of the value of the equity investment of approximately $1.0 million.\nForeign Currency Risk. We conduct business internationally in several currencies and thus are exposed to adverse movements in foreign currency exchange rates.\nOur exposure to foreign exchange rate fluctuations arise in part from: (1) translation of the financial results of foreign subsidiaries into U.S. dollars in consolidation; (2) the remeasurement of non-functional currency assets, liabilities and intercompany balances into U.S. dollars for financial reporting purposes; and (3) non-U.S. dollar denominated sales to foreign customers.\nOur foreign currency risk management program reduces, but does not entirely eliminate, the impact of currency exchange rate movements. For our foreign operations, the majority of our revenues and expenses are denominated in other currencies, such as the euro. We currently do not actively hedge our foreign currency exposures and are therefore subject to the risk of exchange rate fluctuations. We are exposed to foreign exchange rate fluctuations as the financial results of foreign subsidiaries are translated into U.S. dollars in consolidation. Our exposure to foreign exchange rate fluctuations also arises from intercompany payables and receivables to and from our foreign subsidiaries.\nA hypothetical 10% increase or decrease in those currencies relative to the U.S. dollar as of December 31, 2020 would not result in a material impact on our financial position, results of operations or cash flows.",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nREALNETWORKS, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(In thousands, except per share data)\nDecember 31,\n2020 December 31,\nASSETS\nCurrent assets:\nCash and cash equivalents $ 23,940 $ 8,472\nTrade accounts receivable, net of allowances 10,229 12,767\nDeferred costs, current portion 196 537\nInvestments 9,965 -\nPrepaid expenses and other current assets 3,480 4,428\nCurrent assets of discontinued operations - 28,376\nTotal current assets 47,810 54,580\nEquipment, software, and leasehold improvements, at cost:\nEquipment and software 30,726 31,699\nLeasehold improvements 2,776 3,071\nTotal equipment, software, and leasehold improvements 33,502 34,770\nLess accumulated depreciation and amortization 31,631 32,350\nNet equipment, software, and leasehold improvements 1,871 2,420\nOperating lease assets 7,937 10,198\nRestricted cash equivalents 1,630 4,880\nOther assets 4,150 1,808\nDeferred costs, non-current portion 74 388\nDeferred tax assets, net 909 761\nGoodwill 17,375 16,908\nNon-current assets of discontinued operations - 67,811\nTotal assets $ 81,756 $ 159,754\nLIABILITIES AND SHAREHOLDERS’ EQUITY\nCurrent liabilities:\nAccounts payable $ 2,750 $ 4,042\nAccrued and other current liabilities 17,850 17,495\nDeferred revenue, current portion 2,122 2,003\nCurrent liabilities of discontinued operations - 72,641\nTotal current liabilities 22,722 96,181\nDeferred revenue, non-current portion 45 96\nDeferred tax liabilities, net 1,129 1,076\nLong-term lease liabilities 6,837 8,234\nLong-term debt 2,895 3,900\nOther long-term liabilities 2,241 10,151\nNon-current liabilities of discontinued operations - 1,843\nTotal liabilities 35,869 121,481\nCommitments and contingencies (Note 16.)\nShareholders’ equity:\nPreferred stock, $0.001 par value:\nSeries A: authorized 200 shares, no shares issued or outstanding\n- -\nSeries B: authorized 8,100 shares, issued and outstanding 8,065 shares in 2020 and no shares authorized in 2019\n8 -\nUndesignated series: authorized 51,700 shares\n- -\nCommon stock, $0.001 par value authorized 250,000 shares; issued and outstanding 38,424 shares in 2020 and 38,227 shares in 2019\n38 38\nAdditional paid-in capital 655,606 644,070\nAccumulated other comprehensive loss (60,641) (61,323)\nAccumulated deficit (548,862) (544,010)\nTotal shareholders’ equity 46,149 38,775\nNoncontrolling interests (262) (502)\nTotal equity 45,887 38,273\nTotal liabilities and equity $ 81,756 $ 159,754\nSee accompanying notes to consolidated financial statements.\nREALNETWORKS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(In thousands, except per share data)\nYears Ended December 31,\n2020 2019\nNet revenue $ 68,062 $ 65,802\nCost of revenue 16,465 17,226\nGross profit 51,597 48,576\nOperating expenses:\nResearch and development 24,319 27,850\nSales and marketing 21,042 23,016\nGeneral and administrative 17,331 21,820\nFair value adjustments to contingent consideration liability (8,600) 1,000\nRestructuring and other charges 2,529 1,954\nTotal operating expenses 56,621 75,640\nOperating loss (5,024) (27,064)\nOther income (expenses):\nInterest expense (20) -\nInterest income 38 98\nGain on equity and other investments, net 111 12,338\nOther income (expense), net (164) 102\nTotal other income (expenses), net (35) 12,538\nLoss from continuing operations before income taxes (5,059) (14,526)\nIncome tax expense 55 702\nNet loss from continuing operations (5,114) (15,228)\nNet loss from discontinued operations, net of tax (206) (6,030)\nNet loss (5,320) (21,258)\nNet loss attributable to noncontrolling interest of continuing operations (284) (163)\nNet loss attributable to noncontrolling interest of discontinued operations (184) (1,094)\nNet loss attributable to RealNetworks $ (4,852) $ (20,001)\nNet loss from continuing operations attributable to RealNetworks $ (4,830) $ (15,065)\nNet income (loss) from discontinued operations attributable to RealNetworks (22) (4,936)\nNet loss attributable to RealNetworks $ (4,852) $ (20,001)\nNet income (loss) per share attributable to RealNetworks - Basic:\nContinuing operations $ (0.13) $ (0.40)\nDiscontinued operations - (0.13)\nTotal net loss per share - Basic $ (0.13) $ (0.53)\nNet income (loss) per share attributable to RealNetworks- Diluted:\nContinuing operations $ (0.13) $ (0.40)\nDiscontinued operations - (0.13)\nTotal net loss per share - Diluted $ (0.13) $ (0.53)\nShares used to compute basic net loss per share 38,272 37,994\nShares used to compute diluted net loss per share 38,272 37,994\nSee accompanying notes to consolidated financial statements.\nREALNETWORKS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE LOSS\n(In thousands)\nYear Ended December 31,\n2020 2019\nNet loss $ (5,320) $ (21,258)\nComprehensive income (loss):\nForeign currency translation adjustments 909 (205)\nTotal other comprehensive income (loss) 909 (205)\nComprehensive loss including noncontrolling interests (4,411) (21,463)\nComprehensive loss attributable to noncontrolling interests (468) (1,257)\nComprehensive loss attributable to RealNetworks $ (3,943) $ (20,206)\nSee accompanying notes to consolidated financial statements.\nREALNETWORKS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In thousands)\nYears Ended December 31,\n2020 2019\nCash flows from operating activities:\nNet loss from continuing operations $ (5,114) $ (15,228)\nAdjustment to reconcile net loss from continuing operations to net cash used in operating activities:\nDepreciation and amortization 944 1,195\nStock-based compensation 1,420 2,881\nGain on equity and other investments, net (111) (12,338)\nLoss on impairment of operating lease asset 1,055 -\nDeferred income taxes, net (191) (29)\nForeign currency (gain) loss 330 7\nFair value adjustments to contingent consideration liability (8,600) 1,000\nNet change in certain operating assets and liabilities:\nTrade accounts receivable 2,587 (1,077)\nPrepaid expenses, operating lease and other assets 3,716 5,603\nAccounts payable (1,342) 145\nAccrued, lease and other liabilities (2,777) (3,474)\nNet cash used in operating activities - continuing operations (8,083) (21,315)\nNet cash used in operating activities - discontinued operations (2,555) (4,055)\nNet cash used in operating activities (10,638) (25,370)\nCash flows from investing activities:\nPurchases of equipment, software, and leasehold improvements (408) (949)\nProceeds from sales and maturities of short-term investments - 24\nAcquisitions, net of cash acquired - 12,249\nNet cash provided by (used in) investing activities - continuing operations (408) 11,324\nNet cash used in investing activities - discontinued operations (2,160) (243)\nNet cash provided by (used in) investing activities (2,568) 11,081\nCash flows from financing activities:\nProceeds from issuance of common stock - 199\nProceeds from issuance of preferred stock 10,000 -\nTax payments from shares withheld upon vesting of restricted stock (26) (309)\nProceeds from notes payable and long-term debt 2,876 3,900\nRepayments of notes payable and long-term debt (3,922) -\nPayment of financing fees - (622)\nOther financing activities 2,106 900\nNet cash provided by financing activities - continuing operations 11,034 4,068\nNet cash provided by (used in) financing activities - discontinued operations 4,945 (4,691)\nNet cash provided by (used in) financing activities 15,979 (623)\nEffect of exchange rate changes on cash, cash equivalents and restricted cash 618 (100)\nNet increase (decrease) in cash, cash equivalents and restricted cash 3,391 (15,012)\nCash, cash equivalents, and restricted cash, beginning of year 22,179 37,191\nCash, cash equivalents, and restricted cash, end of year 25,570 22,179\nLess: Cash, cash equivalent and restricted cash from discontinued operations - 8,827\nCash, cash equivalents and restricted cash from continuing operations, end of year $ 25,570 $ 13,352\nREALNETWORKS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS - Continued\n(In thousands)\nSupplemental disclosure of cash flow information:\nContinuing operations:\nCash received from income tax refunds $ 2,169 $ 2,225\nCash paid for income taxes $ 1,063 $ 868\nNon-cash investing activities:\nIncrease (decrease) in accrued purchases of equipment, software, and leasehold improvements $ (44) $ (83)\nAcquisition of investments from sale of Napster $ 9,268 $ -\nDiscontinued operations:\nCash received from income tax refunds $ 33 $ 31\nCash paid for income taxes $ 331 $ 327\nCash paid for interest expense $ 317 $ 412\nNon-cash investing activities:\nAcquisition of intangible assets $ - $ 23,700\nSee accompanying notes to consolidated financial statements.\nREALNETWORKS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS' EQUITY\n(In thousands)\nPreferred Stock Common Stock Additional\nPaid-In\nCapital Accumulated\nOther\nComprehensive\nIncome (Loss) Accumulated\nDeficit Total\nShareholders’\nEquity Non-controlling Interests Total Equity\nShares Amount Shares Amount\nBalances, December 31, 2018 - $ - 37,728 $ 37 $ 641,930 $ (61,118) $ (524,009) $ 56,840 $ - $ 56,840\nCommon stock issued for exercise of stock options and vesting of restricted shares, net of tax payments from shares withheld upon vesting of restricted stock - - 499 1 (110) - - (109) - (109)\nNapster acquisition - - - - (1,346) - - (1,346) 570 (776)\nStock-based compensation - - - - 2,881 - - 2,881 - 2,881\nOther comprehensive loss - - - - - (205) - (205) - (205)\nNet loss - - - - - - (20,001) (20,001) (1,257) (21,258)\nOther equity transactions (1)\n- - - - 715 - - 715 185 900\nBalances, December 31, 2019 - $ - 38,227 $ 38 $ 644,070 $ (61,323) $ (544,010) $ 38,775 $ (502) $ 38,273\nCommon stock issued for exercise of stock options and vesting of restricted shares, net of tax payments from shares withheld upon vesting of restricted stock - - 197 - (26) - - (26) - (26)\nIssuance of Preferred B Stock 8,065 8 - - 9,992 - - 10,000 - 10,000\nStock-based compensation - - - - 1,420 - - 1,420 - 1,420\nOther comprehensive income - - - - - 909 - 909 - 909\nNet loss - - - - - - (4,852) (4,852) (468) (5,320)\nOther equity transactions (2)\n- - - - 150 (227) - (77) 708 631\nBalances, December 31, 2020 8,065 $ 8 38,424 $ 38 $ 655,606 $ (60,641) $ (548,862) $ 46,149 $ (262) $ 45,887\n(1) In 2019, Mr. Glaser directly invested $0.8 million in one of our subsidiaries in exchange for shares of preferred stock of that entity. See Note 19. Related Party Transactions for additional details.\n(2) In 2020, Other equity transactions pertains to the sale of Napster to MelodyVR. See Note 4. Acquisitions and Dispositions for additional details.\nSee accompanying notes to consolidated financial statements.\nREALNETWORKS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nYears ended December 31, 2020 and 2019\nNote 1. Description of Business and Summary of Significant Accounting Policies\nDescription of Business. RealNetworks provides digital media software and services to consumers, mobile carriers, device manufacturers, system integrators, and other businesses. Consumers use our digital media products and services to store, organize, play, manage and enjoy their digital media content, either directly from us or through our distribution partners. Our computer vision SAFR (Secure Accurate Facial Recognition) platform, a key investment initiative for us, enables new applications for security, convenience, and analytics, and is optimized for live video.\nRhapsody International, Inc. (doing business as Napster) offers a comprehensive set of digital music products and services designed to provide consumers with broad access to digital music. Napster was held-for-sale and treated as discontinued operations for accounting and disclosure purposes as of the third quarter of 2020. The sale of Napster was completed during the fourth quarter of 2020. The results of operations and cash flows for our discontinued operations have been segregated from the results of continuing operations and segment results, and Napster’s operating results and financial condition have been recast to conform to this presentation. The notes to the consolidated financial statements, unless otherwise indicated, are on a continuing operations basis. See Note 4. Acquisitions and Dispositions for additional details regarding the acquisition and sale of Napster.\nInherent in our business are various risks and uncertainties, including a limited history of certain of our product and service offerings. RealNetworks' success will depend on the acceptance of our technology, products and services and the ability to generate related revenue and cash flow.\nIn this Annual Report on Form 10-K for the year ended December 31, 2020 (10-K), RealNetworks, Inc. and subsidiaries is referred to as “RealNetworks”, the “Company”, “we”, “us”, or “our”.\nBasis of Presentation. The consolidated financial statements include the accounts of the Company and its subsidiaries in which it has a more than 50% voting interest. Noncontrolling interests primarily represent third-party ownership in the equity of Napster and Scener Inc. (\"Scener\") and are reflected separately in the Company's financial statements. Intercompany balances and transactions have been eliminated in consolidation.\nLiquidity and Capital Resources. The Company continues to incur operating losses from continuing operations, including net operating losses of $5.0 million, and $27.1 million for the years ended December 31, 2020 and 2019, respectively. The Company had an accumulated deficit of $548.9 million and $544.0 million as of December 31, 2020 and 2019, respectively. The Company believes that its cash and cash equivalents of $23.9 million as of December 31, 2020, as well as the unused capacity of its revolving line of credit, are adequate to fund the Company's operations for at least one year from the date these financial statements were issued.\nRisks and Uncertainties. In March 2020, the World Health Organization declared the outbreak of the novel coronavirus that causes COVID-19 to be a global pandemic. As the virus spread throughout the U.S. and the world, authorities implemented numerous measures to contain the virus, including travel bans and restrictions, quarantines, shelter-in-place orders, business limitations, and shutdowns. In addition to the pandemic's widespread impact on public health and global society, reactions to the pandemic as well as measures taken to contain the virus have caused significant turmoil to the global economy and financial markets. Moreover, similar to other companies, we have taken steps to support the health and well-being of our employees, customers, partners and communities, which include working remotely and learning to operate our businesses in a fundamentally different way.\nThe COVID-19 pandemic and the resultant economic instability and financial market turmoil has added complexity, uncertainty and risk to nearly all aspects of our business. It is difficult to predict the near-term and long-term impacts that the pandemic will have on our results from operations, financial condition, liquidity and cash flows. In the preparation of our financial statements, certain estimates and assumptions regarding these impacts have been made, which could change in future periods and which could differ from actual outcomes.\nUse of Estimates. The preparation of financial statements in conformity with accounting principles generally accepted in the U.S. (GAAP) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nCash and Cash Equivalents. Cash and cash equivalents include cash on hand and highly-liquid investments with original maturities of three months or less.\nTrade Accounts Receivable. Trade accounts receivable consist of amounts due from customers and do not bear interest. The allowance for doubtful accounts and sales returns is our estimate of the amount of probable credit losses and returns in our existing accounts receivable. We determine the allowances based on analysis of historical bad debts, customer concentrations, changes in customer credit-worthiness, return history and current economic trends. We review the allowances for doubtful accounts and sales returns quarterly. Past due balances over 90 days and specified other balances are reviewed individually for collectability. All other balances are reviewed on an aggregate basis. Account balances are written off against the allowance\nafter all reasonable means of collection have been exhausted and the potential for recovery is considered remote. We do not have any off-balance sheet credit exposure related to our customers.\nInvestments. Investments are equity securities for which there is a determinable fair market value. We hold equity securities with a contractual lock-up period that require us to discount the fair market value until this restriction is removed. See Note 5. Fair Value Measurements for additional information.\nUnrealized gains and losses from the change in fair market value, as well as realized gains and losses from sales, are recorded to Gain on equity and other investments, net on the consolidated statements of operations. Realized and unrealized gains and losses on investments are determined using the specific identification method.\nConcentration of Credit Risk. Financial instruments that potentially expose the Company to concentrations of credit risk consist primarily of cash and cash equivalents and accounts receivable. We maintain cash and cash equivalents that may exceed the insured limits by the Federal Deposit Insurance Corporation. However, we reduce this credit risk by placing cash and cash equivalents with major financial institutions that the Company assesses to be of high-credit quality.\nWe derive a portion of our revenue from a large number of individual consumers spread globally. We also derive revenue from several large customers. If the financial condition or results of operations of any one of the large customers deteriorates substantially, our operating results could be adversely affected. To reduce credit risk, management performs ongoing credit evaluations of the financial condition of significant customers. We do not generally require collateral and we maintain an allowance for estimated credit losses on customer accounts when considered necessary.\nDepreciation and Amortization. Depreciation of equipment and software, as well as amortization of leasehold improvements is computed using the straight-line method over the lesser of the estimated useful lives of the assets or the related lease term. The useful life of equipment and software is generally three to five years.\nDepreciation and amortization expense of these assets during the years ended December 31, 2020 and 2019 was $0.9 million and $1.2 million, respectively.\nEquity Method Investment. We use the equity method in circumstances where we have the ability to exert significant influence, but not control, over an investee or joint venture. We initially record our investment based on a fair value analysis of the investment. We record our percentage interest in the investee's recorded income or loss and changes in the investee's capital under this method, which will increase or decrease the reported value of our investment.\nWe evaluate impairment of an investment accounted for under the equity method if events and circumstances warrant. An impairment charge would be recorded if a decline in the fair value of an equity investment below its carrying amount were determined to be other than temporary. In determining if a decline is other than temporary, we consider factors such as the length of time and extent to which the fair value of the investment has been less than the carrying amount of the investee or joint venture, the near-term and longer-term operating and financial prospects of the investee or joint venture and our intent and ability to hold the investment for a period of time sufficient to allow for any anticipated recovery.\nDeferred Costs. Included in deferred costs are financing fees associated with our revolving line of credit. These fees are amortized over the term of the credit agreement. Amortization of the financing fees are recorded in interest expense, within other income (expenses).\nWe also defer certain costs on projects for service revenues and system sales. Deferred costs consist primarily of direct and incremental costs to customize and install systems, as defined in individual customer contracts, including costs to acquire hardware and software from third parties and payroll and related costs for employees and other third parties. Deferred costs are capitalized during the implementation period. We recognize such costs as a component of cost of revenue, the timing of which is dependent upon the revenue recognition policy by contract. At each balance sheet date, we review deferred costs to ensure they are ultimately recoverable.\nDefinite-Lived Tangible and Right-of-Use Operating Lease Assets. Definite-lived tangible assets include equipment, software, leasehold improvements. Definite-lived assets are amortized on a straight line basis over their estimated useful lives.\nOperating leases are included in Operating lease assets, Other current liabilities, and Long-term lease liabilities on our consolidated balance sheets. Leases with an initial term of 12 months or less are not recorded on the balance sheet. Lease expense for minimum lease payments is recognized on a straight-line basis over the lease term.\nWe review these assets for impairment whenever events or changes in circumstances indicate the carrying amount of such assets may not be recoverable. If the carrying amount of an asset group is not recoverable, an impairment loss is recognized if the carrying amount of the asset group exceeds its estimated fair value, which is generally determined as the present value of estimated future cash flows to a market participant. Our impairment analysis is based on significant assumptions of future results, including operating and cash flow projections. Significant or sustained declines in future revenue or cash flows, or adverse changes in our business climate, among other factors, could result in the need to record an impairment charge in future periods.\nGoodwill. We test goodwill for impairment on an annual basis, in our fourth quarter, or more frequently if circumstances indicate reporting unit carrying values may exceed their fair values. Circumstances that may indicate a reporting unit's carrying value exceeds its fair value include, but are not limited to: poor economic performance relative to historical or projected future operating results; significant negative industry, economic or company specific trends; changes in the manner of our use of the assets or the plans for our business; and loss of key personnel.\nWhen evaluating goodwill for impairment, based upon our annual test or due to changes in circumstances described above, we first perform a qualitative assessment to determine if the fair value of a reporting unit is more likely than not less than the reporting unit's carrying amount including goodwill. If this assessment indicates impairment is more likely than not, we then compare the carrying value of the reporting unit to the estimated fair value of the reporting unit. If the carrying value of the reporting unit exceeds the estimated fair value, we then calculate the implied estimated fair value of goodwill for the reporting unit and compare it to the carrying amount of goodwill for the reporting unit. If the carrying amount of goodwill exceeds the implied estimated fair value, an impairment charge to current operations is recorded to reduce the carrying value to implied estimated value. Significant judgment is required in determining the reporting units and assessing fair value of the reporting units.\nFair Value. Fair value is the price that would be received from selling an asset or paid in transferring a liability in an orderly transaction between market participants at the measurement date. Our fair value measurements consider the principal or most advantageous market in which we would transact and the market-based risk measurements or assumptions that market participants would use in pricing the asset or liability, such as inherent risk, transfer restrictions and credit risk.\nFair values are determined based on three levels of inputs:\n•Level 1: Quoted prices in active markets for identical assets or liabilities\n•Level 2: Directly or indirectly observed inputs for the asset or liability, including quoted prices for similar assets or liabilities in active markets and quoted prices for identical or similar assets or liabilities in markets that are not active\n•Level 3: Significant unobservable inputs that reflect our own estimates of assumptions that market participants would use\nResearch and Development. Costs incurred in research and development are expensed as incurred. Software development costs are capitalized when a product’s technological feasibility has been established through the date the product is available for general release to customers. Other than internal use software, we have not capitalized any software development costs, as technological feasibility is generally not established until a working model is completed, at which time substantially all development is complete.\nRevenue Recognition. We recognize revenue from contracts with customers as control of the promised good or service is transferred. Please refer to Note 3. Revenue Recognition for further details regarding our recognition policies.\nAdvertising Expenses. We expense the cost of advertising and promoting our products as incurred. These costs are included in sales and marketing expense and totaled $5.9 million in 2020 and $5.5 million in 2019.\nForeign Currency. The functional currency of the Company’s foreign subsidiaries is generally the currency of the country in which the subsidiary operates. Assets and liabilities of foreign operations are translated into U.S. dollars using rates of exchange in effect at the end of the reporting period. The net gain or loss resulting from translation is shown as translation adjustment and included in Accumulated Other Comprehensive Income (AOCI) in shareholders’ equity. Income and expense accounts are translated into U.S. dollars using average rates of exchange. Gains and losses from foreign currency transactions are included in other income (expense), net on the consolidated statements of operations.\nAccounting for Taxes Collected from Customers. Our revenues are reported net of sales and other transaction taxes that are collected from customers and remitted to taxing authorities.\nIncome Taxes. We compute income taxes using the asset and liability method, under which deferred income taxes are provided for temporary differences between financial reporting basis and tax basis of our assets and liabilities and operating loss and tax credit carryforwards. We record a valuation allowance when it is more likely than not that some portion or all of the deferred tax assets will not be realized. The ultimate realization of the deferred tax assets depends on the ability to generate sufficient taxable income of the appropriate character in the appropriate taxing jurisdictions. Adjustments to the valuation allowance could be required in the future if we estimate that the amount of deferred tax assets to be realized is more or less than the net amount we have recorded. Any increase or decrease in the valuation allowance could have the effect of increasing or decreasing the income tax provision in the statement of operations.\nDeferred tax assets and liabilities and operating loss and tax credit carryforwards are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences and operating loss and tax credit carryforwards are expected to be recovered or settled.\nWe file numerous consolidated and separate income tax returns in the U.S. including federal, state and local, as well as foreign jurisdictions. With few exceptions, we are no longer subject to U.S. federal income tax examinations for tax years\nbefore 2013 or state, local, or foreign income tax examinations for years before 1993. We are currently under audit by various states and foreign jurisdictions for certain tax years subsequent to 1993.\nWe recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in the financial statements from such a position are measured based on the largest benefit that has a greater than 50% likelihood of being realized upon ultimate settlement. We recognize accrued interest and penalties related to uncertain tax positions as a component of income tax expense.\nStock-Based Compensation. Stock-based compensation cost is measured at the grant date based on the fair value of the award and is recognized as expense over the requisite service period, which is the vesting period. We use the Black-Scholes option-pricing model or other appropriate valuation models such as Monte Carlo simulation to determine the fair value of stock-based option awards. The fair value of restricted stock awards is based on the closing market price of our common stock on the grant date of the award. Generally, we recognize the compensation cost for awards on a straight-line basis for the entire award, over the applicable vesting period. For performance-based awards, expense is recognized when it is probable the performance goal will be achieved, however if the likelihood becomes improbable, that expense is reversed. For market-based stock options, fair value is measured at the grant date using the Monte Carlo simulation model, and we recognize compensation cost for these awards on a straight-line basis over the requisite service period for each separately vesting portion of the awards.\nThe valuation models for stock-based option awards require various judgmental assumptions including volatility in our common stock price and expected option life. If any of the assumptions used in the valuation models change significantly, stock-based compensation expense for new awards may differ materially in the future from the amounts recorded in the consolidated statements of operations. For all awards, we also estimate forfeitures at the time of grant and revise those estimates in subsequent periods if actual forfeitures differ from those estimates.\nNet Income (Loss) Per Share. Basic net income (loss) per share (EPS) is computed by dividing net income (loss) by the weighted average number of common shares outstanding during the period. Diluted EPS is computed by dividing net income (loss) by the weighted average number of common and dilutive potential common shares outstanding during the period.\nNote 2. Recent Accounting Pronouncements\nRecently adopted accounting pronouncements\nIn August 2018, the Financial Accounting Standards Board (\"FASB\") issued new guidance which modifies the disclosure requirements of fair value measurements in Topic 820, Fair Value Measurement. For public companies, the new guidance removes disclosure requirements for transfers between Level 1 and Level 2 of the fair value hierarchy, the policy for timing of transfers between levels and the valuation process for Level 3 fair value measurements. The guidance modifies the disclosure requirements for investments in certain entities that calculate net asset value and clarifies that the measurement uncertainty disclosure is to communicate information about the uncertainty in measurement as of the reporting date. The new guidance adds the disclosure requirement for changes in unrealized gains and losses for the period included in other comprehensive income for recurring Level 3 fair value measurements held at the end of the reporting period and the range and weighted average of significant unobservable inputs used to develop Level 3 fair value measurements. The amendments in this update are effective for all entities for fiscal years beginning after December 15, 2019 including interim periods within that fiscal year. The adoption of the new guidance did not have a material impact to the Company's consolidated financial statements.\nRecently issued accounting pronouncements not yet adopted\nIn August 2020, FASB issued new guidance that simplifies the accounting for convertible debt instruments and convertible preferred stock by reducing the number of accounting models and the number of embedded conversion features that could be recognized separately from the primary contract. The guidance enhances transparency and improves disclosures for convertible instruments and earnings per share guidance. It is effective for annual reporting periods beginning after December 15, 2023, with early adoption permitted. This update permits the use of either the modified retrospective or fully retrospective method of transition. We are in the process of evaluating the effect that this new guidance will have on our consolidated financial statements and related disclosures.\nIn January 2017, the FASB issued new guidance simplifying the test for goodwill impairment. The new guidance eliminates Step 2 from the goodwill impairment test, instead requiring an entity to recognize a goodwill impairment charge for the amount by which the reporting unit's carrying amount exceeds the reporting unit's fair value. This guidance is effective for interim and annual goodwill impairment tests in fiscal years beginning after December 15, 2022, with early adoption permitted. We are in the process of evaluating the effect that this new guidance will have on our consolidated financial statements and related disclosures.\nIn June 2016, the FASB issued new guidance amending existing guidance for the accounting of credit losses on financial instruments. Under the new guidance, the valuation allowance for credit losses is expected to be incurred over the financial asset’s contractual term. We reviewed the new credit loss standard and determined that it applies to our accounts receivable, which are typically of short duration and for which we have not historically experienced significant credit losses. This guidance is effective for us in fiscal years beginning after December 15, 2022 with any cumulative effect of adoption recorded as an adjustment to retained earnings. We are in the process of evaluating the effect that this new guidance will have on our consolidated financial statements and related disclosures.\nNote 3. Revenue Recognition\nPerformance Obligations\nWe generate all of our revenue through contracts with customers. Revenue is either recognized over time as the service is provided, or at a point in time when the product is transferred to the customer, depending on the contract type. Our performance obligations typically have an original duration of one year or less.\nOur software licensing revenue stream generates revenue through the on-premises licensing of our codec technologies and integrated RealTimes platform. We recognize revenue upfront at the point in time when the software is made available to the customer. In cases where a sale or usage-based royalty is promised in exchange for a license of our codec technologies, revenue is recognized as the subsequent usage occurs for the contractual amount owed by the customer for that usage, as is allowed under the licensing of intellectual property section of Topic 606. Software licensing in our Mobile Services segment is invoiced on a monthly basis either based on usage of the respective product, or on a fixed fee basis. Our Consumer Media licensing is invoiced either quarterly or annually based on the usage of the respective product, or on a fixed fee basis. For each of these, the timing of payment generally does not vary significantly from the timing of invoice, however, certain of our long-term Consumer Media licensing contracts have extended payment schedules which may exceed one year.\nOur subscription services revenue stream allows customers to use hosted software over the respective contract period without taking possession of the technology. The stream is primarily comprised of our intercarrier messaging service, ringback tones, PC-based and mobile games subscriptions, and our RealPlayer and SuperPass services. Revenues related to subscription service products are recognized ratably over the contract period, or as we have the right to invoice as a practical expedient when that amount corresponds directly with the value to the customer of our performance completed to date. Consumer subscription products are paid in advance, typically on a monthly or quarterly basis. Subscription services offered to businesses are invoiced on a monthly basis, generally based upon the amount of usage for the previous month, and the timing of payment generally does not vary significantly from the timing of invoice.\nOur product sales revenue stream includes purchases of in-game virtual goods, mobile and wholesale games, as well as our RealPlayer product. Proceeds from sales of in-game virtual goods are initially recorded in deferred revenue and are recognized as revenues over 30 days, our estimate of the time period that end users benefit from these purchases and our related performance obligation is satisfied. Retail purchases are recognized and paid for at the point in time the product is made available to the end user. For games which are sold through third-party application storefronts, we evaluate the transaction for gross or net revenue recognition. As we typically are the primary obligor in our third-party transactions, we recognize revenues gross of any app store fees. We then receive monthly payments from the respective app store for all purchases within the respective month.\nOther revenues consist primarily of advertising and the distribution of third-party products, which are recognized and paid on a cost per impression or cost per download basis.\nDisaggregation of Revenue\nThe following table presents our disaggregated revenue by source and segment (in thousands):\nYear ended December 31, 2020\nConsumer Media Mobile Services Games\nBusiness Line\nSoftware License $ 5,957 $ 5,110 $ -\nSubscription Services 3,586 21,779 10,794\nProduct Sales 1,301 - 13,879\nAdvertising and Other 1,737 - 3,919\nTotal $ 12,581 $ 26,889 $ 28,592\nYear ended December 31, 2019\nConsumer Media Mobile Services Games\nBusiness Line\nSoftware License $ 6,522 $ 3,101 $ -\nSubscription Services 4,148 24,042 12,121\nProduct Sales 825 - 9,823\nAdvertising and Other 1,675 - 3,545\nTotal $ 13,170 $ 27,143 $ 25,489\nThe following table presents our disaggregated revenue by sales channel (in thousands):\nYear ended December 31, 2020\nConsumer Media Mobile Services Games\nSales Channel\nBusiness to Business $ 7,693 $ 26,495 $ 4,664\nDirect to Consumer 4,888 394 23,928\nTotal $ 12,581 $ 26,889 $ 28,592\nYear ended December 31, 2019\nConsumer Media Mobile Services Games\nSales Channel\nBusiness to Business $ 8,199 $ 26,691 $ 4,710\nDirect to Consumer 4,971 452 20,779\nTotal $ 13,170 $ 27,143 $ 25,489\nContract Balances\nThe timing of revenue recognition may differ from the timing of invoicing to our customers. We record accounts receivable when the right to consideration becomes unconditional, except for the passage of time. For certain contracts, payment schedules may exceed one year; for those contracts we recognize a long-term receivable. As of December 31, 2020 and 2019 our balance of long-term accounts receivable was $0.6 million and $0.3 million, respectively, and is included in other long-term assets on our consolidated balance sheets. The increase in this balance from December 31, 2019 to December 31, 2020 is primarily due to a contract renewal in 2020. During the year ended December 31, 2020, we recorded no impairments to our contract assets.\nWe record deferred revenue when cash payments are received in advance of our completion of the underlying performance obligation. As of December 31, 2020 and 2019, we had deferred revenue balances of $2.2 million and $2.1 million, respectively, primarily due to deferred revenue associated with monthly subscriptions.\nJudgments and Estimates\nOur contracts with customers can include obligations to provide multiple services to a customer. Determining whether products and services are considered distinct performance obligations that should be accounted for separately versus together can require significant judgment. For example, certain contracts include the sale of software licenses or subscriptions as well as services to be delivered over time. Judgment is also required to determine the standalone selling price (\"SSP\") for each distinct performance obligation in these arrangements. We allocate revenue to each performance obligation based on the relative SSP. We determine SSP for performance obligations based on overall pricing objectives, which take into consideration observable prices and market conditions.\nFor certain of our contracts, we recognize revenues using the sales- and usage-based exception as defined in the licensing guidance of Topic 606. For these contracts, we typically receive reporting of actual usage a quarter in arrears, and as such, we are required to estimate the current quarter's usage. To make these estimates, we utilize historical reporting information, as well as industry trends and interim reporting to quantify total quarterly usage. As actual usage information is received, we record a true-up in the following quarter to reflect any variance from our estimate. In the years ended December 31, 2020 and 2019, we did not record any material true-ups to our consolidated financial statements.\nPractical Expedients\nFor those contracts for which we recognize revenue at the amount to which we have the right to invoice for service performed, we do not disclose the value of any unsatisfied performance obligations. We also do not disclose the remaining unsatisfied performance obligations which have an original duration of one year or less. Additionally, we immediately expense sales commissions when incurred as the amortization period would have been less than one year. These costs are recorded within sales and marketing expense.\nNote 4. Acquisitions and Dispositions\nNapster Acquisition\nOn January 18, 2019, RealNetworks acquired an additional 42% interest in Rhapsody International, Inc. (doing business as Napster) which brought our aggregate ownership to 84% of Napster's outstanding equity, thus giving RealNetworks a majority voting interest. Napster's music streaming service provides users with broad access to digital music, offering on-demand streaming and conditional downloads through unlimited access to a catalog of millions of music tracks. Napster offers music services worldwide and generates revenue primarily through subscriptions to its music services either directly to consumers or through distribution partners. On August 24, 2020, RealNetworks announced that Napster had signed an agreement to be sold to MelodyVR Group PLC in a transaction that closed in the fourth quarter of 2020. See Napster Disposition below for additional details.\nInitially formed in 2007 and branded then as Rhapsody, Napster began as a joint venture between RealNetworks and MTV Networks, a division of Viacom International, Inc. Prior to the acquisition of the additional 42% interest in Napster, we accounted for our investment using the equity method of accounting.\nSubsequent to RealNetworks’ January 18, 2019 acquisition, Napster operated as an independent business with its own board of directors, strategy and leadership team. Napster's separate legal existence was further supported by each company's ongoing compliance with corporate formalities, the independent direction of Napster's activities, and the consistent treatment of each of RealNetworks and Napster as distinct organizations. During the periods of the acquisition date until the announcement of the sale, we consolidated Napster's financial results into our financial statements and reported Napster as a separate segment in our consolidated financial statements.\nWe recorded 100% of the estimated fair value of the assets acquired and liabilities assumed as of January 18, 2019 based on the results of an independent valuation. The 16% of Napster that RealNetworks did not own between the acquisition and disposition was accounted for as a noncontrolling interest in our consolidated financial statements. As part of this consolidation, the carrying value of our previous 42% equity method investment was remeasured to fair value on the acquisition date. The remeasurement to fair value of the historical 42% ownership interest resulted in the recognition of a $2.7 million gain at the time of acquisition, which is a component of the overall gain recognized as a part of this transaction. Our consolidated balance sheet reflected Napster's working capital deficit, which resulted in a consolidated working capital deficit. RealNetworks did not have any contractual or implied obligation to provide funding or other financial support to Napster, or to guarantee or provide other such support related to Napster's third party borrowing or Napster's other obligations on our consolidated balance sheet.\nSee Note 5. Fair Value Measurements for detail on terms of the transaction.\nThe following table summarizes the final allocation of the total consideration to the estimated fair values of the assets acquired and liabilities assumed as of January 18, 2019 (in thousands):\nConsideration, at estimated fair value:\nCash $ 1,000\nContingent consideration 11,600\nRealNetworks' preexisting 42% equity interest in Napster 2,700\nEffective settlement of Napster debt and warrants, held by RealNetworks 6,408\nTotal consideration $ 21,708\nAssets acquired and liabilities assumed, at estimated fair value:\nCash and cash equivalents $ 10,127\nAccounts receivable 20,915\nPrepaid expenses and other current assets 2,421\nRestricted cash 2,322\nEquipment, software and leasehold improvements 474\nOperating lease assets 2,400\nOther long-term assets 77\nDeferred tax assets, net 5,932\nIntangible assets 23,700\nGoodwill 45,520\nTotal assets acquired 113,888\nAccounts payable 786\nAccrued royalties and fulfillment 59,036\nAccrued and other current liabilities 7,032\nDeferred revenue, current portion 3,526\nNotes payable 12,211\nDeferred tax liabilities, net 6,208\nLong-term lease liabilities 1,190\nOther long-term liabilities 1,621\nTotal liabilities assumed 91,610\nTotal net assets acquired 22,278\nNoncontrolling interests 570\nNet assets acquired $ 21,708\nUnder the acquisition method of accounting, the purchase price was allocated to the assets acquired and the liabilities assumed based on their estimated fair values. In the fourth quarter of 2019, we recorded purchase price allocation adjustments that reflect new information obtained during the measurement period about facts and circumstances that existed at the date of the acquisition. These adjustments did not have a material effect on 2019 consolidated financial statements and were primarily associated with the estimated fair values of acquired prepaid royalties, accrued royalties, and accrued taxes, with a corresponding net reduction of $3.0 million to goodwill. Adjustments to acquired prepaid royalties and accrued royalties also include the matching and invoicing of music royalties owed as of the opening balance sheet.\nPrior to discontinued operations and held-for-sale accounting treatment, acquired intangible assets had a total weighted average useful life of approximately 8 years, were being amortized using the straight line method, and were comprised of the following (in thousands):\nIntangible category Estimated fair value Method used to calculate fair value Estimated remaining useful life\nTrade name and trademarks $ 6,800 Relief-from-royalty 15 years\nDeveloped technology 5,900 Excess earnings 4 years\nCustomer relationships 5,900 Cost-to-replace 3 years\nPartner relationships 5,100 Distributor method 8 years\nTotal $ 23,700\nThe estimated fair value amounts for each of these intangibles was determined using a fair value measurement categorized within Level 3 of the fair value hierarchy.\nThe fair value of the trade name and trademarks intangible asset was estimated using the income approach, utilizing the relief from royalty method, which values the assets by estimating the savings achieved by ownership of trade name and trademarks when compared with the cost of licensing them from an independent owner.\nThe fair value of developed technology was estimated using the income approach, utilizing the excess earnings method. Under this method, cash flows attributable to the asset are estimated by deducting economic costs, including operating expenses and contributory asset charges, from revenue expected to be generated by the asset.\nThe fair value of customer relationships was estimated using a cost-to-replace approach, whereby the number of subscribers and the cost to acquire subscribers are key estimates utilized in the valuation.\nThe fair value of partner relationships was estimated using the income approach, which uses market-based distributor data to value underlying distributor relationships. Revenue, earnings, and cash flow estimates associated with these underlying distributor relationships are key estimates in determining the fair value of the partner relationships intangibles.\nThe fair value of deferred revenue was estimated using the income approach, utilizing a cost to fulfill analysis by estimating the direct and indirect costs related to supporting remaining obligations plus an assumed operating margin.\nThe fair value of our preexisting 42% equity method investment was remeasured to an estimated fair value of $2.7 million, which resulted in a pretax gain of $2.7 million, as our existing carrying value was zero. This gain, as well as the settlement of preexisting relationships and other purchase accounting adjustments discussed below, comprise the total gain of $12.3 million recognized in other income (expenses), net in the consolidated statement of operations in 2019.\nThe fair value of our preexisting equity method investment was calculated using an average of the income and market approach to arrive at estimated total enterprise value. The income approach fair value measurement was based on significant inputs that are not observable in the market and thus represents a fair value measurement categorized within Level 3 of the fair value hierarchy. Key assumptions used in estimating future cash flows included projected revenue growth and operating expenses, as well as the selection of an appropriate discount rate. Estimates of revenue growth and operating expenses were based on internal projections and considered the historical performance of Napster's business. The discount rate applied was based on Napster's weighted-average cost of capital and included a small-company risk premium. The market approach fair value measurement was based on a market comparable methodology. At the time of acquisition, we used a group of comparable companies and selected an appropriate EBITDA multiple to apply to Napster's projected 2020 and 2021 EBITDA. Assumptions in both the income and market approaches were significant to the overall valuation of Napster and changes to these assumptions could have materially impacted the fair values of assets acquired and liabilities assumed, noncontrolling interests, total consideration, and gain on consolidation.\nThe fair value of the contingent consideration was estimated using multiple scenarios for each tranche of contingent consideration and then probability weighting each scenario and discounting them to estimated fair value of $11.6 million at the time of acquisition. This fair value calculation was directly impacted by the estimated total enterprise value described above. See Note 5. Fair Value Measurements for additional discussion.\nThe effective settlement of Napster's debt and warrants totaling $6.4 million represented the estimated fair value of debt and warrants held between RealNetworks and Napster as of the acquisition date. The estimated fair value was derived from the estimated total enterprise value described above. The resulting net gain of $5.5 million was included in other income (expenses), net in the consolidated statement of operations in 2019.\nThe preexisting $2.8 million guarantee related to Napster's outstanding indebtedness on their revolving credit facility was eliminated upon the consolidation of Napster. This resulted in RealNetworks recording a gain of $2.8 million at the time of acquisition, which was included in other income (expenses), net in the consolidated statement of operations in 2019. RealNetworks has not been required to pay any portion of this commitment, and Napster fully repaid this loan balance on April 30, 2019, thus releasing RealNetworks' previous guaranty.\nPrior to our acquisition of Napster, we accounted for our investment under the equity method of accounting and recorded Napster 's foreign currency translation adjustments in our equity. As part of the acquisition method of accounting, we released these amounts and recorded a gain of $1.3 million at the time of acquisition, which is included in other income (expenses), net in the consolidated statement of operations in 2019.\nWe recorded the fair value of noncontrolling interests on the acquisition date, estimated at $0.6 million, using the estimated total enterprise value described above.\nWe also recorded goodwill of $45.5 million, representing the intangible assets that do not qualify for separate recognition for accounting purposes, including the expected growth in Napster's business to business model and the assembled workforce. The goodwill was reported in the Napster segment and was not deductible for income tax purposes.\nFor the year ended December 31, 2019, Napster's revenue and net loss including noncontrolling interests in our consolidated statements of operations is included as discontinued operations, as discussed below.\nFor the year ended December 31, 2019, we incurred approximately $1.5 million in acquisition-related costs, including regulatory, legal, and other advisory fees, which we recorded within general and administrative expenses on the consolidated statements of operations.\nNapster Disposition\nRealNetworks, Inc. entered into a Support Agreement dated August 25, 2020 by and among its 84%-owned subsidiary, Napster, and MelodyVR Group PLC, referred to as MelodyVR, an English public limited company. The Support Agreement was executed in connection with an Agreement and Plan of Merger, or Merger Agreement, by and among Napster, MelodyVR, and a wholly owned subsidiary of MelodyVR. The transaction was completed on December 30, 2020. Pursuant to the Merger Agreement, on the closing date, MelodyVR's subsidiary merged with and into Napster, with Napster surviving as a wholly owned subsidiary of MelodyVR. Other than as Securityholder Representative, RealNetworks was not a party to the Merger Agreement.\nMelodyVR paid consideration of approximately $26 million to certain holders of debt and equity of Napster, comprised of $12 million in cash, shares of MelodyVR, and a $3 million 18-month indemnity escrow. The shares of MelodyVR that RealNetworks received may not be sold or transferred, except in limited circumstances, for a period of approximately one year from the close of the transaction. Certain proceeds from the transaction were used to fully repay the advance to Napster on the revolving line of credit, as discussed in Note 9. Debt, pay Napster's transaction expenses, and pay amounts to certain of Napster's common stockholders. Additionally, a portion of the proceeds paid to RealNetworks is subject to contingent consideration obligations associated with its January 2019 acquisition from a third party of a 42% stake in Napster and a $5.0 million loan that the third party had made to Napster. See Note 5. Fair Value Measurements for additional discussion.\nEffective on the execution of the Agreement and Plan of Merger on August 25, 2020, Napster was treated as discontinued operations and held-for-sale for accounting and disclosure purposes and subsequently sold in December 2020. As such, Napster’s operating results and financial condition were recast to conform to this presentation.\nThe following table summarizes the carrying amounts of major classes of assets and liabilities of discontinued operations at December 31, 2019:\nDecember 31, 2019\nCash and cash equivalents $ 8,333\nTrade accounts receivable, net of allowance 16,740\nOther current assets 3,303\nTotal current assets of discontinued operations 28,376\nNet equipment, software, and leasehold improvements 401\nOther intangible assets 19,286\nGoodwill 45,520\nOther non-current assets 2,604\nTotal assets of discontinued operations $ 96,187\nAccrued royalties, fulfillment and other current liabilities $ 65,310\nNotes payable 7,331\nTotal current liabilities of discontinued operations 72,641\nOther non-current liabilities 1,843\nTotal liabilities of discontinued operations $ 74,484\nThe following table summarizes the net loss from discontinued operations for the years ended December 31, 2020 and 2019:\n2020 2019\nRevenue $ 96,185 $ 106,311\nCost of revenue 73,318 85,901\nGross profit 22,867 20,410\nOperating expenses 24,734 25,789\nOperating loss (1,867) (5,379)\nOther income (expenses) 2,175 (285)\nIncome (loss) from discontinued operations before income taxes 308 (5,664)\nIncome tax expense 514 366\nNet loss from discontinued operations (206) (6,030)\nNoncontrolling interests in net income (loss) from discontinued operations (184) (1,094)\nNet loss from discontinued operations attributable to RealNetworks $ (22) $ (4,936)\nWe recorded a gain on the sale of Napster in the amount of $1.9 million, which was recorded to Net loss from discontinued operations on the Consolidated Statements of Operations and included in Other income (expense) in the above table.\nThe following table summarizes the gain recognized for the year ended December 31, 2020 from the sale of Napster:\nNet proceeds received(1)\n$ 22,849\nNet assets disposed (20,935)\nGain on sale of Napster $ 1,914\n(1) Proceeds received are net of transaction costs, funds to minority shareholders and fair value adjustments to MelodyVR stock.\nThe final gain on the sale of Napster could be reduced primarily by claims against the $3.0 million indemnity escrow which is included in Other assets on the consolidated balance sheets. We are not aware of any claims against the escrow at December 31, 2020.\nNote 5. Fair Value Measurements\nItems Measured at Fair Value on a Recurring Basis\nThe following tables present information about our financial assets that have been measured at fair value on a recurring basis as of December 31, 2020 and 2019, and indicates the fair value hierarchy of the valuation inputs utilized to determine fair value (in thousands).\nFair Value Measurements as of Amortized Cost as of\nDecember 31, 2020 December 31, 2020\nLevel 1 Level 2 Level 3 Total\nCash and cash equivalents $ 23,940 $ - $ - $ 23,940 $ 23,940\nInvestments - - 9,965 9,965 N/A\nRestricted cash equivalents 1,630 - - 1,630 1,630\nTotal assets $ 25,570 $ - $ 9,965 $ 35,535 N/A\nAccrued and other current liabilities:\nNapster acquisition contingent consideration $ - $ - $ 4,800 $ 4,800 N/A\nOther long-term liabilities\nSimple Agreements for Future Equity - - 2,106 2,106 N/A\nTotal liabilities $ - $ - $ 6,906 $ 6,906 N/A\nFair Value Measurements as of Amortized Cost as of\nDecember 31, 2019 December 31, 2019\nLevel 1 Level 2 Level 3 Total\nCash and cash equivalents $ 8,472 $ - $ - $ 8,472 $ 8,472\nRestricted cash equivalents 3,500 1,380 - 4,880 4,880\nTotal assets $ 11,972 $ 1,380 $ - $ 13,352 $ 13,352\nAccrued and other current liabilities:\nNapster acquisition contingent consideration $ - $ - $ 2,800 $ 2,800 N/A\nOther long-term liabilities\nNapster acquisition contingent consideration - - 9,800 9,800 N/A\nTotal liabilities $ - $ - $ 12,600 $ 12,600 N/A\nRestricted cash equivalents as of December 31, 2020 and 2019 relate to cash pledged as collateral against letters of credit in connection with lease agreements and, as of December 31, 2020 and 2019, our Loan Agreement requires us to maintain a minimum balance of $1.5 million and $3.5 million,respectively, unrestricted cash at the bank. See Note 9. Debt for additional details.\nInvestments as of December 31, 2020 are comprised of MelodyVR ordinary shares received as a portion of the consideration from the Napster disposition. The fair value of these equity securities was calculated using the closing price of the shares as of December 31, 2020 and discounted for a lack of liquidity due to the restriction of selling or transferring the shares. Pursuant to the transaction documents executed in connection with the Napster disposition, RealNetworks is restricted from selling or transferring the MelodyVR shares, except in limited circumstances, for a period of approximately one year from the close of the transaction. The determination of the discount required the use of significant unobservable inputs, such as the lock-up period combined with an estimated equity volatility for the shares, that reflect our own estimates of assumptions that market participants would use. A 10% increase or decrease to the equity volatility rate could result in a $0.2 million decrease or $0.1 million increase, respectively, in the fair value of the stock. For the year ended December 31, 2020, we recognized unrealized gains of $0.7 million in Gain on equity and other investments, net on the consolidated statement of operations.\nAccrued and other current liabilities as of December 31, 2020 and 2019 and other long-term liabilities as of December 31, 2019 include the estimated fair value of the contingent consideration for the Napster acquisition, which was determined using a fair value measurement categorized within Level 3 of the fair value hierarchy. As discussed in Note 4. Acquisitions and Dispositions, this liability is adjusted quarterly to fair value through earnings. The terms of the 2019 transaction whereby RealNetworks acquired a controlling interest in Napster included initial cash consideration of $1.0 million and additional contingent consideration. Initial cash consideration of $0.2 million was paid at closing. With regards to contingent\nconsideration, over the five years following the acquisition, RealNetworks committed to pay the lesser of the following: (a) an additional $14.0 million to seller, or (b) if RealNetworks were to sell the interest to a third party for less than $15.0 million, the actual amount received by RealNetworks, minus the $1.0 million initial consideration. These contingent consideration amounts were part of the total consideration at estimated fair value.\nDuring the year ended December 31, 2020, we recorded a change in fair value of the contingent consideration of $8.6 million as a decrease to the total liability on the consolidated balance sheet and as a reduction in operating expense on the consolidated statement of operations. During the fiscal year ended December 31, 2019, we recorded a change in fair value of the contingent consideration of $1.0 million as an increase to the total liability on the consolidated balance sheet and as an increase in operating expense on the consolidated statement of operations. Other than the adjustments to the estimated fair value, there were no changes in the balance of the contingent consideration during fiscal years 2020 and 2019.\nThe valuation methodology of contingent consideration at December 31, 2020 was based on RealNetworks' contractual obligation to pay the seller of the interests purchased by RealNetworks in the January 2019 Napster transaction discussed in Note 4. Acquisitions and Dispositions. For purposes of determining fair value of contingent consideration at December 31, 2020, this obligation was deemed to have a fair value of $4.8 million based on the terms of the Napster sale transaction. This amount represents the amount received for sale of the interest acquired in the Napster purchase transaction of $5.0 million less the $0.2 million paid at closing in January 2019. At December 31, 2019, the fair value of the contingent consideration was estimated using multiple scenarios for each tranche of contingent consideration and then probability weighting each scenario and discounting them to an estimated fair value.\nIn the third quarter of 2020, Scener, our 82%-owned subsidiary, received $2.1 million in cash in return for issuing rights to investors for certain shares of Scener's capital stock contingent upon the occurrence of specific future capital raising events by Scener. The rights were each issued as a Simple Agreement for Future Equity (\"SAFE Notes\"). The future contingent events also contemplate the possibility of Scener having to pay back the original cash investment to each investor. The SAFE Notes are recorded as a liability on our consolidated financial statements within Other long-term liabilities and are required to be recorded at fair value each quarter. The valuation analysis model for the fair value of the SAFE Notes as of December 31, 2020 used significant unobservable inputs that reflect our own estimates of assumptions that market participants would use. There has been no change in the estimated fair value since the issuance in the third quarter of 2020. Significant unobservable inputs to the valuation analysis model include the underlying conversion date for the SAFE Notes, Scener's capitalization prior to conversion of the SAFE Notes, an 80% discount rate as defined in the SAFE Note agreements, conversion price, conversion shares and an annual present value rate. All of the inputs are subject to significant judgment. See Note 19. Related Party Transactions for additional discussion of Scener.\nItems Measured at Fair Value on a Non-recurring Basis\nCertain of our assets and liabilities are measured at estimated fair value on a non-recurring basis, using Level 3 inputs. These instruments are subject to fair value adjustments only in certain circumstances (for example, when there is evidence of impairment). We did not record any impairments on those assets required to be measured at fair value on a non-recurring basis in 2020 or 2019.\nNote 6. Allowance for Doubtful Accounts Receivable and Sales Returns\nActivity in the allowance for doubtful accounts receivable (in thousands):\nYears ended December 31,\n2020 2019\nBalance, beginning of year $ 484 $ 475\nAddition to allowance 117 24\nAmounts written off (30) -\nEffects of foreign currency translation 27 (15)\nBalance, end of year $ 598 $ 484\nActivity in the allowance for sales returns (in thousands):\nYears ended December 31,\n2020 2019\nBalance, beginning of year $ 32 $ 85\nAddition (reduction) to allowance (1) (32)\nAmounts written off - (21)\nBalance, end of year $ 31 $ 32\nTotal, Allowance for Doubtful Accounts Receivable and Sales Returns $ 629 $ 516\nTwo customers individually comprised more than 10% of trade accounts receivable at December 31, 2020, with the customers accounting for 19% and 10% each. Two customers individually comprised more than 10% of trade accounts receivable at December 31, 2019, with the customers accounting for 26% and 11% each.\nTwo customers accounted for 25%, or $17.3 million, of consolidated revenue during the year ended December 31, 2020, in the Mobile Services segment.\nOne customer accounted for 13%, or $8.8 million, of consolidated revenue during the year ended December 31, 2019, in our Mobile Services segment.\nNote 7. Goodwill\nChanges in goodwill (in thousands):\nDecember 31,\n2020 2019\nBalance, beginning of year\nGoodwill $ 327,561 $ 327,608\nAccumulated impairment losses (310,653) (310,653)\n16,908 16,955\nEffects of foreign currency translation 467 (47)\n467 (47)\nBalance, end of year\nGoodwill 328,028 327,561\nAccumulated impairment losses (310,653) (310,653)\n$ 17,375 $ 16,908\nGoodwill by segment (in thousands):\nDecember 31,\n2020 2019\nConsumer Media $ 580 $ 580\nMobile Services 2,188 2,074\nGames 14,607 14,254\nTotal goodwill $ 17,375 $ 16,908\nNo impairments of goodwill were recorded in 2020 or 2019.\nSee Note 4. Acquisitions and Dispositions, for details on our acquisitions and disposals and the impact to goodwill.\nNote 8. Accrued and Other Current Liabilities\nAccrued and other current liabilities (in thousands):\nDecember 31, 2020 December 31, 2019\nRoyalties and other fulfillment costs $ 1,149 $ 1,535\nEmployee compensation, commissions and benefits 4,512 4,655\nSales, VAT and other taxes payable 1,231 801\nOperating lease liabilities - current 3,373 3,643\nNapster acquisition contingent consideration 4,800 2,800\nOther 2,785 4,061\nTotal accrued and other current liabilities $ 17,850 $ 17,495\nNote 9. Debt\nThe Coronavirus Aid, Relief and Economic Security (CARES) Act, signed into law in March 2020, established the Paycheck Protection Program (PPP) to provide a direct incentive for small businesses to keep workers on their payroll. Through the PPP, participating banks write loans to eligible businesses and loan amounts are forgiven to the extent that employee retention criteria are met and proceeds are used to cover eligible costs over a 24-week measurement period following loan funding. In April 2020, following an assessment of eligibility and approval of its Board of Directors, RealNetworks issued a promissory note to a participating bank in the principal amount of $2.9 million pursuant to the PPP. The note has a maturity of 2 years, an interest rate of 1.0%, no pre-payment penalty, a ten-month deferment period starting after the 24-week measurement period, and is eligible for forgiveness pursuant to PPP guidelines. In April 2020, the Secretary of the Treasury and Small Business Administration (SBA) announced that the government will review all PPP loans of more than $2.0 million before there is forgiveness. We applied for forgiveness in January 2021. No assurance can be given that we will be granted forgiveness for the PPP loan. The PPP loan will be derecognized upon confirmation of forgiveness from the SBA and/or upon repayment of the loan in accordance with its terms.\nIn August 2019, RealNetworks and Napster entered into a Loan and Security Agreement (Loan Agreement) with a third-party financial institution. Under the terms of the August 2019 Loan Agreement, the bank extended a revolving line of credit (Revolver) not to exceed $10.0 million in the aggregate. Available advances on the Revolver, which are used for working capital and general corporate purposes, are based on a borrowing base that comprises accounts receivable and direct to consumer deposits. Borrowings under the Loan Agreement are secured by a first priority security interest in the assets of RealNetworks and Napster. Advances bear interest at a rate equal to one-half of one percentage point (0.5%) above the greater of the prime rate or 5.5%, with monthly payments of interest only and principal due at the end of the two-year term. The Loan Agreement contains customary covenants, including financial covenants, minimum EBITDA levels to be updated annually, and maintaining a minimum balance of $3.5 million unrestricted cash at the bank. We are in the process of negotiating the customary covenants for 2021, and we do not expect the resulting revisions to have a material effect on the Loan Agreement.\nIn December 2020, at the time of closing the sale of Napster, as further described in Note 4. Acquisitions and Dispositions, borrowings of $3.9 million on the Revolver were repaid in full and certain terms were amended, including the removal of Napster as a party to the lending agreement and maintaining a minimum balance of $1.5 million unrestricted cash at the bank, a reduction from the prior requirement of a minimum balance of $3.5 million of unrestricted cash.\nIn February 2021, we entered into an amendment with the bank on our Revolver, whereby the borrowing base for the Revolver is comprised of accounts receivable and direct to consumer deposits for RealNetworks only. Borrowings may not exceed $6.5 million and are reduced by a $1.0 million standby letter of credit entered into with the bank in connection with certain lease agreements. Advances bear interest at a rate equal to one-half of one percentage point (0.5%) above the greater of the prime rate or 3.25%. The Revolver matures August 1, 2022.\nWe paid and capitalized $0.6 million of financing fees to enter into the Revolver in August 2019, and the financing fees are being amortized over the term of the credit agreement. The unamortized fees were $0.2 million at December 31, 2020 and are included in Deferred costs, current on our consolidated balance sheets.\nNote 10. Restructuring and Other Charges\nRestructuring and other charges in 2020 and 2019 consist of costs associated with the ongoing reorganization of our business operations and expense re-alignment efforts, which include severance costs due to workforce reductions. Asset related and other costs in 2020 primarily related to the impairment of an operating lease asset. Asset related and other costs in 2019 primarily related to the termination of certain contracts as we continued to shift focus onto free-to-play games that offer in-game purchases of virtual goods and away from the premium mobile games that require a one-time purchase.\nRestructuring charges are as follows (in thousands):\nEmployee Separation Costs Asset Related and Other Costs Total\nCosts incurred and charged to expense for the year ended December 31, 2020 $ 1,288 $ 1,241 $ 2,529\nCosts incurred and charged to expense for the year ended December 31, 2019 $ 1,226 $ 728 $ 1,954\nChanges to the accrued restructuring liability (which is included in Accrued and other current liabilities) for 2020 and 2019 (in thousands):\nEmployee Separation Costs Asset Related and Other Costs Total\nAccrued liability as of December 31, 2018 $ 755 $ - $ 755\nCosts incurred and charged to expense for the year ended December 31, 2019, excluding noncash charges 1,226 174 1,400\nCash payments (1,871) - (1,871)\nAccrued liability as of December 31, 2019 110 174 284\nCosts incurred and charged to expense for the year ended December 31, 2020 1,288 - 1,288\nCash payments (1,052) (174) (1,226)\nAccrued liability as of December 31, 2020 $ 346 $ - $ 346\nNote 11. Shareholders’ Equity\nAccumulated Other Comprehensive Loss\nChanges in components of accumulated other comprehensive loss (in thousands):\nYears Ended December 31,\n2020 2019\nForeign currency translation\nAccumulated other comprehensive loss, beginning of period $ (61,323) $ (61,118)\nTranslation adjustments 909 (205)\nNapster disposition (227) -\nNet current period other comprehensive income (loss) 682 (205)\nAccumulated other comprehensive loss balance, end of period $ (60,641) $ (61,323)\nPreferred Stock. Each share of Series A preferred stock entitles the holder to one votes and dividends equal to one thousand times the aggregate per share amount of dividends declared on the common stock. There are no shares of Series A preferred stock outstanding.\nIn February 2020, Mr. Glaser, Chairman of the Board and Chief Executive Officer of RealNetworks, invested approximately $10.0 million in RealNetworks in exchange for the issuance to him of 8,064,516 shares of Series B preferred stock. The Series B preferred stock is non-voting and is convertible into common stock on a one-to-one basis subject to the limitation described in Note 19. Related Party Transactions. The Series B preferred stock has no liquidation preference and no preferred dividends.\nUndesignated preferred stock will have rights and preferences that are determinable by the Board of Directors if and when determination of a new series of preferred stock has been established.\nNote 12. Employee Stock and Benefit Plans\nEquity Compensation Plans. Under our equity incentive plans, we may grant various types of equity awards to employees and Directors. We have granted time-vest and performance-vest stock options and time-vest and performance-vest restricted stock. Generally, options vest based on continuous employment, over a four-year period. The options generally expire seven years from the date of grant and are exercisable at the market value of the common stock at the grant date. Time-vest restricted stock awards generally vest based on continuous employment over a two or four-year period. Performance-based awards vest if the specified performance targets are met and the grantee remains employed over the required period. The performance targets for these awards are generally based on the achievement of company-specific financial results. For these performance-based awards, expense is recognized when it is probable the performance goal will be achieved. We have also issued market-based performance stock options to certain employees. These awards vest if the market condition is met and the grantee remains employed over the requisite service period.\nWe issue new shares of common stock upon exercise of stock options and the vesting of restricted stock. As of December 31, 2020, there were 3.7 million shares of common stock authorized for future equity awards. Each restricted stock unit granted reduces and each restricted stock unit forfeited or canceled increases the shares available for future grant by a factor of 1.6 shares. Each stock option granted reduces and each stock option forfeited or canceled increases the shares available for future grant by a factor of one share.\nStock-based compensation expense recognized in our consolidated statements of operations includes amounts related to stock options and restricted stock, and was as follows (in thousands):\nYears Ended December 31,\n2020 2019\nTotal stock-based compensation expense $ 1,420 $ 2,881\nThe total stock-based compensation amounts disclosed above are recorded in the respective line items within operating expenses in the consolidated statements of operations. Included in the expense for 2019 was stock compensation recorded for 2018 incentive bonuses paid in fully vested restricted stock units, which were authorized and granted in the first quarter of 2019. No stock-based compensation was capitalized as part of the cost of an asset as of December 31, 2020 or 2019. As of December 31, 2020, we had $2.8 million of total unrecognized compensation cost, net of estimated forfeitures, related to stock awards. The unrecognized compensation cost is expected to be recognized over a weighted-average period of approximately three years.\nAs discussed in Note 1. Description of Business and Summary of Significant Accounting Policies, the valuation models for stock option awards require various highly judgmental assumptions. The assumption for the expected term of the options represents the estimated period of time until exercise and is based on historical experience of similar awards, including the contractual terms, vesting schedules, and expectations of future employee behavior. Expected stock price volatility is based on historical volatility of our common stock for the related expected term. The risk-free interest rate is based on the implied yield available on U.S. Treasury zero-coupon issues with a term equivalent to the expected term of the stock options. The dividend yield is estimated at zero because we do not currently anticipate paying dividends in the foreseeable future.\nThe fair value of options granted used the following weighted average assumptions:\nYears ended December 31,\n2020 2019\nExpected dividend yield - % - %\nRisk-free interest rate 0.37 % 2.12 %\nExpected term (years) 4.8 4.0\nVolatility 45 % 41 %\nRestricted stock unit and award activity was as follows (shares are in thousands):\nNumber of Shares Weighted Average Grant Date Fair Value Per Share Total Grant Date Fair Value of Vested Awards (000's)\nNonvested shares, December 31, 2018 698 $ 2.63\nGranted 701 2.54\nVested (499) 3.10 $ 1,547\nForfeited/Canceled (55) 3.33\nNonvested shares, December 31, 2019 845 $ 2.24\nGranted 1,446 1.49\nVested (218) 1.89 $ 412\nForfeited/Canceled (270) 2.38\nNonvested shares, December 31, 2020 1,803 $ 1.65\nAt December 31, 2020, the aggregate intrinsic value of restricted stock awards was $2.8 million and the weighted average remaining contractual term was approximately two years.\nStock option activity (shares are in thousands):\nOptions Outstanding Weighted Average Grant Date Fair Value\nNumber\nof Shares\nWeighted\nAverage\nExercise Price\nOutstanding, December 31, 2018 7,328 $ 4.56\nOptions granted at common stock price 988 2.33 $ 0.81\nOptions exercised - -\nOptions cancelled (845) 4.67\nOutstanding, December 31, 2019 7,471 $ 4.25\nOptions granted at common stock price 2,382 1.26 $ 0.47\nOptions exercised - -\nOptions cancelled (3,354) 4.59\nOutstanding, December 31, 2020 6,499 $ 2.97\nExercisable, December 31, 2020 3,304 $ 4.06\nVested and expected to vest, December 31, 2020 5,262 $ 3.21\nAs of December 31, 2020, the weighted average remaining contractual life of the options was as follows: outstanding options 4.7 years; exercisable options 3.6 years; and vested and expected to vest options 4.5 years. As of December 31, 2020, the aggregate intrinsic values for our outstanding, exercisable, and vested and expected to vest options were $0.7 million, insignificant, and $0.5 million, respectively.\nThe aggregate intrinsic value of stock options exercised in 2020 was zero, and for 2019 was insignificant.\nRetirement Savings Plan. We have a salary deferral plan (401(k) Plan) that covers substantially all employees. Eligible employees may contribute a portion of their eligible compensation to the plan up to limits stated in the plan documents, not to exceed the dollar amounts set by applicable laws. We match a percentage of employee contributions up to certain limits. During the years ended December 31, 2020 and 2019, we contributed $0.3 million and $0.3 million, respectively, in matching contributions. We can terminate the matching contributions at our discretion. We have no other post-employment or post-retirement benefit plans.\nNote 13. Income Taxes\nComponents of income (loss) from continuing operations before income taxes (in thousands):\nYears ended December 31,\n2020 2019\nUnited States operations $ (8,241) $ (11,483)\nForeign operations 3,182 (3,043)\nIncome (loss) before income taxes $ (5,059) $ (14,526)\nComponents of income tax expense (benefit) (in thousands):\nYears ended December 31,\n2020 2019\nCurrent:\nUnited States federal $ 202 $ 214\nState and local 20 39\nForeign 530 451\nTotal current 752 704\nDeferred:\nUnited States federal (495) (54)\nForeign (202) 52\nTotal deferred (697) (2)\nTotal income tax expense (benefit) $ 55 $ 702\nIncome tax expense differs from “expected” income tax expense (computed by applying the U.S. federal income tax rate of 21% in 2020 and 2019) from continuing operations before income taxes due to the following (in thousands):\nYears ended December 31,\n2020 2019\nUnited States federal tax expense (benefit) at statutory rate $ (1,062) $ (3,050)\nState taxes, net of United States federal tax expense (benefit) (807) 629\nChange in valuation allowance 2,545 2,528\nNon-deductible stock compensation 1,406 253\nImpact of non-U.S. jurisdictional tax rate difference (169) (116)\nResearch and development tax credit (183) (67)\nNon-U.S. withholding tax 229 170\nChange in indefinite reinvestment assertion (8) (72)\nContingent consideration (1,806) 210\nOther (90) 217\nTotal income tax expense (benefit) $ 55 $ 702\nNet deferred tax assets, which are recorded at December 31, 2020 and December 31, 2019 using a 21% tax rate, are comprised of the following (in thousands):\nDecember 31,\n2020 2019\nDeferred tax assets:\nUnited States federal net operating loss carryforwards $ 67,451 $ 85,270\nDeferred expenses 314 3,226\nResearch and development tax credit carryforwards 13,350 19,694\nRight of use asset 2,103 2,696\nStock-based compensation 1,498 2,697\nState net operating loss carryforwards 8,516 13,880\nForeign net operating loss carryforwards 27,589 34,079\nDeferred revenue 27 900\nEquipment, software, and leasehold improvements 1,841 2,922\nIntangibles 7,392 6,216\nOther 1,370 455\nGross deferred tax assets 131,451 172,035\nLess valuation allowance (128,314) (160,783)\nGross deferred tax assets, net of valuation allowance $ 3,137 $ 11,252\nDeferred tax liabilities:\nOther intangible assets $ (158) $ (4,667)\nLease liability (1,579) (2,333)\nUndistributed foreign earnings (937) (909)\nOther (683) (838)\nNet unrealized gains and basis differences on investments - (2,916)\nGross deferred tax liabilities (3,357) (11,663)\nNet deferred tax liabilities (220) (411)\nLess: net deferred tax liabilities - discontinued operations - (96)\nNet deferred tax liabilities - continuing operations $ (220) $ (315)\nAs of December 31, 2020, we maintained a valuation allowance of $128.3 million for our deferred tax assets that we believe are not more likely than not to be realized. The net change in valuation allowance was a $32.5 million decrease and a $23.5 million increase during the years ended December 31, 2020 and 2019, respectively. The net decrease in the valuation allowance since December 31, 2019 of $32.5 million was primarily the result of the disposition of Napster for which the Company maintained a valuation allowance.\nRealNetworks' U.S. federal net operating loss carryforwards totaled $321.2 million and $406.0 million at December 31, 2020 and 2019, respectively. The decrease is mainly due to net operating loss carryforwards from the disposition of Napster, offset by the current year U.S. taxable loss. The remaining net operating loss carryforwards as of December 31, 2020 are from prior U.S. taxable losses and from acquired subsidiaries that are limited under Internal Revenue Code Section 382. These net operating loss carryforwards expire between 2024 and 2037.\nIncome tax receivables were $0.1 million and $1.8 million at December 31, 2020 and 2019.\nRealNetworks' U.S. federal research and development tax credit carryforward totaled $13.4 million and $19.7 million at December 31, 2020 and 2019. The research and development credit carryforwards expire between 2021 and 2040.\nAs of December 31, 2018, the Company no longer intends to indefinitely reinvest substantially all of the Company's foreign earnings outside of the U.S. We have a recorded deferred tax liability of $0.9 million as of December 31, 2020 and 2019 for local country and foreign withholding taxes associated with the repatriation of such foreign earnings.\nAs of December 31, 2020 and 2019, RealNetworks had $0.7 million and $5.0 million in uncertain tax positions, respectively. The decrease in uncertain tax positions is primarily the result of the Napster disposition, for which unrecognized tax positions were removed relating to federal research and development tax credit carryforward risks, as well as transfer pricing risks in certain foreign jurisdictions. The remaining unrecognized tax benefits are due to federal research and\ndevelopment tax credit carryforward risks. We do not anticipate that the total amount of unrecognized tax benefits will significantly change within the next twelve months.\nWe recognize interest and penalties related to unrecognized tax benefits within the provision for income taxes. As of December 31, 2020, we have no accrued interest or penalties related to uncertain tax positions.\nReconciliation of the beginning and ending balances of the total amounts of unrecognized tax benefits (in thousands):\nYears ended December 31,\n2020 2019\nBalance, beginning of year $ 5,020 $ 374\nIncreases related to prior year tax positions 77 4,125\nDecreases related to prior year tax positions (4,564) (85)\nIncreases related to current year tax positions 122 606\nBalance, end of year $ 655 $ 5,020\nNote 14. Loss Per Share\nBasic net income (loss) per share (EPS) is computed by dividing net income (loss) attributable to RealNetworks by the weighted average number of common shares outstanding during the period. Diluted EPS is computed by dividing net income (loss) attributable to RealNetworks by the weighted average number of common and dilutive potential common shares outstanding during the period. Basic and diluted EPS (in thousands, except per share amounts):\nYears ended December 31,\n2020 2019\nNet loss from continuing operations attributable to RealNetworks $ (4,830) $ (15,065)\nNet loss from discontinued operations attributable to RealNetworks (22) (4,936)\nNet loss attributable to RealNetworks $ (4,852) $ (20,001)\nWeighted average common shares outstanding used to compute basic EPS 38,272 37,994\nDilutive effect of stock based awards and Series B Preferred Stock - -\nWeighted average common shares outstanding used to compute diluted EPS 38,272 37,994\nNet loss per share attributable to RealNetworks - Basic:\nContinuing operations $ (0.13) $ (0.40)\nDiscontinued operations - (0.13)\nTotal net loss per share - Basic $ (0.13) $ (0.53)\nNet loss per share attributable to RealNetworks - Diluted:\nContinuing operations $ (0.13) $ (0.40)\nDiscontinued operations - (0.13)\nTotal net loss per share - Diluted $ (0.13) $ (0.53)\nApproximately 6.8 million and 7.7 million shares of potentially issuable shares from stock awards were excluded from the calculation of diluted EPS for the years ended December 31, 2020 and 2019, respectively, because of their antidilutive effect.\nDuring 2020, 8,064,516 shares of Series B preferred stock were issued. The Series B Preferred Stock is convertible into common stock on a one-to-one basis subject to the limitation described in Note 19. Related Party Transactions. During the year ended December 31, 2020, these shares were also excluded from the calculation of diluted EPS because of their antidilutive effect.\nNote 15. Leases\nWe have commitments for future payments related to office facilities leases. We determine if an arrangement is a lease at inception. Operating lease assets and operating lease liabilities are recognized based on the present value of the future minimum lease payments over the lease term at commencement date. As our leases do not provide an implicit rate, we use our estimated incremental borrowing rate based on the information available in determining the present value of future payments. Operating lease assets also exclude lease incentives and initial direct costs incurred. Some of our leases include options to extend or terminate the lease. Our leases generally include one or more options to renew; however, the exercise of lease renewal options is at our sole discretion. For nearly all of our operating leases, upon adoption of the new guidance, we have not assumed any options to extend will be exercised as part of our calculation of the lease liability.\nWe have operating leases for office space and data centers with remaining lease terms of 1 year to 5 years.\nIn 2020, we recorded $1.1 million of lease impairment charges for an office space previously vacated. This charge was recognized in restructuring and other charges on the consolidated statements of operations.\nIn 2020, we entered into an amendment that extended an office lease, resulting in a right-of-use asset obtained in exchange for lease obligations of $0.9 million.\nDetails related to lease expense and supplemental cash flow were as follows (in thousands):\nYear Ended December 31,\n2020 2019\nOperating lease expense $ 4,118 $ 4,360\nVariable lease expense 711 758\nSublease income (1,330) (1,363)\nNet lease expense $ 3,499 $ 3,755\nOperating cash outflows for lease liabilities $ 4,356 $ 4,403\nDetails related to lease term and discount rate were as follows:\nDecember 31,\n2020 December 31,\nWeighted-average remaining lease term (in years) 3 years 4 years\nWeighted-average discount rate 4.95 % 4.66 %\nFuture minimum lease payments as of December 31, 2020 are as follows (in thousands):\nOffice\nLeases\n2021 $ 3,599\n2022 2,899\n2023 2,600\n2024 1,867\n2025 195\nTotal minimum payments (a)\n11,160\nLess: Imputed interest 950\nPresent value of total minimum payments (b)\n$ 10,210\n(a) Total minimum payments exclude executory costs, inclusive of insurance, maintenance, and taxes, of $5.1 million; minimum payments also have not been reduced by sublease rentals of $2.7 million due in the future under subleases.\n(b) $6.8 million is included in Long-term lease liabilities and $3.4 million is included in Accrued and other current liabilities on the consolidated balance sheets.\nNote 16. Commitments and Contingencies\nWe have been in the past and could become in the future subject to legal proceedings, governmental investigations, and claims in the ordinary course of business, including employment claims, contract-related claims, and claims of alleged infringement of third-party patents, trademarks, and other intellectual property rights. Such claims, even if not meritorious, could force us to expend significant financial and managerial resources. In addition, given the broad distribution of some of our consumer products, any individual claim related to those products could give rise to liabilities that may be material to us. In the event of a determination adverse to us, we may incur substantial monetary liability, and/or be required to change our business practices. Either of these could have a material adverse effect on our consolidated financial statements.\nOn April 6, 2020, RealNetworks Asia Pacific Co., Ltd. received notice of a civil lawsuit filed by Korean Music Copyright Association (KOMCA) seeking damages of $2.6 million. Also named as a defendant in the lawsuit is Kakao M Corp (formerly known as LOEN Entertainment Corp.), one of the largest media publishing companies in Korea, which operates the Melon music platform. The claim is for a late payment penalty under a music licensing contract, pursuant to which, from 2004 to 2017, RealNetworks licensed music for its services to LOEN for its Melon platform. The current lawsuit relates solely to the late payment of music licensing fees under the contract; the underlying music licensing fees were paid by Kakao M to KOMCA in a separate settlement prior to KOMCA’s filing of this lawsuit. While we believe we have meritorious defenses to this lawsuit and intend to vigorously defend RealNetworks, litigation is inherently uncertain and we cannot predict the outcome of this matter. We have not recorded an accrual related to this matter as of December 31, 2020 as it is early in the litigation and any potential liability cannot be reasonably estimated.\nNote 17. Guarantees\nIn the ordinary course of business, RealNetworks is subject to potential obligations for standard warranty and indemnification provisions that are contained within many of our customer license and service agreements. Our warranty provisions are consistent with those prevalent in our industry, and we do not have a history of incurring losses on warranties; therefore, we do not maintain accruals for warranty-related obligations. With regard to indemnification provisions, nearly all of our carrier contracts obligate us to indemnify our carrier customers for certain liabilities that may be incurred by them. We have received in the past, and may receive in the future, claims for indemnification from some of our carrier customers.\nNote 18. Segment Information\nWe manage our business and report revenue and operating income (loss) in three segments: (1) Consumer Media, which includes licensing of our codec technology and our PC-based RealPlayer products, including RealPlayer Plus and related products; (2) Mobile Services, which includes our SaaS services, our integrated RealTimes® platform which is sold to mobile carriers and our computer vision platform, SAFR (Secure Accurate Facial Recognition); and (3) Games, which includes all our games-related businesses, including sales of in-game virtual goods, mobile games and games licenses, games subscription services, and in-game advertising and advertising on games sites.\nRealNetworks allocates to its Consumer Media, Mobile Services and Games reportable segments certain corporate expenses which are directly attributable to supporting these businesses, including but not limited to a portion of finance, legal, human resources and headquarters facilities. Remaining expenses, which are not directly attributable to supporting these businesses, are reported as corporate items. These corporate items may also include changes in the fair value of the contingent consideration liability, restructuring charges and stock compensation charges.\nRealNetworks reports the three reportable segments based on factors such as how we manage our operations and how our Chief Operating Decision Maker (CODM) reviews results. The CODM reviews financial information presented on both a consolidated basis and on a business segment basis. The accounting policies used to derive segment results are the same as those described in Note 1. Description of Business and Summary of Significant Accounting Policies.\nSegment results for the years ended December 31, 2020 and 2019 were as follows (in thousands):\nConsumer Media\n2020 2019\nRevenue $ 12,581 $ 13,170\nCost of revenue 2,273 3,031\nGross profit 10,308 10,139\nOperating expenses 8,889 11,186\nOperating income (loss) $ 1,419 $ (1,047)\nMobile Services\n2020 2019\nRevenue $ 26,889 $ 27,143\nCost of revenue 6,725 7,500\nGross profit 20,164 19,643\nOperating expenses 24,787 29,340\nOperating income (loss) $ (4,623) $ (9,697)\nGames\n2020 2019\nRevenue $ 28,592 $ 25,489\nCost of revenue 7,451 6,975\nGross profit 21,141 18,514\nOperating expenses 19,936 20,220\nOperating income (loss) $ 1,205 $ (1,706)\nCorporate\n2020 2019\nCost of revenue $ 16 $ (280)\nOperating expenses 3,009 14,894\nOperating income (loss) $ (3,025) $ (14,614)\nOur customers consist primarily of consumers and corporations located in the U.S., Europe and various foreign countries (Rest of the World). Revenue by geographic region (in thousands):\nYears ended December 31,\n2020 2019\nUnited States $ 43,704 $ 39,724\nEurope 9,375 10,632\nRest of the World 14,983 15,446\nTotal $ 68,062 $ 65,802\nLong-lived assets (consists of equipment, software, leasehold improvements, operating lease assets, and goodwill) by geographic region (in thousands):\nDecember 31,\n2020 2019\nUnited States $ 18,318 $ 20,515\nEurope 7,638 7,221\nRest of the World 1,227 1,790\nTotal long-lived assets $ 27,183 $ 29,526\nNote 19. Related Party Transactions\nThe sale of Napster closed on December 30, 2020. For additional details, see Note 4. Acquisitions and Dispositions.\nIn February 2020, we entered into a Series B Preferred Stock Purchase Agreement with Mr. Glaser, pursuant to which Mr. Glaser invested approximately $10.0 million in RealNetworks in exchange for the issuance to him of 8,064,516 shares of Series B Preferred Stock. The Series B Preferred Stock is non-voting and is convertible into common stock on a one-to-one basis, provided, however, that no conversion is permitted in the event that such conversion would cause Mr. Glaser’s beneficial ownership of our common stock to exceed the 38.5% threshold set forth in our Second Amended and Restated Shareholder Rights Plan dated November 30, 2018. The Series B Preferred Stock has no liquidation preference and no preferred dividend.\nIn July 2020, Mr. Glaser invested $0.7 million into a RealNetworks subsidiary, Scener. Scener is developing a platform that transforms the experience of viewing video entertainment into a social, connected playground. The July 2020 funding was in addition to $0.8 million that Mr. Glaser had previously directly invested in 2019. In August 2020, this same subsidiary entered into agreements and received $1.4 million in funding from outside investors. The 2020 investments were in the form of SAFEs, as described in Note 5. Fair Value Measurements. As of December 31, 2020, RealNetworks owned approximately 82% of the subsidiary's outstanding equity, and we consolidate its financial results into our financial statements. The financial results of the subsidiary are reported in our Consumer Media segment.\nReport of Independent Registered Public Accounting Firm\nStockholders and Board of Directors\nRealNetworks, Inc.\nSeattle, Washington\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheet of RealNetworks, Inc. (the “Company”) as of December 31, 2020, the related consolidated statements of operations, comprehensive loss, shareholders’ equity, and cash flows for the year then ended, and the related notes (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2020, and the results of its operations and its cash flows for the year then ended, in conformity with accounting principles generally accepted in the United States of America.\nWe also have audited the adjustments to the 2019 financial statements to retrospectively apply the accounting for discontinued operations, as described in Note 4. In our opinion, such adjustments are appropriate and have been properly applied. We were not engaged to audit, review, or apply any procedures to the 2019 financial statements of the Company other than with respect to the adjustments and, accordingly, we do not express an opinion or any other form of assurance on the 2019 financial statements taken as a whole.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s consolidated financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (“PCAOB”) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing a separate opinion on the critical audit matters or on the accounts or disclosures to which they relate.\nContingent Consideration Liability\nAs described in Notes 4 and 5 to the consolidated financial statements, the Company acquired a controlling interest in Rhapsody International, Inc. (doing business as Napster) in January 2019, which included contingent consideration as part of the purchase price. The amount of contingent consideration payable is limited to the amount received in selling the acquired interests over five years following the acquisition if the proceeds are less than $15 million. All of the interests in Napster held by the Company, including the acquired interests, were sold in December 2020. In connection with this transaction, the Company estimated the fair value of the contingent consideration liability based on a probability-weighted valuation methodology. Management estimated the fair value of the liability as of December 31, 2020 to be $4.8 million. The fair value of the liability decreased by $8.6 million during the year ended December 31, 2020.\nWe identified the measurement of the fair value of the contingent consideration liability to be a critical audit matter. The principal considerations for our determination were: (i) the evaluation of the purchase agreement terms in relation to contract law; and (ii) the evaluation of the settlement amount probabilities. Auditing these elements involved especially challenging auditor judgment due to the nature and extent of audit effort required to address these matters, including the extent of specialized skill or knowledge in contract law.\nThe primary procedures we performed to address this critical audit matter included:\n•Recalculating the allocation of the proceeds from the sale of Napster to the interests sold, including the acquired interests, to assess the probabilities utilized by management for estimating the fair value of the contingent consideration liability.\n•Utilizing professionals with specialized skills and knowledge in contract law to assist in the interpretation and assessment of the appropriateness of management’s evaluation and assumptions within the terms of the purchase agreement.\nRevenue Recognition - Business-to-Business Software Licensing, Subscription Services, and Product Sales\nAs described in Note 3 to the consolidated financial statements, the Company generates revenue from various sources including software licensing, subscription services, product sales, and advertising. Certain of the Company’s revenue agreements relating to software licensing, subscription services, and product sales with business-to-business customers contain multiple performance obligations and the Company must identify those performance obligations and recognize revenue at a point in time or over time depending on the nature of the performance obligation.\nWe identified the process of the identification of performance obligations and the recognition of revenue for business-to-business software licensing, subscription services, and product sales based on the nature of each performance obligation as a critical audit matter. Auditing these transactions was challenging and complex due to the volume of contracts and unique contract terms requiring significant effort to assess and identify the performance obligations within these agreements which determines the pattern of revenue recognition for each performance obligation.\nThe primary procedures we performed to address this critical audit matter included:\n•Evaluating management’s accounting policies and practices, including the reasonableness of management’s judgments and assumptions related to evaluation of performance obligations and their pattern of revenue recognition.\n•Examining a sample of revenue contracts and other source documents to test management’s identification of significant terms and application of their revenue recognition policy by: (i) identifying each distinct performance obligation and (ii) assessing the determination of the appropriate pattern of revenue recognition for each performance obligation.\n/s/ BDO USA, LLP\nWe have served as the Company’s auditor since 2020.\nSeattle, Washington\nMarch 15, 2021\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and Board of Directors\nRealNetworks, Inc.:\nOpinion on the Consolidated Financial Statements\nWe have audited, before the effects of the adjustments to retrospectively present the disposition of Napster as discontinued operations as described in Note 4, the consolidated balance sheet of RealNetworks, Inc. and subsidiaries (the Company) as of December 31, 2019, the related consolidated statements of operations, comprehensive loss, shareholders’ equity, and cash flows for the year ended December 31, 2019, and the related notes (collectively, the consolidated financial statements). The 2019 consolidated financial statements before the effects of the adjustments described in Note 4 are not presented herein. In our opinion, the consolidated financial statements, before the effects of the adjustments to retrospectively present the disposition of Napster as discontinued operations described in Note 4, present fairly, in all material respects, the financial position of the Company as of December 31, 2019, and the results of its operations and its cash flows for the year ended December 31, 2019, in conformity with U.S. generally accepted accounting principles.\nWe were not engaged to audit, review, or apply any procedures to the adjustments to retrospectively present the disposition of Napster as discontinued operations described in Note 4 and, accordingly, we do not express an opinion or any other form of assurance about whether such adjustments are appropriate and have been properly applied. Those adjustments were audited by other auditors.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the consolidated financial statements, the Company has suffered recurring losses from operations and anticipates negative operating cash flows that raise substantial doubt about its ability to continue as a going concern. Management’s plans in regard to these matters are also described in Note 1. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on these consolidated financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audit included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/s/ KPMG LLP\nWe served as the Company's auditor from 1994 to 2020.\nSeattle, Washington\nMarch 30, 2020",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nAs previously reported on our Form 8-K dated May 26, 2020, we, following an evaluation of audit fees and costs and at the direction of our audit committee, chose not to renew the engagement of KPMG LLP (\"KPMG\"), which was then serving as the company’s independent registered public accounting firm. We notified KPMG on May 26, 2020 that it would be dismissed as our independent registered public accounting firm, effective immediately. The decision to change independent registered public accounting firm was approved by the Audit Committee of the RealNetworks Board of Directors. On May 26, 2020, the audit committee approved the appointment of BDO USA, LLP (\"BDO\") as RealNetworks' new independent registered public accounting firm.",
    "item_9A": "Item 9A. Controls and Procedures\nDisclosure Controls and Procedures\nOur management, with the participation of the principal executive officer and principal financial officer, has evaluated the effectiveness of our “disclosure controls and procedures” (as such term is defined under Rule 13a-15(e) and 15d-15(e) promulgated under the Securities Exchange Act of 1934, as amended (the Exchange Act)). Based on their evaluation, the principal executive officer and principal financial officer concluded that, as of the end of the period covered by this report, our disclosure controls and procedures were effective for the purpose of ensuring that the information required to be disclosed in the reports that we file or submit under the Exchange Act (1) is recorded, processed, summarized, and reported within the time period specified in the Securities and Exchange Commission rules and forms and (2) is accumulated and communicated to our management, including our principal executive and principal financial officers, as appropriate to allow timely decisions regarding required disclosure.\nManagement’s Annual Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f). Under the supervision and with the participation of our management, including our principal executive officer and principal financial officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on our evaluation, our management concluded that, as of December 31, 2020, RealNetworks maintained effective internal control over financial reporting.\nChanges in Internal Control over Financial Reporting\nOur management, with the participation of the principal executive officer and principal financial officer, has evaluated the changes to our internal control over financial reporting that occurred during the fiscal quarter ended December 31, 2020 as required by paragraph (d) of Rules 13a-15 and 15d-15 of the Exchange Act and has concluded that there were no such changes that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.",
    "item_9B": "Item 9B. Other Information\nNot applicable.\nPART III.",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nThe information required by this item is incorporated by reference to the information contained in part in the sections captioned “Proposal 1-Election of Directors,” “Board of Directors,” and “Voting Securities and Principal Holders” of the Proxy Statement relating to RealNetworks’ 2021 Annual Meeting of Shareholders or in an amendment to this 10-K, to be filed with the Securities and Exchange Commission within 120 days after the fiscal year ended December 31, 2020.",
    "item_11": "Item 11. Executive Compensation\nThe information required by this Item is incorporated by reference to the information contained in the section captioned “Executive Compensation” of the Proxy Statement relating to RealNetworks’ 2021 Annual Meeting of Shareholders or in an amendment to this 10-K, to be filed with the Securities and Exchange Commission within 120 days after the fiscal year ended December 31, 2020.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Shareholder Matters\nThe information required by this item is incorporated by reference to the information contained in the section captioned “Voting Securities and Principal Holders” of the Proxy Statement relating to RealNetworks’ 2021 Annual Meeting of Shareholders or in an amendment to this 10-K, to be filed with the Securities and Exchange Commission within 120 days after the fiscal year ended December 31, 2020.\nEquity Compensation Plans\nAs of December 31, 2020, we had awards outstanding under three equity compensation plans. These plans, which have been approved by our shareholders, with the exception of the RealNetworks, Inc. 2020 Inducement Equity Plan (2020 Plan), include the RealNetworks, Inc. 1996 Stock Option Plan, as amended and restated (1996 Plan) and the RealNetworks, Inc. 2005 Stock Incentive Plan, as amended and restated (2005 Plan). In addition, we maintain the RealNetworks, Inc. 2007 Employee Stock Purchase Plan, as amended and restated October 2010 (2007 ESPP).\nAll new equity awards are issued under the 2005 Plan, except for certain qualifying inducement awards that are awarded under the 2020 Plan. In 2007, our shareholders approved the 2007 ESPP.\nThe following table aggregates the data from our plans (in thousands):\nPlan Category Number of Securities\nto be Issued upon\nExercise of\nOutstanding Options,\nWarrants and Rights\n(in 000’s)(a)\nWeighted-average\nExercise Price of\nOutstanding Options,\nWarrants and Rights\n(b)\nNumber of Securities\nRemaining Available\nfor Future Issuance\nunder Equity\nCompensation Plans\n(Excluding Securities\nReflected in Column (a))\n(in 000’s)(c)\nEquity compensation plans approved by security holders 7,167 $ 2.97 2,320 (1)(2)\nEquity compensation plans not approved by security holders 1,135 - 1,365\nTotal 8,302 $ 2.97 3,685 (3)\n(1)On January 1, 2008, the 2007 ESPP became effective; the Company suspended the 2007 ESPP effective January 1, 2020. Column (c) above excludes an aggregate of 0.1 million shares of the Company’s common stock that are authorized for issuance pursuant to the 2007 ESPP.\n(2)Includes shares available for future issuances pursuant to the RealNetworks, Inc. 2007 Director Compensation Stock Plan (2007 Director Plan), a sub-plan that operates and is administered under the 2005 Plan. Under the 2007 Director Plan, outside directors may elect to receive all or a portion of their quarterly director compensation in shares of the Company’s common stock in lieu of cash. Shares issued to directors under the 2007 Director Plan are issued from the shares reserved under the 2005 Plan.\n(3)The total securities in column (a) include 6,499 stock options and 1,803 restricted stock units and awards. The weighted average exercise prices in column (b) relate to the stock options only; restricted stock units and awards have no exercise price.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by this item is incorporated by reference to the information contained in the section captioned “Executive Compensation-Policies and Procedures with Respect to Related Person Transactions” and “Election of Directors-Director Independence” of the Proxy Statement relating to RealNetworks’ 2021 Annual Meeting of Shareholders or in an amendment to this 10-K, to be filed with the Securities and Exchange Commission within 120 days after the fiscal year ended December 31, 2020.",
    "item_14": "Item 14. Principal Accountant Fees and Services\nThe information required by this item is incorporated by reference to the information contained in the section captioned “Proposal 2-Ratification of Appointment of Independent Registered Public Accounting Firm” of the Proxy Statement relating to RealNetworks’ 2021 Annual Meeting of Shareholders or in an amendment to this 10-K, to be filed with the Securities and Exchange Commission within 120 days after the fiscal year ended December 31, 2020.\nPART IV.",
    "item_15": "Item 15. Exhibits and Financial Statement Schedules\n(a)(1) Index to Consolidated Financial Statements\nThe following consolidated financial statements of RealNetworks, Inc. and subsidiaries are filed as part of this report:\nConsolidated Balance Sheets - December 31, 2020 and 2019\nConsolidated Statements of Operations and Comprehensive Loss - Years Ended December 31, 2020 and 2019\nConsolidated Statements of Cash Flows - Years Ended December 31, 2020 and 2019\nConsolidated Statements of Shareholders’ Equity - Years Ended December 31, 2020 and 2019\nNotes to Consolidated Financial Statements\nReports of Independent Registered Public Accounting Firms\n(a)(2) Financial Statement Schedules\nAll financial statement schedules have been omitted since they are either not required, not applicable, or because the information required is included in the consolidated financial statements or the notes thereto.\n(a)(3) Index to Exhibits\nSee Index to Exhibits below.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized, in the City of Seattle, State of Washington, on March 15, 2021.\nREALNETWORKS, INC.\nBY: /s/ ROBERT GLASER\nRobert Glaser\nChairman of the Board and Chief Executive Officer\nPOWER OF ATTORNEY\nEach person whose signature appears below hereby constitutes and appoints Robert Glaser and Michael Parham, and each of them severally, his or her true and lawful attorneys-in-fact and agents, with full power to act without the other and with full power of substitution and resubstitution, to execute in his or her name and on his or her behalf, individually and in each capacity stated below, any and all amendments and supplements to this Report, and any and all other instruments necessary or incidental in connection herewith, and to file the same with the Commission.\nPursuant to the requirements of the Securities Exchange Act of 1934, this Report has been signed below by the following persons on behalf of the Registrant and in the capacities indicated below on March 15, 2021.\nSignature Title\n/s/ ______ROBERT GLASER________\nRobert Glaser\nChairman of the Board and Chief Executive Officer\n(Principal Executive Officer)\n/s/ _______JUDD LEE ___________\nJudd Lee\nChief Financial Officer\n(Principal Financial and Accounting Officer)\n/s/ _______BRUCE A. JAFFE________\nBruce A. Jaffe\nDirector\n/s/ ____CHRISTOPHER R. JONES____\nChristopher R. Jones\nDirector\n/s/ _______DAWN G. LEPORE_______\nDawn G. Lepore\nDirector\n/s/ _______ERIK E. PRUSCH________\nErik E. Prusch\nDirector\n/s/ ______MICHAEL B. SLADE______\nMichael B. Slade\nDirector\n/s/ _______TIM WAN______________\nTim Wan\nDirector\nExhibit Index\nIncorporated by Reference\nExhibit\nNo.\nExhibit Description Form SEC File No. Exhibit Filing Date\n2.1 Transaction, Contribution and Purchase Agreement dated as of February 9, 2010 among Rhapsody America LLC, RealNetworks, Inc., RealNetworks Digital Music of California, Inc., Viacom International Inc. and DMS Holdco Inc.\n8-K 000-23137 2.1 04/06/10\n2.2 Purchase Agreement dated as of January 18, 2019, by and between RealNetworks Digital Music of California, Inc., a California corporation (Buyer) and Rhapsody Applebee, LLC, a Delaware limited liability company (Seller)\n10-Q 001-37745 2.1 05/09/19\n2.3 First Amendment to Purchase Agreement, dated as of June 11, 2019, by and between RealNetworks Digital Music of California, Inc., a California corporation (Buyer) and Rhapsody Applebee, LLC, a Delaware limited liability company (Seller)\n10-Q 001-37745 2.2 08/06/19\n3.1 Amended and Restated Articles of Incorporation\n10-Q 000-23137 3.1 08/11/00\n3.2 Articles of Amendment to the Amended and Restated Articles of Incorporation\n8-K 000-23137 3.1 08/31/11\n3.3 Amended and Restated Bylaws effective July 23, 2010\n8-K 000-23137 3.1 07/29/10\n4.1 Second Amended and Restated Shareholder Rights Plan dated as of November 30, 2018 by and between RealNetworks, Inc. and Computershare Inc., including the form of Certificate of Designation, the form of Rights Certificate, and the Summary of Rights attached thereto as Exhibits A, B, and C, respectively.\n8-K 001-37745 4.1 11/30/18\n4.2 RealNetworks, Inc. Designation of Rights and Preferences of Series B Preferred Stock\n8-K 001-37745 4.1 02/11/20\n10.1 Shareholder Rights Plan Exception Agreement, dated as of April 15, 2016, between RealNetworks, Inc. and Ariel Investments, LLC\n8-K 000-23137 10.1 04/15/16\n10.2 †\nRealNetworks, Inc. 1996 Stock Option Plan, as amended and restated on September 19, 2016\n10-K 001-37745 10.3 02/27/17\n10.3 † Form of Stock Option Agreement under the RealNetworks, Inc. 1996 Stock Option Plan, as amended and restated\n10-Q 000-23137 10.1 11/14/02\n10.4 † RealNetworks, Inc. 2007 Employee Stock Purchase Plan as amended and restated effective October 18, 2010\n10-K 000-23137 10.10 03/16/11\n10.5 † RealNetworks, Inc. 2007 Director Compensation Stock Plan\n10-K 000-23137 10.9 02/29/08\n10.6 †\nRealNetworks, Inc. 2005 Stock Incentive Plan, as amended and restated effective September 19, 2016\n10-K 001-37745 10.13 02/27/17\n10.7 † Form of Non-Qualified Stock Option Terms and Conditions for use under the RealNetworks, Inc. 2005 Stock Incentive Plan, as amended and restated\n10-K 000-23137 10.13 03/18/13\n10.8 † Form of Restricted Stock Units Terms and Conditions for use under the RealNetworks, Inc. 2005 Stock Incentive Plan, as amended and restated\n10-K 000-23137 10.14 03/18/13\n10.9 † Form of Performance Restricted Stock Units Terms and Conditions for use under the RealNetworks, Inc. 2005 Stock Incentive Plan, as amended and restated\n10-K 000-23137 10.15 03/18/13\n10.10 † RealNetworks, Inc. 2020 Inducement Equity Incentive Plan\nS-8 333-249671 4.1 10/26/20\n10.11 † RealNetworks, Inc. 2020 Inducement Equity Incentive Plan - Form of Stock Option Agreement\nS-8 333-249671 4.2 10/26/20\n10.12 † RealNetworks, Inc. 2020 Inducement Equity Incentive Plan - Form of Restricted Stock Unit Agreement\nS-8 333-249671 4.3 10/26/20\n10.13 Office Building Lease dated May 2, 2013 between 1501 First Avenue South Limited Partnership, as landlord, and RealNetworks, Inc., as tenant\n10-Q 000-23137 10.2 08/08/13\nIncorporated by Reference\nExhibit\nNo.\nExhibit Description Form SEC File No. Exhibit Filing Date\n10.14 † Form of Director and Officer Indemnification Agreement\nS-1 333-36553 10.14 09/26/97\n10.15 Voting Agreement dated September 25, 1997 by and among RealNetworks, Robert Glaser, Accel IV L.P., Mitchell Kapor and Bruce Jacobsen\nS-1 333-36553 10.17 09/26/97\n10.16 Agreement dated September 26, 1997 by and between RealNetworks and Robert Glaser\nS-1 333-36553 10.18 09/26/97\n10.17 Series B Preferred Stock Purchase Agreement dated February 10, 2020 by and between RealNetworks, Inc. and Rob Glaser\n8-K 001-37745 10.1 02/11/20\n10.18 † Offer Letter dated July 24, 2014 between RealNetworks, Inc. and Robert Glaser\n10-Q 000-23137 10.2 11/06/14\n10.19 † Offer Letter dated January 7, 2013 between RealNetworks, Inc. and Max Pellegrini\n10-Q 000-23137 10.1 05/08/13\n10.20 † Promotion Letter dated August 24, 2012 between RealNetworks, Inc. and Michael Parham\n10-Q 000-23137 10.3 08/08/13\n10.21 † Offer Letter dated March 29, 2017 between RealNetworks, Inc. and Cary Baker\n10-Q 001-37745 10.1 05/04/17\n10.22 † Employment Agreement date August 17, 2020 between RealNetworks, Inc. and Michael Ensing\n10-Q 001-37745 10.1 11/04/20\n10.23 † Offer Letter dated March 20, 2020 between RealNetworks, Inc. and Judd Lee\n10-Q 001-37745 10.1 08/06/20\n10.24 † Form of Amended and Restated Change in Control and Severance Agreement for Executive Officers\n10-Q 000-23137 10.5 08/09/11\n10.25 † Form of MBO Plan Document under the RealNetworks, Inc. 2019 Executive Compensation Program\n8-K 001-37745 10.1 04/05/19\n10.26 † Form of MBO Plan Document under the RealNetworks, Inc. 2020 Executive Compensation Program\n8-K 001-37745 10.1 06/19/20\n10.27 s Amended and Restated Settlement Agreement dated as of March 10, 2006 between RealNetworks, Inc. and Microsoft Corporation\n10-K 000-23137 10.24 03/16/06\n10.28 s Transaction, Contribution and Purchase Agreement dated as of August 20, 2007 by and among Rhapsody America LLC, RealNetworks, Inc., RealNetworks Digital Music of California, Inc., Viacom International Inc. and DMS Holdco Inc.\n10-Q 000-23137 10.1 11/09/07\n10.29 Amended and Restated Stockholder Agreement dated as of November 30, 2011 among Rhapsody International Inc., RealNetworks, Inc., RealNetworks Digital Music of California, Inc., Viacom International Inc., Napster, LLC, Best Buy Co., Inc. and DMS Holdco Inc.\n10-K 000-23137 10.43 02/29/12\n10.30 Loan and Security Agreement, dated as of August 1, 2019, by and among RealNetworks, Inc., Rhapsody International Inc., RealNetworks Digital Music of California, Inc., and Western Alliance Bank\n10-Q 001-37745 10.1 08/06/19\n10.31 Promissory note dated April 24, 2020\n8-K 001-37745 10.1 04/29/20\n10.32 Support Agreement by and among RealNetworks, Inc., Rhapsody International Inc., and MelodyVR Group PLC, dated August 25, 2020\n8-K 001-37745 10.1 08/27/20\n16.1 Letter from KPMG LLP to the Securities and Exchange Commission dated May 29, 2020\n8-K 001-37745 16.1 05/29/20\n21.1 * Subsidiaries of RealNetworks, Inc.\n23.1 * Consent of BDO USA, LLP\n23.2 * Consent of KPMG LLP\n24.1 * Power of Attorney (included on signature page)\nIncorporated by Reference\nExhibit\nNo.\nExhibit Description Form SEC File No. Exhibit Filing Date\n31.1 * Certification of Robert Glaser, Chief Executive Officer of RealNetworks, Inc., pursuant to Exchange Act Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2 * Certification of Judd Lee, Chief Financial Officer of RealNetworks, Inc., pursuant to Exchange Act Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1 ** Certification of Robert Glaser, Chief Executive Officer of RealNetworks, Inc., pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2 ** Certification of Judd Lee, Chief Financial Officer of RealNetworks, Inc., pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS * XBRL Instance Document\n101.SCH * XBRL Taxonomy Extension Schema Document\n101.CAL * XBRL Taxonomy Extension Calculation Linkbase Document\n101.LAB * XBRL Taxonomy Extension Label Linkbase Document\n101.PRE * XBRL Taxonomy Extension Presentation Linkbase Document\n101.DEF * XBRL Taxonomy Extension Definition Linkbase Document\n† Indicates management contract or compensatory plan.\ns Portions of this exhibit are omitted and were filed separately with the Securities and Exchange Commission pursuant to an application requesting confidential treatment under Rule 24b-2 of the Securities Exchange Act of 1934.\n* Filed herewith.\n** Furnished herewith."
}