{
    "cik": "1054721",
    "company": "BSQUARE CORP /WA",
    "filing_type": "10-K",
    "filing_date": "2021-03-18",
    "period_of_report": "2020-12-31",
    "sic": "7389",
    "state_of_inc": "WA",
    "state_location": "WA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1054721/0001437749-21-006492-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1054721/000143774921006492/bsqr20201002_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1054721/0001437749-21-006492.txt",
    "filename": "1054721_10K_2020_0001437749-21-006492.htm",
    "item_1": "Item 1.\nBusiness.\nOverview\nBsquare is a software and services company that designs, configures, and deploys technologies that solve difficult problems for manufacturers and operators of connected devices. Our customers choose Bsquare to help realize the promise of the Internet of Things (IoT) to transform their businesses. Our products include software that connect devices to create intelligent systems that are cloud-enabled, contribute critical data, and facilitate distributed control and decision making. Our services include 24/7 IoT operations that allow our customers to focus on their businesses while we take care of security, monitoring, and general technology updates. The opportunity to help companies explore and capture the value of IoT is attractive and growing. In the last two years alone, we helped hundreds of companies deploy and manage over two million devices. We operate large IoT systems for our customers with device fleets that range in size and complexity. We believe we offer a unique combination of expertise in device-level solutions, embedded operating systems, and IoT services and software that is valued by a global customer base, from start-ups to Fortune 100 companies, across a diverse set of industries.\nSince our founding in 1994, Bsquare has been at the intersection of hardware and software. Today, that intersection is the “edge” where cloud-enabled devices connect to create intelligent systems, creating new demands for software, deployment, and operations. Bsquare is meeting those demands, making intelligent systems possible. We believe our technology is making people more productive, improving quality of life, and reducing demands on the resources of our planet.\nEmbedded Operating System Software and Services\nCustomers engage us because of our technical expertise in device operating system (“OS”) image development and configuration, device software development and testing, and our experience in embedded and mobile systems design. Our long and successful history as a Microsoft Corporation (“Microsoft”) embedded OS distribution and technology partner is a source of many customer opportunities and a pillar of our reputation in the IoT ecosystem. We believe working with Bsquare engineers can result in shorter development cycles, faster time-to-market, lower overall development costs, and a more robust product. Our software and configuration services are designed to help ensure that our customers’ devices are secure, updateable, and operable as part of a connected IoT system. A decade ago, our customers typically built devices on a single OS. Today, they increasingly have a multi-OS product strategy. Accordingly, we believe that the need for our embedded OS expertise and services is expanding and accelerating. We recognize revenue and cost of sales for this segment of our business under the name “Partner Solutions”.\nEmbedded OS Market\nOur target market for OS software and services includes makers of connected, intelligent devices such as point-of-sale terminals, kiosks, tablets and handheld data collection devices, smart vending machines, ATMs, essential equipment in buildings and facilities environments, digital signs, and in-vehicle telematics and entertainment devices. These devices work on a variety of operating systems, including the most common: Windows IoT, Android, and Linux. They are deployed in various cloud environments, such as Microsoft Azure, Amazon Web Services (“AWS”), or Google Cloud, and are typically connected to a network via a wired or wireless connection. Our customers for these smart devices include world-class original equipment manufacturers (“OEMs”), original design manufacturers (“ODMs”), silicon vendors, and peripheral vendors.\nIoT Software and 24/7 Operations Services\nOur customers’ devices are frequently components of complicated operating networks, creating new requirements for updating, maintaining and evolving the capabilities of devices in the fleet. Once configured and deployed, this device fleet then becomes part of an operational environment that requires long-term attention to the myriad challenges of IoT operations. In short, devices can no longer simply be sold, installed, and then forgotten. These demands have created operational burdens that are challenging to meet through traditional technologies and support models. For that reason, our customers are increasingly relying on Bsquare’s extensive experience developing, deploying, and operating large IoT systems at scale. Our experience using Microsoft Azure and AWS cloud services is an asset we believe to be seldom found inside a customer’s technology team. We believe outsourcing fleet management and 24/7 operations services to Bsquare can result in lower system development costs, greater security, better maintainability, lower operating costs, and improved return on investment (“ROI”) for a customer’s IoT system. We have built and now operate 24/7 mission critical IoT systems for customers of varying size and complexity, and we believe the software and processes we have used to achieve this success may be a sustainable competitive advantage and a potential opportunity for new revenue. We recognize revenue and cost of sales for this segment of our business under the name “Edge to Cloud”.\nIoT Software and Services Market\nOur target market for our IoT software and services includes our OS and software OEM customers as well as companies that purchase from those OEMs and operate their devices as a fleet. This market represents business and industrial segments in a wide range of vertical markets such as retail, point of sale, medical equipment, gaming, buildings and facilities management, manufacturing, robotics, autonomous vehicles, utility management, and transportation. The IoT market continues to evolve as companies understand the possibilities and economics of IoT technology and operations. Increasingly, customers are realizing that IoT operations are not core competencies of their business and that outsourcing operations can lower costs, reduce downtime, and mitigate the reputational risk of security and operational failures.\nBsquare Solutions Suite\nWe provide a suite of software, tools, and services to our customers that are packaged based on technical and business requirements that includes:\nEmbedded OS and System Software Sales and Support\nBsquare resells Windows IoT, Windows Embedded, and Windows Server IoT software as well as system utility software for Adobe and McAfee. We provide license compliance services, technical support, and manufacturing support.\nOS Configuration Services\nWe consult with customers to create a manufacturable image for a specific version of OS software (Windows IoT, Linux, and Android) based on the unique requirements of the hardware and the intended operating environment. Our software and services are designed to help ensure the system is secure, recoverable, maintainable, upgradable, and operable as part of an intelligent system.\nFleet Transition Services\nOur software tools and professional services help transition a collection of devices to a specific OS and software configuration in preparation for management and operations as part of an intelligent system. We work with companies to understand and bring together multiple versions of OS software and hardware, connectivity, security, personnel, operating hours, and other factors that could affect previously deployed equipment.\nIoT Transition\nBsquare offers software utilities and professional services to migrate a fleet of devices to 24/7 IoT operations, allowing individual device and system performance to be managed centrally and integrated into existing business systems.\n24/7 IoT Operations\nOur outsourced IoT operations services include 24/7 infrastructure monitoring, automated issue escalation, incident response and troubleshooting, management protocols, uptime and service level reporting, and cloud instance management.\nData Engineering\nWe offer services to assist customers with the development and implementation of IoT systems and data-driven operations, including machine learning and predictive analytics that allow IoT systems to operate as an intelligent system.\nSoftware Distribution\nWe maintain distribution agreements with multiple third-party software vendors. Our ability to resell these third-party software products, whether as stand-alone products or in conjunction with our own proprietary software and engineering service offerings, provides our customers with a comprehensive solution for their device project needs:\n●\nFor over 20 years, we have been a Microsoft Authorized Distributor of Windows Embedded and IoT operating system software and licenses, including major product families such as Windows 10 IoT Enterprise, Windows Server IoT, and SQL Server IoT. We are also authorized to sell Windows IoT operating systems in Canada, the United States, Argentina, Brazil, Chile, Mexico, Peru, Venezuela, Puerto Rico, Columbia, and several Caribbean countries.\n●\nWe are an authorized distributor for Adobe Flash technologies and Adobe Reader. We have the right to distribute Adobe Flash Lite licenses on a worldwide basis.\n●\nWe are an authorized distributor of McAfee security software in North America.\nThe majority of our revenue continues to be derived from reselling Microsoft Windows Embedded and IoT operating system software to device makers. The sale of Microsoft operating systems has historically accounted for substantially all of our Partner Solutions revenue.\nRelationship with Microsoft\nWe have a long-standing relationship with Microsoft, which is important to the continuing success of our business:\n●\nWe have been one of Microsoft’s distributors of Windows Embedded and IoT operating systems for over 20 years.\n●\nWe have been a distributor of Microsoft Windows Mobile operating systems since November 2009.\n●\nWe are a Gold level Data Analytics partner.\n●\nWe are a Gold level Application Integration partner.\n●\nWe are Silver level Application Development partner.\n●\nMicrosoft has engaged us on various engineering service projects.\n●\nWe work closely with Microsoft executives, developers, product managers and sales personnel. We leverage these relationships in a variety of ways, including:\na.\nWe gain early access to new Microsoft embedded software and other technologies.\nb.\nWe leverage co-marketing resources, content and strategies from Microsoft, including market development funds, to support our own marketing and sales efforts.\nc.\nWe participate in Microsoft-sponsored trade shows, seminars, and other events.\nd.\nWe receive sales leads from Microsoft.\ne.\nWe receive rebates from Microsoft based upon the achievement of predefined sales objectives.\nSee Item 1A, “Risk Factors,” for more information regarding our relationship with Microsoft.\nCompetition\nMicrosoft controls who can distribute its OS software. Microsoft Authorized Distributors that we compete with include Advantech, Inc., Arrow Electronics, Inc., Avnet, Inc., and Dell Computer, Inc. Our competition is not limited to these Microsoft Authorized Distributors. We compete with other consulting firms for services related to device design and development, system software development, and engineering firms that offer similar services.\nCompetition for our IoT software and operating services include:\n●\nLarge, established enterprise software and solution providers such as International Business Machines, Oracle Corporation, SAP SE, and SAS Software, Inc.\n●\nCloud IoT providers such as AWS and Microsoft Azure. Although we are closely partnered with AWS and Microsoft, there are elements of their solutions with which we compete directly.\n●\nMid-sized companies engaged in business transitions similar to our own, including PTC Inc. and TTTech Industrial North America, Inc.\n●\nStartups funded to enter the IoT market, including C3.AI, Inc., Losant IOT Inc., and TeamViewer US, Inc.\nThe market for device software and engineering services is competitive and we face competition from the following:\n●\nOur current and potential customers’ internal engineering and research and development departments, which may seek to provide their own IoT-related services or develop their own software solutions which could compete with our own service offerings and products.\n●\nEngineering service firms, including offshore development companies, such as Adeneo, Symphony Teleca, and Wipro.\n●\nODMs, particularly those in Taiwan and China, with their own software development capabilities.\n●\nContract manufacturers with their own software development capabilities.\nSome of our competitors have greater financial and other resources than we do. They may also focus on only one aspect of our business or offer complementary products that can be integrated with our products. As we develop and bring to market new software and service offerings, we may begin competing with companies with which we have not previously competed. Further, as we expand the geographic markets into which we sell our services and software solutions, or increase our penetration therein, we may expect to increasingly compete with companies with which we have not previously competed. It is also likely that new competitors will enter the market or that our competitors will form alliances, including alliances with AWS or Microsoft, that may enable them to rapidly increase their market share. New competitors may have lower overhead than we do and may be able to undercut our pricing. We expect that competition will increase as other established and emerging companies enter the connected device market, and as new products and technologies are introduced.\nNeither AWS nor Microsoft has agreed to an exclusive arrangement with us, nor has either agreed not to compete against us. AWS may decide to focus on providing products or services that compete directly with our products and services or partner with other solution providers that compete with us. Microsoft may decide to bring in-house more of the core-embedded development services and expertise that we currently provide, possibly resulting in reduced software and service revenue opportunities for us. The barrier to entering the market as a provider of Microsoft-based smart connected systems software and services is relatively low. In addition, Microsoft has created marketing programs to encourage systems integrators to work on Windows operating system software and services, including in the evolving IoT market. These systems integrators may be given substantially the same access by Microsoft to Microsoft technology as we are.\nSales and Marketing\nWe market our products and professional engineering services utilizing a direct sales model. We have sales personnel in the United States and in the United Kingdom. Historically, we have not made significant use of resellers, channel partners, representative agents or other indirect channels. Key elements of our sales and marketing strategy include direct marketing, digital marketing, content marketing, trade shows, event marketing, public relations, analyst relations, social media properties, customer and strategic alliance partner co-marketing programs, and a comprehensive website.\nOur sales and marketing efforts with embedded OS customers will also be beneficial in our efforts to attract customers for our IoT software and services, and vice versa. The two markets we have traditionally served are converging, and our sales and marketing will increasingly reflect that convergence. The cross-selling opportunities between our two primarily markets could be a source of strength as we continue to expand our presence and reputation among the makers of IoT devices and those responsible for IoT device operations.\nInternational Operations\nOur international operations outside of North America are conducted through our offices in Trowbridge, UK. We maintain a European sales and marketing presence through the UK office exclusively in support of our IoT software and services, reported in our Edge to Cloud business segment. The majority of our global technical personnel also work from the UK office. In the first quarter of 2020 we ceased operations in Taipei, Taiwan.\nOur OEM Distribution Agreement with Microsoft for the sale of Microsoft Windows IoT operating systems is currently restricted to North America. As a result, the majority of our revenue continues to be generated from North America. Revenue generated from customers located outside of North America was approximately 14% and 15% of total revenue in 2020 and 2019 respectively.\nHuman Capital\nWe had total headcount of 70 on December 31, 2020, with 38 people located in North America and 32 in the United Kingdom. Of the 70 people currently working at the company, 16 are contractors working less than full time on an as-needed basis, with the other 54 team members comprised of full time or near full-time employees. As compared to December 31, 2019, our headcount was smaller by five, primarily as a result of our efforts throughout 2020 to re-align our organization around a sustainable cost structure.\nIn addition to the personnel cost reductions pursued in 2020, we shifted some professional engineering service employees from traditional consulting engagements to product development activities. As we identify new product opportunities and take new product offerings to market, we may continue to shift engineering personnel to perform research and development activities. We may also occasionally shift personnel back to consulting project work, as needed.\nIn mid-March 2020, in response to local government “stay at home,” “shelter-in-place” and similar orders intended to reduce the spread of the COVID-19 coronavirus, we closed our offices in Trowbridge in the United Kingdom and stopped all non-essential activities in our Bellevue, Washington office. Bsquare’s operations are, at the time of this filing, fully virtual.\nIn January of 2020, we started planning for the end of our Bellevue office lease. We reviewed how and where we work and collaborate, commuting patterns, costs, and our space requirements. With our engineering team in the UK and customers all over the globe, collaborating over long distances and time zones was an operating imperative. We purchased and deployed technologies that enabled and enhanced remote work and had asked our team members to begin to consider how they could begin to work more often from remote locations. This planning work allowed us to move seamlessly to virtual operations when the time came.\nIn June of 2020, in the midst of the pandemic, we moved our corporate headquarters from Bellevue, Washington, to Seattle, Washington. From the outset, we conceived of our new location as a collaboration space and we refer to it as the “Seattle Collaboration Space” or the “SCS”, rather than as a traditional office. While the new facility has remained largely unoccupied, we believe it will serve us well and we look forward to hosting visitors when it is safe again.\nDiversity and Inclusion\nIn 2020, we formed a company-wide Anti-racism Task Force to help us reckon with the ways in which our company and the technology industry at large have contributed to systemic racism in both the US and the UK. In this area, we favor action over performative speech. We are expanding our recruiting outreach to find candidates from communities currently underrepresented in technology companies and are renewing our commitment to inclusive hiring practices. We are particularly interested in building a team composed of people who have made diversity, equity, and inclusion in the workplace a central part of their professional journey. We are also holding our partners accountable to their own actions in pursuit of racial equity, and we are offering every employee a day of Civil Engagement Leave to vote, volunteer in their community, or participate in other civic activities.\nCompensation and Benefits\nWe strive to provide market-competitive compensation and benefits that attract and retain employees who values align with our mission and goals. Our compensation packages include combinations of competitive base pay, sales commissions, performance based short-term incentives, health care, retirement benefits, paid time off and family leave. In addition, we offer employees the benefit of equity ownership in the Company through stock option grants. We also provide access to a variety of health and wellness resources.\nIntellectual Property and Other Proprietary Rights\nWe strive to protect our intellectual property rights primarily through copyright, trademark, and trade secret laws, through contractual arrangements, and occasionally through patent filings. While we cannot be certain that our efforts will be effective to prevent the misappropriation of our intellectual property, or to prevent the development and design by others of products or technologies similar to, or competitive with, those developed by us, we plan to continue to pursue appropriate protections for our intellectual property.\nAdditionally, because a significant portion of our revenue relates to the sale of third-party software products, we also rely on our partners, particularly Microsoft, to appropriately protect their own intellectual property.\nSee Item 1A, “Risk Factors,” for more information regarding our intellectual property and other proprietary rights.\nAvailable Information\nWe were incorporated in the State of Washington in July 1994. Our principal office is located at 1415 Western Ave, Suite 700, Seattle, Washington 98101, and our telephone number is (425) 519-5900. Our website address is www.bsquare.com. Information contained on or that can be accessed through our website is not a part of this Form 10-K.\nOur stock is traded on the NASDAQ Capital Market under the symbol BSQR. Our website may be visited at www.bsquare.com. We electronically file with or furnish to the Securities and Exchange Commission (SEC) our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to those reports pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934. We make available on our website, free of charge, copies of these reports, as soon as reasonably practicable after electronically filing such reports with, or furnishing them to the SEC.",
    "item_1A": "Item 1A.\nRisk Factors.\nAs discussed under Item 1 of Part I, “Business-Cautionary Note Regarding Forward-Looking Statements,” our actual results could differ materially from those expressed in our forward-looking statements. Factors that might cause or contribute to such differences include, but are not limited to, those discussed below. Additional risks and uncertainties not presently known to us, or that we currently deem immaterial but later emerge as material, may also impair our business operations. If any of the following risks occur, our business, financial condition, operating results, cash flows and the trading price of our common stock could be materially adversely affected.\nRisks Related to General Business Conditions\nIf we are not successful in developing and delivering competitive product and services offerings that keep pace with technological changes and needs, or if our products and services fail to gain or maintain traction with potential customers, our business would be negatively impacted.\nThroughout 2020, we continued to update our product strategy to bring to market technologies and related services that build on our history of helping our customers deploy and operate intelligent devices. While we will continue to meet customer commitments previously made, we are developing new products and services that may expand our opportunities in the IoT market. The attractiveness of these new offerings remains uncertain, as does the size of the investment required to bring them to fruition. Our strategy to focus on the IoT market is subject to a number of additional risks and the occurrence of any of them could harm our business:\n•\nThe significant investment of time and financial and other corporate resources required;\n•\nCustomer acceptance of our IoT-related product and service offerings;\n•\nOur ability to cross sell customers;\n•\nThe ROI model for IoT, which has proven to be elusive for many customers, could further delay adoption of IoT solutions by the market;\n•\nBecause IoT services are a relatively new offering, the sales cycle may be longer than we anticipate, and;\n•\nWe may be unable to grow our IoT-related services business rapidly enough to reach profitability in 2021.\nOur marketplace is highly competitive, which may result in price reductions, lower gross profit margins and loss of market share.\nThe competition in the growing market for IoT-related software and engineering services is significant. Further, we anticipate that we will encounter and attract attention from increasing competition from a number of new software and service providers as we continue to focus on this market in 2021 and beyond, and as we expand our IoT-related service offerings. We currently face, or expect to face, competition from the following:\n•\nOur current and potential customers’ internal engineering and research and development departments, which may seek to provide their own IoT services and/or develop their own software solutions which could compete with our IoT-related service offerings and products;\n•\nMicrosoft Windows IoT and Windows Mobile operating system distributors such as Advantech Co, Letc., Arrow Electronics, Inc., Avnet, Inc. and Dell Computer, Inc.; and\n•\nCloud IoT providers such as AWS and Microsoft Azure. Although we are closely partnered with AWS and Microsoft, there are elements of their solutions with which we compete directly;\n•\nMid-sized companies engaged in business transitions similar to our own, including and TTTech Industrial North America, Inc. and PTC Inc.; and\n•\nStartups funded to enter the IoT market, including C3.AI, Inc., Losant IOT, Inc., and TeamViewer US, Inc.\nSome of our competitors have greater financial and other resources than we do. They may also focus on only one aspect of our business or offer complementary products that can be integrated with our products. As we develop and bring to market new software products and service offerings, we may begin competing with companies with which we have not previously competed. Further, as we expand the geographic markets into which we sell our services and related software solutions, or increase our penetration therein, we may expect to increasingly compete with companies with which we have not previously competed. It is also likely that new competitors will enter the market or that our competitors will form alliances, including alliances with AWS or Microsoft, that may enable them to rapidly increase their market share. New competitors may have lower overhead than we do and may be able to undercut our pricing. We expect that competition will increase as other established and emerging companies enter the connected device market, and as new products and technologies are introduced.\nNeither AWS nor Microsoft has agreed to any exclusive arrangement with us, nor has either agreed not to compete with us. AWS may decide to focus on providing products or services that compete directly with our products and services or partnering with other solution providers that compete with us. Microsoft may decide to bring more of the core embedded development services and expertise that we provide in-house, possibly resulting in reduced software and service revenue opportunities for us. The barrier to entering the market as a provider of Microsoft-based smart connected system software and services is relatively low. In addition, Microsoft has created marketing programs to encourage systems integrators to work on Windows IoT and Windows Mobile operating system software and services, including in the evolving IoT market. These systems integrators may be given substantially the same access by Microsoft to Microsoft technology as we are.\nThe unprecedented nature of the COVID-19 pandemic creates uncertainty for Bsquare and our customers, and for the overall global business environment.\nAs the scope and impact of the COVID-19 pandemic continue to evolve, a number of potential risks to our business may emerge and many have already affected our business and our financial results. We may face ongoing challenges selling or delivering our software and services, as our employees and many of those of our customers work from home, are unable to attend company and industry events, and face restrictions on travel and in-person meetings. Closures of manufacturing facilities and warehouses, or staffing shortages, continue to disrupt supply and distribution chains. Our customers could continue to experience a slow-down in demand for their products, decreased budgets, or delayed business initiatives, further reducing the need for our software and services. If our customers’ global supply chains are disrupted because of COVID-19, they may not be able to meet demands for their end-product and they may reduce or eliminate their purchases from Bsquare for an uncertain period of time, if not permanently. Our customers may be slow to collect from their customers or otherwise face liquidity problems, which may cause delays in satisfaction of their financial obligations to us. Some of our customers may be forced to reduce their workforce through layoffs or furloughs, to cease operations temporarily, or, in extreme cases, declare bankruptcy. In those situations, disruptions to our business could range from a loss of key customer relationships to an inability to timely collect potentially significant receivables.\nWe experienced a reduction in sales in our Partner Solutions segment since the second quarter of 2020 which we believe is primarily the result of the pandemic. The adverse effects of the COVID-19 pandemic on our financial results may continue for an unknown period of time. The extent, depth, and duration of the impact of the COVID-19 pandemic on our operational and financial performance will depend on many factors, including the on-going rate of spread of the pandemic, variants of the coronavirus that causes COVID-19, and the speed with which vaccines are manufactured, distributed and delivered. Specifically, our customers’ demand for our products is uncertain and is likely affected by disruptions in their component supply chains, their own sales cycles, their industry verticals, their ability to sell through traditional distribution channels, their ability to convene or attend employee or industry events, or other factors created and made persistent by the uncertain COVID-19 environment. The decline in Partners Solutions revenue experienced in the second, third and fourth quarters of 2020 suggest the effect of these disruptions can be significant. The lingering economic effects of COVID-19, even after resolution of the immediate public health crisis, may result in adverse conditions for our business that may impact our financial condition or results.\nOur operating results may be adversely affected by changing economic and market conditions and the uncertain geopolitical environment.\nUncertain economic and political conditions in the U.S. and worldwide have from time to time contributed, and may in the future contribute, to volatility in the technology industries at large, particularly in an emerging market such as IoT. These factors could potentially result in reduced demand for our products and services as a result of constraints on IT-related capital spending by our customers; purchasing delays; payment delays adversely affecting our cash flow and revenue; and difficulty in accurate budgeting and planning. If global economic and market conditions, or economic conditions in key markets, remain uncertain or deteriorate, we may experience material impacts on our business, operating results and financial condition.\nWe received a PPP loan, which may not be forgivable and may subject us to litigation or public scrutiny that harms our business.\nIn April 2020, we received loan proceeds of $1.6 million under the original Paycheck Protection Program (“PPP”), which provided for loans to qualifying companies. No payments of principal or interest were due during an initial deferral period, and up to 100% of principal and accrued interest is forgivable if we used the PPP loan proceeds for eligible purposes, including payroll, benefits, rent and utilities, and otherwise comply with PPP requirements. We have used the proceeds of the PPP loan for eligible purposes and expect to pursue forgiveness; however, we may have taken or may in the future take action that could inadvertently cause some or all of the PPP loan to become ineligible for forgiveness, which may reduce our liquidity and harm our business, financial condition and results of operations.\nThe rules surrounding the forgiveness of PPP funding are subject to the political and economic climate and could change, altering our obligations for repayment. Furthermore, if the media, watch groups, government officials or others portray us as a business that should not have availed itself of PPP funding, we may face negative publicity that harms our business and operations.\nWe may be subject to product liability, infringement or other legal claims that could result in significant cost and ongoing liabilities.\nOur software license and service agreements with our customers typically contain provisions designed to limit our exposure to potential product liability, infringement and other legal claims. However, it is possible that these provisions may be ineffective under the laws of certain jurisdictions or that our customers may not agree to these limitations. Although we have not experienced any product liability or infringement claims to date, as our business focus continues to transition to the sale of our own proprietary products, the sale and support of our products and services may be subject to such claims in the future. There is a risk that any such claims or liabilities may exceed, or fall outside, the scope of our insurance coverage, and we may be unable to obtain adequate liability insurance in the future. A product liability, infringement or other legal claim brought against us, whether successful or not, could negatively impact our business and operating results.\nOur common stock has experienced and may continue to experience price and volume fluctuations, which could lead to costly litigation for us and make an investment in us less appealing.\nStock markets are subject to significant price and volume fluctuations that may be unrelated to the operating performance of particular companies and the market price of our common stock may therefore frequently change as a result. For example, during the year ended December 31, 2020, the high and low closing prices of our common stock were $1.83 and $0.93 per share, respectively, but in February 2021 our closing price reached $8.40 per share, and we have not had any recent changes in our financial condition or results of operations that is consistent with the recent change in our stock price. In addition, the market price of our common stock has fluctuated and may continue to fluctuate substantially due to a variety of other factors, including quarterly fluctuations in our results of operations (including as a result of fluctuations in our revenue recognition), our ability to execute on our current growth strategy in a timely fashion, announcements about technological innovations or new products or services by us or our competitors, market acceptance of new products and services offered by us, developments in the IoT market, changes in our relationships with our suppliers or customers, our ability to meet analysts’ expectations, changes in the information technology environment, changes in earnings estimates by analysts, sales of our common stock by existing holders and the loss of key personnel. Possible exogenous incidents and trends may also impact capital markets and our own common stock prices, including but not limited to foreign and cross border altercations, political unrest, cyberterrorism on a global scale, and increasingly disruptive weather systems.\nIn the past, following periods of volatility in the market price of a company’s stock, class action securities litigation has often been instituted against such companies. Such litigation, if instituted against us, could result in substantial costs and diversion of management’s attention and resources, which would materially adversely affect our business, financial condition and operating results.\nOur common stock may become the target of a “short squeeze.”\nIn the past several weeks prior to the filing of this Annual Report on Form 10-K, securities of certain companies have increasingly experienced significant and extreme volatility in stock price due to short sellers of shares of common stock and buy-and-hold decisions of longer investors, resulting in what is sometimes described as a “short squeeze.” Short squeezes have caused extreme volatility in those companies and in the market and have led to the price per share of those companies to trade at a significantly inflated rate that is disconnected from the underlying value of the company. Sharp rises in a company’s stock price may force traders in a short position to buy the stock to avoid even greater losses. Many investors who have purchased shares in those companies at an inflated rate face the risk of losing a significant portion of their original investment as the price per share has declined steadily as interest in those stocks have abated. We may be a target of a short squeeze, and investors may lose a significant portion or all of their investment if they purchase our shares at a rate that is significantly disconnected from our underlying value.\nLarge customers with significant resources may resort to litigation to recoup economic loss and other damages caused by what those customers perceive to be a deficiency in our products or a breach in our contractual arrangements.\nWe have a number of larger customers that have entered into longer-term contracts for our products and services. Further, we have actively engaged with those customers in recent months to retool our previously delivered products and to improve our previous agreements. Despite these efforts and investments, new issues may arise, or previous problems may re-occur, causing these customers to choose to initiate litigation against us. While we have no indication that these customers intend to pursue litigation, a decision to do so could cause us to incur significant defense costs, which would be significantly distracting, and may damage our reputation in our markets.\nPrivacy concerns and laws, evolving regulation of cloud computing, cross-border data transfer restrictions and other domestic or foreign regulations may limit the use and adoption of our products and services and adversely affect our business.\nRegulation related to the provision of services on the internet is evolving and increasing, as federal, state and foreign governments continue to adopt new laws and regulations addressing data privacy and the collection, processing, storage and use of personal information, such as the E.U.’s Data Protection Directive and General Data Protection Regulation (“GDPR”) and the California Consumer Privacy Act (“CCPA”). Further, laws and regulations are increasingly aimed at the use of personal information for marketing purposes, such as the E.U.’s ePrivacy Directive and ePrivacy Regulation. Country-specific laws and regulations are subject to new and differing interpretations and may be inconsistent among jurisdictions. Existing laws and regulations, as well as future requirements, could reduce demand for our products and services or restrict our ability to store and process data or, in some cases, impact our ability to offer our products and services in certain locations or our customers' ability to deploy our solutions globally. The costs of compliance with and other burdens imposed by laws, regulations and standards such as GDPR and CCPA may also limit the use and adoption of our products and services, reduce overall demand for our products and services, lead to significant fines, penalties or liabilities for noncompliance, or slow the pace at which we close sales transactions, any of which could harm our business. Furthermore, concerns regarding data privacy may cause our customers’ customers to resist providing the data necessary to allow our customers to use our products and services effectively. Even the perception that the privacy of personal information is not satisfactorily protected or does not meet regulatory requirements could inhibit sales of our products and services and could limit adoption of our cloud-based solutions.\nChanging growth strategies, negative business conditions, changes in useful lives, and other factors may negatively affect the carrying value of the intangible assets and goodwill we have acquired.\nWe evaluate goodwill and intangible assets for impairment on an annual basis or more frequently when an event occurs, or circumstances change that indicate that the carrying value may not be recoverable. Business conditions and other factors may require us to reassess the useful lives associated with intangible assets. Reductions in operating cash flows or projected cash flows of our reporting units could result in an impairment charge that would negatively impact our operating results.\nIt might be difficult for a third party to acquire us even if doing so would be beneficial to our shareholders.\nCertain provisions of our articles of incorporation, bylaws and Washington law may discourage, delay or prevent a change in the control of us or a change in our management, even if doing so would be beneficial to our shareholders. Our Board of Directors has the authority under our articles of incorporation to issue preferred stock with rights superior to the rights of the holders of common stock. As a result, preferred stock could be issued quickly and easily with terms calculated to delay or prevent a change in control of our company or make removal of our management more difficult. In addition, our Board of Directors is divided into three classes. The directors in each class serve for three-year terms, one class being elected each year by our shareholders. This system of electing and removing directors may discourage a third party from making a tender offer or otherwise attempting to obtain control of our company because it generally makes it more difficult for shareholders to replace a majority of our directors. In addition, Chapter 19 of the Washington Business Corporation Act generally prohibits a “target corporation” from engaging in certain significant business transactions with a defined “acquiring person” for a period of five years after the acquisition, unless the transaction or acquisition of shares is approved by a majority of the members of the target corporation’s Board of Directors prior to the time of acquisition. This provision may have the effect of delaying, deterring or preventing a change in control of our company. The existence of these anti-takeover provisions could also limit the price that investors might be willing to pay in the future for shares of our common stock.\nRisks Related to Our Business Operations\nInvestments in new products and services may not deliver the returns that were anticipated when the development process was initiated, which will have a detrimental effect on our financial results.\nAs we bring new products and services to market, the acquisition rate, amount, and profitability of the revenue produced by these new offerings will be highly uncertain. Customers may not choose to adopt our technologies or may choose to adopt them more slowly than expected. The investment models that caused us to initiate product development efforts may have contained faulty assumptions about customer adoption rates and/or pricing. As a result, we may be required to sustain losses from product development for a longer period than expected, which could harm our financial results and diminish our ability to make additional investments in new products or in improving our existing set of products and services.\nExpected operating efficiencies from our restructuring plans may not be realized as anticipated.\nThroughout 2019 and 2020, we continued our efforts to reduce unnecessary or excessive costs, with particular emphasis on personnel costs, in order to better align our organizational structure with our strategic focus. Factors which may affect the potential operating efficiencies we realize from our restructuring plans include the adverse impact of job eliminations, uncertainties associated with loss of customer and vendor confidence, potential negative impact on sales and customer service as well as factors outside of our control such as changes in the economic environment. We may not realize the anticipated benefits under our restructuring plans, which could result in additional restructuring efforts. If our restructuring plans are not successful, our business and results of operations may be negatively impacted.\nThe efforts to improve our cost structure and business outlook could result in the departure of key personnel or in costly employment-related litigation. Such outcomes would adversely affect our business and financial results.\nAfter right-sizing the organization throughout 2019 and 2020, we now operate with single and primary points of function and expertise for some positions. These ongoing changes, combined with the tight labor market for technology employees, could cause the sudden departure of key individuals, which could in turn have a detrimental effect on our ability to innovate rapidly and serve our customers. Further, because the market for technology employment remains highly competitive, filling key vacancies may extend these negative effects. Further, employees who have had or who may have in the future their employment relationship terminated, or who are simply disgruntled with the direction of the company’s strategy may decide to pursue litigation against us or may choose to disparage us in social media. These activities could damage our reputation, divert our attention from operating our business, and otherwise cause our business to suffer.\nOur international operations expose us to greater intellectual property, management, collections, regulatory and other risks.\nCustomers outside of North America generated 14% and 15% of our total revenue in 2020 and 2019, respectively. We currently have sizable operations outside of North America and in the United Kingdom (“U.K.”). Our international activities and operations expose us to a number of risks, including the following:\n•\nGreater difficulty in protecting intellectual property due to less stringent foreign intellectual property laws and enforcement policies;\n•\nLonger collection cycles than we typically experience in North America;\n•\nUnfavorable changes in regulatory practices and tariffs;\n•\nCompliance with complex regulatory regimes or restrictions on import and export of our goods and services;\n•\nComplex and/or adverse tax laws and/or changes thereto. Additionally, we may be subject to income, withholding and other taxes for which we may realize no current benefit despite the existence of significant net operating loss and tax credit carryforwards in the U.S.;\n•\nLoss or reduction of withholding tax exemptions;\n•\nThe impact of fluctuating exchange rates between the U.S. dollar and foreign currencies;\n•\nGeneral economic and political conditions in international markets which may differ from those in the U.S.;\n•\nIncreased exposure to potential liability under the Foreign Corrupt Practices Act;\n•\nAdded cost and administrative burden associated with creating and operating business structures in other jurisdictions;\n•\nPotential labor costs and risks associated with employees and labor laws in other geographies; and\n•\nThe inherent risks of working in a certain highly regulated and/or controlled economies where relationships between company management and government officials is critical to timely processing of approvals required to conduct business.\n•\nOn January 31, 2020, the U.K. exited the E.U., commonly referred to as “Brexit”. As the long-term implications of Brexit become clear, it is possible that there will be greater restrictions on imports and exports between the U.K. and E.U. countries and increased regulatory complexities, which could adversely impact our operations and business in both the U.K. and the E.U.\nThese risks could have a material adverse effect on the financial and managerial resources required to operate our foreign offices, as well as on our future international revenue, which could negatively impact our business and operating results.\nAs our customers seek more cost-effective locations to develop and manufacture their products, particularly overseas locations, our ability to continue to sell our software products and services to these customers could be adversely affected, which could negatively impact our revenue and operating results.\nDue to competitive and other pressures, some of our customers have moved, and others may seek to move, the development and manufacturing of their smart, connected systems to overseas locations, which may limit our ability to sell our software and services to these customers. As an example, under our current arrangements with Microsoft, we are currently only able to sell Microsoft Windows IoT operating systems to our customers in the United States, Canada, the Caribbean (excluding Cuba), Mexico, and the European Free Trade Association. If our customers, or potential customers, move their manufacturing overseas to locations in which our business may be limited, we may be less able to remain competitive, which could negatively impact our revenue and operating results.\nPast acquisitions have proven difficult to integrate, and future acquisitions, if any, could disrupt our business, dilute shareholder value and negatively affect our operating results and may not accrete to our revenue or other operating results or to our business generally.\nWe have acquired the technologies, assets and/or operations of other companies in the past and may acquire or make investments in companies, products, services and technologies in the future as part of our growth strategy. If we fail to properly evaluate, integrate and execute on our acquisitions and investments, our business and prospects may be seriously harmed. In addition, acquisitions may not be as accretive to our revenue or other operating results as expected. To successfully complete an acquisition, we must properly evaluate the business, technology, market and management team of the acquisition target, accurately forecast the financial impact of the transaction, including accounting charges and transaction expenses, integrate and retain personnel, combine potentially different corporate cultures and effectively integrate products, research and development, sales, marketing and support operations. If we fail to do any of these, we may suffer losses and impair relationships with our employees, customers and strategic partners. Additionally, acquisition activities may distract management from day-to-day operations. We also may be unable to maintain consistently uniform standards, controls, procedures and policies across our entire business as a result, and significant additional demands may be placed on our management and our operations, information services and financial, legal and marketing resources. Finally, acquired businesses may result in unexpected liabilities and contingencies, which may involve compliance with foreign laws, payment of taxes, labor negotiations or other unknown costs and expenses, which could be significant.\nWe could become subject to taxation in jurisdictions in which we do not believe we currently have tax nexus, which could expose us to additional tax liability that we have not been subject to in the past.\nWe sell in many jurisdictions across the United States. We believe we do not have nexus in most of these jurisdictions and, therefore, we believe we are not subject to sales, franchise, income and other state and local taxes in such jurisdictions. However, if we are determined to have tax nexus in other jurisdictions (as a result of more aggressive interpretations of nexus by taxing jurisdictions or otherwise) and we are unable to pass through this cost to our customers, our tax expense will increase which will negatively affect our results of operations. Further, because state and local tax laws are becoming increasingly complex, we anticipate that our cost to monitor our state and local tax compliance will increase which will negatively affect our results of operations. Additionally, we may have unknown tax exposure in a state or local tax jurisdiction because of recent tax law changes of which we are unaware, and the resulting liability could be significant and would negatively affect our results of operations.\nChanges in our effective tax rate may impact our results of operations.\nWe are subject to taxes in the U.S. and other jurisdictions. Tax rates in these jurisdictions may be subject to significant change due to economic and/or political conditions. A number of other factors may also impact our future effective tax rate including:\n•\nthe jurisdictions in which profits are determined to be earned and taxed;\n•\nthe resolution of issues arising from tax audits with various tax authorities;\n•\nchanges in valuation of our deferred tax assets and liabilities;\n•\nincreases in expenses not deductible for tax purposes, including write-offs of acquired intangibles and impairment of goodwill in connection with acquisitions;\n•\nchanges in availability of tax credits, tax holidays, and tax deductions;\n•\nchanges in share-based compensation; and\n•\nchanges in tax laws or the interpretation of such tax laws and changes in generally accepted accounting principles.\nThere may be restrictions on the use of our net operating loss and tax credit carryforwards due to a tax law “ownership change.”\nWe did not generate taxable income in 2020 or 2019 and, as a result, we were unable to use our net operating loss and tax credit carryforwards with respect to such tax years. In addition, Sections 382 and 383 of the Internal Revenue Code restrict the ability of a corporation that undergoes an ownership change to use net operating loss and tax credit carryforwards. We have performed analyses of possible ownership changes which included consideration of a third-party study, and do not believe that an ownership change, as defined by Section 382, has occurred. However, if a tax law ownership change has occurred of which we are not aware, or if a tax law ownership change occurs in the future, we may have to adjust the valuation of our deferred tax assets and could be at risk of having to pay income taxes notwithstanding the existence of our sizable carryforwards. Further, to the extent that we have utilized our carryforwards from prior years, the existence of a previous tax law ownership change that we did not account for could result in liability for back taxes, interest, and penalties. If we are unable to utilize our carryforwards and/or if we previously utilized carryforwards to which we were not entitled, it would negatively impact our business, financial condition and operating results.\nRisks Related to Technology and Intellectual Property\nOur software or hardware products or the third-party hardware or software integrated with our products or delivered as part of our service offerings may suffer from defects or errors that could impair our ability to sell our products and services.\nSoftware and hardware components as complex as those needed for dedicated purpose intelligent systems frequently contain errors or defects, especially when first introduced or when new versions are released. We have had to delay commercial release of certain versions of our products until problems were corrected and, in some cases, have provided product enhancements to correct errors in released products. Some of our contracts require us to repair or replace products that fail to work. To the extent that we repair or replace products, our expenses may increase. In addition, it is possible that by the time defects are repaired, the market opportunity may decline which may result in lost revenue.\nMoreover, to the extent that we provide increasingly complex and comprehensive products and services, particularly those focused on IoT hardware, and rely on third-party manufacturers and suppliers to manufacture these products, we will be dependent on the ability of such third-party manufacturers and suppliers to correct, identify and prevent manufacturing errors or defects. Errors or defects that are discovered after commercial release could result in loss of revenue or delay in market acceptance, diversion of development resources, damage to our reputation and increased service and warranty costs, all of which could negatively impact our business and operating results.\nOur business and operations would be adversely impacted in the event of a failure or interruption of our IT infrastructure.\nThe proper functioning of our IT infrastructure is critical to the efficient operation and management of our business. Despite ongoing mitigation efforts, our infrastructure may be vulnerable to cyberattacks, cyberterrorism, computer viruses, worms and other malicious software programs, physical and electronic break-ins, sabotage and similar disruptions from unauthorized tampering with our computer systems. We believe that we have adopted appropriate measures to mitigate potential risks to our technology infrastructure and our operations from these IT-related and other potential disruptions. However, given the unpredictability of the timing, nature and scope of such disruptions, we could potentially be subject to downtime, operational delays, other detrimental impacts on our operations or ability to provide products and services to our customers, the compromising of confidential or personal information, destruction or corruption of data, security breaches, other manipulation or improper use of our systems and networks, financial losses from remedial actions, loss of business or potential liability, and/or damage to our reputation, any of which could have a material adverse effect on our cash flows, competitive position, financial condition or results of operations.\nInterruptions or delays in services from third-party data center hosting facilities or cloud computing platform providers could impair the delivery and availability of our products and services and harm our business.\nWe currently serve certain customers through third-party data center hosting facilities and cloud computing platform providers located in the United States and other countries. Any damage to, or failure of, these systems generally could result in interruptions in the availability of our products and services. We have from time to time experienced, and may continue to experience, such interruptions, which could cause us to issue credits or pay penalties, cause customers to terminate their subscriptions, and adversely affect our customer attrition rates and our ability to attract new customers, all of which would reduce our revenue. Our business would also be harmed if our customers and potential customers believe our product and services offerings are unreliable. Despite contract provisions to protect us, customers may look to us to support and provide warranties for these third-party systems, which may expose us to potential claims, liabilities and obligations for technology or services we did not develop or sell, all of which could harm our business. Further, third-party software and cloud platforms that we currently or may in the future utilize may not continue to be available at reasonable prices, on commercially reasonable terms, or may become unavailable. Any of these outcomes could significantly increase our expenses and result in delays in the provisioning of our products and services until we are able to procure alternative solutions, either by developing equivalent technology or, if available, obtaining such technology through purchase or license from other third parties.\nWe do not control the operation or security of any of these hosting facilities or cloud computing platforms, and they may be vulnerable to damage or interruption from earthquakes, floods, fires, power loss, telecommunications failures and similar events. They may also be subject to break-ins, sabotage, intentional acts of vandalism and similar misconduct, as well as local administrative actions, changes to legal or permitting requirements and litigation to stop, limit or delay operation. Despite precautions taken by providers of these facilities and platforms, the occurrence of a natural disaster or an act of terrorism, a decision to close the facilities or platforms without adequate notice or other unanticipated problems at these facilities or platforms could result in lengthy interruptions in or cessation of our services.\nBreaches in data security or incidents of cybercrime could damage our customers’ business and our reputation, which may harm our ability to gain new customers or cause our existing customer to look to our competitors for products and services.\nOur products and services involve the storage and transmission of customers’ proprietary data and personal information and security breaches could result in a risk of loss of this data or information, litigation and possible liability. While we have security measures in place, they may be breached as a result of third-party action, including intentional misconduct by computer hackers, employee error, malfeasance or otherwise and result in someone obtaining unauthorized access to our IT systems, our customers’ data or our data, including our intellectual property and other confidential business information. Additionally, third parties may attempt to fraudulently induce employees or customers into disclosing sensitive personal information such as usernames, passwords or other information in order to gain access to our customers’ data, our data or our IT systems. Because the techniques used to obtain unauthorized access, or to sabotage systems, change frequently and generally are not recognized until launched against a target, we may be unable to anticipate these techniques or to implement adequate preventative measures. In addition, our customers may authorize third-party technology providers to access their customer data, and some of our customers may not have adequate security measures in place to protect their data. Because we do not control the IT security of our customers or third-party technology providers, or of the processing of such data by third-party technology providers, we cannot ensure the integrity or security of such transmissions or processing. Malicious third parties may also conduct attacks designed to temporarily deny customers access to our products and services. Any security breach could result in a loss of confidence in the security of our products and services, damage our reputation, negatively impact our future sales, disrupt our business and lead to legal liability.\nOur software and service offerings could infringe the intellectual property rights of third parties, which could expose us to additional costs and litigation and could adversely affect our ability to sell our products and services or cause shipment delays or stoppages.\nIt is difficult to determine whether our software products and engineering services infringe third-party intellectual property rights, particularly in a rapidly evolving technological environment in which technologies often overlap and where there may be numerous patent applications pending, many of which are confidential when filed. If we were to discover that one of our software products or service offerings, or a product based on one of our reference designs, violated a third party’s proprietary rights, we may not be able to obtain a license on commercially reasonable terms, or at all, to continue offering that product or service. Similarly, third parties may claim that our software products and services infringe their proprietary rights, regardless of whether such claims have merit. Any such claims could increase our costs and negatively impact our business and operating results. In certain cases, we have been unable to obtain indemnification against claims that third-party technology incorporated into our software products and services infringe the proprietary rights of others. However, any indemnification we do obtain may be limited in scope or amount. Even if we receive broad third-party indemnification, these entities may not have the financial capability to indemnify us in the event of infringement.\nIn addition, in some circumstances we are required to indemnify our customers for claims made against them that are based on our software products or services. We may face claims of infringement or invalidity related to the software products and services we provide or arising from the incorporation by us of third-party technology and claims for indemnification from our customers resulting from such claims. Some of our competitors have, or are affiliated with companies with, substantially greater resources than we have, and these competitors may be able to sustain the costs of complex intellectual property litigation to a greater degree and for longer periods of time than we could. In addition, we expect that software developers will be increasingly subject to infringement claims as the number of products and competitors in the software industry grows, and as the functionality of products in different industry segments increasingly overlap. Such claims, even if not meritorious, could result in the expenditure of significant financial and managerial resources in addition to potential product redevelopment costs and delays. Furthermore, if we were unsuccessful in resolving a patent or other intellectual property infringement action claim against us, we may be prohibited from developing or commercializing certain of our technologies and products, or delivering services based on the infringing technology, unless we obtain a license from the holder of the patent or other intellectual property rights. We may not be able to obtain any such license on commercially favorable terms, or at all. If such license were not obtained, we would be required to cease these related business operations, which could negatively impact our business, revenue and operating results.\nIf we are unable to license key software from third parties, our business could be harmed.\nWe sometimes integrate third-party software with our proprietary software and engineering service offerings or sell such third-party software offerings on a standalone basis, such as we do with Microsoft Windows IoT and Mobile operating systems under our OEM Distributor Agreements (“ODAs”) with Microsoft. If our relationships with these third-party software vendors were to deteriorate, or be eliminated in their entirety, we might be unable to obtain licenses on commercially reasonable terms, if at all. In the event that we are unable to obtain these third-party software offerings, we would be unable to continue to generate revenue from our reseller relationships or, with respect to our proprietary software and engineering services offerings, we would be required to develop this technology internally, assuming it was economically or technically feasible, or seek similar software offerings from other third parties assuming there were competing offerings in the marketplace, which could delay or limit our ability to introduce enhancements or new products, or to continue to sell existing products and engineering services, thereby negatively impacting our revenue and operating results.\nIf we fail to adequately protect our intellectual property rights, competitors may be able to use our technology which could weaken our competitive position, reduce our revenue and increase our costs.\nWe rely primarily on confidentiality policies and procedures and contractual provisions as well as a combination of patent, copyright, trade secret and trademark laws, to protect our intellectual property. These laws, policies and procedures provide only limited protection. It is possible that another party could obtain patents that block our use of some, or all, of our software products and services. If that occurred, we would need to obtain a license from the patent holder or design around those patents. The patent holder may or may not choose to make a license available to us on acceptable terms, or at all. Similarly, it may not be possible to design around a blocking patent. Our efforts to protect our intellectual property rights through patent, copyright, trade secret and trademark laws may not be effective to prevent misappropriation of our technology, or to prevent the development and design by others of products or technologies similar to or competitive with those developed by us.\nWe license our computer source code to customers. Customers with access to our source code may not comply with the license terms. We may not discover any violations of the license terms and, in the event of discovery of violations, we may not be able to successfully enforce the license terms or recover the economic value lost from such violations. To license some of our software products, we rely in part on “shrink-wrap” and “click wrap” licenses that are not signed by the end user and, therefore, may be unenforceable under the laws of certain jurisdictions. As with other software, our software products are susceptible to unauthorized copying and uses that may go undetected, and policing such unauthorized use is difficult.\nA significant portion of our marks include the word “BSQUARE.” Other companies use forms of “BSQUARE” in their marks alone, or in combination with other words, and we cannot prevent all such third-party uses. We license certain trademark rights to third parties. Such licensees may not abide by our compliance and quality control guidelines with respect to such trademark rights. Any of these outcomes could negatively impact our brand, dilute its recognition in the marketplace, or confuse potential customers, all of which could harm our business.\nThe computer software market is characterized by frequent and substantial intellectual property litigation, which is often complex and expensive, and involves a significant diversion of resources and uncertainty of outcome. Litigation may be necessary in the future to enforce our intellectual property or to defend against a claim of infringement or invalidity. Litigation could result in substantial costs and the diversion of resources and could negatively impact our business and operating results.\nRisks Related to Our Partnership with Microsoft\nWe provide software and services to customers building devices utilizing Microsoft’s Windows IoT and Windows Mobile operating systems and a significant portion of our revenue is derived from the sale of Microsoft Windows IoT and Windows Mobile operating systems. As a result, Microsoft has a significant direct and indirect influence on our business. The following Microsoft-related risks may negatively impact our business and operating results.\nIf we do not maintain our distribution relationship with Microsoft as currently structured, our revenue would decrease, and our business would be adversely affected.\nWe have entered into ODAs with Microsoft pursuant to which we are licensed to sell Microsoft Windows Mobile operating systems to customers in North America, South America, Central America (excluding Cuba), Japan, Taiwan, Europe, the Middle East, and Africa. The ODAs to sell Windows Mobile operating systems are effective through April 30, 2022. If any of our other ODAs are terminated by Microsoft (which Microsoft can do unilaterally) or not renewed, Partner Solutions revenue and resulting gross profit could decrease significantly and our operating results would be negatively impacted. Future renewals by Microsoft, if any, could be on less favorable terms, which could also negatively impact our business and operating results.\nWe currently recognize revenue from the sale of Microsoft software generally upon shipment of physical software licenses. If Microsoft were to change the method of providing software licenses to a digital rather than physical medium, our revenue recognition policies may need to change, and that change in policy could result in a significant decrease in revenue. While such a change is not expected, and would not immediately impact our cash flows, the full financial scope of the impact is uncertain and potentially significantly negative.\nMicrosoft can change its product pricing at any time, and unless we are able to pass through price increases to our customers, our revenue, gross profit and operating results would be negatively impacted.\nFurther, Microsoft currently offers a rebate program in conjunction with our resale activities in which we earn money for achieving certain predefined objectives. If Microsoft changes the way that rebates are earned by eliminating or negatively modifying the rebate program, our gross profit and operating results would be adversely impacted. In the second quarter of 2020, Microsoft changed the way a portion of its earned rebate may be claimed. While the change enacted in 2020 resulted in a net increase in rebates provided to us by Microsoft, future changes could have the opposite effect. If we are unable to meet the new rebate criteria, should the criteria be modified, we may not be able to sustain the financial benefits of the rebate program and our operating results could be harmed.\nOur business and results of operations could be negatively impacted by changes Microsoft implements in its pricing of its operating systems.\nMicrosoft has historically implemented significant pricing changes for its operating systems products and Microsoft could make further pricing changes in the future. These changes have altered the competitive dynamics because the same pricing discounts are available to all distributors of these Microsoft products. As a distributor of Microsoft products, this may impact both the sales prices we charge our customers and the cost of goods sold that we incur for many of the Microsoft products we sell. Microsoft has indicated that a new version of an operating system product we frequently sell to customers will be released in the near future. While Microsoft has not indicated the pricing of this new product version, any significant declines in the market price for the product will reduce our revenue and may reduce our gross profits. The amount and impact of the change, and other pricing changes, on our revenue and gross profit are currently not determinable; however, they may negatively impact our operating results in future reporting periods.\nMicrosoft offers certain consumer Windows phone and tablet-based operating systems to customers free of charge, subject to certain limitations. While we do not distribute these operating systems today under our ODAs with Microsoft, if Microsoft were to offer, free of charge, operating systems that we do distribute, our business and results of operations would be adversely impacted.\nIn recent years, the markets for Windows IoT and Windows Mobile operating systems have declined; if the markets for these operating systems continue to decline or decline more rapidly than anticipated, our business and operating results would be materially harmed.\nA significant portion of our revenue to date has been generated by software and services targeted at customers and devices running various Microsoft Windows IoT and Windows Mobile operating systems. In recent years, the markets for these systems have declined. If the markets for these operating systems continue to decline or decline more rapidly than anticipated, our business and operating results would be negatively impacted. Continued market acceptance of Microsoft Windows IoT and Windows Mobile operating systems will depend on many factors, including:\n•\nMicrosoft’s development and support of various Windows IoT and Windows Mobile markets. As the developer and primary promoter of Windows IoT and Windows Mobile operating systems, if Microsoft were to decide to discontinue or lessen its support of these operating systems, potential customers could select competing operating systems, which could reduce the demand for our Microsoft Windows IoT and Windows Mobile software products and engineering services, from which a significant portion of our revenue continues to be generated;\n•\nThe ability of the Microsoft Windows IoT and Windows Mobile operating systems to compete against existing and emerging operating systems for the smart connected systems market, including iOS from Apple, Inc.; VxWorks and Linux from WindRiver Systems Inc.; Android from Google Inc.; QNX from BlackBerry Limited; and other proprietary operating systems. Microsoft Windows IoT and Windows Mobile operating systems may be unsuccessful in capturing or retaining a significant share of the smart connected systems market in the future;\n•\nThe acceptance by customers of the mix of features and functions offered by Microsoft Windows IoT and Windows Mobile operating systems; and\nThe willingness of software developers to continue to develop and expand the applications running on Microsoft Windows IoT and Windows Mobile operating systems is uncertain. To the extent that software developers write applications for competing operating systems that are more attractive to users than those available on Microsoft Windows IoT and Windows Mobile operating systems, this could cause potential customers to select competing operating systems and our revenue could decline.\nMicrosoft has audited our records under the ODAs in the past and may audit our records again in the future, and any negative audit results could result in additional charges and/or the termination of our distributor relationship with Microsoft.\nThere are provisions in the ODAs that require us to maintain certain internal records and processes for auditing purposes. Non-compliance with these or other contractual requirements could result in the termination of our distributor relationship with Microsoft. Microsoft conducted previous audits of our records pertaining to the ODAs, none of which had material findings. It is possible that future audits could result in charges due to any material findings that are found. We may also be contractually liable for payment of royalties to Microsoft in the event that certificates of authenticity are lost, damaged or stolen.",
    "item_1B": "Item 1B.\nUnresolved Staff Comments.\nNone.",
    "item_2": "Item 2.\nProperties.\nDuring the second quarter of 2020, we completed a move of our corporate headquarters from the prior location in Bellevue, Washington to a 6,780 square-foot facility in downtown Seattle, Washington. As of December 31, 2020, we have consolidated almost all of our operations into that single location, with the one exception of a small shipping and receiving location remaining in Bellevue. The lease term on the new Seattle facility ends in July 2027.\nWe also lease 8,217 square feet of office space in Trowbridge, England, U.K. for use by the team of engineers and sales and marketing personnel operating from that location. In the fourth quarter of 2020, we renewed the lease for that facility for a 10-year term with substantially same terms as the now-terminated lease. We have an option to cancel the second half of the lease term (5 years).\nIn the fourth quarter of 2019, we made the decision to close our office in Taipei, Taiwan and fully executed that decision in the first quarter of 2020. We have no employees or facilities remaining in Taiwan.\nWe believe that our facilities meet our current operational needs now and in the near-term future.",
    "item_3": "Item 3.\nLegal Proceedings.\nNone.",
    "item_4": "Item 4.\nMine Safety Disclosures.\nNot applicable.\nPART II",
    "item_5": "Item 5.\nMarket for Registrant’s Common Equity Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nOur common stock is traded on The NASDAQ Stock Market, LLC under the symbol “BSQR.”\nHolders\nAs of February 28, 2021, there were 112 holders of record of our common stock. Because many shares of our common stock are held by brokers and other institutions on behalf of shareholders, we are unable to determine the total number of shareholders represented by these holders of record.",
    "item_6": "Item 6.\nSelected Financial Data.\nNot applicable.",
    "item_7": "Item 7.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations.\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations should be read in conjunction with our consolidated financial statements and related notes. This Management’s Discussion and Analysis of Financial Condition and Results of Operations may contain some statements and information that are not historical facts but are forward-looking statements. For a discussion of these forward-looking statements, and of important factors that could cause results to differ materially from the forward-looking statements contained in this report, see Item 1 of Part I, “Business-Cautionary Note Regarding Forward-Looking Statements,” and Item 1A of Part I, “Risk Factors.”\nOverview\nBsquare is a software and services company that designs, configures, and deploys technologies that solve difficult problems for manufacturers and operators of connected devices. Our customers choose Bsquare to help realize the promise of IoT to transform their businesses. Our products include software that connect devices to create intelligent systems that are cloud-enabled, contribute critical data, and facilitate distributed control and decision making. Our services include 24/7 IoT operations that allow our customers to focus on their businesses while we take care of security, monitoring, and general technology updates. The opportunity to help companies explore and capture the value of IoT is attractive and growing. In the last two years alone, we helped hundreds of companies deploy and manage over two million devices. We operate large IoT systems for our customers with device fleets that range in size and complexity. We believe we offer a unique combination of expertise in device-level solutions, embedded operating systems, and IoT services and software that is valued by a global customer base, from start-ups to Fortune 100 companies, across a diverse set of industries.\nIn 2020, we continued our initiatives commenced in 2019 to reposition our business. We believe the additional focus we placed on serving our customers contributed to the financial and operating results of 2020.\nRevenue and Customers\nThe COVID-19 pandemic interrupted our customer ordering patterns, causing a significant disruption to our Partner Solutions business in 2020. After an exceptionally strong revenue in the first quarter, we saw a significant decrease in Partner Solution revenue in the second quarter. Partner Solutions revenue improved and stabilized in the third and fourth quarters, but at levels lower than our pre-COVID-19 expectations. We suspect our Partner Solutions revenue also decreased because competing Microsoft distributors offered deep discounts on Windows IoT OS software as part of hardware / software bundles. We expect this will continue in 2021. We are working aggressively to retain our large customers and attract new customers with superior service and technical support, pricing that rewards loyalty, and a path to IoT operations.\nInvestments made to ensure we were meeting our operating commitments, while re-tooling and addressing issues with software previously delivered to some of our larger IoT customers, started to pay off in 2020. We expanded our relationship with Itron, Inc. (“Itron”) and our work helping them build their intelligent utility grid. We anticipate investments in our other large IoT customers will continue in 2021, but at lower levels than in 2020 as the bulk of the rework is now complete. Beyond gaining credibility as a reliable technology partner, we believe the experience we have gained serving Itron and our other large IoT customers positions us to improve our IoT software and services in 2021 and beyond.\nExpenses and Operating Results\nDespite the disruption of COVID-19, we had one of our strongest years in recent history. 2020 operating loss and net loss improved dramatically over 2019, by $7.5 million and $7.3 million respectively. These strong results became possible through prior efforts to enter 2020 with an expense structure that made sense for our business and an entrepreneurial leadership team that acted on changing business circumstances and opportunities as they emerged. We believe this operating discipline demonstrates our ability to manage through adversity.\nCash and Liquidity\nOur cash and cash equivalents increased by $2.4 million during 2020. Our access to loan proceeds from the $1.6 million PPP loan supported our efforts to maintain our engineering staffing levels and pursue new opportunities created by our unique expertise. Our current cash balance and lack of debt service obligations (other than any unforgiven portions of our PPP loan principal) have provided sufficient liquidity for the business.\nCritical Accounting Judgments\nRevenue recognition\nWe recognize revenue when control of the promised goods or services is transferred to our customers, in an amount that reflects the consideration that we expect to receive in exchange for those goods or services. We generate all of our revenue from contracts with customers.\nEmbedded operating system software\nWe sell embedded operating system software licenses based upon a customer purchase order, shipping a certificate of authenticity (“COA”) to satisfy this single performance obligation. These shipments are also subject to limited return rights; historically, returns have been insignificant. We recognize revenue from third-party products at the time of shipment when the customer accepts control of the COA.\nProprietary software\nWe sell our proprietary software products to customers under a contract or by purchase order. Our Edge to Cloud software contracts generally include professional services, a perpetual or term license and support and maintenance. In contracts with multiple performance obligations, we identify each performance obligation and evaluate whether the performance obligations are distinct within the context of the contract at contract inception. Performance obligations that are not distinct at contract inception are combined. Contracts that include software customization may result in the combination of the customization services with the software license as one distinct performance obligation. We allocate the transaction price to each distinct performance obligation based on the estimated standalone selling price for each performance obligation. We then look to how control of the software transfers to the customer in order to determine the timing of revenue recognition. In contracts that include customer acceptance, we recognize revenue when we have delivered the software and received customer acceptance. We recognize revenue from support and maintenance over the service delivery period. We recognize revenue from royalties in the period of usage.\nOur software products generally do not include customization or modification services and are sold in the form of term licenses. These software licenses represent one distinct performance obligation. Revenue is recognized when the software is delivered to the customer.\nProfessional services\nWe enter into contracts for professional services, including for our IoT-related service offerings, that include software development and customization. We identify each performance obligation in our professional services contracts at contract inception. The contracts generally include project deliverables specified by each customer. The contract pricing is either at stated billing rates per service hour and material costs or at a fixed amount. Services provided under professional engineering contracts generally result in the transfer of control of the applicable deliverable over time. We recognize revenue on service contracts based on time and materials as we have the right to invoice. We recognize revenue on fixed fee contracts on the proportion of labor hours expended to the total hours expected to complete the contract performance obligation. Certain professional service contracts include substantive customer acceptance provisions, in which case we recognize revenue upon customer acceptance.\nThe determination of the total labor hours expected to complete the performance obligations on fixed fee contracts involves significant judgment. We incorporate revisions to hour and cost estimates when the causal facts become known. In certain situations, when it is impractical for us to reasonably measure the outcome of a performance obligation, and where we anticipate that we will not incur a loss, an adjusted cost-based input method is used for revenue recognition. Equal amounts of revenue and cost are recognized during the contract period, and profit is recognized when the project is completed and accepted.\nLeases\nWe lease office facilities, primarily under operating leases, which expire at various dates through 2027. These leases generally contain renewal options for a defined number of years at the then-fair market rental rate or rate stipulated in the lease agreement, which we have an option to exercise at the end of the initial lease term.\nWe determine if an arrangement is a lease at inception. On our balance sheet, our office facility leases are included in Right-of-Use (“ROU”) assets and related lease liabilities are included in the Operating leases and Operating leases, long-term statement line items. ROU assets represent our right to use the underlying assets for the lease term and operating lease liabilities represent our obligation to make lease payments arising from the lease agreements. Operating lease ROU assets and liabilities are recognized at the lease commencement date based on the present value of lease payments over the term of the lease. For leases that do not provide an implicit rate, we use an incremental borrowing rate based on information available at the commencement date to determine the present value of lease payments. We will use the implicit rate in the lease when readily determinable. The Company accounts for its lease expense with free rent periods and step-rent provisions on a straight-line basis over the original term of the lease and any extension options that the Company more likely than not expects to exercise, from the date the Company has control of the property. Certain leases provide for periodic rental increases based on price indices. Lease expense for lease payments is recognized on a straight-line basis over the lease term.\nIntangible assets\nWe evaluate our intangible assets for indications of impairment whenever events or changes in circumstances indicate that the carrying value may not be recoverable. Our intangible assets consist of customer relationships arising from business acquisitions. We periodically assess the value of our intangible assets. Factors that could trigger an impairment analysis include significant under-performance relative to historical or projected future operating results, significant changes in the manner of our use of the acquired assets or the strategy for our overall business or significant negative industry or economic trends. If this evaluation indicates that the value of the intangible asset may be impaired, we assess the likelihood of recoverability of the net carrying value of the asset over its remaining useful life. If this assessment indicates that the intangible asset is not recoverable, based on the estimated undiscounted future cash flows of the technology over the remaining useful life, we reduce the net carrying value of the related intangible asset to fair value.\nTaxes\nAs part of the process of preparing our consolidated financial statements, we are required to estimate income taxes in each of the countries and other jurisdictions in which we operate. This process involves estimating our current tax expense together with assessing temporary differences resulting from the differing treatment of items for tax and accounting purposes. These differences result in deferred tax assets and liabilities. Net operating losses and tax credits, to the extent not already utilized to offset taxable income or income taxes, also give rise to deferred tax assets. We must then assess the likelihood that any deferred tax assets will be realized from future taxable income, and, to the extent we believe that recovery is not likely, we must establish a valuation allowance. We are required to use judgment as to the appropriate weighting of all available evidence when assessing the need for the establishment or the release of valuation allowances. As part of this analysis, we examine all available evidence on a jurisdiction-by-jurisdiction basis and weigh the positive and negative information when determining the need for full or partial valuation allowances. The evidence considered for each jurisdiction includes, among other items, (i) the historical levels of income or loss over a range of time periods that extends beyond the two years presented, (ii) the historical sources of income and losses, (iii) the expectations and risk associated with underlying estimates of future taxable income, (iv) the expectations and risk associated with new product offerings and uncertainties with the timing of future taxable income, and (v) prudent and feasible tax planning strategies. Significant judgment is required in determining our provision for income taxes, deferred tax assets and liabilities and any valuation allowance recorded against our deferred tax assets. We estimate the valuation allowance related to our deferred tax assets on a quarterly basis.\nOur sales may be subject to other taxes, particularly withholding taxes, due to our sales to customers in countries other than the United States. The tax regulations governing withholding taxes are complex, causing us to have to make assumptions about the appropriate tax treatment. Further, we make sales in many jurisdictions across the United States, where tax regulations are varied and complex. We must therefore continue to analyze our state tax exposure and determine what the appropriate tax treatments are, and make estimates for sales, franchise, income and other state taxes.\nResults of Operations\nThe following table presents our summarized results of operations for the periods indicated. Our historical operating results are not necessarily indicative of the results for any future period.\nYear Ended December 31,\n(In thousands, except percentages)\n$ Change\n% Change\nRevenue\n$ 47,144\n$ 59,283\n$ (12,139 )\n(20 )%\nCost of revenue\n39,418\n49,187\n(9,769 )\n(20 )%\nGross profit\n7,726\n10,096\n(2,370 )\n(23 )%\nOperating expenses\n9,580\n19,410\n(9,830 )\n(51 )%\nLoss from operations\n(1,854 )\n(9,314 )\n7,460\n(80 )%\nOther income, net\n(35 )\n(184 )\n(123 )%\nLoss before income taxes\n(1,889 )\n(9,165 )\n7,276\n(79 )%\nIncome tax expense\n-\n(16 )\n(100 )%\nNet loss\n$ (1,889 )\n$ (9,181 )\n$ 7,292\n(79 )%\nRevenue\nWe generate revenue from the sale of software, both embedded operating system software that we resell and our own proprietary software, and related professional services. Total revenue decreased in 2020 compared to 2019, due to decreased sales in our Partner Solutions segment, primarily in North America and Asia, as well as decreased revenue in our Edge to Cloud segment.\nAdditional revenue details were as follows:\nYear Ended December 31,\n(In thousands, except percentages)\n$ Change\n% Change\nRevenue:\nPartner Solutions\n$ 42,257\n$ 50,628\n$ (8,371 )\n(17 )%\nEdge to Cloud\n4,887\n8,655\n(3,768 )\n(44 )%\nTotal revenue\n$ 47,144\n$ 59,283\n$ (12,139 )\n(20 )%\nAs a percentage of total revenue:\nPartner Solutions\n%\n%\nEdge to Cloud\n%\n%\nPartner Solutions revenue\nPartner solutions revenue decreased $8.4 million and 17% in 2020 compared to 2019,We believe customer demand for embedded operating systems was adversely impacted by the economic downturn and related uncertainty stemming from the global COVID-19 pandemic. We have some customer concentration in industries particularly impacted by COVID-19, such as casino gaming, hospitality, and point-of-sale systems.\nEdge to Cloud revenue\nEdge to Cloud revenue decreased $3.8 million and 44% in 2020 compared to 2019, due primarily to professional services revenue earned in 2019 that was not repeated in 2020. We expect Edge to Cloud revenue will continue to vary in timing and amounts.\nGross profit and gross margin\nCost of Partner Solutions revenue consists primarily of the cost of embedded operating system software product costs payable to third-party vendors, net of rebate credits earned through Microsoft's distributor incentive program. Cost of Edge to Cloud revenue consists primarily of salaries and benefits, contractor costs and re-billable expenses, and amortization of certain intangible assets related to acquisitions.\nGross profit and gross margin were as follows:\nYear Ended December 31,\n(In thousands, except percentages)\n$ Change\n% Change (1)\nPartner Solutions gross profit\n$ 7,086\n$ 7,430\n$ (344 )\n(5 )%\nPartner Solutions gross margin\n%\n%\n-\n%\nEdge to Cloud gross profit\n$\n$ 2,666\n$ (2,026 )\n(76 )%\nEdge to Cloud gross margin\n%\n%\n-\n(18 )%\nTotal gross profit\n$ 7,726\n$ 10,096\n$ (2,370 )\n(23 )%\nTotal gross margin\n%\n%\n-\n(1 )%\n(1) For gross margin, amounts represent percentage point change.\nPartner Solutions gross profit declined in 2020 compared to 2019 primarily as a result of lower third-party software sales. Partner Solutions gross margin was favorably impacted by rebate credits earned through Microsoft’s distributor incentives program. In accordance with program rules, we allocate a portion of the incentive earnings to reduce cost of revenue with the remaining portion utilized to offset qualified marketing expenses in the period the expenditures are claimed and approved. During 2019, 20% was allocated to offset cost of revenue and the remaining 80% was potentially available to offset qualified marketing expenses. During the second quarter of 2020 the program allocation was changed by Microsoft to a 50/50 split between the two components. In 2020, we recorded approximately $757,000 in rebate credits as an offset to cost of revenue compared to approximately $314,000 in 2019.\nPartner Solutions gross margin was also favorably impacted by a small amount of revenue for which only the margin is recognized as revenue given our role as agent in the transaction.\nEdge to Cloud gross profit and gross margin decreased in 2020 compared to 2019, primarily due to decreased sales of software and services in 2020 compared to 2019 and lower margin project work.\nOperating expenses\nOperating expenses were as follows:\nYear Ended December 31,\n(In thousands, except percentages)\n$ Change\n% Change\nOperating expenses:\nSelling, general and administrative\n$ 9,314\n$ 11,316\n$ (2,002 )\n(18 )%\nResearch and development\n5,751\n(5,485 )\n(95 )%\nRestructuring costs\n-\n2,343\n(2,343 )\n- %\nTotal operating expenses\n$ 9,580\n$ 19,410\n$ (9,830 )\n%\nAs a percentage of total revenue:\nSelling, general and administrative\n%\n%\nResearch and development\n%\n%\nRestructuring costs\n- %\n%\nSelling, general and administrative\nSelling, general and administrative (“SG&A”) expenses consist primarily of salaries and related benefits, commissions and bonuses for our sales, marketing and administrative personnel and related facilities and depreciation costs, as well as professional services fees (such as consulting, legal, audit and tax). SG&A expenses decreased in 2020 compared to 2019 due to lower salaries and related benefits resulting from prior period restructuring efforts, and from lower professional services fees and contract labor. These reductions were partially offset by increased stock-based compensation expense.\nResearch and development\nResearch and development (“R&D”) expenses consist primarily of salaries and benefits for software development and quality assurance personnel, and contractor and consultant costs. R&D expenses decreased in 2020 compared to 2019, primarily due to lower salaries and related benefits resulting from restructuring efforts in prior periods, including the elimination of R&D positions.\nRestructuring costs\nRestructuring costs incurred during 2019 include $1.9 million in severance and benefits related to a workforce reduction plan announced by management in the second quarter of 2019 and a non-cash impairment charge in the second quarter of 2019 of $0.4 million related to certain software development cost assets. There were no restructuring costs incurred during 2020.\nOther income (loss), net\nOther income and loss consist primarily of interest income on our cash and investments, gains and losses we may recognize on our investments, gains and losses on foreign exchange transactions and other items. The decrease in 2020 compared to 2019 was primarily due to lower total interest earned on our cash and investments and foreign exchange rate fluctuations.\nIncome taxes\nIncome tax expense for 2020 and 2019 related to state and local income taxes.\nLiquidity and Capital Resources\nAs of December 31, 2020, we had $13.0 million of cash, cash equivalents and investments (including $0.3 million in restricted cash), compared to $10.6 million at December 31, 2019, reflecting a net increase of approximately $2.4 million in cash, cash equivalents and investments. We generally invest our excess cash in high quality marketable investments. These investments generally include corporate notes and bonds, commercial paper and money market funds, although specific holdings can vary from period to period depending upon our cash requirements. Our investments held at December 31, 2019 had minimal default risk and short-term maturities. There were no investments held at December 31, 2020.\nOperating activities provided cash of approximately $1.1 million in 2020, which included a net loss of $1.9 million, partially offset by non-cash adjustments of $1.4 million and a change in working capital of approximately $1.5 million. Operating activities used cash of approximately $6.0 million in 2019, which included a net loss of approximately $9.2 million, partially offset by non-cash adjustments of approximately $1.8 million and a change in working capital of approximately $1.4 million.\nInvesting activities provided cash of approximately $2.0 million in 2020, primarily due to net cash inflows on short-term investments of $2.3 million, partially offset by capital expenditures of $0.3 million. Investing activities provided cash of approximately $3.9 million in 2019, primarily due to net cash inflows on short-term investments of $4.3 million, partially offset by capital expenditures of $0.4 million.\nFinancing activities provided $1.6 million of cash in 2020 due to proceeds from the PPP Loan. There was no cash provided by financing activities in 2019.\nWe believe that our existing cash, cash equivalents and investments will be sufficient to meet our needs for working capital and capital expenditures for at least the next 12 months.\nContractual commitments\nFuture operating lease commitments were as follows as of December 31, 2020 (in thousands):\nAs of December 31, 2020, maturities of lease liabilities were as follows:\nOperating leases\nYears Ended December 31,\n$\n$\n$\n$\n$\nThereafter\n$\nTotal minimum lease payments\n2,310\nLess: amount representing interest\n(336 )\nPresent value of lease liabilities\n$ 1,974\nRecently Issued Accounting Standards\nSee Note 1, “Summary of Significant Accounting Policies” in the Notes to Consolidated Financial Statements in Item 8.",
    "item_7A": "Item 7A.\nQuantitative and Qualitative Disclosures About Market Risk.\nNot applicable.",
    "item_8": "Item 8.\nFinancial Statements and Supplementary Data.\nBSQUARE CORPORATION\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of December 31, 2020 and 2019\nConsolidated Statements of Operations and Comprehensive Loss for 2020 and 2019\nConsolidated Statements of Shareholders’ Equity for 2020 and 2019\nConsolidated Statements of Cash Flows for 2020 and 2019\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and the Board of Directors of\nBsquare Corporation\nOpinion on the Financial Statements\nWe have audited the consolidated balance sheets of Bsquare Corporation (the “Company”) as of December 31, 2020 and 2019, the related consolidated statements of operations and comprehensive loss, shareholders’ equity, and cash flows for the years then ended, and the related notes (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the consolidated financial position of the Company as of December 31, 2020 and 2019, and the consolidated results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (“PCAOB”) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures to respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nEdge to Cloud Revenue Recognition\nAs described in Notes 1 and 2 to the consolidated financial statements, the Edge to Cloud revenue stream comprises multiple performance obligations, and generally include professional services, a perpetual or term license and support and maintenance. Due to the multiple element nature of the Company’s contracts, appropriate revenue recognition requires the Company to exercise significant judgment in the following areas:\n●\nDetermination of whether products and services are considered distinct performance obligations that should be accounted for separately versus together, such as software licenses and related services.\n●\nDetermination of stand-alone selling prices for each distinct performance obligation and for products and services that are not sold separately.\n●\nThe pattern of delivery (i.e., timing of when revenue is recognized) for each distinct performance obligation.\n●\nIdentification and treatment of contract terms that may impact the timing and amount of revenue recognized (e.g., variable consideration, optional purchases, and free services).\nGiven these factors, the related audit effort in evaluating management's judgments in determining revenue recognition for these customer agreements was extensive and required a high degree of auditor judgment. These were the principal considerations that led us to determine that the matter was a critical audit matter.\nThe primary procedures we performed to address this critical audit matter included:\n●\nWe evaluated management's significant accounting policies related to these customer agreements for reasonableness.\n●\nWe selected a sample of customer agreements and performed the following substantive audit procedures:\no\nObtained and read contract source documents for each selection, including master agreements, and other documents that were part of the agreement.\no\nAnalyzed the contract to determine if arrangement terms that may have an impact on revenue recognition were identified and properly considered in the evaluation of the accounting for the contract.\no\nTested management's identification of distinct performance obligations by evaluating whether the underlying software licenses and services were highly interdependent and interrelated.\no\nEvaluated the total transaction price determined by management based on the terms of the contract, including any variable consideration, and recalculated the allocation of the total transaction price to each distinct performance obligation based on respective standalone selling prices.\n●\nWe evaluated the reasonableness of management's methodology and assumptions in determining estimates of stand-alone selling prices for products and services that are not sold separately.\n●\nWe tested the mathematical accuracy of management's calculations of recognized revenue and the associated timing of revenue recognized in the consolidated financial statements.\n/s/ Moss Adams LLP\nSeattle, Washington\nMarch 18, 2021\nWe have served as the Company’s auditor since 2006.\nBSQUARE CORPORATION\nCONSOLIDATED BALANCE SHEETS\n(In thousands, except share amounts)\nDecember 31,\nASSETS\nCurrent assets:\nCash and cash equivalents\n$ 12,623\n$ 7,712\nRestricted cash\nShort-term investments\n-\n2,249\nAccounts receivable, net of allowance for doubtful accounts of $50 at December 31, 2020 and $31 at December 31, 2019\n6,177\n9,216\nPrepaid expenses and other current assets\nContract assets\nTotal current assets\n20,002\n20,515\nEquipment, furniture and leasehold improvements, net\nDeferred tax assets\nIntangible assets, net\nRight-of-use lease assets, net\n1,853\n1,828\nOther non-current assets including contract assets\nTotal assets\n$ 22,282\n$ 23,055\nLIABILITIES AND SHAREHOLDERS' EQUITY\nCurrent liabilities:\nThird-party software fees payable\n$ 6,458\n$ 7,224\nAccounts payable\nPaycheck Protection Program loan\n-\nAccrued compensation\n1,001\nOther accrued expenses\nDeferred revenue, current portion\n2,165\n1,559\nOperating leases\nTotal current liabilities\n11,339\n11,200\nDeferred revenue\nOperating leases, long-term\n1,630\n1,256\nPaycheck Protection Program loan, long-term\n-\nShareholders' equity:\nPreferred stock, no par: 10,000,000 shares authorized; no shares issued and outstanding\n-\n-\nCommon stock, no par: 37,500,000 shares authorized; 13,235,038 issued and outstanding at December 31, 2020 and 13,042,293 issued and outstanding at December 31, 2019\n139,726\n138,877\nAccumulated other comprehensive loss\n(992 )\n(987 )\nAccumulated deficit\n(130,083 )\n(128,194 )\nTotal shareholders' equity\n8,651\n9,696\nTotal liabilities and shareholders' equity\n$ 22,282\n$ 23,055\nSee notes to consolidated financial statements.\nBSQUARE CORPORATION\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE LOSS\n(In thousands, except per share amounts)\nYear Ended December 31,\nRevenue:\nPartner Solutions\n$ 42,257\n$ 50,628\nEdge to Cloud\n4,887\n8,655\nTotal revenue\n47,144\n59,283\nCost of revenue:\nPartner Solutions\n35,171\n43,198\nEdge to Cloud\n4,247\n5,989\nTotal cost of revenue\n39,418\n49,187\nGross profit\n7,726\n10,096\nOperating expenses:\nSelling, general and administrative\n9,314\n11,316\nResearch and development\n5,751\nRestructuring costs\n-\n2,343\nTotal operating expenses\n9,580\n19,410\nLoss from operations\n(1,854 )\n(9,314 )\nOther income, net\n(35 )\nLoss before income taxes\n(1,889 )\n(9,165 )\nIncome tax expense\n-\n(16 )\nNet loss\n$ (1,889 )\n$ (9,181 )\nBasic loss per share\n$ (0.14 )\n$ (0.71 )\nDiluted loss per share\n$ (0.14 )\n$ (0.71 )\nShares used in per share calculations:\nBasic\n13,139\n12,896\nDiluted\n13,139\n12,896\nComprehensive loss:\nNet loss\n$ (1,889 )\n$ (9,181 )\nOther comprehensive loss:\nForeign currency translation, net of tax\n(12 )\n(63 )\nUnrealized gain on investments, net of tax\nTotal other comprehensive loss\n(5 )\n(61 )\nComprehensive loss\n$ (1,894 )\n$ (9,242 )\nSee notes to consolidated financial statements.\nBSQUARE CORPORATION\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS’ EQUITY\n(In thousands, except share amounts)\nAccumulated\nOther\nTotal\nPreferred Stock\nCommon Stock\nComprehensive\nAccumulated\nShareholders'\nShares\nAmount\nShares\nAmount\nIncome (Loss)\nDeficit\nEquity\nBalance as of December 31, 2018\n-\n-\n12,777,573\n138,280\n(926 )\n(119,013 )\n$ 18,341\nExercise of stock options\n-\n-\n264,720\n-\n-\n-\n-\nShare-based compensation, including issuance of restricted stock\n-\n-\n-\n-\n-\nShares of restricted stock withheld for taxes\n-\n-\n-\n(24 )\n-\n-\n(24 )\nNet loss\n-\n-\n-\n-\n-\n(9,181 )\n(9,181 )\nForeign currency translation adjustment, net of tax\n-\n-\n-\n(63 )\n-\nUnrealized gain on investments, net of tax\n-\n-\n-\n-\n-\nBalance as of December 31, 2019\n-\n-\n13,042,293\n138,877\n(987 )\n(128,194 )\n9,696\nExercise of stock options\n-\n-\n192,745\n(1 )\n-\n-\n(1 )\nShare-based compensation, including issuance of restricted stock\n-\n-\n-\n-\n-\nShares of restricted stock withheld for taxes\n-\n-\n-\n-\n-\n-\n-\nNet loss\n-\n-\n-\n-\n-\n(1,889 )\n(1,889 )\nForeign currency translation adjustment, net of tax\n-\n-\n-\n(12 )\n-\nUnrealized gain on investments, net of tax\n-\n-\n-\n-\n-\nBalance as of December 31, 2020\n-\n-\n13,235,038\n$ 139,726\n$ (992 )\n$ (130,083 )\n$ 8,651\nSee notes to consolidated financial statements.\nBSQUARE CORPORATION\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In thousands)\nYear Ended December 31,\nCash flows from operating activities:\nNet loss\n$ (1,889 )\n$ (9,181 )\nAdjustments to reconcile net loss to net cash from operating activities:\nDepreciation and amortization\nShare-based compensation\nSoftware development costs impairment\n-\nChanges in operating assets and liabilities:\nAccounts receivable, net\n3,038\n2,365\nPrepaid expenses and other assets\n(6 )\nContract assets\n(189 )\nThird-party software fees payable\n(766 )\n(396 )\nAccounts payable and accrued expenses\n(293 )\n(1,132 )\nOperating leases\n(9 )\nDeferred revenue\n(269 )\n(227 )\nDeferred rent\n-\n(497 )\nNet cash provided (used by) operating activities\n1,062\n(5,995 )\nCash flows from investing activities:\nPurchases of equipment and furniture\n(274 )\n(418 )\nProceeds from maturities of short-term investments\n2,250\n12,390\nPurchases of short-term investments\n-\n(8,114 )\nNet cash provided by investing activities\n1,976\n3,858\nCash flows from financing activities:\nProceeds from PPP note payable\n1,584\n-\nProceeds from exercise of stock options\n(1 )\n-\nNet cash provided by financing activities\n1,583\n-\nEffect of exchange rates on cash\n(82 )\nNet increase (decrease) in cash, restricted cash, and cash equivalents\n4,648\n(2,219 )\nCash, restricted cash, and cash equivalents, beginning of year\n8,312\n10,531\nCash, restricted cash, and cash equivalents, end of year\n$ 12,960\n$ 8,312\nSupplemental cash flow information:\nCash (refund of) paid for income taxes\n(3 )\n(7 )\nSee notes to consolidated financial statements.\nBSQUARE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1.\nDescription of Business and Accounting Policies\nDescription of business\nBsquare Corporation (“Bsquare,” “we,” “us” and “our”) builds technology that is powering the next generation of connected devices and intelligent systems. We help companies realize the promise of the Internet of Things (\"IoT\") through the development of devices and systems that are cloud-enabled, share data seamlessly, facilitate distributed learning and control, and operate securely at scale. We believe that IoT-enabled systems can not only deliver value to our customers but also help people make better use of the resources of our planet. Bsquare's suite of services and software components create new revenue streams and operating models for our customers while providing opportunities for lowering costs and improving operations.\nSince our founding in 1994, Bsquare has been at the intersection of hardware and software. Today that intersection is the \"edge\" where cloud-enabled devices connect to create intelligent systems that share data, facilitate distributed control and machine learning, and operate securely at scale. We believe that our expertise, products, and services are applicable in customer projects and initiatives ranging from device hardware, to the operating system, to IoT software solutions, and cloud services that make intelligent systems possible.\nOur business has largely been focused on providing software solutions (including reselling software from Microsoft) and related engineering services to businesses that develop, market and sell dedicated-purpose standalone intelligent systems. Examples of dedicated-purpose standalone intelligent systems include smart, connected computing devices such as point-of-sale terminals, kiosks, tablets and handheld devices, as well as smart vending machines, ATM machines, digital signs, smart phones, set-top boxes and in-vehicle telematics and entertainment devices.\nBasis of consolidation\nThe consolidated financial statements include the accounts of Bsquare and our wholly owned subsidiaries. All intercompany balances and transactions have been eliminated.\nRecently adopted accounting standards\nWe adopted Accounting Standard Update (ASU) No. 2019-02, Simplifying the Accounting for Income Taxes (Topic 740) on January 1, 2020. Since we maintain a full valuation allowance on our net deferred tax assets, the adoption did not have a material impact on our financial condition, results of operations and cash flows, or financial statement disclosures.\nStandards issued and not yet implemented\nIn June 2016, the Financial Accounting Standards Board issued ASU 2016-13, Financial Instruments - Credit Losses (Topic 326). The new standard is effective for reporting periods beginning after December 15, 2022. The standard replaces the incurred loss impairment methodology under current GAAP with a methodology that reflects expected credit losses and requires the use of a forward-looking expected credit loss model for accounts receivables, loans, and other financial instruments. The standard requires a modified retrospective approach through a cumulative-effect adjustment to retained earnings as of the beginning of the first reporting period in which the guidance is effective. We plan to adopt the new credit loss standard effective January 1, 2023. We do not expect the new credit loss standard to have a material impact on our financial condition, results of operations and cash flows, or financial statement disclosures.\nIn August 2018, the FASB issued ASU 2018-15, Intangibles-Goodwill and Other-Internal-Use Software (Subtopic 350-40): Customer’s Accounting for Implementation Costs Incurred in a Cloud Computing Arrangement That Is a Service Contract (a consensus of the FASB Emerging Issues Task Force), (ASU 2018-15). The amendments in ASU 2018-15 align the requirements for capitalizing implementation costs incurred in a hosting arrangement that is a service contract with the requirements for capitalizing implementation costs incurred to develop or obtain internal-use software (and hosting arrangements that include an internal-use software license). We do not expect the new standard to have a material effect on our financial condition, results of operations and cash flows, or financial statement disclosures.\nUse of estimates\nPreparing financial statements requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses. Examples include provisions for bad debts and income taxes, estimates of progress on professional service arrangements, bonus accruals, fair value of intangible assets and property and equipment, fair values of share-based awards, and assumptions used to determine the net present value of operating lease liabilities, among other estimates. Actual results may differ from these estimates.\nIncome (loss) per share\nWe compute basic per share amounts using the weighted average number of common shares outstanding during the period and exclude any dilutive effects of common stock equivalent shares, such as options and restricted stock units (“RSUs”). We consider RSUs as outstanding and include them in the computation of basic income or loss per share only when vested. We compute diluted per share amounts using the weighted average number of common shares outstanding plus common stock equivalent shares outstanding during the period using the treasury stock method. We exclude common stock equivalent shares from the computation if their effect is anti-dilutive. Unvested but outstanding RSUs are included in the diluted per share calculation. In a period where we are in a net loss position, the diluted loss per share is computed using the basic share count.\nThe following table presents a reconciliation of the number of shares used in the calculation of basic and diluted per share amounts (in thousands):\nYear Ended December 31,\nWeighted average common shares outstanding, basic\n13,139\n12,896\nDilutive potential common shares\n-\n-\nWeighted average common shares outstanding, diluted\n13,139\n12,896\nCommon stock equivalent shares of approximately 1,837,000 and 1,570,000 were excluded from the computation of diluted per share amounts for the years ended December 31, 2020 and 2019, respectively, because their effect was anti-dilutive.\nCash, cash equivalents and investments\nWe invest our excess cash primarily in highly liquid debt instruments of U.S. government agencies and municipalities, debt instruments issued by foreign governments, corporate commercial paper, money market funds, and corporate debt securities. We classify all highly liquid investments with stated maturities of three months or less from date of purchase as cash equivalents and all highly liquid investments with stated maturities of greater than three months and not longer than 12 months as short-term investments.\nShort-term investments consist entirely of marketable securities, which are all classified as available-for-sale securities and are recorded at their estimated fair value. We determine the appropriate classification of our investments at the time of purchase and reevaluate such designation at each balance sheet date. We may or may not hold securities with stated maturities greater than 12 months until maturity. As we view these securities as available to support current operations, we classify securities with maturities less than 12 months as short-term investments. We carry these securities at fair value and report the unrealized gains and losses, net of taxes, as a component of shareholders’ equity, except for unrealized losses determined to be other than temporary, which are recorded in other expense.\nRestricted cash\nRestricted cash at December 31, 2019 represents two deposits at a financial institution; one held as security on a letter of credit that expired during 2020 on our headquarters lease obligation, the other held as security on our corporate credit card line. Restricted cash at December 31, 2020 represents only the security on our corporate card credit line.\nFinancial instruments and concentrations of risk\nFinancial instruments that potentially subject us to concentrations of credit risk consist principally of cash, cash equivalents, short-term investments, and accounts receivable.\nAllowance for doubtful accounts\nWe record accounts receivable at the invoiced amount net of an estimated allowance for doubtful accounts to reserve for potentially uncollectible receivables. We review customers that have past due invoices to identify specific customers with known disputes or collectability issues. In determining the amount of the allowance, we make judgments about the creditworthiness of significant customers based on ongoing credit evaluations.\nEquipment, furniture and leasehold improvements\nWe account for equipment, furniture and leasehold improvements at cost less accumulated depreciation and amortization. We compute depreciation of equipment and furniture using the straight-line method over the estimated useful lives of the assets, generally three years. Leasehold improvements are amortized using the straight-line method over the shorter of the lease term or estimated useful lives, ranging from two to ten years. We expense maintenance and repair costs as incurred. When assets are retired or otherwise disposed of, gains or losses are included in the consolidated statements of operations. When facts and circumstances indicate that the value of long-lived assets may be impaired, we perform an evaluation of recoverability comparing the carrying value of the asset to projected undiscounted future cash flows. Upon indication that the carrying value of such assets may not be recoverable, we recognize an impairment loss as a charge against current operations based on the difference between the carrying value of the asset and its fair value.\nLeases\nWe lease office facilities, primarily under operating leases, which expire at various dates through 2027. These leases generally contain a renewal options for a defined number of years at the then-fair market rental rate or rate stipulated in the lease agreement; which the Company has an option to exercise at the end of the initial lease term.\nWe determine if an arrangement is a lease at inception. On our balance sheet, our office facility leases, with a lease term greater than 12-months, are included in Right-of-Use (“ROU”) assets and related lease liabilities are included in the Operating leases and Operating leases, long-term statement line items. ROU assets represent our right to use the underlying assets for the lease term and operating lease liabilities represent our obligation to make lease payments arising from the lease agreements. Operating lease ROU assets and liabilities are recognized at the lease commencement date based on the present value of lease payments over the term of the lease. For leases that do not provide an implicit rate, we use an incremental borrowing rate based on information available at the commencement date to determine the present value of lease payments. We will use the implicit rate in the lease when readily determinable. The Company accounts for its lease expense with free rent periods and step-rent provisions on a straight-line basis over the original term of the lease and any extension options that the Company more likely than not expects to exercise, from the date the Company has control of the property. Certain leases provide for periodic rental increases based on price indices. Lease expense for lease payments is recognized on a straight-line basis over the lease term.\nIntangible assets\nIntangible assets were recorded in connection with business acquisitions and are stated at estimated fair value at the time of acquisition less accumulated amortization. We amortize our acquired intangible assets using the straight-line method using lives ranging from one to ten years. We review intangible assets for impairment whenever events or changes in circumstances indicate the carrying amount of an asset may not be recoverable. We measure recoverability of these assets by comparing the carrying amounts to the future undiscounted cash flows the assets are expected to generate. If intangible assets are considered impaired, the impairment to be recognized equals the amount by which the carrying value of the asset exceeds its fair market value.\nThird-party software fees payable\nWe record all fees payable and accrued liabilities related to the sale of embedded operating system software, such as Microsoft Windows IoT and Windows Mobile operating systems, as third-party software fees payable.\nResearch and development\nCosts incurred internally in researching and developing a computer software product are charged to expense until technological feasibility has been established for the product. Once technological feasibility is established, all software costs would be capitalized until the product is available for general release to customers. Judgment is required in determining when technological feasibility of a product is established. Generally, this would be reached after all high-risk development issues have been resolved through coding and testing and would occur shortly before the product is released. Research and development expense was $266,000 and $5.8 million in 2020 and 2019, respectively.\nInternally developed software\nWe capitalize payroll and benefits costs incurred internally during the application development stage of developing a computer software product for general release to customers. Amortization of costs incurred after this point is included in cost of revenue over the estimated life of the products.\nAdvertising costs\nAll costs of advertising are expensed as incurred. Advertising expense was approximately $112,000 and $154,000 in 2020 and 2019, respectively.\nShare-based compensation\nThe estimated fair value of share-based awards is recognized as compensation expense over the requisite service period, net of estimated forfeitures. We estimate forfeitures of share-based awards based on historical experience and expected future activity. The fair value of RSUs is determined based on the number of shares granted and the quoted price of our common stock on the date of grant. The fair value of stock options is estimated at the grant date based on the fair value of each vesting tranche as calculated by the Black-Scholes-Merton (“BSM”) option-pricing model. The BSM model requires various highly judgmental assumptions including expected volatility and option life. If any of the assumptions used in the BSM model change significantly, share-based compensation expense may differ materially in the future from that recorded in the current period.\nComprehensive loss\nComprehensive loss refers to net loss and other revenue, expenses, gains and losses that, under generally accepted accounting principles, are recorded as an element of shareholders’ equity but are excluded from the calculation of net loss.\nIncome taxes\nWe are subject to income taxes in the U.S. and certain foreign jurisdictions. Significant judgment is required in determining our provision for income taxes. We compute income taxes using the asset and liability method, under which deferred income taxes are provided for on the temporary differences between the financial reporting basis and the tax basis of our assets and liabilities. Our deferred tax amounts are measured using currently enacted tax rates that are expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled.\nWe apply judgment as to the appropriate weighting of all available evidence when assessing the need for the establishment or the release of valuation allowances. As part of this analysis, we examine all available evidence on a jurisdiction-by-jurisdiction basis and weigh the positive and negative information when determining the need for full or partial valuation allowances. The evidence considered for each jurisdiction includes, among other items, (i) the historical levels of income or loss over a range of time periods that extends beyond the two years presented, (ii) the historical sources of income and losses, (iii) the expectations and risk associated with underlying estimates of future taxable income, (iv) the expectations and risk associated with new product offerings and uncertainties with the timing of future taxable income, and (v) prudent and feasible tax planning strategies. Based on the analysis conducted as of December 31, 2020, we determined that we would not release, in full or in part, the valuation allowance against our U.S. gross deferred tax assets.\nWe recognize tax benefits from an uncertain position only if it is “more likely than not” that the position is sustainable, based on its technical merits. The tax benefit of a qualifying position is the largest amount of tax benefit that is greater than fifty percent likely of being realized upon ultimate settlement with a taxing authority having full knowledge of all relevant information. Interest and penalties related to uncertain tax positions are classified in the consolidated financial statements as income tax expense.\nForeign currency\nThe functional currency of foreign subsidiaries is their local currency. Accordingly, assets and liabilities are translated into U.S. dollars at exchange rates in effect at the balance sheet date. Resulting translation adjustments are included in other comprehensive loss and accumulated other comprehensive loss, a separate component of shareholders’ equity. The net gains and losses resulting from foreign currency transactions are recorded in the period incurred and were not significant for any of the periods presented.\nRevenue recognition\nWe recognize revenue when control of the promised goods or services is transferred to our customers, in an amount that reflects the consideration that we expect to receive in exchange for those goods or services. We generate all of our revenue from contracts with customers.\nEmbedded operating system software\nWe sell embedded operating system software licenses based upon a customer purchase order, shipping a COA to satisfy this single performance obligation. These shipments are also subject to limited return rights; historically, returns have been insigificant. In accordance with ASC Topic 606, Revenue from Contracts with Customers, (“Topic 606”), we recognize revenue from third-party products at the time of shipment when the customer accepts control of the COA.\nProprietary software\nWe sell our proprietary software products to customers under a contract or by purchase order. Our Edge to Cloud software contracts generally include professional services, a perpetual or term license and support and maintenance. In contracts with multiple performance obligations, we identify each performance obligation and evaluate whether the performance obligations are distinct within the context of the contract at contract inception. Performance obligations that are not distinct at contract inception are combined. Contracts that include software customization may result in the combination of the customization services with the software license as one distinct performance obligation. The transaction price is generally in the form of a fixed fee at contract inception. Certain contracts also include variable consideration in the form of royalties earned when customers meet contractual volume thresholds. We allocate the transaction price to each distinct performance obligation based on the estimated standalone selling price for each performance obligation. We then look to how control of the software transfers to the customer in order to determine the timing of revenue recognition. In contracts that include customer acceptance, we recognize revenue when we have delivered the software and received customer acceptance. We recognize revenue from support and maintenance over the service delivery period. We recognize revenue from royalties in the period of usage.\nProfessional services\nWe enter into contracts for professional services, including for our IoT-related service offerings, that include software development and customization. We identify each performance obligation in our professional services contracts at contract inception. The contracts generally include project deliverables specified by each customer. The contract pricing is either at stated billing rates per service hour and material costs or at a fixed amount. Services provided under professional engineering contracts generally result in the transfer of control of the applicable deliverable over time. We recognize revenue on service contracts based on time and materials as we have the right to invoice. We recognize revenue on fixed fee contracts on the proportion of labor hours expended (under Topic 606, the ‘input method’) to the total hours expected to complete the contract performance obligation. Certain professional service contracts include substantive customer acceptance provisions, in which case we recognize revenue upon customer acceptance.\nThe determination of the total labor hours expected to complete the performance obligations on fixed fee contracts involves significant judgment. We incorporate revisions to hour and cost estimates when the causal facts become known. In certain situations, when it is impractical for us to reasonably measure the outcome of a performance obligation, and where we anticipate that we will not incur a loss, an adjusted cost-based input method is used for revenue recognition. Equal amounts of revenue and cost are recognized during the contract period, and profit is recognized when the project is completed and accepted.\n2.\nRevenue Recognition\nDisaggregation of revenue\nThe following table provides information about disaggregated revenue by primary geographical market, major product line and timing of revenue recognition, and includes a reconciliation of the disaggregated revenue with reportable segments (in thousands):\nYear Ended December 31, 2020\nYear Ended December 31, 2019\nPartner\nEdge to\nPartner\nEdge to\nSolutions\nCloud\nTotal\nSolutions\nCloud\nTotal\nPrimary geographical markets:\nNorth America\n$ 36,141\n$ 4,198\n$ 40,339\n$ 42,443\n$ 7,667\n$ 50,110\nEurope\n1,460\n2,055\n1,273\n2,023\nAsia\n4,656\n4,750\n6,912\n7,150\nTotal\n$ 42,257\n$ 4,887\n$ 47,144\n$ 50,628\n$ 8,655\n$ 59,283\nMajor products/services lines:\nPartner Solutions\n$ 42,257\n$ -\n$ 42,257\n$ 50,628\n$ -\n$ 50,628\nEdge to Cloud\n-\n4,887\n4,887\n-\n8,655\n8,655\nTotal\n$ 42,257\n$ 4,887\n$ 47,144\n$ 50,628\n$ 8,655\n$ 59,283\nContract Balances\nWe receive payments from customers based upon contractual billing schedules; accounts receivable are recorded when the right to consideration becomes unconditional. Contract assets include amounts related to our contractual right to consideration for completed performance objectives not yet invoiced and deferred contract acquisition costs, which are amortized over time as the associated revenue is recognized. Contract liabilities, presented as deferred revenue on our condensed consolidated balance sheet, include payments received in advance of performance under the contract and are recognized as revenue when performance obligations are satisfied. We had no asset impairment charges related to contract assets during 2020 or 2019.\nThe following table provides information about receivables, contract assets and contract liabilities from contracts with customers (in thousands):\nDecember 31, 2020\nDecember 31, 2019\nReceivables\n$ 6,177\n$ 9,216\nShort-term contract assets\nLong-term contract assets\n-\nShort-term contract liabilities (deferred revenue)\n2,165\n1,559\nLong-term contract liabilities (deferred revenue)\nSignificant changes in contract assets and liabilities balances were as follows (in thousands):\nDecember 31, 2020\nDecember 31, 2019\nContract\nContract\nContract\nContract\nAssets\nLiabilities (1)\nAssets\nLiabilities (1)\nRevenue recognized that was included in the contract liability at beginning of the period\nn/a\n$ 1,633\nn/a\n$ 2,033\nTransferred to receivables from contract assets outstanding at beginning of the period\n$\nn/a\n$\nn/a\n(1) Comprised of deferred revenue\nContract acquisition costs\nIn connection with the adoption of Topic 606, we capitalize certain contract acquisition costs consisting primarily of commissions paid when contracts are signed. For contracts that have a duration of less than one year, we follow a Topic 606 practical expedient and expense these costs when incurred. For contracts with lives exceeding one year, as is more common with our DataV software bookings, we record these costs in proportion to each completed contract performance obligation. During the years ended December 31, 2020 and December 31, 2019, we recorded $89,000 and $108,000 in amortization of capitalized contract acquisition costs, respectively. There were no impairment losses recorded related to costs capitalized. Contract acquisition costs capitalized during the years ended December 31, 2020 and December 31, 2019 were $0 and $151,000, respectively.\nTransaction Price Allocated To Remaining Performance Obligations\nThe following table includes estimated revenue expected to be recognized in the future related to performance obligations that are unsatisfied or partially unsatisfied at the end of the reporting period (in thousands). The estimated revenue does not include contracts with original durations of one year or less, amounts of variable consideration attributable to royalties, or contract renewals that were unexercised as of December 31, 2020.\nThereafter\nPartner Solutions\n$\n$\n$\n$\n$ -\n$ -\nEdge to Cloud\n$ 2,352\n$\n$ -\n$ -\n$ -\n$ -\nPractical expedients and exemptions\nWe generally expense sales commissions when incurred because the amortization period would have been less than one year. We record these costs within selling, general and administrative expenses.\nWhen applicable and appropriate, the Company utilizes the 'as-invoiced' practical expedient which permits revenue recognition upon invoicing.\n3.\nCash and Investments\nCash, cash equivalents, restricted cash, and short-term investments consisted of the following (in thousands):\nDecember 31,\nCash\n$ 6,509\n$ 4,092\nCash equivalents (see detail in Note 4)\n6,114\n3,620\nRestricted cash\nTotal cash, cash equivalents and restricted cash as presented in the statement of cash flows\n12,960\n8,312\nShort-term investments (see detail in Note 4)\n-\n2,249\nTotal cash, cash equivalents, restricted cash and short-term investments\n$ 12,960\n$ 10,561\n4.\nFair Value Measurements\nWe measure our cash equivalents, restricted cash, and short-term investments at fair value. Fair value is an exit price, representing the amount that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants. As such, fair value is a market-based measurement that should be determined based on assumptions that market participants would use in pricing an asset or a liability. A three-tier fair value hierarchy is established as a basis for considering such assumptions and for inputs used in the valuation methodologies in measuring fair value:\nLevel 1:\nQuoted prices in active markets for identical assets or liabilities.\nLevel 2:\nDirectly or indirectly observable market-based inputs or unobservable inputs used in models or other valuation methodologies.\nLevel 3:\nUnobservable inputs that are not corroborated by market data. The inputs require significant management judgment or estimation.\nWe classify our cash equivalents, restricted cash, and short-term investments within Level 1 or Level 2 because our cash equivalents and short-term investments are valued using quoted market prices or alternative pricing sources and models utilizing market observable inputs. We review the pricing techniques and methodologies of the independent pricing service for Level 2 investments and believe that the policies adequately consider market activity, either based on specific transactions for the security valued or based on modeling of securities with similar credit quality, duration, yield and structure that were recently traded.\nAssets and liabilities measured at fair value on a recurring basis were as follows (in thousands):\nDecember 31, 2020\nQuoted Prices in\nActive Markets for\nDirect or Indirect\nIdentical Assets\nObservable\n(Level 1)\nInputs (Level 2)\nTotal\nAssets\nCash equivalents:\nMoney market funds\n$ 6,114\n$ -\n$ 6,114\nCorporate commercial paper\n-\n-\n-\nCorporate debt\n-\n-\n-\nTotal cash equivalents\n6,114\n-\n6,114\nRestricted cash:\nMoney market funds\n-\nShort-term investments:\nCorporate commercial paper\n-\n-\n-\nCorporate debt\n-\n-\n-\nTotal short-term investments\n-\n-\n-\nTotal assets measured at fair value\n$ 6,451\n$ -\n$ 6,451\nDecember 31, 2019\nQuoted Prices in\nActive Markets for\nDirect or Indirect\nIdentical Assets\nObservable\n(Level 1)\nInputs (Level 2)\nTotal\nAssets\nCash equivalents:\nMoney market funds\n$ 1,871\n$ -\n$ 1,871\nCorporate commercial paper\n-\nCorporate debt\n-\nTotal cash equivalents\n1,871\n1,749\n3,620\nRestricted cash:\nMoney market funds\n-\nShort-term investments:\nCorporate commercial paper\n-\nCorporate debt\n-\n1,501\n1,501\nTotal short-term investments\n-\n2,249\n2,249\nTotal assets measured at fair value\n$ 2,471\n$ 3,998\n$ 6,469\nAs of December 31, 2020 and 2019, contractual maturities of our short-term investments were less than one year, and gross unrealized gains and losses on those investments were not material.\n5.\nEquipment, Furniture and Leasehold Improvements\nEquipment, furniture, and leasehold improvements consisted of the following (in thousands):\nDecember 31,\nComputer equipment and software\n$\n$ 1,290\nOffice furniture and equipment\nLeasehold improvements\n1,165\nSoftware development costs\nTotal\n1,357\n2,762\nLess: Accumulated depreciation and amortization\n(1,035 )\n(2,510 )\nEquipment, furniture and leasehold improvements, net\n$\n$\nDepreciation and amortization expense related to these assets was $187,000 and $363,000 in 2020 and 2019, respectively.\n6.\nIntangible Assets\nIntangible assets relate to customer relationships that we acquired from TestQuest, Inc. in November 2008 and from the acquisition of Bsquare EMEA, Ltd. in September 2011 and were as follows (in thousands):\nGross Carrying\nAccumulated\nNet Carrying\nAmount\nAmortization\nValue\nCustomer relationships:\nBalance as of December 31, 2020\n$\n$ (911 )\n$\nBalance as of December 31, 2019\n$ 1,275\n$ (1,106 )\n$\nAmortization expense was $98,000 for both 2020 and 2019. Amortization expense in future periods is expected to be as follows (in thousands):\n$\n$ -\nTotal\n$\n7.\nOther Income and Loss\nOther income and loss consisted of the following (in thousands):\nYear Ended December 31,\nInterest income\n$\n$\nOther income (loss)\n(59 )\n(30 )\nTotal income (loss)\n$ (35 )\n$\n8.\nIncome Taxes\nPre-tax loss consisted of the following (in thousands):\nYear Ended December 31,\nU.S.\n$ (851 )\n$ (8,225 )\nForeign\n(1,038 )\n(940 )\nTotal\n$ (1,889 )\n$ (9,165 )\nIncome tax expense consisted of the following (in thousands):\nYear Ended December 31,\nCurrent taxes:\nFederal\n$ -\n$ -\nState and local\n-\nForeign\n-\n-\nCurrent taxes\n-\nDeferred taxes:\nFederal\n-\n-\nState and local\n-\n-\nForeign\n-\n-\nDeferred taxes\n-\n-\nTotal\n$ -\n$\nNet deferred tax assets and liabilities consisted of the following (in thousands):\nDecember 31,\nDeferred tax assets:\nNet operating loss carryforwards\n$ 18,141\n$ 18,677\nResearch and development credit carryforwards\n3,058\n3,576\nShare-based compensation\nAccrued expenses and reserves\nDepreciation and amortization\nDeferred revenue\nRight of use liability\nOther\nGross deferred tax assets\n22,456\n23,632\nLess: valuation allowance\n(22,121 )\n(23,324 )\nNet deferred tax assets\nDeferred tax liabilities:\nRight of use asset\n(328 )\n(301 )\nNet deferred tax assets\n$\n$\nNet deferred tax assets and liabilities were recorded as follows (in thousands):\nDecember 31,\nDeferred tax assets, non-current\n$\n$\nDeferred tax liability, non-current\n-\n-\nNet deferred tax assets\n$\n$\nAs of December 31, 2020, our deferred tax assets were primarily the result of U.S. net operating loss, research and development credit carryforwards and share-based compensation expense. We have applied a full valuation allowance against the U.S. deferred tax assets in the U.S. and foreign jurisdictions.\nWe use judgment as to the appropriate weighting of all available evidence when assessing the need for the establishment or the release of valuation allowances. As part of this analysis, we examine all available evidence on a jurisdiction-by-jurisdiction basis and weigh the positive and negative information when determining the need for full or partial valuation allowances. The evidence considered for each jurisdiction includes, among other items, (i) the historical levels of income or loss over a range of time periods that extends beyond the two years presented, (ii) the historical sources of income and losses, (iii) the expectations and risk associated with underlying estimates of future taxable income, (iv) the expectations and risk associated with new product offerings and uncertainties with the timing of future taxable income, and (v) prudent and feasible tax planning strategies. Based on the analysis conducted as of December 31, 2020, we determined that we would maintain a full valuation allowance against our U.S. gross deferred tax assets.\nThe provision for income taxes differed from the amount of expected income tax expense determined by applying the applicable U.S. statutory federal income tax rate to pre-tax loss as follows (in thousands, except percentages):\nYear Ended December 31,\nU.S. Federal tax benefit at statutory rates\n$ (397 )\n21.0 %\n$ (1,925 )\n21.0 %\nImpact of:\nTax credits\n(5.8 )\n(715 )\n7.8\nState income tax\n(53 )\n2.8\n(108 )\n1.2\nInternational operations\n(6 )\n0.3\n(4.5 )\nShare-based compensation\n(16.8 )\n(3.8 )\nValuation allowance\n(1,224 )\n64.8\n1,471\n(16.0 )\nExpiration of tax attributes\n1,330\n(70.4 )\n(5.2 )\nOther, net\n(76 )\n4.0\n(0.7 )\nTax expense and effective tax rate\n$ -\n0.0 %\n$\n(0.2 )%\nAt December 31, 2020, we had approximately $80.3 million of federal and $11.1 million of state net operating loss carryforwards, which have begun to expire. Of the federal net operating loss carryforwards, approximately $62.7 million will expire by 2037 and $17.6 million are indefinite. We also have approximately $3.1 million of tax credit carryforwards, which have begun to expire. Use of these carryforwards may subject us to an annual limitation due to Section 382 of the U.S. Internal Revenue Code that restricts the ability of a corporation that undergoes an ownership change to use its carryforwards. Under the applicable tax rules, an ownership change occurs if holders of more than five percent of an issuer’s outstanding common stock, collectively, increase their ownership percentage by more than 50 percentage points over a rolling three-year period. We have performed analyses of possible ownership changes in the past, which included consideration of third-party studies, and do not believe that an ownership change of more than 50 percentage points has occurred.\nWe have evaluated all the material income tax positions taken on our income tax filings to various tax authorities, and we determined that we did not have unrealized tax benefits related to uncertain tax positions recorded at December 31, 2020 and 2019.\nBecause of net operating loss and tax credit carryforwards, substantially all of our tax years remain open and subject to examination.\n9.\nLeases\nWe adopted ASU 2016-02 effective January 1, 2019 and elected the modified retrospective transition method, recording a cumulative-effect adjustment as of that date and presenting comparative prior year periods in accordance with Accounting Standards Codification Topic 840. On the date of adoption, we recorded a cumulative adjustment to recognize new net lease liabilities of $1.7 million and new right-of-use (ROU) assets of $1.2 million, for operating leases on our consolidated balance sheets, based on the present value of remaining rental payments for existing operating leases. As part of adoption, we also de-recognized $0.5 million in deferred rent. Adoption of the standard did not have a material impact on our statement of operations or statement of cash flows. As part of adoption, we elected the short-term lease recognition exemption for our facility rental and equipment leases (all leases that qualified), which means that we did not recognize ROU assets or lease liabilities for existing short-term leases (leases of 12-months or less) as of the January 1, 2019 adoption date. In addition, when adopting ASU 2016-02 we applied the following practical expedients to forego assessing:\n•\nwhether any expired or existing contracts are or contain a lease,\n•\nlease classification for any expired or existing leases, and\n•\ninitial direct costs for any existing leases.\n•\nto separate non-lease components from lease components for leases of real estate assets.\nWe determine if an arrangement is a lease at inception. On our balance sheet, our office leases are included in ROU assets and related lease liabilities are included in the operating leases and operating leases, long-term statement line items. We determined that we do not currently have finance leases.\nROU assets represent our right to use the underlying assets for the lease term and operating lease liabilities represent our obligation to make lease payments arising from the lease agreements. Operating lease ROU assets and liabilities are recognized at the lease commencement date based on the present value of lease payments over the term of the lease. For leases that do not provide an implicit rate, we use an incremental borrowing rate based on information available at the commencement date to determine the present value of lease payments. We will use the implicit rate in the lease when readily determinable. Lease expense for lease payments is recognized on a straight-line basis over the lease term.\nIn December 2019, we entered into an operating lease agreement for a new corporate office facility in Seattle, Washington. The term of the lease is 87 months, with a rent date starting on May 1, 2020 and the lease term ending on July 31, 2027. As a result of entering into this lease agreement in December 2019, we recorded additional ROU assets and net lease liabilities of $1.2 million on our consolidated balance sheets. There was no material impact to our statement of operations or statement of cash flows as a result of entering into this lease.\nIn November 2020, we renewed the lease for our office facility in the UK. The term of the lease is 120 months, with rent payments starting on November 30, 2020 and the lease term ending on November 8, 2030. The Company has an opportunity to break the lease at the five-year mark in November 2025. As it is reasonably certain that we will utilize this option, the accounting for this lease utilized November 2025 as the end date. The lease commencement date was November 9, 2020. As a result of entering this lease agreement, we recorded additional ROU assets and net lease liabilities of $365,559 on our consolidated balance sheet as of December 31, 2020. There was no material impact to our statement of operations or statement of cash flows as a result of entering into this lease.\nOur leases have remaining terms of five to seven years. The only leases that contain renewal options are for office space leases at our Seattle and Trowbridge locations. In the fourth quarter of 2019, we made the decision to not renew our Bellevue lease, which expired at the end of May 2020, and we made the decision not to renew our Taiwan lease, exiting that facility in February 2020 (see Note 17, “Restructuring Costs”). Because of changes in our business, we are not able to determine with reasonable certainty whether we will renew our Seattle lease. As a result, we have not considered renewal options when recording ROU assets, lease liabilities or lease expense.\nTwelve months ended\nTotal component lease expense was as follows (in thousands):\nDecember 31, 2020\nOperating leases\n$\nSupplemental cash flow information related to leases was as follows (in thousands):\nCash paid for amounts included in the measurement of lease liabilities\n$\nSupplemental balance sheet information related to leases was as follows (dollars in thousands):\nDecember 31, 2020\nOperating leases:\nRight of use\n$ 1,853\nCurrent portion of operating leases liability\n$\nOperating leases liability, net of current portion\n1,630\nTotal operating leases liabilities\n$ 1,974\nWeighted Average Remaining Lease Term (in years)\n6.15\nWeighted Average Discount Rate\n8.5 %\nFuture operating lease commitments are as follows (in thousands):\nAs of December 31, 2020, maturities of lease liabilities were as follows:\nOperating leases\nYears Ended December 31,\n$\nThereafter\nTotal minimum lease payments\n$ 2,310\nLess: amount representing imputed interest\n(336 )\nPresent value of lease liabilities\n$ 1,974\n10.\nCommitments and Contingencies\nLease and rent obligations\nOur commitments include obligations outstanding under operating leases, which expire through 2027. We have lease commitments for office space in Seattle, Washington and Trowbridge, UK. See Note 9, “Leases.”\nLoss contingencies\nFrom time to time, we are subject to legal proceedings, claims, and litigation arising in the ordinary course of business including tax assessments. We defend ourselves vigorously against any such claims. When (i) it is probable that an asset has been impaired, or a liability has been incurred and (ii) the amount of the loss can be reasonably estimated, we record the estimated loss. We provide disclosure in the notes to the consolidated financial statements for loss contingencies that do not meet both of these conditions if there is a reasonable possibility that a loss may have been incurred that would be material to the financial statements. Significant judgment is required to determine the probability that a liability has been incurred and whether such liability is reasonably estimable. We base accruals made on the best information available at the time, which can be highly subjective. The final outcome of these matters could vary significantly from the amounts included in the accompanying consolidated financial statements.\n11.\nShareholders’ Equity\nEquity compensation plans\nWe have a stock plan (the “Stock Plan”) and an inducement stock plan for newly hired employees (the “Inducement Plan”) (collectively the “Plans”). Under the Plans, stock options may be granted with a fixed exercise price that is equivalent to the fair market value of our common stock on the date of grant. These options have a term of up to 10 years and vest over a predetermined period, generally four years. Incentive stock options granted under the Stock Plan may only be granted to our employees. The Plans also allow for awards of non-qualified stock options, stock appreciation rights, restricted and unrestricted stock awards, and RSUs.\nShare-based compensation\nThe estimated fair value of share-based awards is recognized as compensation expense over the vesting period of the award, net of estimated forfeitures. We estimate forfeitures based on historical experience and expected future activity. The fair value of RSUs is determined based on the number of shares granted and the quoted price of our common stock on the date of grant. The fair value of stock options is estimated at the grant date based on the fair value of each vesting tranche as calculated by the Black-Scholes-Merton (“BSM”) option-pricing model. The BSM model requires various highly judgmental assumptions including expected volatility and option life. If any of the assumptions used in the BSM model change significantly, share-based compensation expense may differ materially in the future from that recorded in the current period. The fair values of our stock option grants were estimated with the following weighted average assumptions:\nYear Ended December 31,\nDividend yield\n%\n%\nExpected life (in years)\n4.9\n4.9\nExpected volatility\n%\n%\nRisk-free interest rate\n0.5 %\n1.6 %\nThe impact on our results of operations from share-based compensation expense was as follows (in thousands, except per share amounts):\nYear Ended December 31,\nCost of revenue- professional engineering service\n$\n$\nSelling, general and administrative\nResearch and development\n(2 )\n(28 )\nTotal share-based compensation expense\n$\n$\nPer basic share\n$ 0.06\n$ 0.04\nPer diluted share\n$ 0.06\n$ 0.04\nStock option activity\nThe following table summarizes stock option activity:\nWeighted Average\nRemaining\nWeighted Average\nContractual Life\nAggregate\nNumber of Shares\nExercise Price\n(in years)\nIntrinsic Value\nBalance at December 31, 2018\n1,390,012\n$ 4.77\n6.83\nGranted\n958,798\n1.69\nExercised\n-\n-\nForfeited\n(251,213 )\n4.81\nExpired\n(552,771 )\n5.07\nBalance at December 31, 2019\n1,544,826\n2.74\n7.47\n$ 46,582\nGranted\n683,900\n1.08\nExercised\n(26,250 )\n1.34\nForfeited\n(215,218 )\n1.50\nExpired\n(200,367 )\n4.82\nBalance at December 31, 2020\n1,786,891\n3.10\n7.75\n$ 330,831\nVested and expected to vest at December 31, 2020\n1,593,216\n2.12\n7.63\n278,883\nExercisable at December 31, 2020\n609,781\n$ 3.26\n6.03\n$ 19,668\nAt December 31, 2020, total compensation cost not yet recognized related to granted stock options was approximately $436,000, net of estimated forfeitures. This cost will be amortized on the straight-line method over a weighted-average period of approximately 1.4 years.\nThe following table summarizes certain additional information about stock options:\nYear Ended December 31,\nWeighted average grant-date fair value for options granted during the year\n$ 1.08\n$ 1.33\nVested options in-the-money\n71,993\nAggregate intrinsic value of options exercised during the year\n$\n$ -\nThe aggregate intrinsic value represents the difference between the exercise price of the underlying options and the quoted price of our common stock for the number of options that were exercised during the periods indicated. We issue new shares of common stock upon exercise of stock options.\nRestricted stock unit activity\nThe following table summarizes RSU activity:\nNumber of\nWeighted Average\nShares\nAward Price\nUnvested at December 31, 2018\n186,516\n$ 2.87\nGranted\n225,693\n1.44\nVested\n(264,720 )\n2.03\nForfeited\n(34,643 )\n4.68\nUnvested at December 31, 2019\n112,846\n1.44\nGranted\n219,596\n1.48\nVested\n(167,745 )\n1.45\nForfeited\n-\n-\nUnvested at December 31, 2020\n164,697\n1.48\nExpected to vest after December 31, 2020\n158,504\n$ 1.48\nAt December 31, 2020, total compensation cost not yet recognized related to granted RSUs was approximately $79,000, net of estimated forfeitures. This cost will be amortized on the straight-line method over a weighted-average period of approximately 0.3 years.\nCommon stock reserved for future issuance\nThe following table summarizes our shares of common stock reserved for future issuance under the Plans as of December 31, 2020:\nStock options outstanding\n1,786,891\nRestricted stock units outstanding\n164,697\nStock options available for future grant\n1,242,125\nCommon stock reserved for future issuance\n3,193,713\n12.\nEmployee Benefit Plan\nWe maintain a Profit Sharing and Deferred Compensation Plan, The BSQUARE Corporation 401(k) Plan and Trust (the “Profit Sharing Plan”) under Section 401(k) of the Internal Revenue Code. Substantially all full-time employees are eligible to participate in the Profit-Sharing Plan. We typically elect to match the participants’ contributions to the Profit-Sharing Plan up to a certain amount subject to vesting. Participants will receive their share of the value of their investments, and any applicable vested match, upon retirement or termination. We made matching contributions of $135,000 and $256,000 in 2020 and 2019, respectively.\n13.\nSignificant Concentrations\nSignificant customer\nNo customers accounted for 10% or more of total revenue during 2020 or 2019.\nKodak Alaris had accounts receivable balances of approximately $866,000, or 15% of total accounts receivable, at December 31, 2020. Honeywell International, Inc. and affiliated entities (“Honeywell”) had accounts receivable balances of approximately $680,000, or 12% of total accounts receivable, at December 31, 2020.\nHoneywell had accounts receivable balances of approximately $1.2 million, or 13% of total accounts receivable, at December 31, 2019.\nSignificant supplier\nWe are authorized to sell Windows IoT operating systems in Canada, the United States, Argentina, Brazil, Chile, Mexico, Peru, Venezuela, Puerto Rico, Columbia, and several Caribbean countries. Our distribution agreement for sales of Windows IoT operating systems in the European Union (“E.U.”), the European Free Trade Association, Turkey and Africa, expired on June 30, 2019 and was not renewed thereafter. We generated approximately 3% of our Partner Solutions software sales under this agreement in 2019.\nWe have also entered into ODAs with Microsoft pursuant to which we are licensed to sell Microsoft Windows Mobile operating systems to customers in North America, South America, Central America (excluding Cuba), Japan, Taiwan, Europe, the Middle East, and Africa. The ODAs to sell Windows Mobile operating systems are effective through April 30, 2022.\nThere is no automatic renewal provision in any of these agreements, and these agreements can be terminated unilaterally by Microsoft at any time.\nThe majority of our revenue continues to be derived from reselling Microsoft Windows Embedded and IoT operating system software to device makers. The sale of Microsoft operating systems has historically accounted for substantially all of our Partner Solutions revenue.\nMicrosoft currently offers a distributor incentives program through which we earn rebates pursuant to predefined objectives related to sales of Microsoft Windows IoT operating systems. In accordance with program rules, we allocate a portion of the incentive earnings to reduce cost of revenue with the remaining portion utilized to offset qualified marketing expenses in the period the expenditures are claimed and approved. During 2019, 20% was allocated to offset cost of revenue and the remaining 80% was potentially available to offset qualified marketing expenses. During the second quarter of 2020 the program allocation was changed by Microsoft to a 50/50 split between the two components.\nUnder this rebate program, we recorded rebate credits as follows (in thousands):\nYear Ended December 31,\nReductions to cost of revenue\n$\n$\nReductions to marketing expense\n$ 1,115\n$ 1,217\n14.\nPaycheck Protection Program Loan\nOur PPP Loan is evidenced by a promissory note, dated as of April 7, 2020 (the \"Note\"), between us and JPMorgan Chase Bank, N.A. (the \"Lender\"). The note has a two-year term, bears interest at the rate of 0.98% per annum, and may be prepaid at any time without payment of any premium or penalty. Under current statutes, no payments of principal or interest are due until July 25, 2021 (the \"Deferral Period\"). The principal and accrued interest under the Note is forgivable after an eight- or 24-week period if we used the PPP Loan proceeds for eligible purposes, including payroll, benefits, rent and utilities, and otherwise comply with PPP Loan requirements. The selection of the eight- or 24-week period is at our discretion. In order to obtain forgiveness of the PPP Loan, we must submit a request and provide satisfactory documentation regarding our compliance with applicable requirements. We must repay any unforgiven principal amount of the Note, with interest, on a monthly basis following the Deferral Period. We have used the proceeds of the PPP Loan for eligible purposes and intend to pursue forgiveness, although we may have taken or may in the future take action that could inadvertently cause some or all of the PPP Loan to become ineligible for forgiveness.\nThe Note contains customary events of default relating to, among other things, payment defaults and breaches of representations or warranties. The occurrence of an event may result in the repayment of all amounts outstanding, collection of all amounts owing from us, or filing suit and obtaining judgement against us.\nAt December 31, 2020 and December 31, 2019, the PPP Loan balance was as follows (in thousands):\nDecember 31, 2020\n﻿December 31, 2019\n﻿PPP Loan, .98%, due April 2022:\n﻿Principal\n﻿$ 1,572\n﻿$ -\n﻿Accrued interest\n﻿12\n-\n﻿$ 1,584\n﻿$ -\n﻿PPP Loan payable:\n﻿Current portion\n﻿$ ﻿950\n﻿Long-term portion\n﻿634\n﻿$ ﻿1,584\n﻿$ -\n15.\nInformation about Operating Segments and Geographic Areas\nOur chief operating decision-makers (i.e. our Chief Executive Officer and certain direct reports) review financial information presented on a consolidated basis, accompanied by disaggregated information for purposes of allocating resources and evaluating financial performance. There are no segment managers who are held accountable by our chief operating decision-makers, or anyone else, for operations, operating results, or planning for levels or components below the consolidated unit level. We operate within a single industry segment of computer software and services.\nWe have two major product lines, Partner Solutions and Edge to Cloud, each of which we consider to be operating and reportable segments. We do not allocate costs other than direct cost of goods sold to the segments or produce segment income statements, and we do not produce asset information by reportable segment. The following table sets forth profit and loss information about our segments (in thousands):\nYear Ended December 31,\nPartner Solutions:\nRevenue\n$ 42,257\n$ 50,628\nCost of revenue\n35,171\n43,198\nGross profit\n7,086\n7,430\nEdge to Cloud:\nRevenue\n4,887\n8,655\nCost of revenue\n4,247\n5,989\nGross profit\n2,666\nTotal gross profit\n7,726\n10,096\nOperating expenses\n9,580\n19,410\nOther income, net\n(35 )\nIncome tax expense\n-\n(16 )\nNet loss\n$ (1,889 )\n$ (9,181 )\nRevenue by geography is based on the sales region of the customer. The following tables set forth revenue and long-lived assets by geographic area (in thousands):\nYear Ended December 31,\nTotal revenue:\nNorth America\n$ 40,339\n$ 50,110\nAsia\n4,750\n7,150\nEurope\n2,055\n2,023\nTotal revenue\n$ 47,144\n$ 59,283\nDecember 31,\nLong-lived assets:\nNorth America\n$ 1,179\n$ 2,016\nAsia\nEurope\n-\nTotal long-lived assets\n$ 1,358\n$ 2,533\n16.\nImpairment of Software Development Costs\nFor the twelve months of 2020 and 2019, we incurred charges of $0 and $0.4 million, respectively, for impairment of software development costs. The charges are reflected in the “Restructuring costs” line item on the Company’s consolidated statement of operations and comprehensive loss.\n17.\nRestructuring Costs\nIn May 2019, we approved a severance plan that included a workforce elimination of approximately 38 positions in the U.S. and internationally. In October 2019, we determined to close our Taiwan branch office by December 31, 2019, which resulted in elimination of approximately 17 additional positions by the end of 2019. An involuntary termination benefit plan was provided to employees of the Taiwan branch in order to reduce go-forward operating costs and re-align our go-forward business model. The costs associated with these actions consisted primarily of charges for restructuring costs related to severance and benefits, and a non-cash impairment charge related to certain software development cost assets. We incurred aggregate restructuring charges of approximately $2.3 million associated with these actions during 2019, beginning in the second quarter of 2019. During the twelve months ended December 31, 2020, we did not incur charges for restructuring costs under this plan. For the twelve months ended December 31, 2020, $0.5 million in restructuring costs were paid and there is no remaining balance of accrued restructuring charges on our consolidated balance sheet at December 31, 2020.\nSummary of Restructuring Costs\nThe following tables show the activity and estimated timing of future payouts for accrued restructuring costs (in thousands):\nYear Ended December 31,\nBalance as of December 31, 2019\n$\n$ -\nRestructuring costs\n-\n2,343\nNon-cash asset impairment charge\n-\n(375 )\nCash payments\n(461 )\n(1,507 )\nBalance as of December 31, 2020\n$ -\n$\n18.\nQuarterly Financial Information (Unaudited)\nCondensed Consolidated Statements of Operations\nQ1\nQ2\nQ3\nQ4\n(in thousands, except per share data)\nRevenue\n$ 16,729\n$ 8,924\n$ 10,420\n$ 11,071\nGross profit\n2,585\n1,046\n1,890\n2,205\nLoss from operations\n(439 )\n(1,075 )\n(138 )\n(202 )\nNet loss\n(474 )\n(1,073 )\n(136 )\n(206 )\nBasic loss per share\n(0.04 )\n(0.08 )\n(0.01 )\n(0.02 )\nDiluted loss per share\n$ (0.04 )\n$ (0.08 )\n$ (0.01 )\n$ (0.02 )\nShares used in per share calculations:\nBasic\n13,055\n13,110\n13,165\n13,225\nDiluted\n13,055\n13,110\n13,165\n13,225\nQ1\nQ2\nQ3\nQ4\n(in thousands, except per share data)\nRevenue\n$ 15,096\n$ 14,180\n$ 14,641\n$ 15,366\nGross profit\n2,391\n2,423\n2,632\n2,650\nLoss from operations\n(2,879 )\n(3,929 )\n(1,129 )\n(1,377 )\nNet loss\n(2,846 )\n(3,868 )\n(1,107 )\n(1,360 )\nBasic loss per share\n(0.22 )\n(0.30 )\n(0.09 )\n(0.10 )\nDiluted loss per share\n$ (0.22 )\n$ (0.30 )\n$ (0.09 )\n$ (0.10 )\nShares used in per share calculations:\nBasic\n12,795\n12,855\n12,934\n12,997\nDiluted\n12,795\n12,855\n12,934\n12,997\nCondensed Consolidated Balance Sheets\nMarch 31\nJune 30\nSeptember 30\nDecember 31\n(in thousands)\nCash, cash equivalents, restricted cash and short-term investments\n$ 10,644\n$ 12,582\n$ 12,572\n$ 12,960\nTotal current assets\n22,002\n20,245\n19,062\n20,002\nTotal assets\n23,973\n22,075\n21,063\n22,282\nTotal current liabilities\n12,856\n11,422\n10,544\n11,339\nTotal shareholders' equity\n$ 9,401\n$ 8,432\n$ 8,622\n$ 8,651\nMarch 31\nJune 30\nSeptember 30\nDecember 31\n(in thousands)\nCash, cash equivalents, restricted cash and short-term investments\n$ 15,000\n$ 12,560\n$ 11,610\n$ 10,561\nTotal current assets\n26,428\n22,897\n21,442\n20,515\nTotal assets\n29,673\n24,967\n23,056\n23,055\nTotal current liabilities\n12,464\n11,882\n11,226\n11,200\nTotal shareholders' equity\n$ 15,673\n$ 11,835\n$ 10,888\n$ 9,696",
    "item_9": "Item 9.\nChanges in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A.\nControls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures that are designed to ensure that the information required to be disclosed in the reports that we file or submit under the Securities Exchange Act of 1934 (“Exchange Act”) is recorded, processed, summarized and reported within the time periods specified in the SEC’s rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure. In connection with the preparation of this Form 10-K, our management carried out an evaluation, under the supervision and with the participation of our Chief Executive Officer and Chief Financial Officer, as of December 31, 2020, of the effectiveness of the design and operation of our disclosure controls and procedures, as such term is defined under Rule 13a-15(e) and 15d-15(e) under the Exchange Act. Based upon this evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were effective as of December 31, 2020.\nManagement’s Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Our internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of our financial reporting and the preparation of our financial statements for external purposes in accordance with generally accepted accounting principles. Internal control over financial reporting is defined in Rules 13a-15(f) and 15d-15(f) promulgated under the Exchange Act and includes those policies and procedures that: (a) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets; (b) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and (c) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on our financial statements. All internal controls, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\nOur management assessed the effectiveness of our internal control over financial reporting as of December 31, 2020. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control-Integrated Framework (2013).\nBased on its assessment, our management concluded that, as of December 31, 2020, our internal control over financial reporting was effective.\nChanges in Internal Control over Financial Reporting\nThere have been no changes in our internal control over financial reporting during the fourth quarter of 2020 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.",
    "item_9B": "Item 9B.\nOther Information\nNone.\nPART III",
    "item_10": "Item 10.\nDirectors, Executive Officers and Corporate Governance\nGeneral\nOur Articles of Incorporation provide that the Board of Directors has seven seats. The Board of Directors is currently divided into three classes, with each class having a three-year term. A director serves in office until his or her respective successor is duly elected and qualified, unless the director is removed, resigns or, by reason of death or other cause, is unable to serve in the capacity of director. Any additional directorships resulting from an increase in the number of directors will be distributed among the three classes so that, as nearly as possible, each class will consist of an equal number of directors. There are no family relationships among any of our directors or officers.\nDirectors\nThe names and certain information about the nominees and each director are set forth below.\nName of Directors\nAge\nPosition\nDirector Since\nTerm Expires\nRobert J. Chamberlain\nDirector\n2023 (Class I)\nDavin W. Cushman\nDirector\n2022 (Class III)\nRalph C. Derrickson\nDirector, President and Chief Executive Officer\n2021 (Class II)\nAndrew S.G. Harries\nDirector\n2023 (Class I)\nMary Jesse\nDirector\n2022 (Class III)\nRobert J. Peters\nDirector\n2022 (Class III)\nRyan Vardeman\nDirector\n2021 (Class II)\nRobert J. Chamberlain has been a director since August 2015. Since April 2018, Mr. Chamberlain has been the Chief Financial Officer of ZipWhip, a two-way business texting software company. From August 2014 to April 2016, Mr. Chamberlain served as the Chief Financial Officer of Big Fish Games Incorporated, a leading provider of casual games, which was acquired by Churchill Downs, Inc. in December 2014. From February 2013 to August 2014, Mr. Chamberlain served as the Senior Vice President and Chief Financial Officer of Audience Science Incorporated, a leading provider of enterprise advertising management systems. Prior to that, Mr. Chamberlain was the Chief Financial Officer of other technology companies in the Seattle area including PopCap Games Incorporated (acquired by Electronic Arts, Inc.), WatchGuard Technologies Incorporated, Networks, Onyx Software Corp. (acquired by Consona Corporation) and Photodisc (acquired by Getty Images, Inc.). Earlier in his career, Mr. Chamberlain was an audit partner in the Seattle office of KPMG where he served middle market public and private companies. Mr. Chamberlain has a B.S. in Business Administration-Accounting from California State University Northridge. Board of Directors has concluded that Mr. Chamberlain should serve as a director because he brings to our Board of Directors substantial financial expertise that includes extensive knowledge of the complex financial and operational issues facing publicly traded companies, and a deep understanding of accounting principles and financial reporting rules and regulations. He also brings professional service expertise, technology industry experience, and sales and marketing experience at KPMG.\nDavin W. Cushman has been a director since November 2018. Mr. Cushman currently serves as CEO of Brightrose Software, a private, acquisition-focused growth company launched in 2021 from Cushman Management Company, a boutique advisory firm Mr. Cushman founded in 2010. Mr. Cushman started his career in 1996 with enterprise application pioneer Trilogy. Mr. Cushman’s professional experience also includes roles in operations and workforce strategy with Capital One. Mr. Cushman most recently completed a 10+ year stint in 2020 as CEO of Ignite Technologies and its affiliates, a privately held group formed through more than 40 mergers and acquisitions of small to mid-sized software companies. Mr. Cushman holds a B.A. in Politics from Princeton University and an M.B.A. from the Kellogg School of Management from Northwestern University. The Board of Directors has concluded that Mr. Cushman should serve as a director because of his nearly 20 years in various roles in the enterprise software industry, including leadership of companies that provide software and technical consulting services to the types of organizations Bsquare serves.\nRalph C. Derrickson has been a director and our President and Chief Executive Officer since March 2019. Prior to that, since July 2018, Mr. Derrickson served as the Managing Director of RCollins Group, a strategic consulting company, and from October 2017 until July 2018, he served as the Senior Vice President of Corporate Development for Avizia, Inc., a telemedicine hardware, software and physician services company, until its acquisition by American Well in July 2018. From January 2006 until October 2017, Mr. Derrickson served as the President and Chief Executive Officer of Carena, Inc., a virtual care software and physician services company, until its acquisition by Avzia in October 2017. Prior to that, Mr. Derrickson was managing director of venture investments at Vulcan Inc., an investment management firm, was a founding partner of Watershed Capital, an early-stage venture capital firm, and held senior leadership positions at Metricom, Starwave Corporation (acquired by Walt Disney), NeXT Computer (acquired by Apple Computer) and Sun Microsystems. Since 2004, Mr. Derrickson has been a board member of Perficient, Inc. (NASDAQ: PRFT), a publicly traded digital transformation consulting company. Mr. Derrickson holds a B.T. in Systems Software Science from the Rochester Institute of Technology. The Board of Directors has concluded that Mr. Derrickson should serve as a director because of his experience as a chief executive officer, and in various other executive roles, which has provided him with broad leadership and executive experience, including operational, strategic planning, corporate development and mergers and acquisitions experience. As our President and Chief Executive Officer, Mr. Derrickson has first-hand knowledge of our business and provides valuable insight with respect to our operations and strategic opportunities.\nAndrew S. G. Harries has been a director since November 2012, has served as the Chairman of the Board since July 2013 and served as the Executive Chairman from May 2018 to March 2019. Mr. Harries is a business advisor and corporate director and since 2016 has held the post of Tom Foord Professor of Practice in Innovation and Entrepreneurship at Simon Fraser University’s Beedie School of Business. Mr. Harries chaired the board of directors of Contractually, an online contract management company, from January 2014 until its acquisition by Coupa Software in December 2015, and co-founded Zeugma Systems Inc. where he served as the President and Chief Executive Officer from 2004 until Tellabs Inc. acquired substantially all of Zeugma in 2010. Mr. Harries was a co-founder of Sierra Wireless (NASDAQ: SWIR), a NASDAQ-listed wireless Internet of Things systems vendor, from 1993 to 2004, and previously served as Sierra’s Senior Vice President of Sales, Marketing and Operations. Prior to co-founding Sierra Wireless, Mr. Harries held a variety of positions at Motorola Inc. He holds three US patents and an M.B.A. from Simon Fraser University. The Board of Directors has concluded that Mr. Harries should serve as a director because of his embedded technology industry expertise and extensive management and sales and marketing experience. He also has experience as a public company board member.\nMary Jesse has been a director since August 2016. Ms. Jesse is a technology executive, strategist, inventor and pioneer in the wireless industry. In September 2019, Ms. Jesse joined Alvarez & Marsal as a Senior Director where she is currently assigned as Chief Operating Officer of Mobile Technologies, Inc. From January 2018 to August 2018, Ms. Jesse served as Chief Executive Officer and board member of Heyou Media, a technology-driven content company. From September 2015 to October 2017, she served as Chief Strategy Officer of VRstudios, a global virtual reality company based in Bellevue, Washington. From 2007 to October 2014, she was the founder and Chief Executive Officer of Ivy Corp., an enterprise messaging technology company. Prior to that, she served as the co-founder and Chief Technology Officer of RadioFrame Networks; Vice President of Strategic Technology of McCaw Cellular Communications, Inc.; and Vice President of Technology Development of AT&T Wireless. A licensed professional engineer, Ms. Jesse holds a B.S. in electrical engineering from the University of Utah and an M.S. in electrical engineering from Santa Clara University, in addition to having authored nineteen patents. She currently serves on the Washington Governors University business council in addition to serving as an advisor to multiple technology companies. Ms. Jesse volunteers her time to support STEM education, entrepreneurship and diversity in business and technology. The Board of Directors has concluded that Ms. Jesse should serve as a director because of her extensive technology product development experience and work with a wide range of emerging businesses.\nRobert J. Peters has been a director since August 2018 and served as an observer to the Board from June to August 2018. Mr. Peters is a principal and co-founder of Palogic Value Management, L.P., the investment manager of Palogic Value Fund, LP, a Dallas, Texas based investment management company, a position he has held since January 2007. Mr. Peters routinely analyzes public companies’ business plans, financial statements, and competitive positioning. Prior to founding Palogic, Mr. Peters was an investment banker with Stephens Inc., based in Little Rock, Arkansas, where he served as an analyst and associate responsible for execution of a variety of corporate finance transactions including sell side mergers and acquisitions, buy side mergers and acquisitions, leveraged buyouts, private equity investments, initial public offerings, and private placements of debt and equity. Mr. Peters attended Texas Tech University and received an M.S. in Accounting and a B.A. in Business Administration - Accounting. The Board of Directors has concluded that Mr. Peters should serve as a director because of his significant experience in equity capital markets, assessing corporate strategy, and capital allocation and given his affiliation with one of our largest shareholders.\nRyan L. Vardeman has been a director since June 2018. Mr. Vardeman is a principal and co-founder of Palogic Value Management, L.P., a Dallas, Texas based investment management company, a position he has held since January 2007. Mr. Vardeman has extensive corporate strategy, operating, financial and investment experience including capital structure analysis, a focus on small-cap equities, and investing in a broad range of industries with an emphasis on technology and software companies. Mr. Vardeman holds a B.S. in Electrical Engineering and Computer Science from Texas Tech University and an M.B.A. from the Owen Graduate School of Management at Vanderbilt University. The Board of Directors has concluded that Mr. Vardeman should serve as a director because of his extensive financial and operational experience and given his affiliation with one of our largest shareholders.\nBoard of Directors Leadership Structure\nThe Board of Directors has adopted a structure under which the Chairman of the Board is an independent director. We believe that having a Chairman independent of management provides effective leadership for the Board of Directors and helps ensure critical and independent thinking with respect to our strategy and performance. In addition, the Board believes this governance structure promotes balance between the Board's independent authority to oversee our business and the Chief Executive Officer and his management team who manage the business on a day-to-day basis. Moreover, the current separation of the Chairman and Chief Executive Officer roles allows the Chief Executive Officer to focus his time and energy on operating and managing the business while leveraging the experience and perspectives of the Chairman. Our Chief Executive Officer has historically served as a member of and as the sole management representative on the Board of Directors. Mr. Derrickson is a director as well as our President and Chief Executive Officer. We believe it is important to enable our Chief Executive Officer to provide information and insight about us directly to the directors in their deliberations. Further, our Board of Directors believes that separating the Chief Executive Officer and Chairman of the Board roles as well as having the Chairman of the Board role represented by an independent director is the appropriate leadership structure for us at this time and demonstrates our commitment to effective corporate governance.\nOur Chairman of the Board is responsible for the effective functioning of our Board of Directors, enhancing its efficacy by guiding its processes and presiding at Board of Directors meetings and executive sessions of the independent directors. Our Chairman presides at shareholder meetings and ensures that directors receive appropriate information from our management to fulfill their responsibilities. Our Chairman also acts as a liaison between our Board of Directors and executive management, promoting clear and open communication between management and the Board of Directors.\nBoard of Directors Role in Risk Oversight\nOur Board of Directors has responsibility for the oversight of risk management. Our Board, either as a whole or through its committees, regularly discusses with management our major risk exposures, their potential impact on us and the steps we take to manage them. While our Board is ultimately responsible for risk oversight, our Board committees assist the Board of Directors in fulfilling its oversight responsibilities in certain areas of risk. In particular, our Audit Committee focuses on financial, accounting and investment risks and oversees and approves company-wide risk management practices. Our Governance and Nominating Committee focuses on the management of risks associated with Board organization, membership, structure and corporate governance. In addition, our Compensation Committee assists the Board of Directors in fulfilling its oversight responsibilities with respect to the management of risks arising from our compensation policies and programs and related to succession planning for our executive officers.\nBoard of Directors Independence\nThe Board of Directors has determined, after consideration of all relevant factors, that each of Messrs. Chamberlain, Cushman, Harries, Peters and Vardeman and Ms. Jesse, together constituting a majority of our Board of Directors, qualifies as an “independent” director as defined under applicable rules of The NASDAQ Stock Market LLC (“NASDAQ”) and that none of such directors has any relationship with us that would interfere with the exercise of their independent business judgment. Mr. Derrickson does not qualify as an “independent” director under applicable NASDAQ rules because he serves as our President and Chief Executive Officer.\nStanding Committees and Attendance\nThe Board of Directors held six meetings during 2020. All directors attended more than 75% of the aggregate of the meetings of the Board of Directors and committees thereof, if any, upon which such director served during the period for which he or she was a director or committee member during 2020.\nThe Board has an Audit Committee, a Compensation Committee and a Governance and Nominating Committee. Information about these standing committees and committee meetings is set forth below.\nAudit Committee\nThe Audit Committee is currently comprised of Messrs. Chamberlain (Committee Chair) and Harries and Ms. Jesse. The Board of Directors has determined that, after consideration of all relevant factors, each of these directors qualifies as an “independent” director under applicable SEC and NASDAQ rules. Each member of the Audit Committee is able to read and understand fundamental financial statements, including our consolidated balance sheets, consolidated statements of operations and consolidated statements of cash flows. No member of the Audit Committee has participated in the preparation of our consolidated financial statements, or those of any of our current subsidiaries, at any time during the past three years. The Board of Directors has designated Mr. Chamberlain as an “audit committee financial expert” as defined under applicable SEC rules and has determined that Mr. Chamberlain possesses the requisite “financial sophistication” under applicable NASDAQ rules.\nThe Audit Committee operates under a written charter setting forth the functions and responsibilities of the committee, which is reviewed by the committee on an annual basis, and by the Board of Directors as appropriate. A current copy of the Audit Committee charter is available on our website at www.bsquare.com on the Corporate Governance page under Management and Corporate Governance - Board Committees and Charter Documents.\nThe Audit Committee is responsible for overseeing our independent auditors, including their selection, retention and compensation, reviewing and approving the scope of audit and other services by our independent auditors, reviewing the accounting policies, judgments and assumptions used in the preparation of our financial statements and reviewing the results of our audits. The Audit Committee is also responsible for reviewing the adequacy and effectiveness of our internal controls and procedures, including risk management, establishing procedures regarding complaints concerning accounting or auditing matters, reviewing and, if appropriate, approving related-party transactions, reviewing compliance with our Code of Business Conduct and Ethics, and reviewing our investment policy and compliance therewith. The Audit Committee held four meetings during 2020.\nCompensation Committee\nThe Compensation Committee currently consists of Messrs. Cushman, Harries and Vardeman (Committee Chair). The Board of Directors has determined that, after consideration of all relevant factors, each of these directors qualifies as an “independent” and “non-employee” director under applicable NASDAQ and SEC rules. The Compensation Committee makes recommendations to the Board of Directors regarding our general compensation policies as well as the compensation plans and specific compensation levels for its executive officers. The Compensation Committee held six meetings during 2020.\nThe Compensation Committee has a number of functions and responsibilities as delineated in its written charter, which is reviewed by the committee on an annual basis, and by the Board of Directors as appropriate. A current copy of the Compensation Committee charter is available on our website at www.bsquare.com on the Corporate Governance page under Management and Corporate Governance - Board Committees and Charter Documents.\nOne of the primary responsibilities of the Compensation Committee is to oversee, and make recommendations to the Board of Directors for its approval of, the compensation programs and performance of our executive officers, which includes the following activities:\n●\nEstablishing the objectives and philosophy of the executive compensation programs;\n●\nDesigning and implementing the compensation programs;\n●\nEvaluating the performance of executives relative to their attainment of goals under the programs and reporting its evaluation to the Board of Directors;\n●\nDeveloping and maintaining a succession plan for the Chief Executive Officer;\n●\nCalculating and establishing payouts and awards under the programs as well as discretionary payouts and awards;\n●\nReviewing base salary levels and equity ownership of the executives; and\n●\nEngaging consultants from time to time, as appropriate, to assist with program design and related matters.\nAdditional information regarding the roles, responsibilities, scope and authority of the Compensation Committee, as well as the extent to which the Committee may delegate its authority, the role that our executive officers serve in recommending compensation and the role of compensation consultants in our compensation process is set forth under",
    "item_11": "Item 11.\nExecutive Compensation\n2020 Director Compensation\nWhen joining the Board, we historically granted directors a one-time grant of 25,000 stock options, which vest quarterly over two years, and an initial grant of restricted stock units, or RSUs. The Chairman of the Board historically received a one-time grant of 50,000 stock options when joining the Board (or 25,000 stock options if appointed as Chairman of the Board while already serving as a director), and an initial grant of restricted stock units. The number of shares underlying the initial restricted stock unit awards granted to new directors is determined by dividing $50,000 by our closing stock price on the date of grant (or $75,000 in the case of the Chairman of the Board (or $25,000 if appointed as Chairman of the Board while already serving as a director)) and is prorated based on the date on which such director is appointed. Thereafter, standing directors receive annual grants of restricted stock units, the number of shares underlying which is determined by dividing $50,000 by our closing stock price on the date of grant ($75,000 in the case of the Chairman of the Board). Starting in 2021, we eliminated the option component of director compensation and established a floor price of $3.25 for all RSUs awarded to directors. The annual restricted stock unit awards are granted on the earlier of (i) the day of the annual meeting of our shareholders or (ii) the last trading day of our second fiscal quarter. The restricted stock unit awards vest quarterly over one year. All equity awards cease vesting as of the date a director’s service on the Board terminates for any reason, provided that the Board may accelerate the vesting of any outstanding stock award for a director whose service on the Board terminates for any reason other than removal for cause.\nWe also pay annual cash director fees of $30,000 to non-Chair directors and $40,000 to the Chairman of the Board, and annual Board Committee fees to directors who serve on the Audit Committee of $10,000 and $5,000 to directors who serve on other committees. The Chairs of the Governance and Nominating Committee and the Compensation Committee receive additional annual Board Committee fee compensation of $3,000. The Board of Directors may also determine to pay these cash amounts in RSUs, subject to a floor price of $3.25 per RSU. All cash amounts are payable in quarterly increments. Directors are also reimbursed for reasonable expenses incurred for Board-related activities. Notwithstanding the foregoing, directors who are also our employees, including Mr. Derrickson, our President and Chief Executive Officer, do not receive additional compensation for services provided as a director.\nThe table below presents the 2020 compensation of our non-employee directors. The compensation of Ralph C. Derrickson, a director and President and Chief Executive Officer, is described later in this Item 11 “Executive Officer Compensation.”\nDirector Compensation Table\nName\nFees Earned or Paid in Cash (1)\nStock Awards (2)\nOption Awards (3)\nTotal\nRobert J. Chamberlain (4)\n$40,000\n$50,000\n$-\n$90,000\nDavin W. Cushman (5)\n46,889\n50,000\n-\n96,889\nAndrew S.G. Harries (6)\n55,000\n75,000\n-\n130,000\nMary Jesse (7)\n48,000\n50,000\n-\n98,000\nRobert J. Peters (8)\n35,000\n50,000\n-\n85,000\nRyan Vardeman (9)\n35,000\n50,000\n-\n85,000\n(1) Fees paid earned or paid in cash are composed of payments for services performed in each prior quarter.\n(2) The amounts in this column reflect the aggregate grant-date fair value of restricted stock unit awards, determined in accordance with the Financial Accounting Standards Board Accounting Standards Codification Topic 718 for stock-based compensation (“Topic 718”) without regard to forfeitures. The amounts included reflect only the awards treated as granted in 2020. Assumptions used in the calculation of these award amounts are set forth in Note 11 (Shareholders’ Equity) to the financial statements included in Part II, Item 8 of this Annual Report on Form 10-K.\n(3) The amounts in this column reflect the aggregate grant-date fair value of stock option awards, determined in accordance with Topic 718 without regard to forfeitures. The amounts included reflect only the awards treated as granted in 2020. Assumptions used in the calculation of these award amounts are set forth in Note 11 (Shareholders’ Equity) to the financial statements included in Part II, Item 8 of this Annual Report on Form 10-K.\n(4) Mr. Chamberlain held 25,000 vested stock options and 25,338 unreleased restricted stock units as of December 31, 2020.\n(5) Mr. Cushman was appointed to our Board in November 2018 and held 25,000 vested stock options and 25,338 unreleased restricted stock units as of December 31, 2020.\n(6) Mr. Harries held 25,000 vested stock options and 38,007 unreleased restricted stock units as of December 31, 2020.\n(7) Ms. Jesse held 25,000 vested stock options and 25,338 unreleased restricted stock units as of December 31, 2020.\n(8) Mr. Peters was appointed to our Board in August 2018 and held 25,000 vested stock options and 25,338 unreleased restricted stock units as of December 31, 2020.\n(9) Mr. Vardeman was appointed to our Board in June 2018 and held 25,000 vested stock options and 25,338 unreleased restricted stock units as of December 31, 2020.\n2020 Executive Officer Compensation\nThe following table sets forth the compensation earned during the past two fiscal years by Ralph C. Derrickson, our President and Chief Executive Officer, and Christopher Wheaton, our Chief Financial Officer, Chief Operating Officer, Secretary and Treasurer. We did not have any other executive officers during 2020. We refer to these persons as our “named executive officers.”\nSummary Compensation Table\nName and Principal Position\nYear\nSalary\nBonus\nStock Awards (1)\nOption Awards (2)\nAll Other Compensation (3)\nTotal\nRalph C. Derrickson\n$325,000\n$-\n$-\n$-\n$34,673\n$359,673\nPresident and Chief Executive Officer\n256,250\n-\n-\n1,108,125\n9,111\n$1,373,486\nChristopher V. Wheaton\n275,000\n-\n-\n34,500\n18,723\n$328,223\nChief Financial Officer, Chief Operating Officer, Secretary and Treasurer\n72,981\n-\n-\n164,050\n3,938\n$240,969\n(1)\nThe amounts in this column reflect the aggregate grant-date fair value of restricted stock unit awards, determined in accordance with Topic 718 without regard to forfeitures. The amounts included for a particular year reflect only the awards treated as granted in that year. Assumptions used in the calculation of these award amounts are set forth in Note 11 (Shareholders’ Equity) to the financial statements included in Part II, Item 8 of our 2020 10-K.\n(2)\nThe amounts in this column reflect the aggregate grant-date fair value of stock option awards, determined in accordance with Topic 718 without regard to forfeitures. The amounts included for a particular year reflect only the awards treated as granted in that year. Assumptions used in the calculation of these award amounts are set forth in Note 11 (Shareholders’ Equity) to the financial statements included in Part II, Item 8 of our 2020 10-K.\n(3)\nRepresents 401(k) matching employer contributions, premiums paid by us under a group medical or life insurance plan, and any other allowances for parking and mobile telephone / data service, which includes personal use.\nEmployment Agreements with Named Executive Officers\nWe have agreements with our named executive officers, which include provisions regarding post-termination compensation. We do not have a formal severance policy or plan applicable to our executive officers as a group.\nUnder our agreement with Mr. Derrickson entered into in February 2019, Mr. Derrickson is entitled to receive an annual salary of $325,000 and is eligible to receive an annual bonus equal to 50% of his annual salary at 100% achievement. He also received an option to purchase 562,500 shares of common stock. In the event Mr. Derrickson’s employment is terminated by us when neither cause nor long term disability exists (as such terms are defined in the agreement), subject to execution of a release by Mr. Derrickson of any employment-related claims, he shall be entitled to receive severance equal to nine months of his then annual base salary, continued COBRA coverage at our expense for a period of nine months following his termination date and a pro rata portion of his annual bonus as determined by the Compensation Committee. In the event that, within twelve months after a change of control of Bsquare (as defined in the agreement), Mr. Derrickson’s employment is terminated when neither cause nor long term disability exists or Mr. Derrickson terminates his employment for good reason (as defined in the agreement), subject to execution of a release by Mr. Derrickson of any employment-related claims, he shall be entitled to receive a one-time lump sum severance payment equal to twelve months of his then annual base salary, 100% of his target annual bonus as determined by the Compensation Committee, and continued COBRA coverage at our expense for a period of twelve months following his termination date (provided that, during the first twelve months after a change of control of Bsquare, such severance payments shall be in lieu of the severance payments described in the preceding sentence, and after expiration of the twelve -month period following a change of control, Mr. Derrickson shall thereafter only be entitled to the severance payments described in the preceding sentence). In addition, immediately prior to a change of control of Bsquare, all of Mr. Derrickson’s unvested stock options and restricted stock units shall become fully vested and immediately exercisable.\nUnder our agreement with Mr. Wheaton entered into in August 2019, Mr. Wheaton is entitled to receive an annual salary of $275,000 and is eligible to receive an annual bonus of $100,000 at 100% achievement. He also received an option to purchase 129,173 shares of our common stock. In the event that, within twelve months after a change of control of Bsquare (as defined in the agreement), Mr. Wheaton’s employment is terminated when neither cause nor long term disability exists or Mr. Wheaton terminates his employment for good reason (as defined in the agreement), subject to execution of a release by Mr. Wheaton of any employment-related claims, he shall be entitled to receive a one-time lump sum severance payment equal to six months of his then annual base salary, 100% of his target annual bonus as determined by the Compensation Committee, and continued COBRA coverage at our expense for a period of six months following his termination date. In addition, immediately prior to a change of control of Bsquare, all of Mr. Wheaton’s unvested stock options shall become fully vested and immediately exercisable.\nDetermination of Compensation\nThe Compensation Committee’s philosophy regarding total executive compensation has been to provide a comprehensive and competitive compensation package consisting of base salary and performance-based incentives that help align executive compensation with shareholder interests and promote growth in shareholder value. The Compensation Committee believes total executive compensation is below market peer median levels. We also periodically review the level of incentive-based compensation for each member of our executive team. We intend to maintain competitive levels of compensation for our management team. In 2021, we determined to award performance-based RSUs in lieu of annual cash bonuses, vesting based on stock performance and service conditions.\nTotal Compensation\nFor purposes of evaluating executive officer total compensation, the Compensation Committee primarily considers two factors:\n●\nCompetitive level: The Compensation Committee has the authority to engage its own advisers to assist in carrying out its responsibilities. The Compensation Committee has from time to time historically engaged a compensation consultant to review and assess the market competitiveness of our executive compensation programs.\n●\nCompany and individual performance objectives: In addition to considering compensation levels of executives at similarly sized regional public companies, the Compensation Committee reviews our financial and non-financial performance objectives applicable to each executive. Our performance objectives are typically determined through collaboration with the Chief Executive Officer, the Board of Directors and the Compensation Committee. The Compensation Committee determines the financial and non-financial performance objectives applicable to the Chief Executive Officer (without his participation). These objectives and associated awards have historically been addressed through annual cash or equity bonuses with respect to our executive officers.\nBase Salary and Discretionary Bonus\nThe Compensation Committee’s goal is to provide a competitive base salary for our executive officers. The Compensation Committee has not established any formal guidelines for purposes of setting base salaries (such as payment at a particular percentile of a benchmark group), but instead considers the general market compensation data along with our performance and the individual’s performance and experience in determining what represents a competitive salary. The Compensation Committee also considers these factors in its recommendations to the Board of Directors regarding whether and in what amounts to award discretionary cash or equity bonuses.\nShort-Term Incentive Plan Compensation (STI)\nWe have historically awarded short-term incentive compensation to our named executive officers, including annual cash or equity bonuses, the terms of which vary from year to year.\nIn March 2020, upon the recommendation of the Compensation Committee, our Board of Directors adopted the Bsquare Corporation Executive Bonus Plan (“EBP”), which formalized the Company’s historical practice of awarding annual bonuses to certain key executives of the Company based on achievement of specified performance goals. Awards may be in the form of cash or equity granted under the Stock Plan. The Board designated the Committee as the administrator of the EBP (the “Administrator”). The Administrator may establish performance goals that relate to financial, operational or other performance of the Company, or to any other performance goal established by the Administrator in connection with a potential bonus payment (the “Performance Goals”). Pursuant to the EBP, the Administrator established Performance Goals for 2020 relating to segment revenues and contribution margin and working capital levels. Following completion of the 2020 Performance Period, the amounts payable to each Covered Executive under the EBP will be based entirely on the determination of the Administrator regarding the level of achievement of the Performance Goals. The Administrator has authority to revise or refine the Performance Goals in its discretion. The EBP was also reassessed and restructured to more tightly align compensation with both short- and long-term shareholder interests and to be responsive to prior shareholder advisory votes on executive compensation.\nLong-Term Equity Incentive Awards (LTI)\nLonger-term incentives in the form of grants of stock options, restricted stock, RSUs and other forms of equity instruments to executive officers are governed by the Stock Plan or our 2011 Inducement Award Plan (the “Inducement Plan”), as applicable.\nThe Compensation Committee grants stock options and other forms of equity incentive compensation to our executive officers under the Stock Plan or Inducement Plan. Stock options have historically been granted at the time of hire of an executive officer under the Inducement Plan, although we stopped using the Inducement Plan in 2019. Further, the Compensation Committee periodically reviews the equity ownership of the executive officers and may determine that additional awards of equity instruments under the Stock Plan are warranted based on a number of factors, including competitive factors, company and individual performance, the vested status of currently outstanding equity awards, the executive’s equity ownership in relation to that of other executives and other factors. The Compensation Committee maintains no formal guidelines for these periodic reviews. Stock options are awarded with exercise prices equal to the closing market price per share of our common stock on the grant date. Our only equity award to executive officers in 2020 was an August 2020 award to Mr. Wheaton of options to acquire 25,000 shares of our common vesting, which vests 25% on the one-year anniversary and the balance in equal monthly installments for three years thereafter.\nOther Compensation and Perquisites\nExecutive officers, including the named executive officers, are eligible to participate in standard benefit plans available to all employees including our 401(k)-retirement plan, medical, dental, disability, vacation and sick leave and life and accident insurance. The same terms apply to all employees for these benefits except where the value of the benefit may be greater for executives because they are more highly compensated than most other employees (e.g., disability benefits). We do not provide any pension or deferred compensation benefits to our executive officers.\nOutstanding Equity Awards at Fiscal Year End\nThe following table presents the outstanding equity awards held by the named executive officers as of December 31, 2020:\nNumber of Securities Underlying Unexercised Options\nName\nGrant Date\nExercisable (#)\nUnexercisable (#)\nOption Exercise Price (1)\nOption Expiration Date (2)\nRalph C. Derrickson\n03/11/19\n164,063\n210,937\n$1.97\n03/11/29\n03/11/19\n-\n187,500\n1.97\n03/11/29\nChristopher V. Wheaton\n09/09/19\n40,367\n88,806\n1.27\n09/09/29\n08/26/20\n-\n25,000\n1.38\n08/26/30\n(1)\nThe option exercise price is the closing price of our common stock on the grant date.\n(2)\nAll options outstanding expire ten years from the grant date.\nEmployee Benefit Plans\n401(k) Plan\nWe maintain a tax-qualified 401(k) employee savings and retirement plan for eligible U.S. employees. Eligible employees may elect to defer a percentage of their eligible compensation in the 401(k) plan, subject to the statutorily prescribed annual limit. We may make matching contributions on behalf of all participants in the 401(k) plan in the amount equal to one-half of the first 6% of an employee’s contributions. Company matching contributions and employee contributions are fully vested at all times. We intend the 401(k) plan to qualify under Sections 401(k) and 501 of the Internal Revenue Code of 1986, as amended, so that contributions by employees or us to the 401(k) plan and income earned, if any, on plan contributions are not taxable to employees until withdrawn from the 401(k) plan (except as regards Roth contributions), and so that we will be able to deduct our contributions when made. The trustee of the 401(k) plan, at the direction of each participant, invests the assets of the 401(k) plan in any of a number of investment options.",
    "item_12": "Item 12.\nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nEquity Compensation Plan Information\nThe following table presents certain information regarding our common stock that may be issued upon the exercise of options and vesting of restricted stock units granted to employees, consultants or directors as of December 31, 2020:\nNumber of securities to be issued upon exercise of outstanding options, warrants and rights (a)\nWeighted-average exercise price of outstanding options, warrants and rights (b)\nNumber of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in column (a) (c)\nEquity compensation plans approved by security holders\n1,215,140 (1)\n$ 1.84\n954,355\nEquity compensation plans not approved by security holders\n736,448 (2)\n1.93\n287,770 (3)\n(1)\nAmount includes 164,697 restricted stock units granted and unvested as of December 31, 2020.\n(2)\nAmount includes no restricted stock units granted and unvested as of December 31, 2020.\n(3)\nIndicates shares of our common stock reserved for future issuance under the Inducement Plan. The Inducement Plans allow us to grant options, restricted stock, restricted stock units and certain other equity-based compensation in connection with hiring new employees. The number of shares reserved for issuance may be modified by the Board of Directors, subject to SEC and NASDAQ limitations. There were 791,673 options and no restricted stock units granted under the Inducement Plan during 2019. Following these awards, we determined to stop using the Inducement Plan in 2019.\nThe following table sets forth certain information regarding the beneficial ownership of our common stock as of February 28, 2021 by:\n●\neach person who is known by us to own beneficially more than five percent (5%) of the outstanding shares of common stock;\n●\neach of our directors;\n●\neach of the named executive officers; and\n●\nall of our directors and executive officers as a group.\nBeneficial ownership is determined in accordance with the rules of the SEC. The number of shares listed below under the heading “Total Common Stock Equivalents” is the aggregate beneficial ownership for each shareholder and includes common stock owned plus settled RSUs; the number of shares listed under the heading \"Deemed Outstanding Shares\" includes vested stock options plus unvested options and restricted stock units that may be exercised or settled for common stock within 60 days after February 28, 2020. Deemed Outstanding Shares are considered beneficially owned by the holder for the purpose of computing share and percentage ownership of that holder presented below, but are not treated as outstanding for the purpose of computing the percentage ownership of any other holder presented below.\nThis table is based on information supplied by officers, directors, and filings made with the SEC. Percentage ownership is based on 13,298,150 shares of common stock outstanding as of February 28, 2020.\nUnless otherwise noted below, the address for each shareholder listed below is c/o Bsquare Corporation, 1415 Western Avenue, Suite 700, Seattle, Washington 98101. Unless otherwise noted, each of the shareholders listed below has sole investment and voting power with respect to the common stock indicated, except to the extent shared by spouses under applicable law.\nName and Address of Beneficial Owner\nTotal Common Stock\nDeemed Outstanding Shares\nPercentage of Common Stock Equivalents\n5% Owners:\nPalogic Value Management, L.P (1)\n1,585,711\n-\n11.9 %\nHarvest Hill Road, Suite 110\nDallas, TX 75230\nRenaissance Technologies LLC (2)\n1,134,531\n-\n8.5 %\n800 Third Avenue\nNew York, NY 10022\nDirectors and Named Executive Officers:\nRyan Vardeman (3)\n1,653,992\n33,446\n12.7 %\nAndrew S.G Harries\n298,290\n37,669\n2.5 %\nRalph C. Derrickson\n35,000\n246,094\n2.1 %\nRobert J. Chamberlain\n93,871\n33,446\n1.0 %\nDavin Cushman\n86,700\n33,446\n0.9 %\nMary Jesse\n86,440\n33,446\n0.9 %\nRob Peters (4)\n71,046\n33,446\n0.8 %\nChristopher V. Wheaton\n15,000\n51,132\n0.5 %\nAll executive officers and directors as a group\n2,340,339\n502,125\n20.6 %\n(1)\nThe indicated ownership is based solely on SEC Form 4, filed with the SEC on August 28, 2020, according to which Palogic Value Management, L.P., Palogic Value Fund, L.P., Palogic Capital Management, LLC and Mr. Vardeman then had shared voting and dispositive power such shares.\n(2)\nThe indicated ownership is based solely on a Schedule 13G/A filed with the SEC on February 11, 2021 (the “RT 13G/A”) according to which each of Renaissance Technologies LLC and Renaissance Technologies Holdings Corporation has sole voting power and dispositive power over such shares.\n(3)\nMr. Vardeman is a principal of and may be deemed to beneficially own securities beneficially owned by Palogic Capital Management.\n(4)\nMr. Peters is a principal of Palogic Capital Management but does not have dispositive or voting power over shares beneficially owned by Palogic Capital Management.",
    "item_13": "Item 13.\nCertain Relationships and Related Transactions, and Director Independence\nRelated Party Transactions\nThere were no transactions since January 1, 2020, nor are there any proposed transactions, as to which the amount involved exceeds $120,000 and in which any related person has or will have a direct or indirect material interest, other than equity and other compensation, termination and other arrangements which are described above under the headings “2020 Director Compensation” and “2020 Executive Officer Compensation.”\nDirectors Independence\nSee “Board of Director Independence” set forth in Item 10.",
    "item_14": "Item 14.\nPrincipal Accounting Fees and Services\nAudit Fees\nWe paid Moss Adams audit fees of $260,108 and $272,840 during the years ended December 31, 2020 and 2019, respectively. These audit fees related to professional services rendered in connection with the audit of our annual consolidated financial statements, the reviews of the consolidated financial statements included in each of our quarterly reports on Form 10-Q and accounting services that relate to the audited consolidated financial statements and are necessary to comply with generally accepted auditing standards.\nAudit-Related Fees\nThere were no fees billed for fiscal years 2020 or 2019 for assurance and related services by Moss Adams that were reasonably related to the performance of its audit of our financial statements and not reported under the caption “Audit Fees.”\nTax Fees\nThere were no fees billed for fiscal years 2019 or 2018 for tax compliance, tax advice or tax planning services rendered to us by Moss Adams.\nAll Other Fees\nWe paid Moss Adams $38,143 and $40,573 during 2020 and 2019, respectively, for fees associated with a SOC Type-2 examinations and other administrative fees.\nPART IV",
    "item_15": "Item 15.\nExhibits, Financial Statement Schedules\n(a) Financial Statements and Schedules\n1. Financial Statements\nSee “Index to Consolidated Financial Statements” in Part II Item 8 of this report.\n2. Financial Statement Schedules\nFinancial statement schedules not included herein have been omitted because they are either not required, not applicable, or the information is otherwise included herein.\n3. Exhibits\nExhibits are incorporated herein by reference or are filed with this report as indicated below.\n(b) Exhibits\nFiled or\nIncorporated by Reference\nExhibit\nNumber\nDescription\nFurnished\nHerewith\nForm\nFiling Date\nExhibit\nFile No.\n3.1\nAmended and Restated Articles of Incorporation\nS-1\n8/17/1999\n3.1\n(a)\n333-85351\n3.1(a)\nArticles of Amendment to Amended and Restated Articles of Incorporation\n10-Q\n8/7/2000\n3.1\n000-27687\n3.1(b)\nArticles of Amendment to Amended and Restated Articles of Incorporation\n8-K\n10/11/2005\n3.1\n000-27687\n3.2\nAmended and Restated Bylaws\n8-K\n8/11/2020\n3.2\n000-27687\n4.1\nDescription of Capital Stock\n10-K\n2/25/2020\n4.1\n000-27687\n10.1(1)\nFourth Amended and Restated Stock Plan, as amended\nS-8\n8/8/2017\n4.1\n333-219799\n10.1(a)(1)\nForm of Stock Option Agreement\n10-Q\n8/9/2012\n10.19\n(a)\n000-27687\n10.1(b)(1)\nForm of Restricted Stock Grant Agreement\n10-Q\n8/9/2012\n10.19\n(b)\n000-27687\n10.1(c)(1)\nForm of Restricted Stock Unit Agreement\n10-Q\n8/9/2012\n10.19\n(c)\n000-27687\n10.2(1)\n2011 Inducement Award Plan\n10-Q\n11/10/2011\n10.1\n000-27687\n10.2(a)(1)\nForm of Stock Option Agreement under the 2011 Inducement Award Plan\n10-Q\n11/10/2011\n10.1\n(a)\n000-27687\n10.2(b)(1)\nForm of Restricted Stock Unit Agreement under the 2011 Inducement Award Plan\n10-K\n2/19/2015\n10.2\n(b)(1)\n000-27687\n10.3(1)\nExecutive Bonus Plan\n8-K\n3/20/2020\n10.1\n000-27687\n10.4(1)\nForm of Indemnification Agreement\n10-K\n2/21/2017\n10.3\n000-27687\n10.5\nMarket Square Office Lease between 1415 Western LLC and Bsquare Corporation\nX\n10.6(1)\nEmployment letter agreement with Ralph Derrickson dated February 4, 2019\n10-K\n2/25/2020\n10.11\n000-27687\n10.7(1)\nEmployment letter agreement with Christopher Wheaton dated August 20, 2019\n8-K\n8/23/2019\n10.1\n000-27687\n10.8(2)\nMicrosoft OEM Distribution Agreement for Software Products for Embedded Systems with Microsoft Licensing, GP effective July 1, 2014\n10-Q\n8/14/2014\n10.1\n000-27687\n10.9\nBoard Observer Agreement with Palogic Value Fund, L.P, Palogic Value Management, L.P. and Palogic Capital Management, LLC dated June 25, 2018\n8-K\n6/26/2018\n10.1\n000-27687\n10.10\nPromissory note, dated as of April 7, 2020 with JPMorgan Chase Bank, N.A.\n8-K\n4/16/2020\n10.1\n000-27687\n21.1\nSubsidiaries of the registrant\nX\n23.1\nConsent of Independent Registered Public Accounting Firm\nX\n31.1\nCertification of Chief Executive Officer pursuant to Exchange Act Rule 13a-14(a) under the Securities and Exchange Act of 1934\nX\n31.2\nCertification of Chief Financial Officer pursuant to Exchange Act Rule 13a-14(a) under the Securities and Exchange Act of 1934\nX\nFiled or\nIncorporated by Reference\nExhibit\nNumber\nDescription\nFurnished\nHerewith\nForm\nFiling Date\nExhibit\nFile No.\n32.1\nCertification of Chief Executive Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n32.2\nCertification of Chief Financial Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n101.INS\nXBRL Instance Document\nX\n101.SCH\nXBRL Taxonomy Extension Schema Document\nX\n101.CAL\nXBRL Taxonomy Extension Calculation Document\nX\n101.DEF\nXBRL Taxonomy Extension Definitions\nX\n101.LAB\nXBRL Taxonomy Extension Label Document\nX\n101.PRE\nXBRL Taxonomy Extension Presentation Document\nX\n(1)\nIndicates a management contract or compensatory plan or arrangement.\n(2)\nConfidential treatment has previously been granted by the SEC for certain portions of the referenced exhibit.\nItem 16.\nForm 10-K Summary\nNot applicable.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nBSQUARE CORPORATION\nDate:\nMarch 18, 2021\nBy:\n/S/ RALPH C. DERRICKSON\nRalph C. Derrickson\nPresident and Chief Executive Officer\nDate:\nMarch 18, 2021\nBy:\n/S/ CHRISTOPHER WHEATON\nChristopher Wheaton\nChief Financial and Operating Officer, Secretary and Treasurer\nPOWER OF ATTORNEY\nEach person whose individual signature appears below hereby authorizes and appoints Ralph C. Derrickson and Christopher Wheaton, and each of them, with full power of substitution and resubstitution and full power to act without the other, as his true and lawful attorney-in-fact and agent to act in his name, place and stead and to execute in the name and on behalf of each person, individually and in each capacity stated below, and to file, any and all amendments to this report, and to file the same, with all exhibits thereto, and other documents in connection therewith, with the Securities and Exchange Commission, granting unto said attorneys-in fact and agents, and each of them, full power and authority to do and perform each and every act and thing, ratifying and confirming all that said attorneys-in-fact and agents or any of them or their or his substitute or substitutes may lawfully do or cause to be done by virtue thereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on March 18, 2021, on behalf of the registrant and in the capacities indicated.\nSignature\nTitle\n/S/ Ralph C. Derrickson\nPresident and Chief Executive Officer\nRalph C. Derrickson\n(Principal Executive Officer)\n/S/ Christopher Wheaton\nChief Financial and Operating Officer, Secretary and Treasurer\nChristopher Wheaton\n(Principal Financial Officer)\n/S/ Andrew S. G. Harries\nChairman of the Board\nAndrew S. G. Harries\n/S/ Robert J. Chamberlain\nDirector\nRobert J. Chamberlain\n/S/ Davin W. Cushman\nDirector\nDavin W. Cushman\n/S/ Mary Jesse\nDirector\nMary Jesse\n/S/ Robert J. Peters\nDirector\nRobert J. Peters\n/S/ Ryan L. Vardeman\nDirector\nRyan L. Vardeman"
}