{
    "cik": "1056696",
    "company": "MANHATTAN ASSOCIATES INC",
    "filing_type": "10-K",
    "filing_date": "2021-02-05",
    "period_of_report": "2020-12-31",
    "sic": "7372",
    "state_of_inc": "GA",
    "state_location": "GA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1056696/0001564590-21-004542-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1056696/000156459021004542/manh-10k_20201231.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1056696/0001564590-21-004542.txt",
    "filename": "1056696_10K_2020_0001564590-21-004542.htm",
    "item_1": "Item 1.\nBusiness\nOverview\nManhattan Associates was founded in 1990 in Manhattan Beach, California and incorporated in Georgia in 1998. References in this filing to the “Company,” “Manhattan,” “Manhattan Associates,” “we,” “our” and “us” refer to Manhattan Associates, Inc., our predecessors, and our wholly-owned and consolidated subsidiaries. Our principal executive offices are located at 2300 Windy Ridge Parkway, Tenth Floor, Atlanta, Georgia 30339, and our telephone number is 770-955-7070.\nWe develop, sell, deploy, service and maintain software solutions designed to manage supply chains, inventory and omnichannel operations for retailers, wholesalers, manufacturers, logistics providers and other organizations. Our customers include many of the world’s premier and most profitable brands.\nSpecifically, Manhattan Associates develops modern commerce solutions that help its customers in three distinct areas of their business:\n•\nSupply Chain - We provide companies the tools needed to manage distribution and optimize transportation costs throughout their entire commercial network. Manhattan’s Warehouse Management solutions are widely regarded as industry-leading systems designed to optimize productivity and throughput in distribution centers and warehouses around the world. Our software helps optimize fulfillment models to support our customers across a wide range of channels and fulfillment methods. Likewise, we provide shippers and carriers the most comprehensive transportation management solutions in the market. This includes software to help them move freight via the most cost-effective means possible while also meeting service-level expectations, to model their transportation network, and to automate the procurement-to-pay process.\n•\nOmnichannel - Meeting ever-evolving consumer expectations of service, inventory availability, and delivery convenience is a challenge every merchant must meet head on. Manhattan’s Omnichannel solutions provide an operating platform for digital commerce, retailers, and wholesale businesses. Comprising Order Management, Store Inventory Fulfillment, Call Center, Point of Sale, and Customer Engagement as its core applications, Manhattan Omnichannel solutions provide CRM capabilities for contact center agents; end-to-end process enablement for store associates, and enterprise-wide inventory availability determination, order fulfillment optimization, and point of sale capabilities.\n•\nInventory - Manhattan’s solutions provide distributors of finished goods (apparel, food, auto parts, pharmaceuticals, etc.) the ability to forecast demand, determine when, where and how much inventory is needed, and translate this into a profitable inventory buying plan. These areas are ever more complex and critical to profitability as more wholesalers and retailers engage in omnichannel operations. Through the use of advanced science and sophisticated analytics, customer service level is maximized with the minimum necessary inventory investment. Industry changes driven by omnichannel retail, pharmaceutical regulations and other trends make this an area of particular need for many retailers and wholesale distributors.\nManhattan Associates’ Software Solution Portfolios\nOur portfolio of solutions takes a platform-based approach to key areas. This approach employs a holistic technology approach that provides customers with three major benefits:\n•\nIndustry Leading Feature Function - Manhattan solutions are consistently rated by customers and industry analysts alike as providing the most comprehensive and innovative feature function in the market. From warehouse management to point of sale, our solutions are consistently at the top of the market with respect to configurability, capability and usability. Customers choose Manhattan applications to solve the industry’s most complex supply chain problems. Our combination of deep domain expertise, an in-house data science and operations research team, and a specialized user experience team combine to differentiate Manhattan solutions.\n•\nSolution Unification - Manhattan solutions are organized into three groups: omni-channel, supply chain, and inventory. Each one of these groups are engineered to provide cross-application benefit that simplifies and improves operations within those three areas. This approach significantly reduces complexity, maintenance and application risk for our customers which provides an expanded set of so-called end-to-end capabilities. As complexity continues to grow for our customers, Manhattan provides value by eliminating the need to design, build and maintain complex system to system integration.\n•\nDelivered on a Cloud Native Platform - The Manhattan Active application architecture is highly differentiated amongst enterprise application providers, particularly within the Supply Chain category. Our microservice based architecture delivers both a versionless yet highly extensible experience for our customers. We offer our customers access to new innovation on a\nquarterly basis, ensuring all customers are running on a single fully up-to-date codebase. Manhattan Active also provides zero downtime updates, so access to innovation is delivered seamlessly into customer environments without the need for planned maintenance windows.\nSupply Chain Solutions\nAs previously described, Manhattan’s Supply Chain Solutions are focused on the distribution and transportation operations of the enterprise. There are three main components of Manhattan’s Supply Chain Solutions:\n•\nDistribution Management - These applications comprise Manhattan’s Warehouse Management Solutions (WMS) commonly used to manage the complexity of the modern distribution center. WMS manages the flow of goods and information across the distribution center. WMS is now delivered for new and upgrading customers in the form of Manhattan Active Warehouse Management (WM), a truly cloud native and versionless application which delivers new innovation on a quarterly basis. Manhattan Active WM runs on Google Cloud Platform, is offered exclusively via subscription, and includes state of the art fulfillment optimization technology; a consumer grade mobile app experience for the associate; and embedded gamification capabilities to improve associate engagement and performance. Manhattan Active WM is fully configurable and technically extensible, meaning customers can build their own componentry to work alongside our base application. Manhattan Active WM embeds labor management and slotting capabilities. Manhattan’s WMS customers can benefit from its embedded warehouse execution system that coordinates the interaction between automation, robotics and labor for maximum efficiency. Manhattan’s WMS also enables the efficient utilization of a single distribution center for direct-to-consumer, retail replenishment and high-volume wholesale fulfilment. Our WMS provides the customer the most productive operation that can scale to meet the highest demands during peak season yet can still operate effectively and profitably throughout the course of the year.\n•\nTransportation Management - Organizations today face a complex transportation environment with ever-changing demands driven by macro-economic trends and governmental regulations. Manhattan’s Transportation Management Solutions (TMS) are designed to help shippers navigate their way through these demands while meeting customer service expectations at the lowest possible freight costs. TMS components include procurement and modeling tools to setup a successful network, along with planning, execution and settlement tools to manage day-to-day transportation requirements. Our TMS can also connect shippers with a network of partners that can increase shipping capacity on an as-needed basis. Manhattan Carrier is a suite of solutions built specifically to help motor carriers optimize load assignments, minimize fuel costs, manage drivers’ hours of service and accommodate demand fluctuations.\n•\nVisibility - Crucial to effective supply chain management is visibility into the movement of goods between locations in the supply chain and outside the enterprise’s realm of control. Manhattan provides best in class visibility and event management tools that not only provide alerts to when events occur in the global supply chain, but also when they don’t occur (such as missing a vessel overseas) that can have a cascading effect on production lines, freight and most importantly, customer commitments.\nManhattan SCALETM (SCALE)\nSCALE is our portfolio of logistics execution solutions built on Microsoft’s .NET® platform. Purpose built for rapid development and a value-based total cost of ownership, it is targeted toward companies with execution-focused supply chain needs that require speed-to-value, resource-light system configuration and maintenance, and the ability to quickly scale their logistics operations up or down in response to market fluctuations or business requirement changes. SCALE combines the features of Trading Partner Management, Yard Management, Optimization, Warehouse Management and Transportation Execution.\nBecause SCALE leverages a common platform, solutions share common data elements and each user can access all applications through a single sign-on. Users also can set up “dashboards” that enable easy access to real-time information most relevant to their jobs. SCALE’s ease of deployment, operation and support make it a popular choice for organizations operating in countries with emerging and developing economies, and where technical support resources are limited.\nSCALE is now also available as Manhattan Active SCALE, delivered in the cloud on Microsoft’s Azure platform. Manhattan Active SCALE customers receive new capability on an annual basis and enjoy full configurability and elements of technical extensibility even when delivered on Azure. SCALE continues to be offered on premise via perpetual license and on a subscription basis as part of Manhattan Active SCALE.\nOmnichannel Solutions\nAs omnichannel retail has placed new demands on organizations, it has also created new software solution needs. These range from the ability to leverage inventory across the entire network to meet any demand, to providing store associates and call center representatives the means to take advantage of the available inventory. Our Manhattan Active™ Omni set of solutions brings together Order Management, Store Inventory & Fulfillment, Point of Sale and Customer Engagement tools into a single application built on a shared, cloud-native, microservices platform. This architecture enables our customers to more easily\nexpand their systems to include more capabilities and quarterly product enhancements while always maintaining their customizations.\n●\nEnterprise Omnichannel Solutions - There is a wide range of new capabilities that must be leveraged at a corporate or ‘central’ level in retail today in order to enable best in class customer service, full inventory visibility, direct to client distribution and seamless fulfillment operations. The goal is to enable an omnichannel commerce platform that can be tapped into by any selling system-webstore, ERP, point-of-sale, call center, mobile app, etc. in order to more cost-effectively fulfill orders and inventory demand. Manhattan’s Enterprise Inventory builds out a complete inventory availability picture that can be updated in near-real time with feeds from the warehouse, the store and the network. Enterprise Order Management merges this inventory availability data with demand feeds from across the organization to match supply with demand in a way that satisfies customer delivery expectations while also striving to maximize revenue and profitability. Finally, Manhattan offers a unique Customer Engagement solution that enables contact center associates to see a holistic view of the customer, as well as a complete customer sales and interaction history to better satisfy shopper needs while optimizing potential revenue and profit opportunities, regardless of whether it is an exchange, a return or a new order.\n●\nOmnichannel Solutions for the Store - As the consumer enters the store with more information than ever, it is vital to equip the sales associate with relevant information and capabilities to satisfy that shopper’s every demand. Store solutions include Point of Sale, available on mobile and fixed stations, to process purchase transactions and Clienteling to provide the associate with a complete picture of the shopper’s purchase history. Manhattan brings these solutions together on a single mobile platform to enable retailers to offer unparalleled service and convenience for the shopper.\nAnother important part of the Manhattan Active store offering is Store Inventory and Fulfillment. Most retailers are now looking to leverage store inventory to fulfill ecommerce demand (driving greater sales revenue with less inventory). In order to achieve this, solutions that can accurately maintain inventory integrity and enable productive, reliable fulfillment are required.\nInventory Solutions\nThe ability to accurately forecast demand and project inventory needs is heightened by omnichannel retail requirements that change traditional approaches to inventory management. Manhattan’s Inventory solutions address which products should be carried and the quantity that will be needed at each location by date.\n●\nInventory Optimization - This set of applications includes sophisticated demand forecasting capabilities that can address the particularly challenging slow-moving and intermittent products that frequently result in excess inventory due to unpredictability. Also included is the Replenishment module that can evaluate inventory needs across all locations and channels. This module can even suggest transferring inventory between locations (warehouses or stores) or ‘protect’ merchandise at a store from online sales in order to save it for walk-in traffic.\n●\nPlanning - Manhattan’s Planning solutions provide merchants the tools they need to create channel-, store- or region-specific assortments. These tools offer channel-specific metrics and methodologies that optimize the planning process and maximize retailer revenues.\nTechnology Platform\nTo fulfill increasing market demand for software-as-a-service models, Manhattan offers Manhattan ActiveTM Solutions - cloud-native products designed to provide “always current” version-less product access. Like all Manhattan software, the solutions can be run on any type of device - mobile, tablet, or desktop. Manhattan Active solutions are sold directly in multi-year cloud subscription arrangements, typically for a period of three to five years, providing clients with regular software updates during the contract period to ensure access to the latest product features and benefiting Manhattan with a highly predictable and regular revenue stream.\nAs omnichannel and supply chain solutions necessarily interact with other business operation systems, our solutions are designed to interoperate with software from other providers as well as with a company’s existing legacy systems. This interfacing and open system capability enables customers to continue using existing computer resources and to choose among a wide variety of existing and emerging computer hardware and peripheral technologies. We also offer certain solutions in either on-premise software or cloud computing models so that customers can select the option that best meets their requirements for control, flexibility, cost of ownership, and time-to-deployment.\nMaintenance\nWe offer a comprehensive program that provides our perpetual license products with software upgrades for additional or improved functionality and technological advances incorporating emerging supply chain and industry advances. Over the past three years, our annual renewal rate for perpetual license customers subscribing to comprehensive support and enhancements has been greater than 90%. We are able to remotely access customer systems to perform diagnostics, provide online assistance, and facilitate software upgrades. We offer 24-hour customer support 365 days in the year, plus software upgrades for an annual fee that is paid in advance\nand is based on the solutions the customer has and the service level required. Software upgrades are provided under this program on a when-and-if- available basis.\nProfessional Services\nWe advise and assist our customers in planning and implementing our solutions through our global Professional Services Organization. To ensure successful long-term customer relationships, consultants assist customers with the initial deployment of our systems, the conversion and transfer of the customer’s historical data onto our systems, and ongoing training, education, and system upgrades. We believe our Professional Services teams enable customers to implement our solutions knowledgeably and in the appropriate amount of time, help customers achieve expected results from system investments, continuously identify new opportunities for supply chain advancements and meaningfully add to our industry-specific knowledge base to improve future implementations and product innovations.\nSubstantially all of our customers utilize some portion of our Professional Services to implement and support our software solutions. Professional Services typically are rendered under time and materials contracts, with services billed by the hour. Professional Services sometimes are rendered under fixed-fee contracts, with payments due on specific dates or milestones. We believe that increased sales of our solutions will drive higher demand for our Professional Services.\nOur Professional Services team delivers deep supply chain and enterprise commerce domain expertise to our customers through industry-specific “best-practices” protocols and processes developed through the collective knowledge we have gained from 30 years of implementing our supply chain solutions worldwide. We also extensively train our consulting personnel on enterprise commerce operations and on our solutions.\nBusiness consultants, systems analysts, and technical personnel assist customers in all phases of implementing our systems, including planning and design, customer-specific module configuration, on-site implementation or conversion from existing systems, and integration with customer systems such as Enterprise Resource Planning, web- and mobile-based commerce platforms, and Material Handling Equipment systems. At times, third-party consultants, such as those from major systems integrators, assist our customers with certain implementations.\nTraining and Change Management Services\nWe offer training and change management services for new and existing users, enabling our customers to align systems, people and processes. Services provided by Manhattan training experts cover a wide range of support from the intended design to the front-line of the customer’s business, including critical end-user adoption with hands-on, live training in a virtualized Manhattan software environment. These programs are provided at fixed fees per-person, per-class. In addition, computer-based training programs can be purchased for a fixed fee for use at client sites. Customers can also pursue certification at the Associate or Professional level through our certification programs for Omnichannel, Supply Chain or Inventory.\nManhattan Training and Change Management Services are offered under six categories: Role-Based Training Paths, Comprehensive Training Programs, Change Management Services, Individual Product Training Courses, End-User Enablement and Knowledge Resources.\nHardware Sales\nAs a convenience for our customers, we resell a variety of hardware developed and manufactured by others, including (but are not limited to) computer hardware, radio frequency terminal networks, radio frequency identification (RFID) chip readers, bar code printers and scanners, and other peripherals. We resell all third-party hardware products and related maintenance pursuant to agreements with manufacturers or through distributor-authorized reseller agreements pursuant to which we are entitled to purchase hardware products and services at discount prices and to receive technical support in connection with product installations and any subsequent product malfunctions. We do not maintain hardware inventory as we generally purchase hardware from vendors only after receiving related customer orders.\nStrategy\nOur objective is to extend our position as the leading global commerce solutions provider for organizations intent on creating and sustaining market advantages through technology-enabled commerce solutions. Our solutions help global distributors, wholesalers, retailers, logistics providers and manufacturers successfully manage accelerating and fluctuating market demands, as well as master the increasing complexity and volatility of their local and global supply chains. Our solutions are advanced, highly functional and highly scalable. They are designed to enable organizations to: create customer experiences consistent with their brand values; improve relationships with suppliers, customers and logistics providers; leverage investments across supply chain functions; effectively\ngenerate revenue and manage costs; and meet dynamically changing customer requirements. We believe our solutions are uniquely positioned to holistically optimize the way companies bring together omnichannel, supply chain and inventory management:\nDevelop and Enhance Software Solutions. We continue to focus our research and development resources on enhancing our Supply Chain, Omnichannel Commerce and Inventory Solutions. We offer what we believe to be the broadest and most richly-featured software portfolio in the marketplace. To continuously expand functionality and value, we plan to continue to provide enhancements to existing solutions and to introduce new solutions to address evolving industry standards and market needs. We identify these opportunities through our Product Management, Professional Services, Customer Support and Account Management organizations, through interactions such as ongoing customer consulting engagements and implementations, sessions with our solution user groups, association with leading industry analyst and market research firms, and participation on industry standards and research committees. Our solutions address needs in various vertical markets, including retail, consumer goods, food and grocery, logistics service providers, industrial and wholesale, high technology and electronics, life sciences and government. We intend to continue to enhance our solutions to meet the dynamic requirements of these and new vertical markets as business opportunities dictate.\nExpand International Presence. Our solutions offer significant benefits to customers in markets around the world, and for organizations with global operations. We have offices in Australia, Chile, China, France, Germany, India, Italy, Japan, the Netherlands, Singapore, Spain, and the United Kingdom, as well as representatives in Mexico and reseller partnerships in Latin America, Eastern Europe, the Middle East, South Africa, and Asia. Our Europe, Middle East, and Africa (EMEA) operations support sales, implementation services, and customer support functions for customers in Europe, as well as a number of customers across the Middle East, concentrated in countries we consider politically and economically stable. Our Asia Pacific (APAC) operations service emerging opportunities in China, Southeast Asia, and India, as well as more established markets in Japan, Australia and New Zealand. Our emerging markets international strategy includes leveraging the strength of our relationships with current U.S. and Europe-based customers that also have significant international operations.\nStrategic Alliances and Indirect Sales Channels. We currently sell our products primarily through our direct sales personnel, and through partnership agreements with a select number of organizations in emerging markets where we do not currently have a direct sales presence. We have worked on joint projects and joint sales initiatives with industry-leading consultants and software systems implementers, including most of the large consulting firms specializing in our targeted industries, to supplement our direct sales force and professional services organization. We expand our indirect sales channels through reseller agreements, marketing agreements, and agreements with third-party logistics providers. These alliances extend our market coverage and provide us with new business leads and access to trained implementation personnel.\nAcquire or Invest in Complementary Businesses. We continuously evaluate strategic acquisition opportunities of technologies, solutions, and businesses that are consistent with our platform-based strategy and enable us to enhance and expand our offerings. Preferred acquisition targets are those that would be complementary to our existing solutions and technologies, expand our geographic presence and distribution channels, extend our presence into additional vertical markets with challenges and requirements similar to those we currently serve, and further solidify our leadership position within the primary components of supply chain planning and execution.\nSales and Marketing\nWe employ multi-disciplinary sales teams that consist of professionals with industry experience in sales and technical sales support. To date, we have generated the majority of our software license and cloud subscription revenue through our direct sales force. We plan to continue to invest in our sales, services, and marketing organizations within the Americas, EMEA, and APAC, and to pursue strategic marketing partnerships. We conduct comprehensive global marketing programs that include advertising, prospect profiling and targeting, lead generation, public relations, analyst relations, trade show attendance and sponsorships, supply chain conference hosting, digital marketing, joint promotion programs with vendors and consultants, and ongoing customer communication programs.\nOur sales cycle typically begins with the generation of a sales lead - through in-house marketing efforts, advertising, targeted promotions, web inquiries, trade show presence, speaking engagements, hosted seminars, or other means of referral - or the receipt of a request for proposal from a prospective customer. Leads are qualified and opportunities are closed through a process that includes telephone-based assessments of requirements; responses to requests for proposals, presentations and product demonstrations, site visits and/or reference calls with organizations already using our supply chain solutions, and contract negotiations. Sales cycles vary substantially from opportunity to opportunity, but typically require nine to twelve months.\nIn addition to new customer sales, we continue to leverage our existing customer base to drive revenue from system upgrades, sales of additional licenses of purchased solutions, and sales of new or add-on solutions. To efficiently penetrate emerging global markets, we leverage indirect sales channels, including sales through reseller agreements, marketing agreements, and agreements with third-party logistics providers. To extend our market coverage, generate new business leads, and provide access to trained implementation personnel, we leverage strategic alliances with systems integrators skilled at implementing our solutions. Business referrals and leads\nare positively influenced by systems integrators, which include most of the large consulting firms and other systems consulting firms specializing in our targeted industries.\nOur Manhattan Value Partner (Manhattan MVP™) and Manhattan GeoPartner™ programs foster joint sales and marketing with other organizations. Manhattan Value Partners are proven software and hardware providers, trusted third-party integrators and consultants who bring added value to customer engagements through vertical industry knowledge or technical specialization. Manhattan MVPs support and complement our supply chain solutions so we can provide customers with a comprehensive approach that is suited to their business requirements. This collaborative program is designed to benefit both Manhattan and our partners through tailored joint marketing, sales and, in some cases, co-development efforts. Among others, Manhattan MVPs include Google Cloud, Deloitte, Accenture, Cognizant, Zebra, and Honeywell. Manhattan GeoPartners represent a select group of companies that sell and implement our solutions in specific geographies around the world, each providing valuable localized expertise to meet customer needs in areas such as Western Europe, Eastern Europe, Russia, the Middle East, Latin America, Africa, and the Asia Pacific region.\nCustomers\nTo date, our customers have been suppliers, manufacturers, distributors, retailers, and logistics providers in a variety of industries. Our top five customers (new or pre-existing) in the aggregate accounted for 12%, 11%, and 13% of total revenue for the years ended December 31, 2020 (“2020”), the year ended December 31, 2019 (“2019”) and the year ended December 31, 2018 (“2018”), respectively. No single customer accounted for more than 10% of our total revenue in 2020, 2019 and 2018.\nProduct Development\nWe focus our development efforts on new product innovation and on adding new functionality to existing solutions; integrating our various solution offerings; enhancing the operability of our solutions across our platform and across distributed and alternative hardware platforms, operating systems, and database systems. We believe that our future success depends, in part, on our ability to continue to enhance existing solutions, to respond to dynamically changing customer requirements, and to develop new or enhanced solutions that incorporate new technological developments and emerging supply chain and industry standards. To that end, development frequently focuses on base system enhancements and incorporating new user requirements and features into our solutions. As a result, we deliver packaged, highly configurable solutions with increasingly rich functionality rather than custom-developed software. We also deliver interface toolkits for many major ERP systems to enhance communication and improve data flows between our core solutions and our clients’ host systems.\nWe leverage internal and external scientific advisors to inform our solution strategies and research and development approaches with the most advanced thinking on supply chain opportunities, challenges, and technologies. Our internal research team is comprised of Ph.D.-credentialed math and science experts who work on creating and solving algorithms and other constructs that advance the optimization capabilities and other aspects of our solutions. We also regularly communicate with and are advised by experts from leading educational institutions known for their supply chain disciplines, and practitioners from organizations deploying supply chain technology in innovative and market-advancing ways. Together, our research team and external advisors inform both the practical business approaches and the mathematical and scientific inventiveness of our solutions.\nWe conduct most research and development internally in the U.S. and India to retain domain knowledge, and to promote programming continuity standards. However, we may periodically outsource some projects that can be performed separately and/or that require special skills. We also use third-party translation companies to localize our application software into various languages including, but not limited to, Chinese, French, Japanese, and Spanish.\nCompetition\nOur solutions are solely focused on enterprise commerce capabilities. Our solutions help global distributors, wholesalers, retailers, logistics providers and manufacturers successfully manage accelerating and fluctuating market demands, as well as master the increasing complexity and volatility of their local and global supply chains. Our solutions are designed to enable organizations to: create customer experiences consistent with their brand values; improve relationships with suppliers, customers and logistics providers; leverage investments across supply chain functions; effectively generate revenue and manage costs; and meet dynamically changing customer requirements characterized by rapid technological change in an intensely competitive environment. The principal competitive factors affecting the markets for our solutions include: industry expertise; company and solution reputation; company viability; compliance with industry standards; solution architecture; solution functionality and features; integration experience, particularly with ERP providers and material handling equipment providers; ease and speed of implementation; proven return on investment; historical and current solution quality and performance; total cost of ownership; solution price; and ongoing solution support structure. We believe we compete favorably with respect to each of these factors.\nOur competitors are diverse and offer a variety of solutions directed at various aspects of enterprise commerce. Existing competitors include:\n●\nCorporate information technology departments of current or potential customers capable of internally developing solutions;\n●\nERP vendors, including: Oracle, SAP, and Infor, among others;\n●\nSupply chain execution and planning vendors, including Blue Yonder Group, Inc. (formerly JDA Software Group, Inc.), HighJump Software Inc., SAS Institute Inc., and the Sterling Commerce division of IBM, among others;\n●\nPoint of sale vendors, including Aptos, Inc., Salesforce.com, Oracle, among others; and\n●\nSmaller independent companies that have developed or are attempting to develop supply chain execution solutions and/or planning solutions that apply in specific countries and/or globally.\nWe anticipate increased competition from ERP and supply chain management (SCM) applications vendors and from business application software vendors that may broaden their solution offerings by internally developing or by acquiring or partnering with independent developers of supply chain planning and execution software. Some of these ERP and other potential competitors have longer operating histories; significantly more financial, technical, marketing and other resources; greater name recognition; broader solutions; and larger installed bases of customers than us. To the extent that ERP and SCM vendors or other large competitors develop or acquire systems with functionality comparable or superior to ours, their larger customer bases, long-standing customer relationships, and ability to offer broader solutions outside the scope of supply chain could create significant competitive advantage for them. It also is possible that new competitors or alliances among current and/or new competitors could emerge to win significant market share. Increased competition could result in price reductions, fewer customer orders, reduced earnings and margins and loss of market share. In turn, this could have a material adverse effect on our business, results of operations, cash flow, and financial condition.\nWe believe we have established meaningful competitive differentiation through our supply chain and omnichannel commerce expertise; our platform-based solution approach; our track record of continuous supply chain commerce innovation and investment; our strong and endorsing customer relationships; our significant success in deploying and supporting supply chain, inventory and omnichannel solutions for market-leading companies; our success in helping our clients address the enterprise impacts of digital commerce; and our ability to out-execute others in identifying sales opportunities and demonstrating expertise throughout the sales cycle. However, to further our market success, we must continue to respond promptly and effectively to economic consumption models such as cloud subscription versus perpetual license, technological change and competitors’ innovations. Consequently, we cannot assure that we will not be required to make substantial additional investments in research, development, marketing, sales and customer service efforts in order to meet any competitive threat, or that we will be able to compete successfully in the future.\nInternational Operations: Segments\nWe have three reportable segments based on geographic location: North and Latin America (“the Americas”); Europe, Middle East and Africa (“EMEA”); and Asia Pacific (“APAC”). For further information on our segments, see Note 8 of the Notes to our Consolidated Financial Statements. International revenue includes all revenue derived from sales to customers outside the United States. At December 31, 2020 we employed approximately 2,000 employees in our international operations.\nProprietary Rights\nWe rely on a combination of copyright, patent, trade secret, trademark, and trade dress laws, confidentiality procedures, and contractual provisions to protect our proprietary rights in our products, processes and technology. We have registered trademarks for Manhattan Associates and the Manhattan Associates logo, as well as a number of our products and features. Generally, we enter into confidentiality and assignment-of-rights agreements with our employees, consultants, customers and potential customers and limit access to, and distribution of, our proprietary information. We license our proprietary products to our customers under license agreements that we believe contain appropriate use and other restrictions in order to try to best protect our ownership of our products and our proprietary rights in them, and to protect our revenue potential from our products. However, despite our efforts to safeguard and maintain our proprietary rights, we cannot ensure that we will successfully deter misappropriation, unintended disclosure or independent third-party development of our technology or our proprietary rights or information. Policing unauthorized use of our products is difficult, and, while we are unable to determine the extent to which piracy of our software solutions exists, as is the case with any software company, piracy could become a problem. Further, to the extent that we enter into transactions in countries where intellectual property laws are not well developed or are poorly enforced, our efforts to protect our proprietary rights may be ineffective. Whether we seek to enforce our proprietary rights in the U.S. or abroad, our efforts, including litigation to enforce our rights, can result in substantial costs and diversion of resources, and such efforts, or our failure to succeed in such efforts, could have a material adverse effect on our business, financial condition, results of operations or cash flows, regardless of the final outcome.\nAs the number of supply chain management solutions available in the marketplace increases and solution functionality continues to overlap, supply chain software may increasingly become subject to claims of infringement or other misappropriation of intellectual property. Third parties may assert infringement or misappropriation claims against us relating to our products, processes or technology. Such claims, whether or not they have merit, generally are time-consuming and may result in costly litigation, divert management’s attention or cause product shipment delays or require us to enter into royalty or licensing arrangements. Defense of infringement or other misappropriation claims, entering into royalty or licensing agreements, the unavailability of such agreements, or adverse determinations in proprietary rights litigation could have a material adverse effect on our business, results of operations, cash flow and financial condition.\nEmployees\nWe have offices in Australia, Chile, China, France, Germany, India, Italy, Japan, the Netherlands, Singapore, Spain, the United Kingdom, and the United States, as well as representatives in Mexico and reseller partnerships in Latin America, Eastern Europe, the Middle East, South Africa, and Asia.\nAs of December 31, 2020, we employed approximately 3,400 employees worldwide. We have offices in Australia, Chile, China, France, Germany, India, Italy, Japan, the Netherlands, Singapore, Spain, the United Kingdom, and the United States, as well as representatives in Mexico and reseller partnerships in Latin America, Eastern Europe, the Middle East, South Africa, and Asia.\nOur workforce is highly educated and diverse, which we believe is important for our continued success as a leading innovator in supply chain and omnichannel commerce software and services. Our employees comprise software developers, engineers, and other technical workers and professionals in business operations and administration. None of our U.S. employees are subject to a collective bargaining agreement; our employees in both France (approximately 120 employee) and the Netherlands (approximately 60 employees) are represented by employee works councils. Globally, we have experienced no work stoppages, and we believe our relations with our employees are good.\nWe employ a number of strategies to best enable us to attract, retain, and engage our team members. To build a steady and diverse pipeline of talent, we have a robust in-house recruiting program, which includes campus recruiting focused on universities with leading supply chain, engineering, and computer science programs. Further, we employ recruiting processes that mitigate unconscious biases and promote diverse candidate pools. Additionally, we cultivate partnerships with organizations focused on hiring women, minorities, individuals with disabilities, and veterans, including Americas Job Exchange, Technologists of Color, and Society of Women Engineers. Our campus programs include recruitment at historically black colleges and universities (HBCUs) and other schools with a relatively high percentage of females and minorities enrolled in engineering and computer science programs. Further, as a federal contractor, we comply with federal contractor affirmative action requirements to employ and advance women, minorities, individuals with disabilities, and protected veterans.\nTo attract and retain employees, we provide competitive compensation and benefits programs, employee recognition, career development opportunities, and access to continual growth through online learning platforms, external training, and in-house live training. In addition, to further employee enrichment and engagement, we periodically survey our employees regarding their engagement levels. We use these survey results to determine how we can continue to create work environments that enable and energize our employees and to develop a positive working culture. We provide opportunities for our employees to take a half day each year to give back to their communities. We call this our Manhattan PurposeTM day. Our employees are also given multiple opportunities to serve through community partnerships that we cultivate through our Manhattan ConnectTM programs. To encourage our inclusive culture, we offer our Women’s Initiative Network (WINTM) and our Multicultural Network (MCNTM). We also have a dedicated learning path for all employees regarding diversity and inclusion.\nWe have taken steps to best ensure the health and safety of our employees globally during the COVID-19 pandemic. With most of our workforce temporarily working virtually, we have provided learning resources to enable this transition, including how to host productive virtual meetings and managing employees remotely. We also have provided health and wellness sessions through the year to promote the continued wellbeing of our employees. Finally, despite the global pandemic, we have been able to maintain our employee workforce around the globe without material contraction.\nAvailable Information\nWe file annual, quarterly and current reports and other information with the Securities and Exchange Commission (the “SEC” or the “Commission”). The SEC maintains a website at www.sec.gov that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC.\nOn our website, www.manh.com, we provide free of charge our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and any amendments thereto, as soon as reasonably practicable after they have been electronically filed or furnished to the SEC. Information contained on our website is not part of this Form 10-K or our other filings with the SEC.\nAdditionally, our code of business conduct and ethics and the charters of the Audit, Compensation, and Nomination and Governance Committees of the Board of Directors are available on our website.",
    "item_1A": "Item 1A.\nRisk Factors\nYou should consider the following and other risk factors in evaluating our business or an investment in our common stock. The occurrence of adverse events described in the following risk factors or other adverse events not described in the following risk factors could have a material adverse effect on our business, results of operations, cash flow and financial condition, and could cause the trading price of our common stock to decline.\nRisks Related to Our Business\nThe ongoing COVID-19 pandemic could materially adversely affect our business, results of operations and financial condition. In March 2020, the World Health Organization declared the outbreak of the novel coronavirus, and the disease it causes, COVID-19, a pandemic. The pandemic continues to spread throughout the U.S. and the world and has resulted in authorities implementing numerous measures from time to time to contain the virus, including travel bans and restrictions, quarantines, shelter-in-place orders, and business limitations and shutdowns. While we are unable to completely predict the full impact that COVID-19 and related remedial measures will have on our results from operations, financial condition, liquidity and cash flows due to numerous uncertainties, including the duration and severity of the pandemic and containment measures, our compliance with these measures has impacted our day-to-day operations and could disrupt our business and operations, as well as that of our customers, suppliers and other counterparties, for an indefinite period of time.\nThe negative effects of COVID-19 on the overall economy could cause our revenues and profitability to decline for numerous reasons, including:\n•\nOur customers could implement cost-saving measures, which may include reductions in information technology expense or requests for extended payment terms;\n•\nSome customers could file for bankruptcy;\n•\nForced store closures could accelerate pre-existing disruption in the retail sector; and/or\n•\nThe spending habits of our customers’ customers could change, reducing our customers’ own revenues and profitability, which in turn could affect our revenues and profitability.\nWhile we have experienced strong demand during 2020 and expect continued growth for our Cloud solutions, sales cycles could extend as our customers and prospects continue to evaluate our solutions, including Manhattan Active Warehouse Management.\nIn addition, restrictions on in-person interaction, whether occasioned by government orders or changed habits or customs regarding social distancing and group activity after the expiration of strict government measures, may have a material impact on our business. For instance, implementation of our software may be impeded if either our personnel or our customer’s information technology personnel are working remotely.\nA decrease in revenues could also negatively affect our liquidity, as we primarily rely on cash generated from operating activities for our liquidity needs. Compounding this issue, the COVID-19 pandemic may make outside capital less available or more expensive.\nIn addition to the risks described above, there may be other risks not currently recognized or not fully appreciated at this time, as this crisis is both unprecedented and rapidly evolving. Consequently, our business, results of operations and financial condition could be materially, adversely affected not only by some of the COVID-19-related factors described above, but by other related factors of which we may be currently unaware.\nWe now offer certain of our solutions as cloud subscriptions, which will adversely affect our revenue and earnings in the transition period and make predicting our revenue, earnings and cash flow more difficult. We began offering more of our solutions under a cloud subscription option in 2017, in addition to our perpetual license option. Under a cloud subscription, customers pay a periodic fee for the right to use our software within a cloud-based environment that we provide and manage over a specified period of time. We believe that over time a growing number of our customers and prospects will elect to purchase our solutions as cloud subscriptions rather than under an on-premise perpetual license.\nUntil we have fully transitioned to a stable mix of cloud subscription and on-premise perpetual license arrangements, we expect our combined license and cloud subscription revenue may decrease due to the difference in revenue recognition for a cloud subscription (for which revenue is recognized ratably over the term of the subscription arrangement) and a perpetual license (for which revenue is generally recognized upon purchase) and that our maintenance revenue (which comprises a significant portion of our revenue) may also decrease due to software enhancement and support being included in the cloud subscription offering.\nOur revenue, earnings and cash flow are based on the mix of revenue between cloud subscription and perpetual license revenue including timing, number and size of deals. If a greater percentage of our customers purchase our solutions as cloud subscriptions in any period, our revenue, earnings and cash flow will likely fall below expectations for that period, which could cause our stock price to decline.\nOur future revenue is dependent on continuing sales from software licenses and cloud subscriptions, which in turn drive sales of post-contract support and professional services. We are dependent on our new customers as well as our large installed customer base to purchase additional software licenses, cloud subscriptions, post-contract support, and professional services from us. Our post-contract support agreements are generally for a one-year term and our professional services agreements generally only cover a particular engagement. In future periods customers may not license additional products, and in turn may not renew post-contract support agreements or purchase additional professional services from us. If our customers decide not to license or purchase these products and services from us, or if they reduce the scope of their post-contract support or hosting or professional services agreements, our revenue could decrease significantly, and that could have a material adverse effect on our business, results of operations, cash flow and financial condition.\nIn addition, many of our customers are using older versions of our products for which we are no longer developing any further upgrades or enhancements. While we intend to migrate our customers who are using these versions to newer version, products or convert to Cloud subscription, there can be no assurance that these customers will do so. If customers using older versions of our products decide not to license our current software products, or decide to discontinue the use of our products and associated post-contract support services, our revenue could decrease and our operating results could be materially adversely affected.\nIf we encounter defects, delays or interruptions in our cloud subscription services, the demand for these services could diminish, and we could incur significant liability. We currently utilize data center hosting facilities, which are managed by third-parties, to provide cloud-based solutions and hosting services to our customers. If the data center facilities fail or encounter any damage, it could result in interruptions in services to our customers. This could result in unanticipated downtime for our customers, and in turn, our reputation and business could be adversely affected. In addition, if our customers use our cloud-based arrangements in unanticipated ways, this could cause an interruption in service for other customers attempting to access their data.\nIf any defects, delays or interruption in our cloud-based solutions occur, customers could elect to cancel their service, delay or withhold payment to us, not purchase from us in the future or make claims against us, which could adversely affect our business reputation, results of operations, cash flow, and financial condition.\nDelays in implementing our products could adversely impact our business, results of operations, cash flow, and financial condition. Due to the size and complexity of most of our software implementations, our implementation cycle can be lengthy and may result in delays. Our products may require modification or customization and must integrate with many existing computer systems and software programs of our customers. This can be time-consuming and expensive for customers and can result in implementation and deployment delays of our products. Additional delays could result if we fail to attract, train, and retain services personnel, or if our alliance companies fail to commit sufficient resources towards implementing our software. These delays and resulting customer dissatisfaction could limit our future sales opportunities, harm our reputation, and adversely impact results of operations, cash flow, and financial condition.\nOur liability to clients may be substantial if our systems fail, which could adversely impact our business, results of operations, cash flow, and financial condition. Our products are often critical to the operations of our customers’ businesses and provide benefits that may be difficult to quantify. If our products fail to function as required-which, as described in more detail in other risk factors, could be due to software bugs, cloud hosting service failures, security breaches, faulty implementations or other reasons-we may be subject to claims for substantial damages. Courts may not enforce provisions in our contracts that would limit our liability or otherwise protect us from liability for damages. Defending a lawsuit, regardless of its merit, could be costly and divert management’s time and attention. Although we maintain general liability insurance and error and omissions coverage, these coverages may not continue to be available on reasonable terms or in sufficient amounts to cover claims against us. In addition, our insurer may disclaim coverage as to any future claim. If claims exceeding the available insurance coverage are successfully asserted against us, or our insurer imposes premium increases or large deductibles or co-insurance requirements on us, then our business, results of operations, cash flow, and financial condition could be adversely affected.\nOur ability to sell our software is highly dependent on the quality of our services offerings, and our failure to offer high quality services could adversely impact our business, results of operations, cash flow, and financial condition. Most of our\ncustomers rely to some extent on our professional services to aid in the implementation of our software solutions. Once our software has been installed and deployed, our customers may depend on us to provide them with ongoing support and resolution of issues relating to our software. Therefore, a high level of service is critical for the continued marketing and sale of our solutions. If we or our partners do not efficiently and effectively install and deploy our software products, or succeed in helping our customers quickly resolve post-deployment issues, our ability to sell software products to these customers would be adversely affected and our reputation in the marketplace with potential customers could suffer.\nOur pricing models may need to be modified due to price competition. The competitive markets in which we operate may oblige us to reduce our prices in order to contend with the pricing models of our competitors. If our competitors discount certain products or services, we may have to lower prices on certain products or services in order to attract or retain customers. Any such price modifications would likely reduce margins and could adversely affect our business, results of operations, cash flow, and financial condition.\nWe may encounter long sales cycles, particularly with our larger customers, which could have an adverse effect on the amount, timing, and predictability of our revenue, adversely affecting our business, results of operations, cash flow, and financial condition. Our products have lengthy sales cycles, which typically extend from nine to twelve months and may take up to several years. Potential and existing customers, particularly larger enterprise customers, often commit significant resources to an evaluation of available solutions and services and require us to expend substantial time and resources in connection with our sales efforts. The length of our sales cycles also varies depending on the type of customer to which we are selling, the product being sold, and customer requirements. We may incur substantial sales and marketing expenses and expend significant management effort during this time, regardless of whether we make a sale. Many of the key risks relating to sales processes are beyond our control, including: our customers’ budgetary and scheduling constraints; the timing of our customers’ budget cycles and approval processes; our customers’ willingness to replace their currently deployed software solutions; and general economic conditions.\nAs a result of these lengthy and uncertain sales cycles of our products and services, it is difficult for us to predict when customers may purchase products or services from us, thereby affecting when we can recognize the associated revenue, and our operating results may vary significantly and may be adversely affected. The length of our sales cycle makes us susceptible to having pending transactions delayed or terminated by our customers if they decide to delay or withdraw funding for IT projects. Our customers may decide to delay or withdraw funding for IT projects for various reasons, including, but not limited to, global economic cycles and capital market fluctuations.\nOur ability to maintain and develop our brand is critical for our continued success. The brand identity we have developed has significantly contributed to the continued success of our business. Our ability to maintain and develop our brand is critical in expanding our base of customers, partners and employees. Our brand will depend largely on our ability to remain a technology leader and continue to provide high-quality innovative products, services, and features. Significant investments may be required in order to maintain and develop our brand. However, the investments may later be proven to be unsuccessful. If we fail to maintain and develop our brand, or if we incur excessive expenses in our efforts to do so, our business, operating results and financial condition may be materially and adversely affected.\nOur technology must be advanced if we are to remain competitive. The market for our products is characterized by rapid technological change, frequent new product introductions and enhancements, changes in customer demands, and evolving industry standards. Our existing products could be rendered obsolete if we fail to continue to advance our technology. We have also found that the technological life cycles of our products are difficult to estimate, partially because of changing demands of other participants in the supply chain. We believe that our future success will depend in large part upon our ability to continue to enhance our current product line while we concurrently develop and introduce new products that keep pace with competitive and technological developments. These developments require us to continue to make substantial product development investments. Although we are presently developing a number of product enhancements to our product sets, we cannot assure you that these enhancements will be completed on a timely basis or gain customer acceptance.\nEconomic, political and market conditions can adversely affect our business, results of operations, cash flow and financial condition, including our revenue growth and profitability, which in turn could adversely affect our stock price. Our business is influenced by a range of factors that are beyond our control and that we have no comparative advantage in forecasting. These include:\n●\ngeneral economic and business conditions;\n●\noverall demand for enterprise software and services;\n●\ngovernmental policy, budgetary constraints or shifts in government spending priorities;\n●\ngeneral geo-political developments; and\n●\ncurrency exchange rate fluctuations.\nMacroeconomic developments in the United States and Europe and in parts of Asia and South America could negatively affect our business, operating results, financial condition and outlook, which, in turn, could adversely affect our stock price. Any general weakening of, and related declining corporate confidence in, the global economy or the curtailment in government or corporate spending could cause current or potential customers to reduce or eliminate their information technology budgets and spending, which could cause customers to delay, decrease or cancel purchases of our products and services; or cause customers not to pay us; or to delay paying us for previously purchased products and services.\nIn addition, political unrest and the related potential impact on global stability, terrorist attacks and the potential for other hostilities in various parts of the world, potential public health crises and natural disasters continue to contribute to a climate of economic and political uncertainty that could adversely affect our results of operations and financial condition, including our revenue growth and profitability.\nDisruption in the retail market could materially adversely affect our revenues and results of operations. Our largest market, retail, is experiencing significant business disruption and transformation, primarily driven by digital commerce. We believe that disruption is causing many traditional retailers to assess the challenges of the transformation and evaluate their store networks and costs, as they face increasing competitive pressures from ecommerce retailers. Since our solutions often require our customers to make significant capital investments, traditional retailers may be delaying purchase decisions on our products. While this disruption may present significant opportunity for our company, we believe extended sales cycles for large license sales and cloud subscriptions could have a material adverse effect on our revenues and results of operations.\nIn addition, we believe the retail business transformation from retail brick-and-mortar to technology-enabled omnichannel commerce models will be a multi-year trend. Consequently, we cannot predict when the repercussions from the disruption in retail may moderate or end.\nAn inability to attract, integrate, and retain management and other personnel could adversely impact our business, results of operations, cash flow, and financial condition. Our success greatly depends on the continued service of our executives, as well as our other key senior management, technical personnel, and sales personnel. Our success will depend on the ability of our executive officers to work together as a team. The loss of any of our senior management or other key professional services, research and development, sales and marketing personnel-particularly if they are lost to competitors-could impair our ability to grow our business. We do not maintain key man life insurance on any of our executive officers.\nOur future success will depend in large part upon our ability to attract, retain, and motivate highly skilled employees. We face significant competition for individuals with the skills required to perform the services we offer, and thus we may encounter increased compensation costs that are not offset by increased revenue. In the broader technology industry in which we compete for talented hires, there is substantial and continuous competition for engineers with high levels of experience in designing, developing and managing software, as well as competition for sales executives and operations personnel. We cannot guarantee that we will be able to attract and retain sufficient numbers of these highly skilled employees or motivate them. Because of the complexity of the supply chain market, we may experience a significant time lag between the date on which technical and sales personnel are hired and the time at which these persons become fully productive.\nWe may not be able to continue to successfully compete with other companies. We compete in markets that are intensely competitive and are expected to become more competitive as current competitors expand their product offerings. Our current competitors come from many segments of the software industry and offer a variety of solutions directed at various aspects of the extended supply chain, as well as the enterprise as a whole. We face competition for product sales from:\n●\nCorporate information technology departments of current or potential customers capable of internally developing solutions;\n●\nERP vendors, including: Oracle, SAP, and Infor, among others;\n●\nSupply chain execution and planning vendors, including Blue Yonder Group, Inc. (formerly JDA Software Group, Inc.), HighJump Software Inc., SAS Institute Inc., and the Sterling Commerce division of IBM, among others;\n●\nPoint of sale vendors, including Aptos, Inc., Salesforce.com, Oracle, among others; and\n●\nSmaller independent companies that have developed or are attempting to develop supply chain execution solutions and/or planning solutions that apply in specific countries and/or globally.\nWe anticipate facing increased competition from ERP and SCM applications vendors and business application software vendors that may broaden their solution offerings by internally developing or by acquiring or partnering with independent developers of supply chain planning and execution software. Some of these ERP and other potential competitors have longer operating histories, significantly more financial, technical, marketing, and other resources, greater name recognition, broader solutions, and larger installed bases of customers than we do. To the extent that ERP and SCM vendors or other large competitors develop or acquire systems with functionality comparable or superior to ours, their larger customer bases, long-standing customer relationships, and ability to offer broader solutions outside the scope of supply chain could create significant competitive advantage for them. It also is\npossible that new competitors or alliances among current and/or new competitors could emerge to win significant market share. Increased competition could result in price reductions, fewer customer orders, reduced earnings and margins, and loss of market share. In turn, this could have a material adverse effect on our business, results of operations, cash flow, and financial condition.\nWe believe the domain expertise required to continuously innovate supply chain technology in our target markets, effectively and efficiently implement solutions, identify and attract sales opportunities, and compete successfully in the sales cycle provides us with a competitive advantage and is a significant barrier to market entry. However, in order to be successful in the future, we must continue to respond promptly and effectively to technological change and competitors’ innovations, and consequently we cannot assure you that we will not be required to make substantial additional investments in connection with our research, development, marketing, sales, and customer service efforts in order to meet any competitive threat, or that we will be able to compete successfully in the future. Some of our competitors have significant resources at their disposal, and the degree to which we will compete with their new innovative products in the marketplace is undetermined.\nOur operating results are substantially dependent on one line of business. We continue to derive our revenues from sales of our supply chain commerce solutions software and related services and hardware. Any factor adversely affecting the markets for supply chain solutions could have an adverse effect on our business, results of operations, cash flow, and financial condition. Accordingly, our future operating results will depend on the demand for our supply chain commerce products and related services and hardware by our customers, including new and enhanced releases that we subsequently introduce. We cannot guarantee that the market will continue to demand our current products or that we will be successful in marketing any new or enhanced products. If our competitors release new products that are superior to our products in performance or price, demand for our products may decline. A decline in demand for our products as a result of competition, technological change, or other factors would reduce our total revenues and harm our ability to maintain profitability.\nOur research and development activities may not generate significant returns. Our product development activities are costly, and recovering our investment in product development may take a significant amount of time, if it occurs at all. We anticipate continuing to make significant investments in software research and development and related product opportunities because we believe that we must continue to allocate a significant amount of resources to our research and development activities in order to compete successfully. We cannot estimate with any certainty when we will, if ever, receive significant revenues from these investments.\nOur failure to manage the growth of our operations may adversely affect our business, results of operations, cash flow, and financial condition. We plan to continue to increase the scope of our operations domestically and internationally. This growth may place a significant strain on our management systems and resources. We may further expand domestically or internationally through internal growth or through acquisitions of related companies and technologies. If we fail to maintain continuity in our executive officers; develop the management skills of our managers and supervisors; attract, retain, train, and motivate our employees; improve our operational, financial, and management controls; and maintain adequate reporting systems and procedures and our management and information control systems, our business, results of operations, and cash flow could be negatively impacted.\nFluctuations in our hardware sales may adversely impact our business, results of operations, cash flow, and financial condition. A portion of our revenue in any period is from the resale of a variety of third-party hardware products to purchasers of our software. However, our customers may purchase these hardware products directly from manufacturers or distributors rather than from us. We view sales of hardware as non-strategic. We perform this service to our customers seeking a single source for their supply chain needs. Hardware sales are difficult to forecast and fluctuate from quarter to quarter, leading to unusual comparisons of total revenue and fluctuations in profits. If we are unable to maintain or grow our hardware revenue, our business, results of operations, cash flow, and financial condition may be adversely affected.\nOur growth is dependent upon the successful development of our direct and indirect sales channel mix. We believe that our future growth also will depend on further developing and maintaining a successful direct sales force and strategic relationships with systems integrators and other technology companies. We invest significant resources to maintain and develop our sales channels. Our investment could adversely affect our operating results if these efforts do not generate license and service revenue necessary to offset the investment. Also, our inability to partner with other technology companies and qualified systems integrators could adversely affect our results of operations. Because lower unit prices are typically charged on sales made through indirect channels, a disproportionate increase in indirect sales could reduce our average selling prices and result in lower gross margins. In addition, sales of our products through indirect channels typically do not generate consulting services revenue for us at the same levels as direct sales, as the third-party systems integrators generally provide these services. Similarly, indirect sales typically do not generate the same levels of direct contact between our associates and those of our customer, and we may have more difficulty accurately forecasting sales, evaluating customer satisfaction, and recognizing emerging customer requirements. In addition, these systems integrators and third-party software providers may develop, acquire, or market products competitive with our products.\nOur strategy of marketing our products directly to customers and indirectly through systems integrators and other technology companies may result in distribution channel conflicts. Our direct sales efforts may compete with those of our indirect channels and, to the extent different systems integrators target the same customers, systems integrators may also come into conflict with each other.\nAny channel conflicts that develop may have a material adverse effect on our relationships with systems integrators or harm our ability to attract new systems integrators.\nMergers or other strategic transactions involving our competitors could weaken our competitive position or reduce our revenue. Our competitors have been consolidating, which may make them more formidable competitors to us. Competing with stronger companies may cause us to experience pricing pressure and loss of market share, either of which could have a material adverse effect on our business, results of operations, cash flow, and financial condition. Our competitors may establish or strengthen their cooperative relationships with vendors, systems integrators, third-party consulting firms, or other parties. Established companies may not only develop their own products but may also acquire or partner with our current competitors. If any of these events occur, our revenue and profitability could significantly decline.\nOur business, results of operations, cash flow, and financial condition may be adversely affected if we cannot integrate acquired companies or manage joint ventures. We may from time to time acquire companies with complementary products and services. These acquisitions will expose us to increased risks and costs, including those arising from the following: assimilating new operations and personnel; diverting financial and management resources from existing operations; and integrating acquired technologies. We may not be able to generate sufficient revenue from any of these acquisitions to offset the associated acquisition costs.\nWe will also be required to maintain uniform standards of quality and service, controls, procedures, and policies. Our failure to achieve any of these standards may hurt relationships with customers, employees, and new management personnel. In addition, future acquisitions may result in additional issuances of stock that could be dilutive to our shareholders.\nMany acquisition candidates have significant intangible assets, and an acquisition of these businesses would likely result in significant amounts of goodwill and other intangible assets. Goodwill and certain other intangible assets are not amortized to income, but are subject to at least annual impairment reviews. If the acquisitions do not perform as planned, future charges to income arising from such impairment reviews could be significant. Likewise, future quarterly and annual earnings could be significantly adversely affected. In addition, these acquisitions could involve acquisition-related charges, such as one-time acquired research and development charges.\nWe may also evaluate joint venture relationships with complementary businesses. Any joint venture we enter into would involve many of the same risks posed by acquisitions, particularly the following: risks associated with the diversion of resources; the inability to generate sufficient revenue; the management of relationships with third parties; and potential additional expenses.\nOur business may require additional capital. We may require additional capital to finance our growth or to fund acquisitions or investments in complementary businesses, technologies or product lines. Our capital requirements may be impacted by many factors, including: demand for our products; the timing of and extent to which we invest in new technology; the timing of and extent to which we acquire other companies; the level and timing of revenue; the expenses of sales and marketing and new product development; the success and related expense of increasing our brand awareness; the cost of facilities to accommodate a growing workforce; the extent to which competitors are successful in developing new products and increasing their market share; and the costs involved in maintaining and enforcing intellectual property rights.\nTo the extent that our resources are insufficient to fund our future activities, we may need to raise additional funds through public or private financing. However, additional funding, if needed, may not be available on terms attractive to us, or at all. In addition, since we have historically financed our growth through cash flow from operations and available cash, our relative inexperience in accessing the credit or capital markets may impair our ability to do so if the need arises. Our inability to raise capital when needed could have a material adverse effect on our business, results of operations, cash flow and financial condition. If additional funds are raised through the issuance of equity securities, the percentage ownership of our company held by our current shareholders would be diluted.\nOur operating results are difficult to predict and could cause our stock price to fall. Our quarterly revenue and operating results are difficult to predict and can fluctuate significantly from quarter to quarter. If our quarterly revenue or operating results fall below the expectations of investors or public market analysts, the price of our common stock could fall substantially. Our quarterly revenue is difficult to forecast for several reasons, including the following: global macro-economic disruptions; credit and equity market disruptions, which can significantly impact capital availability and spend timing of customers or potential customers; the varying sales cycle for our products and services from customer to customer, including multiple levels of authorization required by some customers; the varying demand for our products; customers’ budgeting and purchasing cycles; potential deferral of license revenue well after entering into a license agreement due to extended payment terms, including, although infrequent, payment terms in a contract extending beyond twelve months, significant software modifications, future software functionality deliverables not on a stand-alone basis, or other negotiated terms that preclude software revenue recognition under U.S. general accepted accounting principles; delays in our implementations at customer sites; timing of hiring new services employees and the rate at which these employees become productive; timing of introduction of new products; development and performance of our distribution channels; and timing of any acquisitions and related costs.\nAs a result of these and other factors, our license revenue is difficult to predict. Because our revenue from services is largely correlated to our license revenue, a decline in license revenue could also cause a decline in our services revenue in the same quarter or in subsequent quarters. In addition, an increase or decrease in hardware sales, which provide us with lower gross margins than sales of software licenses or services, may cause variations in our quarterly operating results.\nMost of our expenses, including employee compensation and rent, are relatively fixed. In addition, our expense levels are based, in part, on our expectations regarding future revenue increases. As a result, any shortfall in revenue in relation to our expectations could cause significant changes in our operating results from quarter to quarter and could result in quarterly losses. As a result of these factors, we believe that period-to-period comparisons of our revenue levels and operating results are not necessarily meaningful. Historical growth rates and historical quarterly revenue and operating results may not be a good indicator of future operating results and reliance on historical results should not be used to predict our future performance.\nFires or other catastrophic events at our principal facilities could cripple our business. Fires, natural disasters or other catastrophic events, particularly those affecting our Atlanta headquarters or India research and development center, may cause damage or disruption to our operations, and thus could have a strong negative effect on us. Our business operations are subject to interruption by natural disasters, fire, power shortages, pandemics and other events beyond our control. Although we maintain crisis management and disaster response plans, such events could make it difficult or impossible for us to deliver our services to our customers.\nRisks Related to Our Intellectual Property and Cybersecurity\nOur software may contain undetected errors or “bugs” causing harm to our reputation, which could adversely impact our business, results of operations, cash flow, and financial condition. Software products as complex as those we offer might contain undetected errors or failures when we first introduce them or when we release new versions. Despite testing, we cannot ensure errors will not be found in new products or product enhancements after commercial release. Any errors could cause substantial harm to our reputation, result in additional unplanned expenses to remedy any defects, delay the introduction of new products, result in the loss of existing or potential customers, or cause a loss in revenue. Further, such errors could subject us to customer claims for significant damages, and we cannot guarantee courts would enforce the provisions in our customer agreements limiting our damage liability. In turn, this could materially affect our business, results of operations, cash flow, and financial condition.\nIf our data protection or other security measures are compromised and, as a result, our data, our customers’ data or our IT systems are accessed improperly, made unavailable, or improperly modified, our products and services may be perceived as vulnerable, possibly damaging our brand and reputation, disrupting the IT services we provide to our customers, and causing our customers to stop using our products and services, all of which could reduce our revenue and earnings, increase our expenses and expose us to legal claims and regulatory actions. Our products and services can store, retrieve, manipulate and manage our customers’ information and data as well as our own. We have a reputation for secure and reliable software products and services and invest time and resources into protecting the integrity and security of our products, services and internal and external data that we manage.\nNevertheless, we encounter attempts by third parties to penetrate or bypass our data protection and other security measures and gain unauthorized access to our networks, systems and data or compromise our customers’ confidential information or data. Unauthorized third parties also could improperly access or modify data as a result of employee or supplier error or malfeasance and third parties may attempt to fraudulently induce employees or customers into disclosing sensitive information such as user names, passwords or other information.\nThese risks are persistent and likely will increase as we continue to grow our cloud offerings and services and store and process increasingly large amounts of our customers’ confidential information and data. We also may acquire companies, products, services and technologies and inherit such risks when we integrate these acquisitions within Manhattan.\nIf a cyber-attack or other security incident were to occur, we could suffer damage to our brand and reputation, which could reduce our revenue, earnings, and operating cash flow resulting from increased expenses, including potential legal claims and regulatory actions to address and fix the incidents.\nFurther, as regulatory focus on privacy issues continues to increase and become more complex, these potential risks to our business will intensify. Changes in laws or regulations associated with the enhanced protection of certain types of sensitive data could significantly increase our cost of providing our products and services.\nThe use of open source software in our products may expose us to additional risks and harm our intellectual property, which could adversely impact our business, results of operations, cash flow, and financial condition. Some of our products use or incorporate software that is subject to one or more open source licenses. Open source software is typically freely accessible, usable and modifiable. Certain open source software licenses require a user who intends to distribute the open source software as a component of the user’s software to disclose publicly part or all of the source code to the user’s software. In addition, certain open\nsource software licenses require the user of such software to make any derivative works of the open source code available to others on unfavorable terms or at no cost. This can subject previously proprietary software to open source license terms.\nWhile we monitor the use of all open source software in our products, processes, and technology and try to ensure that no open source software is used in such a way as to require us to disclose the source code to the related product or solution, such use could inadvertently occur. Additionally, if a third-party software provider has incorporated open source software into software we license from them for use in our products and solutions, we could, under certain circumstances, be required to disclose the source code to our products and solutions. This could harm our intellectual property position and have a material adverse effect on our business, results of operations, cash flow, and financial condition.\nIf we are unable to develop software applications that interoperate with computing platforms developed by others, our business, results of operations, cash flow, and financial condition may be adversely affected. We develop software applications that interoperate with operating systems, database platforms, and hardware devices developed by others, which we refer to collectively as computing platforms. If the developers of these computing platforms do not cooperate with us or we are unable to devote the necessary resources so that our applications interoperate with those computing platforms, our software development efforts may be delayed and our business and results of operations may be adversely affected. When new or updated versions of these computing platforms are introduced, it is often necessary for us to develop updated versions of our software applications so that they interoperate properly with these computing platforms. We may not accomplish these development efforts quickly or cost-effectively, and it is difficult to predict what the relative growth rates of adoption of these computing platforms will be. These development efforts require substantial investment, the devotion of substantial employee resources, and the cooperation of the developers of the computing platforms. For some computing platforms, we must obtain some proprietary application program interfaces from the owner in order to develop software applications that interoperate with the computing platforms. Computing platform providers have no obligation to assist in these development efforts. If they do not provide us with assistance or the necessary proprietary application program interfaces on a timely basis, we may experience delays or be unable to expand our software applications into other areas.\nThe computing platforms we use may not continue to be available to us on commercially reasonable terms. Any loss of the right to use any of these systems could result in delays in the provision of our products and services, and our results of operations may be adversely affected. Defects in computing platforms could result in errors or failure of our products, which could harm our business.\nWe incorporate third-party software in our solutions, the failure or unavailability of which could adversely affect our ability to sell, support, and service our products. We incorporate and include third-party software into and with certain of our products and solutions and expect to continue to do so. The operation of our products could be impaired if there are defects in that third-party software. It may be difficult for us to correct any defects in third-party software because the development and maintenance of the software is not within our control. Such defects could adversely affect our business.\nIn addition, there can be no assurance that these third parties will continue to make their software available to us on acceptable terms, or at all; not make their products available to our competitors on more favorable terms; invest the appropriate levels of resources in their products and services to maintain and enhance the capabilities of their software; or remain in business. Any impairment in our relationship with these third parties or our ability to license or otherwise use their software could have a material adverse effect on our business, results of operations, cash flow, and financial condition.\nOur liability for intellectual property claims can be costly and result in the loss of significant rights, which could adversely impact our business, results of operations, cash flow, and financial condition. It is possible that third parties will claim that we have infringed their current or future products, inventions, or other intellectual property. We expect that supply chain software developers like us will increasingly be subject to infringement claims as the number of products grows. Any claims, with or without merit, could be time-consuming, result in costly litigation, cause product shipment delays, or require us to pay monetary damages or to enter into royalty or licensing agreements, any of which could negatively impact our operating results. There are no assurances that these royalty or licensing agreements, if required, would be available on terms acceptable to us, if at all. We also may be required to indemnify our customers for damages they suffer as a result of such infringement. There are no assurances that legal action claiming patent infringement will not be commenced against us, or that we would prevail in litigation given the complex technical issues and inherent uncertainties in patent litigation. If a patent claim against us were successful and we could not obtain a license on acceptable terms or license a substitute technology or redesign the product or feature to avoid infringement, we may be prevented from distributing our software or required to incur significant expense and delay in developing non-infringing software. Any of these events could seriously harm our business, results of operations, cash flow, and financial condition.\nOur failure to adequately protect our proprietary rights could adversely impact our business, results of operations, cash flow, and financial condition. Our success and ability to compete is dependent in part upon our proprietary technology. There are no assurances that we will be able to protect our proprietary rights against unauthorized disclosure or third-party copying or use. We rely on a combination of copyright, patent, trademark, and trade secret laws, as well as confidentiality agreements, licensing arrangements, and contractual commitments, to establish and protect our proprietary rights. Despite our efforts to protect our proprietary rights, existing copyright, patent, trademark, and trade secret laws afford only limited protection. In addition, the laws of certain foreign countries do not protect our rights to the same extent as do the laws of the United States. Attempts may be made to copy or reverse\nengineer aspects of our products or to obtain and use information that we regard as proprietary. Any infringement of our proprietary rights could negatively impact our future operating results. Furthermore, policing the unauthorized use of our products is difficult, and litigation may be necessary in the future to enforce our intellectual property rights, to protect our trade secrets, or to determine the validity and scope of the proprietary rights of others. Litigation could result in substantial costs and diversion of resources. In turn, our business, results of operations, cash flow, and financial condition could be materially adversely affected.\nRisks Related to Laws and Regulations\nWe may have exposure to additional tax liabilities. As a multinational corporation, we are subject to income taxes in the U.S. and various foreign jurisdictions. Significant judgment is required in determining our global provision for income taxes and other tax liabilities. In the ordinary course of a global business, there are many intercompany transactions and calculations where the ultimate tax determination is uncertain. Our income tax returns are routinely subject to audits by tax authorities. Although we regularly assess the likelihood of adverse outcomes resulting from these examinations to determine our tax estimates, a final determination of tax audits or tax disputes could have an adverse effect on our financial condition, results of operations and cash flows. Also, the earnings of our foreign subsidiaries are considered to be indefinitely reinvested. If our plans change in the future or if we elect to repatriate the unremitted earnings of our foreign subsidiaries in the form of dividends or otherwise, we could be subject to additional local withholding taxes which may result in a higher effective tax rate.\nIn addition, the United States government enacted tax reform and other governments are considering adopting tax reform measures that could impact future effective tax rates favorably or unfavorably. These tax reforms could come in the form of changes in tax rates, changes in the valuation of our deferred tax assets or liabilities, or changes in tax laws or their interpretation. Such changes could have a material adverse impact on our financial results.\nWe are also subject to non-income taxes, such as payroll, sales, use, value-added, net worth, property and goods and services taxes in the U.S. and various foreign jurisdictions. We are regularly under audit by tax authorities with respect to these non-income taxes and may have exposure to additional non-income tax liabilities, which could have an adverse effect on our results of operations, financial condition and cash flows.\nRisks Related to International Operations\nOur international operations have many associated risks. We continue to strategically manage our presence in international markets, and these efforts require significant management attention and financial resources. We may not be able to successfully penetrate international markets, or, if we do, there can be no assurance that we will grow our business in these markets at the same rate as in North America. Because of these inherent complexities and challenges, lack of success in international markets could adversely affect our business, results of operations, cash flow, and financial condition.\nWe have international offices in the Americas: Chile and the United States; in Europe: France, Germany, Italy, the Netherlands, Spain, and the United Kingdom; and in Asia: China, India, Japan, and Singapore; and Australia. We have committed resources to maintaining and further expanding, where appropriate, our sales offices and sales and support channels in key international markets. However, our efforts may not be successful. International sales are subject to many risks and difficulties, including those arising from the following: building and maintaining a competitive presence in new markets; staffing and managing foreign operations; managing international systems integrators; complying with a variety of foreign laws; producing localized versions of our products; import and export restrictions and tariffs, including as a result of a trade war; enforcing contracts and collecting accounts receivable; unexpected changes in regulatory requirements; reduced protection for intellectual property rights in some countries; potential adverse tax treatment; less stringent adherence to ethical and legal standards by prospective customers in some countries; language and cultural barriers; currency fluctuations; political and economic instability abroad; and seasonal fluctuations.\nOur operating results may include foreign currency gains and losses. Due to our international operations, we conduct a portion of our business in currencies other than the United States dollar. Our revenues, expenses, operating profit and net income are affected when the dollar weakens or strengthens in relation to other currencies. In addition, we have a large development center in Bangalore, India, that does not have a natural in-market revenue hedge to mitigate currency risk to our operating expense in India. Fluctuations in the value of other currencies, particularly the Indian Rupee, could materially impact our revenues, expenses, operating profit and net income.\nOur employee retention and hiring may be hindered by immigration restrictions, which could adversely impact our business, results of operations, cash flow, and financial condition. Foreign nationals who are not U.S. citizens or permanent residents constitute a significant part of our professional U.S. workforce. Our ability to hire and retain these workers, and their ability to remain and work in the U.S. are impacted by laws and regulations as well as by processing procedures of various government agencies. Changes in laws, regulations, or procedures may adversely affect our ability to hire or retain such workers and may affect our costs of doing business and/or our ability to deliver services.\nEconomic conditions and regulatory changes caused by the United Kingdom’s exit from the European Union could adversely affect our business. The United Kingdom ceased to be a member state of the European Union on January 31, 2020, commonly referred to as Brexit, and the transition period provided for in the withdrawal agreement entered by the United Kingdom and the European Union ended on December 31, 2020. In December 2020, the United Kingdom and the European Union agreed on a trade and cooperation agreement that covers the general objectives and framework of the relationship between the United Kingdom and the European Union, including as it related to trade, transport, visas, judicial, law enforcement and security matters, and provides for continued participation in community programs and mechanisms for dispute resolution. Notably, under the trade and cooperation agreement, United Kingdom service suppliers no longer benefit from automatic access to the entire European Union single market, United Kingdom goods no longer benefit from the free movement of goods and there is no longer the free movement of people between the United Kingdom and the European Union. Brexit has caused, and may continue to result in, significant volatility in global stock market and currency exchange rate fluctuations of the U.S. dollar relative to other foreign currencies in which we conduct business. While the specific impact of Brexit is not yet known, Brexit may cause our customers to closely monitor their costs and reduce their spending budgets. This could adversely affect our business, financial condition, operating results and cash flows. Our EMEA operations represented approximately 16% of our total revenue for both 2020 and 2019.\nRisks Related to Our Common Stock\nOur stock price has been highly volatile. The trading price of our common stock could be subject to wide fluctuations in response to various factors, including: global macro-economic contraction impacting demand for supply chain solutions; quarterly variations in operating results; announcements of technological innovations or new products by us or our competitors; developments with respect to patents or proprietary rights; changes in financial estimates by securities analysts; and mergers, acquisitions, and combinations involving our competitors or us.\nOur articles of incorporation and bylaws and Georgia law may inhibit a takeover of our company. Our basic corporate documents and Georgia law contain provisions that might enable our management to resist a takeover of our company. These provisions might discourage, delay, or prevent a change in the control of our company or a change in our management. These provisions could also discourage proxy contests and make it more difficult for you and other shareholders to elect directors and take other corporate actions. The existence of these provisions could also limit the price that investors might be willing to pay in the future for shares of our common stock.\nGeneral Risk Factors\nChanges in, or interpretation of, accounting principles could result in unfavorable accounting changes. Our Consolidated Financial Statements are prepared in conformity with U.S. generally accepted accounting principles (GAAP) and accompanying accounting pronouncements, implementation guidelines, and interpretations. These rules are subject to interpretation by the SEC and various bodies formed to interpret and create appropriate accounting principles. Changes in these rules or their interpretation could significantly change our reported results and may even retroactively affect previously reported transactions. Changes resulting from these new accounting standards or the adoption of other new or revised accounting principles may result in materially different financial results and may require that we make changes to our systems, processes and controls. For further detail, please see new accounting pronouncements discussion in Note 1 to the Consolidated Financial Statements.\nAdverse litigation results could affect our business. From time to time, we may be involved in litigation relating to claims arising in the ordinary course of business, and occasionally legal proceeding not in the ordinary course. Litigation can be lengthy, expensive and disruptive to our operations, and can divert our management’s attention away from running our core business. The results of any litigation also cannot be predicted with certainty. An adverse decision could result in monetary damages or injunctive relief that could affect our business, operating results or financial condition. Additional information regarding legal matters in which we are involved, if any, can be found in Note 5 of the Notes to our Consolidated Financial Statements.",
    "item_1B": "Item 1B.\nUnresolved Staff Comments\nNone.",
    "item_2": "Item 2.\nProperties\nOur principal administrative, sales, marketing, support, and research and development facility is located in approximately 221,000 square feet of modern office space in Atlanta, Georgia. Substantially all of this space is leased to us through September 30, 2025. We have an additional office under a multi-year agreement in New Jersey. We also occupy facilities outside of the United States under multi-year agreements in the United Kingdom, the Netherlands, France, Chile, China, Japan, Singapore, India, Italy, and Australia. We also occupy offices under short-term agreements in Germany and Spain. We believe our office space is adequate to meet our immediate needs; however, we may expand into additional facilities in the future.",
    "item_3": "Item 3.\nLegal Proceedings\nFrom time to time, we may be a party to legal proceedings arising in the ordinary course of business, and we could be a party to legal proceedings not in the ordinary course of business. We are not currently a party to any legal proceeding the result of which we believe could have a material adverse impact upon our business, financial position, results of operations, or cash flows.\nMany of our installations involve products that are critical to the operations of our clients’ businesses. Any failure in our products could result in a claim for substantial damages against us, regardless of our responsibility for such failure. Although we attempt to contractually limit our liability for damages arising from product failures or negligent acts or omissions, there can be no assurance that the limitations of liability set forth in our contracts will be enforceable in all instances.",
    "item_4": "Item 4.\nMine Safety Disclosures\nNot applicable.\nPART II",
    "item_5": "Item 5.\nMarket for Registrant’s Common Equity, Related Shareholder Matters, and Issuer Purchases of Equity Securities\nMarket for Common Stock\nOur common stock is traded on the Nasdaq Global Select Market under the symbol “MANH”. The number of registered shareholders of record of our common stock as of January 29, 2021 was 13. The number of record holders does not include persons who held our common stock in nominee or “street name” accounts through brokers.\nWe do not intend to declare or pay cash dividends in the foreseeable future. Our management anticipates that all earnings and other cash resources, if any, will be retained for investment in our business.\nEquity Compensation Plan Information\nIn the following table, we provide information regarding our current equity compensation plans as of December 31, 2020:\nPlan Category\nNumber of securities to\nbe issued upon exercise of outstanding rights\nWeighted-average exercise price of outstanding rights\nNumber of securities remaining available for future issuance under equity compensation plans\nEquity compensation plans\napproved by security holders\n1,462,864\n$0.00\n4,526,518\nEquity compensation plans\nnot approved by security holders\n-\n-\n-\nTotal\n1,462,864\n$0.00\n4,526,518\nYou may find additional information regarding our equity compensation plans in Note 2 of the Notes to our Consolidated Financial Statements.\nPurchase of Equity Securities\nIn the following table, we provide information regarding our common stock repurchases under our publicly-announced share repurchase program for the quarter ended December 31, 2020. Effective April 1, 2020, our Board suspended the Company’s share repurchase program, because of COVID-19-related considerations and until conditions improve for the resumption of the program. Accordingly, during the quarter ended December 31, 2020, the Company did not repurchase any shares of Manhattan Associates common stock under the share repurchase program. The Company’s authorized repurchase limit remains at $50 million.\nPeriod\nTotal Number\nof Shares\nPurchased\nAverage Price\nPaid per Share\nTotal Number of Shares Purchased as Part of Publicly Announced Plans or Programs\nMaximum Number (or Approximate Dollar Value) of Shares that May Yet Be Purchased Under the Plans or Programs\nOctober 1 - October 31, 2020\n-\n-\n-\n$50,000,000\nNovember 1 - November 30, 2020\n-\n-\n-\n50,000,000\nDecember 1 - December 31, 2020\n-\n-\n-\n50,000,000\nTotal\n-\n-\nDuring the year ended December 31, 2020, we repurchased a total of 337,007 shares at an average price per share of $74.18 under our publicly-announced share repurchase program. In January 2021, our Board of Directors authorized the Company to repurchase up to an aggregate of $50 million of the Company’s common stock.",
    "item_6": "Item 6.\nSelected Financial Data\nYou should read the following selected consolidated financial data in conjunction with our Consolidated Financial Statements and related Notes thereto and with “Management’s Discussion and Analysis of Financial Condition and Results of Operations” included elsewhere in this Form 10-K. The statement of income and cash flow data for the years ended December 31, 2020, 2019 and 2018, and the balance sheet data as of December 31, 2020 and 2019, are derived from, and are qualified by reference to, the audited financial statements included elsewhere in this Form 10-K. The statement of income and cash flow data for the years ended December 31, 2017 (“2017”) and 2016 (“2016”) and the balance sheet data as of December 31, 2018, 2017, and 2016 are derived from audited financial statements not included herein. Historical results are not necessarily indicative of results to be expected in the future.\nYear Ended December 31,\n(in thousands, except per share data)\nStatement of Income Data:\nCloud subscriptions\n$\n5,783\n$\n9,596\n$\n23,104\n$\n46,831\n$\n79,830\nSoftware license\n$\n79,213\n$\n72,313\n$\n45,368\n$\n48,855\n$\n38,284\nTotal revenue\n$\n604,557\n$\n594,599\n$\n559,157\n$\n617,949\n$\n586,372\nOperating income\n$\n194,307\n$\n185,645\n$\n133,887\n$\n115,924\n$\n114,061\nNet income\n$\n124,234\n$\n116,481\n$\n104,690\n$\n85,762\n$\n87,240\nEarnings per diluted share\n$\n1.72\n$\n1.68\n$\n1.58\n$\n1.32\n$\n1.36\nDecember 31,\n(in thousands)\nBalance Sheet Data:\nCash, cash equivalents and investments\n$\n95,615\n$\n125,522\n$\n100,566\n$\n110,678\n$\n204,705\nTotal assets\n$\n297,140\n$\n314,995\n$\n307,150\n$\n372,279\n$\n465,412\nDebt\n$ -\n$ -\n$ -\n$ -\n$\n-\nShareholders' equity\n$\n169,366\n$\n174,956\n$\n147,147\n$\n142,278\n$\n218,897\nYear Ended December 31,\n(in thousands)\nStatement of Cash Flow Data:\nOperating cash flow\n$\n139,346\n$\n164,066\n$\n137,349\n$\n146,908\n$\n140,885",
    "item_7": "Item 7.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nAll statements, trend analyses, and other information contained in the following discussion relative to markets for our products and trends in revenue, gross margins, and anticipated expense levels, as well as other statements including words such as “may,” “expect,” “forecast,” “anticipate,” “intend,” “plan,” “believe,” “could,” “seek,” “project,” “estimate,” and other similar expressions constitute forward-looking statements. These forward-looking statements are subject to business and economic risks and uncertainties, including those discussed under the caption “Risk Factors” in Item 1A of this Form 10-K, and our actual results of operations may differ materially from those contained in the forward-looking statements.\nBusiness Overview\nWe develop, sell, deploy, service and maintain software solutions designed to manage supply chains, inventory and omnichannel operations for retailers, wholesalers, manufacturers, logistics providers and other organizations. Our customers include many of the world’s most premier and profitable brands.\nOur business model is singularly focused on the development and implementation of complex commerce enablement software solutions that are designed to optimize supply chains, and retail store operations including point of sale effectiveness and efficiency for our customers.\nWe have five principal sources of revenue:\n●\ncloud subscriptions, including software as a service (SaaS) and hosting of software;\n●\nlicenses of our software;\n●\ncustomer support services and software enhancements (collectively, “maintenance”);\n●\nprofessional services, including solutions planning and implementation, related consulting, customer training, and reimbursements from customers for out-of-pocket expenses (collectively, “services”); and\n●\nhardware sales.\nIn 2020, we generated $586.4 million in total revenue, with a revenue mix of: cloud subscriptions 14%; software license 6%; maintenance 25%; services revenue 52%; and hardware 3%.\nWe have three geographic reportable segments: the Americas, EMEA, and APAC. Geographic revenue is based on the location of the sale. Our international revenue was approximately $178.1 million, $189.1 million and $174.1 million for the years ended December 31, 2020, 2019 and 2018, respectively, which represents approximately 30%, 31% and 31% of our total revenue for the years ended December 31, 2020, 2019 and 2018, respectively. International revenue includes all revenue derived from sales to customers outside the United States. At December 31, 2020, we employed approximately 3,400 employees worldwide. We have offices in Australia, Chile, China, France, Germany, India, Italy, Japan, the Netherlands, Singapore, Spain, and the United Kingdom, as well as representatives in Mexico and reseller partnerships in Latin America, Eastern Europe, the Middle East, South Africa, and Asia.\nFuture Expectations\nRegarding the impact of the novel coronavirus disease (“COVID-19”) pandemic, we remain cautious about the global recovery, which we expect to be slow and protracted. In 2020, we experienced solid demand for our cloud-based supply chain and omnichannel commerce solutions and our competitive win rates remain strong. In May, we launched Manhattan Active® Warehouse Management, the next generation of Warehouse Management solutions. We have rearchitected our warehouse management solution from the ground up as a cloud-native, microservices based, versionless application. The reception has been positive and pipeline opportunities continue to build. Our solutions are mission critical, supporting large and complex, global supply chains. While we are experiencing strong demand and expect continued growth for our Cloud solutions, sales cycles could be extended as customers and prospects continue to evaluate our industry leading, modern solutions, including Manhattan Active Warehouse Management. Our Professional Services revenue for the year ended December 31, 2020 is approximately 16% lower, and excluding billed travel, approximately 13% lower than the year ended December 31, 2019, as clients delay projects due to COVID-19. We have had no notable cancellations in 2020. For 2021, we expect Services revenue to grow fueled by Cloud revenue growth. We expect Q1 2021 Services revenue to decrease\nagainst an all-time record Q1 2020 comparison. While COVID-19 could create some near-term fluctuations, we are forecasting for improving year over year growth for the remaining balance of 2021.\nWe have taken steps to best protect the health and safety of our employees globally. Our daily execution has evolved largely into a virtual model, but we believe we have been successful in maintaining our ability to effectively communicate with and service our customers and customer prospects during the pandemic period.\nAs previously announced, effective April 1, 2020, we took temporary actions to manage operating expenses and cash flow, including reduction of officer salaries and board of directors’ fees, and suspension of our 401k plan company match. We also temporarily suspended our share repurchase program. These actions did not materially impact our ability to support our customers or make key investments in research and development to further extend our competitive positioning. We continue to monitor and aggressively managing operating expenses globally. We also will continue to actively monitor the situation and may take further actions that modify our business operations as may be required by federal, state or local authorities or that we determine are in the best interests of our employees, customers, and partners.\nGoing forward, we are investing significantly in our transition to a cloud business, including enterprise investments in innovation, and strategic operating expenses to support growth objectives. Our pace of investment and timing combined with global macroeconomic conditions and disruptions related to COVID-19 as a whole, have impacted and may continue to impact revenue and earnings growth, based on timing of recovery. The pace at which the market for our products transitions from perpetual license to cloud subscriptions, resulting in revenue recognition spread out over the subscription period rather than up front, combined with extended lead times for developing new business, can cause uncertainty for our future expectations, impacting our ability to accurately forecast bookings and revenues from quarter to quarter and over the longer term.\nFor 2021, our five strategic goals continue to be:\n•Focus on customer success and drive sustainable long-term growth;\n•Invest in innovation to expand our products and total addressable market;\n•Expand our Manhattan Active Suite of Cloud Solutions;\n•Develop and grow our cloud business and cloud subscription revenue; and\n•Expand our global sales and marketing teams.\nCloud Subscription\nHistorically, our software licenses were sold as perpetual licenses, under which customers own the software license and revenue is recognized at the time of sale. In 2017, we released Manhattan Active™ Solutions, accelerating our business transition to cloud subscriptions. Under a cloud subscription, customers pay a periodic fee for the right to use our software within a cloud-based environment that we provide and manage over a specified period of time. As part of our subscription program, we allow our existing customers to convert their maintenance contracts to cloud subscription contracts. Some customers have converted their maintenance contracts to cloud subscriptions, and we expect there will be continued opportunities to convert existing maintenance contracts to cloud subscription contracts in the future.\nWith the launch of Manhattan Active™ Solutions, in year 3 of our cloud transition, demand for our cloud solutions is the dominant preference of customers. Our perpetual license solutions are rapidly attritting due to market demand for Cloud with 90% of our pipeline representing cloud. Cloud is our fastest growing revenue line and represents 68% of total software revenue in 2020. We believe the reduction in License and maintenance revenue in favor of our Cloud based offerings is positive for our customers and Manhattan Associates.\nGlobal Economic Trends and Industry Factors\nGlobal macro-economic trends, technology spending, and supply chain management market growth are important barometers for our business. In 2020, approximately 70% of our total revenue was generated in the United States, 16% in EMEA, and the remaining balance in APAC, Canada, and Latin America. In addition, Gartner Inc., an information technology research and advisory company, estimates that nearly 80% of every supply chain software solutions dollar invested is spent in North America and Western Europe; consequently, the health of the U.S. and the Western European economies have a meaningful impact on our financial results.\nWe sell technology-based solutions with total pricing, including software and services, in many cases exceeding $1.0 million. Our software is often a part of our customers’ and prospects’ much larger capital commitment associated with facilities expansion and business improvement. We believe that, given the lingering uncertainty in the global macro environment primarily in the retail industry, the current sales cycles for large license sales and cloud subscriptions of $1.0 million or greater in our target markets have been extended. The current business climate within the United States and geographic regions in which we operate continues to affect customers’ and prospects’ decisions regarding timing of strategic capital expenditures. Delays with respect to such decisions can have a material adverse impact on our business, and may further intensify competition in our already highly competitive markets.\nIn January 2021, the International Monetary Fund (IMF) provided a World Economic Outlook (WEO) update. The WEO update noted, “the global economy is projected to grow 5.5 percent in 2021 and 4.2 percent in 2022. The 2021 forecast is revised up 0.3 percentage point relative to the previous forecast, reflecting expectations of a vaccine-powered strengthening of activity later in the year and additional policy support in a few large economies.”\nThe WEO update projected that advanced economies, which represent our primary revenue markets, would grow at about 4.3 and 3.1 percent in 2021 and 2022, while the emerging and developing economies would grow at about 6.3 percent in 2021 and 5.0 percent in 2022.\nWhile we are encouraged by our results, we, along with many of our customers, still remain cautious regarding the pace of global economic growth. We believe global geopolitical and economic volatility associated with the pandemic likely will continue to shape customers’ and prospects’ enterprise software buying decisions, making it challenging to forecast sales cycles for our products and the timing of large enterprise software license and cloud subscription sales.\nRevenue\nCloud Subscriptions and Software License revenue: Cloud subscriptions revenue and remaining performance obligation growth are the leading indicators of our business performance, primarily derived from cloud subscription fees that customers pay for supply chain solutions. Since we announced our transition to becoming a cloud-first company in 2017 with our launch of Manhattan Active Solutions, we have continued to see a significant shift in demand for cloud solutions versus software license. By comparison, in 2016, cloud subscriptions and software license revenue represented 7% and 93%, respectively, of our total cloud and software license revenue mix. In the full year ended 2020, cloud subscriptions and software license revenue were 68% and 32%, respectively, of our total cloud subscriptions and software license revenue mix. Going forward, we expect cloud revenue to increase as a percentage of total software and cloud revenue mix as market demand for cloud solutions is supplanting legacy perpetual license demand.\nIn 2020, cloud subscriptions revenue totaled $79.8 million, or 14% of total revenue. The Americas, EMEA, and APAC segments recognized $69.5 million, $8.4 million and $1.9 million in cloud subscriptions revenue, respectively, in 2020. Cloud subscriptions revenue is recognized ratably over the term of the agreement, typically 36 to 60 months.\nIn 2020, license revenue totaled $38.3 million, or 6% of total revenue, with gross margins of 92.4%. The Americas, EMEA, and APAC segments totaled $30.5 million, $4.3 million, and $3.5 million in license revenue, respectively, in 2020. The percentage mix of new to existing customers for the combination of cloud subscriptions and software license sales was approximately 20/80 in 2020.\nCloud subscriptions and software license revenue growth is influenced by the strength of general economic and business conditions and the competitive position of our software products. These revenues generally have long sales cycles. In addition, the timing of the closing of a few large software license transactions can have a material impact on our software license revenues, operating profit, operating margins and earnings per share. For example, $0.8 million of either pre-tax profit or expense in 2020 equates to approximately one cent of diluted earnings per share impact.\nOur software solutions are focused on core supply chain commerce operations (Warehouse Management, Transportation Management and Labor Management), Inventory optimization and Omnichannel operations (e-commerce, retail store operations and point of sale), which are intensely competitive markets characterized by rapid technological change. We are a market leader in the supply chain management and omnichannel software solutions market as defined by industry analysts such as ARC Advisory Group and Gartner. Our goal is to extend our position as a leading global supply chain solutions provider by growing our software license and cloud subscriptions revenues faster than our competitors through investment in innovation. We expect to continue to face increased competition from Enterprise Resource Planning (ERP) and Supply Chain Management applications vendors and business application software vendors that may broaden their solutions offerings by internally developing, or by acquiring or partnering with independent developers of supply chain planning and execution software. Increased competition could result in price reductions, fewer customer orders, reduced gross margins, and loss of market share.\nMaintenance Revenue: Our maintenance revenue totaled $147.7 million, or 25% of total revenue. The Americas, EMEA and APAC segments recognized $116.3 million, $22.2 million, and $9.2 million, respectively, in maintenance revenue in 2020. For maintenance, we offer a comprehensive 24 hours per day, 365 days per year program that provides our customers with software upgrades, when and if available, which include additional or improved functionality and technological advances incorporating emerging supply chain and industry initiatives. The growth of maintenance revenues is influenced by: (1) new software license revenue growth; (2) annual renewal of support contracts; (3) increase in customers through acquisitions; (4) fluctuations in currency rates, and (5) conversion of maintenance contracts to cloud subscription contracts. Substantially all of our customers renew their annual support contracts. Over the last three years, our annual revenue renewal rate of customers subscribing to comprehensive support and enhancements has been greater than 90%. Maintenance revenue is generally paid in advance and recognized ratably over the term of the agreement, typically twelve months. Maintenance renewal revenue is recognized over the renewal period once we have a contract upon payment from the customer.\nServices Revenue: In 2020, our services revenue totaled $303.6 million, or 52% of total revenue. The Americas, EMEA, and APAC segments recognized $232.9 million, $58.4 million, and $12.3 million, respectively. Due to our large services revenue mix as a percentage of total revenue, our consolidated operating margin profile may be lower than those of our competitors, and while we believe our services margins are strong, they do lower our operating margin profile as services margins are inherently lower than the margin for software license revenue and some of our other revenue sources.\nOur professional services organization provides our customers with expertise and assistance in planning and implementing our solutions. To ensure a successful product implementation, consultants assist customers with the initial installation of a system, the conversion and transfer of the customer’s historical data onto our system, and ongoing training, education, and system upgrades. We believe our professional services enable customers to implement our software rapidly, ensure the customer’s success with our solutions, strengthen our customer relationships, and add to our industry-specific knowledge base for use in future implementations and product innovations.\nAlthough our professional services are optional, the majority of our customers use at least some portion of these services for their planning, implementation, or related needs. Professional services are typically rendered under time and materials-based contracts with services typically billed on an hourly basis. Professional services are sometimes rendered under fixed-fee based contracts with payments due on specific dates or milestones.\nServices revenue growth is contingent upon software license revenue, cloud subscriptions and customer upgrade cycles, which are influenced by the strength of general economic and business conditions and the competitive position of our software products. In addition, our professional services business has competitive exposure to offshore providers and other consulting companies. All of these factors potentially create the risk of pricing pressure, fewer customer orders, reduced gross margins, and loss of market share.\nHardware Revenue: Our hardware revenue, which we recognize net of related costs as of January 1, 2018, totaled $16.9 million in 2020 representing 3% of total revenue. In conjunction with the licensing of our software, and as a convenience for our customers, we resell a variety of hardware products developed and manufactured by third parties. These products include computer hardware, radio frequency terminal networks, RFID chip readers, bar code printers and scanners, and other peripherals. We resell all third-party hardware products and related maintenance pursuant to agreements with manufacturers or through distributor-authorized reseller agreements pursuant to which we are entitled to purchase hardware products and services at discount prices. We generally purchase hardware from our vendors only after receiving an order from a customer. As a result, we do not maintain hardware inventory.\nProduct Development\nWe continue to invest significantly in research and development (R&D) to provide leading solutions that help global retailers, manufacturers, wholesalers, distributors and logistics providers successfully manage accelerating and fluctuating demands as well as the increasing complexity and volatility of their local and global supply chains, retail store operations and point of sale. Our R&D expenses for the years ended December 31, 2020, 2019 and 2018 were $84.3 million, $87.6 million, and $71.9 million, respectively.\nWe expect to continue to focus our R&D resources on the development and enhancement of our core supply chain, inventory optimization, omnichannel and point of sale software solutions. We offer what we believe to be the broadest solutions portfolio in the supply chain solutions marketplace, to address all aspects of inventory optimization, transportation management, distribution management, planning, and omnichannel operations including order management, store inventory & fulfillment, call center and point of sale.\nWe also plan to continue to enhance our existing solutions and to introduce new solutions to address evolving industry standards and market needs. We identify opportunities to further enhance our solutions and to develop and provide new solutions through our customer support organization, as well as through ongoing customer consulting engagements and implementations, interactions with our user groups, association with leading industry analysts and market research firms, and participation in industry standards and research committees. Our solutions address the needs of customers in various vertical markets, including retail, consumer goods, food and grocery logistics service providers, industrial and wholesale, high technology and electronics, life sciences, and government.\nCash Flow and Financial Condition\nFor 2020, we generated cash flow from operating activities of $140.9 million and have generated a cumulative total of $425.1 million for the three years ended December 31, 2020. Our cash at December 31, 2020 totaled $204.7 million, with no debt on our balance sheet. We currently have no credit facilities. During the past three years, our primary uses of cash have been for funding investments in R&D, in operations to drive earnings growth, and in repurchases of our common stock.\nDuring 2020, we repurchased approximately $25.0 million of Manhattan Associates’ outstanding common stock under the share repurchase program approved by our Board of Directors. In April 2020, the Company suspended its share repurchase program because of COVID-19-related considerations. Accordingly, during the second, third and fourth quarters of 2020, the Company did not\nrepurchase any shares of Manhattan Associates common stock under the share repurchase program. The Company’s authorized repurchase limit remains at $50 million.\nIn 2021, our priorities for use of cash will continue to be investments in product development and in our business supporting the transition to Cloud. We expect to continue to evaluate acquisition opportunities that are complementary to our product footprint and technology direction. We also expect to continue weigh our share repurchase options against cash for acquisitions and investing in the business. We do not anticipate any borrowing requirements in 2021 for general corporate purposes.\nFull Year 2020 Financial Summary\n●\nDiluted earnings per share: $1.36 for 2020 compared to $1.32 for 2019;\n●\nConsolidated revenue: $586.4 million for 2020 compared to $617.9 million for 2019;\n●\nCloud subscription revenue: $79.8 million for 2020 compared to $46.8 million for 2019;\n●\nLicense revenue: $38.3 million for 2020 compared to $48.9 million for 2019;\n●\nOperating income: $114.1 million for 2020 compared to $115.9 million for 2019;\n●\nOperating margins: 19.5% for 2020 compared to operating margins of 18.8% for 2019;\n●\nCash flow from operations: $140.9 million for 2020 compared to $146.9 million for 2019;\n●\nCash and investments: $204.7 million at December 31, 2020 compared to $110.7 million at December 31, 2019; and\n●\nShare repurchases: During the three months ended March 31, 2020, we repurchased 337,007 shares of Manhattan Associates’ outstanding common stock for approximately $25.0 million under the share repurchase program approved by our Board of Directors. In April 2020, the Company suspended its share repurchase program because of COVID-19-related considerations. Accordingly, during the second, third and fourth quarters of 2020, the Company did not repurchase any shares of Manhattan Associates common stock under the share repurchase program. In January 2021, our Board of Directors authorized the Company to repurchase up to an aggregate of $50 million of the Company’s common stock.\nResults of Operations\nIn the following table, we present a selection of certain Statement of Income data for 2020, 2019 and 2018. With our transition to and growth in cloud subscriptions, which began in 2017, we believe separate disclosures of our software license, cloud subscriptions, maintenance and services revenue is meaningful to investors and provides an important measure of our business performance.\nYear Ended December 31,\n% Change vs. Prior Year\n(in thousands)\nRevenue:\nCloud subscriptions\n$\n79,830\n$\n46,831\n$\n23,104\n70%\n103%\nSoftware license\n38,284\n48,855\n45,368\n-22%\n8%\nMaintenance\n147,748\n149,230\n147,033\n-1%\n1%\nServices\n303,569\n360,516\n329,685\n-16%\n9%\nHardware\n16,941\n12,517\n13,967\n35%\n-10%\nTotal revenue\n586,372\n617,949\n559,157\n-5%\n11%\nCosts and expenses:\nCost of software license\n2,894\n2,626\n5,297\n10%\n-50%\nCost of cloud subscriptions, maintenance and services\n266,993\n282,341\n235,584\n-5%\n20%\nResearch and development\n84,276\n87,608\n71,896\n-4%\n22%\nSales and marketing\n47,758\n56,860\n51,262\n-16%\n11%\nGeneral and administrative\n61,444\n64,603\n52,618\n-5%\n23%\nDepreciation and amortization\n8,946\n7,987\n8,613\n12%\n-7%\nTotal costs and expenses\n472,311\n502,025\n425,270\n-6%\n18%\nIncome from operations\n$\n114,061\n$\n115,924\n$\n133,887\n-2%\n-13%\nOperating margin\n19.5\n%\n18.8\n%\n23.9\n%\nWe have three geographic reportable segments: the Americas, EMEA, and APAC. Geographic revenue information is based on the location of sale. The revenues represented below are from external customers only. The geography-based expenses include costs of personnel, direct sales, marketing expenses, and general and administrative costs to support the business. There are certain corporate expenses included in the Americas segment that we do not charge to the other segments including research and development, certain marketing and general and administrative costs that support the global organization, and the amortization of acquired developed technology. Included in the Americas costs are all research and development costs, including the costs associated with our operations in India. During 2020, 2019, or 2018, we derived the majority of our revenues from sales to customers within our Americas segment. In the following table, we present a summary of revenue and operating profit by segment:\nYear Ended December 31,\n% Change vs. Prior Year\nRevenue:\n(in thousands)\nCloud subscriptions\nAmericas\n$\n69,469\n$\n40,927\n$\n20,611\n70%\n99%\nEMEA\n8,465\n4,762\n2,075\n78%\n129%\nAPAC\n1,896\n1,142\n66%\n173%\nTotal cloud subscriptions\n79,830\n46,831\n23,104\n70%\n103%\nSoftware license\nAmericas\n30,509\n34,544\n28,423\n-12%\n22%\nEMEA\n4,308\n11,518\n11,406\n-63%\n1%\nAPAC\n3,467\n2,793\n5,539\n24%\n-50%\nTotal software license\n38,284\n48,855\n45,368\n-22%\n8%\nMaintenance\nAmericas\n116,309\n118,891\n117,489\n-2%\n1%\nEMEA\n22,208\n21,322\n20,933\n4%\n2%\nAPAC\n9,231\n9,017\n8,611\n2%\n5%\nTotal maintenance\n147,748\n149,230\n147,033\n-1%\n1%\nServices\nAmericas\n232,954\n283,008\n265,165\n-18%\n7%\nEMEA\n58,360\n60,618\n50,328\n-4%\n20%\nAPAC\n12,255\n16,890\n14,192\n-27%\n19%\nTotal services\n303,569\n360,516\n329,685\n-16%\n9%\nHardware\nAmericas\n16,698\n12,464\n13,798\n34%\n-10%\nEMEA\n355%\n2550%\nAPAC\n-\nNA\n-100%\nTotal hardware\n16,941\n12,517\n13,967\n35%\n-10%\nTotal Revenue\nAmericas\n465,939\n489,834\n445,486\n-5%\n10%\nEMEA\n93,582\n98,273\n84,744\n-5%\n16%\nAPAC\n26,851\n29,842\n28,927\n-10%\n3%\nTotal revenue\n$\n586,372\n$\n617,949\n$\n559,157\n-5%\n11%\nOperating income:\nAmericas\n$\n81,109\n$\n78,624\n$\n97,529\n3%\n-19%\nEMEA\n24,637\n26,934\n26,437\n-9%\n2%\nAPAC\n8,315\n10,366\n9,921\n-20%\n4%\nTotal operating income\n$\n114,061\n$\n115,924\n$\n133,887\n-2%\n-13%\nThe consolidated results of our operations for the years ended December 31, 2020, 2019 and 2018 are discussed below.\nRevenue\nOur revenue consists of fees generated from cloud subscriptions, software licensing, maintenance, professional services, and hardware sales.\nYear Ended December 31,\n% Change vs. Prior Year\n% of Total Revenue\n(in thousands)\nCloud subscriptions\n$\n79,830\n$\n46,831\n$\n23,104\n%\n%\n%\n%\n%\nSoftware license\n38,284\n48,855\n45,368\n%\n%\n%\n%\n%\nMaintenance\n147,748\n149,230\n147,033\n%\n%\n%\n%\n%\nServices\n303,569\n360,516\n329,685\n%\n%\n%\n%\n%\nHardware\n16,941\n12,517\n13,967\n%\n%\n%\n%\n%\nTotal revenue\n$\n586,372\n$\n617,949\n$\n559,157\n%\n%\n%\n%\n%\nCloud Subscriptions Revenue\nYear 2020 compared with year 2019\nIn 2017, we released Manhattan Active™ Solutions accelerating our business transition to cloud subscriptions. As a result, cloud subscriptions revenue increased $33.0 million to $79.8 million in 2020 compared to 2019 as customers continue to purchase our SaaS offerings rather than a traditional perpetual license. Our customers increasingly prefer cloud-based solutions, including existing customers that are migrating from on-premise to cloud-based offerings. Cloud subscriptions revenue for the Americas, EMEA and APAC segments increased $28.5 million, $3.7 million and $0.8 million, respectively.\nYear 2019 compared with year 2018\nCloud subscriptions revenue increased $23.7 million to $46.8 million in 2019 compared to 2018 as customers began to purchase our SaaS offerings rather than a traditional perpetual license. Our customers increasingly prefer cloud-based solutions, including existing customers that are migrating from on-premise to cloud-based offerings. Cloud subscriptions revenue for the Americas, EMEA and APAC segments increased $20.3 million, $2.7 million and $0.7 million, respectively.\nSoftware License Revenue\nYear 2020 compared with year 2019\nSoftware license revenue decreased $10.6 million to $38.3 million in 2020 compared to 2019 as customers continue to purchase our SaaS offerings rather than a traditional perpetual license. Our license revenue performance depends on the number and relative value of large deals we close in the period. License revenue for the Americas and EMEA segments decreased $4.0 million and $7.2 million, respectively, and license revenue for the APAC segment increased $0.6 million, in 2020 over 2019.\nThe perpetual license sales percentage mix across our product suite in 2020 was approximately 80% warehouse management solutions.\nYear 2019 compared with year 2018\nSoftware license revenue increased $3.5 million to $48.9 million in 2019 compared to 2018. License revenue for the Americas and EMEA segments increased $6.1 million and $0.1 million, respectively, and license revenue for the APAC segment decreased $2.7 million, in 2019 over 2018.\nThe perpetual license sales percentage mix across our product suite in 2019 was approximately 80% warehouse management solutions.\nMaintenance Revenue\nYear 2020 compared with year 2019\nMaintenance revenue decreased $1.5 million in 2020 compared to 2019. Maintenance revenue for the Americas segments decreased $2.6 million, while the EMEA and APAC segments increased $0.9 million and $0.2 million compared to 2019, respectively.\nYear 2019 compared with year 2018\nMaintenance revenue increased $2.2 million in 2019 compared to 2018 primarily due to (1) an increase in the first-year maintenance revenue; (2) our annual renewal rate of customers subscribing to maintenance, which was greater than 90%; and (3) increases in the maintenance renewal prices. Maintenance revenue for the Americas, EMEA and APAC segments increased $1.4 million, $0.4 million and $0.4 million, respectively, compared to 2018.\nServices Revenue\nYear 2020 compared with year 2019\nServices revenue decreased $56.9 million in 2020 compared to 2019. The Americas, EMEA and APAC segments decreased $50.0 million, $2.3 million and $4.6 million, respectively, compared to 2019. The decline in services revenue was primarily due to some customers delaying project implementation and upgrades as a result of the COVID-19 pandemic.\nYear 2019 compared with year 2018\nServices revenue increased $30.8 million in 2019 compared to 2018. The Americas, EMEA and APAC segments increased $17.8 million, $10.3 million and $2.7 million, respectively, compared to 2018.\nHardware Revenue\nHardware revenue, net increased $4.4 million in 2020 compared to 2019. Hardware revenue, net decreased $1.5 million in 2019 compared to 2018. The majority of hardware sales are derived from our Americas segment. Sales of hardware are largely dependent upon customer-specific desires, which fluctuate.\nCost of Revenue\nYear Ended December 31,\n% Change vs. Prior Year\n(in thousands)\nCost of software license\n$\n2,894\n$\n2,626\n$\n5,297\n10%\n-50%\nCost of cloud subscriptions, maintenance and services\n266,993\n282,341\n235,584\n-5%\n20%\nTotal cost of revenue\n$\n269,887\n$\n284,967\n$\n240,881\n-5%\n18%\nCost of Software License\nCost of software license consists of the costs associated with software reproduction; media, packaging and delivery; documentation, and other related costs; and royalties on third-party software sold with or as part of our products. In 2020, cost of license increased by $0.3 million, compared to 2019. In 2019, cost of software license decreased $2.7 million compared to 2018 principally due to a $1.7 million decrease in third-party software license fees and a $1.0 million decrease in royalty costs.\nCost of Cloud Subscriptions, Maintenance and Services\nYear 2020 compared with year 2019\nCost of cloud subscriptions, maintenance and services consists primarily of salaries and other personnel-related expenses of employees dedicated to cloud subscriptions; maintenance services; and professional and technical services as well as hosting fees. The $15.3 million decrease in 2020 compared to 2019 was principally due to a $18.7 million decrease in travel expense, a $7.4 million\ndecrease in performance-based compensation expense and a $0.7 million decrease in facilities expense, offset by a $6.1 million increase in compensation and other personnel-related expense, and a $7.0 million increase in computer infrastructure costs related to cloud business transition.\nYear 2019 compared with year 2018\nThe $46.8 million increase in 2019 compared to 2018 was principally due to a $25.8 million increase in compensation and other personnel-related expense resulting from increased headcount in cloud operations and professional services, a $9.4 million increase in performance-based compensation expense, and a $8.5 million increase in computer infrastructure costs related to cloud business transition.\nOperating Expenses\nYear Ended December 31,\n% Change vs. Prior Year\n(in thousands)\nResearch and development\n$\n84,276\n$\n87,608\n$\n71,896\n-4%\n22%\nSales and marketing\n47,758\n56,860\n51,262\n-16%\n11%\nGeneral and administrative\n61,444\n64,603\n52,618\n-5%\n23%\nDepreciation and amortization\n8,946\n7,987\n8,613\n12%\n-7%\nOperating expenses\n$\n202,424\n$\n217,058\n$\n184,389\n-7%\n18%\nResearch and Development\nOur principal research and development (R&D) activities during 2020, 2019 and 2018 focused on the expansion and integration of new products and releases, while expanding the product footprint of our software solution suites in Supply Chain, Inventory Optimization and Omnichannel including cloud-based solutions, point-of-sale and tablet retailing.\nFor 2020, 2019 and 2018, we did not capitalize any R&D costs because the costs incurred following the attainment of technological feasibility for the related software product through the date of general release were insignificant.\nYear 2020 compared with year 2019\nR&D expenses primarily consist of salaries and other personnel-related costs for personnel involved in our research and development activities. Research and development expenses in 2020 decreased by $3.3 million compared to 2019. This decrease is principally due to a $2.0 million decrease in performance-based compensation expense, and a $1.1 million decrease in travel related expense.\nYear 2019 compared with year 2018\nResearch and development expenses in 2019 increased by $15.7 million compared to 2018. This increase is primarily due to a $10.6 million increase in compensation and other personnel-related expenses, $3.0 million increase in performance-based compensation expense, and $1.7 million increase in computer infrastructure costs, resulting from increased headcount to support R&D activities.\nSales and Marketing\nYear 2020 compared with year 2019\nSales and marketing expenses include salaries, commissions, travel and other personnel-related costs and the costs of our marketing and alliance programs and related activities. Sales and marketing expenses decreased by $9.1 million in 2020 compared to 2019, primarily due to a $3.1 million decrease in marketing and campaign programs, a $2.7 million decrease in performance-based compensation expense, and a $2.6 million decrease in travel expenses.\nYear 2019 compared with year 2018\nSales and marketing expenses increased $5.6 million in 2019 compared to 2018, primarily due to a $4.9 million increase in performance-based compensation expense and a $2.5 million increase in compensation and other personnel-related expenses, offset by a $1.9 million decrease in marketing related expenses.\nGeneral and Administrative\nYear 2020 compared with year 2019\nGeneral and administrative expenses consist primarily of salaries and other personnel-related costs of executive, financial, human resources, information technology, and administrative personnel, as well as facilities, legal, insurance, accounting, and other administrative expenses. General and administrative expenses decreased $3.2 million in 2020 primarily due to a $1.5 million decrease in performance-based compensation expense, a $0.5 million decrease in compensation and other personnel-related expenses, and a $0.5 million decrease in corporate event-related expenses.\nYear 2019 compared with year 2018\nGeneral and administrative expenses increased $12.0 million in 2019 primarily attributable to a $8.9 million increase in compensation and other personnel-related expenses resulting from increased headcount, a $1.9 million increase in performance-based compensation expense, and a $1.1 million increase in computer infrastructure costs.\nDepreciation and Amortization\nDepreciation and amortization of intangibles and software expense amounted to $8.9 million, $8.0 million, and $8.6 million in 2020, 2019 and 2018, respectively. Amortization of intangibles was immaterial in 2020, 2019 and 2018. We have recorded goodwill and other acquisition-related intangible assets as part of the purchase accounting associated with various acquisitions.\nOperating Income\nOperating income in 2020 decreased $1.8 million to $114.1 million, compared to $115.9 million for 2019. Operating margins were 19.5% for 2020 versus 18.8% for 2019. Operating income has decreased due to lower services revenue as we noticed some delays as a result of the COVID-19 pandemic. In 2020, operating income in the Americas segment increased by $2.5 million, and decreased in the EMEA and APAC segments by $2.3 million and $2.0 million, respectively.\nOperating income in 2019 decreased $18.0 million to $115.9 million, compared to $133.9 million for 2018. Operating margins were 18.8% for 2019 versus 23.9% for 2018. Operating income and margin decreased primarily due to our commitment to strategically invest in a business transition to a cloud first company focused on delivering long-term sustainable growth and earnings leverage. As a result, we are investing significantly in R&D to deliver new innovation, cloud operations headcount, infrastructure and technology to support our ability to scale our cloud business to achieve our growth objectives. In addition, our innovation releases have fueled strong demand for our global consulting services and we are actively hiring to fulfill customer demand, which pressures operating income and margins until new resources ramp to full utilization. Finally, our performance-based compensation expense has increased over the prior year based on strong execution against target objectives. In 2019, operating income in the Americas segment decreased by $18.9 million and remained relatively flat in the EMEA and APAC segments.\nOther Income and Income Taxes\nYear Ended December 31,\n% Change vs. Prior Year\nOther (loss) income, net\n$\n(285\n)\n$\n$\n2,344\n-286%\n-93%\nIncome tax provision\n26,536\n30,315\n31,541\n-12%\n-4%\nOther (Loss) Income, net\nOther (loss) income, net primarily includes interest income, foreign currency gains and losses, and other non-operating expenses. Interest income was $0.1 million, $0.7 million and $1.1 million for 2020, 2019 and 2018, respectively. The weighted-average interest rate earned on cash and investments was immaterial for 2020, 2019 and 2018. We recorded net foreign currency losses of $0.4 million and $1.0 million in 2020 and 2019, respectively, and a net foreign currency gain of $1.3 million in 2018. The foreign currency gains\nand losses mainly resulted from gains or losses on intercompany transactions denominated in foreign currencies with subsidiaries due to the fluctuation of the U.S. dollar relative to other foreign currencies, primarily the Euro and the Indian Rupee.\nIncome Tax Provision\nOur effective income tax rates were 23.3%, 26.1%, and 23.2% in 2020, 2019 and 2018, respectively. Our effective income tax rate takes into account the source of taxable income, domestically by state and internationally by country, and available income tax credits.\nThe effective tax rate in 2020 decreased from 2019 is mainly due to an increase of excess tax benefits on restricted stock vesting and a decrease in expense for tax contingencies. These benefits were partially offset by a net increase in non-deductible equity-based compensation.\nThe effective income tax rate in 2019 increased from 2018 mainly due to an increase in tax contingencies and a decrease in excess tax benefits on restricted stock vesting.\nThe income tax provision for 2020, 2019 and 2018 included excess tax benefits of $3.8 million, $0.2 million, and $0.8 million on vesting of restricted stock.\nLiquidity and Capital Resources\nDuring 2020, 2019 and 2018, we funded our business through cash generated from operations. Our cash and investments as of December 31, 2020 included $167.0 million held in the U.S. and $37.7 million held by our foreign subsidiaries. We believe that our cash balances in the U.S. are sufficient to fund our U.S. operations, and we do not intend to further repatriate foreign funds to the U.S. In the future, if we elect to repatriate the unremitted earnings of our foreign subsidiaries, we would no longer be subject to additional U.S. income taxes on such earnings due to the enactment of the Tax Cuts and Jobs Act in December 2017, but we could be subject to additional local withholding taxes.\nCash flow from operating activities totaled $140.9 million, $146.9 million, and $137.3 million in 2020, 2019 and 2018, respectively. Typical factors affecting our cash provided by operating activities include our level of revenue and earnings for the period, the timing and amount of employee bonus and income tax payments, and the timing of cash collections from our customers which is our primary source of operating cash flow. Cash flow from operating activities for 2020 decreased $6.0 million compared to 2019, which is mainly due to an increase in employee bonus payments and the timing of cash collections, partially offset by a decrease in income tax payments. Cash flow from operating activities for 2019 increased $9.6 million compared to 2018 primarily attributable to the timing of cash collections and income tax payments. Days sales outstanding was 68, 61 and 64 at December 31, 2020, 2019 and 2018, respectively, reflecting solid cash collections.\nInvesting activities used cash of approximately $2.7 million, $13.8 million, and $9.8 million in 2020, 2019 and 2018, respectively. Our investing activities for 2020, 2019 and 2018 consisted of capital spending to support company growth and short-term investing. For 2020, 2019 and 2018, capital expenditure was $2.7 million, $15.2 million, and $7.3 million, respectively. Net investment proceeds in 2019 was $1.4 million. Net investment purchases in 2018 was $2.5 million.\nFinancing activities used cash of approximately $43.6 million, $121.5 million, and $149.3 million in 2020, 2019 and 2018, respectively. The principal use of cash for financing activities in 2020, 2019 and 2018 was to purchase our common stock, including shares withheld for taxes due upon vesting of restricted stock. Repurchases of our common stock for 2020, 2019 and 2018 totaled $43.6 million, $121.5 million, and $149.3 million, respectively, including shares withheld for taxes of $18.6 million, $5.6 million and $6.0 million, respectively. We suspended the share repurchase program, effective April 1, 2020, to position our Company for uncertainty in the near-term as a result of the COVID-19 pandemic. In January 2021, our Board of Directors authorized the Company to repurchase up to an aggregate of $50 million of the Company’s common stock\nPeriodically, opportunities may arise to grow our business through the acquisition of complementary products, and technologies. Any material acquisition could result in a decrease to our working capital depending on the amount, timing, and nature of the consideration to be paid. We believe that our existing cash and investments will be sufficient to meet our working capital and capital expenditure needs at least for the next twelve months, although there can be no assurance that this will be the case. With the COVID-19 impact, we are focused on preserving liquidity and protecting our headcount capacity to support our customers and grow our business when global economic activity begins to recover. In 2021, we anticipate that our priorities for use of cash will be similar to prior years, with our first priority being continued investment in product development and profitably growing our business to extend our market leadership. We will continue to evaluate acquisition opportunities that are complementary to our product footprint and technology direction. We will also continue to weigh our share repurchase options against cash for acquisitions and investing in the business. At this time, we do not anticipate any borrowing requirements in 2021 for general corporate purposes.\nNew Accounting Pronouncements Adopted in Fiscal Year 2020\nCredit Impairment\nIn June 2016, the Financial Accounting Standards Board (FASB) issued Accounting Standard Update (ASU) No. 2016-13, Financial Instruments-Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments, which requires the measurement and recognition of expected credit losses for financial assets held at amortized cost, including trade receivables. ASU No. 2016-13 replaces the existing incurred loss impairment model with an expected loss model that requires the use of forward-looking information to calculate credit loss estimates. This guidance is effective for annual reporting periods beginning after December 15, 2019, with early adoption permitted.\nOn January 1, 2020, we adopted ASU 2016-13 using the modified retrospective method applied for all financial assets measured at amortized cost. Our analysis involved utilizing a model of internal historical losses data. In estimating the allowance for credit losses, we considered the age of the accounts receivable, our historical write-offs, and the historical creditworthiness of the customer, among other factors. Should any of these factors change, the estimates made by us will also change accordingly, which could affect the level of our future allowances. We also analyzed future expected credit losses given ever present changes to future risks in projected economic conditions and future risks of customer collection. The net impact of the adoption of ASU 2016-13 was immaterial on our consolidated financial statements.\nNew Accounting Pronouncements Not Yet Adopted\nIncome Taxes\nIn December 2019, the FASB issued ASU 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes. The new guidance eliminates certain exceptions related to the approach for intraperiod tax allocation, the methodology for calculating taxes during the quarters and the recognition of deferred tax liabilities for outside basis differences. This guidance also simplifies aspects of the accounting for franchise taxes and changes in tax laws or rates, as well as clarifies the accounting for transactions that result in a step-up in the tax basis of goodwill. ASU 2019-12 is effective for the Company beginning January 1, 2021, with early adoption permitted. It would require us to recognize a cumulative effect adjustment to the opening balance of reinvested earnings, if applicable. We do not expect our adoption of this guidance to have a material impact on our consolidated financial statements.\nOff-Balance Sheet Arrangements and Aggregate Contractual Obligations\nOur principal commitments as of December 31, 2020 consist of obligations under operating leases. As we continue our business transition to a cloud subscription model, we have entered into multiple non-cancellable contracts for cloud infrastructure services. As of December 31, 2020, our cloud infrastructure obligations are approximately $68.0 million over the next 5 years. We also enter into non-cancellable subscriptions in the ordinary course of business for internal software to support our operations. Our obligations, as of December 31, 2020, are approximately $6.9 million over the next 3 years. We expect to fulfill all of these commitments from our working capital. We have no off-balance sheet arrangements within the meaning of the rules of the Securities and Exchange Commission.\nLease Commitments\nWe lease our facilities and some of our equipment under noncancelable operating lease arrangements that expire at various dates through 2029. Rent expense for these leases aggregated $7.9 million, $8.4 million, and $7.1 million during 2020, 2019 and 2018, respectively.\nIn the following table, we present a summary of our contractual commitments as of December 31, 2020 (in thousands):\nTotal\nThereafter\nOperating Lease Obligations\n$39,981\n$7,034\n$6,437\n$6,594\n$6,384\n$5,488\n$8,044\nIndemnities\nOur customer contracts generally contain infringement indemnity provisions. Under those provisions, we generally agree, subject to certain exceptions, to indemnify, defend, and hold harmless the customer in connection with third party claims against the customer alleging that the customer’s use of our software products in compliance with their license infringe the third party’s patent, copyright, or other intellectual property rights. Conditions to our obligations generally include that we are provided the right to control the defense of the claims and, in general, to control settlement negotiations. Those provisions generally provide also that, if the customer\nis prevented from using our software because of a third party infringement claim, our sole obligation (in addition to the indemnification, defense, and hold harmless obligation referred to above) is to, at our expense, (i) procure for the customer the right to continue to use the software, (ii) to replace or modify the product so that its use by the customer does not infringe, or, if either of the foregoing are not reasonably feasible, to terminate the customer contract and provide a refund of the unamortized portion of the customer’s license fee (based on a five year amortization period). Our customer contracts sometimes also require us to indemnify, defend, and hold harmless the customer in connection with death, personal injury, or property damage claims made by third parties with respect to actions of our personnel or contractors. The indemnity obligations contained in our customer contracts generally have no specified expiration date and no specified monetary limitation on liability. We have not previously incurred costs to settle claims or pay awards under these indemnification obligations. We account for these indemnity obligations in accordance with the FASB guidance on accounting for contingencies, and record a liability for these obligations when a loss is probable and reasonably estimable. We have not recorded any liabilities for these contracts as of December 31, 2020.\nWarranties\nIn general, in our customer software license contracts, we warrant to our customers that our software products will perform in all material respects in accordance with our standard published specifications in effect at the time of delivery of the licensed products to the customer for six months after first use of the licensed products, but no more than 24 months after execution of the license agreement. We also generally warrant in our cloud subscription agreements that we will perform the Cloud services in all material respects as defined in the agreement during the service period. Additionally, we warrant to our customers that our services will be performed consistent with generally accepted industry standards or specific service levels through completion of the agreed upon services. If necessary, we would provide for the estimated cost of product and service warranties based on specific warranty claims and claims history. However, we have not incurred significant recurring expense under our product or service warranties. As a result, we believe the estimated fair value of these agreements is nominal. Accordingly, we have no liabilities recorded for these agreements as of December 31, 2020.\nApplication of Critical Accounting Policies and Estimates\nThe SEC defines “critical accounting policies” as those that require application of management’s most difficult, subjective, or complex judgments, often as a result of the need to make estimates about the effect of matters that are inherently uncertain and may change in subsequent periods.\nOur Consolidated Financial Statements are prepared in accordance with U.S. GAAP. The preparation of financial statements in conformity with GAAP requires us to make estimates and assumptions in certain circumstances that affect amounts reported in the accompanying consolidated financial statements and related footnotes. We believe that the estimates, judgments, and assumptions upon which we rely are reasonable based on information available to us at the time that these estimates, judgments, and assumptions are made. To the extent there are material differences between those estimates, judgments, or assumptions and actual results, our financial statements will be affected. The accounting policies that reflect our more significant estimates, judgments, and assumptions are: Revenue Recognition and Accounting for Income Taxes.\nRevenue Recognition\nWe recognize revenue when we transfer control of the promised products or services to our customers, in an amount that reflects the consideration we expect to be entitled to in exchange for those products or services. We derive our revenue from software licenses, cloud subscriptions, customer support services and software enhancements (“maintenance”), implementation and training services, and sales of hardware. We exclude sales and usage-based taxes from revenue.\nNature of Products and Services\nOur perpetual software licenses provide the customer with a right to use the software as it exists at the time of purchase. We recognize revenue for distinct software licenses once the license period has begun and we have made the software available to the customer.\nCloud subscriptions includes software as a service and arrangements which provide customers with the right to use our software within a cloud-based environment that we provide and manage where the customer does not have the right to take possession of the software without significant penalty. SaaS and hosting revenues are recognized ratably over the contract period. For contracts that include a perpetual license and hosting services, we generally consider the arrangement as an overall service, recognized over the initial hosting term. The software license fee typically due at the outset of the arrangement is not payable again if the customer renews the hosting services, so that the customer’s option to renew the hosting services is a material right, the revenue from which, if the option is exercised, we will recognize over the applicable renewal period.\nOur perpetual software licenses are typically sold with maintenance under which we provide a comprehensive 24 hours per day, 365 days per year program that provides customers with software upgrades, when and if available, which include additional or improved functionality and technological advances incorporating emerging supply chain and industry initiatives. Revenue related to maintenance is generally paid in advance and recognized ratably over the term of the agreement, typically twelve months.\nOur services revenue consists of fees generated from implementation, training and application managed services, including reimbursements of out-of-pocket expenses in connection with our implementation services. Implementation services include system planning, design, configuration, testing, and other software implementation support, and are typically optional and distinct from our software. Following implementation, customers may purchase application managed services to support and maintain our software. Fees for our services are separately priced and are generally billed on an hourly basis, and revenue is recognized over time as the services are performed. In certain situations, we render professional services under agreements based upon a fixed fee for portions of or all of the engagement. Revenue related to fixed-fee-based services contracts is recognized over time based on the proportion performed.\nAs part of a complete solution, our customers periodically purchase hardware products developed and manufactured by third parties from us for use with the software licenses purchased from us. These products include computer hardware, radio frequency terminal networks, RFID chip readers, bar code printers and scanners, and other peripherals. As we do not physically control the hardware which we sell, we are acting as an agent in the transaction and recognize our hardware revenue net of the related costs. We recognize hardware revenue when control is transferred to the customer upon shipment.\nSignificant Judgements\nOur contracts with customers typically contain promises to transfer multiple products and services to a customer. Judgement is required to determine whether each product and service is considered to be a distinct performance obligation that should be accounted for separately under the contract. We allocate the transaction price to the distinct performance obligations based on relative standalone selling price (“SSP”). We estimate SSP based on the prices charged to customers, or by using information such as market conditions and other observable inputs. However, the selling price of our software licenses is highly variable. Thus, we estimate SSP for software licenses using the residual approach, determined based on total transaction price less the SSP of other goods and services promised in the contract.\nContract Balances\nTiming of invoicing to customers may differ from timing of revenue recognition. Payment terms for our software licenses vary. We have an established history of collecting under the terms of our software license contracts without providing refunds or concessions to our customers. Cloud subscriptions and maintenance are typically billed annually in advance. Services are typically billed monthly as performed. In instances where the timing of revenue recognition differs from the timing of invoicing, we have determined that our contracts generally do not include a significant financing component. The primary purpose of our invoicing terms is to provide customers with predictable ways to purchase our software and services, not to provide or receive financing. Additionally, we are applying the practical expedient to exclude from consideration any contracts with payment terms of one year or less as we rarely offer terms extending beyond one year.\nDeferred revenue mainly represents amounts collected prior to having completed performance of maintenance, cloud subscriptions and professional services.\nAccounting for Income Taxes\nWe provide for the effect of income taxes on our financial position and results of operations in accordance with the Income Taxes Topic of the ASC. Under this accounting pronouncement, income tax expense is recognized for the amount of income taxes payable or refundable for the current year and for the change in net deferred tax assets or liabilities resulting from events that are recorded for financial reporting purposes in a different reporting period than recorded in the tax return. Management must make significant assumptions, judgments, and estimates to determine our current provision for income taxes and also our deferred tax assets and liabilities and any valuation allowance to be recorded against our net deferred tax asset.\nOur judgments, assumptions, and estimates relative to the current provision for income tax take into account current tax laws, our interpretation of current tax laws, allowable deductions, projected tax credits, and possible outcomes of current and future audits conducted by foreign and domestic tax authorities. We do not recognize a tax benefit unless we conclude that it is more likely than not that the benefit will be sustained on audit by the taxing authority based solely on the technical merits of the associated tax position. If the recognition threshold is met, we recognize a tax benefit measured at the largest amount of the tax benefit that, in our judgment, is greater than 50 percent likely to be realized. Changes in tax law or our interpretation of tax laws and the resolution of current and future tax audits could significantly impact the amounts provided for income taxes in our statement of financial position and our statements of income. Our assumptions, judgments, and estimates relative to the value of our net deferred tax asset take into account\npredictions of the amount and category of future taxable income. Actual operating results and the underlying amount and category of income in future years could render our current assumptions, judgments, and estimates of recoverable net deferred taxes inaccurate, thus materially impacting our financial position and results of operations.",
    "item_7A": "Item 7A.\nQuantitative and Qualitative Disclosures About Market Risk\nForeign Business\nOur international business is subject to risks typical of an international business, including, but not limited to differing economic conditions, changes in political climate, differing tax structures, other regulations and restrictions, and foreign exchange rate volatility. Our international operations currently include business activity out of offices in the Australia, Chile, China, France, Germany, India, Italy, Japan, the Netherlands, Singapore, Spain, and the United Kingdom. When the U.S. dollar strengthens against a foreign currency, the value of our sales and expenses in that currency converted to U.S. dollars decreases. When the U.S. dollar weakens, the value of our sales and expenses in that currency converted to U.S. dollars increases. We recognized foreign exchange losses of $0.4 million and $1.0 million in 2020 and 2019, respectively, and recognized gains of $1.3 million in 2018. Foreign exchange rate transaction gains and losses are classified in “Other (loss) income, net” in our Consolidated Statements of Income. A fluctuation of 10% in the period end exchange rates at December 31, 2020 relative to the U.S. dollar would have resulted in a change of approximately $3.0 million in the reported foreign currency loss. A fluctuation of 10% in the period end exchange rates at December 31, 2019 relative to the U.S. dollar would have resulted in a change of approximately $2.6 million in the reported foreign currency loss.\nInterest Rates\nWe currently invest our cash and cash equivalents in a variety of financial instruments, including taxable floating rate obligations in money market funds and certificate of deposits with original maturities of less than three months when purchased. These investments are mainly denominated in U.S. dollars. Cash balances in foreign currencies overseas, except for India, are derived from business operations. Our operations in India are funded by the U.S. operations. At December 31, 2020, our cash and cash equivalents balances totaled $204.7 million, of which all is highly liquid. Our cash equivalents balance at December 31, 2020 was $11.5 million.\nInvestments in both fixed rate and floating rate interest-earning instruments carry interest rate risks. Fixed rate securities may have their fair market value adversely impacted due to a rise in interest rates, while floating rate securities may produce less income than expected if interest rates fall. Due in part to these factors, our future investment income may fall short of expectations due to changes in interest rates, or we may suffer losses in principal if forced to sell securities that have seen a decline in market value due to changes in interest rates. The weighted-average interest rate of return on cash equivalents and short-term investments was immaterial for the years ended December 31, 2020 and 2019. The fair value of cash equivalents and short-term investments held at December 31, 2020 and 2019 was $11.5 million and $11.0 million, respectively. Based on the average cash equivalents and short-term investments outstanding during 2020 and 2019, increases or decreases in the rates of return of 25 basis points would result in increases or decreases to interest income of approximately $0.4 million and $0.3 million, respectively, from the reported interest income.",
    "item_8": "Item 8.\nFinancial Statements and Supplementary Data\nFinancial Statements\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nManagement’s Annual Report on Internal Control over Financial Reporting\nReport of Independent Registered Public Accounting Firm on Internal Control over Financial Reporting\nReport of Independent Registered Public Accounting Firm on the Consolidated Financial Statements\nConsolidated Statements of Income\nConsolidated Statements of Comprehensive Income\nConsolidated Balance Sheets\nConsolidated Statements of Cash Flows\nConsolidated Statements of Shareholders’ Equity\nNotes to Consolidated Financial Statements\nMANAGEMENT’S ANNUAL REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nManagement of Manhattan Associates, Inc. is responsible for establishing and maintaining adequate internal control over financial reporting. The Company’s internal control over financial reporting is a process designed under the supervision of the Company’s principal executive and principal financial officers to provide reasonable assurance regarding the reliability of financial reporting and the preparation of the Company’s financial statements for external purposes in accordance with U.S. generally accepted accounting principles.\nThe Company’s internal control over financial reporting includes policies and procedures that pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect transactions and dispositions of assets; provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. generally accepted accounting principles, and that receipts and expenditures are being made only in accordance with authorizations of management and the directors of the Company; and provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nAs of the end of the Company’s 2020 fiscal year, management conducted an assessment of the Company’s internal control over financial reporting based on the framework established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 Framework) (COSO). Based on this assessment, management has determined that the Company’s internal control over financial reporting as of December 31, 2020 was effective.\nErnst & Young LLP, the independent registered public accounting firm that audited the Company’s financial statements for the year ended December 31, 2020, has audited the Company’s internal control over financial reporting as of December 31, 2020 and has issued a report regarding the Company’s internal control over financial reporting appearing on page 41, which expresses an unqualified opinion on the effectiveness of the Company’s internal control over financial reporting as of December 31, 2020.\n/s/ Eddie Capel\nEddie Capel\nPresident and Chief Executive Officer\nFebruary 5, 2021\n/s/ Dennis B. Story\nDennis B. Story\nExecutive Vice President, Chief Financial Officer, and Treasurer\nFebruary 5, 2021\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM OF INTERNAL CONTROL OVER FINANCIAL REPORTING\nThe Board of Directors and Shareholders of\nManhattan Associates, Inc. and Subsidiaries\nOpinion on Internal Control over Financial Reporting\nWe have audited Manhattan Associates, Inc. and subsidiaries’ internal control over financial reporting as of December 31, 2020, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 Framework) (the COSO criteria). In our opinion, Manhattan Associates, Inc. and subsidiaries (the Company), maintained, in all material respects, effective internal control over financial reporting as of December 31, 2020, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2020 and 2019, the related consolidated statements of income, comprehensive income, cash flows and shareholders’ equity for each of the three years in the period ended December 31, 2020, and the related notes and financial statement schedule listed in the Index at Item 15(a) and our report dated February 5, 2021 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Annual Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nAtlanta, Georgia\nFebruary 5, 2021\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nON THE CONSOLIDATED FINANCIAL STATEMENTS\nThe Board of Directors and Shareholders of\nManhattan Associates, Inc. and Subsidiaries\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Manhattan Associates, Inc. and subsidiaries (the Company) as of December 31, 2020 and 2019, the related consolidated statements of income, comprehensive income, cash flows, and shareholders’ equity for each of the three years in the period ended December 31, 2020, and the related notes and financial statement schedule listed in the Index at Item 15(a) (collectively referred to as the “financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2020 and 2019, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2020, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2020, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated February 5, 2021 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgements. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter on the account or disclosure to which is relates.\nRevenue Recognition - Multi-Element Arrangements\nDescription of the Matter\nAs described in Note 1 to the consolidated financial statements, the Company's sales contracts typically contain promises to transfer multiple products and services to a customer. Substantially all of the Company’s transactions involve multiple element arrangements, primarily consisting of sales for software licenses, cloud subscriptions, maintenance and services, which represent potential multi-element arrangements. The Company also collects payments prior to having completed performance of maintenance, cloud subscription and professional services and defers the recognition of revenue until performance obligations are satisfied.\nAuditing the Company's multi-element arrangements with customers is challenging because of the numerous judgements required in allocating the transaction price to the distinct performance obligations. The Company allocates the transaction price to the distinct performance obligations based on relative standalone selling price (“SSP”). SSP is estimated based on the prices charged to customers by region, size and offering. However, the selling price of software licenses is highly variable and therefore, the Company uses the residual approach, determined based on total transaction price less the SSP allocated to other goods and services promised in the contract.\nHow We Addressed the Matter\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the Company's process to identify the elements in a customer arrangement, calculate the standalone selling price, allocate the revenue between revenue financial statement categories, and recognize the revenue or record the deferral of revenue when applicable.\nOur audit procedures included, among others, reviewing significant individual contracts based on size or risk as well as reviewing a randomly selected sample of contracts from the remaining population and considering the requirements for revenue recognition as well as related deferral of revenue. We reviewed the selected contracts to evaluate whether there was an agreement with a customer, significant performance obligations were identified, a transaction price was determined, and proper allocation of the revenue between performance obligations in the contract was made. We reviewed delivery evidence to determine whether delivery had occurred per the agreement or if revenue was recognized when the entity satisfied the performance obligation. We tested management’s identification of significant terms for completeness, including the identification of distinct performance obligations and variable consideration. We held discussions with Project Managers to understand the services related to the implementation of the software, compared stated pricing in the selected contract to the “SSP” range, reviewed Management’s analysis of pricing offered to customers for future purchases identified in the selected contract to identify material rights, and sent contract confirmations directly to customers to confirm the terms and conditions of the arrangement and obtained sales personnel confirmation to evaluate completeness of significant elements of the agreement. In addition, we tested the mathematical accuracy of management’s calculations of revenue and the associated timing of revenue recognized in the financial statements.\n/s/ Ernst & Young LLP\nWe have served as the Company’s auditor since 2002\nAtlanta, Georgia\nFebruary 5, 2021\nMANHATTAN ASSOCIATES, INC. AND SUBSIDIARIES\nConsolidated Statements of Income\n(in thousands, except per share amounts)\nYear Ended December 31,\nRevenue:\nCloud subscriptions\n$\n79,830\n$\n46,831\n$\n23,104\nSoftware license\n38,284\n48,855\n45,368\nMaintenance\n147,748\n149,230\n147,033\nServices\n303,569\n360,516\n329,685\nHardware\n16,941\n12,517\n13,967\nTotal revenue\n586,372\n617,949\n559,157\nCosts and expenses:\nCost of software license\n2,894\n2,626\n5,297\nCost of cloud subscriptions, maintenance and services\n266,993\n282,341\n235,584\nResearch and development\n84,276\n87,608\n71,896\nSales and marketing\n47,758\n56,860\n51,262\nGeneral and administrative\n61,444\n64,603\n52,618\nDepreciation and amortization\n8,946\n7,987\n8,613\nTotal costs and expenses\n472,311\n502,025\n425,270\nOperating income\n114,061\n115,924\n133,887\nInterest income\n1,067\nOther (loss) income, net\n(383\n)\n(562\n)\n1,277\nIncome before income taxes\n113,776\n116,077\n136,231\nIncome tax provision\n26,536\n30,315\n31,541\nNet income\n$\n87,240\n$\n85,762\n$\n104,690\nBasic earnings per share\n$\n1.37\n$\n1.33\n$\n1.58\nDiluted earnings per share\n$\n1.36\n$\n1.32\n$\n1.58\nWeighted average number of shares:\nBasic\n63,538\n64,397\n66,201\nDiluted\n64,333\n65,103\n66,434\nThe accompanying notes are an integral part of these Consolidated Statements of Income.\nMANHATTAN ASSOCIATES, INC. AND SUBSIDIARIES\nConsolidated Statements of Comprehensive Income\n(in thousands)\nYear Ended December 31,\nNet income\n$\n87,240\n$\n85,762\n$\n104,690\nForeign currency translation adjustment\n(415\n)\n(985\n)\n(5,022\n)\nComprehensive income\n$\n86,825\n$\n84,777\n$\n99,668\nThe accompanying notes are an integral part of these Consolidated Statements of Comprehensive Income.\nMANHATTAN ASSOCIATES, INC. AND SUBSIDIARIES\nConsolidated Balance Sheets\n(in thousands, except share and per share data)\nDecember 31,\nASSETS\nCurrent Assets:\nCash and cash equivalents\n$\n204,705\n$\n110,678\nAccounts receivable, net of allowance of $3,497 and $2,826 at December 31, 2020 and December 31, 2019, respectively\n109,202\n100,937\nIncome taxes receivable\n1,874\n1,332\nPrepaid expenses\n14,717\n14,159\nOther current assets\n3,543\n4,935\nTotal current assets\n334,041\n232,041\nProperty and equipment, net\n17,903\n22,725\nOperating lease right-of-use assets\n31,470\n35,896\nGoodwill, net\n62,252\n62,237\nDeferred income taxes\n5,760\n6,814\nOther assets\n13,986\n12,566\nTotal assets\n$\n465,412\n$\n372,279\nLIABILITIES AND SHAREHOLDERS' EQUITY\nCurrent liabilities:\nAccounts payable\n$\n17,805\n$\n20,561\nAccrued compensation and benefits\n41,962\n45,991\nAccrued and other liabilities\n21,181\n19,325\nDeferred revenue\n114,164\n94,371\nIncome taxes payable\n1,874\n1,348\nTotal current liabilities\n196,986\n181,596\nOperating lease liabilities, long-term\n27,843\n32,416\nDeferred income taxes\n-\nOther non-current liabilities\n21,686\n15,952\nCommitments and contingencies (Note 5)\nShareholders' equity:\nPreferred stock, no par value; 20,000,000 shares authorized, no shares issued or\noutstanding at December 31, 2020 and December 31, 2019\n-\n-\nCommon stock, $.01 par value; 200,000,000 shares authorized; 63,527,186 and\n63,456,986 shares issued and outstanding at December 31, 2020 and\nDecember 31, 2019, respectively\nRetained earnings\n236,524\n159,490\nAccumulated other comprehensive loss\n(18,262\n)\n(17,847\n)\nTotal shareholders' equity\n218,897\n142,278\nTotal liabilities and shareholders' equity\n$\n465,412\n$\n372,279\nThe accompanying notes are an integral part of these Consolidated Balance Sheets.\nMANHATTAN ASSOCIATES, INC. AND SUBSIDIARIES\nConsolidated Statements of Cash Flows\n(in thousands)\nYear Ended December 31,\nOperating activities:\nNet income\n$\n87,240\n$\n85,762\n$\n104,690\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization\n8,946\n7,987\n8,613\nEquity-based compensation\n33,355\n31,841\n19,864\nLoss (gain) on disposal of equipment\n(429\n)\nDeferred income taxes\n1,036\n(1,406\n)\n(4,265\n)\nUnrealized foreign currency loss (gain)\n(708\n)\nChanges in operating assets and liabilities:\nAccounts receivable, net\n(6,592\n)\n(1,065\n)\n(9,341\n)\nOther assets\n(971\n)\n(8,924\n)\n(4,357\n)\nAccounts payable, accrued and other liabilities\n(3,097\n)\n20,812\n18,603\nIncome taxes\n1,886\n1,180\n(4,390\n)\nDeferred revenue\n18,164\n11,858\n7,575\nNet cash provided by operating activities\n140,885\n146,908\n137,349\nInvesting activities:\nPurchases of property and equipment\n(2,730\n)\n(15,193\n)\n(7,306\n)\nPurchases of short-term investments\n-\n-\n(14,584\n)\nMaturities of short-term investments\n-\n1,439\n12,052\nNet cash used in investing activities\n(2,730\n)\n(13,754\n)\n(9,838\n)\nFinancing activities:\nPurchase of common stock\n(43,561\n)\n(121,487\n)\n(149,322\n)\nNet cash used in financing activities\n(43,561\n)\n(121,487\n)\n(149,322\n)\nForeign currency impact on cash\n(567\n)\n(115\n)\n(4,585\n)\nNet change in cash and cash equivalents\n94,027\n11,552\n(26,396\n)\nCash and cash equivalents at beginning of period\n110,678\n99,126\n125,522\nCash and cash equivalents at end of period\n$\n204,705\n$\n110,678\n$\n99,126\nSupplemental disclosures of cash flow information:\nCash paid for taxes\n$\n23,766\n$\n30,492\n$\n40,215\nThe accompanying notes are an integral part of these Consolidated Statements of Cash Flows.\nMANHATTAN ASSOCIATES, INC. AND SUBSIDIARIES\nConsolidated Statements of Shareholders’ Equity\n(in thousands, except share data)\nAccumulated\nAdditional\nOther\nTotal\nCommon Stock\nPaid-In\nRetained\nComprehensive\nShareholders'\nShares\nAmount\nCapital\nEarnings\nIncome (Loss)\nEquity\nBalance, December 31, 2017\n67,776,138\n-\n186,117\n(11,839\n)\n174,956\nRepurchase of common stock\n(3,262,835\n)\n(33\n)\n(19,860\n)\n(129,429\n)\n-\n(149,322\n)\nRestricted stock units issuance\n347,116\n(4\n)\n-\n-\n-\nEquity-based compensation\n-\n-\n19,864\n-\n-\n19,864\nAdjustment due to adoption of ASC 2014-09, Revenue from Contracts with Customers (Topic 606)\n-\n-\n-\n1,981\n-\n1,981\nForeign currency translation adjustment\n-\n-\n-\n-\n(5,022\n)\n(5,022\n)\nNet income\n-\n-\n-\n104,690\n-\n104,690\nBalance, December 31, 2018\n64,860,419\n-\n163,359\n(16,861\n)\n147,147\nRepurchase of common stock\n(1,751,507\n)\n(18\n)\n(31,837\n)\n(89,631\n)\n-\n(121,487\n)\nRestricted stock units issuance\n348,074\n(4\n)\n-\n-\n-\nEquity-based compensation\n-\n-\n31,841\n-\n-\n31,841\nAdjustment due to adoption of ASC 2014-09, Revenue from Contracts with Customers (Topic 606)\n-\n-\n-\n-\n-\n-\nForeign currency translation adjustment\n-\n-\n-\n-\n(985\n)\n(985\n)\nNet income\n-\n-\n-\n85,762\n-\n85,762\nBalance, December 31, 2019\n63,456,986\n-\n159,490\n(17,847\n)\n142,278\nRepurchase of common stock\n(562,299\n)\n(6\n)\n(33,349\n)\n(10,206\n)\n-\n(43,561\n)\nRestricted stock units issuance\n632,499\n(6\n)\n-\n-\n-\nEquity-based compensation\n-\n-\n33,355\n-\n-\n33,355\nForeign currency translation adjustment\n-\n-\n-\n-\n(415\n)\n(415\n)\nNet income\n-\n-\n-\n87,240\n-\n87,240\nBalance, December 31, 2020\n63,527,186\n-\n236,524\n(18,262\n)\n218,897\nThe accompanying notes are an integral part of these Consolidated Statements of Shareholders’ Equity.\nMANHATTAN ASSOCIATES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2020, 2019 and 2018\n1. Organization, Consolidation and Summary of Significant Accounting Policies\nOrganization and Business\nManhattan Associates, Inc. (“Manhattan”, the “Company”, “we”, “our”, or “us”) is a developer and provider of supply chain commerce solutions that help organizations optimize the effectiveness, efficiency, and strategic advantages of their supply chains. Our solutions consist of software, services, and hardware, which coordinate people, workflows, assets, events, and tasks holistically across the functions linked in a supply chain from planning through execution. These solutions also help coordinate the actions, data exchange, and communication of participants in supply chain ecosystems, such as manufacturers, suppliers, distributors, trading partners, transportation providers, channels (such as catalogers, store retailers, and Web outlets), and consumers.\nOur operations are in North and South America (the “Americas\"), Europe (EMEA), and the Asia/Pacific (APAC) region. The Americas operation are conducted through the Parent Company, Manhattan Associates, Inc., and its wholly-owned subsidiary, Manhattan Associates Chile Spa. The European operations are conducted through our wholly-owned subsidiaries, Manhattan Associates Limited, Manhattan Associates Europe B.V., Manhattan France SARL, and Manhattan Associates GmbH, in the United Kingdom, the Netherlands, France, and Germany, respectively. Our Asia/Pacific operations are conducted through our wholly-owned subsidiaries, Manhattan Associates Pty Ltd., Manhattan Associates KK, Manhattan Associates Software (Shanghai), Co. Ltd., Manhattan Associates Software Pte Ltd., and Manhattan Associates (India) Development Centre Private Limited in Australia, Japan, China, Singapore, and India, respectively. We occasionally sell our products and services in other countries, such as countries in Latin America, Eastern Europe, Middle East, and Asia, through our direct sales channel as well as various reseller channels.\nRisks Associated with Single Business Line, Technological Advances, and Foreign Operations\nWe currently derive a substantial portion of our revenues from sales of our software and related services and hardware. The markets for supply chain commerce solutions are highly competitive, subject to rapid technological change, changing customer needs, frequent new product introductions, and evolving industry standards that may render existing products and services obsolete. As a result, our position in these markets could be eroded rapidly by unforeseen changes in customer requirements for application features, functions, and technologies. Our growth and future operating results will depend, in part, upon our ability to enhance existing applications and develop and introduce new applications that meet changing customer requirements that respond to competitive products and that achieve market acceptance. Any factor adversely affecting the markets for supply chain commerce solutions could have an adverse effect on our business, financial condition, results of operations and operating cash flows.\nOur international business is subject to risks typical of an international business, including, but not limited to, differing economic conditions, changes in political climate, differing tax structures, other regulations and restrictions, and foreign exchange rate volatility. We recognized foreign exchange loss of $0.4 million and $1.0 million in 2020 and 2019, respectively, and a foreign exchange gain of $1.3 million in 2018. Foreign exchange rate transaction gains and losses are classified in “Other (loss) income, net” on the Consolidated Statements of Income.\nIn addition, we have a large development center in Bangalore, India, that does not have a natural in-market revenue hedge to mitigate currency risk to our operating expenses in India. Fluctuations in the value of other currencies, particularly the Indian Rupee, could significantly affect our revenues, expenses, operating profit and net income.\nPrinciples of Consolidation and Foreign Currency Translation\nThe accompanying consolidated financial statements include the accounts of the Company and its wholly-owned subsidiaries. All significant intercompany balances and transactions have been eliminated in consolidation.\nThe financial statements of foreign subsidiaries have been translated into United States dollars in accordance with the foreign currency matters topic in the FASB’s Accounting Standards Codification (the “Codification”). Revenues and expenses from international operations were denominated in the respective local currencies and translated using the average monthly exchange rates for the year. All balance sheet accounts have been translated using the exchange rates in effect at the balance sheet date and the effect of changes in exchange rates from year to year are disclosed as a separate component of shareholders’ equity and comprehensive income.\nNew Accounting Pronouncements Adopted in Fiscal Year 2020\nCredit Impairment\nIn June 2016, the Financial Accounting Standards Board (FASB) issued Accounting Standard Update (ASU) No. 2016-13, Financial Instruments-Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments, which requires the measurement and recognition of expected credit losses for financial assets held at amortized cost, including trade receivables. ASU No. 2016-13 replaces the existing incurred loss impairment model with an expected loss model that requires the use of forward-looking information to calculate credit loss estimates. This guidance is effective for annual reporting periods beginning after December 15, 2019, with early adoption permitted.\nOn January 1, 2020, we adopted ASU 2016-13 using the modified retrospective method applied for all financial assets measured at amortized cost. Our analysis involved utilizing a model of internal historical losses data. In estimating the allowance for credit losses, we considered the age of the accounts receivable, our historical write-offs, and the historical creditworthiness of the customer, among other factors. Should any of these factors change, the estimates made by us will also change accordingly, which could affect the level of our future allowances. We also analyzed future expected credit losses given ever present changes to future risks in projected economic conditions and future risks of customer collection. The net impact of the adoption of ASU 2016-13 was immaterial on our consolidated financial statements.\nNew Accounting Pronouncements Not Yet Adopted as of December 31, 2020\nIncome Taxes\nIn December 2019, the FASB issued ASU 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes. The new guidance eliminates certain exceptions related to the approach for intraperiod tax allocation, the methodology for calculating taxes during the quarters and the recognition of deferred tax liabilities for outside basis differences. This guidance also simplifies aspects of the accounting for franchise taxes and changes in tax laws or rates, as well as clarifies the accounting for transactions that result in a step-up in the tax basis of goodwill. ASU 2019-12 is effective for the Company beginning January 1, 2021, with early adoption permitted. It would require us to recognize a cumulative effect adjustment to the opening balance of reinvested earnings, if applicable. We do not expect our adoption of this guidance to have a material impact on our consolidated financial statements.\nSummary of Significant Accounting Policies\nCash and Cash Equivalents\nWe consider all highly liquid investments purchased with original maturities of three months or less to be cash or cash equivalents.\nConcentrations of Credit Risk\nFinancial instruments that potentially subject us to significant concentrations of credit risk consist principally of cash and cash equivalents and accounts receivable. We maintain cash and cash equivalents with various financial institutions. Amounts held are above the federally insured limit.\nOur sales are primarily to companies located in the United States, Europe and Asia. We perform periodic credit evaluations of our customers’ financial condition and do not require collateral. Accounts receivable are due principally from large U.S., European and Asia Pacific companies under stated contract terms. Accounts receivable, net as of December 31, 2020 for the Americas, EMEA, and APAC segments were $86.8 million, $17.3 million, and $5.1 million, respectively. Accounts receivable, net as of December 31, 2019 for the Americas, EMEA, and APAC segments were $81.8 million, $14.6 million, and $4.5 million, respectively. Our top five customers in aggregate accounted for 12%, 11%, and 13% of total revenue recognized for each of the years ended December 31, 2020 (“2020”), the year ended December 31, 2019 (“2019”), and the year ended December 31, 2018 (“2018”), respectively. No single customer accounted for more than 10% of revenue in 2020, 2019 and 2018, or more than 10% of accounts receivable as of December 31, 2020 and 2019.\nFair Value Measurement\nWe measure our investments based on a fair value hierarchy disclosure framework that prioritizes and ranks the level of market price observability used in measuring assets and liabilities at fair value. Market price observability is affected by a number of factors, including the type of asset or liability and their characteristics. This hierarchy prioritizes the inputs into three broad levels as follows:\n●\nLevel 1-Quoted prices in active markets for identical instruments.\n●\nLevel 2-Quoted prices for similar instruments in active markets; quoted prices for identical or similar instruments in markets that are not active; and model-derived valuations in which all significant inputs and significant value drivers are observable in active markets.\n●\nLevel 3-Valuations derived from valuation techniques in which one or more significant inputs or significant value drivers are unobservable.\nInvestments with maturities of 90 days or less from the date of purchase are classified as cash equivalents; investments with maturities of greater than 90 days from the date of purchase but less than one year are generally classified as short-term investments; and investments with maturities of one year or greater from the date of purchase are generally classified as long-term investments. Unrealized holding gains and losses are reflected as a net amount in a separate component of shareholders’ equity until realized. For the purposes of computing realized gains and losses, cost is determined on a specific identification basis.\nAt December 31, 2020, the Company’s cash and cash equivalents were $193.2 million and $11.5 million, respectively. We currently have no long-term investments. Cash equivalents consist of highly liquid money market funds of $10.0 million and certificates of deposit of $1.5 million. For money market funds, we use quoted prices from active markets that are classified as Level 1, the highest level of observable input in the disclosure hierarchy framework. The Company had no investments at December 31, 2020.\nThe carrying values of cash and cash equivalents, short-term investments, accounts receivable, and accounts payable included in the accompanying Consolidated Balance Sheets approximate their fair values principally due to the short-term maturities of these instruments.\nUse of Estimates\nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenue and expenses during the reporting period. Significant estimates include the allowance for doubtful accounts, which is based upon an evaluation of historical amounts written-off, the customers’ ability to pay, and general economic conditions; self-insurance accruals; impairment testing of goodwill; and our effective income tax rate (including the impact of unrecognized tax benefits) and deferred tax assets, which are based upon our expectations of future taxable income, allowable deductions, and projected tax credits. Actual results will differ from these estimates.\nRevenue Recognition\nWe recognize revenue when we transfer control of the promised products or services to our customers, in an amount that reflects the consideration we expect to be entitled to in exchange for those products or services. We derive our revenue from software licenses, cloud subscriptions, customer support services and software enhancements (“maintenance”), implementation and training services, and sales of hardware. We exclude sales and usage-based taxes from revenue.\nNature of Products and Services\nOur perpetual software licenses provide the customer with a right to use the software as it exists at the time of purchase. We recognize revenue for distinct software licenses once the license period has begun and we have made the software available to the customer.\nCloud subscriptions includes software as a service (“SaaS”) and arrangements which provide customers with the right to use our software within a cloud-based environment that we provide and manage where the customer does not have the right to take possession of the software without significant penalty. SaaS and hosting revenues are recognized ratably over the contract period. For contracts that include a perpetual license and hosting services, we generally consider the arrangement as an overall service, recognized over the initial hosting term. The software license fee typically due at the outset of the arrangement is not payable again if the customer renews the hosting services, so that the customer’s option to renew the hosting services is a material right, the revenue from which, if the option is exercised, we will recognize over the applicable renewal period.\nOur perpetual software licenses are typically sold with maintenance under which we provide a comprehensive 24 hours per day, 365 days per year program that provides customers with software upgrades, when and if available, which include additional or improved functionality and technological advances incorporating emerging supply chain and industry initiatives. Revenue related to maintenance is generally paid in advance and recognized ratably over the term of the agreement, typically twelve months.\nOur services revenue consists of fees generated from implementation, training and application managed services, including reimbursements of out-pocket expenses in connection with our implementation services. Implementation services include system planning, design, configuration, testing, and other software implementation support, and are typically optional and distinct from our software. Following implementation, customers may purchase application managed services to support and maintain our software. Fees for our services are separately priced and are generally billed on an hourly basis, and revenue is recognized over time as the services are performed. In certain situations, we render professional services under agreements based upon a fixed fee for portions of or all of the engagement. Revenue related to fixed-fee-based services contracts is recognized over time based on the proportion performed.\nAs part of a complete solution, our customers periodically purchase hardware products developed and manufactured by third parties from us for use with the software licenses purchased from us. These products include computer hardware, radio frequency terminal networks, radio frequency identification (RFID) chip readers, bar code printers and scanners, and other peripherals. As we do not physically control the hardware that we sell, we are acting as an agent in the transaction and recognize our hardware revenue net of related cost. We recognize hardware revenue when control is transferred to the customer upon shipment.\nSignificant Judgements\nOur contracts with customers typically contain promises to transfer multiple products and services to a customer. Judgement is required to determine whether each product and service is considered to be a distinct performance obligation that should be accounted for separately under the contract. We allocate the transaction price to the distinct performance obligations based on relative standalone selling price (“SSP”). We estimate SSP based on the prices charged to customers, or by using information such as market conditions and other observable inputs. However, the selling price of our software licenses is highly variable. Thus, we estimate SSP for software licenses using the residual approach, determined based on total transaction price less the SSP of other goods and services promised in the contract.\nContract Balances\nTiming of invoicing to customers may differ from timing of revenue recognition. Payment terms for our software licenses vary. We have an established history of collecting under the terms of our software license contracts without providing refunds or concessions to our customers. Cloud subscriptions and maintenance are typically billed annually in advance. Services are typically billed monthly as performed. In instances where the timing of revenue recognition differs from the timing of invoicing, we have determined that our contracts generally do not include a significant financing component. The primary purpose of our invoicing terms is to provide customers with predictable ways to purchase our software and services, not to provide or receive financing. Additionally, we are applying the practical expedient to exclude from consideration any contracts with payment terms of one year or less as we rarely offer terms extending beyond one year.\nDeferred revenue mainly represents amounts collected prior to having completed performance of maintenance, cloud subscriptions and professional services. $91.6 million of revenue that was included in the deferred revenue balance as of December 31, 2019 was recognized in 2020.\nNo revenue was recognized in 2020 from performance obligations that were satisfied in prior periods.\nRemaining Performance Obligations\nAs of December 31, 2020, approximately $308.8 million of revenue is expected to be recognized from remaining performance obligations for cloud subscriptions, maintenance contracts, and application managed services with a non-cancelable term greater than 1 year (including deferred revenue as well as amounts that will be invoiced and recognized as revenue in future periods). We expect to recognize revenue on approximately 50% of these remaining performance obligations over the next 24 months with the balance recognized thereafter. We have elected not to provide disclosures regarding remaining performance obligations for contracts with a term of 1 year or less.\nReturns and Allowances\nWe have not experienced significant returns or warranty claims to date and, as a result, have not recorded a provision for the cost of returns and product warranty claims.\nWe record an allowance for doubtful accounts based on historical experience of write-offs and a detailed assessment of accounts receivable. Additions to the allowance for credit losses generally represent a sales allowance on services revenue, which are recorded to operations as a reduction to services revenue. Total amount charged to operations in 2020, 2019 and 2018 was $3.5 million, $3.9 million and $3.9 million, respectively.\nOur analysis involved utilizing a model of internal historical losses data. In estimating the allowance for doubtful accounts, we consider the age of the accounts receivable, our historical write-offs, and the creditworthiness of the customer, among other factors. Should any of these factors change, the estimates made by us will also change accordingly, which could affect the level of our future allowances. We also analyzed future expected credit losses given ever present changes to future risks in projected economic conditions and future risks of customer collection.\nDeferred Commissions\nWe consider sales commissions to be incremental costs of obtaining a contract with a customer. We defer and recognize an asset for sales commissions related to performance obligations with an expected period of benefit of more than one year. We apply the practical expedient to expense sales commissions when the amortization period would have been one year or less. Deferred commissions were $12.9 million as of December 31, 2020, of which $9.2 million is included in other assets and $3.7 million is included in prepaid expenses. Deferred commissions were $10.4 million as of December 31, 2019, of which $7.7 million is included in other assets and $2.7 million is included in prepaid expenses. Sales commission expense is included in Sales and Marketing expense in the accompanying consolidated statement of operations. Amortization of sales commissions in 2020 and 2019 were $3.1 million and $1.9 million, respectively. No impairment losses were recognized during 2020 and in 2019.\nProperty and Equipment\nProperty and equipment is recorded at cost and consists of furniture, computers, other office equipment, and leasehold improvements. We depreciate the cost of furniture, computers, and other office equipment on a straight-line basis over their estimated useful lives (five years for office equipment, seven years for furniture and fixtures). Leasehold improvements are depreciated over the lesser of their useful lives or the term of the lease. Depreciation and amortization expense for 2020, 2019 and 2018 was approximately $8.9 million, $8.0 million, and $8.6 million, respectively, and was included in “Depreciation and amortization” in the Consolidated Statements of Income. Amortization expense on intangible assets in 2020, 2019 and 2018 was immaterial.\nProperty and equipment, at cost, consist of the following (in thousands):\nDecember 31,\nOffice equipment\n$\n39,250\n$\n38,373\nFurniture and fixtures\n5,051\n5,017\nLeasehold improvement\n24,362\n23,534\nProperty and equipment, gross\n68,663\n66,924\nLess accumulated depreciation\n(50,760\n)\n(44,199\n)\nProperty and equipment, net\n$\n17,903\n$\n22,725\nSoftware Development Costs\nResearch and development expenses are charged to expense as incurred. For 2020, 2019 and 2018, we did not capitalize any internal research and development costs because the costs incurred between the attainment of technological feasibility for the related software product through the date when the product was available for general release to customers were insignificant.\nWe determine the amount of development costs capitalizable under the provisions of FASB Codification accounting for costs of computer software to be sold, leased, or marketed. Under this guidance, computer software development costs are charged to R&D expense until technological feasibility is established, after which remaining software production costs are capitalized. We have defined technological feasibility as the point in time at which we have a detailed program design or a working model of the related product, depending on the type of development efforts, and high-risk development issues have been resolved through end-to-end system testing.\nImpairment of Long-Lived Assets\nWe review the values assigned to long-lived assets, including property and certain intangible assets, to determine whether events and circumstances have occurred which indicate that the remaining estimated useful lives may warrant revision or that the remaining balances may not be recoverable. In such reviews, undiscounted cash flows associated with these assets are compared with their carrying value to determine if a write-down to fair value is required. During 2020, 2019 and 2018, we did not recognize any impairment charges associated with our long-lived or intangible assets.\nThe evaluation of asset impairment requires management to make assumptions about future cash flows over the life of the asset being evaluated. These assumptions require significant judgment, and actual results may differ from assumed and estimated amounts.\nGoodwill and Impairment of Goodwill\nGoodwill\nGoodwill represents the excess of purchase price over fair value of net identified tangible and intangible assets and liabilities acquired. We do not amortize goodwill. Instead, we test goodwill for impairment on at least an annual basis. Goodwill was $62.3 million and $62.2 million at the end of each of the years ended December 31, 2020 and 2019, respectively.\nImpairment of Goodwill\nWe evaluate the carrying value of goodwill annually as of December 31 and between annual evaluations if events occur or circumstances change that would more likely than not reduce the fair value of the reporting unit below its carrying amount. Such circumstances could include, but are not limited to, (1) a significant adverse change in legal factors or in business climate, (2) unanticipated competition, or (3) an adverse action or assessment by a regulator.\nWe applied the simplified goodwill impairment test for 2020, that permits companies to perform a qualitative assessment based on economic, industry and company-specific factors as the initial step in the annual goodwill impairment test for all or selected reporting units. Based on the results of the qualitative assessment, companies are only required to perform Step 1 of the annual impairment test for a reporting unit if the company concludes that it is not more likely than not that the unit’s fair value is less than its carrying amount. To the extent we conclude that it is more likely than not that a reporting unit’s estimated fair value is less than its carrying amount, the two-step approach is applied. The first step would require a comparison of each reporting unit’s fair value to the respective carrying value. If the carrying value exceeds the fair value, a second step is performed to measure the amount of impairment loss, if any. We did not identify any macroeconomic or industry conditions as of December 31, 2020, that would indicate that the fair value of the reporting units were more likely than not to be less than their respective carrying values. If circumstances change or events occur to indicate that it is more likely than not that the fair value of any reporting units have fallen below their carrying value, we would record an impairment charge based on that difference. We performed our periodic review of goodwill for impairment as of December 31, 2020 and 2019, and did not identify any impairment as a result of the review.\nGuarantees and Indemnities\nWe account for guarantees in accordance with the guarantee accounting topic in the FASB Codification. Our customer contracts generally contain infringement indemnity provisions. Under those provisions, we generally agree, subject to certain exceptions, to indemnify, defend, and hold harmless the customer in connection with third party claims against the customer alleging that the customer’s use of our software products in compliance with their license infringe the third party’s patent, copyright, or other intellectual property rights. Conditions to our obligations generally include that we are provided the right to control the defense of the claims and, in general, to control settlement negotiations. Those provisions generally provide also that, if the customer is prevented from using our software because of a third party infringement claim, our sole obligation (in addition to the indemnification, defense, and hold harmless obligation referred to above) is to, at our expense, (i) procure for the customer the right to continue to use the software, (ii) to replace or modify the product so that its use by the customer does not infringe, or, if either of the foregoing are not reasonably feasible, to terminate the customer contract and provide a refund of the unamortized portion of the customer’s license fee (based on a five year amortization period). Our customer contracts sometimes also require us to indemnify, defend, and hold harmless the customer in connection with death, personal injury, or property damage claims made by third parties with respect to actions of our personnel or contractors. The indemnity obligations contained in our customer contracts generally have no specified expiration date and no specified monetary limitation on liability. We have not previously incurred costs to settle claims or pay awards under these indemnification obligations. We account for these indemnity obligations in accordance with FASB guidance on accounting for contingencies, and record a liability for these obligations when a loss is probable and reasonably estimable. We have not recorded any liabilities for these contracts as of December 31, 2020, or 2019.\nIn general, in our customer software license contracts, we warrant to our customers that our software products will perform in all material respects in accordance with the standard published specifications in effect at the time of delivery of the licensed products to the customer for six months after first use of the licensed products, but no more than 24 months after execution of the license agreement. We also generally warrant in our Cloud subscription agreements that we will perform the Cloud services in all material respects as defined in the agreement during the service period. Additionally, we warrant to our customers that services will be performed consistent with generally accepted industry standards or specific service levels through completion of the agreed upon\nservices. If necessary, we will provide for the estimated cost of product and service warranties based on specific warranty claims history. However, we have not incurred significant recurring expenses under product or service warranties. As a result, we believe the estimated fair value of these agreements is nominal. Accordingly, we have no liabilities recorded for these agreements as of December 31, 2020 and 2019.\nSegment Information\nWe have three reportable segments as defined by the FASB Codification topic for segment reporting: Americas, EMEA, and APAC. See Note 8 for discussion of our reportable segments.\nBasic and Diluted Net Income Per Share\nBasic net income per share is computed using net income divided by the weighted average number of shares of common stock outstanding (“Weighted Shares”) for the period presented.\nDiluted net income per share is computed using net income divided by Weighted Shares and the treasury stock method effect of common equivalent shares (“CESs”) outstanding for each period presented. In the following table, we present a reconciliation of earnings per share and the shares used in the computation of earnings per share for the years ended December 31, 2020, 2019 and 2018 (in thousands, except per share data):\nYear Ended December 31,\n(in thousands, except per share data)\nNet income\n$\n87,240\n$\n85,762\n$\n104,690\nEarnings per share:\nBasic\n$\n1.37\n$\n1.33\n$\n1.58\nEffect of CESs\n(0.01\n)\n(0.01\n)\n-\nDiluted\n$\n1.36\n$\n1.32\n$\n1.58\nWeighted average number of shares:\nBasic\n63,538\n64,397\n66,201\nEffect of CESs\nDiluted\n64,333\n65,103\n66,434\nThe number of anti-dilutive CESs in 2020, 2019 and 2018 was immaterial. See Note 2 for further information on those securities.\nAccumulated Other Comprehensive Income\nComprehensive income includes net income and foreign currency translation adjustments that are excluded from net income and reflected in shareholders’ equity. The entire accumulated other comprehensive income balance as of December 31, 2020 and 2019 represents foreign currency translation adjustments.\nAccounting for Income Taxes\nWe provide for the effect of income taxes on our financial position and results of operations in accordance with the Income Taxes Topic of the Codification. Under this accounting pronouncement, income tax expense is recognized for the amount of income taxes payable or refundable for the current year and for the change in net deferred tax assets or liabilities resulting from events that are recorded for financial reporting purposes in a different reporting period than recorded in the tax return. Management must make significant assumptions, judgments, and estimates to determine our current provision for income taxes and also, our deferred tax assets and liabilities, and any valuation allowance to be recorded against our net deferred tax asset.\nOur judgments, assumptions, and estimates relative to the current provision for income tax take into account current tax laws, our interpretation of current tax laws, allowable deductions, projected tax credits, and possible outcomes of current and future audits conducted by foreign and domestic tax authorities. We do not recognize a tax benefit unless we conclude that it is more likely than not that the benefit will be sustained on audit by the taxing authority based solely on the technical merits of the associated tax position. If the recognition threshold is met, we recognize a tax benefit measured at the largest amount of the tax benefit that, in our judgment, is greater than 50 percent likely to be realized. Changes in tax law or our interpretation of tax laws and the resolution of current and future tax audits could significantly impact the amounts provided for income taxes in our financial position and results of operations.\nOur assumptions, judgments, and estimates relative to the value of our net deferred tax asset take into account predictions of the amount and category of future taxable income. Actual operating results and the underlying amount and category of income in future years could render our current assumptions, judgments, and estimates of recoverable net deferred taxes inaccurate, thus materially impacting our financial position and results of operations.\nEquity-Based Compensation\nWe account for equity-based compensation in accordance with ASC 718, Compensation - Stock Compensation. See Note 2 for further information.\nAdvertising Costs\nWe expense advertising costs as incurred. Advertising expense was $1.6 million in 2020, $2.9 million in 2018, and immaterial for 2019.\n2. Equity-Based Compensation\nEquity Based Compensation Plans\nIn May 2020, the Manhattan Associates, Inc. 2020 Equity Incentive Plan (the “2020 Plan”) was approved by our shareholders. The 2020 Plan provides for the grant of stock options, restricted stock, restricted stock units, and stock appreciation rights. Vesting conditions can be service-based or performance-based, or a combination of both. The number of shares subject to outstanding awards under the 2007 Stock Incentive Plan (the “2007 Plan”) that are forfeited or canceled or expire after the Effective Date, in accordance with the terms of the 2007 Plan, are counted as one share toward the 2020 Plan.\nA maximum of 4,500,000 shares are available for grant under the amended 2020 Plan. Each stock option, stock appreciation right, restricted stock, or restricted stock unit granted is counted against the maximum share limitation as one share. Options and stock appreciation rights cannot have a term exceeding seven years. As of December 31, 2020, there were 4,526,518 shares available for issuance under the 2020 Plan. The 2020 Plan is administered by the Compensation Committee of the Board of Directors. The committee has the authority to interpret the provisions thereof.\nThe restricted stock awards contain vesting provisions that are 50% service based and 50% performance based for employee awards and 100% service based for non-employee members of the Board of Directors (“Outside Directors”). The employee awards have a four year vesting period, with the performance portion tied to annual revenue and earnings per share targets. The awards to Outside Directors have a one year vesting period. We recognize compensation cost for service-based restricted awards with graded vesting on a straight-line basis over the entire vesting period, with the amount of compensation cost recognized at any date at least equal to the portion of the grant-date value of the award that is vested at that date. For our performance-based restricted stock awards with graded vesting, we recognize compensation cost on an accelerated basis applying straight-line expensing for each separately vesting portion of each award.\nIn January 2012, in order to simplify equity grant administration, we changed the practice of granting restricted stock in favor of granting restricted stock units, or RSUs, which convert to our common stock upon vesting. There is no material difference between the grant of restricted stock and the grant of RSUs to either us or the recipients receiving the grants; however, in contrast to the granting of restricted stock, no stock will actually be issued under the granting of RSUs until the units vest. Currently, we do not grant stock options.\nRestricted Stock Awards\nWe present below a summary of changes in unvested units of restricted stock during 2020:\nNumber of Units\nGrant Date Fair Value\nOutstanding at January 1, 2020\n1,496,693\n$50.67\nGranted\n535,387\n77.20\nVested\n(518,565)\n52.48\nForfeited\n(50,651)\n57.96\nOutstanding at December 31, 2020\n1,462,864\n$59.48\nThe Company recorded equity-based compensation expense related to restricted stock and RSUs (collectively “restricted stock awards”) of $33.4 million, $31.8 million, and $19.9 million in 2020, 2019 and 2018, respectively. The total fair value of restricted stock awards vested in 2020, 2019 and 2018, based on market value at the vesting dates was $52.2 million, $18.2 million, and $18.1 million, respectively. The weighted average grant-date fair value of RSUs granted during fiscal year 2020, 2019 and 2018 was $77.20, $49.48 and $51.72, respectively. As of December 31, 2020, unrecognized compensation cost related to unvested RSU totaled $47.0 million and is expected to be recognized over a weighted average period of approximately 2.2 years. In January 2017, we elected to recognize forfeitures of equity-based payments as they occur.\nIncluded in RSU grants for the year ended December 31, 2020 are 303,375 units that have performance-based vesting criteria granted at target level for 2020 and performance adjustments above target level for 2019. The performance criteria are tied to our financial performance. As of December 31, 2020, the associated equity-based compensation expense has been recognized for the portion of the award attributable to the 2020 performance criteria.\n3. Income Taxes\nWe are subject to future federal, state, and foreign income taxes and have recorded net deferred tax assets on the Consolidated Balance Sheets at December 31, 2020 and 2019. Deferred tax assets and liabilities are determined based on the difference between the financial accounting and tax bases of assets and liabilities. We present below significant components of our deferred tax assets and liabilities as of December 31, 2020 and 2019 are as follows (in thousands):\nDecember 31,\nDeferred tax assets:\nAccounts receivable\n$\n$\nAccrued liabilities\n8,407\n8,083\nEquity-based compensation\n5,902\n5,888\nCapitalized costs\nAccrued sales taxes\nOperating lease liabilities\n8,828\n10,869\nState tax credits\n3,408\n4,027\nForeign subsidiary net operating losses\nValuation allowance\n(3,375\n)\n(2,886\n)\nOther\n25,462\n28,102\nDeferred tax liabilities:\nIntangible assets\n7,414\n7,548\nDepreciation\n1,250\n1,228\nDeferred commissions\n2,713\n2,326\nOperating lease right-of-use assets\n8,325\n10,223\n19,702\n21,325\nNet deferred tax assets\n$\n5,760\n$\n6,777\nWe present below income from domestic and foreign operations before income tax expense for the years ended December 31, 2020, 2019 and 2018 are as follows (in thousands):\nYear Ended December 31,\nDomestic\n$\n101,681\n$\n104,878\n$\n126,542\nForeign\n12,095\n11,199\n9,689\nTotal\n$\n113,776\n$\n116,077\n$\n136,231\nThe components of our income tax provision for the years ended December 31, 2020, 2019 and 2018 are as follows (in thousands):\nYear Ended December 31,\nCurrent:\nFederal\n$\n13,860\n$\n18,682\n$\n22,606\nState\n4,793\n5,711\n6,182\nForeign\n6,847\n7,323\n7,018\n25,500\n$\n31,716\n$\n35,806\nDeferred:\nFederal\n(393\n)\n(863\n)\n(3,127\n)\nState\n1,113\n(326\n)\n(674\n)\nForeign\n(212\n)\n(464\n)\n1,036\n(1,401\n)\n(4,265\n)\nTotal\n$\n26,536\n$\n30,315\n$\n31,541\nAs a result of losses in foreign locations, we have a net operating loss carry-forwards (“NOLs”) of approximately $0.3 million available to offset future income. Approximately $0.2 million of the NOLs expire in 2025 with the remaining with no expiration. We have established a valuation allowance for a portion of these NOLs because the ability to utilize them is not more likely than not to occur.\nWe have tax credit carry-forwards of approximately $4.3 million available to offset future state tax. These tax credit carry-forwards expire in 2021 to 2030. These credits represent a deferred tax asset of $3.4 million after consideration of the federal benefit of state tax deductions. A valuation allowance of $2.2 million has been established for these credits because the ability to use them is not more likely than not.\nAt December 31, 2020 we had approximately $52.2 million of undistributed earnings and profits. The undistributed earnings and profits are considered previously taxed income and would not be subject to U.S. income taxes upon repatriation of those earnings, in the form of dividends. The undistributed earnings and profits are considered to be permanently reinvested, accordingly no provision for local withholdings taxes have been provided, however, upon repatriation of those earnings, in the form of dividends, we could be subject to additional local withholding taxes.\nWe present below a summary of the items that cause recorded income taxes to differ from taxes computed using the statutory federal income tax rate for the years ended December 31, 2020, 2019 and 2018:\nYear Ended December 31,\nStatutory federal income tax rate\n21.0\n%\n21.0\n%\n21.0\n%\nEffect of:\nState income tax, net of federal benefit\n3.9\n3.5\n3.4\nState credit carryforwards\n0.5\n1.3\n0.3\nU.S. federal R&D tax credit\n(1.9\n)\n(1.9\n)\n(1.7\n)\nTax Reform\n-\n-\n(0.1\n)\nExcess benefit of equity compensation\n(3.4\n)\n(0.1\n)\n(0.6\n)\nEmployee compensation limitation\n2.7\n2.1\n0.9\nGlobal Intangible Low Taxed Income (GILTI)\n0.1\n-\n-\nForeign-derived intangible income (FDII) deduction\n(2.7\n)\n(3.1\n)\n(1.6\n)\nForeign operations\n1.0\n1.1\n1.2\nTax contingencies\n1.9\n3.7\n0.5\nOther permanent differences\n(0.2\n)\n(0.6\n)\n0.1\nChange in valuation allowance\n0.4\n(0.9\n)\n(0.2\n)\nIncome taxes\n23.3\n%\n26.1\n%\n23.2\n%\nOn December 22, 2017, the United States enacted tax reform legislation commonly known as the Tax Cuts and Jobs Act (“the Act”), resulting in significant modifications to existing law. In December 2017, we recorded a provisional estimate of $3.3 million for the one-time deemed repatriation transition tax on unrepatriated foreign earnings. The provisional amount was based on information available at that time, including estimated tax earnings and profits from foreign investments. In the fourth quarter of 2018, we finalized our transition tax calculation and recorded additional tax expense of $0.3 million. In December 2017, we also recorded a provisional write-down to deferred tax assets of $0.7 million related to changes in Section 162(m), Internal Revenue Code of 1986, regarding deductions for excessive employee compensation. In 2018, we finalized our calculation under Section 162(m) and recorded a tax benefit of $0.5 million. We also recorded a one-time tax benefit in December 2017 of $1.2 million from the remeasurement of deferred tax assets and liabilities from 35% to 21%. As of December 31, 2018, we completed the accounting for all of the impacts of the Act.\nThe Act provides for the global intangible low-taxed income (“GILTI”) provision which requires us in our U.S. income tax return, to include foreign subsidiary earnings in excess of an allowable return on the foreign subsidiary’s tangible assets. The FASB staff provided additional guidance to address the accounting for the effects of the provisions related to the taxation of GILTI, noting that companies should make an accounting policy election to recognize deferred taxes for temporary basis differences expected to reverse as GILTI in future years or to include the tax expense in the year it is incurred. We have elected to include the tax expense in the year that we incur it.\nA reconciliation of the beginning and ending amount of unrecognized tax benefits is as follows for the years ended December 31, 2020, 2019 and 2018 (in thousands):\nDecember 31,\nUnrecognized tax benefits at January 1,\n$\n(11,239\n)\n$\n(7,113\n)\n$\n(7,419\n)\nGross amount of increases in unrecognized tax benefits as a\nresult of tax positions taken during a prior period\n(118\n)\n(2,428\n)\n(873\n)\nGross amount of decreases in unrecognized tax benefits as a\nresult of tax positions taken during a prior period\n1,598\nGross amount of increases in unrecognized tax benefits as a\nresult of tax positions taken during the current period\n(3,256\n)\n(2,489\n)\n(78\n)\nReductions to unrecognized tax benefits relating to\nsettlements with taxing authorities\n-\n-\nReductions to unrecognized tax benefits as a result of a lapse of\nthe applicable statute of limitations\nUnrecognized tax benefits at December 31,\n$\n(12,804\n)\n$\n(11,239\n)\n$\n(7,113\n)\nOur unrecognized tax benefits totaled $12.8 million and $11.2 million as of December 31, 2020 and 2019, respectively. Included in these amounts are unrecognized tax benefits totaling $11.9 million and $10.2 million as of December 31, 2020 and 2019, respectively, which, if recognized, would affect the effective tax rate.\nWe recognize potential accrued interest and penalties related to unrecognized tax benefits within our global operations in income tax expense. For the years ended December 31, 2020, 2019 and 2018, the Company recognized the following income tax expense: $0.4 million, $0.5 million, and $0.5 million, respectively, for the potential payment of interest and penalties. Accrued interest and penalties were $2.0 million and $1.7 million for the years ended December 31, 2020 and 2019. We conduct business globally and, as a result, file income tax returns in the United State federal jurisdiction and in many state and foreign jurisdictions. We are generally no longer subject to U.S. federal, state, and local, or non-US income tax examinations for the years before 2012. Due to the expiration of statutes of limitations in multiple jurisdictions globally during 2020, the Company anticipates it is reasonably possible that unrecognized tax benefits may decrease by $3.9 million.\n4. Shareholders’ Equity\nDuring 2020, 2019 and 2018, we purchased 337,007, 1,640,055, and 3,147,466 shares of the Company’s common stock for $25.0 million, $115.9 million, and $143.3 million, respectively, through open market transactions as part of a publicly-announced share repurchase program. In January 2021, our Board of Directors authorized the Company to repurchase up to an aggregate of $50 million of our common stock.\n5. Contingencies\nFrom time to time, we may be involved in litigation relating to claims arising in the ordinary course of business, and occasionally legal proceeding not in the ordinary course. Many of our installations involve products that are critical to the operations of our clients’ businesses. Any failure in our company’s products could result in a claim for substantial damages against us, regardless of our responsibility for such failure. Although we attempt to contractually limit our liability for damages arising from product failures or negligent acts or omissions, there can be no assurance that the limitations of liability set forth in its contracts will be enforceable in all instances. We are not currently a party to any legal proceeding in the ordinary course of business or other legal proceedings the result of which we believe is likely to have a material adverse impact upon our business, financial position, results of operations, or cash flows. We expense legal costs associated with loss contingencies as such legal costs are incurred.\n6. Employee Benefit Plan\nWe sponsor the Manhattan Associates 401(k) Plan and Trust (the “401(k) Plan”), a qualified profit sharing plan with a 401(k) feature covering substantially all our employees. Under the 401(k) Plan’s deferred compensation arrangement, eligible employees who elect to participate in the 401(k) Plan may contribute up to 60% of eligible compensation up to $19,500, as defined, to the 401(k) Plan. The Internal Revenue Service sets the eligible compensation limit at $285,000 for 2020. Since 2012, we have provided a 50% matching contribution up to 6% of eligible compensation being contributed after the participant’s first year of employment. As previously announced, effective April 1, 2020, we temporarily suspended our 401k plan company match. During the years ended December 31, 2020, 2019 and 2018, the Company made matching contributions to the 401(k) Plan of $1.7 million, $5.0 million, and $4.1 million, respectively.\n7. Leases\nWe lease our facilities and some of our equipment under noncancelable operating lease arrangements that expire at various dates through 2029. The total operating lease liabilities for these leases at December 31, 2020 was approximately $34.4 million. In 2014, we amended our Atlanta headquarters lease to obtain additional space and extended the lease term to September 2025. As part of this amended lease agreement, we received reimbursement of $1.3 million from the landlord in 2018 for leasehold improvements. For a few of our facility leases, we have certain options to extend the lease term for up to 10 years, at our sole discretion. We have no finance leases.\nWe present below the operating lease right-of-use assets and lease liabilities as of December 31, 2020 (in thousands):\nDecember 31, 2020\nASSETS\nOperating lease right-of-use assets\n$31,470\nLIABILITIES\nOperating lease liabilities, current (included in accrued and other liabilities)\n$6,569\nOperating lease liabilities, long-term\n27,843\nTotal operating lease liabilities\n$34,412\nAggregate future minimum lease payments under noncancelable operating leases as of December 31, 2020 are as follows (in thousands):\nYear Ending December 31,\n7,034\n6,437\n6,594\n6,384\n5,488\nThereafter\n8,044\nTotal minimum payments required\n39,981\nLess short-term leases\n-\nLess imputed interest\n(5,569)\nTotal operating lease liabilities\n$34,412\nWe are applying the practical expedient to not separate lease and non-lease components, which allows us to account for lease and non-lease components as a single lease component. The total lease cost in 2020 was $7.9 million, consisting of $7.5 million of operating lease costs, and $0.4 million of short-term lease costs. The total lease cost in 2019 was $8.4 million, consisting of $8.0 million of operating lease costs, and $0.4 million of short-term lease costs. Our variable lease cost during 2020 and 2019 were immaterial. Total lease costs in 2018 were $7.1 million.\nWeighted average remaining lease term\n6.0 years\nWeighted average discount rate\n%\nSupplemental cash flow information - operating cash flows (in thousands):\nCash paid for amounts included in the measurement of lease liabilities\nOperating cash flows for operating leases\n$\n7,299\n8. Segment Reporting\nWe manage our business by geographic segment and have three geographic reportable segments: the Americas, EMEA, and APAC. All segments derive revenue from the sale and implementation of our supply chain commerce solutions. The individual products sold by the segments are similar in nature and are all designed to help companies manage the effectiveness and efficiency of their supply chain commerce. We use the same accounting policies for each reportable segment. The chief executive officer and chief financial officer evaluate performance based on revenue and operating results for each reportable segment.\nThe Americas segment charges royalty fees to the other segments based on software licenses and cloud subscriptions sold by those reportable segments. The royalties, which totaled $3.8 million, $4.5 million, and $4.2 million in 2020, 2019 and 2018, respectively, are included in costs of revenue for each segment with a corresponding reduction in the America’s cost of revenue. The revenues represented below are from external customers only. The geography-based costs consist of costs for professional services personnel, direct sales and marketing expenses, infrastructure costs to support the employee and customer base, billing and financial systems, management and general and administrative support. There are certain corporate expenses included in the Americas segment that we do not charge to the other segments. Such expenses include research and development, certain marketing and general and administrative costs that support the global organization, and the amortization of acquired developed technology. Costs in the Americas’ segment include all research and development costs including the costs associated with our operations in India.\nIn accordance with the segment reporting topic of the FASB Codification, we present below financial information by reportable segment for 2020, 2019 and 2018 (in thousands):\nYear Ended December 31,\nAmericas\nEMEA\nAPAC\nConsolidated\nAmericas\nEMEA\nAPAC\nConsolidated\nRevenue:\nCloud subscriptions\n$\n69,469\n$\n8,465\n$\n1,896\n$\n79,830\n$\n40,927\n$\n4,762\n$\n1,142\n$\n46,831\nSoftware license\n30,509\n4,308\n3,467\n38,284\n34,544\n11,518\n2,793\n48,855\nMaintenance\n116,309\n22,208\n9,231\n147,748\n118,891\n21,322\n9,017\n149,230\nServices\n232,954\n58,360\n12,255\n303,569\n283,008\n60,618\n16,890\n360,516\nHardware\n16,698\n16,941\n12,464\n-\n12,517\nTotal revenue\n465,939\n93,582\n26,851\n586,372\n489,834\n98,273\n29,842\n617,949\nCosts and Expenses:\nCost of revenue\n202,421\n53,661\n13,805\n269,887\n218,850\n51,938\n14,179\n284,967\nOperating expenses\n174,477\n14,461\n4,540\n193,478\n185,399\n18,635\n5,037\n209,071\nDepreciation and amortization\n7,932\n8,946\n6,961\n7,987\nTotal costs and expenses\n384,830\n68,945\n18,536\n472,311\n411,210\n71,339\n19,476\n502,025\nOperating income\n$\n81,109\n$\n24,637\n$\n8,315\n$\n114,061\n$\n78,624\n$\n26,934\n$\n10,366\n$\n115,924\nYear Ended December 31, 2018\nAmericas\nEMEA\nAPAC\nConsolidated\nRevenue:\nCloud subscriptions\n$\n20,611\n$\n2,075\n$\n$\n23,104\nSoftware license\n28,423\n11,406\n5,539\n45,368\nMaintenance\n117,489\n20,933\n8,611\n$\n147,033\nServices\n265,165\n50,328\n14,192\n329,685\nHardware\n13,798\n$\n13,967\nTotal revenue\n445,486\n84,744\n28,927\n559,157\nCosts and Expenses:\nCost of revenue\n183,563\n43,080\n14,238\n240,881\nOperating expenses\n156,793\n14,484\n4,499\n175,776\nDepreciation and amortization\n7,601\n8,613\nTotal costs and expenses\n347,957\n58,307\n19,006\n425,270\nOperating income\n$\n97,529\n$\n26,437\n$\n9,921\n$\n133,887\nIn the following table, we present goodwill, long-lived assets, and total assets by reportable segment as of December 31, 2020 and 2019 (in thousands):\nAs of December 31, 2020\nAs of December 31, 2019\nAmericas\nEMEA\nAPAC\nConsolidated\nAmericas\nEMEA\nAPAC\nConsolidated\nGoodwill, net\n$\n54,766\n$\n5,523\n$\n1,963\n$\n62,252\n$\n54,766\n$\n5,508\n$\n1,963\n$\n62,237\nLong lived assets\n54,309\n8,015\n1,035\n63,359\n61,686\n7,918\n1,583\n71,187\nTotal assets\n405,618\n47,529\n12,265\n465,412\n309,662\n48,008\n14,609\n372,279\nFor the years ended December 31, 2020, 2019 and 2018, we derived revenue from sales to customers outside the United States of approximately $178.1 million, $189.1 million, and $174.1 million, respectively. Our remaining revenue was derived from domestic sales.\nThe majority of our software license revenue (approximately 80%) relates to our warehouse management product group. Cloud subscriptions revenue was split relatively equal among the following product groups: Manhattan Active omnichannel, warehouse management solutions, and transportation management solutions.\n9. Subsequent Events\nWe evaluated all subsequent events that occurred after the date of the accompanying financial statements and determined that there were no events or transactions during this subsequent event reporting period which require recognition or disclosure in our financial statements.\n10. Quarterly Results of Operations (Unaudited)\nIn the table below, we present our quarterly results of operations for 2020 and 2019. The unaudited quarterly results have been prepared on substantially the same basis as the audited Consolidated Financial Statements.\nQuarter Ended\nMar 31, 2019\nJun 30, 2019\nSep 30, 2019\nDec 31, 2019\nMar 31, 2020\nJun 30, 2020\nSep 30, 2020\nDec 31, 2020\n(In thousands, except per share data)\nStatements of Income Data:\nRevenue:\nCloud subscriptions\n$\n7,859\n$\n9,009\n$\n14,242\n$\n15,721\n$\n17,260\n$\n18,503\n$\n21,064\n$\n23,003\nSoftware license\n12,414\n11,721\n15,486\n9,234\n9,735\n5,681\n13,233\n9,635\nMaintenance\n36,099\n37,323\n37,763\n38,045\n35,744\n35,898\n37,305\n38,801\nServices\n88,631\n93,951\n91,626\n86,308\n87,406\n71,778\n73,470\n70,915\nHardware\n3,401\n2,337\n3,158\n3,621\n3,758\n3,770\n4,685\n4,728\nTotal revenue\n148,404\n154,341\n162,275\n152,929\n153,903\n135,630\n149,757\n147,082\nCosts and expenses:\nCost of software license\n1,221\nCost of cloud subscriptions, maintenance and services\n66,578\n70,955\n73,618\n71,190\n74,276\n62,434\n64,672\n65,611\nResearch and development\n21,213\n21,997\n22,614\n21,784\n23,328\n19,931\n20,454\n20,563\nSales and marketing\n14,781\n14,520\n12,125\n15,434\n13,088\n9,709\n11,399\n13,562\nGeneral and administrative\n15,050\n16,805\n16,236\n16,512\n16,114\n14,016\n15,536\n15,778\nDepreciation and amortization\n1,914\n1,859\n1,937\n2,277\n2,346\n2,257\n2,193\n2,150\nTotal costs and expenses\n120,128\n126,759\n127,278\n127,860\n129,707\n108,938\n114,781\n118,885\nOperating income\n28,276\n27,582\n34,997\n25,069\n24,196\n26,692\n34,976\n28,197\nOther (loss) income, net\n(371\n)\n(71\n)\n(215\n)\n1,420\n(158\n)\n(891\n)\n(656\n)\nIncome before income taxes\n27,905\n27,511\n35,807\n24,854\n25,616\n26,534\n34,085\n27,541\nIncome tax provision\n6,933\n6,586\n8,700\n8,096\n3,086\n7,330\n9,119\n7,001\nNet income\n$\n20,972\n$\n20,925\n$\n27,107\n$\n16,758\n$\n22,530\n$\n19,204\n$\n24,966\n$\n20,540\nBasic earnings per share\n$\n0.32\n$\n0.32\n$\n0.42\n$\n0.26\n$\n0.35\n$\n0.30\n$\n0.39\n$\n0.32\nDiluted earnings per share\n$\n0.32\n$\n0.32\n$\n0.42\n$\n0.26\n$\n0.35\n$\n0.30\n$\n0.39\n$\n0.32\nShares used in computing basic earnings per share\n64,909\n64,623\n64,247\n63,822\n63,592\n63,509\n63,524\n63,527\nShares used in computing diluted earnings per share\n65,204\n65,093\n64,992\n64,807\n64,342\n64,126\n64,427\n64,484",
    "item_9": "Item 9.\nChanges in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A.\nControls and Procedures\nEvaluation of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures designed to ensure that information required to be disclosed in reports filed under the Securities Exchange Act of 1934, as amended, is recorded, processed, summarized, and reported within the time periods specified in the SEC’s rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and our Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure.\nNo system of controls, no matter how well designed and operated, can provide absolute assurance that the objectives of the system of controls are met, and no evaluation of controls can provide absolute assurance that the system of controls has operated effectively in all cases. Our disclosure controls and procedures, however, are designed to provide reasonable assurance that the objectives of disclosure controls and procedures are met.\nAs of the end of the period covered by this report, our Chief Executive Officer and Chief Financial Officer evaluated, with the participation of management, the effectiveness of our disclosure controls and procedures. Based on the evaluation, our Chief Executive Officer and Chief Financial Officer concluded that, as of the end of the period covered by this report, our disclosure controls and procedures were effective to provide reasonable assurance that the objectives of disclosure controls and procedures are met.\nManagement’s Report on Internal Control over Financial Reporting\nManagement’s assessment of the effectiveness of our internal control over financial reporting as of December 31, 2020, and the report of Ernst & Young LLP on the effectiveness of our internal control over financial reporting are contained on pages 40 and 41 of this report.\nChange in Internal Control over Financial Reporting\nDuring the fourth quarter of 2020, there were no changes in our internal control over financial reporting that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting, including any corrective actions with regard to material weaknesses.",
    "item_9B": "Item 9B.\nOther Information\nNone.\nPART III",
    "item_10": "Item 10.\nDirectors, Executive Officers and Corporate Governance\nThe information required by this item is incorporated by reference from the information contained in our Proxy Statement for the Annual Meeting of Shareholders expected to be filed with the SEC on or prior to April 2, 2021, under the captions “Election of Directors,” “Executive Officers,” “Section 16(a) Beneficial Ownership Reporting Compliance,” “Code of Ethics,” and “Board Committees.”",
    "item_11": "Item 11.\nExecutive Compensation\nThe information required by this item is incorporated by reference from the relevant information contained in our Proxy Statement for the Annual Meeting of Shareholders expected to be filed with the SEC on or prior to April 2, 2021, under the captions “Director Compensation,” “Executive Compensation,” “Compensation Committee Interlocks and Insider Participation,” and “Compensation Committee Report.”",
    "item_12": "Item 12.\nSecurity Ownership of Certain Beneficial Owners and Management and Related Shareholder Matters\nThe information required by this item is incorporated by reference from the relevant information contained in our Proxy Statement for the Annual Meeting of Shareholders expected to be filed with the SEC on or prior to April 2, 2021, under the caption “Security Ownership of Certain Beneficial Owners and Management.” The information required by this item with respect to the Company’s securities authorized for issuance under equity compensation plans is included in Part II, Item 5 of this Form 10-K and is incorporated by reference herein.",
    "item_13": "Item 13.\nCertain Relationships and Related Transactions, and Director Independence\nThe information required by this item is incorporated by reference from the relevant information contained in our Proxy Statement for the Annual Meeting of Shareholders expected to be filed with the SEC on or prior to April 2, 2021, under the captions “Related Party Transactions” and “Election of Directors.”",
    "item_14": "Item 14.\nPrincipal Accountant Fees and Services\nThe information required by this item is incorporated by reference from the relevant information contained in our Proxy Statement for the Annual Meeting of Shareholders expected to be filed with the SEC on or prior to April 2, 2021, under the caption “Ratification of Appointment of Independent Registered Public Accounting Firm.”\nPART IV",
    "item_15": "Item 15.\nExhibits and Financial Statement Schedules\n(a) 1.\nFinancial Statements.\nThe response to this item is submitted as a separate section of this Form 10-K. See Item 8.\n2.\nFinancial Statement Schedule.\nThe following financial statement schedule is filed as a part of this report:\nSCHEDULE II\nMANHATTAN ASSOCIATES, INC. AND SUBSIDIARIES\nVALUATION AND QUALIFYING ACCOUNTS\n(in thousands)\nClassification:\nBalance at Beginning of Period\nAdditions Charged to Operations\nNet\nDeductions\nBalance at End of Period\nAllowance for Doubtful Accounts\nFor the year ended:\nDecember 31, 2018\n$\n2,692\n$\n3,876\n$\n3,979\n(a)\n$\n2,589\nDecember 31, 2019\n$\n2,589\n$\n3,858\n$\n3,621\n(a)\n$\n2,826\nDecember 31, 2020\n$\n2,826\n$\n3,451\n$\n2,780\n(a)\n$\n3,497\nDeferred Tax Asset Valuation Allowance\nFor the year ended:\nDecember 31, 2018\n$\n4,084\n$\n-\n$\n(b)\n$\n3,846\nDecember 31, 2019\n$\n3,846\n$\n-\n$\n(b)\n$\n2,886\nDecember 31, 2020\n$\n2,886\n$\n$\n-\n(b)\n$\n3,375\n(a)\nRepresents write-offs of accounts, net of recoveries.\n(b)\nRepresents current year releases credited to expenses and current year reductions due to decreases in net deferred tax assets.\n(c) Represents current year cash payments.\nAll other schedules are omitted because they are not required or the required information is shown in the consolidated financial statements or notes thereto.\n3.\nExhibits.\nSee (b) below.\n(b)\nThe exhibits listed below under “Exhibit Index” are filed with or incorporated by reference in this Report. Where such filing is made by incorporation by reference to a previously filed registration statement or report, such registration statement or report is identified in parentheses.\n(c)\nSee Item 15(a)(2).\nItem 16.\nForm 10-K Summary\nNone.\nEXHIBIT INDEX\nThe following exhibits or incorporated by reference as part of this Report.\nExhibit\nNumber\nDescription\n3.1\nArticles of Incorporation of the Registrant dated February 24, 1998 (Incorporated by reference to Exhibit 3.1 to the Company’s Quarterly Report on Form 10-Q for the period ended June 30, 2014 (File No. 00023999), filed on July 29, 2014).\n3.2\nAmended Bylaws of the Registrant (As Amended Effective October 25, 2018) (Incorporated by reference to Exhibit 3.2 to the Company’s Form 10-Q for the period ended September 30, 2018 (File No. 000-23999), filed on October 25, 2018).\n4.1\nProvisions of the Articles of Incorporation and Bylaws of the Registrant defining rights of the holders of common stock of the Registrant (Incorporated by reference to Exhibit 4.1 to the Company’s Registration Statement on Form S-1 (File No. 333-47095), filed on February 27, 1998).\n4.2\nSpecimen Stock Certificate (Incorporated by reference to Exhibit 4.2 to the Company’s Pre-Effective Amendment No. 1 to its Registration Statement on Form S-1 (File No. 333-47095), filed on April 2, 1998).\n4.3\nDescription of Registrant's Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934 (Incorporated by reference to Exhibit 4.1 to the Company's Quarterly Report on Form 10-Q for the period ended March 31, 2020 (File No. 000-23999), filed on May 1, 2020).\n10.1(a)\nLease Agreement by and between Wildwood Associates, a Georgia general partnership, and the Registrant dated September 24, 1997 (Incorporated by reference to Exhibit 10.1 to the Company’s Registration Statement on Form S-1 (File No. 333-47095), filed on February 27, 1998).\n(b)\nFirst Amendment to Lease between Wildwood Associates, a Georgia general partnership, and the Registrant dated October 31, 1997 (Incorporated by reference to Exhibit 10.2 to the Company’s Registration Statement on Form S-1 (File No. 333-47095), filed on February 27, 1998).\n(c)\nSecond Amendment to Lease Agreement between Wildwood Associates, a Georgia general partnership, and the Registrant, dated February 27, 1998 (Incorporated by reference to Exhibit 10.8 to the Company’s Pre-Effective Amendment No. 1 to its Registration Statement on Form S-1 (File No. 333-47095), filed on April 2, 1998).\n(d)\nThird Amendment to Lease Agreement between Wildwood Associates and the Registrant, dated October 24, 2000 (Incorporated by reference to Exhibit 10.9 to the Company’s Annual Report for the period ended December 31, 2000 (File No. 000-23999), filed on April 2, 2001).\n10.2(a)\nLease Agreement by and between Wildwood Associates, a Georgia general partnership, and the Registrant, dated June 25, 2001 (Incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report for the period ended June 30, 2001 (File No. 000-23999), filed August 14, 2001).\n(b)\nFirst Amendment to Lease Agreement between Wildwood Associates, and the Registrant, dated June 10, 2002 (Incorporated by reference to Exhibit 10.6 to the Company’s Annual Report for the period ended December 31, 2006 (File No. 000-23999), filed on March 14, 2007).\n(c)\nSecond Amendment to Lease Agreement between 2300 Windy Ridge Parkway Investors LLC, and the Registrant, dated February 27, 2007 (Incorporated by reference to Exhibit 10.7 to the Company’s Annual Report for the period ended December 31, 2006 (File No. 000-23999), filed on March 14, 2007).\n(d)\nThird Amendment to Lease Agreement between 2300 Windy Ridge Parkway Investors LLC, and the Registrant, dated June 14, 2007 (Incorporated by reference to Exhibit 10.2(d) to the Company’s Annual Report for the period ended December 31, 2014 (File No. 000-23999), filed on February 5, 2015).\n(e)\nFourth Amendment to Lease Agreement between SP4 2300 Windy Ridge LP, and the Registrant, dated August 14, 2012 (Incorporated by reference to Exhibit 10.2(e) to the Company’s Annual Report for the period ended December 31, 2014 (File No. 000-23999), filed on February 5, 2015).\nExhibit\nNumber\nDescription\n(f)\nFifth Amendment to Lease Agreement between 2300 Windy Ridge LLC, and the Registrant, dated May 19, 2014 (Incorporated by reference to Exhibit 10.2(f) to the Company’s Annual Report for the period ended December 31, 2014 (File No. 000-23999), filed on February 5, 2015).\n(g)\nSixth Amendment to Lease Agreement between 2300 Windy Ridge LLC, and the Registrant, dated August 13, 2014 (Incorporated by reference to Exhibit 10.2(g) to the Company’s Annual Report for the period ended December 31, 2014 (File No. 000-23999), filed on February 5, 2015).\n(h)\nSeventh Amendment to Lease Agreement between 2300 Windy Ridge LLC and the Registrant, dated April 29, 2015 (Incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q for the period ended June 30, 2015 (File No. 000-23999), filed on July 28, 2015).\n10.3\nAgreement to Build and Lease between Orchid Apartments Private Limited and Manhattan Associates India Development Centre Private Limited, executed on November 19, 2004 (Incorporated by reference to Exhibit 10.8 to the Company’s Annual Report for the period ended December 31, 2004 (File No. 000-23999), filed on March 16, 2005).\n10.4\nLease Agreement between IGE Energy Services (UK) Limited, Manhattan Associates Limited and Manhattan Associates, Inc., dated February 1, 2005 (Incorporated by reference to Exhibit 10.9 to the Company’s Annual Report for the period ended December 31, 2004 (File No. 000-23999), filed on March 16, 2005).\n10.5\nForm of Director and Officer Indemnification Agreement (Incorporated by reference to Exhibit 10.2 to the Company’s Form 8-K (File No. 000-23999) filed on April 4, 2013).\n10.6*\nSummary Plan Description of the Registrant’s 401(k) Plan and Trust, effective January 1, 1995 (Incorporated by reference to Exhibit 10.4 to the Company’s Registration Statement on Form S-1 (File No. 333-47095), filed on February 27, 1998).\n10.7(a)*\nManhattan Associates, Inc. 1998 Stock Incentive Plan (Incorporated by reference to Exhibit 10.10 to the Company’s Registration Statement on Form S-1 (File No. 333-47095), filed on February 27, 1998).\n(b)*\nFirst Amendment to the Manhattan Associates, Inc. 1998 Stock Incentive Plan (Incorporated by reference to Exhibit 10.22 to the Company’s Annual Report for the period ended December 31, 1998 (File No. 000-23999), filed on March 31, 1999).\n(c)*\nSecond Amendment to the Manhattan Associates, Inc. 1998 Stock Incentive Plan (Incorporated by reference to Exhibit 10.23 to the Company’s Annual Report for the period ended December 31, 1998 (File No. 000-23999), filed on March 31, 1999).\n(d)*\nThird Amendment to the Manhattan Associates, Inc. 1998 Stock Incentive Plan (Incorporated by reference to Exhibit 10.24 to the Company’s Annual Report for the period ended December 31, 1998 (File No. 000-23999), filed on March 31, 1999).\n(e)*\nFourth Amendment to the Manhattan Associates, Inc. 1998 Stock Incentive Plan (Incorporated by reference to Exhibit 10.25 to the Company’s Annual Report for the period ended December 31, 1999 (File No. 000-23999), filed on March 30, 2000).\n(f)*\nFifth Amendment to the Manhattan Associates, Inc. 1998 Stock Incentive Plan (Incorporated by reference to Exhibit 4.8 to the Company’s Form S-8 (File No. 333-68968), filed on September 5, 2001).\n(g)*\nSixth Amendment to the Manhattan Associates, Inc. 1998 Stock Incentive Plan (Incorporated by reference to Annex A to the Company’s Proxy Statement for its Annual Meeting held May 17, 2002 (File No. 000-23999), filed on April 24, 2002).\n(h)*\nAmendment No. 7 to the Manhattan Associates, Inc. 1998 Stock Incentive Plan (Incorporated by reference to Exhibit 4.10 to the Company’s Form S-8 (File No. 333-105913), filed on June 6, 2003).\n10.8*\nForm of Composite Stock Option Agreement (Incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report for the period ended March 31, 2006 (File No. 000-23999), filed on May 4, 2006).\nExhibit\nNumber\nDescription\n10.9(a)*\nExecutive Employment Agreement by and between the Registrant and Peter F. Sinisgalli, effective as of February 25, 2004 (Incorporated by reference to Exhibit 10.28 to the Company’s Annual Report for the period ended December 31, 2003 (File No. 000-23999), filed on March 15, 2004).\n(b)*\nModification dated July 19, 2007 by and between the Company and Peter F. Sinisgalli to the Executive Employment Agreement dated February 25, 2004 (Incorporated by reference to Exhibit 10.1 to the Company’s Form 8-K (File No. 000-23999), filed on July 24, 2007).\n10.10*\nExecutive Employment Agreement by and between the Registrant and Peter F. Sinisgalli, effective as of April 13, 2012 (Incorporated by reference to Exhibit 10.1 to the Company’s Form 8-K (File No. 000-23999), filed on December 23, 2011).\n10.11*\nSeparation and Non-Competition Agreement by and between the Registrant and Peter F. Sinisgalli, effective as of February 25, 2004 (Incorporated by reference to Exhibit 10.29 to the Company’s Annual Report for the period ended December 31, 2003 (File No. 000-23999), filed on March 15, 2004).\n10.12(a)*\nForm of Executive Employment Agreement (Incorporated by reference to Exhibit 10.1 to the Company’s Form 8-K (File No. 000-23999) filed on April 4, 2013).\n(b)*\nUpdated Schedule to Form of Executive Employment Agreement of Initial Salaries and Target Bonus Opportunities for Named Executive Officers (Incorporated by reference to Exhibit 10.1(b) to the Company’s Quarterly Report on Form 10-Q for the period ended June 30, 2013 (File No. 000-23999) filed on July 31, 2013).\n10.13*\nExecutive Employment Agreement with Steven P. Smith (Incorporated by reference to Exhibit 10.3 to the Company’s Quarterly Report on Form 10-Q for the period ended June 30, 2013 (File No. 000-23999) filed on July 31, 2013).\n10.14 *\nForm of Modification Agreement for Terms and Conditions for Stock Options. (Incorporated by reference to Exhibit 10.3 to the Company’s Form 8-K (File No. 000-23999), filed on January 2, 2009).\n10.15\nForm of License Agreement, Software Maintenance Agreement and Consulting Agreement (Incorporated by reference to Exhibit 10.18 to the Company’s Pre-Effective Amendment No. 1 to its Registration Statement on Form S-1 (File No. 333-47095), filed on April 2, 1998).\n10.16\nForm of Software License, Services and Maintenance Agreement (Incorporated by reference to Exhibit 10.21 to the Company’s Annual Report for the period ended December 31, 1998 (File No. 000-23999), filed on March 31, 1999).\n10.17(a)*\n2007 Stock Incentive Plan, as amended by the First Amendment thereto (Incorporated by reference to Annex A to the Company’s Definitive Proxy Statement related to its 2009 Annual Meeting of Shareholders (File No. 000-23999) filed on April 20, 2009).\n(b)*\nSecond amendment to 2007 Stock Incentive Plan (Incorporated by reference to Annex A to the Company’s Definitive Proxy Statement related to its 2011 Annual Meeting of Shareholders (File No. 000-23999) filed on April 15, 2011).\n(c)*\nThird amendment to 2007 Stock Incentive Plan (Incorporated by reference to Annex A to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q for the period ended September 30, 2017 (File No. 000-23999) filed on October 30, 2017).\n10.18*\nWritten Summary of Manhattan Associates, Inc. Annual Cash Incentive Plan (Incorporated by reference to Exhibit 10.47 to the Company’s Annual Report for the period ended December 31, 2009 (File No. 000-23999), filed on February 19, 2010).\n10.19*\nForm of Manhattan Associates, Inc. Restricted Stock Award Agreement for Employees (Incorporated by reference to Exhibit 10.48 to the Company’s Annual Report for the period ended December 31, 2009 (File No. 000-23999), filed on February 19, 2010).\n10.20*\nForm of Manhattan Associates, Inc. Restricted Stock Award Agreement for Non-Employee Directors (Incorporated by reference to Exhibit 10.49 to the Company’s Annual Report for the period ended December 31, 2009 (File No. 000-23999), filed on February 19, 2010).\n10.21*\nForm of Manhattan Associates, Inc. Restricted Stock Unit Award Agreement for Employees (Incorporated by reference to Exhibit 10.50 to the Company’s Annual Report for the period ended December 31, 2012 (File No. 000-23999), filed on February 23, 2012).\nExhibit\nNumber\nDescription\n10.22*\nForm of Manhattan Associates, Inc. Restricted Stock Unit Award Agreement for Non-Employee Directors (Incorporated by reference to Exhibit 10.51 to the Company’s Annual Report for the period ended December 31, 2012 (File No. 000-23999), filed on February 23, 2012).\n10.23*\nExecutive Employment Agreement by and between the Registrant and Bruce Richards, effective as of August 1, 2011 (Incorporated by reference to Exhibit 10.52 to the Company’s Annual Report for the period ended December 31, 2012 (File No. 000-23999), filed on February 23, 2012).\n10.24*\nSeverance and Non-Competition Agreement by and between the Registrant and Bruce Richards, effective as of August 1, 2011 (Incorporated by reference to Exhibit 10.53 to the Company’s Annual Report for the period ended December 31, 2012 (File No. 000-23999), filed on February 23, 2012).\n10.25*\nModification Agreement for Terms and Conditions for Stock Options by and between the Registrant and Eddie Capel, effective as of June 4, 2007 (Incorporated by reference to Exhibit 10.54 to the Company’s Annual Report for the period ended December 31, 2012 (File No. 000-23999), filed on February 23, 2012).\n10.26*\nSeverance and Non-Competition Agreement by and between the Registrant and Eddie Capel, effective as of March 18, 2010 (Incorporated by reference to Exhibit 10.55 to the Company’s Annual Report for the period ended December 31, 2012 (File No. 000-23999), filed on February 23, 2012).\n10.27*\nSettlement Agreement by and between the Registrant and Steven P. Smith, effective as of June 8, 2015 (Incorporated by reference to Exhibit 10.1 to the Company’s Form 8-K (File No. 000-23999), filed on June 12, 2015).\n10.28\n2016 Annual Cash Bonus Plan (Incorporated by reference from Annex B to the Company’s Definitive Proxy Statement for its 2016 Annual Meeting of Shareholders filed with the SEC on April 8, 2016 (SEC File No. 000-23999)).\n10.29*\nExecutive Employment Agreement with Linda C. Pinne (Incorporated by reference to Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q for the period ended March 31, 2016 (File No. 000-23999), filed on April 22, 2016).\n10.30*\nIndemnification Agreement with Linda C. Pinne (Incorporated by reference to Exhibit 10.3 to the Company’s Quarterly Report on Form 10-Q for the period ended March 31, 2016 (File No. 000-23999), filed on April 22, 2016).\n10.31*\nConsulting Agreement, dated May 12, 2016, by and between the Registrant and Dan Lautenbach (Incorporated by reference to Exhibit 10.1 to the Company’s Form 8-K (File No. 000-23999), filed on May 13, 2016).\n10.32*\nExecutive Employment Letter Agreement, dated July 27, 2016, by and between the Registrant and Dennis Story (Incorporated by reference to Exhibit 10.1 to the Company’s Form 8-K (File No. 000-23999), filed on August 1, 2016).\n10.33*\nForm of Executive Employment Agreement (Incorporated by reference to Exhibit 10.1 to the Company’s Form 10-Q for the period ended September 30, 2018 (File No. 000-23999), filed on October 25, 2018).\n10.34\nLease Deed by and between Brookefields Real Estate and Projects Private Limited and Manhattan Associates India Development Centre Private Ltd dated March 18, 2019 - Unit 1 (Incorporated by reference to Exhibit 10.34 to the Company’s Form 10-Q for the period ended March 31, 2019 (File No. 000-23999), filed on April 25, 2019).\n10.35\nLease Deed by and between Brookefields Real Estate and Projects Private Limited and Manhattan Associates India Development Centre Private Ltd dated March 18, 2019 - Unit 2 (Incorporated by reference to Exhibit 10.35 to the Company’s Form 10-Q for the period ended March 31, 2019 (File No. 000-23999), filed on April 25, 2019).\n10.36\nLease Deed by and between Brookefields Real Estate and Projects Private Limited and Manhattan Associates India Development Centre Private Ltd dated May 1, 2019 - 5,318 sq. ft. (Incorporated by reference to Exhibit 10.36 to the Company’s Form 10-Q for the period ended June 30, 2019 (File No. 000-23999), filed on July 25, 2019).\n10.37\nLease Deed by and between Brookefields Real Estate and Projects Private Limited and Manhattan Associates India Development Centre Private Ltd dated May 1, 2019 - 10,001 sq. ft. (Incorporated by reference to Exhibit 10.37 to the Company’s Form 10-Q for the period ended June 30, 2019 (File No. 000-23999), filed on July 25, 2019).\n10.38*\nManhattan Associates, Inc. 2020 Equity Incentive Plan (incorporated by reference to Annex A to the Company’s Definitive Proxy Statement related to its 2020 Annual Meeting of Shareholders filed with the Securities and Exchange Commission on March 30, 2020 (Commission File No. 000-23999))\n21.1\nList of Subsidiaries.\nExhibit\nNumber\nDescription\n23.1\nConsent of Ernst & Young LLP, Independent Registered Public Accounting Firm.\n31.1\nCertification of Principal Executive Officer pursuant to Rule 13a-14(a)/15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2\nCertification of Principal Financial Officer pursuant to Rule 13a-14(a)/15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32**\nCertification of Principal Executive Officer and Principal Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nThe cover page from the Company’s Quarterly Report on Form 10-K for the year ended December 31, 2020, has been formatted in Inline XBRL.\n*\nManagement contract or compensatory plan or agreement.\n**\nIn accordance with Item 601(b)(32)(ii) of the SEC’s Regulation S-K, this Exhibit is hereby furnished to the SEC as an accompanying document and is not deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934 or otherwise subject to the liabilities of that Section, nor shall it be deemed incorporated by reference into any filing under the Securities Act of 1933.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nMANHATTAN ASSOCIATES, INC.\nBy:\n/s/ Eddie Capel\nEddie Capel\nPresident, Chief Executive Officer, and Director\nDate: February 5, 2021\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ John J. Huntz, Jr.\nChairman of the Board\nFebruary 5, 2021\nJohn J. Huntz, Jr.\n/s/ Eddie Capel\nPresident, Chief Executive Officer, and Director\n(Principal Executive Officer)\nFebruary 5, 2021\nEddie Capel\n/s/ Dennis B. Story\nExecutive Vice President, Chief Financial Officer, and Treasurer (Principal Financial Officer)\nFebruary 5, 2021\nDennis B. Story\n/s/ Linda C. Pinne\nSenior Vice President, Global Corporate Controller, and Chief\nAccounting Officer (Principal Accounting Officer)\nFebruary 5, 2021\nLinda C. Pinne\n/s/ Edmond I. Eger III\nDirector\nFebruary 5, 2021\nEdmond I. Eger III\n/s/ Linda T. Hollembaek\nDirector\nFebruary 5, 2021\nLinda T. Hollembaek\n/s/ Charles E. Moran\nDirector\nFebruary 5, 2021\nCharles E. Moran\n/s/ Thomas E. Noonan\nDirector\nFebruary 5, 2021\nThomas E. Noonan\n/s/ Deepak Raghavan\nDirector\nFebruary 5, 2021\nDeepak Raghavan"
}