{
    "cik": "1066684",
    "company": "THEGLOBE COM INC",
    "filing_type": "10-K",
    "filing_date": "2021-03-26",
    "period_of_report": "2020-12-31",
    "sic": "7310",
    "state_of_inc": "DE",
    "state_location": "FL",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1066684/0001104659-21-042359-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1066684/000110465921042359/tm211099d1_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1066684/0001104659-21-042359.txt",
    "filename": "1066684_10K_2020_0001104659-21-042359.htm",
    "item_1": "Item 1. BUSINESS\nItem 2. PROPERTIES\nItem 3. LEGAL PROCEEDINGS\nItem 4. MINE SAFETY DISCLOSURES\nPart II\nItem 5. MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nItem 6. SELECTED FINANCIAL DATA\nItem 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nItem 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nItem 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nPart III\nItem 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nItem 11. EXECUTIVE COMPENSATION\nItem 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nItem 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nItem 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nPart IV\nItem 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\nFORWARD LOOKING STATEMENTS\nCAUTIONARY NOTE REGARDING FORWARD LOOKING STATEMENTS\nThis Form 10-K contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended (with the rules promulgated thereunder, the “Securities Act”), and Section 21E of the Securities Exchange Act of 1934, as amended (with the rules promulgated thereunder, the “Exchange Act”). These statements concern expectations, beliefs, projections, plans and strategies, anticipated events or trends and similar expressions concerning matters that are not historical facts. In some cases, you can identify forward-looking statements by terminology, such as “may,” “will,” “should,” “could,” “expect,” “plan,” “anticipate,” “believe,” “estimate,” “project,” “predict,” “intend,” “potential” or “continue” or the negative of such terms or other comparable terminology, although not all forward-looking statements contain such terms. In addition, these forward-looking statements include, but are not limited to, statements regarding:\n• our need for and ability to obtain additional equity and debt capital financing to continue as a going concern, and the sources of such capital;\n• our intent with respect to future dividends;\n• the continued forbearance of certain related parties from making demand for payment under certain contractual obligations of, and loans to, the Company; and\n• our estimates with respect to certain accounting and tax matters.\nThese forward-looking statements reflect our current view about future events and are subject to risks, uncertainties and assumptions. Unless required by law, we do not intend to update any of the forward-looking statements after the date of this Form 10-K or to conform these statements to actual results. We wish to caution readers that certain important factors may have affected and could in the future affect our actual results and could cause actual results to differ significantly from those expressed in any forward-looking statement. A description of risks that could cause our results to vary appears under “Risk Factors” and elsewhere in this Form 10-K. The most important factors that could prevent us from achieving our goals, and cause the assumptions underlying forward-looking statements and the actual results to differ materially from those expressed in or implied by those forward-looking statements include, but are not limited to, the following:\n• our ability to raise additional and sufficient capital;\n• our ability to continue to receive funding from related parties;\n• the impact of the COVID-19 pandemic on the economy and financial markets; and\n• our ability to successfully estimate the impact of certain accounting and tax matters.\nPart I\nItem 1. BUSINESS\nDESCRIPTION OF BUSINESS\nGeneral\ntheglobe.com, inc. (the “Company,” “theglobe,” “we” or “us”) was incorporated on May 1, 1995 and commenced operations on that date. Originally, we were an online community with registered members and users in the United States and abroad. On September 29, 2008, we consummated the sale of the business and substantially all of the assets of our subsidiary, Tralliance Corporation (“Tralliance”), to Tralliance Registry Management Company, LLC (“Tralliance Registry Management”), an entity controlled by Michael S. Egan, our former Chairman and Chief Executive Officer. As a result of and on the effective date of the sale of our Tralliance business, which was our last remaining operating business, we became a “shell company,” as that term is defined in Rule 12b-2 of the Exchange Act, with no material operations or assets.\nOn December 20, 2017, Delfin Midstream LLC (“Delfin”) entered into a Common Stock Purchase Agreement with certain of our stockholders for the purchase of a total of 312,825,952 shares of our common stock, par value $0.001 per share (“Common Stock”), representing approximately 70.9% of our Common Stock.\nAs a shell company, our operating expenses have consisted primarily of, and we expect them to continue to consist primarily of, customary public company expenses, including personnel, accounting, financial reporting, legal, audit and other related public company costs.\nAs of December 31, 2020, as reflected in our accompanying Balance Sheet, our current liabilities exceed our total assets. We prefer to avoid filing for protection under the U.S. Bankruptcy Code. However, unless we are successful in raising additional funds through the offering of debt or equity securities, we may not be able to continue to operate as a going concern for any significant length of time in the future. Notwithstanding the above, we currently intend to continue operating as a public company and make all the requisite filings under the Exchange Act.\nEMPLOYEES\nAs of March 1, 2021, we had no employees. Our executive officer currently devotes very limited time to our business and receives no compensation from us. Our executive officer is an officer, director and/or stockholder of other companies which may have ongoing business relationships with the Company. See the section in this annual report entitled “",
    "item_1A": "Item 1A. RISK FACTORS\nRisks Relating to Our Business\nWe may not be able to continue as a going concern.\nThe accompanying financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America on a going concern basis, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business. Accordingly, the financial statements do not include any adjustments relating to the recoverability of assets and classification of liabilities that might be necessary should we be unable to continue as a going concern. However, for the reasons described below, we do not believe that cash on hand and cash flow generated internally by us will be adequate to fund our limited overhead and other cash requirements beyond the next twelve months. These reasons raise significant doubt about our ability to continue as a going concern. In addition, our independent registered public accounting firm has issued a report that included an explanatory paragraph referring to our significant net losses, working capital deficit and need to raise additional capital, which as it noted raised substantial doubt about our ability to continue as a going concern.\nDelfin Midstream LLC (“Delfin”), the Company’s majority stockholder, has continued to fund the Company through loans to the Company. See the section of this annual report entitled “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations - Liquidity and Capital Resources.” At December 31, 2020, the Company had a net working capital deficit of approximately $707,000. This deficit included accrued expenses of approximately $24,000, accounts payable of approximately $2,000 and approximately $689,000 in principal and accrued interest owed under the Promissory Note with Delfin.\nOn a short term liquidity basis, we must receive capital contributions or loans from Delfin or its affiliates in order to continue as a going concern. We prefer to avoid filing for protection under the U.S. Bankruptcy Code. However, based upon our current financial condition as discussed above, we believe that we will need to raise additional debt or equity capital in order for us to continue to operate as a going concern on a long-term basis. Any such capital would likely come from Delfin, as we currently have no access to credit facilities and have traditionally relied on borrowings from related parties to meet short-term liquidity needs. Any equity capital raised may result in substantial dilution in the number of outstanding shares of our common stock, par value $0.001 per share (“Common Stock”). We intend to use the proceeds from the 2018 Promissory Note and seek other loans from Delfin and related entities, if necessary, to fund our public company operating costs while we explore our options related to the future of theglobe.\nThrough December 2020, we borrowed a total of $600,000 under an amended and restated promissory note from Delfin, which was increased to $637,500 in February 2021.\nThe coronavirus (COVID-19) pandemic and its impact on debt and equity markets could have a material adverse effect on our financial condition and ability to operate as a going concern.\nIn December 2019, a novel strain of coronavirus (COVID-19) was reported to have surfaced in Wuhan, China, which has and is continuing to spread throughout other parts of the world, including the United States. The outbreak of the coronavirus has resulted in a widespread health crisis and has adversely affected the economies and financial markets worldwide, business operations and the conduct of commerce generally. In particular, the global capital markets are experiencing and may continue to experience periods of disruption and instability, which could be prolonged and which could materially and adversely impact the broader financial and credit markets. Such disruption could have a material adverse effect on our ability to raise additional funds through the offering of debt or equity securities, which in turn could impact our ability to operate as a going concern beyond the next twelve months\nOur management may have other interests that may conflict with the interests of our stockholders.\nMr. Jones became our Chief Executive Officer in 2018. Mr. Jones currently serves as the Chief Executive Officer of Fairwood, which is a material stockholder of Delfin, our controlling stockholder. Mr. Jones is a material stockholder of Delfin and also maintains directorships, investments and participations with and in other companies and entities, including those that may be involved in the gas and/or energy business. Although there are currently no relationships between the Company and these entities, Mr. Jones, due to his relationship with such entities, will have an inherent conflict of interest in making any decision related to transactions between the related entities and the Company. Furthermore, since Mr. Jones is also the sole member of our Board of Directors (the “Board”), our Board presently is not “independent.” In the event that we have independent directors in the future, we intend to review related party transactions on a case-by-case basis.\nWe currently have no business operations and are a shell company.\nImmediately following the closing of the Tralliance Purchase Transaction, we became a shell company with no material operations or assets, and no source of revenue other than under the “net revenue” earn-out arrangement with Tralliance Registry Management. We expect that our future operating expenses as a public shell company will consist primarily of customary public company expenses, including legal, audit and other miscellaneous public company costs which will need to be paid by Delfin. In addition, our lack of operations, assets and current prospects makes it difficult for investors to evaluate our future performance.\nWe may require additional financing to maintain our reporting requirements and administrative expenses.\nWe have no meaningful revenues and are dependent on our cash on hand to fund the costs associated with the reporting obligations under the Exchange Act, and other administrative costs associated with our corporate existence. For the years ended December 31, 2020 and 2019, we incurred net losses of $163,836 and $211,374, respectively. General and administrative expenses include customary public company expenses, including outside legal and audit fees, insurance and other related public company costs. We do not expect to generate any revenues unless and until we commence business operations. In the past, we relied on funding from affiliated creditors and we may need additional funding beyond those sources to continue as a going concern. In the event that our available funds prove to be insufficient, we will be required to seek additional financing. Our failure to secure additional financing could have a material adverse effect on our ability to pay the legal and audit fees and other administrative costs in order to continue to fulfill our reporting obligations. We do not have any arrangements with any bank or financial institution to secure additional financing and such financing may not be available on terms acceptable and in our best interests, if at all.\nWe may suffer adverse consequences if we are deemed an investment company under the Investment Act of 1940 and we may incur significant costs to avoid investment company status.\nWe do not believe that we are an “investment company” as defined by the Investment Company Act of 1940. If the Securities and Exchange Commission, or SEC, or a court were to disagree with us, we could be required to register as an investment company. This would negatively affect our ability to consummate a potential acquisition of an operating company, subjecting us to disclosure and accounting guidance geared toward investment, rather than operating companies; limiting our ability to borrow money, issue options, issue multiple classes of stock and debt, and engage in transactions with affiliates; and requiring us to undertake significant costs and expenses to meet disclosure and regulatory requirements to which we would be subject as a registered investment company.\nRisks Relating to Our Common Stock\nWe are controlled by our majority stockholder, which may limit the ability of our other stockholders to influence future corporate action.\nAs of December 31, 2020, our majority stockholder, Delfin Midstream LLC, holds approximately 70.9% of the issued and outstanding shares of our Common Stock. Accordingly, Delfin continues to be in a position to control the vote on all corporate actions in the future.\nThe delisting of our Common Stock makes it more difficult for investors to sell shares.\nThe shares of our Common Stock were delisted from the NASDAQ national market in April 2001 and are now traded in the over-the-counter market on what is commonly referred to as the electronic bulletin board or “OTCBB.” As a result, an investor may find it more difficult to dispose of or obtain accurate quotations as to the market value of the securities, if at all. The delisting has made trading our shares more difficult for investors. It has also made it more difficult for us to raise additional capital. We may also incur additional costs under state blue-sky laws if we sell equity due to our delisting.\nWe do not currently intend to pay dividends on our Common Stock and, consequently, the ability of our stockholders to achieve a return on their investment in our Common Stock will depend on appreciation in the price of our Common Stock.\nWe do not expect to pay cash dividends on our Common Stock. Any future dividend payment is within the absolute discretion of our Board and will depend on, among other things, our results of operations, working capital requirements, capital expenditure requirements, financial condition, contractual restrictions, business opportunities, anticipated cash needs, provisions of applicable law and other factors that our Board may deem relevant. We may not generate sufficient cash from operations in the future to pay dividends on our Common Stock. As a result, the success of an investment in our Common Stock will depend on future appreciation in its value. The price of our Common Stock may not appreciate in value or even maintain the price at which our stockholders purchased shares. If our Common Stock does not appreciate in value, investors could suffer losses in their investment in our Common Stock.\nOur Common Stock is subject to certain “penny stock” rules which may make it a less attractive investment.\nSince the trading price of our Common Stock is less than $5.00 per share and our net tangible assets are less than $2.0 million, trading in our Common Stock is subject to the requirements of Rule 15g-9 of the Exchange Act. Under Rule 15g-9, brokers who recommend penny stocks to persons who are not established customers and accredited investors, as defined in the Exchange Act, must satisfy special sales practice requirements, including requirements that they make an individualized written suitability determination for the purchaser; and receive the purchaser’s written consent prior to the transaction. The Securities Enforcement Remedies and Penny Stock Reform Act of 1990 also requires additional disclosures in connection with any trades involving a penny stock, including the delivery, prior to any penny stock transaction, of a disclosure schedule explaining the penny stock market and the risks associated with that market. Such requirements may severely limit the market liquidity of our Common Stock and the ability of purchasers of our equity securities to sell their securities in the secondary market. For all of these reasons, an investment in our equity securities may not be attractive to our potential investors.\nAs a shell company, we are subject to more stringent reporting requirements.\nWe have no or nominal operations and assets, and pursuant to Rule 405 and Exchange Act Rule 12b-2, we are a shell company. Applicable securities rules prohibit shell companies from using a Form S-8 to register securities pursuant to employee compensation plans. However, the rules do not prevent us from registering securities pursuant to certain other registration statements. Additionally, Form 8-K requires shell companies to provide more detailed disclosure upon completion of a transaction that causes it to cease being a shell company. To the extent we acquire a business in the future, we must file a current report on Form 8-K containing the information required in a registration statement on Form 10, within four business days following completion of the transaction together with financial information of the private operating company. In order to assist the SEC in the identification of shell companies, we are also required to check a box on Form 10-Q and Form 10-K indicating that we are a shell company. To the extent that we are required to comply with additional disclosure because we are a shell company, we may be delayed in executing any mergers or acquiring other assets that would cause us to cease being a shell company.\nRule 144 is not generally available to holders of our Common Stock which makes it difficult to resell shares in the future.\nWith limited exceptions related to restrictive securities acquired before we became a “shell company,” holders of our restricted securities are limited in their ability to resell their securities pursuant to Rule 144. Preclusion from the use of the resale exemption from registration afforded by Rule 144 may make it more difficult for us to sell equity securities in the future, and for stockholders to resell their restricted securities.\nOur need for capital may create additional risks and create dilution to existing stockholders.\nAs mentioned above, we will need to raise additional capital in the future, which may be funded from unrelated third party sources, including the incurring of debt and/or the sale of additional equity securities. In addition, we may require additional financing to fund working capital and operating losses in the future should the need arise. The incurrence of debt creates additional financial leverage and therefore an increase in the financial risk of our operations. The sale of additional equity securities may be dilutive to the interests of our current stockholders. In addition, there can be no assurance that such additional financing, whether debt or equity, will be available to us or that it will be available on acceptable commercial terms. Any inability to secure such additional financing on acceptable terms could have a materially adverse impact on our business, financial condition and operating results.",
    "item_1B": "Item 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item_2": "Item 2. PROPERTIES\nThe Company does not own or lease any property. We currently use the offices of Delfin at no cost to us.",
    "item_3": "Item 3. LEGAL PROCEEDINGS\nNone.",
    "item_4": "Item 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPart II",
    "item_5": "Item 5. MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMARKET INFORMATION\nMarket Information\nThe shares of our Common Stock are quoted for trading on the over-the-counter market on what is commonly referred to as the electronic bulletin board, under the symbol “TGLO”. The following table sets forth the range of high and low bid prices of our Common Stock for the periods indicated as reported by the over-the-counter market (the electronic bulletin board). The quotations below reflect inter-dealer prices, without retail mark-up, mark-down or commission and may not represent actual transactions (prices are rounded to the nearest cent):\nHigh\nLow\nHigh\nLow\nFourth Quarter\n$ 0.12\n$ 0.03\n$ 0.04\n$ 0.02\nThird Quarter\n$ 0.10\n$ 0.02\n$ 0.06\n$ 0.02\nSecond Quarter\n$ 0.04\n$ 0.02\n$ 0.08\n$ 0.01\nFirst Quarter\n$ 0.05\n$ 0.02\n$ 0.07\n$ 0.02\nHolders of Common Stock\nWe had approximately 493 holders of record of Common Stock as of March 8, 2021. This does not reflect persons or entities that hold Common Stock in nominee or “street” name through various brokerage firms.\nDividends\nWe have not paid any cash dividends on our Common Stock since our inception and do not intend to pay dividends in the foreseeable future. Our Board will determine if we pay any future dividends.\nStock Performance Graph\nAs a “smaller reporting company,” as defined by Rule 12b-2 of the Exchange Act, we have elected scaled disclosure reporting and therefore are not required to provide the stock performance graph.\nRecent Sales of Unregistered Securities\nNone.\nRepurchases of Equity Securities\nNone.",
    "item_6": "Item 6. SELECTED FINANCIAL DATA\nAs a “smaller reporting company,” as defined by Rule 12b-2 of the Exchange Act, we have elected scaled disclosure reporting and therefore are not required to provide the information required by this Item.",
    "item_7": "Item 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOverview\nAs a shell company, we currently have no material operations or assets.\nBasis of Presentation of Financial Statements; Going Concern\nWe received a report from our independent registered public accountants, relating to our December 31, 2020 audited financial statements, containing an explanatory paragraph regarding our ability to continue as a going concern. As a shell company, our management believes that we will not be able to generate operating cash flows sufficient to fund our operations and pay our existing current liabilities in the foreseeable future. Based upon our current limited cash resources and without the infusion of additional capital and/or the continued forbearance of our creditors, our management does not believe we can operate as a going concern beyond the next twelve months. See “Future and Critical Need for Capital” section of this Management’s Discussion and Analysis of Financial Condition and Results of Operations for further details.\nOur financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America on a going concern basis, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business. Accordingly, our financial statements do not include any adjustments relating to the recoverability of assets and classification of liabilities that might be necessary should we be unable to continue as a going concern.\nAll Note references relate to accompanying Notes to Financial Statements.\nResults of Operations\nYear Ended December 31, 2020 Compared to Year Ended December 31, 2019\nNet Revenue\nCommensurate with the sale of our Tralliance business on September 29, 2008, we became a shell company, and have not had any material operations since then. As a result, net revenue was $0 for both of the years ended December 31, 2020 and 2019.\nGeneral and Administrative\nGeneral and administrative expenses include only those customary public company expenses, including outside legal and audit fees, insurance and other related public company costs. General and administrative expenses totaled approximately $118,000 for the year ended December 31, 2020 and $178,000 for the year ended December 31, 2019. The decrease was due to less legal fees and no proxy mailing fees in the current year as compared to prior year.\nRelated Party Interest Expense\nRelated party interest expense for the years ended December 31, 2020 and 2019 was approximately $46,000 and $34,000, respectively, and consisted of interest due and payable to Delfin under the Bridge Note. The increase is due to an increase in the amount of money borrowed from Delfin.\nNet Loss\nNet loss for the year ended December 31, 2020 was approximately $164,000 as compared to a net loss of approximately $211,000 for the year ended December 31, 2019.\nLiquidity and Capital Resources\nFuture and Critical Need for Capital\nThe accompanying financial statements have been prepared in accordance with accounting principles generally accepted in the U.S. on a going concern basis, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business. Accordingly, the financial statements do not include any adjustments relating to the recoverability of assets and classification of liabilities that might be necessary should we be unable to continue as a going concern. However, for the reasons described below, our management does not believe that cash on hand and cash flow generated internally by us will be adequate to fund our limited overhead and other cash requirements beyond the next twelve months. These reasons raise significant doubt about our ability to continue as a going concern. Additionally, the COVID 19 pandemic could have an adverse effect on our ability to continue operating. Please see Item 1A. RISK FACTORS.\nIn March 2018, the Company executed a Promissory Note with Delfin, which was amended and restated in May 2018 to $150,000, in November 2018 to $350,000, in June 2019 to $465,000, in November 2019 to $554,100, in August 2020 to $600,000, and then again in February 2021 to increase the principal amount to up to $637,500 to pay certain accrued expenses, accounts payable and to allow the Company to have working capital. Interest accrues on the unpaid principal balance at a rate of 8% per annum, calculated on a 365/66 day year, as applicable. The Promissory Note is due upon demand. It may be prepaid in whole or in any part at any time prior to demand. The Company expects continued funding from Delfin over the next twelve months.\nDelfin, the Company’s majority stockholder, has continued to fund the Company through loans to the Company (see Note 3). At December 31, 2020, the Company had a net working capital deficit of approximately $707,000. This deficit included accrued expenses of approximately $24,000, accounts payable of approximately $2,000 and approximately $689,000 in principal and accrued interest owed under the Promissory Note with Delfin.\nCash Flow Items\nYear Ended December 31, 2020 Compared to Year Ended December 31, 2019\nAs of December 31, 2020, we had $7,624 in cash as compared to $86,961 as of December 31, 2019. The decrease is due to timing of funding. We receive funding, then use most of those funds prior to receiving more funding. Net cash flows used in operating activities totaled approximately $125,000 for the year ended December 31, 2020 compared to cash flows used in operating activities of approximately $173,000 for the year ended December 31, 2019.\nNet cash flows provided by financing activities totaled approximately $46,000 for the year ended December 31, 2020 compared to $254,000 for the year ended December 31, 2019. The decrease was due in part to timimg of funding, but also due to a significant decrease in legal costs, requiring less cash.\nContractual Obligations\nAs a “smaller reporting company,” as defined by Rule 12b-2 of the Exchange Act, we have elected scaled disclosure reporting and therefore are not required to provide the table required by (a)(5) of this Item.\nOff-Balance Sheet Arrangements\nAs of December 31, 2020, we did not have any material off-balance sheet arrangements that have or are reasonably likely to have a material effect on our current or future financial condition, revenues or expenses, results of operations, liquidity, or capital resources.\nEffects of Inflation\nManagement believes that inflation has not had a significant effect on our results of operations during 2020 and 2019.\nCritical Accounting Policies and Estimates\nThe preparation of our financial statements in conformity with accounting principles generally accepted in the U.S. requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. Our estimates, judgments and assumptions are continually evaluated based on available information and experience. Because of the use of estimates inherent in the financial reporting process, actual results could differ from those estimates. Certain of our accounting policies require higher degrees of judgment than others in their application. These include valuations of accounts payable and accrued expenses.\nImpact of Recently Issued Accounting Standards\nManagement has determined that all recently issued accounting pronouncements will not have a material impact on our financial statements or do not apply to our operations.",
    "item_7A": "Item 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nAs a “smaller reporting company,” as defined by Rule 12b-2 of the Exchange Act, we have elected scaled disclosure reporting and therefore are not required to provide the information required by this Item.",
    "item_8": "Item 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nFINANCIAL STATEMENTS\nTHEGLOBE.COM, INC.\nPage\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nBALANCE SHEETS\nSTATEMENTS OF OPERATIONS\nSTATEMENTS OF STOCKHOLDERS’ EQUITY (DEFICIT)\nSTATEMENTS OF CASH FLOWS\nNOTES TO FINANCIAL STATEMENTS\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and Board of Directors of\ntheglobe.com, inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of theglobe.com, Inc. (the “Company”) as of December 31, 2020 and 2019, the related statements of operations, stockholders’ equity (deficit) and cash flows for each of the two years in the period ended December 31, 2020, and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2020 and 2019, and the results of its operations and its cash flows for each of the two years in the period ended December 31, 2020, in conformity with accounting principles generally accepted in the United States of America.\nExplanatory Paragraph - Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As more fully described in Note 2, the Company has a significant working capital deficiency, has incurred significant losses and needs to raise additional funds to meet its obligations and sustain its operations. These conditions raise substantial doubt about the Company's ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company's internal control over financial reporting. Accordingly, we express no such opinion..\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provides a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current-period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ Marcum LLP\nMarcum LLP\nWe have served as the Company’s auditor since 2001.\nWest Palm Beach, Florida\nMarch 26, 2021\nTHEGLOBE.COM, INC.\nBALANCE SHEETS\nDecember 31, 2019\nDecember 31, 2020\nASSETS\nCurrent Assets:\nCash\n$ 86,961\n$ 7,624\nTotal current assets\n$ 86,961\n$ 7,624\nLIABILITIES AND STOCKHOLDERS’ DEFICIT\nCurrent Liabilities:\nAccounts payable\n$ 9,078\n$ 2,000\nAccrued expenses and other current liabilities\n24,000\n24,000\nAccrued interest due to related party\n43,224\n88,901\nNotes payable due to related party\n554,100\n600,000\nTotal current liabilities\n630,402\n714,901\nStockholders’ Deficit:\nCommon stock, $0.001 par value; 500,000,000 shares authorized; 441,480,473 shares issued at December 31, 2019 and December 31, 2020\n441,480\n441,480\nPreferred stock, $0.001 par value; 3,000,000 shares authorized; 0 shares issued at December 31, 2019 and 2020\n--\n--\nAdditional paid in capital\n296,594,042\n296,594,042\nAccumulated deficit\n(297,578,963 )\n(297,742,799 )\nTotal stockholders’ deficit\n(543,441 )\n(707,277 )\nTotal liabilities and stockholders’ deficit\n$ 86,961\n$ 7,624\nSee notes to financial statements.\nTHEGLOBE.COM, INC.\nSTATEMENTS OF OPERATIONS\nYear Ended December 31,\nNet Revenue\n$ -\n$ -\nOperating Expenses:\nGeneral and administrative\n177,552\n118,160\nOperating Loss\n(177,552 )\n(118,160 )\nOther Income (Expense), net:\nMiscellaneous Income\n-\nRelated party interest expense\n(34,157 )\n(45,676 )\nLoss from Operations Before Income Taxes\n(211,374 )\n(163,836 )\nIncome Taxes\n-\n-\nLoss from Operations\n(211,374 )\n(163,836 )\nNet Loss\n$ (211,374 )\n$ (163,836 )\nLoss Per Share:\nBasic and Diluted:\n$ -\n$ -\nWeighted Average Common Shares Outstanding\n441,480,473\n441,480,473\nSee notes to financial statements.\nTHEGLOBE.COM, INC.\nSTATEMENTS OF STOCKHOLDERS’ EQUITY (DEFICIT)\nCommon Stock\nAdditional\nShares\nAmount\nPaid-in\nCapital\nAccumulated\nDeficit\nTotal\nBalance, December 31, 2018\n441,480,473\n$ 441,480\n$ 294,594,042\n$ (297,367,589 )\n$ (332,067 )\nYear Ended December 31, 2019\nNet Loss\n-\n-\n(211,374 )\n(211,374 )\nBalance December 31, 2019\n441,480,473\n441,480\n296,594,042\n(297,578,963 )\n(543,441 )\nYear Ended December 31, 2020\nNet Loss\n-\n-\n-\n(163,836 )\n(163,836 )\nBalance, December 31, 2020\n441,480,473\n$ 441,480\n$ 296,594,042\n$ (297,742,799 )\n$ (707,277 )\nSee notes to financial statements.\nTHEGLOBE.COM, INC.\nSTATEMENTS OF CASH FLOWS\nYear Ended December 31,\nCash Flows from Operating Activities:\nNet Loss\n$ (211,374 )\n$ (163,836 )\nAdjustments to reconcile loss to net cash flows used in operating activities:\nChanges in operating assets and liabilities:\nAccounts payable\n1,596\n(7,078 )\nAccrued expenses and other current liabilities\n2,950\n-\nAccrued interest due to related party\n34,156\n45,677\nNet cash flows used in operating activities\n(172,672 )\n(125,237 )\nCash Flows from Financing Activities:\nBorrowings on Notes Payable\n253,738\n45,900\nNet cash flows from financing activities\n253,738\n45,900\nNet change in cash\n81,066\n(79,337 )\nCash at beginning of period\n5,895\n86,961\nCash at end of period\n$ 86,961\n$ 7,624\nSee notes to financial statements.\nTHEGLOBE.COM, INC.\nNOTES TO FINANCIAL STATEMENTS\nDecember 31, 2019 and 2020\n(1) ORGANIZATION AND SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nDESCRIPTION OF THE COMPANY\ntheglobe.com, inc. (the “Company,” “theglobe,” “we” or “us”) was incorporated on May 1, 1995 and commenced operations on that date. Originally, we were an online community with registered members and users in the United States and abroad. On September 29, 2008, we consummated the sale of the business and substantially all of the assets of our subsidiary, Tralliance Corporation (“Tralliance”), to Tralliance Registry Management Company, LLC (“Tralliance Registry Management”), an entity controlled by Michael S. Egan, our former Chairman and Chief Executive Officer. As a result of and on the effective date of the sale of our Tralliance business, which was our last remaining operating business, we became a “shell company,” as that term is defined in Rule 12b-2 of the Exchange Act, with no material operations or assets.\nOn December 20, 2017, Delfin Midstream LLC (“Delfin”) entered into a Common Stock Purchase Agreement with certain of our stockholders for the purchase of a total of 312,825,952 shares of our common stock, par value $0.001 per share (“Common Stock”), representing approximately 70.9% of our Common Stock.\nAs a shell company, our operating expenses have consisted primarily of, and we expect them to continue to consist primarily of, customary public company expenses, including personnel, accounting, financial reporting, legal, audit and other related public company costs.\nAs of December 31, 2020, as reflected in our accompanying Balance Sheet, our current liabilities exceed our total assets. We prefer to avoid filing for protection under the U.S. Bankruptcy Code. However, unless we are successful in raising additional funds through the offering of debt or equity securities, we may not be able to continue to operate as a going concern for any significant length of time in the future. Notwithstanding the above, we currently intend to continue operating as a public company and making all the requisite filings under the Exchange Act.\nUSE OF ESTIMATES\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States requires the Company to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. These estimates and assumptions relate primarily to valuations of accounts payable and accrued expenses.\nFAIR VALUE OF FINANCIAL INSTRUMENTS\nFASB Accounting Standards Codification Topic on Fair Value Measurements and Disclosure (“ASC 820”) requires that the Company disclose estimated fair values of its financial instruments. The carrying amount of certain of the Company’s financial instruments, including cash, accounts payable and accrued expenses, are a reasonable estimate of their fair values at December 31, 2020 and 2019, respectively, due to their short maturities.\nSTOCK-BASED COMPENSATION\nThe Company estimates the fair value of each stock option at the grant date by using the Black Scholes option-pricing model using the following assumptions: no dividend yield; a risk-free interest rate based on the U.S. Treasury yield in effect at the time of grant; an expected option life based on historical and expected exercise behavior; and expected volatility based on the historical volatility of the Company’s stock price, over a time period that is consistent with the expected life of the option. The portion of the value that is ultimately expected to vest is recognized as expense over the service period.\nINCOME TAXES\nThe Company accounts for income taxes using the asset and liability method. Under this method, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases for operating loss and tax credit carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in the results of operations in the period that the tax change occurs. Valuation allowances are established, when necessary, to reduce deferred tax assets to the amount expected to be realized.\nNET INCOME PER COMMON SHARE\nThe Company reports basic and diluted net income per common share in accordance with FASB ASC Topic 260, “Earnings Per Share.” Basic earnings per share is computed using the weighted average number of common shares outstanding during the period. Common equivalent shares consist of the incremental common shares issuable upon the exercise of stock options and warrants (using the treasury stock method). Common equivalent shares are excluded from the calculation if their effect is anti-dilutive. There were no potentially dilutive securities and common stock equivalents for the years ended December 31, 2020 and 2019.\nRECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS\nManagement has determined that all recently issued accounting pronouncements will not have a material impact on the Company’s financial statements or do not apply to the Company’s operations.\n(2) LIQUIDITY AND GOING CONCERN CONSIDERATIONS\nThe accompanying financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America on a going concern basis, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business. Accordingly, the financial statements do not include any adjustments relating to the recoverability of assets and classification of liabilities that might be necessary should the Company be unable to continue as a going concern. However, for the reasons described below, Company management does not believe that cash on hand and cash flow generated internally by the Company will be adequate to fund its limited overhead and other cash requirements over the next twelve months. These reasons raise substantial doubt about the Company’s ability to continue as a going concern within one year after the date that the financial statements are issued.\nDelfin, the Company’s majority stockholder, has continued to fund the Company through loans to the Company (see Note 3). At December 31, 2020, the Company had a net working capital deficit of approximately $707,000. This deficit included accrued expenses of approximately $24,000, accounts payable of approximately $2,000 and approximately $689,000 in principal and accrued interest owed under the Promissory Note with Delfin.\nThe recent coronavirus (COVID-19) pandemic and its impact on debt and equity markets could also have a material adverse effect on our financial condition and ability to operate as a going concern.\nMANAGEMENT PLANS\nManagement anticipates continued funding from Delfin over the next twelve months as it determines the direction of the Company.\n(3) DEBT\nIn March 2018, the Company executed a Promissory Note with Delfin, which was amended and restated in May 2018 to $150,000, in November 2018 to $350,000, in June 2019 to $465,000, in November 2019 to $554,100, in August 2020 to $600,000 and then again in February 2021 to increase the principal amount to up to $637,500 to pay certain accrued expenses, accounts payable and to allow the Company to have working capital. Interest accrues on the unpaid principal balance at a rate of 8% per annum, calculated on a 365/66 day year, as applicable. The Promissory Note is due upon demand. It may be prepaid in whole or in any part at any time prior to demand. Management anticipates continued funding from Delfin over the next twelve months as it determines the direction of the Company.\n(4) INCOME TAXES\nThe provision (benefit) for income taxes is summarized as follows:\nYear Ended December 31,\nContinuing operations\n$ -\n$ -\n$ -\n$ -\nThe provision (benefit) for income taxes attributable to continuing operations was as follows:\nYear Ended December 31,\nCurrent:\n$ -\n$ -\nFederal\n-\n-\nState\n$ -\n$ -\nDeferred:\n$ -\n$ -\nFederal\n-\n-\nState\n$ -\n$ -\nProvision for income taxes\n$ -\n$ -\nThe following is a reconciliation of the federal income tax provision at the federal statutory rate to the Company’s tax provision attributable to continuing operations:\nYear Ended December 31,\nStatutory federal income tax rate\n21.00 %\n21.00 %\nState income taxes, net of federal benefit\n4.74\n4.74\nChange in valuation allowance\n(25.74 )\n(25.74 )\nEffective tax rate\n0.00 %\n0.00 %\nThe tax effects of temporary differences that give rise to significant portions of the deferred tax assets and deferred tax liabilities at December 31, 2019 and 2020 are presented below.\nYear Ended December 31,\nDeferred tax assets (liabilities):\nNet operating loss carryforwards\n$ 134,000\n$ 176,000\nIssuance of warrants\n982,000\n982,000\nAccrued expenses\n29,000\n29,000\nDepreciation and amortization\n10,000\n10,000\nTotal gross deferred tax assets\n1,155,000\n1,197,000\nLess: valuation allowance\n(1,155,000 )\n(1,197,000 )\nTotal net deferred tax assets\n$ -\n$ -\nBecause of the Company’s lack of earnings history, the net deferred tax assets have been fully offset by a 100% valuation allowance. The valuation allowance for net deferred tax assets was $1,155,000 and $1,197,000 as of December 31, 2019 and 2020, respectively. The net change in the total valuation allowance was $(55,000) and $(42,000) for the years ended December 31, 2019 and 2020, respectively.\nIn assessing the realizability of deferred tax assets, management considers whether it is more likely than not that some portion or all of the deferred tax assets will not be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income during the periods in which those temporary differences become deductible. Management considers the scheduled reversal of deferred tax liabilities, projected future taxable income and tax planning strategies in making this assessment.\nAt December 31, 2020, the Company had net operating loss carryforwards available for U.S. tax purposes of approximately $682,000, which will carry forward indefinitely.\n(5) RELATED PARTY TRANSACTIONS\nUnder terms of the debt with its majority stockholder (See Note 3), the Company recorded accrued interest of approximately $43,000 and $89,000 as of December 31, 2019 and 2020, respectively and interest expense of approximately $34,000 and $46,000 for the years ended December 31, 2019 and 2020, respectively.\n(6) SUBSEQUENT EVENTS\nThe Company’s management evaluated subsequent events through the time of the filing of this report on Form 10-K. The Company’s management is not aware of any significant events that occurred subsequent to the balance sheet date but prior to the filing of this report that would have a material impact on its financial statements, with the exceptional of additional funding received from Delfin of $37,500 on February 8, 2021.",
    "item_9": "Item 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.",
    "item_9A": "Item 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nWe maintain disclosure controls and procedures that are designed to ensure (1) that information required to be disclosed by us in the reports we file or submit under the Exchange Act, is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission’s (“SEC”) rules and forms, and (2) that this information is accumulated and communicated to management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure. In designing and evaluating the disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and management necessarily was required to apply its judgment in evaluating the cost benefit relationship of possible controls and procedures.\nOur Chief Executive Officer and Chief Financial Officer has evaluated the effectiveness of our disclosure controls and procedures as of December 31, 2020. Based on that evaluation, our Chief Executive Officer and Chief Financial Officer has concluded that, as of December 31, 2020, our disclosure controls and procedures were effective.\nManagement’s Annual Report on Internal Control and Financial Reporting\nThe Company’s management, under the supervision of the Chief Executive Officer and the Chief Financial Officer, is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a - 15(f) and 15d - 15(f) under the Exchange Act). Internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP. Internal control over financial reporting includes policies and procedures that:\n(i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company;\n(ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and\n(iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with existing policies or procedures may deteriorate.\nUnder the supervision of the Chief Executive Officer and Chief Financial Officer, our management conducted an evaluation of the effectiveness of our internal control over financial reporting as of December 31, 2020. Our management used the updated Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission to perform this evaluation. Based upon this evaluation and management’s assessment, management has concluded that internal control over financial reporting was effective as of December 31, 2020. Because we are a smaller public company, we are not required to provide an independent public accountant’s attestation report covering our assessment of internal control over financial reporting.\nChanges in Internal Control over Financial Reporting\nOur management, which currently consists of Mr. Jones, acting as our Chief Executive Officer and Chief Financial Officer, has evaluated any change in our internal control over financial reporting that occurred during the quarter ended December 31, 2020 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting, and has determined there to be no reportable changes.",
    "item_9B": "Item 9B. OTHER INFORMATION\nNone.\nPart III",
    "item_10": "Item 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe following table sets forth the names, ages and current positions with the Company held by our Directors and Executive Officers.\nNAME\nAGE\nPOSITION OR OFFICE WITH THE COMPANY\nDIRECTOR SINCE\nFrederick Jones\nPresident, Chief Executive Officer, Chief\nFinancial Officer and Director\nJune 29, 2018\nWe are not aware of any arrangement or understanding between Mr. Jones and any other person pursuant to which he was elected or appointed to his current positions. Neither Mr. Jones nor any immediate family member of Mr. Jones has been a participant in any transaction or currently proposed transaction with the Company that is reportable under Item 404(a) of Regulation S-K.\nDue to his status as material stockholder of Delfin, which is our controlling stockholder, and his willingness to serve without compensation, we believe Mr. Jones is in the best position to serve as our director until such time that our controlling stockholder determines the direction of the Company.\nFrederick Jones, 73, has been involved in international commodity trading, energy infrastructure, real estate, and oil and gas businesses for approximately 47 years. Mr. Jones was one of the early investors in U.S. shale gas. For approximately the past seven (7) years, Mr. Jones has served, and continues to serve, as the Chief Executive Officer of Fairwood Peninsula Energy Corporation (“Fairwood”), a midstream liquefied natural gas company. Fairwood is a material stockholder of our controlling stockholder, Delfin Midstream, Inc. (“Delfin”). Mr. Jones was a founder of Fairwood and is currently a material Delfin stockholder. In 2019, Mr. Jones became the CEO of Energy Global Services FZE and Asiatic Gas Energy Holdings Limited, two companies privately owned by Mr. Jones and that primarily handle Mr. Jones’ private investments. He was also a founding stockholder in Marc Rich + Co A.G., Switzerland, now known as Glencore Plc.\nMr. Jones will serve as a director until the next annual meeting of stockholders of the Company and until his successor is duly elected and qualified or until his earlier death, resignation or removal.\nCompliance with Section 16(a) of the Exchange Act\nSection 16(a) of the Exchange Act requires our officers and directors, and persons who own more than 10% of a registered class of our equity securities, to file certain reports regarding ownership of, and transactions in, our securities with the SEC. Such officers, directors, and 10% stockholders are also required to furnish us with copies of all Section 16(a) forms that they file.\nBased solely on our review of copies of Forms 3 and 4 and any amendments furnished to us pursuant to Rule 16a-3(e) and any written representations referred to in Item 405(b)(2)(i) of Regulation S-K stating that no Forms 5 were required, we believe that, during the 2020 fiscal year, our officers, directors and all persons owning more than 10% of a registered class of our equity securities have complied with all Section 16(a) applicable filing requirements.\nCode of Ethics\nWe have adopted a Code of Ethics applicable to our officers, including our principal executive officer, principal financial officer, principal accounting officer and any other persons performing similar functions. The Code of Ethics will be provided free of charge by the Company to interested parties upon request. Requests should be made in writing and directed to the Company at the following address: 14643 Dallas Parkway, Suite 650, Dallas, TX 75254, Attention: Frederick Jones.\nBoard Meetings\nIncluding unanimous written actions of the Board, the Board met 2 times in 2020\nCommittees\nOur Company currently does not have nominating, compensation, or audit committees or committees performing similar functions nor does our Company have a written nominating, compensation or audit committee charter. As a shell company, we believe that it is not necessary to have such committees at this time because the Board can adequately perform the functions of such committees.\nAudit. We believe that our Board can adequately perform the functions of an audit committee. As a smaller reporting company with no material operations or assets, and due to the lack of financial resources available to us, we do not have a Board member that qualifies as an “audit committee financial expert” as defined in Item 407(D)(5) of Regulation S-K, nor do we have a Board member that qualifies as “independent” within the meaning of applicable Nasdaq Stock Market listing standards, including any heightened independence requirements specific to audit committee members. We believe that retaining an independent director who would qualify as an “audit committee financial expert” would be overly costly and burdensome and is not warranted in our circumstances given our lack of material operations or assets.\nCompensation. Because the Company currently has no material operations and none of its executive officers in 2020 received a salary, we do not believe it is necessary to have a compensation committee at this time. We believe that our Board can adequately perform the functions of a compensation committee. Due to his status as an officer of the Company, our sole director is not “independent” within the meaning of applicable Nasdaq Stock Market listing standards, including any heightened independence requirements specific to compensation committee members.\nDirector Nominations. As noted above, the Board does not have a separate nominating committee. Rather, our Board considers and nominates directors for election. We do not believe the Company would derive any significant benefit from a separate nominating committee. Due to his status as an officer of the Company, our sole director is not “independent” as defined in the applicable Nasdaq Stock Market listing standards.\nIn recommending director candidates in the future (including director candidates recommended by stockholders), the Board intends to take into consideration such factors as it deems appropriate based on the Company’s current needs. These factors may include diversity, age, skills, decision-making ability, inter-personal skills, experience with businesses and other organizations of comparable size, community activities and relationships, and the interrelationship between the candidate’s experience and business background, and other Board members’ experience and business background, whether such candidate would be considered “independent,” as such term is defined in the Nasdaq Stock Market listing standards, as well as the candidate’s ability to devote the required time and effort to serve on the Board.\nThe Board will consider for nomination by the Board director candidates recommended by stockholders if the stockholders comply with the following requirements. Under our By-Laws, if a stockholder wishes to nominate a director at the annual meeting, we must receive the stockholder’s written notice not less than 60 days nor more than 90 days prior to the date of the annual meeting, unless we give our stockholders less than 70 days’ notice of the date of our annual meeting. If we provide less than 70 days’ notice, then we must receive the stockholder’s written notice by the close of business on the 10th day after we provide notice of the date of the annual meeting. The notice must contain the specific information required in our By-Laws. A copy of our By-Laws may be obtained by writing to the Company. If we receive a stockholder’s proposal within the time periods required under our By-Laws, we may choose, but are not required, to include it in our proxy statement. If we do, we may tell the other stockholders what we think of the proposal, and how we intend to use our discretionary authority to vote on the proposal. All proposals should be made in writing and sent via registered, certified or express mail, to our executive offices, 14643 Dallas Parkway, Suite 650, Dallas, TX 75254 Attention: Frederick Jones.\nStockholder Communications with the Board of Directors. Any stockholder who wishes to send communications to the Board should mail them addressed to the intended recipient by name or position in care of: theglobe.com, inc., 14643 Dallas Parkway, Suite 650, Dallas, TX 75254 Attention: Frederick Jones. Upon receipt of any such communications, Mr. Jones will determine the identity of the intended recipient and whether the communication is an appropriate stockholder communication. Then Mr. Jones will send all appropriate stockholder communications to the intended recipient. An “appropriate stockholder communication” is a communication from a person claiming to be a stockholder in the communication, the subject of which relates solely to the sender’s interest as a stockholder and not to any other personal or business interest.\nIn the case of communications addressed to the Board, the Company will send appropriate stockholder communications to the Board. In the case of communications addressed to any particular directors, the Company will send appropriate stockholder communications to such director.\nAttendance at Annual Meetings\nThe Board encourages, but does not require, its directors to attend the Company’s annual meeting of stockholders. The Company did not hold an annual meeting last year.",
    "item_11": "Item 11. EXECUTIVE COMPENSATION\nOverview\nWe do not maintain any executive compensation plans or programs. Mr. Jones, our sole executive officer, did not receive compensation for his services in 2020. In addition, all of our stock option plans have been terminated and there were no unexercised equity awards outstanding as of December 31, 2020 and no Named Executive Officer exercised equity awards during 2020.\nSUMMARY COMPENSATION TABLE\nWe did not provide any compensation for services to our principal executive officer at any time for the years ended December 31, 2020 and December 31, 2019.\nCOMPENSATION OF DIRECTORS\nDirectors who are also our employees or officers receive no compensation for serving on our Board. Mr. Jones did not receive a salary, bonus or awards in 2020 for his service on the Board. We reimburse non-employee/non-management directors for all travel and other expenses incurred in connection with attending Board meetings. All of our stock option plans have been terminated and there were no unexercised equity awards outstanding as of December 31, 2020.",
    "item_12": "Item 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth certain information regarding beneficial ownership of our Common Stock as of March 1, 2021 (except as otherwise indicated) by (i) each person who owns beneficially more than 5% of our Common Stock, (ii) each of our directors, (iii) each of our “Named Executive Officers” and (iv) all directors and executive officers as a group. A total of 441,480,473 shares of theglobe’s Common Stock were issued and outstanding on March 1, 2021.\nThe amounts and percentage of Common Stock beneficially owned are reported on the basis of regulations of the SEC governing the determination of beneficial ownership of securities. Under the rules of the SEC, a person is deemed to be a “beneficial owner” of a security if that person has or shares “voting power,” which includes the power to vote or to direct the voting of such security, or “investment power,” which includes the power to dispose of or to direct the disposition of such security. A person is also deemed to be a beneficial owner of any securities of which that person has a right to acquire beneficial ownership within 60 days. Under these rules, more than one person may be deemed a beneficial owner of the same securities and a person may be deemed to be a beneficial owner of securities as to which such person has no economic interest. Unless otherwise indicated below, the address of each person or entity named in the table below is in care of theglobe.com, inc., 14643 Dallas Parkway, Suite 650, Dallas, TX 75254.\nSHARES BENEFICIALLY OWNED\nDIRECTORS AND NAMED EXECUTIVE OFFICERS\nNUMBER\nPERCENT\nTITLE OF\nCLASS\nFrederick Jones\n-\n-\n-\nAll directors and executive officers as a group (1 person)\n-\n-\nCommon\n5% STOCKHOLDERS\nDelfin Midstream Inc.\n312,825,952\n70.9 %\nCommon\nSecurities Authorized for Issuance Under Equity Compensation Plans as of December 31, 2020\nAll of our stock option plans have been terminated and there were no unexercised equity awards outstanding as of December 31, 2020.",
    "item_13": "Item 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nTransactions with Related Persons\nThe following is a summary of transactions, since December 31, 2018, to which we have been a party, in which the amount involved exceeded the lesser of $120,000 or 1% of the average of our total assets at December 31, 2019 and December 31, 2020, and in which any of our directors, executive officers, beneficial holders of more than 5% of our capital stock or certain other related persons had or will have a direct or indirect material interest.\nLoans\nIn March 2018, the Company executed a Promissory Note with Delfin, which was amended and restated in May 2018 to $150,000, in November 2018 to $350,000, in June 2019 to $465,000, in November 2019 to $554,100, in August 2020 to $600,000, and then again in February 2021 to increase the principal amount to up to $637,500 to pay certain accrued expenses, accounts payable and to allow the Company to have working capital. Interest accrues on the unpaid principal balance at a rate of 8% per annum, calculated on a 365/66 day year, as applicable. The Promissory Note is due upon demand. It may be prepaid in whole or in any part at any time prior to demand. Management anticipates continued funding from Delfin over the next twelve months as it determines the direction of the Company. For more information, see the section in this annual report entitled “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations-Liquidity and Capital Resources-Future and Critical Need for Capital.”\nReview, Approval or Ratification of Transactions with Related Persons\nWhile we have not adopted formal written policies or procedures for consideration of related party transactions, our Board routinely reviews potential transactions with those parties it has identified as related parties prior to the consummation of the transaction. Each transaction is reviewed to determine that a related party transaction is entered into by the Company with the related party on an “arms length” basis, or pursuant to normal competitive negotiation.\nDirector Independence\nMr. Jones is the sole member of our Board and is also an officer of the Company. As such, Mr. Jones is not considered “independent” within the meaning of applicable the Nasdaq Stock Market listing standards.",
    "item_14": "Item 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nAudit Fees. The aggregate fees billed by Marcum LLP (“Marcum”), independent public accountants, for professional services rendered for the audit of our annual financial statements during 2020 and 2019 and the reviews of the financial statements included in our Forms 10-Q and 10-K, as appropriate, were $39,192 for year ended December 31, 2020 and $36,823 for year ended December 31, 2019.\nAudit-Related Fees. During the last two fiscal years, Marcum did not provide the Company with any services that are reasonably related to the performance of the audit of our financial statements.\nTax Fees. The aggregate fees billed for tax services provided by Marcum in connection with tax compliance, tax consulting and tax planning services for the year ended 2020 was $3,605 and $3,605 for the year ended 2019 in connection with tax return preparation and filing.\nAll Other Fees. Except as described above, the Company had no other fees for services provided by Marcum during 2020 and 2019.\nPre-Approval of Services by the External Auditor. As described above, our Board performs the functions of an audit committee. The Board will consider annually and, if appropriate, approve the provision of audit services by its external auditor and consider and, if appropriate, pre-approve the provision of certain defined audit and non-audit services. The Board will also consider on a case-by-case basis and, if appropriate, approve specific engagements that are not otherwise pre-approved. The Board pre-approved the audit engagements and tax services billed by the amounts described above.\nPart IV",
    "item_15": "Item 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a). List of all documents filed as part of this report.\n(1) Financial statements are listed in the index to the financial statements on page 10 of this Report.\n(2) No financial statement schedules are included because they are not applicable or are not required or the information required to be set forth therein is included in the financial statements or notes thereto.\n(3) Exhibit Index\n3.1 Form of Fourth Amended and Restated Certificate of Incorporation of the Company (incorporated by reference from our Form S-1/A filed September 15, 1998).\n3.2 Certificate of Amendment to Fourth Amended and Restated Certificate of Incorporation (incorporated by reference from our Form SB-2 filed April 16, 2004).\n3.3 Certificate of Amendment to Fourth Amended and Restated Certificate of Incorporation filed with the Secretary of State of Delaware on July 29, 2003 (incorporated by reference from our Form SB-2 filed April 16, 2004).\n3.6 Form of By-Laws of the Company (incorporated by reference from our Form SB-2 filed April 16, 2004).\n3.8 Certificate of Amendment to Fourth Amended and Restated Certificate of Incorporation filed with the Secretary of State of Delaware on December 1, 2004 (incorporated by reference from our Form 8-K filed on December 2, 2004).\n4.1 Description of Registrant’s Securities (incorporated by reference to Exhibit 4.1 of our Form 10-K filed on March 27, 2020).\n10.1 Form of Indemnification Agreement between the Company and each of its Directors and Executive Officers (incorporated by reference from our Form S-1 filed July 24, 1998 (Registration No. 333-59751).\n10.2\n$637,500 Sixth Amended and Restated Bridge Promissory Note dated February 8, 2021 by and between Delfin Midstream LLC and the Company).\n31.1 Certification of the Chief Executive Officer and Chief Financial Officer pursuant to Rule 13a-14(a) and Rule 15d-14(a).*\n32.1 Certification of the Chief Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of The Sarbanes-Oxley Act of 2002.*\n101.INS XBRL Instance Document\n101.SCH XBRL Taxonomy Extension Schema Document\n101.CAL XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF XBRL Taxonomy Extension Definitions Linkbase Document\n101.LAB XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nX BRL Taxonomy Extension Presentation Linkbase Document\n*Filed herewith\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\ntheglobe.com, inc.\nDated: March 26, 2021 By: /s/ Frederick Jones\nFrederick Jones\nChief Executive Officer,Chief Financial\nOfficer, and sole Board member"
}