{
    "cik": "1066194",
    "company": "EGAIN Corp",
    "filing_type": "10-K",
    "filing_date": "2021-09-10",
    "period_of_report": "2021-06-30",
    "sic": "7372",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1066194/0001558370-21-012388-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1066194/000155837021012388/egan-20210630x10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1066194/0001558370-21-012388.txt",
    "filename": "1066194_10K_2021_0001558370-21-012388.htm",
    "item_1": "ITEM 1.\nBUSINESS\nOverview\neGain automates customer engagement with an innovative software as a service (SaaS) platform, powered by deep digital, artificial intelligence (AI), and knowledge capabilities. We are headquartered in the United States. We also operate in United Kingdom and India. We sell mostly to large enterprises across financial services, telecommunications, retail, government, healthcare, and utilities. With our mantra of AX + BX + CX = DX™, we guide clients to effortless digital experience (DX) by holistically optimizing agent experience (AX), business experience (BX) and customer experience (CX). More than one hundred eighty leading brands use eGain’s cloud software to improve customer satisfaction, empower agents, reduce service cost, and boost sales.\nIndustry Background\nIntroduction\nCustomer relationship management (CRM) tools are not designed to serve as systems of engagement because they are primarily systems of record. They do not offer rich applications to engage customers across digital touch points, nor do they escalate conversations with context across self-service to agent assistance. Furthermore, CRM systems mostly view knowledge management as traditional document management - a big content model that does not work the personalized, media-rich, and content-heavy digital world. Frontline agents, in the CRM worldview, are supposed to have super-human capacity to retain and routinely refresh all relevant knowhow across complex, expanding product portfolios and compliance-heavy processes. Finally, the concept of in-band guidance for customer self-service and agent assistance is foreign to CRM systems. The reality of CRM desktops in contact centers today, we believe, is that agents ignore 90% of the data piled up their application screens-most of which is hidden behind multiple tabs. According to Gartner, 84% of agents surveyed are not satisfied with their desktop tools. It is time to reimagine the Agent Experience.\nDigital Economy Demands Modern Software\nIn a world selling commoditized products to information-rich customers short on time, smart engagement must automate the routine and augment the interesting across agent, business and customer. Therefore, businesses are increasingly seeking digital-first, modern software platforms to layer on top of their traditional systems like CRM, contact centers, and content management. Customer engagement platforms must be designed to be systems of engagement, enabling rapid innovation, delivering quick value and integrating with systems of record across the enterprise. Agile, comprehensive, scalable, and cost-effective, they must demonstrably automate customer self-service, empower agents and easily orchestrate contact center operation in an omnichannel environment.\nAI-Knowledge Powered Customer Engagement Automation\nEnergized by big-data, cloud-computing and open-source technologies in a digital world, AI-Knowledge can deliver transformational value, within a digital-first, omnichannel customer interaction framework. Smart, connected experiences can be automated to successfully resolve majority of customer interactions in most B2C businesses. The pressing challenge for solution buyers, however, is to separate the wheat from the chaff as they look for trusted, innovative and aligned partners. They seek sustained product leadership, at-scale proof points and no-risk trials.\nContact Centers are the Battleground\nContact centers offer a significant opportunity to automate customer engagement. Globally, there are close to 15 million contact center agents. Time-starved customers consuming complex products and grappling with marketing offers generate stubbornly high levels of customer contact. Furthermore, contact centers worldwide are undergoing a technology refresh cycle from on-premise voice-centric models to cloud-based omnichannel platforms. This transition affords businesses the opportunity to reimagine and design new customer contact strategies to drive digital-first automation, fueled by AI-Knowledge.\nCustomer Engagement Automation is a Large, Growing Market\nBusinesses are investing heavily in digital transformation, with customer engagement as a top priority. Ease of innovation in cloud and a growing application programming interface (API) economy present exciting capability to connect, solve, and optimize. This is both an opportunity and a challenge. As predicted by industry analysts, the number of customer interactions involving emerging technology such as machine-learning applications, chatbots, or mobile messaging is increasing every day. To effectively harness such novel capabilities, businesses are looking toward innovative platform providers with proof at scale to guide them on their automation journey.\nThe eGain Approach and Benefits\nWhat Customers Want\nTechnology acceleration notwithstanding, human needs for customer engagement and service change slowly. We believe what customers want is help in three categories: information, transaction, and situational. A given customer contact can morph across these categories as the conversation develops. Therefore, it is critical that an effective solution optimization customer contact across these three categories seamlessly and with context -accounting for machine-human hand-offs, channel switching, multimodal interaction, and conversational pause-and-resume. During these interactions, we believe customers increasingly want to be guided, even anticipated. Siloed solutions like transactional, simplistic chatbots without contextual escalation and supporting knowledge tend to disappoint consumers even more than non-existent self-service options.\nThe eGain Solution is Comprehensive\neGain offers a comprehensive, unified cloud software solution to automate, augment and orchestrate customer engagement in a digital world. Our feature-rich portfolio of applications empowers businesses to holistically connect, flexibly solve, and continuously optimize the experience for agents, businesses and customers. Our solution experts and partners guide clients by aligning with their strategic priorities and demonstrating quick value across a series of agile sprints.\nDigital-First, Omnichannel Desktop Connect\nFirst, our solution offers comprehensive, scalable capabilities for digital-first, omnichannel interaction within a modern, purpose-built desktop. Rich applications, optimized for productivity, proactively guide agents to efficiently interact with customers using messaging, short message service (SMS), chat, email, social media, phone, video, fax, and letter. Agents do not have to remember complex product details and detailed process steps. Process compliance is built into the solution.\nAI and Knowledge Solve\nNext, our solution offers powerful AI and knowledge applications for virtual assistance for customers and agents. These applications enable businesses to centralize knowledge, policies, procedures, and best-practices, while delivering guided, personalized solutions to customers and agents. Our AI and knowledge applications deliver compelling value through large-scale self-service automation. Further, these applications ensure that all agents effectively resolve all contact types, regardless of product or procedure. Correct, compliant, and consistent responses across touchpoints (automated and assisted) boost customer satisfaction as first contact resolution surges and agent’s time to competency drops.\nAnalytics and Machine Learning Optimize\nOur analytics solution enables clients to measure, manage and orchestrate their omnichannel service operations. In addition, our machine learning service led by our digital optimization experts helps clients generate product improvement and customer preference insights from customer conversations and journey events, while spotting opportunities to improve experience and automate processes.\nOpen, Secure APIs and Third-Party Connectors Deliver Quick Value\nOur open, secure platform APIs enable clients and partners to extend and enhance our solutions and to integrate with enterprise assets to enable a single view of the customer. Our certified integration with platforms such as those from Avaya, Amazon, Cisco, Salesforce, and Microsoft enable clients to leverage existing systems of record and communication.\nCompelling Benefits\nWe believe our solution delivers transformational value. Specifically, we help businesses:\no Enhance customer experience with digital-first, omnichannel service.\no Reduce operating costs through self-service automation, improved first contact resolution, and compressed agent time-to-competence.\no Ensure compliance with regulations, policies, procedures, and best practices even as clients expand their product portfolio and serviced customer segments. This benefit is particularly sought after in regulated sectors like financial services and healthcare, as well as government.\no Deliver rich, primary insights to enhance products and design new offerings. Analyzing and learning from customer conversations provides a unique tool to quickly respond to customer dissatisfaction or agent challenges, while generating ideas for product innovation and process automation.\nCompetitive Strengths\nComprehensive Omnichannel Platform with Rich Apps and Purpose-built APIs\nThe eGain solution is a comprehensive omnichannel solution for the customer engagement market, with AI and knowledge applications at its core. We unlock the full power of our cloud platform with extensive APIs through a developer portal to enable digital engagement, knowledge management, and decision support capabilities for clients and partners in a way that is unique in the market.\nEnterprise-Grade, Secure Cloud Service with Differentiated Offerings\nOur cloud offering is secure, scalable and offers unique capabilities. With respect to security and certification, we offer SOC2, PCI, HIPAA, and GDPR certification. Two of the largest federal tax services, one in North America and the other in Europe, use eGain solutions served from the eGain Cloud. Furthermore, we offer an “Always On” capability for businesses who cannot afford to be down at any time, day or night, for scheduled maintenance downtime. Finally, we offer service credits in the event of non-adherence to contracted service levels.\nTransformative Value at Scale Across Diversified Customer Base\nOur solution delivers transformative value at scale today across a diversified customer base. We believe that our understanding of the customer need and our ability to fulfil it at scale and with enterprise-grade sophistication is unmatched. From over a hundred thousand users at a healthcare client using our solution on a 24x7 basis to a P&C insurer with fifteen thousand contact center advisors and thirty-thousand field agents, we are the preferred choice for large brands looking to automate customer engagement.\nMarket-leading Innovation with a Risk-free Trail Model\nWe are consistently seen as product leaders in digital engagement and knowledge management by leading analysts. For over twenty years, we have anticipated technology and market trends. We anticipated the need for AI in customer service early and developed an omnichannel customer engagement hub years ahead of competition. With a relentless focus on the customer engagement automation, we continue to add capabilities to enhance our clients’ investment in eGain. For example, to enable our clients to serve their customers across all channels, our messaging hub out of the box connects with Apple Business Chat, Facebook Messenger, Google Business Messaging, SMS, and WhatsApp. Our third-generation\nvirtual assistant - powered by AI, machine learning, and knowledge applications - seamlessly layers across our omnichannel platform. Our knowledge and AI solutions lead the market.\nNot only do we innovate quicker than others, we stand behind our claim with a unique Innovation in 30 Days™ offer-a 30-day guided production pilot in the eGain Cloud - at no cost and with no strings attached.\nLeveraged Go-to-market Strategy with a Growing Partner Ecosystem\nWe take our solutions to market through a partner-leveraged enterprise sales model. We started our original equipment manufacturing (OEM) partnership journey with Cisco several years ago. Through Cisco’s partner ecosystem and direct sales network, we also resell cloud-based, eGain-branded solutions.\nIn the fiscal year ended June 30, 2020 (which we refer to as fiscal year 2020), we announced our cloud-based OEM partnership with Avaya for our digital connect portfolio. We are now building an active pipeline with Avaya field sales and their partners.\nFinally, we partner with Amazon Connect, a disruptive cloud-based contact center solution. Our integrated proposition delivers the best of omnichannel capabilities powered by AI-Knowledge and Analytics.\nCustomers\nWe mostly sell to large enterprises, which we define as businesses with over a billion dollars in annual revenue or government organizations. Approximately 90% of our annual recurring cloud revenue for the fiscal year ended June 30, 2021 (which we refer to as fiscal year 2021) came from such large enterprises.\nWe focus on the following verticals: financial services, telecommunication, retail, government, health care and utilities. For fiscal year 2021, domestic and international revenue accounted for 69% and 31% of total revenue.\nTwo of our largest customers, who are also our partners, accounted for 21% and 13% of total revenue in fiscal year 2021.\nCompetition\nWe compete with application software providers, including Genesys Telecommunications, LivePerson, Nice, Verint, Nuance, and Oracle. In addition, we engage in partnerships with some of our competitors, including Salesforce, Microsoft, and ServiceNow.\nThe market that we compete in is highly competitive and some of our competitors may have longer operating histories, greater economies of scale, greater financial resources, greater engineering and technical resources, greater sales and marketing resources, stronger strategic partnerships and distribution channels, larger user bases, products and services with different functions and feature sets and greater brand recognition than we have. We believe the principal competitive factors in our market include the following:\no proven track record of customer success;\no speed and ease of implementation;\no product functionality;\no financial stability and viability of the vendor;\no product adoption;\no ease of use and rates of user adoption;\no low total cost of ownership and demonstrable cost-effective benefits for customers;\no performance, security, scalability, flexibility and reliability of the service;\no whether the software is delivered via the cloud or on-premises;\no ease of integration with existing applications;\no quality of customer support;\no availability and quality of implementation, consulting and training services; and\no vendor reputation and brand awareness.\nGrowth Strategy\nWe are investing in multiple programs to accelerate growth.\nInvest in Direct Sales and Marketing\nWe are enhancing our digital marketing to boost brand awareness, based on client success, product leadership and no-risk trial offers. To complement our marketing investment, we are significantly expanding our field sales team to increase high-touch presence in target accounts.\nDevelop New Partner Relationships\nWe are developing new partnerships with complementary platform providers (with large customer bases) to enhance their proposition with our AI-Knowledge powered customer engagement capabilities. We have hired a new head of Business Development to lead a team to develop and operationalize such new partnerships.\nLand and Expand in the Enterprise\nWith the sustained progress we have made in customer success, we see a replicable pattern emerging: land enterprise logos with a limited footprint in one business unit, demonstrate business value, and then expand in the enterprise. We believe we are increasing the value of investment in eGain for our clients by deeply integrating our capabilities via our enhanced APIs with enterprise assets like enterprise collaboration platforms, CRM systems, transaction and billing, and content sources.\nMigrate Our Remaining Legacy Customers to eGain Cloud\nWe offer an attractive proposition to our remaining on-premise customers to move to the eGain Cloud where we subsidize the migration service cost in exchange for their multi-year commitment to the eGain Cloud. We expect to substantially migrate most remaining on-premise clients to the eGain Cloud by the end of fiscal year 2022.\nMaintain Platform Innovation Leadership\nInnovation is in our DNA. We are developing vertical solutions on our platform to better acquire and serve customers. We continue to enhance our core capabilities to improve usability and personalization.\nSelectively Pursue Acquisitions\nFrom time to time, we pursue inorganic strategies to strengthen our product portfolio. In 2014, we acquired Exony Limited, a provider of advanced contact center analytics software. Moving forward, we will look for strategic acquisitions that we believe will deliver compelling value faster than organic options.\nSales and Marketing\nSales Strategy\nOur sales strategy is to pursue targeted accounts, mostly B2C enterprises, through a combination of our direct sales force and partners. These enterprises typically have thousands of customer service agents in their contact centers and, in the aggregate, communicate with billions of customers each year. We utilize thought leadership and other marketing events to demonstrate our leadership position in the customer engagement software market and highlight our customer successes.\nOur direct sales force is organized into teams that include field sales representatives and sales consultants. Our direct sales force is complemented by lead generation representatives and sales development representatives.\nWe also complement our direct effort with sales alliances.\nMarketing and Partner Strategy\nOur marketing strategy is to build our brand around innovative and robust products trusted by leading enterprises. We accomplish this via public relations, analyst relations, marketing communications and demand generation. We employ a wide range of marketing avenues to deliver our message, including print and digital, targeted electronic and postal mailing, email newsletters, and a variety of trade shows, seminars, webinars, and interest groups.\nOur marketing group produces sales tools, including product collateral, customer case studies, demonstrations, and presentations. In addition, the group performs market analyses and customer reviews to identify and develop key partnership opportunities and product capabilities.\nWe believe that our partners help extend the breadth and depth of our product offerings, drive market penetration, and augment our professional service capabilities. We believe these relationships are important to delivering successful, integrated products and services to our customers. Our partner portal, eGain Econet™, provides comprehensive sales, support and services information for channel partners.\nSubscription Services\nOur subscription services provide customers with access to our software on a cloud-based platform that we manage and offer on a subscription basis. These subscription services allow our customers to easily consume our product innovation without dealing with infrastructure, installation and ongoing administration. We generally offer these services through a 36-month contract, with pricing based on the number of agents or self-service sessions.\nProfessional Services\nOur worldwide professional services organization provides consulting, implementation and training services to deliver business value, drive customer success and build customer loyalty.\no Consulting and Implementation Services. Our offering includes rapid implementation services, platform-based solution extension, and systems integration services. Our consultants work with customers to understand their requirements, analyze their business needs, and implement effective solutions. We provide these services independently or in partnership with distribution partners who have developed expertise on our platform.\no Training Services. We provide comprehensive training options to customers and partners. Training programs are offered either online (remote training) or in-person at the customer site. We also offer complementary e-learning through our eGain University education portal to our customers and partners.\nCustomer Support\nWe offer 24 x 7 customer support via online and phone channels worldwide under support agreements. Our customer support centers are in California, United Kingdom, and India.\nResearch and Development\nThe market for our products changes rapidly and is characterized by evolving industry standards, swift changes in customer requirements, and frequent product introductions.\nWe continuously analyze market and customer requirements and evaluate external technology that we believe will enhance our competitiveness, increase our lifetime customer value and expand our target market. Our product roadmap effectively combines build, partner and buy options.\nIntellectual Property\nWe regard our intellectual property as critical to our success. We rely on intellectual property and other laws, in addition to confidentiality procedures and licensing arrangements, to protect the proprietary aspects of our technology and business.\nAs of June 30, 2021, we had 11 issued patents in the United States. In addition, we have a number of pending patent applications in the United States, including one provisional filing and several non-provisional filings. Our issued U.S. patents expire at various times between 2029 and 2035.\nWe continually assess the strength of our intellectual property protection for those aspects of our technology that we believe constitute innovations providing significant competitive advantages. Future applications may or may not receive the issuance of valid patents or registered trademarks.\nWe routinely require our employees, customers, and potential business partners to enter into confidentiality and nondisclosure agreements before we disclose any sensitive aspects of our products, technology, or business plans. In addition, we require employees to agree to surrender to us any proprietary information, inventions or other intellectual property they generate or come to possess while employed by us. Despite our efforts to protect our proprietary rights through confidentiality and license agreements, unauthorized parties may attempt to copy or otherwise obtain and use our products or technology. These precautions may not prevent misappropriation or infringement of our intellectual property. In addition, some of our license agreements with certain customers and partners require us to place the source code for our products into escrow. These agreements typically provide that some party will have a limited, non-exclusive right to access and use this code as authorized by the license agreement if there is a bankruptcy proceeding instituted by or against us, or if we materially breach a contractual commitment to provide support and maintenance to the party.\nHuman Capital\nOur key human capital management objectives are to attract, retain and develop the highest quality talent. To support these objectives, our human resources programs are designed to develop talent to prepare them for critical roles and leadership positions for the future; reward and support employees through competitive pay and benefits; enhance our culture through efforts aimed at making the workplace more engaging and inclusive; acquire talent and facilitate internal talent mobility to create a high-performing and diverse workforce. As of June 30, 2021, we had 570 employees, including 563 full-time employees, of which 187 were in product development, 203 in services and support, 123 in sales and marketing, and 57 in finance and administration.\nNone of our employees are covered by collective bargaining agreements. While we believe our relations with our employees are good, our future performance depends largely upon the continued service of our key technical, sales and marketing, and senior management personnel, none of whom are bound by employment agreements requiring service for a defined period of time.\nAvailable Information\nWe were incorporated in Delaware in September 1997, and our website is located at www.egain.com. We make available free of charge on our website our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports, as soon as reasonably practicable after we electronically file or furnish such materials to the Securities and Exchange Commission. Our website and the information contained therein or connected thereto are not intended to be incorporated into this Annual Report on Form 10-K.\nInformation About Our Executive Officers\nThe following table sets forth information regarding eGain’s executive officers as of September 10, 2021:\nName\nAge\nPosition\nAshutosh Roy\nChief Executive Officer and Chairman\nEric N. Smit\nChief Financial Officer\nPromod Narang\nSenior Vice President of Products and Engineering\nAshutosh Roy co-founded eGain and has served as Chief Executive Officer and a Director of eGain since September 1997 and as President since October 1, 2003. From May 1995 through April 1997, Mr. Roy served as Chairman of WhoWhere? Inc., an Internet-services company co-founded by Mr. Roy. From June 1994 to April 1995, Mr. Roy worked at Parsec Technologies, a call center company based in New Delhi, India, which he co-founded. From August 1988 to August 1992, Mr. Roy worked as a software engineer at Digital Equipment Corporation. Mr. Roy holds a B.S. in Computer Science from the Indian Institute of Technology, New Delhi, a Master’s degree in Computer Science from Johns Hopkins University and a M.B.A. from Stanford University. Mr. Roy’s qualifications to serve on our Board of Directors include his industry experience and deep knowledge of eGain from his position as a founder of our Company and as our Chief Executive Officer for over 20 years.\nEric N. Smit has served as Chief Financial Officer since August 2002. Prior to that, Mr. Smit served in a variety of roles at eGain, including Vice President, Operations from April 2001 to July 2002, Vice President, Finance and Administration from June 1999 to April 2001, and Director of Finance from June 1998 to June 1999. From December 1996 to May 1998, Mr. Smit served as Director of Finance for WhoWhere? Inc., an Internet services company. From April 1993 to November 1996, Mr. Smit served as Vice President of Operations and Chief Financial Officer of Velocity Incorporated, a software game developer and publishing company. Mr. Smit holds a Bachelor of Commerce in Accounting from Rhodes University, South Africa.\nPromod Narang has served as Senior Vice President of Products and Engineering since March 2000. Mr. Narang joined eGain in October 1998, and served as Director of Engineering prior to assuming his current position. Prior to joining eGain, Mr. Narang served as President of VMpro, a system software consulting company, from September 1987 to October 1998. Mr. Narang holds a Bachelor of Science in Computer Science from Wayne State University.",
    "item_1A": "ITEM 1A.RISK FACTORS\nThe risks and uncertainties described below are not the only ones facing us. Other events that we do not currently anticipate or that we currently deem immaterial also may affect our results of operations, cash flows and financial condition.\nRisks Related to Our Business and Strategy\nOur business is influenced by a range of factors that are beyond our control and that we have no comparative advantage in forecasting.\n● Factors influencing our business include:\n● general economic and business conditions;\n● currency exchange rate fluctuations;\n● the overall demand for enterprise software and services;\n● customer acceptance of cloud-based solutions;\n● governmental budgetary constraints or shifts in government spending priorities; and\n● general political developments.\nThe global economic climate continues to influence our business. This includes items such as a general tightening in the credit markets, lower levels of liquidity, increases in the rates of default and bankruptcy, and extreme volatility in credit, equity and fixed income markets. These macroeconomic developments negatively affected, and could continue to negatively affect, our business, operating results or financial condition which, in turn, could adversely affect our stock price. A general weakening of, and related declining corporate confidence in, the global economy or the curtailment in government or corporate spending could cause current or potential customers to reduce their technology budgets or be unable to fund software or services purchases, which could cause customers to delay, decrease or cancel purchases of our products and services or cause customers to not pay us or to delay paying us for previously purchased products and services.\nWe face risks related to health epidemics, including the COVID-19 pandemic, which could have a material adverse effect on our business, financial condition and results of operations.\nThe COVID-19 pandemic has created significant worldwide uncertainty, volatility and economic disruption. The ultimate impact of the COVID-19 pandemic on our business, results of operations, financial condition and cash flows is dependent on future developments, including the duration of the pandemic, the severity of the disease and outbreak, the impact of new strains of the virus, effectiveness and availability of a vaccine, future and ongoing actions that may be taken by governmental authorities, the impact on the businesses of our customers and partners, and the length of its impact on the global economy, which are uncertain and are difficult to predict at this time.\nThe potential effects of the COVID-19 pandemic, each of which could adversely affect our business, results of operations, financial condition and cash flows, include:\n● the rate of IT spending and the ability of our customers to purchase our offerings could be adversely impacted. Further, the impact of the COVID-19 pandemic could delay prospective customers’ purchasing decisions and cause them to become less inclined to trade-up from existing solutions, impact customers’ pricing expectations for our offerings, lengthen payment terms, reduce the value or duration of their subscription contracts, or adversely impact renewal rates;\n● we could experience disruptions in our operations as a result of continued office closures, risks associated with our employees working remotely, a significant portion of our workforce suffering illness and travel restrictions. Starting in early 2020, we temporarily closed our offices, instituted a global remote work mandate and instituted significant travel restrictions. While we have begun to re-open some of our offices, the vast majority of our employees continue to work remotely and for our offices that have begun to re-open, we have implemented significant new safety protocols, which may limit the effectiveness and productivity of our employees;\n● we may be unable to collect amounts due on billed and unbilled revenue if our customers or partners delay payment or fail to pay us under the terms of our agreements as a result of the impact of the COVID-19 pandemic on their businesses, including their seeking bankruptcy protection or other similar relief. As a result, our cash flows could be adversely impacted, which could affect our ability to fund future product development and acquisitions or return capital to shareholders;\n● we may experience disruptions or delays to our supply chain or fulfillment and delivery operations as a result of the COVID-19 pandemic;\n● our marketing effectiveness and demand generation efforts may be impacted due to the cancelling of customer events or shifting events to virtual-only experiences. We may need to postpone or cancel other customer, employee or industry events or other marketing initiatives in the future;\n● our business is dependent on attracting and retaining highly skilled employees, and our ability to attract and retain such employees may be adversely impacted by intensified restrictions on travel, immigration, or the availability of work visas during the COVID-19 pandemic;\n● increased cyber incidents during the COVID-19 pandemic and our increased reliance on a remote workforce could increase our exposure to potential cybersecurity breaches and attacks; and/or\n● our results of operations are subject to fluctuations in foreign currency exchange rates, which risks may be heightened due to increased volatility of foreign currency exchange rates as a result of COVID-19. Further, our forecasted revenue, operating results and cash flows could vary materially from those we provide as guidance or from those anticipated by investors and analysts if the assumptions on which we base our financial projections are inaccurate as a result of the unpredictability of the impact that the COVID-19 pandemic will have on our businesses, our customers’ and partners’ businesses and the global markets and economy or we make changes to our licensing programs or payment terms in connection with COVID-19.\nEven after the COVID-19 pandemic has subsided, we may continue to experience an adverse impact to our business and the value of our securities as a result of its global economic impact, including any recession that has occurred or may occur in the future.\nThere are no comparable recent events which may provide guidance as to the effect of the spread of COVID-19 and a pandemic, and, as a result, the ultimate impact of COVID-19 pandemic or a similar health epidemic is highly uncertain and subject to change. We do not yet know the full extent of COVID-19’s impact on our business, our operations, or the global economy as a whole. However, the effects could have a material impact on our results of operations, and we will continue to monitor the situation closely.\nTo the extent the COVID-19 pandemic adversely affects our business, results of operations, financial condition and cash flows, it may also heighten many of the other risks described in this “Risk Factor” section.\nOur revenue and operating results have fluctuated in the past and are likely to fluctuate in the future, and because we recognize revenue from subscriptions over a period of time, downturns in revenue may not be immediately reflected in our operating results.\nBecause we recognize revenue when we have satisfied performance obligations to customers in connection with our sales contracts, most of our revenue each quarter results from recognition of deferred revenue related to agreements entered into during previous quarters. Consequently, declines in new or renewed subscription agreements and maintenance agreements that occur in one quarter will largely be felt in future quarters, both because we may be unable to generate sufficient new revenue to offset the decline and because we may be unable to adjust our operating costs and capital expenditures to align with the changes in revenue. In addition, our subscription model makes it more difficult for us to increase our revenue rapidly in any period, because revenue from new customers must be recognized over the applicable subscription term. It is difficult to forecast the expediency of the transition of our license customers to our cloud delivery model. Accordingly, we believe that period-to-period comparisons of our results of operations should not be relied upon as definitive indicators of future performance.\nOther factors that may cause our revenue and operating results to fluctuate include:\n● timing of customer budget cycles;\n● the priority our customers place on our products compared to other business investments;\n● size, timing and contract terms of new customer contracts, and unpredictable and often lengthy sales cycles;\n● reduced renewals;\n● competitive factors, including new product introductions, upgrades and discounted pricing or special payment terms offered by our competitors, as well as strategic actions by us or our competitors, such as acquisitions, divestitures, spin-offs, joint ventures, strategic investments or changes in business strategy;\n● technical difficulties, errors or service interruptions in our solutions that may cause customer dissatisfaction with our solutions;\n● consolidation among our customers, which may alter their buying patterns, or business failures that may reduce demand for our solutions;\n● operating expenses associated with expansion of our sales force or business, and our product development efforts;\n● cost, timing and management efforts related to the introduction of new features to our solutions;\n● our ability to obtain, maintain and protect our intellectual property rights and adequately safeguard the information imported to our solutions or otherwise provided to us by our customers; and\n● extraordinary expenses such as impairment charges, litigation or other payments related to settlement of disputes.\nAny of these developments may adversely affect our revenue, operating results and financial condition. Furthermore, we maintain an allowance for doubtful accounts for estimated losses resulting from the inability of our customers to make required payments. In such cases, we may be required to defer revenue recognition on sales to affected customers. In the future, we may have to record additional reserves or write-offs, or defer revenue on sales transactions, which could negatively impact our financial results.\nWe cannot accurately predict subscription renewal rates and the impact these rates may have on our future revenue and operating results.\nWe allow our customers to elect not to renew their subscriptions for our service after the expiration of their initial subscription period, which is typically 12 to 36 months, and some customers have elected not to renew. In addition, our customers may choose to renew for fewer subscriptions (in quantity or products) or renew for shorter contract lengths. We cannot accurately predict renewal rates given our varied customer base of enterprise and small and medium size business customers and the number of multiyear subscription contracts. Our renewal rates may decline or fluctuate as a result of a number of factors, including customer dissatisfaction with our service, decreases in customers’ spending levels, decreases in the number of users at our customers, pricing changes and general economic conditions. If our customers do not renew their subscriptions for our service or reduce the number of paying subscriptions at the time of renewal, our revenue will decline, and our business will suffer.\nOur future success also depends in part on our ability to sell additional features and services, more subscriptions or enhanced editions of our service to our current customers. This may also require increasingly sophisticated and costly sales efforts that are targeted at senior management. Similarly, the rate at which our customers purchase new or enhanced services depends on a number of factors, including general economic conditions and our customers’ reactions to price changes related to these additional features and services. If our efforts to upsell to our customers are not successful and negative reaction occurs, our business may suffer.\nOur lengthy sales cycles and the difficulty in predicting timing of sales or delays may impair our operating results.\nThe long sales cycle for our products may cause license and subscription revenue and operating results to vary significantly from period to period. The sales cycle for our products can be six months or more and varies substantially from customer to customer. Because we sell complex and deeply integrated solutions, it can take many months of customer education to\nsecure sales. Since our potential customers may evaluate our products before, if ever, executing definitive agreements, we may incur substantial expenses and spend significant management and legal effort in connection with a potential customer.\nOur multi-product offering and the increasingly complex needs of our customers contribute to a longer and unpredictable sales cycle. Consequently, we often face difficulty predicting the quarter in which expected sales will actually occur. This contributes to the uncertainty and fluctuations in our future operating results. In particular, the corporate decision-making and approval process of our customers and potential customers has become more complicated. This has caused our average sales cycle to further increase and, in some cases, has prevented the closure of sales that we believed were likely to close.\nBecause we depend on a relatively small number of customers for a substantial portion of our revenue, the loss of any of these customers or our failure to attract new significant customers could adversely impact our revenue and harm our business.\nWe have in the past and expect in the future to derive a substantial portion of our revenue from sales to a relatively small number of customers. The composition of these customers has varied in the past, and we expect that it will continue to vary over time. The loss of any significant customer or a decline in business with any significant customer would materially and adversely affect our financial condition and results of operations.\nThe market for customer engagement software is intensely competitive, and our business will be adversely affected if we are unable to successfully compete.\nThe market for customer engagement software is intensely competitive. Other than product innovation and existing customer relationships, there are no substantial barriers to entry in this market, and established or new entities may enter this market in the future. While software internally developed by enterprises represents indirect competition, we also compete directly with packaged application software vendors, including Genesys Telecommunications, LivePerson, Inc., and NICE Ltd., and Verint Systems Inc. In addition, we face actual or potential competition from larger software companies such as Microsoft Corporation, Oracle Corporation, salesforce.com Inc., and ServiceNow, Inc., and similar companies that may attempt to sell customer engagement software to their installed base.\nWe believe competition will continue to be fierce as current competitors increase the sophistication of their offerings and as new participants enter the market. Many of our current and potential competitors have longer operating histories, larger customer bases, broader brand recognition, and significantly greater financial, marketing and other resources. With more established and better-financed competitors, these companies may be able to undertake more extensive marketing campaigns, adopt more aggressive pricing policies, and make more attractive offers to businesses to induce them to use their products or services. If we are unable to compete successfully, our business will be adversely affected.\nIf we fail to expand and improve our sales performance and marketing activities, or retain our sales and marketing personnel, we may be unable to grow our business, which could negatively impact our operating results and financial condition.\nExpansion and growth of our business is dependent on our ability to expand our sales force and on the ability of our sales force to increase sales. If we are not able to effectively develop and maintain awareness of our products in a cost-effective manner, we may not achieve widespread acceptance of our existing and future products. This may result in a failure to expand and attract new customers and enhance relationships with existing customers. This may impede our efforts to improve operations in our other areas and may result in declines in the market price of our common stock.\nDue to the complexity of our customer engagement hub platform and related products and services, we must utilize highly trained sales personnel to educate prospective customers regarding the use and benefits of our products and services as well as provide effective customer support. If we have turnover in our sales and marketing teams, we may not be able to successfully compete with our competitors, and our results of operations and financial condition may be harmed.\nOur failure to maintain, develop or expand strategic and third-party distribution channels would impede our revenue growth.\nOur success and future growth depend in part upon the skills, experience, performance and continued service of our distribution partners, including software and hardware vendors and resellers. Our distribution partners engage with us in a\nnumber of ways, including assisting us to identify prospective customers, distributing our products and services in geographies where we do not have a physical presence and distributing our products and services where they are considered complementary to other products of the partner or third-party products distributed by the partner. We believe that our future success depends in part upon our ability to develop, maintain and expand strategic, long-term and profitable partnerships and reseller relationships. If we are unable to do so for any reason, including as a result of any change in the leadership of our distribution partners, or if any existing or future distribution partners fail to successfully market, resell, implement or support our products for their customers, or if distribution partners represent multiple providers and devote greater resources to market, resell, implement and support competing products and services, our future revenue growth could be impeded.\nWe sometimes rely on distribution partners to recommend our products to their customers. We likewise depend on broad market acceptance by these distribution partners of our product and service offerings. Our agreements generally do not prohibit competitive offerings and our distribution partners may develop market or recommend software applications that compete with our products. To the extent we devote resources to these relationships and the partnerships do not proceed as anticipated or provide revenue or other results as anticipated, our business may be harmed. Once partnerships are forged, there can be no guarantee that such relationships will be renewed in the future or available on acceptable terms. If we lose strategic third-party relationships, fail to renew or develop new relationships, or fail to fully exploit revenue opportunities within such relationships, our results of operations and future growth may suffer.\nDifficulties and delays in customers implementing our products could harm our revenue and margins.\nWe generally recognize revenue upon the transfer of control of promised services to our customers in the amount that is commensurate with the consideration that we expect to receive in exchange for those services. If an arrangement requires significant customization or implementation services from us, recognition of the associated license or subscription and service revenue could be delayed. The timing of the commencement and completion of these services is subject to factors that may be beyond our control, as this process may require access to the customer’s facilities and coordination with the customer’s personnel after delivery of the software. In addition, customers could cancel or delay product implementations. Implementation typically involves working with sophisticated software, computing and communications systems. If we experience difficulties with implementation or do not meet project milestones in a timely manner, we could be obligated to devote more customer support, engineering and other resources to a particular project. Some customers may also require us to develop customized features or capabilities. If new or existing customers cancel or have difficulty deploying our products or require significant amounts of our professional services, support, or customized features, revenue recognition could be cancelled or further delayed and our costs could increase, causing increased variability in our operating results.\nImplementation services may be performed by our own staff, by a third-party partner or by a combination of the two. Our strategy is to work with partners to increase the breadth of capability and depth of capacity for delivery of these services to our customers, and we expect the number of our partner-led implementations to continue to increase over time. If a customer is not satisfied with the quality of work performed by us or a partner or with the type of professional services or functionality delivered, even if we are not contractually responsible for the partner services, then we could incur additional costs to address the situation, the profitability of that work might be impaired and the customer’s dissatisfaction with our or our partner’s services could damage our ability to expand the scope of functionality subscribed to by that customer. In addition, negative publicity related to our customer relationships, regardless of its accuracy, may further damage our business by affecting our ability to compete for new business with current and prospective customers.\nWe conduct a significant portion of our business and operations outside of the United States, which exposes us to additional risks that may not exist in the United States. These risks in turn could cause our operating results and financial condition to suffer.\nWe derived 31% and 38% our revenue from international sales during the fiscal years ended June 30, 2021 and 2020, respectively. In addition to those discussed elsewhere in this section, our international sales operations are subject to a number of specific risks, such as:\n● general economic conditions in each country or region in which we do or plan to do business;\n● foreign currency fluctuations and imposition of exchange controls;\n● changes in data privacy laws including GDPR;\n● difficulty and costs in staffing and managing our international operations;\n● difficulties in collecting accounts receivable and longer collection periods;\n● health or similar issues, such as a pandemic or epidemic;\n● various trade restrictions and tax consequences;\n● hostilities in various parts of the world;\n● the fragmentation of longstanding regulatory frameworks caused by Brexit; and\n● reduced intellectual property protections in some countries.\nAny of the above risks could adversely affect our international operations, reduce our revenue from customers outside of the United States or increase our operating costs, each of which could adversely affect our business, results of operations, financial condition, and growth prospects.\nAs of June 30, 2021 approximately 45% of our workforce was employed in India. Of our employees in India, 49% are allocated to research and development. Although the movement of certain operations internationally was principally motivated by cost cutting, the continued management of these remote operations requires significant management attention and financial resources that could adversely affect our operating performance. In addition, with the significant increase in the numbers of foreign businesses that have established operations in India, the competition to attract and retain employees there has increased significantly. As a result of the increased competition for skilled workers, we experienced increased compensation costs and expect these costs to increase in the future. Our reliance on our workforce in India makes us particularly susceptible to disruptions in the business environment in that region. In particular, sophisticated telecommunications links, high-speed data communications with other eGain offices and customers, and overall consistency and stability of our business infrastructure are vital to our day-to-day operations, and any impairment of such infrastructure will cause our financial condition and results to suffer. In addition, the maintenance of stable political relations between the United States, the European Union (EU) and India are also of great importance to our operations.\nAny of these risks could have a significant impact on our product development, customer support, or professional services. To the extent the benefit of maintaining these operations abroad does not exceed the expense of establishing and maintaining such activities, our operating results and financial condition will suffer.\nUnplanned system interruptions, delays in service or inability to increase capacity, including internationally, at our third-party data center facilities could impair the use or functionality of our cloud operations and harm our business.\nOur customers have in the past experienced some interruptions with our cloud operations. We believe that these interruptions will continue to occur from time to time. These interruptions could be due to hardware and operating system failures. As a result, our business will suffer if we experience frequent or long system interruptions that result in the unavailability or reduced performance of our hosted operations or reduce our ability to provide remote management services. We expect to experience occasional temporary capacity constraints due to sharply increased traffic or other Internet-wide disruptions, which may cause unanticipated system disruptions, slower response times, impaired quality, and degradation in levels of customer service. If this were to continue to happen, our business and reputation could be seriously harmed.\nOur success largely depends on the efficient and uninterrupted operation of our computer and communications hardware and network systems. We currently serve our customers from third-party data center facilities operated by third parties in the United Stataes and other international locations. Any damage to, or failure of, our systems generally could interrupt service or impair the use or functionality of our cloud operations. In addition, as we continue to increase the number of customers and users on our cloud operations, we will need to increase the capacity of our data center infrastructure. If we do not increase our capacity in a timely manner, customers could experience interruptions or delays in access to our cloud operations. Customer data that we store in third party data centers may also be vulnerable to damage or interruption from floods, fires, earthquake, power loss, telecommunications failures and similar events. Any damage to, or failure of, our\nsystems, or those of our third-party data centers, could result in impairment of or interruptions in our service. Impairment or interruptions in our service may reduce our revenue, cause us to issue credits or pay penalties, cause customers to terminate their subscriptions and adversely affect our renewal rate and our ability to attract new customers. Our business will also be harmed if our customers and potential customers believe our cloud operations are unreliable.\nWe maintain a business continuity plan for our customers in the event of an outage. We maintain other co-locations for the purpose of disaster recovery as well as maintaining backups of our customer’s information. We provide premium disaster recovery and standard disaster recovery to our customers. If a customer opts not to pay for premium disaster recovery, we will only assure that their data is available within 72 hours. This delay could cause severe disruptions to our customers’ customers and may result in customer termination of our solutions. Our premium disaster recovery service provides for an alternative data center and a return to operations within one business day.\nWe have entered into support obligations with our customers that require minimum performance standards, including standards regarding the response time of our support services. If we fail to meet these standards, our customers could terminate their relationships with us, and we could be subject to contractual refunds, and exposure to claims for losses by, customers.\nSoftware errors could be costly and time-consuming for us to correct, and could harm our reputation and impair our ability to sell our solutions.\nOur solutions are based on complex software that may contain errors, or “bugs,” that could be costly to correct, harm our reputation and impair our ability to sell our solutions to new customers. Moreover, customers relying on our solutions may be more sensitive to such errors, and potential security vulnerabilities and business interruptions for these applications. If we incur substantial costs to correct any errors of this nature, our operating margins could be adversely affected. Because our customers depend on our solutions for critical business functions, any service interruptions could result in lost or delayed market acceptance and lost sales, higher service-level credits and warranty costs, diversion of development resources and product liability suits.\nThe terms we agree to in our Service Level Agreements or other contracts may result in increased costs or liabilities, which would in turn affect our results of operations.\nOur Service Level Agreements provide for service credits for system unavailability, and in some cases, indemnities for loss, damage or costs resulting from use of our system. If we were required to provide any of these in a material way, our results of operations would suffer.\nIf we are unable to increase the profitability of subscription revenue, if we experience significant customer attrition, or if we are required to delay recognition of revenue, our operating results could be adversely affected.\nWe have invested, and expect to continue to invest, substantial resources to expand, market, implement and refine our cloud offerings. If we are unable to increase the volume of our subscription business, we may not be able to achieve sustained profitability.\nFactors that could harm our ability to improve our gross margins, which may affect our operating profitability, include:\n● increased costs to license and maintain third party software embedded in our software applications or the cost to create or substitute such third-party software if it can no longer be licensed on commercially reasonable terms;\n● our inability to maintain or increase the prices customers pay for our products and services based on competitive pricing pressures and general economic conditions limiting customer demand;\n● increased cost of third-party services providers, including data centers for our cloud operations and professional services contractors performing implementation and technical support services to cloud customers;\n● customer contractual requirements that delay revenue recognition until customer implementations commence production operations or customer-specific requirements are met;\n● significant attrition as customers decide for their own economic or other reasons to not renew their subscription contracts when they are up for renewal negatively impacting the efficiency of our data centers and leading to the costs being spread over fewer customers negatively impacting gross margin; and\n● the inability to implement, or delays in implementing, technology-based efficiencies and efforts to streamline and consolidate processes to reduce operating costs.\nWe depend on broad market acceptance of our applications and of our business model. If our expectations regarding the market for our applications are not met, our business could be seriously harmed.\nWe depend on the widespread acceptance and use of our applications as an effective solution for businesses seeking to manage high volumes of customer interactions across multiple channels, including Web, phone, email, print and in-person. While we believe the potential to be very large, we cannot accurately estimate the size or growth rate of the potential market for such product and service offerings generally, and we do not know whether our products and services in particular will achieve broad market acceptance. The market for customer engagement software is rapidly evolving, and concerns over the security and reliability of online transactions, the privacy of users and quality of service or other issues may inhibit the growth of the Internet and commercial online services. If the market for our applications fails to grow or grows more slowly than we currently anticipate, our business will be seriously harmed.\nFurthermore, our business model is premised on business assumptions that are still evolving. Our business model assumes that both customers and companies will increasingly elect to communicate through multiple channels, as well as demand integration of the online channels into the traditional telephone-based call center. If any of these assumptions is incorrect or if customers and companies do not adopt digital technology in a timely manner, our business will be seriously harmed and our stock price will decline.\nWe may be unable to respond to the rapid technological change and changing customer preferences in the online sales, marketing, customer service, and/or online consumer services industries and this may cause our business to suffer.\nIf we are unable, for technological, legal, financial or other reasons, to adapt in a timely manner to changing market conditions in the online sales, marketing, customer service and/or e-commerce industry or our customers’ or Internet users’ requirements or preferences, our business, results of operations and financial condition would be materially and adversely affected. Business on the Internet is characterized by rapid technological change. In addition, the market for online sales, marketing, customer service and expert advice solutions is relatively new. Changes in customer and Internet user requirements and preferences, frequent new product and service introductions embodying new technologies and the emergence of new industry standards and practices such as but not limited to security standards could render our services and our proprietary technology and systems obsolete. The rapid evolution of these products and services will require that we continually improve the performance, features and reliability of our services. Our success will depend, in part, on our ability to:\n● enhance the features and performance of our services;\n● develop and offer new services that are valuable to companies; and\n● respond to technological advances and emerging industry standards and practices in a cost-effective and timely manner.\nIf any of our new services, including upgrades to our current services, do not meet our customers’ expectations, our business may be harmed. Updating our technology may require significant additional capital expenditures and could materially and adversely affect our business, results of operations and financial condition.\nIf new services require us to grow rapidly, this could place a significant strain on our managerial, operational, technical and financial resources. In order to manage our growth, we could be required to implement new or upgraded operating and financial systems, procedures and controls. Our failure to expand our operations in an efficient manner could cause our expenses to grow, our revenue to decline or grow more slowly than expected and could otherwise have a material adverse effect on our business, results of operations and financial condition.\nWe employ third-party technologies for use in or with our platform and the inability to license such technologies on commercially reasonable terms or the inability to maintain these licenses or errors in the software we license could result in increased costs, or reduced service levels, which could adversely affect our business.\nOur platform incorporates certain third-party software obtained under licenses from other companies, and we use third-party software development tools as we continue to develop and enhance our platform. We anticipate that we will continue to rely on such third-party software in the future. Although we believe that there are commercially reasonable alternatives to the third-party software we currently license, this may not always be the case, or it may be difficult or costly to replace such software. In addition, integration of the software used in our platform with new third-party software may require significant work and require substantial investment of our time and resources. Also, to the extent that our platform depends upon the successful operation of third-party software in conjunction with our software, any undetected errors or defects in this third-party software could prevent the deployment or impair the functionality of our platform, delay new feature introductions, result in a failure of our functionality, and injure our reputation. Our use of additional or alternative third-party software would require us to enter into license agreements with third parties. To the extent we need to license third-party technologies, we may be unable to do so on commercially reasonable terms or at all.\nThird-party licenses may expose us to increased risks, including risks associated with the integration of new technology, the diversion of resources from the development of our own proprietary technology, and our inability to generate revenue from new technology sufficient to offset associated acquisition and maintenance costs. In the event that we are not able to maintain our licenses to third-party software, or cannot obtain licenses to new software as needed, or in the event third-party software used in conjunction with our platform contains errors or defects, our business, operating results, and financial condition may be adversely affected.\nOur offshore product development, support and professional services may prove difficult to manage or may not allow us to realize our cost reduction goals, produce effective new solutions and provide professional services to drive growth.\nWe use offshore resources to perform new product and services development and provide support and professional consulting efforts, which requires detailed technical and logistical coordination. We must ensure that our international resources and personnel are aware of and understand development specifications and customer support, as well as implementation and configuration requirements and that they can meet applicable timelines. If we are unable to maintain acceptable standards of quality in support, product development and professional services, our attempts to reduce costs and drive growth through new products and margin improvements in technical support and professional services may be negatively impacted, which would adversely affect our results of operations. Outsourcing services to offshore providers may expose us to misappropriation of our intellectual property or that of our customers, or make it more difficult to defend intellectual property rights in our technology.\nIf we are unable to hire and retain key personnel, our business and results of operations would be negatively affected.\nOur success will depend in large part on the skills, experience and performance of our senior management, engineering, sales, marketing and other key personnel. The loss of the services of any of our senior management or other key personnel, including our Chief Executive Officer and co-founder, Ashutosh Roy, could harm our business. Additionally, in the technology industry, there is substantial and continuous competition for highly skilled business, product development, technical and other personnel. We may also experience increased compensation costs that are not offset by either improved productivity or higher sales. Our failure to recruit new personnel and to retain and motivate existing personnel could have significant negative effects on us, including impairing our ability to expand our business, and our results of operations could suffer.\nWe may not be able to realize the benefits of offering the limited, free “Innovation in 30 days” version of our service.\nWe offer a limited version of our subscription service to customers or potential customers free of charge (known as “Innovation in 30 days”) in order to promote usage, brand and product awareness, and adoption, and we invest time and resources for such initial engagements without compensation from the customers. Some customers never enter into a definitive contract for our paid subscription service despite the time and effort we may have expended on such initiatives.\nTo the extent that these customers do not become paying customers, we will not realize the intended benefits of this marketing effort, and our ability to grow our business and revenue may be harmed.\nWe may not be able to raise additional capital on acceptable terms, if at all, or without dilution to our stockholders which could limit our ability to grow our business and expand our operations.\nOur working capital requirements in the foreseeable future are subject to numerous risks and will depend on a variety of factors. We may seek additional funding to finance our operations or should we make acquisitions. We may also need to secure additional financing due to unforeseen or unanticipated market conditions. We may try to raise additional funds through public or private financings, strategic relationships, or other arrangements. Such financing may be difficult to obtain on terms acceptable to us, if at all. If we raise additional funds through the issuance of equity or convertible securities, then the issuance could result in substantial dilution to existing stockholders. If we raise additional funds through the issuance of debt securities or preferred stock, these new securities would have rights, preferences, and privileges senior to those of the holders of our common stock. In addition, the terms of these securities could impose restrictions on our operations. If we are not able to raise additional funds on terms acceptable to us, if and when needed, our ability to fund our operations, take advantage of opportunities, and develop or expand our business could be significantly limited.\nOur reserves may be insufficient to cover receivables we are unable to collect.\nWe assume a certain level of credit risk with our customers in order to do business. Conditions affecting any of our customers could cause them to become unable or unwilling to pay us in a timely manner, or at all, for products or services we have already provided them. In the past, we have experienced collection delays from certain customers, and we cannot predict whether we will continue to experience similar or more severe delays in the future. Although we have established reserves to cover losses due to delays or inability to pay, there can be no assurance that such reserves will be sufficient to cover our losses. If losses due to delays or inability to pay are greater than our reserves, it could harm our business, operating results and financial condition.\nIf we acquire companies or technologies, we may not realize the expected business benefits, the acquisitions could prove difficult to integrate, disrupt our business and adversely affect our operations.\nAs part of our business strategy, we periodically make investments in, or acquisitions of, complementary businesses, joint ventures, services and technologies and intellectual property rights, and we expect that we will continue to make such investments and acquisitions in the future. Acquisitions and investments involve numerous risks, including:\n● the potential failure to achieve the expected benefits of the combination or acquisition;\n● difficulties in and the cost of integrating operations, technologies, services and personnel;\n● diversion of financial and managerial resources from existing operations;\n● risks of entering new markets in which we have little or no experience or where competitors may have stronger market positions;\n● potential write-offs of acquired assets or investments, and potential financial and credit risks associated with acquired customers;\n● potential loss of key employees;\n● inability to generate sufficient revenue to offset acquisition or investment costs;\n● the inability to maintain relationships with customers and partners of the acquired business;\n● the difficulty of transitioning the acquired technology onto our existing platforms and maintaining the security standards consistent with our other services for such technology;\n● potential unknown liabilities associated with the acquired businesses;\n● unanticipated expenses related to acquired technology and its integration into existing technology;\n● negative impact to our results of operations because of the depreciation and amortization of amounts related to acquired intangible assets, fixed assets and deferred compensation, and the loss of acquired deferred revenue and unbilled deferred revenue;\n● delays in customer purchases due to uncertainty related to any acquisition;\n● the need to implement controls, procedures and policies at the acquired company;\n● challenges caused by distance, language and cultural differences;\n● in the case of foreign acquisitions, the challenges associated with integrating operations across different cultures and languages and any currency and regulatory risks associated with specific countries; and\n● the tax effects of any such acquisitions.\nWe may be subject to legal liability and/or negative publicity for the services provided to consumers through our technology platforms.\nOur technology platforms enable representatives of our customers as well as individual service providers to communicate with consumers and other persons seeking information or advice on the Internet. The law relating to the liability of online platform providers such as us for the activities of users of their online platforms is often challenged in the U.S. and internationally. We may be unable to prevent users of our technology platforms from providing negligent, unlawful or inappropriate advice, information or content through our technology platforms, or from behaving in an unlawful manner, and we may be subject to allegations of civil or criminal liability for negligent, fraudulent, unlawful or inappropriate activities carried out by users of our technology platforms.\nClaims could be made against online services companies under both U.S. and foreign law such as fraud, defamation, libel, invasion of privacy, negligence, copyright or trademark infringement, or other theories based on the nature and content of the materials disseminated by users of our technology platforms. In addition, domestic and foreign legislation has been proposed that could prohibit or impose liability for the transmission over the Internet of certain types of information. Our defense of any of these actions could be costly and involve significant time and attention of our management and other resources.\nThe Digital Millennium Copyright Act (DMCA) is intended, among other things, to reduce the liability of online service providers for listing or linking to third-party web properties that include materials that infringe copyrights or rights of others. Additionally, portions of the Communications Decency Act (CDA) are intended to provide statutory protections to online service providers who distribute third party content. A safe harbor for copyright infringement is also available under the DMCA to certain online service providers that provide specific services, if the providers take certain affirmative steps as set forth in the DMCA. Certain questions regarding the safe harbor under the DMCA and the CDA have yet to be litigated, and we cannot guarantee that we will meet the safe harbor requirements of the DMCA or of the CDA. If we are not covered by a safe harbor, for any reason, we could be exposed to claims, which could be costly and time-consuming to defend.\nIf our cybersecurity systems or the systems of our vendors, partners and suppliers are breached and unauthorized access is obtained to a customer’s data or our data or IT systems, our service may be perceived as not being secure, customers may curtail or stop using our service and we may incur significant legal and financial exposure and liabilities.\nSecurity incidents have become more prevalent across industries and may occur on our systems. Our service involves the storage and transmission of customers’ proprietary information, and security incidents could expose us to a risk of loss of this information, loss of access, litigation and possible liability. The techniques used to effect unauthorized penetration of computer systems are constantly evolving and have been increasing in sophistication. While we have security measures in place that are designed to protect customer information and prevent data loss and other security breaches, these security measures may be breached as a result of third-party action, including intentional misconduct by computer hackers (which may involve nation states and individuals sponsored by them), employee error, malfeasance or otherwise and result in someone obtaining unauthorized access to our customers’ data or our data, including our intellectual property and other confidential business information, or our IT systems. Additionally, third parties may attempt to fraudulently induce\nemployees or customers into disclosing sensitive information such as user names, passwords or other information in order to gain access to our customers’ data or our data or IT systems.\nEmployees or contractors have introduced vulnerabilities in, and enabled the exploitation of, our IT environments in the past and may do so in the future. These cybersecurity attacks threaten to misappropriate our proprietary information, cause interruptions of our IT services and commit fraud. Because the techniques used to obtain unauthorized access, or to sabotage systems, change frequently and generally are not recognized until launched against a target, we may be unable to anticipate these techniques or to implement adequate preventative measures. Further, if unauthorized access or sabotage remains undetected for an extended period of time, the effects of such breach could be exacerbated.\nIn addition, our customers may authorize third party access to their customer data located in our cloud environment. Because we do not control the transmissions between customer authorized third parties, or the processing of such data by customer authorized third parties, we cannot ensure the integrity or security of such transmissions or processing.\nCybersecurity attacks could require significant expenditures of our capital and diversion of our resources. If these attacks are successful, they could result in the theft of proprietary, personally identifiable, confidential and sensitive information of ours, our employees, our customers and our business partners, and could materially disrupt business for us, our customers and our business partners. A successful cybersecurity attack involving our data center, network or software products could also negatively impact the market perception of the effectiveness of our products or lead to contractual disputes, litigation or government regulatory action against us, any of which could materially adversely affect our business, reputation and resulting operations.\nWe may also experience disruptions, outages, and other performance problems on our systems due to service attacks, unauthorized access, or other security-related incidents. For example, third parties may conduct attacks designed to temporarily deny customers access to our services. Any successful denial of service attack could result in a loss of customer confidence in the security of our platform and damage to our brand.\nOur platform involves the storage and transmission of our customers’ information, which may including their business and financial data. As a result, unauthorized access to customer data or security breaches could result in the loss, or unauthorized dissemination, of such data, which could seriously harm our or our customers’ businesses and reputations. Any of these security incidents could negatively affect our ability to attract new customers, cause existing customers to elect to not renew their subscriptions, result in reputational damage or subject us to third-party lawsuits, regulatory fines, or other action or liability, which could adversely affect our operating results. Any insurance coverage we may have related to security and privacy damages may not be adequate for liabilities actually incurred and we cannot be certain that insurance will continue to be available to us on economically reasonable terms, or at all. These risks are likely to increase as we continue to grow the scale and functionality of our platform and process, store, and transmit increasingly large amounts of our customers’ information and data, which may include proprietary or confidential data or personal or identifying information.\nChanges in the European regulatory environment regarding privacy and data protection regulations, such as the European Union’s General Data Protection Regulation (GDPR), could expose us to risks of noncompliance and costs associated with compliance.\nWe have in the past relied on adherence to the U.S. Department of Commerce’s Safe Harbor Privacy Principles, the U.S.-European Union (EU) and U.S. - Swiss Safe Harbor Frameworks, and their successors, the EU-U.S. and Swiss-U.S. Privacy Shield Frameworks, as agreed to and set forth by the U.S. Department of Commerce, and the EU and Switzerland, which established a means for legitimating the transfer of personally identifiable information (PII) by U.S. companies doing business in Europe from the European Economic Area (EEA) and Switzerland to the U.S. However, as a result of the October 6, 2015 EU Court of Justice (ECJ), opinion in Case C-362/14 (Schrems v. Data Protection Commissioner) regarding the adequacy of the U.S.-EU Safe Harbor Framework, and the July 16, 2020 ECJ judgment in Case C-311/18 (Data Protection Commissioner v Facebook Ireland Limited and Maximillian Schrems) regarding the adequacy of the Privacy Shield Framework, both frameworks are no longer deemed to constitute a valid method of compliance with restrictions set forth in European law regarding the transfer of data outside of the EEA. We are therefore required to rely on alternative mechanisms permitted under European law, such as consent and approved standard contractual clauses. The standard contractual clauses approved by the European Commission for these purposes have recently been replaced and a\nsignificant repapering exercise is therefore required. The UK is also currently consulting on its own updated version of the standard contractual clauses and the result of this may be that different standard contractual clauses are needed depending on the origin of the PII.\nOn May 25, 2018, the EU’s GDPR became enforceable, imposing new obligations directly on us as both a data controller and a data processor, as well as on many of our customers. Following the UK's exit from the EU (Brexit) the UK adopted a UK version of the GDPR. While the UK GDPR is currently aligned with the EU GDPR, Brexit has created the opportunity for the UK to develop its own data protection regime which may diverge from the European standard (as is the case with the standard contractual clauses, discussed above). It is possible that these new legal developments may evolve in a manner that is adverse to us, unforeseen, or otherwise inconsistent with our practices or that we may not adequately adapt our internal policies and/or procedures to evolving regulations, any of which could result in litigation, regulatory investigations and potential legal liability (including potential liability exposure through higher potential penalties for non-compliance), require us to make changes to our services to enable us and/or our customers to meet the new legal requirements, in case we have to change locations of data centers to meet privacy laws, increased requirements for customers to buy add-ons to meet additional requirements imposed by new laws, require us to change our practices in a manner adverse to our business or limit access to our products and services in certain countries. Compliance with existing, proposed and recently enacted laws and regulations can be costly, particularly if we are subject to differing or conflicting requirements in the different countries in which we operate; any failure to comply with these regulatory standards could subject us to legal and reputational risks.\nWhile we have sought to implement appropriate transfer mechanisms following the invalidation of the Safe Harbor and Privacy Shield frameworks, owing to the significant changes that are ongoing in this area, we may be unsuccessful in establishing legitimate means of transferring data from the EEA or UK to the U.S. Moreover, further challenges may be raised against the transfer mechanisms that we have adopted which may require future adaptation. We may also experience hesitancy, reluctance, or refusal by European or multi-national customers to continue to use our services due to the potential risk exposure to such customers as a result of the international legal developments. We and our customers are at risk of enforcement actions taken by an EU or UK data protection authority until such point in time that we ensure that all data transfers to us from the EEA and UK are legitimized. We may find it necessary to establish systems to maintain EU/UK-origin data in the EEA or UK, which may involve substantial expense and distraction from other aspects of our business.\nWe publicly post our privacy policies and practices concerning our processing, use and disclosure of PII. Our publication of our privacy policy and other public statements that provide promises and assurances about privacy and security can subject us to potential governmental action if they are found to be deceptive or misrepresentative of our practices. Further, the costs of compliance with, and other burdens imposed by, such laws, regulations and policies that are applicable to us may limit the use and adoption of our products and solutions and could have a material adverse impact on our results of operations.\nPrivacy concerns and laws, evolving regulation of cloud computing and other domestic or foreign regulations may limit the use and adoption of our solutions and adversely affect our business.\nFurther to the above, regulation related to the provision of services on the Internet is increasing, as federal, state and foreign governments continue to adopt new laws and regulations addressing data privacy and the collection, processing, storage and use of personal information. Further, laws are increasingly aimed at the use of personal information for marketing purposes, such as the EU’s e-Privacy Directive (which is set to be replaced by a new EU e-Privacy Regulation which will have a “direct effect” in each EU Member State), and the country-specific regulations that implement that directive. These and other requirements could reduce demand for our solutions or restrict our ability to store and process data or, in some cases, impact our ability to offer our services and solutions in certain locations.\nIn the U.S., California enacted the California Consumer Privacy Act (CCPA) on June 28, 2018, which went into effect on January 1, 2020. The CCPA gives California residents expanded rights to access and delete their personal information, opt out of certain personal information sharing and receive detailed information about how their personal information is used. The CCPA provides for civil penalties for violations, as well as a private right of action for data breaches that is expected to increase data breach litigation. New York enacted the Stop Hacks and Improve Electronic Data Security Act (SHIELD Act), which became effective March 2020 and requires companies with data relating to New Yorkers to adopt comprehensive cybersecurity programs. These statutes may increase our compliance costs and potential liability. Some\nobservers have noted that the CCPA and the SHIELD Act could mark the beginning of a trend toward more stringent privacy legislation in the U.S., which could increase our potential liability and adversely affect our business. Furthermore, India has recently proposed enacting its own data protection legislation although the specifics of this are yet to be decided.\nIn addition to government activity, privacy advocacy and other industry groups have established or may establish new self-regulatory standards that may place additional burdens on us. Our customers expect us to meet voluntary certification or other standards established by third parties, such as TRUSTe. If we are unable to maintain these certifications or meet these standards, it could adversely affect our ability to provide our solutions to certain customers and could harm our business.\nThe costs of compliance with and other burdens imposed by laws, regulations and standards may limit the use and adoption of our service and reduce overall demand for it, or lead to significant fines, penalties or liabilities for any noncompliance.\nFurthermore, concerns regarding data privacy may cause our customers’ customers to resist providing the data necessary to allow our customers to use our service effectively. Even the perception that the privacy of personal information is not satisfactorily protected or does not meet regulatory requirements could inhibit sales of our products or services, and could limit adoption of our subscription solution. Moreover, as our customers face increased scrutiny for data privacy breaches, they may elect to transfer the risk to us through contractual provisions which may subject us to increasing levels of contractual liability for data privacy breaches.\nAnti-corruption, anti-bribery, and similar laws, and failure to comply with these laws, could subject us to criminal penalties or significant fines and harm our business and reputation.\nWe are subject to anti-corruption and anti-bribery and similar laws, such as the U.S. Foreign Corrupt Practices Act of 1977, as amended, or the FCPA, the U.S. domestic bribery statute contained in 18 U.S.C. § 201, the U.S. Travel Act, the USA PATRIOT Act, the U.K. Bribery Act 2010, and other anti-corruption, anti-bribery, and anti-money laundering laws in countries in which we conduct activities. Anti-corruption and anti-bribery laws have been enforced aggressively in recent years and are interpreted broadly and prohibit companies and their employees and agents from promising, authorizing, making or offering improper payments, or other benefits to government officials and others in the private sector. As we increase our international sales and business, our risks under these laws may increase. Noncompliance with these laws could subject us to investigations, sanctions, settlements, prosecution, other enforcement actions, disgorgement of profits, significant fines, damages, other civil and criminal penalties or injunctions, adverse media coverage, and other consequences. Any investigations, actions, or sanctions could harm our business, operating results, and financial condition.\nIndustry-specific regulation is evolving and unfavorable industry-specific laws, regulations or interpretive positions could limit our ability to provide services and harm our business.\nOur customers and potential customers conduct business in a variety of industries, including financial services, the public sector, healthcare and telecommunications. Regulators in certain industries have adopted and may in the future adopt regulations or interpretive positions regarding the use of cloud computing and other outsourced services. The costs of compliance with, and other burdens imposed by, industry-specific laws, regulations and interpretive positions may limit customers’ use and adoption of our services and reduce overall demand for our services. For example, some financial services regulators have imposed guidelines for use of cloud computing services that mandate specific controls or require financial services enterprises to obtain regulatory approval prior to outsourcing certain functions. If we are unable to comply with these guidelines or controls, or if our customers are unable to obtain regulatory approval to use our service where required, our business may be harmed. In addition, an inability to satisfy the standards of certain voluntary third-party certification bodies that our customers may expect, such as an attestation of compliance with the PCI Data Security Standards, may have an adverse impact on our business. If we are unable to achieve or maintain these industry-specific certifications or other requirements or standards relevant to our customers, it could adversely affect our ability to provide our services to certain customers and harm our business.\nIn some cases, industry-specific laws, regulations or interpretive positions may also apply directly to us as a service provider. Any failure or perceived failure by us to comply with such requirements could have an adverse impact on our business.\nChanges to current accounting policies could have a significant effect on our reported financial results or the way in which we conduct our business.\nGenerally accepted accounting principles and the related accounting pronouncements, implementation guidelines and interpretations for some of our significant accounting policies are highly complex and require subjective judgments and assumptions. Some of our more significant accounting policies that could be affected by changes in the accounting rules and the related implementation guidelines and interpretations include:\n● recognition of revenue;\n● contingencies and litigation; and\n● accounting for income taxes.\nChanges in these or other rules, or scrutiny of our current accounting practices, or a determination that our judgments or assumptions in the application of these accounting principles were incorrect, could have a significant adverse effect on our reported operating results or the way in which we conduct our business.\nContinued uncertainty surrounding the implementation and effect of Brexit may cause increased economic volatility, affecting our operations and business.\nIn March 2017, the UK served notice to the European Council under Article 50 of the Treaty of Lisbon to withdraw membership from the EU. Brexit could cause disruptions to, and create uncertainty surrounding, our business in the UK and EU, including affecting our relationships with our existing and future customers, suppliers, and employees. As a result, Brexit could have an adverse effect on our future business, financial results, and operations. The UK formally left the EU on January 31, 2020, although it was subject to a transition period through December 31, 2020. While the transition period has now ended, and a deal was reached between the EU and the UK (avoiding a so called \"hard Brexit\"), the long-term nature of the UK’s relationship with the EU is still relatively unclear. The political and economic instability created by Brexit has caused and may continue to cause significant volatility in global financial markets. Brexit has also had the effect of disrupting the free movement of goods, services, and people between the UK, the EU, and elsewhere. Brexit could lead to legal uncertainty and potentially divergent national laws and regulations as the UK determines which EU laws to repeal or replace. Further, uncertainty around these and related issues could lead to adverse effects on the economy of the UK and the other economies in which we operate. There can be no assurance that any or all of these events will not have a material adverse effect on our business operations, results of operations and financial condition.\nFurther, Brexit has created uncertainty with regard to the future regulation of data protection in the United Kingdom. We may experience reluctance or refusal by current or prospective customers in Europe, including the United Kingdom, to use our products, and we may find it necessary or desirable to make further changes to our handling of personal data of European residents. The regulatory environment applicable to the handling of European residents’ personal data, and our actions taken in response, may cause us to assume additional liabilities or incur additional costs, and could result in our business, operating results, and financial condition being harmed.\nRisks Related to Intellectual Property\nWe have been and may in the future be sued by third parties for various claims including alleged infringement of proprietary rights that can be time-consuming, incur substantial costs and divert the attention of management, which could adversely affect our operations and cash flow.\nWe are involved in various legal matters arising from the normal course of business activities. These may include claims, suits, and other proceedings involving alleged infringement of third-party patents and other intellectual property rights, and commercial, labor and employment, and other matters.\nThe software and Internet industries are characterized by the existence of a large number of patents, trademarks and copyrights and by frequent litigation based on allegations of infringement or other violations of intellectual property rights. We have received and may receive in the future communications from third parties claiming that we or our customers have\ninfringed the intellectual property rights of others. In addition, we have been, and may in the future be, sued by third parties for alleged infringement of their claimed proprietary rights. Our technologies and those of our customers may be subject to injunction if they are found to infringe the rights of a third party or we may be required to pay damages, or both. Many of our agreements require us to indemnify our customers for third-party intellectual property infringement claims, which would increase the cost to us of an adverse ruling on such a claim.\nThe outcome of any litigation, regardless of its merits, is inherently uncertain. Any claims and lawsuits, and the disposition of such claims and lawsuits, could be time-consuming and expensive to resolve, divert management attention from executing our business plan, lead to attempts on the part of other parties to pursue similar claims and, in the case of intellectual property claims, require us to change our technology, change our business practices or pay monetary damages, or enter into short- or long-term royalty or licensing agreements.\nAny adverse determination related to intellectual property claims or other litigation could prevent us from offering our service to customers, could be material to our financial condition or cash flows, or both, or could otherwise adversely affect our operating results. In addition, depending on the nature and timing of any such dispute, a resolution of a legal matter could materially affect our future results of operation or cash flows or both.\nWe rely on trademark, copyright, trade secret laws, contractual restrictions and patent rights to protect our intellectual property and proprietary rights and, if these rights are impaired, then our ability to generate revenue will be harmed.\nIf we fail to protect our intellectual property rights adequately, our competitors might gain access to our technology, and our business might be harmed. In addition, defending our intellectual property rights might entail significant expense. Any of our trademarks or other intellectual property rights may be challenged by others or invalidated through administrative process or litigation. While we have some U.S. patents and pending U.S. patent applications, we may be unable to obtain patent protection for the technology covered in our patent applications. In addition, our existing patents and any patents issued in the future may not provide us with competitive advantages, or may be successfully challenged by third parties. Furthermore, legal standards relating to the validity, enforceability and scope of protection of intellectual property rights are uncertain. Effective patent, trademark, copyright and trade secret protection may not be available to us in every country in which our service is available. The laws of some foreign countries may not be as protective of intellectual property rights as those in the U.S., and mechanisms for enforcement of intellectual property rights may be inadequate. Accordingly, despite our efforts, we may be unable to prevent third parties from infringing upon or misappropriating our intellectual property.\nWe might be required to spend significant resources to monitor and protect our intellectual property rights. We may initiate claims or litigation against third parties for infringement of our proprietary rights or to establish the validity of our proprietary rights. Any litigation, whether or not it is resolved in our favor, could result in significant expense to us and divert the efforts of our technical and management personnel.\nOur failure or inability to develop non-infringing technology or license proprietary rights on a timely basis would harm our business.\nWe may be subject to legal proceedings and claims from time to time in the ordinary course of our business, including claims of alleged infringement of the patents and other intellectual property rights of third parties. Our products may infringe issued patents that may relate to our products because patent applications in the United States are not publicly disclosed until the patent is issued, and hence applications may have been filed which relate to our software products. Intellectual property litigation is expensive, time consuming, and could divert management’s attention away from running our business. Litigation could also require us to develop non-infringing technology or enter into royalty or license agreements. These royalty or license agreements, if required, may not be available on acceptable terms, if at all, in the event of a successful claim of infringement.\nGeneral Risk Factors\nOur stock price has demonstrated volatility and continued market conditions may cause declines or fluctuations.\nThe price at which our common stock trades has been and will likely continue to be highly volatile and show wide fluctuations due to factors such as the following:\n● transition to a subscription revenue model;\n● concerns related to liquidity of our stock;\n● actual or anticipated fluctuations in our operating results, our ability to meet announced or anticipated profitability goals and changes in or failure to meet securities analysts’ expectations;\n● announcements of technological innovations and/or the introduction of new services by us or our competitors;\n● developments with respect to intellectual property rights and litigation, regulatory scrutiny and new legislation;\n● conditions and trends in the Internet and other technology industries; and\n● general market and economic conditions.\nFurthermore, the stock market has experienced significant price and volume fluctuations that have affected the market prices for the common stock of technology companies, regardless of the specific operating performance of the affected company. These broad market fluctuations may cause the market price of our common stock to decline.\nOur insiders who are significant stockholders have the ability to exercise significant control over matters requiring stockholder approval, including the election of our board of directors, and may have interests that conflict with those of other stockholders.\nOur directors and executive officers, together with their affiliates and members of their immediate families, beneficially owned, in the aggregate, approximately 31% of our outstanding capital stock as of June 30, 2021, of which our Chief Executive Officer, Ashutosh Roy, beneficially owned approximately 27% as of such date. As a result of these concentrated holdings, Mr. Roy individually or together with this group has the ability to exercise significant control over most matters requiring our stockholders’ approval, including the election and removal of directors and the approval of significant corporate transactions, such as a merger or sale of our company or its assets.",
    "item_1B": "ITEM 1B.\nUNRESOLVED STAFF COMMENTS\nNone.",
    "item_2": "ITEM 2.\nPROPERTIES\nWe lease all facilities used in our business as of June 30, 2021. The following table summarizes our principal properties:\nApproximate Square\nLease Expiration\nLocation\nPrincipal Use\nFootage\nDate\nSunnyvale, California\nCorporate Headquarters\n42,541\nNewbury, England\nCorporate Office - Europe, Middle East, & Africa\n14,090\nPune, India\nCorporate Office - Asia Pacific\n33,262",
    "item_3": "ITEM 3.\nLEGAL PROCEEDINGS\nWe are not currently a party to any legal proceedings, and are not aware of any pending or threatened legal proceedings against us that we believe could have a material adverse effect on our business, operating results, or financial condition. In the ordinary course of business, we are involved in various legal proceedings and claims related to alleged infringement of third-party patents and other intellectual property rights, commercial, corporate and securities, labor and employment,\nwage and hour, and other claims. We have been, and may in the future be, put on notice and/or sued by third parties for alleged infringement of their proprietary rights, including patent infringement.\nWe evaluate all claims and lawsuits with respect to their potential merits, our potential defenses and counterclaims, settlement or litigation potential and the expected effect on us. Our technologies may be subject to injunction if they are found to infringe the rights of a third party. In addition, our agreements require us to indemnify our customers for third-party intellectual property infringement claims, which could increase the cost to us of an adverse ruling on such a claim.",
    "item_4": "ITEM 4.\nMINE SAFETY DISCLOSURES\nNot applicable.\nPART II",
    "item_5": "ITEM 5.\nMARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nOur common stock is traded on the Nasdaq Capital Market under the symbol “EGAN”.\nHolders\nAs of September 9, 2021, there were approximately 139 stockholders of record.\nDividends\nWe have never declared or paid any cash dividends on our common stock. We currently anticipate that we will retain all available funds for use in the operation of our business and do not intend to pay any cash dividends in the foreseeable future.\nStock Performance Graph\nThe following shall not be deemed incorporated by reference into any of our other filings under the Securities Exchange Act of 1934, as amended, or the Securities Act of 1933, as amended.\nThe graph below compares the cumulative total stockholder return on our common stock with the cumulative total return on the Standard & Poor’s 500 Index and the Nasdaq Composite Total Return Index for each of the last five fiscal years ended June 30, 2021, assuming an initial investment of $100. Data for the Standard & Poor’s 500 Index and the Nasdaq Composite Total Return Index assume no dividends.\nThe comparisons in the graph below are based upon historical data and are not indicative of, nor intended to forecast, future performance of our common stock.\n6/30/2016\n6/30/2017\n6/30/2018\n6/30/2019\n6/30/2020\n6/30/2021\neGain Corporation\n$ 100.00\n$ 58.51\n$ 535.46\n$ 288.65\n$ 393.97\n$ 407.09\nNasdaq Composite\n$ 100.00\n$ 128.30\n$ 158.57\n$ 170.91\n$ 216.47\n$ 315.10\nS&P Software & Services Select Industry Index\n$ 100.00\n$ 124.89\n$ 162.67\n$ 194.46\n$ 227.05\n$ 350.71\nEquity Compensation Plan Information\nSee Item 12 of Part III of this Annual Report regarding information about securities authorized for issuance under our equity compensation plan.",
    "item_6": "ITEM 6.\nSELECTED FINANCIAL DATA\nThe selected consolidated financial data should be read in conjunction with the information under “",
    "item_7": "ITEM 7.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion of eGain’s financial condition and results of operations should be read together with the consolidated financial statements and related notes in this Annual Report on Form 10-K. This discussion may contain forward-looking statements based upon current expectations that involve risks and uncertainties. These risks and uncertainties may cause actual results to differ materially from those discussed in the forward-looking statements.\nOverview\neGain automates customer engagement with an innovative software as a service (SaaS) platform, powered by deep digital, artificial intelligence (AI), and knowledge capabilities. We are headquartered in the United States. We also operate in United Kingdom and India. We sell mostly to large enterprises across financial services, telecommunications, retail, government, healthcare, and utilities. With our mantra of AX + BX + CX = DX™, we guide clients to effortless digital experience (DX) by holistically optimizing agent experience (AX), business experience (BX) and customer experience (CX). One hundred fifty leading brands use eGain’s cloud software to improve customer satisfaction, empower agents, reduce service cost and boost sales.\nWe have transitioned from a hybrid model, where we sold both SaaS and perpetual license solutions, to a SaaS only business model. Today, we only sell SaaS to new clients and are actively migrating our remaining perpetual license clients to SaaS. As we continue to migrate our legacy perpetual license clients to SaaS, we expect our legacy revenue, primarily comprising annual maintenance and support fees for legacy perpetual license clients to continue to decline.\nWe believe our go-forward SaaS business model affords us recurring revenue visibility and more predictability. Fiscal year 2021 affirmed our view that SaaS clients adopt our product innovation much faster than the perpetual license model and get better service levels. We believe SaaS clients enjoy up to 50% faster time to value from their eGain investment.\nCOVID-19\nSince early 2020, several public health organizations have recommended, and many local governments have implemented, certain measures to slow and limit the transmission of COVID-19, including shelter-in-place and social distancing orders, which has resulted in a significant deterioration of economic conditions in the countries in which we operate.\nThe impact of COVID-19 and the related disruptions caused to the global economy and our business did not have a material adverse impact on our business during the year ended June 30, 2021. However, the spread of the COVID-19 virus caused us to modify our business practices, including implementing work-from-home policies and restricting travel by our employees, among other things.\nIn response to the outbreak of COVID-19, we have taken the following measures to date:\n● Implemented work-from-home and social distancing policies throughout our organization;\n● Suspended all employee travel;\n● Cancelled certain sales and marketing events; and\n● Looked to our customer’s needs to best support their operations during this crisis.\nThe effect of the COVID-19 pandemic, may not be fully reflective in our results of operations and overall financial performance until further periods, if at all. The impact, if any, of operational changes we may implement is uncertain, but changes we have implemented as of the filing date have not affected and are not expected to affect our ability to maintain operations. We will continuously monitor the situation to determine what actions may be necessary or appropriate to address the impact of the COVID-19 pandemic, which may include actions mandated or recommended by federal, state or local government authorities. See our “Risk Factors” for further discussion of the possible impact of the COVID-19 pandemic on or business.\nKey Financial Measures\nWe monitor the key financial performance measures set forth below as well as cash and cash equivalents and available debt capacity, which are discussed in Liquidity and Capital Resources, to help us evaluate trends, establish budgets, measure the effectiveness of our sales and marketing efforts and assess operational effectiveness and efficiencies.\nSaaS Revenues\nWith our transition to a SaaS only business model, we believe SaaS revenue better reflects our business momentum and to analyze progress and thus, we disaggregate our subscription revenue growth between:\n● SaaS revenue, which is defined as revenue from cloud delivery arrangements, term licenses and embedded OEM royalties and associated support; and\n● Legacy revenue, which is defined as revenue from license, maintenance and support contracts on perpetual license arrangements that we no longer sell.\nThe following table presents a break out of subscription revenue between SaaS and legacy revenues for each of the following periods:\nFiscal Year Ended June 30\nChange\nRevenue\n(in thousands, except percentages)\nSaaS revenue\n$\n66,929\n$\n56,793\n$\n10,136\n%\nLegacy revenue\n5,442\n9,336\n(3,894)\n(42)\n%\nTotal SaaS and legacy revenue\n$\n72,371\n$\n66,129\n$\n6,242\nAs we continue to migrate our legacy perpetual license clients to SaaS, we expect our legacy revenue to continue to decline.\nSaaS and Professional Services Revenue\nAs we continue to shift to a SaaS only business model, substantially all of professional services revenue is now generated from our SaaS customer base. We believe the combination of SaaS and professional services revenue is a useful measure to value our business on a forward-looking basis.\nThe following table presents total SaaS and professional services revenue for each of the following periods:\nFiscal Year Ended June 30\nChange\nRevenue\n(in thousands, except percentages)\nSaaS revenue\n$\n66,929\n$\n56,793\n$\n10,136\n%\nProfessional services\n5,916\n6,600\n(684)\n(10)\n%\nTotal SaaS and professional services revenue\n$\n72,845\n$\n63,393\n$\n9,452\nNon-GAAP Operating Income\nNon-GAAP operating income is defined as operating income, adjusted for the impact of stock-based compensation expense and amortization of acquired intangible assets.\nManagement believes that it is useful to exclude certain non-cash charges and non-core operational charges from non-GAAP operating income because (i) the amount of such expenses in any specific period may not directly correlate to the underlying performance of our business operations; and (ii) such expenses can vary significantly between periods as a result of the timing of new stock-based awards and acquisitions. The presentation of the non-GAAP financial measures is not intended to be considered in isolation, or as a substitute for, or superior to, the financial information prepared and presented in accordance with generally accepted accounting principles in the United States of America (GAAP).\nThe following table presents a reconciliation of GAAP income from operations to non-GAAP income from operations for each of the following periods:\nFiscal Year Ended June 30\nIncome from operations\n$\n7,339\n$\n7,406\nAdd:\nStock-based compensation\n1,700\n1,861\nAmortization of intangible assets\nNon-GAAP income from operations\n$\n9,065\n$\n9,535\nCritical Accounting Policies and Estimates\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations discusses our consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States. The preparation of these financial statements requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period.\nWe believe that the assumptions and estimates associated with revenue recognition, stock-based compensation, allowance for doubtful accounts, the valuation of goodwill and intangible assets, the valuation of deferred tax allowance, and legal contingencies have the greatest potential impact on our consolidated financial statements. We evaluate these estimates on an ongoing basis. Management bases its estimates and judgments on historical experience and on various other factors that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nSources of Revenues\nOur revenue is comprised of two categories, subscription and professional services. Subscription includes SaaS revenue and legacy revenue. SaaS revenue includes revenue from cloud delivery arrangements, term licenses and embedded OEM royalties and associated support. Legacy revenue is associated with license, maintenance and support contracts on perpetual license arrangements that we no longer sell. Professional services include consulting, implementation and training.\nSubscription Revenue\nFor our cloud delivery arrangements, our maintenance and support arrangements and our term license subscriptions that incorporate substantial cloud functionality, the combined performance obligation is recognized ratably over the contract term as the obligation is delivered. For contracts involving distinct software licenses, the license performance obligation is satisfied at a point in time when control is transferred to the customer.\nWe typically invoice our customers in advance upon execution of the contract or subsequent renewals. Invoiced amounts are recorded in accounts receivable, deferred revenue or revenue, depending on when control is transferred to our customers based on each arrangement.\nWe have a royalty revenue agreement with a customer related to our embedded intellectual property. Under the terms of the agreement, the customer is to provide a combined fixed fee, per agent, for each software license sold containing the embedded software to us. These embedded OEM royalties are included as subscription revenue. Under Topic 606-10-55-65 revenue guidance (Topic 606), since these arrangements are for sales-based licenses of intellectual property, we recognize revenue only as the subsequent sale occurs. However, since such sales are reported by the customer with a quarter in arrears, such revenue is recognized at the time it is reported and paid by the customer given that any estimated variable consideration would have to be fully constrained due to the unpredictability of such estimate and the unavoidable risk that it may lead to significant revenue reversals.\nProfessional Services Revenue\nProfessional services revenue includes system implementation, consulting and training. The transaction price is allocated to various performance obligations based on their stand-alone selling prices. Revenue allocated to each performance obligation is recognized as work is performed. Our consulting and implementation service contracts are bid either on a time-and-materials basis or on a fixed-fee basis. Fixed fees are generally paid on milestone billing at pre-determined points in the contract. Amounts that have been invoiced are recorded in accounts receivable and in deferred revenue or revenue, depending on whether transfer of control to customers has occurred.\nTraining revenue that meets the criteria to be accounted for separately is recognized when training is provided.\nRemaining Performance Obligations\nRemaining performance obligations represent contracted revenues that have not yet been recognized, and include billed deferred revenues, consisting of amounts invoiced to customers whether collected or uncollected which have not been recognized as revenues, as well as unbilled amounts that will be invoiced and recognized as revenues in future periods. The transaction price allocated to the remaining performance obligations are influenced by a variety of factors, including seasonality, timing of renewals, average contract terms and foreign currency rates. As of June 30, 2021, our remaining performance obligations were $65.4 million of which we expect to recognize $55.2 million and $10.2 million as revenue within one year and beyond one year, respectively.\nWe expect our remaining performance obligations to change quarterly for several reasons including the timing of new contracts and renewals, duration and size of our subscription and support arrangements, variable billing cycles and foreign exchange rate fluctuation. We typically issue renewal invoices in advance of the renewal service period. Depending on timing, the initial invoice and subsequent renewal invoices may occur in different quarters. This may result in an increase or decrease to our accounts receivable and deferred revenue.\nCosts Capitalized to Obtain Revenue Contracts\nUnder Topic 606, we capitalize incremental costs to obtain non-cancelable subscription and maintenance and support revenue contracts with amortization periods that may extend longer than the non-cancelable subscription and maintenance and support revenue contract terms.\nWe capitalize incremental costs of obtaining a non-cancelable subscription and maintenance and support revenue contract with amortization periods of one year or more. The capitalized amounts consist primarily of sales commissions paid to our direct sales force. Capitalized amounts also include (i) amounts paid to employees other than the direct sales force who earn incentive payouts under annual compensation plans that are tied to the value of contracts acquired and (ii) the associated payroll taxes and fringe benefit costs associated with the payments to our employees.\nCosts capitalized related to new revenue contracts are generally deferred and amortized on a straight-line basis over a period of benefit that we estimate to be five years. We determine the period of benefit by taking into consideration the\nperiod from initial contract through renewal, which constitutes the length of our customer relationship or customer life. Amortization of costs capitalized related to new revenue contracts is included as a component of sales and marketing expense in our operating results.\nStock-Based Compensation\nWe account for stock-based compensation in accordance with Accounting Standards Codification (ASC) 718, Compensation - Stock Compensation. Under the fair value recognition provisions of ASC 718, stock-based compensation cost is measured at the grant date based on the fair value of the award and is recognized as an expense over the vesting period. Determining the fair value of the stock-based awards at the grant date requires significant judgment and the use of estimates, particularly surrounding Black-Scholes valuation assumptions such as stock price volatility and expected option lives. We determine the appropriate measure of expected volatility by reviewing historic volatility in the share price of our common stock, as adjusted for certain events that management deems to be non-recurring and non-indicative of future events. We base our estimate of expected life on the historical exercise behavior, cancellations of all past option grants made by us during the time period in which our common stock has been publicly traded, the contractual term, the vesting period and the expected remaining term of the option. Based on our historical experience of option pre-vesting cancellations, we have assumed an annualized 10.79% forfeiture rate for our options. We record additional expense if the actual forfeiture rate is lower than we estimated and record a recovery of prior expense if the actual forfeiture rate is higher than what we estimated.\nGoodwill and Other Intangible Assets\nWe review goodwill annually for impairment or sooner whenever events or changes in circumstances indicate that it may be impaired. These events or circumstances could include a significant change in the business climate, legal factors, operating performance indicators, competition, or sale or disposition of a significant portion of a reporting unit. In addition, we evaluate purchased intangible assets to determine that all such assets have determinable lives. We operate under a single reporting unit and accordingly, all of our goodwill is associated with the entire company. We had no impairment for fiscal years ended June 30, 2021 and 2020.\nAccounts Receivable and Allowance for Doubtful Accounts\nWe extend unsecured credit to customers on a regular basis. Our accounts receivable is derived from revenue earned from customers and are not interest bearing. We also maintain an allowance for doubtful accounts to reserve for potential uncollectible trade receivables. We review our trade receivables by aging category to identify specific customers with known disputes or collectability issues. We exercise judgment when determining the adequacy of these reserves as we evaluate historical bad debt trends, general economic conditions in the U.S. and internationally, and changes in customer financial conditions. If we make different judgments or utilize different estimates, then material differences may result in additional reserves for trade receivables, which would be reflected by charges in general and administrative expenses for any period presented. We write-off a receivable after all collection efforts have been exhausted and the amount is deemed uncollectible.\nAs described in Note 1 of Notes to Consolidated Financial Statements included in Item 8 Financial Statements and Supplementary Data of this Annual Report, certain Company contracts have contractual billings which do not coincide with revenue recognized on the contract. Unbilled accounts receivables are recorded when revenue recognized on the contract exceeds billings, pursuant to contract provisions, and become billable at contractually specified dates.\nTax Legislation\nOn December 22, 2017, the U.S. government enacted comprehensive tax legislation commonly referred to as the Tax Cuts and Jobs Act (Tax Act). The Tax Act revised the taxation of U.S. and multinational corporations which significantly reduced the statutory corporate U.S. federal income tax rate from 35% to 21%, imposed limitations on the ability of corporations to deduct interest expense and made taxation changes on U.S. multinational corporation’s foreign operations. The provisions of the Tax Act are complex and likely will be subject to regulatory and administrative guidance. The Tax Act includes a provision to tax global intangible low-taxed income (GILTI) of foreign subsidiaries and a base erosion anti-abuse tax (BEAT) measure that taxes certain payments between a U.S. corporation and its foreign subsidiaries. For the\nfiscal year ended June 30, 2021, we have $923,000 of GILTI income inclusion and used our net operating losses to offset our taxable income. For the fiscal year ended June 30, 2021, we did not incur any BEAT tax.\nOn March 27, 2020, the Coronavirus Aid, Relief, and Economic Security Act (CARES Act), P.L. 116-136,was passed into law, amending portions of certain relevant US tax laws. The CARES Act included a number of federal income tax law changes, including, but not limited to: (i) permitting net operating loss carrybacks to offset 100% of taxable income for taxable years beginning before 2021, (ii) accelerating alternative minimum tax credit refunds, (iii) temporarily increasing the allowable business interest deduction from 30% to 50% of adjusted taxable income, and (iv) providing a technical correction for depreciation related to qualified improvement property. The CARES Act had no impact on our consolidated financial statements.\nOn December 27, 2020, President Trump signed the Consolidated Appropriations Act, 2021 (CAA). The CAA contains numerous individual, business, payroll, disaster, and energy-related tax provisions, as well as tax extenders. Many of the provisions, including $600 stimulus payments, and an extension of payroll credits, relate to the COVID-19 pandemic. The COVID-related Tax Relief Act of 2020 (COVIDTRA) and the Taxpayer Certainty and Disaster Tax Relief Act of 2020 (TCDTR), both part of the CAA, contains numerous provisions related to businesses. We continue to examine the elements of the CARES Act and CAA and the impact they may have on our future business.\nFiscal Year 2021 Compared with Fiscal Year 2020\nOur effective tax rate for fiscal years 2021 and 2020 was a tax benefit of 2.4% and a tax provision of 9.7%, respectively. The change in our effective tax rate for fiscal year 2021 as compared to fiscal year 2020 was primarily due to the expiration of tax attributes, the change in valuation allowance, foreign rate differential, GILTI inclusion, stock-based compensation and the research and development tax credit.\nThe income before income tax provision between the U.S. and foreign countries impacted our effective tax rate as a result of the geographic distribution and customer demand related to our products and services. In fiscal year 2021, our U.S. and foreign income before our income tax provision was $5.0 million and $1.8 million, respectively. In fiscal year 2020, our U.S. and foreign income before our income tax provision was $5.3 million and $2.7 million, respectively.\nDeferred Tax Valuation Allowance\nWhen we prepare our consolidated financial statements, we estimate our income tax liability for each of the various jurisdictions where we conduct business. This requires us to estimate our actual current tax exposure and to assess temporary differences that result from differing treatment of certain items for tax and accounting purposes. The net deferred tax assets are reduced by a valuation allowance if, based upon weighted available evidence, it is more likely than not that some or all of the deferred tax assets will not be realized. We make significant judgments to determine our provision for income taxes, our deferred tax assets and liabilities and any valuation allowance to be recorded against our net deferred tax assets. As of June 30, 2021, we had a valuation allowance of approximately $35.5 million of which approximately $31.1 million was attributable to U.S. and state net operating losses and domestic research and development credit carryforwards.\nWe apply ASC 740, Income Taxes, in determining any uncertain tax positions. The guidance seeks to reduce the diversity in practice associated with certain aspects of measurement and recognition in accounting for income taxes and prescribes a recognition threshold and measurement attribute for the financial statement recognition and measurement of a tax position that an entity takes or expects to take in a tax return. Additionally, ASC 740 provides guidance on de-recognition, classification, interest and penalties, accounting in interim periods, disclosure and transition. Under ASC 740, an entity may only recognize or continue to recognize tax positions that meet a “more likely than not” threshold. In accordance with our accounting policy, we recognize accrued interest and penalties related to unrecognized tax benefits as a component of other income (expense), net in the consolidated statements of operations.\nWe consider the earnings of certain non-U.S. subsidiaries to be indefinitely invested outside the United States, on the basis of estimates, that future domestic cash generation will be sufficient to meet future domestic cash needs and our specific plans for reinvestments of those subsidiary earnings. We have not recorded a deferred tax liability related to the U.S. state income taxes and foreign withholding taxes on approximately $18.7 million of undistributed earnings of foreign\nsubsidiaries indefinitely invested outside the United States. If we decide to repatriate the foreign earnings, we would need to adjust our income tax provision in the period we determined that the earnings will no longer be indefinitely invested outside the United States.\nFair Value of Financial Instruments\nOur financial instruments consist of cash and cash equivalents, restricted cash, accounts receivable, accounts payable and accrued liabilities. We do not have any derivative financial instruments. We believe the reported carrying amounts of these financial instruments approximate fair value, based upon their short-term nature and comparable market information available at the respective balance sheet dates.\nResults of Operations\nThe following table sets forth certain items reflected in our consolidated statements of operations expressed as a percent of total revenue for the periods indicated:\nRevenue:\nSubscription\n%\n%\nProfessional services\nTotal revenue\nCost of revenue:\nCost of subscription\nCost of professional services\nTotal cost of revenue\nGross profit\nOperating Expenses:\nResearch and development\nSales and marketing\nGeneral and administrative\nTotal operating expenses\nIncome from operations\n%\n%\nRevenue\nWe classify our revenue into two categories; subscription and professional services revenue. We further break down subscription revenue into SaaS revenue and legacy revenue, with SaaS revenue being a key metric.\nThe following table presents our subscription and professional services revenue during the fiscal years indicated:\nFiscal Year Ended June 30,\nChange\nRevenue\n(in thousands, except percentages)\nSubscription\n$\n72,371\n$\n66,129\n$\n6,242\n%\nProfessional services\n5,916\n6,600\n(684)\n(10)\n%\nTotal revenue\n$\n78,287\n$\n72,729\n$\n5,558\nTotal Revenue\nTotal revenue increased $5.6 million during the fiscal year ended June 30, 2021, from the comparable period in 2020, largely due to increased revenues from SaaS of $10.1 million in fiscal year 2021. This increase was partially offset by a decline in our legacy revenue as we continue to migrate legacy perpetual license customers to our SaaS model and a decline\nin professional service revenue as we continue to see a reduction in time required for an average implementation project, as a result of the improvements to our product deployment process.\nOur revenue was impacted by foreign exchange rate fluctuation between the U.S. Dollar, Euro, and British Pound. We recalculate our current period results using the comparable prior period exchange rates to exclude the impact of foreign exchange rate fluctuation. Foreign exchange rate fluctuation resulted in an increase of $2.0 million and a decrease of $722,000 in total revenue during the fiscal years ended June 30, 2021 and 2020, respectively.\nSubscription Revenue\nSaaS Revenue\nFiscal Year Ended June 30,\nChange\nRevenue\n(in thousands, except percentages)\nSaaS revenue\n$\n66,929\n$\n56,793\n$\n10,136\n%\nPercentage of total revenue\n%\n%\nSaaS revenue includes revenue from cloud delivery arrangements, term licenses and embedded OEM royalties and associated support. Revenues from SaaS increased by $10.1 million during the fiscal year ended June 30, 2021, as compared to the comparable period in 2020.\nSaaS revenue was $66.9 million and $56.8 million during the fiscal years ended June 30, 2021 and 2020, respectively, which represented an increase of 18% or $10.1 million. SaaS revenue represents 85% and 78% of total revenue for the fiscal years ended June 30, 2021 and 2020, respectively.\nExcluding an increase of $1.3 million due to foreign exchange rate fluctuation, SaaS revenue increased by $8.8 million during the fiscal year ended June 30, 2021, as compared to the comparable period in 2020. In connection with our SaaS transition, we are actively migrating our remaining perpetual license clients to SaaS and continue to sell SaaS to new customers. We expect our SaaS revenue to increase in future periods.\nLegacy Revenue\nFiscal Year Ended June 30,\nChange\nRevenue\n(in thousands, except percentages)\nLegacy revenue\n$\n5,442\n$\n9,336\n$\n(3,894)\n(42)\n%\nPercentage of total revenue\n%\n%\nLegacy revenue is associated with license, maintenance and support contracts on perpetual license arrangements that we no longer sell. We experienced a decrease of $3.9 million for the fiscal year ended June 30, 2021. This decrease was primarily due to our focus on migrating our legacy customers to SaaS. We expect these legacy fees to continue to decline in future periods.\nLegacy revenue was $5.4 million and $9.3 million during the fiscal years ended June 30, 2021 and 2020, respectively, which represented a decrease of 42% or $3.9 million. Legacy revenue represents 7% and 13% of total revenue for the fiscal years ended June 30, 2021 and 2020, respectively.\nExcluding an increase of $433,000 due to foreign exchange rate fluctuation, legacy revenue decreased by $4.3 million during the fiscal year ended June 30, 2021, as compared to the comparable period in 2020.\nProfessional Services Revenue\nFiscal Year Ended June 30,\nChange\nRevenue\n(in thousands, except percentages)\nProfessional services revenue\n$\n5,916\n$\n6,600\n$\n(684)\n(10)\n%\nPercentage of total revenue\n%\n%\nProfessional services revenue includes consulting, implementation and training. Revenues from professional services decreased by $684,000 during the fiscal year ended June 30, 2021. These decreases were primarily due to continued improvements in our product deployment process resulting in a reduction in the time required for an average implementation project. As we continue to onboard new customers and migrate legacy customers to SaaS, we expect the time required for product deployment and implementation projects to decrease further.\nProfessional services revenue was $5.9 million during the fiscal year ended June 30, 2021, which represented a decrease of 10% or $684,000. Professional services revenue represents 8% and 9% of total revenue for the fiscal years ended June 30, 2021 and 2020, respectively.\nExcluding an increase of $204,000 due to foreign exchange rate fluctuation, professional services revenues decreased by $888,000 during the fiscal year ended June 30, 2021, as compared to the comparable period in 2020.\nRevenue by Geography\nFiscal Year Ended June 30,\nChange\nRevenue\n(in thousands, except percentages)\nDomestic\n$\n54,380\n$\n44,813\n$\n9,568\n%\nInternational\n23,907\n27,916\n(4,009)\n(14)\n%\nTotal revenue\n$\n78,287\n$\n72,729\n$\n5,558\nRevenue from domestic sales increased by 21% from $44.8 million during the fiscal year ended June 30, 2020 to $54.4 million during the fiscal year ended June 30, 2021 due to increases of (i) $8.4 million in SaaS revenue, (ii) $885,000 in legacy revenue, and (iii) $322,000 in professional service revenue.\nRevenue from international sales decreased by 14% from $27.9 million during the fiscal year ended June 30, 2020 to $23.9 million during the fiscal year ended June 30, 2021 due to decreases of (i) $4.8 million in legacy revenue and (ii) $1.0 million in professional services revenue; offset by an increase of $1.8 million in SaaS revenue.\nCost of Revenue\nFiscal Year Ended June 30,\nChange\nCost of revenue\n(in thousands, except percentages)\nSubscription\n$\n13,507\n$\n14,398\n$\n(891)\n(6)\n%\nProfessional services\n5,760\n6,683\n(923)\n(14)\n%\nTotal cost of revenue\n$\n19,267\n$\n21,081\n$\n(1,814)\nPercentage of total revenue\n%\n%\nGross margin\n%\n%\nSubscription\nCost of subscription revenues consist primarily of expenses related to our cloud services and support provided to customers. These expenses are comprised of cloud computing costs, personnel-related costs directly associated with cloud operations, and customer support, including salaries, benefits, bonuses and stock-based compensation and allocated overhead.\nCost of subscription revenues decreased by $891,000 during the fiscal year ended June 30, 2021. The decrease is primarily due to a decrease in (i) personnel related costs of $609,000, (ii) cloud computing cost of $344,000 and (iii) intangible asset amortization of $242,000, partially offset with an increase in outside consulting cost of $173,000 during the fiscal year ended June 30, 2021, from the comparable period in 2020.\nExcluding an increase of $131,000 due to foreign exchange rate fluctuation, cost of subscription revenues decreased by $1.0 million during the fiscal year ended June 30, 2021, from the comparable period in 2020. Excluding any future foreign exchange rate fluctuation, we expect our cost of subscription revenue to increase in absolute dollar terms as revenues increase but expect subscription revenue gross margins to improve or remain relatively consistent.\nProfessional Services\nCost of professional services consists primarily of personnel-related costs directly associated with our professional services and training departments, including salaries, benefits, bonuses, and stock-based compensation and allocated overhead.\nCost of professional services decreased $923,000 during the fiscal year ended June 30, 2021 from the comparable period in 2020. This decrease is primarily due to a decrease in personnel-related costs of $902,000 and outside consulting costs of $158,000 for the fiscal year ended June 30, 2021.\nExcluding an increase of $137,000 due to foreign exchange rate fluctuation, cost of professional services revenue decreased by $1.1 million for the fiscal year ended June 30, 2021, from the comparable period in 2020.\nOperating Expenses\nResearch and Development\nFiscal Year Ended June 30,\nChange\n(in thousands, except percentages)\nResearch and development\n$\n17,933\n$\n16,638\n$\n1,295\n%\nPercentage of total revenue\n%\n%\nResearch and development expense primarily consists of personnel-related expenses directly associated with our engineering, product management and development, and quality assurance staff. Included in these costs are salaries, benefits, bonuses, stock-based compensation and allocated overhead. Research and development expense also includes outside consulting services contracted for research and development, and amortization of intangible assets.\nResearch and development expense increased 8% to $17.9 million during the fiscal year ended June 30, 2021, from $16.6 million in the comparable period in 2020. Excluding an increase of $195,000 due to foreign exchange rate fluctuation between the U.S. Dollar, Euro, British Pound and Indian Rupee, research and development expense increased primarily due to an increase of $1.4 million in personnel-related costs; partially offset by a decrease of $277,000 in outside consulting costs.\nExcluding any future foreign exchange rate fluctuation, we expect our research and development expense to increase in future periods based on our product development plans.\nSales and Marketing\nFiscal Year Ended June 30,\nChange\n(in thousands, except percentages)\nSales and marketing\n$\n25,999\n$\n19,623\n$\n6,376\n%\nPercentage of total revenue\n%\n%\nSales and marketing expense primarily consists of personnel-related expenses directly associated with our sales, marketing, and business development staff. Included in these costs are salaries, benefits, bonuses, and stock-based compensation and allocated overhead. Sales and marketing expenses also include amortization of commissions paid to our sales staff, lead generation activities, advertising, trade show and other promotional costs and, to a lesser extent, occupancy costs and related overhead.\nSales and marketing expenses increased 32% to $26.0 million during the fiscal year ended June 30, 2021, from $19.6 million in the comparable period in 2020. Excluding an increase of $423,000 due to foreign exchange rate fluctuation between the U.S. Dollar, Euro, British Pound and Indian Rupee, sales and marketing expense increased primarily due to increases of (i) $6.2 million in personnel-related costs and (ii) $16,000 outside consulting services; partially offset by a decrease of $257,000 in marketing program costs.\nExcluding any future foreign exchange rate fluctuation, we expect our sales and marketing expense to increase as a percentage of total revenue in future quarters based on our current business plan.\nGeneral and Administrative\nFiscal Year Ended June 30,\nChange\n(in thousands, except percentages)\nGeneral and administrative\n$\n7,749\n$\n7,981\n$\n(232)\n(3)\n%\nPercentage of total revenue\n%\n%\nGeneral and administrative expense primarily consists of personnel-related expenses directly associated with our finance, human resources, administrative and legal personnel. Included in these costs are salaries, benefits, bonuses, and stock-based compensation and allocated overhead. General and administrative expenses also include fees for professional services, provision for doubtful accounts and, to a lesser extent, occupancy costs and related overhead.\nGeneral and administrative expense decreased 3% to $7.7 million during the fiscal year ended June 30, 2021, from $8.0 million in the comparable period in 2020. Excluding an increase of $131,000 due to foreign exchange rate fluctuation between the U.S. Dollar, Euro, British Pound and Indian Rupee, general and administrative expense decreased primarily due to decreases of (i) $349,000 in personnel-related expenses; (ii) $108,000 in accounting, audit, and administrative expenses; (iii) $106,000 in legal expenses; partially offset by increases of (a) $90,000 in outside consulting costs; (b) $69,000 in bad debt expenses; and (c) $42,000 in investor relations expense.\nExcluding any future foreign exchange rate fluctuation, we expect our general and administrative expense to increase or remain relatively consistent as a percentage of total revenue in future periods based on our current business plan.\nStock-Based Compensation\nStock-based compensation expense is accounted for in accordance with the provisions of the accounting guidance which requires the measurement and recognition of compensation expense for all equity-based payment awards made to employees, members of our board of directors and consultants, based upon the grant-date fair value of those awards. We value our share-based payments under ASC 718, and record compensation expense for all share-based payments made to employees based on the fair value at the date of the grant.\nThe effect of recording stock-based compensation for fiscal year 2021 and 2020 is as follows:\nFiscal Year Ended June 30,\nStock-based compensation by type of award\n(in thousands)\nStock options\n$\n1,227\n$\n1,567\nEmployee stock purchase plan\nTotal stock-based compensation\n$\n1,700\n$\n1,861\nDetermining the fair value of the equity-based payment awards at the grant date required significant judgment and the use of estimates, particularly surrounding the Black-Scholes valuation assumptions such as stock price volatility and expected option term.\nBelow is a summary of stock-based compensation included in the cost and expenses:\nFiscal Year Ended June 30,\nChange\n(in thousands, except percentages)\nCost of revenue\n$\n$\n$\n%\nResearch and development\n(198)\n(28)\n%\nSales and marketing\n%\nGeneral and administrative\n(191)\n(48)\n%\nTotal stock-based compensation\n$\n1,700\n$\n1,861\n$\n(161)\n(9)\n%\nThe increase in our stock-based compensation expense in fiscal year 2021 compared to fiscal year 2020 was primarily due to an increase in option grant activity.\nWe expect our stock-based compensation expense to increase in fiscal year 2022.\nIncome from Operations\nFiscal Year Ended June 30,\nChange\n(in thousands, except percentages)\nIncome from operations\n$\n7,339\n$\n7,406\n$\n(67)\nOperating margin\n%\n%\nResults from operations was income of $7.3 million in fiscal year 2021, compared to $7.4 million in fiscal year 2020. We recorded a positive operating margin of 9% in fiscal year 2021, and 10% in fiscal year 2020.\nThe increase in operating income in fiscal year 2021 was primarily due to the growth of our cloud delivery business and improvement in our gross margins. During the fiscal year ended June 30, 2021, SaaS revenue increased by $10.1 million to $66.9 million compared to $56.8 million in fiscal year 2020.\nExcluding a decrease from foreign exchange fluctuation of $1.0 million the increase in total costs and operating expenses in fiscal year 2021 was primarily due to increases of (i) $5.7 million in personnel-related expenses; (ii) $69,000 in bad debt expenses; and (iii) $42,000 in investor relations cost; partially offset by a decrease of (a) $344,000 in cloud computing costs; (b) $258,000 in marketing costs; (c) $242,000 in intangible asset amortization; (d) $156,000 in outside consulting costs; (e) $108,000 in accounting, audit and administrative services and; (f) $106,000 in legal expenses.\nInterest Income, Net\nInterest income, net consists primarily of interest earned on money market funds. Interest income, net was income of $13,000 and $395,000 in the fiscal years ended June 30, 2021 and 2020, respectively. We expect interest income to remain relatively constant in future periods.\nOther (Expense) Income, Net\nOther (expense) income, net was expense of $559,000 and income of $185,000 for the fiscal years ended June 30, 2021 and 2020, respectively. Other (expense) income, net primarily included foreign exchange rate fluctuations on international trade receivables.\nIncome Tax Provision\nProvision for income taxes consists of federal, state and foreign income taxes. Due to the current economic state of the U.S. economy, expiring tax attributes and uncertainty of future profitability, we maintain a valuation allowance against U.S. deferred tax assets as of June 30, 2021. We consider all available evidence, both positive and negative, including but not limited to earnings history, projected future outcomes, industry and market trends and the nature of each of the deferred tax assets. We recorded an income tax benefit of $166,000 and an income tax provision of $778,000 in the fiscal years ended June 30, 2021 and 2020, respectively.\nNew Accounting Pronouncements\nFor information with respect to recent accounting pronouncements and the impact of these pronouncements on our consolidated financial statements, see Note 1 of Notes to Consolidated Financial Statements included in Item 8 Financial Statements and Supplementary Data of this Annual Report.\nLiquidity and Capital Resources\nOverview\nAt June 30, 2021, our principal sources of liquidity were cash and cash equivalents, and accounts receivable totaling $89.5 million. Our cash, cash equivalents and restricted cash were $63.2 million and $46.6 million as of June 30, 2021 and 2020, respectively.\nOur working capital was $31.1 million as of June 30, 2021 compared to $21.4 million as of June 30, 2020. As of June 30, 2021, our deferred revenue was $49.5 million as compared to $41.5 million as of June 30, 2020.\nBased upon our current business plan, we believe that existing capital resources will enable us to maintain current and planned operations for at least the next 12 months. From time to time, however, we may consider opportunities for raising additional capital. We can make no assurances that such opportunities will be available to us on economic terms we consider favorable, if at all.\nOur expectations as to our future cash flows and our future cash balances are subject to a number of assumptions, including assumptions regarding anticipated increases in our revenue, our ability to retain existing customers and customer purchasing and payment patterns, many of which are beyond our control.\nCash Flows\nFor the fiscal years ended June 30, 2021 and 2020, our cash flows were as follows (in thousands):\nFiscal Year Ended June 30,\nNet cash provided by operating activities\n$\n13,862\n$\n14,058\nNet cash used in investing activities\n(402)\n(514)\nNet cash provided by financing activities\n2,352\n1,410\nCash provided by operating activities mainly consists of net income adjusted for non-cash expense items such as depreciation and amortization, expense associated with stock-based awards, the timing of employee related costs including costs capitalized to obtain revenue contracts, amortization of right-of-use assets, and changes in operating assets and liabilities during the year.\nCash provided by operating activities decreased by $196,000 during the fiscal year ended June 30, 2021, driven primarily by the timing of prepayments received from customers for new cloud arrangements and the renewal of existing cloud and support arrangements, which is our largest source of operating cash flows, as well as higher net income.\nNet cash used in investing activities increased by $112,000 during the fiscal year ended June 30, 2021, driven primarily by activities related to the purchase of equipment for new employees and facility expenditures. Historically, cash used in investing activities has been used to purchase equipment and software to support our business and growth.\nNet cash provided by financing activities increased by $942,000 during the fiscal year ended June 30, 2021, principally consisted of proceeds from employee stock plans.\nCommitments\nOur principal commitments consist of obligations under leases for office space. Lease agreements are evaluated to determine whether an arrangement is or contains a lease in accordance with ASC 842, Leases.\nThe following table summarizes our contractual obligations as of June 30, 2021 and the effect such obligations are expected to have on its liquidity and cash flow in future periods (in thousands):\nPayments Due by Period\nTotal\nLess than 1 Year\n1 - 3 Years\n3 - 5 Years\nMore than 5 Years\nOperating leases\n2,353\n1,530\n-\n-\nTotal\n$\n2,353\n$\n1,530\n$\n$\n-\n$\n-\nOff-Balance Sheet Arrangements\nAs of June 30, 2021, we had no significant off-balance sheet arrangements as defined in Item 303(a)(4) of Regulation S-K.",
    "item_7A": "ITEM 7A.\nQUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nForeign Currency Exchange Risk\nWe develop products in the United States and India and sell these products in the United States and internationally. Generally, international sales are made in local currency. As a result, our financial results could be affected by factors such as changes in foreign currency exchange rates or weak economic conditions in foreign markets. Identifiable assets denominated in foreign currency as of June 30, 2021 and 2020 totaled approximately $24.6 million and $17.7 million, respectively. A 10% increase in the value of the dollar relative to other currencies would decrease the value of these assets by $2.5 million and $1.8 million, as of June 30, 2021 and 2020, respectively. We do not currently use derivative instruments to hedge against foreign exchange risk. As such we are exposed to market risk from fluctuations in foreign currency exchange rates, principally from the exchange rate between the U.S. dollar and the Euro, the British pound and the Indian rupee. An unfavorable change in the foreign currency exchange rates may cause an adverse effect on our financial position or results of operations.\nInterest Rate Risk\nOur exposure to market risk for changes in interest rates relates primarily to interest earned on our cash and cash equivalents. The primary objective of our investment activities is to preserve our capital to fund operations. We also seek to maximize income from our investments without assuming significant risk. Our investment policy provides for investments in short-term, low-risk, investment-grade debt instruments. These investments are subject to interest rate risk and will decrease in value if market interest rates increase.\nWe currently do not hedge interest rate exposure, and we do not have any foreign currency or other derivative financial instruments. To date, we have not experienced a loss of principal on any of our investments. Although we currently expect that our ability to access or liquidate these investments as needed to support our business activities will continue, we cannot ensure that this will not change. We believe that, if market interest rates were to change immediately and uniformly by 10% from levels as of June 30, 2021 and 2020, the impact on the fair value of these securities or our cash flows or income would not be material.",
    "item_8": "ITEM 8.\nFINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\neGain Corporation\nConsolidated Financial Statements\nAs of June 30, 2021 and 2020 and for the years ended June 30, 2021 and 2020\nIndex to Consolidated Financial Statements\nPage\nNumber\nReport of BPM LLP, Independent Registered Public Accounting Firm\nConsolidated Financial Statements:\nConsolidated Balance Sheets as of June 30, 2021 and 2020\nConsolidated Statements of Operations for the years ended June 30, 2021 and 2020\nConsolidated Statements of Comprehensive Income for the years ended June 30, 2021 and 2020\nConsolidated Statements of Stockholders’ Equity for the years ended June 30, 2021 and 2020\nConsolidated Statements of Cash Flows for the years ended June 30, 2021 and 2020\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nBoard of Directors and Stockholders\neGain Corporation\nSunnyvale, California\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of eGain Corporation and subsidiaries (the “Company”) as of June 30, 2021 and 2020, and the related consolidated statements of operations, comprehensive income, stockholders’ equity, and cash flows for each of the two years in the period ended June 30, 2021 and the related notes and financial statement schedule listed in the index to this Annual Report on Form 10-K at Part IV Item 15(a)(2) (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the consolidated financial position of the Company as of June 30, 2021 and 2020, and the consolidated results of its operations and its cash flows for each of the two years in the period ended June 30, 2021, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Company's internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenue Recognition\nAs described in Note 1 to the consolidated financial statements, the Company recognizes revenue upon transfer of control of promised services to customers in an amount that reflects the consideration the Company expects to receive in exchange for those services. The Company enters into contracts with its customers that may include promises to transfer cloud delivery arrangements, term software licenses, support and professional services. Significant judgment may be required by the Company in determining revenue recognition for these customer agreements, including the determination of\nwhether products and services are considered distinct performance obligations that should be accounted for separately or combined as one unit of accounting and the determination of standalone selling prices (“SSP”) for each distinct performance, particularly for services that are not sold separately.\nThe principal audit considerations for our determination that performing procedures related to the Company’s revenue recognition for customer agreements is a critical audit matter are the significant amount of judgment required by management in this process. Significant judgment is required in determining SSP, including the determination of whether services are considered distinct performance obligations that should be accounted for separately or combined as one unit of accounting and the determination of SSP for each distinct performance obligation, particularly for services that are not sold separately.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of internal controls relating to the revenue recognition process, including internal controls related to the identification of distinct performance obligations and data used to establish SSP for products and services. These procedures also included reviewing executed contracts for a sample of revenue transactions to assess management’s evaluation of significant terms, including the determination of distinct performance obligations, and testing the amounts recognized as revenue or recorded as deferred revenue. In addition, we tested management’s determination of SSP by performing audit procedures that included, among others, assessing the appropriateness of the methodology applied, testing the mathematical accuracy of the underlying data and calculations, and testing selections to corroborate the data underlying the Company’s calculations.\n/s/ BPM LLP\nWe have served as the Company’s auditor since 2008.\nSan Jose, California\nSeptember 10, 2021\nEGAIN CORPORATION\nCONSOLIDATED BALANCE SHEETS\n(in thousands, except per share amounts)\nJune 30,\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n63,231\n$\n46,609\nRestricted cash\nAccounts receivable, less allowance for doubtful accounts of $434 and $384 as of June 30, 2021 and 2020, respectively\n26,311\n22,708\nCosts capitalized to obtain revenue contracts, net\n1,323\n1,066\nPrepaid expenses\n3,028\n2,514\nOther current assets\nTotal current assets\n94,678\n73,520\nProperty and equipment, net\nOperating lease right-of-use assets\n2,191\n2,962\nCosts capitalized to obtain revenue contracts, net of current portion\n2,612\n2,380\nIntangible assets, net\n-\nGoodwill\n13,186\n13,186\nOther assets, net\n1,191\nTotal assets\n$\n114,563\n$\n93,705\nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent liabilities:\nAccounts payable\n$\n3,068\n$\n2,429\nAccrued compensation\n8,444\n7,916\nAccrued liabilities\n4,352\n3,423\nOperating lease liabilities\n1,466\n1,753\nDeferred revenue\n46,211\n36,644\nTotal current liabilities\n63,541\n52,165\nDeferred revenue, net of current portion\n3,332\n4,826\nOperating lease liabilities, net of current portion\n1,385\nOther long-term liabilities\nTotal liabilities\n68,502\n59,064\nCommitments and contingencies (Note 8 and 9)\nStockholders' equity:\nCommon stock, $0.001 par value - authorized: 50,000 shares; outstanding: 31,231 and 30,821 shares as of June 30, 2021 and 2020, respectively\nAdditional paid-in capital\n378,451\n374,399\nNotes receivable from stockholders\n(92)\n(90)\nAccumulated other comprehensive loss\n(1,220)\n(1,631)\nAccumulated deficit\n(331,109)\n(338,068)\nTotal stockholders' equity\n46,061\n34,641\nTotal liabilities and stockholders' equity\n$\n114,563\n$\n93,705\nThe accompanying notes are an integral part of these consolidated financial statements.\nEGAIN CORPORATION\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(in thousands, except per share information)\nYears Ended June 30,\nRevenue:\nSubscription\n$\n72,371\n$\n66,129\nProfessional services\n5,916\n6,600\nTotal revenue\n78,287\n72,729\nCost of revenue:\nCost of subscription\n13,507\n14,398\nCost of professional services\n5,760\n6,683\nTotal cost of revenue\n19,267\n21,081\nGross profit\n59,020\n51,648\nOperating expenses:\nSales and marketing\n25,999\n19,623\nResearch and development\n17,933\n16,638\nGeneral and administrative\n7,749\n7,981\nTotal operating expenses\n51,681\n44,242\nIncome from operations\n7,339\n7,406\nInterest income, net\nOther (expense) income, net\n(559)\nIncome before income tax provision\n6,793\n7,986\nIncome tax benefit (provision)\n(778)\nNet income\n$\n6,959\n$\n7,208\nPer share information:\nEarnings per share:\nBasic\n$\n0.22\n$\n0.24\nDiluted\n$\n0.21\n$\n0.23\nWeighted-average shares used in computation:\nBasic\n$\n31,007\n$\n30,620\nDiluted\n$\n32,597\n$\n31,956\nBelow is a summary of stock-based compensation included in the costs and expenses above:\nCost of revenue\n$\n$\nResearch and development\n$\n$\nSales and marketing\n$\n$\nGeneral and administrative\n$\n$\nThe accompanying notes are an integral part of these consolidated financial statements.\nEGAIN CORPORATION\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(in thousands)\nYears Ended June 30,\nNet income\n$\n6,959\n$\n7,208\nOther comprehensive income, net of taxes:\nForeign currency translation adjustments\n(172)\nTotal comprehensive income\n$\n7,370\n$\n7,036\nThe accompanying notes are an integral part of these consolidated financial statements.\nEGAIN CORPORATION\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\n(in thousands)\nNotes\nAccumulated\nAdditional\nReceivable\nOther\nTotal\nCommon Stock\nPaid-in\nFrom\nComprehensive\nAccumulated\nStockholders'\nShares\nAmount\nCapital\nStockholders\nLoss\nDeficit\nEquity\nBALANCES AS OF JULY 1, 2019\n30,478\n371,099\n(88)\n(1,459)\n(345,276)\n24,307\nInterest on stockholders' notes\n-\n-\n-\n(2)\n-\n-\n(2)\nIssuance of common stock upon exercise of stock options\n-\n-\n-\n-\nIssuance of common stock in connection with employee stock purchase plan\n-\n-\n-\n-\nTrue-up of issuance costs related to public offering\n-\n-\n-\n-\n-\nStock-based compensation\n-\n-\n1,861\n-\n-\n-\n1,861\nForeign currency translation adjustments\n-\n-\n-\n-\n(172)\n-\n(172)\nNet income\n-\n-\n-\n-\n-\n7,208\n7,208\nBALANCES AS OF JUNE 30, 2020\n30,821\n374,399\n(90)\n(1,631)\n(338,068)\n34,641\nInterest on stockholders' notes\n-\n-\n-\n(2)\n-\n-\n(2)\nIssuance of common stock upon exercise of stock options\n-\n1,221\n-\n-\n-\n1,221\nIssuance of common stock in connection with employee stock purchase plan\n-\n1,131\n-\n-\n-\n1,131\nStock-based compensation\n-\n-\n1,700\n-\n-\n-\n1,700\nForeign currency translation adjustments\n-\n-\n-\n-\n-\nNet income\n-\n-\n-\n-\n-\n6,959\n6,959\nBALANCES AS OF JUNE 30, 2021\n31,231\n$\n$\n378,451\n$\n(92)\n$\n(1,220)\n$\n(331,109)\n$\n46,061\nThe accompanying notes are an integral part of these consolidated financial statements.\nEGAIN CORPORATION\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in thousands)\nYears Ended June 30,\nCash flows from operating activities:\nNet income\n$\n6,959\n$\n7,208\nAdjustments to reconcile net income to net cash provided by operating activities:\nAmortization of intangible assets\nAmortization of costs capitalized to obtain revenue contracts\n1,212\nAmortization of right-of-use assets\n1,635\n1,540\nDepreciation and amortization\nProvision for doubtful accounts\nDeferred income taxes\n(341)\nStock-based compensation\n1,700\n1,861\nGain on disposal of property and equipment\n(1)\n(1)\nChanges in operating assets and liabilities:\nAccounts receivable\n(2,767)\n(2,882)\nCosts capitalized to obtain revenue contracts\n(1,536)\n(1,812)\nPrepaid expenses\n(483)\n(122)\nOther current assets\n(151)\nOther non-current assets\nAccounts payable\n(1,740)\nAccrued compensation\n2,525\nAccrued liabilities\n1,105\nDeferred revenue\n6,682\n5,272\nOperating lease liabilities\n(1,726)\n(1,640)\nOther long-term liabilities\nNet cash provided by operating activities\n13,862\n14,058\nCash flows from investing activities:\nPurchases of property and equipment\n(402)\n(514)\nNet cash used in investing activities\n(402)\n(514)\nCash flows from financing activities:\nPayments on bank borrowings\n-\n(31)\nProceeds from bank borrowings\n-\nProceeds from exercise of stock options\n1,221\nProceeds from employee stock purchase plan\n1,131\nNet cash provided by financing activities\n2,352\n1,410\nEffect of exchange rate differences on cash and cash equivalents\n(206)\nNet increase in cash, cash equivalents and restricted cash\n16,623\n14,748\nCash, cash equivalents and restricted cash at beginning of year\n46,615\n31,867\nCash, cash equivalents and restricted cash at end of year\n$\n63,238\n$\n46,615\nSupplemental cash flow disclosures:\nCash paid for interest\n$\n-\n$\nCash paid for taxes\n$\n$\nROU assets and lease liabilities recognized from lease modification\n$\n$\n-\nNon-cash items:\nPurchases of equipment through trade accounts payable\n$\n-\n$\nThe accompanying notes are an integral part of these consolidated financial statements.\nEGAIN CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1. SUMMARY OF BUSINESS AND SIGNIFICANT ACCOUNTING POLICIES\nOrganization and Nature of Business\neGain Corporation (“eGain”, the “Company”, “our”, “we” or “us”) automates customer engagement with an innovative Software as a service (SaaS) platform, powered by deep digital, Artificial intelligence (AI), and knowledge capabilities. We are headquartered in the United States. We also operate in United Kingdom and India. We sell mostly to large enterprises across financial services, telecommunications, retail, government, healthcare, and utilities. With our mantra of AX + BX + CX = DX™, we guide clients to effortless digital experience (DX) by holistically optimizing agent experience (AX), business experience (BX) and customer experience (CX). More than one hundred eighty leading brands use eGain cloud software to improve customer satisfaction, empower agents, reduce service cost and boost sales.\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of eGain and our wholly-owned subsidiaries, eGain Communications Ltd., Exony Limited (Exony), eGain Communications Pvt. Ltd., eGain Communications (SA), eGain France S.A.R.L, Netherlands (eGain Communications B.V.) and eGain Deutschland GmbH. All significant intercompany balances and transactions have been eliminated.\nBusiness Combinations\nBusiness combinations are accounted for at fair value under the purchase method of accounting. Acquisition costs are expensed as incurred and recorded in general and administrative expenses and changes in deferred tax asset valuation allowances and income tax uncertainties after the acquisition date affect income tax expense. The accounting for business combinations requires estimates and judgment as to expectations for future cash flows of the acquired business, and the allocation of those cash flows to identifiable intangible assets, in determining the estimated fair value for assets acquired and liabilities assumed. The fair values assigned to tangible and intangible assets acquired and liabilities assumed are based on management’s estimates and assumptions, as well as other information compiled by management, including valuations that utilize customary valuation procedures and techniques. If the actual results differ from the estimates and judgments used in these estimates, the amounts recorded in the consolidated financial statements could result in a possible impairment of the intangible assets and goodwill, or require acceleration of the amortization expense of finite-lived intangible assets.\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenue and expenses during the reporting period. The estimates are based upon information available as of the date of the consolidated financial statements. Actual results could differ from those estimates.\nWe evaluate our significant estimates, including those related to revenue recognition, provision for doubtful accounts, valuation of stock-based compensation, valuation of long-lived assets, valuation of deferred tax assets, and litigation, among others. We base our estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. We refer to accounting estimates of this type as “critical accounting estimates.”\nForeign Currency\nThe functional currency of each of our international subsidiaries is the local currency of the country in which it operates. Assets and liabilities of our foreign subsidiaries are translated at month-end exchange rates, and revenue and expenses are translated at the average monthly exchange rates. The resulting cumulative translation adjustments are recorded as a component of accumulated other comprehensive income. Foreign currency transaction gains and losses are included in “other (expense) income, net” in the consolidated statements of operations, and resulted in a gain of $570,000 and a loss of $172,000, in fiscal years ended June 30, 2021 and 2020, respectively.\nCash and Cash Equivalents, Restricted Cash and Investments\nWe consider all highly liquid investments with an original purchase to maturity date of three months or less to be cash equivalents. Time deposits held for investments that are not debt securities are included in short-term investments in the consolidated balance sheets. Investments in time deposits with original maturities of more than three months but remaining maturities of less than one year are considered short-term investments. Investments held with the intent to reinvest or hold for longer than a year, or with remaining maturities of one year or more, are considered long-term investments. As of June 30, 2021 and 2020 we did not have any short-term or long-term investments.\nCash earmarked for a specific purpose and therefore not available for immediate and general use by the Company is considered restricted cash. Expected usage of restricted cash within one year is classified as a current asset; expected usage more than a year is considered a non-current asset. As of June 30, 2021 and 2020, our restricted cash was nominal and expected to be used within one year.\nFair Value of Financial Instruments\nOur financial instruments consist of cash and cash equivalents, restricted cash, accounts receivable, accounts payable and accrued liabilities. We do not have any derivative financial instruments. We believe the reported carrying amounts of these financial instruments approximate fair value, based upon their short-term nature and comparable market information available at the respective balance sheet dates.\nConcentration of Credit Risk\nFinancial instruments that subject us to concentrations of credit risk consist principally of cash and cash equivalents and trade accounts receivable. Cash and cash equivalents are deposited with high credit quality institutions. We are exposed to credit risk in the event of default by these institutions to the extent of the amount recorded on the balance sheet. We invest excess cash primarily in money market funds, which are highly liquid securities that bear minimal risk. In addition, we have investment policies and procedures that are reviewed periodically to minimize credit risk. Our cash, cash equivalents and restricted cash were $63.2 million as of June 30, 2021 and exceeded the FDIC (Federal Deposit Insurance Corporation) limits.\nOur customer base extends across many different industries and geographic regions. Revenue is allocated to individual countries and geographic region by customer, based on where the product is shipped to and location of services performed. Cisco Systems, Inc. accounted for 21% and 18% of total revenue and BT PLC accounted for 13% and 10% of total revenue in fiscal years 2021 and 2020, respectively.\nWe perform ongoing credit evaluations of our customers with outstanding receivables and generally do not require collateral. In addition, we established an allowance for doubtful accounts based upon factors surrounding the credit risk of customers, historical trends and other information. Three partners and customers accounted for 30%, 17%, and 16% of accounts receivable as of June 30, 2021, respectively. Two partners and customers accounted for 23% and 18% of accounts receivable as of June 30, 2020.\nAccounts Receivable and Allowance for Doubtful Accounts\nWe extend unsecured credit to our customers on a regular basis. Our accounts receivable are derived from revenue earned from customers and are not interest bearing. We also maintain an allowance for doubtful accounts to reserve for potential\nuncollectible trade receivables. We review our trade receivables by aging category to identify specific customers with known disputes or collectibility issues. We exercise judgment when determining the adequacy of these reserves as we evaluate historical bad debt trends, general economic conditions in the U.S. and internationally, and changes in customer financial conditions. If we made different judgments or utilized different estimates, material differences may result in additional reserves for trade receivables, which would be reflected by charges in general and administrative expenses for any period presented. We write off a receivable after all collection efforts have been exhausted and the amount is deemed uncollectible.\nIn certain Company contracts, contractual billings do not coincide with revenue recognized on the contract. Unbilled accounts receivables are recorded when revenue recognized on the contract exceeds billings, pursuant to contract provisions, and become billable upon certain criteria being met. Unbilled accounts receivables, for which the Company has the unconditional right to consideration, totaled $719,000 and $1.4 million as of June 30, 2021 and 2020, respectively, and are included in the accounts receivable balance.\nProperty and Equipment, Net\nProperty and equipment, net, is stated at cost, net of accumulated depreciation and amortization. Depreciation is computed using the straight-line method over the estimated useful life of the respective assets, which typically is between three or five years. Leasehold improvements and leased equipment are depreciated on a straight-line basis over the shorter of the lease term or useful life of the asset, which is typically three to five years.\nGoodwill and Other Intangible Assets, Net\nWe review goodwill annually for impairment or sooner whenever events or changes in circumstances indicate that it may be impaired. These events or circumstances could include a significant change in the business climate, legal factors, operating performance indicators, competition, or sale or disposition of a significant portion of a reporting unit. In addition, we evaluate purchased intangible assets to determine that all such assets have determinable lives. We operate under a single reporting unit and accordingly, all of our goodwill is associated with the entire company. We had no impairment for fiscal years ended June 30, 2021 and 2020.\nImpairment of Long-Lived Assets\nWe review long-lived assets for impairment, including property and equipment, whenever events or changes in business circumstances indicate that the carrying amounts of the assets may not be fully recoverable. An impairment loss is recognized when estimated undiscounted future cash flows expected to result from the use of the asset and its eventual disposition is less than its carrying amount. During fiscal years 2021 and 2020, we did not have any such impairment losses.\nDeferred Revenue\nDeferred revenue primarily consists of payments received in advance of revenue recognition from cloud, term and ratable licenses, and maintenance and support services and is recognized as the revenue recognition criteria are met. We generally invoice customers in annual or quarterly installments. The deferred revenue balance does not represent the total contract value of annual or multi-year, non-cancelable cloud or maintenance and support agreements. Deferred revenue is influenced by several factors, including seasonality, the compounding effects of renewals, invoice duration, invoice timing and new business linearity within the quarter.\nDeferred revenue that will be recognized during the succeeding twelve-month period is recorded as current deferred revenue and the remaining portion is recorded as noncurrent.\nCost Capitalized to Obtain Revenue Contracts, Net\nUnder Topic 606, we capitalize incremental costs of obtaining non-cancelable subscription and support revenue contracts. The capitalized amounts consist primarily of sales commissions paid to our direct sales force. Capitalized amounts also include (i) amounts paid to employees other than the direct sales force who earn incentive payouts under annual\ncompensation plans that are tied to the value of contracts acquired and (ii) the associated payroll taxes and fringe benefit costs associated with the payments to our employees.\nCosts capitalized related to new revenue contracts are generally deferred and amortized on a straight-line basis over a period of benefit that we estimate to be five years. We determine the period of benefit by taking into consideration the historical and expected durations of our customer contracts, the expected useful lives of our technologies, and other factors. Commissions for renewal contracts relating to our cloud-based arrangements are expensed when incurred, as we do not consider renewal contracts to be commensurate with initial customer contracts. Historically, any commission associated with renewals have been immaterial. Amortization of costs to obtain revenue contracts is included as a component of sales and marketing expenses in our consolidated statements of operations.\nThe Company does not adjust transaction price for the effects of a significant financing component when the period between the transfers of the promised good or service to the customer and payment for that good or service by the customer is expected to be one year or less. The Company assessed each of its revenue contracts in order to determine whether a significant financing component exists, and determined its contracts did not include a significant financing component for the years ended June 30, 2021 and 2020.\nDuring the fiscal year ended June 30, 2021 and 2020, we capitalized $1.5 million and $1.8 million of costs to obtain revenue contracts, respectively, and amortized $1.2 million and $842,000 to sales and marketing expense, respectively. Capitalized costs to obtain revenue contracts, net were $3.9 million and $3.4 million as of June 30, 2021 and June 30, 2020, respectively.\nLeases\nLease agreements are evaluated to determine whether an arrangement is or contains a lease in accordance with ASC 842, Leases.\nOperating leases are included in operating lease right-of-use (ROU) assets, current operating lease liabilities, and noncurrent operating lease liabilities in the consolidated financial statements. ROU assets represent the Company’s right to use leased assets over the agreed upon term. Lease liabilities represent the Company’s contractual obligation to make lease payments over the lease term.\nFor operating leases, ROU assets and lease liabilities are recognized at the commencement date of the lease. The lease liability is measured as the present value of the lease payments over the lease term, using the rate implicit in the lease if readily determinable. If the rate implicit in the lease cannot be readily determined, the Company uses its incremental borrowing rate at lease commencement. The operating lease right-of-use assets are calculated as the present value of the remaining lease payments plus unamortized initial direct costs and any prepayments, less unamortized lease incentives received.\nOperating leases typically include non-lease components such as common-area maintenance costs. We have elected to include non-lease components with lease payments for the purpose of calculating lease right-of-use assets and liabilities, to the extent that they are fixed. Non-lease component payments that are not fixed are expensed as incurred as variable lease payments.\nLease terms may include renewal or extension options to the extent they are reasonably certain to be exercised. The assessment of whether renewal or extension options are reasonably certain to be exercised is made at lease commencement. Factors considered in determining whether an option is reasonably certain of exercise include, but are not limited to, the value of any leasehold improvements, the value of renewal rates compared to market rates, and the presence of factors that would cause a significant economic penalty to the Company if the option were not exercised. Lease expense is recognized on a straight-line basis over the lease term. The Company has elected not to recognize right-of-use assets and obligations for leases with an initial term of twelve months or less, and has applied a capitalization threshold to recognize a lease on\nthe balance sheet. The expense associated with short-term leases and leases that do not meet the Company’s capitalization threshold are recorded to lease expense in the period it is incurred.\nSoftware Development Costs\nWe account for software development costs in accordance with ASC 985, Software, for costs of the software to be sold, leased or marketed, whereby costs for the development of new software products and substantial enhancements to existing software products are included in research and development expense as incurred until technological feasibility has been established, at which time any additional costs are capitalized. Technological feasibility is established upon completion of a working model. To date, software development costs incurred in the period between achieving technological feasibility and general availability of software have not been material and have been charged to operations as incurred.\nAdvertising Costs\nWe expense advertising costs as incurred. Total advertising expenses for the fiscal years ended June 30, 2021 and 2020 were $190,000 and $221,000, respectively.\nStock-Based Compensation\nWe account for stock-based compensation in accordance with ASC 718, Compensation-Stock Compensation. Determining the fair value of the stock-based awards at the grant date requires significant judgment and the use of estimates, particularly surrounding Black-Scholes valuation assumptions such as stock price volatility and expected option term. Stock-based compensation expense for employee and non-employee awards is recognized as expense over the requisite service period, which is generally in line with the vesting period.\nIncome Taxes\nIncome taxes are accounted for using the asset and liability method in accordance with ASC 740, Income Taxes. Under this method, deferred tax liabilities and assets are recognized for the estimated future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. For the legacy eGain business in the United States, based upon the weight of available evidence, which includes our historical operating performance, our future investment plans, and the uncertainty in the current market environment due to COVID-19, we have provided a full valuation allowance against our net deferred tax assets. For the legacy eGain business in the United Kingdom, based on the positive evidence, the Company has determined it would be able to utilize the deferred tax assets and does not have a valuation allowance against the deferred tax assets. The remaining eGain foreign operations as well as Exony’s business have historically been profitable and we believe it is more likely than not that those assets will be realized. Our tax provision primarily relates to foreign activities as well as state income taxes. Our income tax rate differs from the statutory tax rates primarily due to the utilization of net operating loss carry-forwards which had previously been valued against as well as our foreign operations.\nOn December 22, 2017, the U.S. government enacted comprehensive tax legislation commonly referred to as the Tax Cuts and Jobs Act (Tax Act). The Tax Act revised the taxation of U.S. and multinational corporations which significantly reduced the statutory corporate U.S. federal income tax rate from 35% to 21%, imposed limitations on the ability of corporations to deduct interest expense and made taxation changes on U.S. multinational corporation’s foreign operations. The provisions of the Tax Act are complex and likely will be subject to regulatory and administrative guidance. The Tax Act includes a provision to tax global intangible low-taxed income (GILTI) of foreign subsidiaries and a base erosion anti-abuse tax (BEAT) measure that taxes certain payments between a U.S. corporation and its foreign subsidiaries. For the fiscal year ended June 30, 2021, we have $923,000 of GILTI income inclusion and used our net operating losses to offset our taxable income. For the fiscal year ended June 30, 2021, we did not incur any BEAT tax.\nWe account for uncertain tax positions according to the provisions of ASC 740. ASC 740 contains a two-step approach for recognizing and measuring uncertain tax positions. Tax positions are evaluated for recognition by determining if the weight of available evidence indicates that it is probable that the position will be sustained on audit, including resolution of related appeals or litigation. Tax benefits are then measured as the largest amount which is more than 50% likely of\nbeing realized upon ultimate settlement. We consider many factors when evaluating and estimating tax positions and tax benefits, which may require periodic adjustments and which may not accurately anticipate actual outcomes.\nAs of June 30, 2021, we have completed a 382 study under Section 382 of the Internal Revenue Code through June 30, 2020, and have determined there was no loss of NOLs as a result of these changes. Utilization of the NOL or tax credit carryforwards to offset future taxable income and taxes, respectively, are subject to an annual limitation under the Internal Revenue Code of 1986 and similar state provisions, which is determined by first multiplying the value of the Company’s stock at the time of the ownership change by the applicable long-term, tax-exempt rate, and then could be subject to additional adjustments such as built in gain or built in loss, as required. Any limitation may result in expiration of all or a portion of its NOL and or tax credit carryforwards before utilization.\nComprehensive Income\nWe report comprehensive income and its components in accordance with ASC 220, Comprehensive Income. Under the accounting standards, comprehensive loss includes all changes in equity during a period except those resulting from investments by or distributions to owners. Total comprehensive income for each of the two years in the period ended June 30, 2021 is shown in the accompanying consolidated statements of comprehensive income. Accumulated other comprehensive loss presented in the accompanying consolidated balance sheets as of June 30, 2021 and 2020 consists of accumulated foreign currency translation adjustments.\nNet Income Per Common Share\nBasic net income per common share is computed using the weighted-average number of shares of common stock outstanding. In periods where net income is reported, the weighted average number of shares is increased by warrants and options in-the-money to calculate diluted net income per common share.\nThe following table represents the calculation of basic and diluted net income per common share (in thousands, except per share data):\nYears Ended June 30,\nNet income applicable to common stockholders\n$\n6,959\n$\n7,208\nBasic net income per common share\n$\n0.22\n$\n0.24\nWeighted average common shares used in computing basic net income per common share\n31,007\n30,620\nEffect of dilutive common equivalents outstanding\n1,590\n1,336\nWeighted average common shares used in computing diluted net income per common share\n32,597\n31,956\nDiluted net income per common share\n$\n0.21\n$\n0.23\nWeighted average options to purchase 293,949 and 613,643 shares of common stock as of June 30, 2021 and 2020, respectively, were not included in the computation of diluted net income per common share due to their anti-dilutive effect. Such securities could have a dilutive effect in future periods.\nSegment Information\nWe operate in one segment, the development, license, implementation, and support of our customer service infrastructure software solutions. Operating segments are identified as components of an enterprise for which discrete financial information is available and regularly reviewed by our chief operating decision-maker in order to make decisions about resources to be allocated to the segment and assess its performance. Our chief operating decision-makers under ASC 280, Segment Reporting, are our executive management team. Our chief operating decision-makers review financial information presented on a consolidated basis for purposes of making operating decisions and assessing financial performance.\nInformation relating to our geographic areas for the fiscal years ended June 30, 2021 and 2020 is as follows (in thousands):\nOperating\nTotal\nIncome\nLong-Lived\nRevenue\n(Loss)\nAssets\nYear ended June 30, 2021:\nNorth America\n$\n54,380\n$\n4,936\n$\nEurope, Middle East, & Africa\n23,907\n8,496\nAsia Pacific\n-\n(6,093)\n$\n78,287\n$\n7,339\n$\nYear ended June 30, 2020:\nNorth America\n$\n44,813\n$\n$\nEurope, Middle East, & Africa\n27,916\n11,944\nAsia Pacific\n-\n(5,428)\n$\n72,729\n$\n7,406\n$\nFor the purposes of entity-wide geographic area disclosures, we define long-lived assets as hard assets that cannot be easily removed, such as property and equipment.\nRecent Accounting Pronouncements\nPronouncements Not Yet Adopted\nIn June 2016, the FASB issued ASU No. 2016-13, Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments (ASU 2016-13), which requires measurement and recognition of expected credit losses for financial assets held at the reporting date based on internal information, external information, or a combination of both relating to past events, current conditions, and reasonable and supportable forecasts. ASU No. 2016-13 replaces the existing incurred loss impairment model with a forward-looking expected credit loss model, which will result in earlier recognition of credit losses. Subsequent to the issuance of ASU No. 2016-13, the FASB issued ASU No. 2018-19, Codification Improvements to Topic 326, Financial Instruments - Credit Losses, ASU No. 2019-04, Codification Improvements to Topic 326, Financial Instruments - Credit Losses, Topic 815, Derivatives and Hedging, and Topic 825, Financial Instrument, ASU No. 2019-05, Financial Instruments - Credit Losses (Topic 326) Targeted Transition Relief, ASU No. 2016-13, ASU No. 2019-10 Financial Instruments-Credit Losses (Topic 326), Derivatives and Hedging (Topic 815), and Leases (Topic 842), and ASU No. 2019-11 Codification Improvements to Topic 326, Financial Instruments-Credit Losses. The subsequent ASUs do not change the core principle of the guidance in ASU No. 2016-13. Instead, these amendments are intended to clarify and improve operability of certain topics included within ASU No. 2016-13.\nAdditionally, ASU No. 2019-10 defers the effective date for the adoption of the new standard on credit losses for public filers that are considered small reporting companies (“SRC”) as defined by the SEC to fiscal years beginning after December 15, 2022, including interim periods within those fiscal years, which will be fiscal year 2024 for the Company if it continues to be classified as a SRC. In February 2020, the FASB issued ASU 2020-02, which provides guidance regarding methodologies, documentation, and internal controls related to expected credit losses. The subsequent amendments will have the same effective date and transition requirements as ASU No. 2016-13. Early adoption is permitted. Topic 326 requires a modified retrospective approach by recording a cumulative-effect adjustment to retained earnings as of the beginning of the period of adoption. While the Company is currently evaluating the impact of Topic 326, the Company does not expect the adoption of this ASU to have a material impact on its consolidated financial statements or the related disclosure.\nIn December 2019, FASB issued ASU 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes. This update simplifies the accounting for income taxes. This update is effective for fiscal years beginning after December 15, 2020 (our fiscal year 2022). We are currently evaluating the impact of this update on our consolidated financial statements and related disclosures.\nPronouncements Recently Adopted\nIn August 2018, the Financial Accounting Standards Board (FASB) issued ASU 2018-15, Intangibles-Goodwill and Other-Internal-Use Software (Subtopic 350-40). This update requires a customer in a cloud computing service arrangement to follow the internal-use software guidance to determine which implementation costs to recognize and defer as an asset. We adopted this guidance as of our first quarter of fiscal year 2021 with no impact on our consolidated financial statements.\nRevenue Recognition\nRevenue Recognition Policy\nOur revenue is comprised of two categories including subscription and professional services. Subscription includes SaaS revenue and legacy revenue. SaaS includes revenue from cloud delivery arrangements, term licenses and embedded OEM royalties and associated support. Legacy revenue is associated with license, maintenance, and support contracts on perpetual license arrangements that we no longer sell. Professional services includes consulting, implementation and training.\nSignificant Judgment Applied in the Determination of Revenue Recognition\nWe enter into contractual arrangements with customers that may include promises to transfer multiple services, such as subscription, support and professional services. With respect to our business, a performance obligation is a promise to transfer a service to a customer that is distinct. Significant judgment is required to determine whether services are distinct\nperformance obligations that should be accounted for separately or combined as one unit of accounting. Additionally, significant judgment is required to determine the timing of revenue recognition.\nWe allocate the transaction price to each performance obligation on a relative standalone selling price basis (SSP). The SSP is the price at which we would sell a promised service separately to one of our customers. Judgment is required to determine the SSP for each distinct performance obligation.\nWe determine the SSP by considering our pricing objectives in relation to market demand. Consideration is placed based on our history of discounting prices, size and volume of transactions involved, customer demographics and geographic locations, price lists, contract prices and our market strategy.\nDetermination of Revenue Recognition\nUnder Topic 606, we recognize revenue upon the transfer of control of promised services to our customers in the amount that is commensurate with the consideration that we expect to receive in exchange for those services. If consideration includes a variable amount in the arrangement, such as service level credits or contingent fees, then we include an estimate of the amount that we expect to receive for the total transaction price.\nThe amount of revenue that we recognize is based on (i) identifying the contract with a customer; (ii) identifying the performance obligations in the contract; (iii) determining the transaction price; (iv) allocating the transaction price to the performance obligations in the contract on a relative SSP basis; and (v) recognizing revenue when, or as, we satisfy each performance obligation in the contract typically through delivery or when control is transferred to the customer.\nSubscription Revenue\nThe following customer arrangements are recognized ratably over the contract term as the performance obligations are delivered:\n● Cloud delivery arrangements;\n● Maintenance and support arrangements; and\n● Term license subscriptions which incorporate on-premise software licenses and substantial cloud functionality that are not distinct in the context of our arrangements as such are considered highly interrelated and represent a single combined performance obligation.\nFor contracts involving distinct software licenses, the license performance obligation is satisfied at a point in time when control is transferred to the customer.\nWe typically invoice our customers in advance upon execution of the contract or subsequent renewals with payment terms between 30 and 45 days. Invoiced amounts are recorded in accounts receivable, deferred revenue or revenue, depending if control transferred to our customers based on each arrangement.\nThe Company has a royalty revenue agreement with a customer related to the Company’s embedded intellectual property. Under the terms of the agreement, the customer is to provide a combined fixed fee, per agent, for each software license sold containing the embedded software to the Company. These embedded OEM royalties are included as subscription revenue. Under Topic 606 revenue guidance, since these arrangements are for sales-based licenses of intellectual property, for which the guidance in paragraph ASC 606-10-55-65 applies, the Company recognizes revenue only as the subsequent sale occurs. However, the Company notes that such sales are reported by the customer with a quarter in arrears, such revenue is recognized at the time it is reported and paid by the customer given that any estimated variable consideration would have to be fully constrained due to the unpredictability of such estimate and the unavoidable risk that it may lead to significant revenue reversals.\nProfessional Services Revenue\nProfessional services revenue includes system implementation, consulting, and training. The transaction price is allocated to various performance obligations based on their stand-alone selling prices. Revenue allocated to each performance obligation is recognized at the earlier of satisfaction of discrete performance obligations, or as work is performed on a time and material basis. Our consulting and implementation service contracts are bid either on a time-and-materials basis or on a fixed-fee basis. Fixed fees are generally paid upon milestone billing or acceptance at pre-determined points in the contract. Amounts that have been invoiced are recorded in accounts receivable and in deferred revenue or revenue, depending on whether transfer of control to customers has occurred.\nTraining revenue that meets the criteria to be accounted for separately is recognized when training is provided.\nContracts with Multiple Performance Obligations\nThe Company enters into contracts that can include various combinations of subscriptions, professional services and maintenance and support, which are generally distinct and accounted for as separate performance obligations. For contracts with multiple performance obligations, the Company allocates the transaction price of the contract to each performance obligation on a relative basis using the respective standalone selling prices for each performance obligation.\n2. BALANCE SHEET COMPONENTS\nProperty and equipment, net consists of the following:\nAs of June 30,\n(in thousands)\nComputers and equipment\n$\n3,750\n$\n3,324\nFurniture and fixtures\n1,029\nLeasehold improvements\nTotal\n5,368\n4,818\nAccumulated depreciation and amortization\n(4,663)\n(4,105)\nProperty and equipment, net\n$\n$\nDepreciation and amortization expense was $428,000 and $304,000 for the fiscal years ended June 30, 2021 and 2020, respectively. Disposed fixed assets, which were substantially fully-depreciated, were $0 and $920,000 for the years ended June 30, 2021, and 2020, respectively.\nAccrued compensation consists of the following:\nAs of June 30,\n(in thousands)\nAccrued bonuses\n$\n3,601\n$\n3,223\nAccrued vacation\n2,636\n2,235\nPayroll and other employee related costs\n1,559\n1,745\nAccrued commissions\nAccrued compensation\n$\n8,444\n$\n7,916\nAccrued liabilities consists of the following:\nAs of June 30,\n(in thousands)\nCustomer advances\n$\n$\nSales tax payable\nVAT liability\n2,190\nAccrued other liabilities\n1,017\n1,432\nAccrued liabilities\n$\n4,352\n$\n3,423\n3. REVENUE RECOGNITION\nDisaggregation of Revenue\nThe following table presents our subscription and professional services revenue during the fiscal years ended June 30, 2021 and 2020, respectively:\nFiscal Year Ended June 30,\n(in thousands)\nRevenue:\nSaaS revenue\n$\n66,929\n$\n56,793\nLegacy revenue\n5,442\n9,336\nTotal subscription\n72,371\n66,129\nProfessional services\n5,916\n6,600\nTotal revenue\n$\n78,287\n$\n72,729\nThe following table presents our revenue by geography. Revenue by geography is generally determined on the region of our contracting entity rather than the region of our customer. The relative proportion of our total revenues between each geographic region as presented in the table below was materially consistent across each of our operating segments’ revenues for the periods presented.\nFiscal Year Ended June 30,\n(in thousands)\nRevenue:\nNorth America\n$\n54,380\n$\n44,813\nEMEA\n23,907\n27,916\nTotal Revenue\n$\n78,287\n$\n72,729\nContract Balances\nContract assets, if any, consist of unbilled receivables for completed performance obligations which have not been invoiced, and for which we do not have an unconditional right to consideration. Contract liabilities consist of deferred revenue for which we have an obligation to transfer services to customers and have received consideration in advance or the amount is due from customers. Once the obligations are fulfilled, then deferred revenue is recognized to revenue in the respective period. There were no contract assets for the years ended June 30, 2021 and 2020.\nThe following table presents the changes in contract liabilities (in thousands):\nBalance as of July 1, 2020\n($)\nAdditions\n($)\nDeductions\n($)\nBalance as of June 30, 2021\n($)\nContract liabilities:\nDeferred revenue\n36,644\n87,270\n(77,703)\n46,211\nDeferred revenue, net of current portion\n4,826\n-\n(1,494)\n3,332\nWith respect to deferred revenue balances as of June 30, 2020, $36.5 million was recognized to revenue during fiscal year ended June 30, 2021.\nRemaining Performance Obligations\nRemaining performance obligations represent contracted revenues that had not yet been recognized, and include deferred revenues, invoices that have been issued to customers but were uncollected and have not been recognized as revenues, and amounts that will be invoiced and recognized as revenues in future periods. The transaction price allocated to the remaining performance obligation is influenced by a variety of factors, including seasonality, timing of renewals, average contract terms and foreign currency rates. As of June 30, 2021, our remaining performance obligations were $65.4 million of which we expect to recognize $55.2 million and $10.2 million as revenue within one year and beyond one year, respectively.\n4. INCOME TAXES\nIncome before income tax (benefit) provision consisted of the following (in thousands):\nFiscal Year Ended June 30,\nUnited States\n$\n5,024\n$\n5,260\nForeign\n1,769\n2,726\nIncome before income tax (benefit) provision\n$\n6,793\n$\n7,986\nThe following table reconciles the federal statutory tax rate to the effective tax rate of the income tax (benefit) provision:\nFiscal Year Ended June 30,\nFederal statutory income tax rate\n21.0\n%\n21.0\n%\nCurrent state taxes, net of federal benefit\n2.1\n3.3\nForeign rate differential\n(1.9)\n(0.6)\nResearch and development credits\n(8.5)\n(0.6)\nForeign withholding tax\n0.5\n1.2\nStock-based compensation\n(0.8)\n(0.3)\nDeferred return to provision\n(1.8)\n0.7\nOther items\n0.3\n0.5\nNet change in valuation allowance\n(194.4)\n(71.5)\nForeign income\n2.9\n8.5\nExpiration of tax attributes\n178.2\n47.5\nEffective tax rate\n(2.4)\n%\n9.7\n%\nThe components of the income tax (benefit) provision are as follows (in thousands):\nFiscal Year Ended June 30,\nCurrent (benefit) provision:\nForeign\n$\n$\nFederal\n-\n(12)\nState\nTotal current:\nDeferred:\nFederal\n-\nForeign\n(304)\nTotal deferred:\n(304)\nIncome tax (benefit) provision\n$\n(166)\n$\nAs of June 30, 2021, we had federal and state net operating loss carryforwards of approximately $107.0 million and $14.3 million, respectively. The net operating loss carryforwards will expire at various dates beginning in fiscal year ending June 30, 2022, if not utilized. We also had federal research and development credit carryforwards of approximately $3.2 million\nas of June 30, 2021, which will expire at various dates beginning in fiscal year ending June 30, 2022, if not utilized. The California research and development credit carryforwards are approximately $5.7 million as of June 30, 2021 and have an indefinite carryover period.\nAs of June 30, 2021, we have completed a 382 study under Section 382 of the Internal Revenue Code through June 30, 2020, and have determined there was no loss of NOLs as a result of these changes. Utilization of the NOL or tax credit carryforwards to offset future taxable income and taxes, respectively, are subject to an annual limitation under the Internal Revenue Code of 1986 and similar state provisions, which is determined by first multiplying the value of the Company’s stock at the time of the ownership change by the applicable long-term, tax-exempt rate, and then could be subject to additional adjustments such as built in gain or built in loss, as required. Any limitation may result in expiration of all or a portion of its NOL and or tax credit carryforwards before utilization.\nDeferred tax assets and liabilities reflect the net tax effects of net operating loss and credit carryforwards and of temporary differences between the carrying amounts of assets and liabilities for financial reporting and the amounts used for income tax purposes.\nSignificant components of our deferred tax assets and liabilities for federal, state and foreign income taxes are as follows (in thousands):\nAs of June 30,\nDeferred tax assets:\nNet operating loss carryforwards\n$\n23,418\n$\n35,105\nResearch credits\n7,728\n7,525\nDeferred revenue\n1,220\n2,483\nStock-based compensation\n1,136\n1,100\nAccruals and reserves\n2,799\n2,898\nLease liability\nOther\nGross deferred tax assets\n36,575\n49,709\nLess valuation allowance\n(35,492)\n(48,700)\nNet deferred tax assets\n$\n1,083\n$\n1,009\nGross deferred tax liabilities\nRight-of-use asset\n$\n(207)\n$\n(500)\nFixed assets\n(38)\n(20)\nGross deferred tax liabilities\n(245)\n(520)\nTotal deferred tax assets, net *\n$\n$\n*included in other assets on consolidated balance sheet\nASC 740, Income Taxes, provides for the recognition of deferred tax assets if realization of such assets is more likely than not. For the legacy eGain business in the United States, based upon the weight of available evidence, which includes our historical operating performance and the reported cumulative net losses in prior years, we have provided a full valuation allowance against our U.S. net deferred tax assets. With respect to our foreign operations, we expect to utilize the deferred tax assets and have not placed a valuation allowance against them. Our tax provision primarily relates to foreign activities as well as state income taxes. Our income tax rate differs from the statutory tax rates primarily due to the utilization of net operating loss carryforwards which had previously been valued against, change in valuation allowance, stock-based compensation, GILTI inclusion, research and development credits, and our foreign operations.\nThe net valuation allowance decreased by $13.2 million and $5.7 million for the fiscal years ended June 30, 2021 and 2020, respectively.\nWe have not provided for taxes on $18.7 million of undistributed earnings of our foreign subsidiaries as of June 30, 2021. It is our intention to reinvest such undistributed earnings indefinitely in our foreign subsidiaries. If we distribute these\nearnings, in the form of dividends or otherwise, we would be subject to withholding taxes payable to the foreign jurisdiction and potential state taxes.\nUncertain Tax Positions\nThe aggregate changes in the balance of our gross unrecognized tax benefits during fiscal years 2021 and 2020 were as follows (in thousands):\nFiscal Year Ended June 30,\nBeginning balance\n$\n1,691\n$\n1,665\nIncreases in balances related to tax positions taken during current periods\nEnding balance\n$\n1,762\n$\n1,691\nThere is no amount of unrecognized tax benefit, if recognized currently, that would impact the Company’s effective tax rate as of June 30, 2021 and 2020, respectively. No accrued interest and penalties have been recognized in the tax provision related to unrecognized tax benefits.\nWe do not anticipate the amount of existing unrecognized tax benefit to significantly increase or decrease during the next twelve months. Our policy is to record interest and penalties related to unrecognized tax benefits as income tax expense.\nWe file income tax returns in the United States as well as various state and foreign jurisdictions. In these jurisdictions, tax years between 2001 and 2019 remain subject to examination by the appropriate governmental agencies due to tax loss carryovers from those years. The Company is not currently under audit with either the IRS, foreign, or any state or local jurisdictions, nor has it been notified of any other potential future income tax audit. The federal and California statute of limitations remains open for three and four years, respectively, from the date of utilization of any net operating loss or credits.\n5. STOCKHOLDERS’ EQUITY\nCommon Stock\nWe have reserved shares of common stock for issuance as of June 30, 2021 as follows:\nReserved\nStock\nOptions\nStock options outstanding\n2,735,512\nStock available for future grants or issuance:\n2005 Stock Incentive Plan\n944,527\n2005 Management Stock Option Plan\n68,649\n2017 Employee Stock Purchase Plan\n643,075\nTotal reserved shares of common stock for issuance\n4,391,763\nPreferred Stock\nWe are authorized to issue 5,000,000 shares of preferred stock with a par value of $0.001 per share. As of June 30, 2021 and 2020, no shares of preferred stock are issued or outstanding. Our board of directors has the authority, without further action by our stockholders, to issue up to 5,000,000 shares of preferred stock in one or more series and to fix the rights, preferences, privileges and restrictions thereof. These rights, preferences and privileges could include dividend rights, conversion rights, voting rights, terms of redemption, liquidation preferences, sinking fund terms and the number of shares constituting any series or the designation of such series, any or all of which may be greater than the rights of the common stock.\n2005 Management Stock Option Plan\nIn May 2005, our board of directors adopted the 2005 Management Stock Option Plan (2005 Management Plan) which provides for the grant of non-statutory stock options to directors, officers and key employees of eGain and its subsidiaries. Our board extended the expiration date of the 2005 Management Plan to September 30, 2024. Options under the 2005 Management Plan are granted at a price not less than 100% of the fair market value of the common stock on the date of grant. Options granted under the 2005 Management Plan are subject to eGain’s right of repurchase, whose right shall lapse with respect to one-forty-eighth (1/48th) of the shares granted to a director, officer or key employee for each month of continuous service provided by such director, officer or key employee to eGain. The options granted under this plan are exercisable for up to ten years from the date of grant.\nThe following table represents the activity under the 2005 Management Plan:\nShares\nWeighted\nAvailable for\nOptions\nAverage\nGrant\nOutstanding\nExercise Price\nBalance as of June 30, 2019\n68,649\n1,317,726\n$\n3.56\nOptions Granted\n-\n-\n$\n-\nOptions Exercised\n-\n(39,209)\n$\n2.89\nOptions Forfeited / Expired\n-\n-\n$\n-\nBalance as of June 30, 2020\n68,649\n1,278,517\n$\n3.58\nOptions Granted\n-\n-\n$\n-\nOptions Exercised\n-\n(106,000)\n$\n4.30\nOptions Forfeited / Expired\n-\n-\n$\n-\nBalance as of June 30, 2021\n68,649\n1,172,517\n$\n3.51\n2005 Stock Incentive Plan\nIn March 2005, our board of directors adopted the 2005 Stock Incentive Plan which provides for the grant of stock options to eGain’s employees, officers, directors and consultants. Our board extended the expiration date of the 2005 Stock Incentive Plan to September 30, 2024 and made certain other changes. Options granted under the 2005 Stock Incentive Plan are non-qualified stock options. Non-qualified stock options may be granted to employees with exercise prices of no less than the fair value of the common stock on the date of grant. The options generally vest ratably over a period of four years and expire no later than ten years from the date of grant.\nThe following table represents the activity under the 2005 Stock Incentive Plan:\nShares\nWeighted\nAvailable for\nOptions\nAverage\nGrant\nOutstanding\nExercise Price\nBalance as of June 30, 2019\n347,703\n1,503,607\n$\n4.67\nShares Added\n1,000,000\n-\n$\n-\nOptions Granted\n(350,125)\n350,125\n$\n8.29\nOptions Exercised\n-\n(170,475)\n$\n2.52\nOptions Forfeited / Expired\n75,808\n(75,808)\n$\n6.40\nBalance as of June 30, 2020\n1,073,386\n1,607,449\n$\n5.60\nOptions Granted\n(207,700)\n207,700\n$\n12.07\nOptions Exercised\n-\n(173,313)\n$\n4.41\nOptions Forfeited / Expired\n78,841\n(78,841)\n$\n8.69\nBalance as of June 30, 2021\n944,527\n1,562,995\n$\n6.44\nNo shares were granted to consultants during the fiscal year ended June 30, 2021.\nThe following table summarizes information about stock options outstanding and exercisable under all stock option plans as of June 30, 2021:\nOptions Outstanding\nOptions Exercisable\nWeighted\nRange of\nAverage\nWeighted\nWeighted\nExercise\nNumber of\nRemaining\nAverage\nNumber of\nAverage\nPrices\nShares\nContractual Life\nExercise Price\nShares\nExercise Price\n$1.5-$2.13\n142,542\n2.61\n$\n1.78\n137,505\n$\n1.78\n$2.5-$2.5\n1,196,559\n5.24\n$\n2.50\n1,123,861\n$\n2.50\n$3.4-$5.28\n385,649\n3.30\n$\n4.38\n365,503\n$\n4.43\n$5.31-$7.2\n275,392\n4.38\n$\n6.34\n244,877\n$\n6.31\n$7.47-$8.2\n274,638\n7.57\n$\n7.90\n135,111\n$\n7.90\n$8.23-$12.15\n326,482\n8.46\n$\n10.28\n106,020\n$\n10.50\n$12.25-$13.75\n90,500\n7.53\n$\n13.41\n52,213\n$\n13.70\n$14.275-$14.275\n12,200\n9.21\n$\n14.28\n-\n$\n-\n$14.4-$14.4\n3,550\n7.12\n$\n14.40\n2,514\n$\n14.40\n$19.11-$19.11\n28,000\n9.29\n$\n19.11\n-\n$\n-\n$1.5-$19.11\n2,735,512\n5.50\n$\n5.18\n2,167,604\n$\n4.22\nThe summary of options vested and exercisable as of June 30, 2021 comprised:\nWeighted\nAverage\nWeighted\nAggregate\nRemaining\nNumber of\nAverage\nIntrinsic\nContractual\nShares\nExercise Price\nValue\nTerm\nOptions outstanding\n2,735,512\n$\n5.18\n$\n17,693,123\n5.50\nFully vested and expected to vest options\n2,667,951\n$\n5.07\n$\n17,536,993\n5.42\nOptions exercisable\n2,167,604\n$\n4.22\n$\n15,880,275\n4.84\nThe aggregate intrinsic value in the preceding table represents the total intrinsic value based on stock options with a weighted average exercise price less than our closing stock price of $11.48 as of June 30, 2021 that would have been received by the option holders, had they exercised their options on June 30, 2021. The total intrinsic value of stock options exercised was $2.0 million and $1.3 million during fiscal years 2021 and 2020, respectively.\nStock-Based Compensation\nWe account for stock-based compensation in accordance with ASC 718, Compensation-Stock Compensation. Under the fair value recognition provisions of ASC 718, stock-based compensation cost is measured at the grant date based on the fair value of the award and is recognized as expense over the requisite service period, which is generally the vesting period. Stock-based compensation expense consists of expenses for stock options and our employee stock purchase plan (ESPP).\n2017 Employee Stock Purchase Plan\nIn October 2017, our board of directors adopted the 2017 Employee Stock Purchase Plan (ESPP) which provided eligible employees the option purchase the Company’s common stock through payroll deductions at a price equal to 85% of the lower of the fair market value at the entry date of the applicable offering period or at the end of each applicable purchasing period. The offering period, meaning a period with respect to which the right to purchase shares of our common stock may be granted under the ESPP, will not exceed twenty-seven months and consist of a series of six-month purchase periods. Eligible employees may join the ESPP at the beginning of any six-month purchase period. Under the terms of the ESPP, employees can choose to have between 1% and 15% of their base earnings withheld to purchase the Company’s common stock.\nDetermining the fair value of the stock-based awards at the grant date requires significant judgment and the use of estimates, particularly surrounding Black-Scholes valuation assumptions such as stock price volatility and expected option term.\nThe table below summarizes the effect of stock-based compensation (in thousands):\nFiscal Year Ended June 30,\nNon-cash stock-based compensation expense\n$\n(1,700)\n$\n(1,861)\nIncome tax expense\n(51)\n(56)\nNet income effect\n$\n(1,751)\n$\n(1,917)\nThe Company recognized $51,000 and $56,000 of tax expense related to stock-based compensation expense for eGain UK and Exony for the fiscal year ended June 30, 2021 and 2020, respectively. There is no income tax effect that has been recognized relating to the stock-based compensation expense in the US due to full valuation allowance.\nTotal stock-based compensation includes expense related to non-employee awards of $47,000 and $120,000 during the fiscal years ended June 30, 2021 and 2020, respectively.\nTotal stock-based compensation includes expense related to the ESPP of $473,000 and $294,000 during the fiscal year ended June 30, 2021 and 2020, respectively.\nWe utilized the Black-Scholes valuation model for estimating the fair value of the stock-based compensation of options granted. All shares of our common stock issued pursuant to our stock option plans are only issued out of an authorized reserve of shares of common stock, which were previously registered with the Securities and Exchange Commission on a registration statement on Form S-8.\nDuring the fiscal years ended June 30, 2021 and 2020, there were 207,700 and 350,125 options granted, respectively, with a weighted average grant date fair value of $6.60 and $4.50, per share, respectively.\nWe used the following assumptions:\nFiscal Year Ended June 30,\nDividend yield\n-\n-\nExpected volatility\n%\n%\nAverage risk-free interest rate\n0.50\n%\n1.37\n%\nExpected life (in years)\n4.35\n4.33\nThe fair value of the ESPP stock purchase right is estimated on the date of grant using the following weighted-average assumptions:\nFiscal Year Ended June 30,\nExpected term (in years)\n0.50\n0.50\nVolatility\n%\n%\nExpected dividend\n-\n-\nRisk-free interest rate\n1.27\n%\n1.88\n%\nFair Value of grants per share\n$\n3.64\n$\n2.97\nDuring the fiscal year ended June 30, 2021, employees were granted the right to purchase an aggregate of 152,092 shares under the ESPP, and compensation expense related to those purchase rights for the fiscal year ended June 30, 2021 was $473,000. During the fiscal year ended June 30, 2021, 130,408 shares were purchased and 643,075 shares remain available to be purchased pursuant to the 2017 ESPP.\nAs of June 30, 2021 unrecognized compensation expense related to purchase rights that will be recognized over a weighted average period of 0.42 years was $231,000.\nThe dividend yield of zero is based on the fact that we have never paid cash dividends and have no present intention to pay cash dividends. We determined the appropriate measure of expected volatility by reviewing historic volatility in the share price of our common stock, as adjusted for certain events that management deemed to be non-recurring and non-indicative of future events. The risk-free interest rate is derived from the average U.S. Treasury Strips rate.\nWe base our estimate of expected life of a stock option on the historical exercise behavior, and cancellations of all past option grants made by the Company during the time period which its common stock has been publicly traded, the contractual term of the option, the vesting period and the expected remaining term of the outstanding options.\nIn accordance with Accounting Standards Updates (ASU) 2016-09, Compensation-Stock Compensation: Improvements to Employee Share-Based Accounting, we elected to continue to estimate forfeitures in the calculation of stock-based compensation expense.\nThe following table summarizes stock-based compensation expense relating to stock options for the year ended June 30, 2021 and 2020, respectively (in thousands):\nFiscal Year Ended June 30,\nCost of revenue\n$\n$\nResearch and development\nSales and marketing\nGeneral and administrative\nTotal\n$\n1,227\n$\n1,567\nTotal unamortized compensation cost, net of forfeitures, for all options granted but not yet vested as of June 30, 2021 was $1.1 million which is expected to be recognized over the weighted average period of 1.23 years.\n6. INTANGIBLE ASSETS\nIntangible assets are amortized over the estimated lives, as follows (in thousands, except expected life):\nGross\nConsolidated\nCarrying\nAccumulated\nNet Balance\nStatements of Operations\nIntangible Asset\nAmount\nAmortization\nJune 30, 2021\nLife\nCategory\nCustomer relationships - maintenance contracts\n1,610\n(1,610)\n-\nCost of recurring\n$\n1,610\n$\n(1,610)\n$\n-\nGross\nConsolidated\nCarrying\nAccumulated\nNet Balance\nStatements of Operations\nIntangible Asset\nAmount\nAmortization\nJune 30, 2020\nLife\nCategory\nCustomer relationships - maintenance contracts\n1,610\n(1,584)\nCost of recurring\n$\n1,610\n$\n(1,584)\n$\nAmortization expense related to the above intangible assets for fiscal year ended June 30, 2021 and 2020 was $26,000 and $268,000, respectively.\n7. LEASES\nWe lease our office facilities under non-cancelable operating leases that expire on various dates through fiscal year 2025. Additionally, we are the sublessor for certain office space. All of our office leases are classified as operating leases with lease expense recognized on a straight-line basis over the lease term. Lease right-of-use assets and liabilities are recognized at the commencement date at the present value of lease payments over the lease term. As our leases do not provide an implicit rate, we use our incremental borrowing rate based on information available at the commencement date in determining the present value of lease payments.\nThe following table presents information about the weighted average lease term and discount rate as follows:\nAs of June 30, 2021\nWeighted average remaining lease term (in years)\n1.78\nWeighted average discount rate\n4.75\n%\nThe following table presents information about leases on our consolidated statement of operations (in thousands):\nFiscal Year Ended\nJune 30, 2021\nOperating lease expense\n$\n1,770\nShort-term lease expense\nSublease income\n(618)\nThe following table presents supplemental cash flow information about our leases (in thousands):\nFiscal Year Ended\nJune 30, 2021\nOperating cash outflows from operating leases\n$\n1,948\nRight-of-use assets obtained in exchange for new operating lease liabilities\n-\nAs of June 30, 2021, remaining maturities of lease liabilities are as follows (in thousands):\nFiscal Period:\nFiscal year 2022\n$\n1,530\nFiscal year 2023\nFiscal year 2024\nTotal minimum lease payments\n2,353\nLess: Imputed interest\n(90)\nTotal\n$\n2,263\n8. COMMITMENTS AND CONTINGENCIES\nEmployee benefit plans\nDefined Contribution Plans\nWe sponsor an employee savings and retirement plan, the 401(k) Plan, as allowed under Section 401(k) of the Internal Revenue Code. The 401(k) Plan is available to all domestic employees who meet minimum age and service requirements, and provides employees with tax deferred salary deductions and alternative investment options. Employees may contribute up to 60% of their salary, subject to certain limitations. We, at the discretion of our board of directors, may contribute to the 401(k) Plan. In fiscal years 2021 and 2020, we contributed approximately $569,000 and $463,000 to the 401(k) Plan, respectively. We also have a defined contribution plan related to our foreign subsidiaries. Amounts expensed under this plan were $534,000 and $466,000, for the fiscal years ended June 30, 2021 and 2020, respectively.\nGratuity Plan-India\nIn accordance with Gratuity Act of 1972, we sponsor a defined benefit plan (Gratuity Plan) for all of our India employees. The Gratuity Plan is required by local law, which provides a lump sum payment to vested employees upon retirement or termination of employment in an amount based on each employee’s salary and duration of employment with the Company. The Gratuity Plan benefit cost for the year is calculated on an actuarial basis. Current service costs and actuarial gains or losses, or prior service cost, for the Gratuity Plan were insignificant for the fiscal years 2021 and 2020.\nWarranty\nWe generally warrant that the program portion of our software will perform substantially in accordance with certain specifications for a period up to one year from the date of delivery. Our liability for a breach of this warranty is either a return of the license fee or providing a fix, patch, work-around or replacement of the software.\nWe also provide standard warranties against and indemnification for the potential infringement of third party intellectual property rights to our customers relating to the use of our products, as well as indemnification agreements with certain officers and employees under which we may be required to indemnify such persons for liabilities arising out of their duties to us. The terms of such obligations vary. Generally, the maximum obligation is the amount permitted by law.\nHistorically, costs related to these warranties have not been significant. However, we cannot guarantee that a warranty reserve will not become necessary in the future.\nIndemnification\nWe have agreed to indemnify our directors and executive officers for costs associated with any fees, expenses, judgments, fines and settlement amounts incurred by any of these persons in any action or proceeding to which any of those persons is, or is threatened to be, made a party by reason of the person’s service as a director or officer, including any action by us, arising out of that person’s services as our director or officer or that person’s services provided to any other company or enterprise at our request.\nTransfer Pricing\nWe have received transfer-pricing assessments from tax authorities with regard to transfer pricing issues for certain fiscal years, which we have appealed with the appropriate authority. We review the status of each significant matter and assess its potential financial exposure. We believe that such assessments are without merit and would not have a significant impact on our consolidated financial statements.\nContractual Obligations and Commitments\nContractual agreements with third parties consist of software licenses, maintenance and support for our operations. As of June 30, 2021, we have paid all non-cancelable contractual agreements related to these software licenses.\nWe have no significant commitments related to co-location services for cloud operations as of June 30, 2021 and 2020.\n9. LITIGATION\nIn the ordinary course of business, we are involved in various legal proceedings and claims related to alleged infringement of third-party patents and other intellectual property rights, commercial, corporate and securities, labor and employment, wage and hour, and other claims that are not expected to have a material impact. We have been, and may in the future be, put on notice and/or sued by third parties for alleged infringement of their proprietary rights, including patent infringement.\nWe evaluate all claims and lawsuits with respect to their potential merits, our potential defenses and counterclaims, settlement or litigation potential and the expected effect on us. Our technologies may be subject to injunction if they are found to infringe the rights of a third party. In addition, our agreements require us to indemnify our customers for third-party intellectual property infringement claims, which could increase the cost to us of an adverse ruling on such a claim.\n10. FAIR VALUE MEASUREMENT\nASC 820, Fair Value Measurement and Disclosures, defines fair value, establishes a framework for measuring fair value of assets and liabilities, and expands disclosures about fair value measurements. Fair value is defined as the exchange price that would be received for an asset or paid to transfer a liability in the principal or most advantageous market for the assets or liabilities in an orderly transaction between market participants on the measurement date. Subsequent changes in fair value of these financial assets and liabilities are recognized in earnings or other comprehensive income when they occur. ASC 820 applies whenever other statements require or permit assets or liabilities to be measured at fair value.\nASC 820 includes a fair value hierarchy, of which the first two are considered observable and the last unobservable, that is intended to increase the consistency and comparability in fair value measurements and related disclosures. Valuation techniques used to measure fair value must maximize the use of observable inputs and minimize the use of unobservable inputs. Observable inputs reflect assumptions market participants would use in pricing an asset or liability based on market data obtained from independent sources while unobservable inputs reflect a reporting entity’s pricing based upon their own market assumptions.\nThe fair value hierarchy consists of the following three levels:\nLevel 1 - instrument valuations are obtained from real-time quotes for transactions in active exchange markets involving identical assets.\nLevel 2 - instrument valuations are obtained from readily-available pricing sources for comparable instruments.\nLevel 3 - instrument valuations are obtained without observable market value and require a high level of judgment to determine the fair value.\nOur money market funds are measured at fair value on a recurring basis based on quoted market prices in active markets and are classified as level 1 within the fair value hierarchy. As of June 30, 2021 and 2020, cash equivalents classified as level 1 instruments were measured at $55.4 million and $41.8 million, respectively.\n11. QUARTERLY FINANCIAL DATA (Unaudited)\nFollowing is a summary of quarterly operating results and share data for the years ended June 30, 2021 and 2020, respectively:\n1st Quarter\n2nd Quarter\n3rd Quarter\n4th Quarter\nFiscal Year\n(in thousands, except per share data)\nFiscal Year 2021\nRevenue\n$\n19,063\n$\n19,233\n$\n19,743\n$\n20,248\n$\n78,287\nGross profit\n$\n14,432\n$\n14,522\n$\n14,897\n$\n15,169\n$\n59,020\nIncome from operations\n$\n2,352\n$\n1,896\n$\n1,577\n$\n1,514\n$\n7,339\nNet income\n$\n2,044\n$\n1,606\n$\n1,261\n$\n2,048\n$\n6,959\nBasic net income per share\n$\n0.06\n$\n0.05\n$\n0.04\n$\n0.07\n$\n0.22\nDiluted net income per share\n$\n0.06\n$\n0.05\n$\n0.04\n$\n0.06\n$\n0.21\nFiscal Year 2020\nRevenue\n$\n17,190\n$\n18,155\n$\n18,354\n$\n19,030\n$\n72,729\nGross profit\n$\n11,875\n$\n12,911\n$\n12,854\n$\n14,007\n$\n51,648\nIncome from operations\n$\n1,095\n$\n2,002\n$\n1,757\n$\n2,553\n$\n7,406\nNet income\n$\n1,217\n$\n1,973\n$\n1,867\n$\n2,151\n$\n7,208\nBasic net income per share\n$\n0.04\n$\n0.06\n$\n0.06\n$\n0.07\n$\n0.24\nDiluted net income per share\n$\n0.04\n$\n0.06\n$\n0.06\n$\n0.07\n$\n0.23",
    "item_9": "ITEM 9.\nCHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.",
    "item_9A": "ITEM 9A.\nCONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures.\nWe maintain “disclosure controls and procedures,” as such term is defined in Rule 13a-15(e) under the Securities Exchange Act of 1934 (Exchange Act), that are designed to ensure that information required to be disclosed by us in reports that we file or submit under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in Securities and Exchange Commission rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure. In designing and evaluating our disclosure controls and procedures, management recognized that disclosure controls and procedures, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the disclosure controls and procedures are met. Our disclosure controls and procedures have been designed to meet reasonable assurance standards. Additionally, in designing disclosure controls and procedures, our management necessarily was required to apply its judgment in evaluating the cost-benefit relationship of possible disclosure controls and procedures. The design of any disclosure controls and procedures also is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions.\nBased on their evaluation as of the end of the period covered by this Annual Report on Form 10-K, our Chief Executive Officer and Chief Financial Officer have concluded that, as of June 30, 2021, our disclosure controls and procedures were effective at the reasonable assurance level.\nChanges in Internal Controls.\nThere was no change in our internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act) that occurred during our last fiscal quarter that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nManagement’s Annual Report on Internal Control Over Financial Reporting.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rules 13a-15(f). Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of the effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. Our management, with the participation of our Chief Executive Officer and Chief Financial Officer, conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on our evaluation under the framework in Internal Control-Integrated Framework (2013), our management concluded that our internal control over financial reporting was effective as of June 30, 2021.",
    "item_9B": "ITEM 9B.\nOTHER INFORMATION\nNone.\nPART III",
    "item_10": "ITEM 10.\nDIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by this item is incorporated by reference from the information under the heading “Election of Directors” contained in eGain’s definitive Proxy Statement to be filed with the Securities and Exchange Commission in connection with the solicitation of proxies for eGain’s 2021 Annual Meeting of Stockholders (Proxy Statement).\nCertain information required by this item concerning executive officers is set forth in Part I, Item 1 of this report under the caption “Information About Our Executive Officers” and is incorporated herein by reference.\nThe information contained under the caption “Delinquent Section 16(a) Reports” in the Proxy Statement is incorporated herein by reference.",
    "item_11": "ITEM 11.\nEXECUTIVE COMPENSATION\nThe information contained under the headings “Executive Compensation” and “Compensation Committee Report” and under the captions “2021 Director Compensation” in the Proxy Statement is incorporated herein by reference.",
    "item_12": "ITEM 12.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information contained under the heading “Security Ownership of Certain Beneficial Owners and Management” in the Proxy Statement is incorporated herein by reference.\nThe following table summarizes our equity compensation plans as of June 30, 2021:\nNumber of securities\nNumber of\nremaining available for\nsecurities to be\nWeighted-average\nfuture issuance under\nissued upon exercise\nexercise price of\nequity compensation\nof outstanding\noutstanding options\nplans (excluding securities\noptions and rights\nand rights\nreflected in column (a))\nPlan Category\n(a)\n(b)\n(c)\nEquity compensation plans approved by security holders\n2005 Stock Incentive Plan\n1,562,995\n$\n6.44\n944,527\nEquity compensation plans not approved by security holders\n2005 Management Stock Option Plan\n1,172,517\n$\n3.51\n68,649\nTotal\n2,735,512\n$\n5.18\n1,013,176\nEquity Compensation Plans Not Approved By Security Holders\n2005 Management Stock Option Plan\nIn May 2005, our board of directors adopted the 2005 Management Stock Option Plan (2005 Management Plan), pursuant to which the Compensation Committee may grant non-qualified stock options to purchase up to 962,400 shares of eGain common stock, at an exercise price of not less than 100% of the fair market value of such common stock, to directors, officers and key employees of the Company and its subsidiaries. Options granted under the 2005 Management Plan are subject to vesting as determined by the Compensation Committee. The options are exercisable for up to ten years from the date of grant.\nOur board of directors approved an increase of 500,000 shares of common stock authorized for issuance under the 2005 Management Plan in November 2007 and another increase of 500,000 shares of common stock authorized for issuance under the 2005 Management Plan in September 2011.\nIn September 2014, our board of directors approved an amendment to the 2005 Management Plan that increased the number of shares of common stock reserved for issuance by 1,000,000 shares from 1,962,400 shares to 2,962,400 shares and extended the expiration date of the of the 2005 Management Plan to September 30, 2024.",
    "item_13": "ITEM 13.\nCERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nThe information contained under the captions “Related Party Transactions” and “Director Independence” in the Proxy Statement is incorporated herein by reference.",
    "item_14": "ITEM 14.\nPRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information contained under the heading “Ratification of Independent Registered Public Accounting Firm” in the Proxy Statement is incorporated herein by reference.\nPART IV",
    "item_15": "ITEM 15.\nEXHIBIT AND FINANCIAL STATEMENT SCHEDULES\n(a) 1. Financial Statements\nSee Index to Consolidated Financial Statements in Item 8 of this report.\n2. Financial Statement Schedule\nThe following schedule, which is filed as part of this Form 10-K: Schedule II-Valuation and Qualifying Accounts for the fiscal years ended June 30, 2021 and 2020.\nSCHEDULE II-VALUATION AND QUALIFYING ACCOUNTS\nYears Ended June 30, 2021 and 2020\n(in thousands)\nAmounts\nBalance at\nAdditions\nWritten Off,\nBeginning of\nCharged to\nNet of\nBalance at\nPeriod\nExpense\nRecoveries\nEnd of Period\nAllowance for Doubtful Accounts:\nYear ended June 30, 2021\n$\n$\n$\n(350)\n$\nYear ended June 30, 2020\n$\n$\n$\n(253)\n$\nAll other financial statement schedules have been omitted because they are not applicable or not required or because the information in included elsewhere in the Consolidated Financial Statements or the Notes thereto.\n3. Exhibits\nSee Item 15(b) of this report.\nAll other schedules have been omitted since they are either not required, not applicable or the information has been included in the consolidated financial statements or notes thereto.\n(b) Exhibits\nThe exhibits listed below are filed or incorporated by reference herein. Each management contract or compensatory plan or arrangement required to be filed has been identified.\nExhibit\nNo.\nDescription of Exhibits\n3(i).1\nAmended and Restated Certificate of Incorporation (incorporated by reference to Exhibit 3.1 to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2008).\n3(i).2\nCertificate of Amendment of Certificate of Incorporation (incorporated by reference to Exhibit 3(iii) to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2012).\n3(ii)\nAmended and Restated Bylaws (incorporated by reference to Exhibit 3.4 to the Registrant’s Registration Statement on Form S-1, File No. 333-83439, originally filed with the Commission on July 22, 1999, as subsequently amended (Form S-1)).\n4.1\nForm of Common Stock Certificate (incorporated by reference to Exhibit 4.1 to the Registrant’s Form S-1).\n4.2\nDescription of Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934 (incorporated by reference to Exhibit 4.2 the Registrant’s Annual Report on Form 10-K for the fiscal year ended June 30,2020).\n10.1#\nForm of Indemnification Agreement (incorporated by reference to Exhibit 10.1 to the Registrant’s Form S-1).\n10.2#\neGain Corporation Amended and Restated 2005 Stock Incentive Plan (as amended through August 30 2019) (incorporated by reference to Exhibit 10.1 to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2019).\n10.3#\nAmended and Restated 2005 Management Stock Option Plan (incorporated by reference to Exhibit 10.3 to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2014).\n10.4#\nForm of Executive Change in Control Severance Agreement (incorporated by reference to Exhibit 10.2 to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2015).\n10.5#\neGain Corporation 2017 Employee Stock Purchase Plan (incorporated by reference to Exhibit 10.1 the Registrant’s Quarterly Report on Form 10-Q for the quarter ended December 31, 2020).\n10.6\nCredit Agreement dated as of November 21, 2014 among the Registrant, certain subsidiaries of the Registrant. Wells Fargo Bank N.A. as agent and the lenders party thereto (incorporated by reference to Exhibit 10.6 the Registrant’s Annual Report on Form 10-K for the fiscal year ended June 30, 2020).\n10.7\nAmendment Number One to Credit Agreement dated as of September 1, 2015 among the Registrant, certain subsidiaries of the Registrant, Wells Fargo Bank, N.A., as agent and the lenders party thereto (incorporated by reference to Exhibit 10.7 the Registrant’s Annual Report on Form 10-K for the fiscal year ended June 30, 2020).\n10.8\nAmendment Number Two to Credit Agreement dated as of January 27, 2017 among the Registrant, certain subsidiaries of the Registrant, Wells Fargo Bank, N.A., as agent and the lenders party thereto (incorporated by reference to Exhibit 10.8 the Registrant’s Annual Report on Form 10-K for the fiscal year ended June 30, 2020).\n10.9\nStandard Industrial/Commercial Multi-Tenant Lease Modified Net dated as of May 9, 2011 between the Registrant and DeGuigne Ventures, LLC (incorporated by reference to Exhibit 10.14 to Amendment No. 1 to the Registrant’s Annual Report on Form 10-K for the fiscal year ended June 30, 2014).\n10.11\nFirst Amendment to Standard Industrial/Commercial Multi-Tenant Lease Modified Net dated as of May 14, 2014 between the Registrant and D.R. Stephens Industrial Partners, LLC (Successor in Interest to DeGuigne Ventures, LLC) (incorporated by reference to Exhibit 10.1 to the Registrant’s Current Report on Form 8-K filed on May 19, 2014).\n21.1\nSubsidiaries of eGain.\n23.1\nConsent of BPM LLP, Independent Registered Public Accounting Firm.\n24.1\nPower of Attorney (included on the signature page hereof).\n31.1\nRule 13a-14(a) Certification of Chief Executive Officer.\n31.2\nRule 13a-14(a) Certification of Chief Financial Officer.\n32.1*\nCertification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes Oxley Act of 2002 of Chief Executive Officer.\n32.2*\nCertification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes Oxley Act of 2002 of Chief Financial Officer.\n101.INS\nXBRL Instance Document\n101.SCH\nXBRL Taxonomy Extension Schema Document\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nXBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n#\nIndicates management contract or compensatory plan or arrangement.\n*\nThis exhibit is not deemed “filed” with the Securities and Exchange Commission and is not to be incorporated by reference into any filing of the Registrant under the Securities Act of 1933 or the Securities Exchange Act of 1934, whether made before or after date hereof and irrespective of any general incorporation language contained in such filing.\n(c)\nFinancial Statements\nReference is made to Item 15(a)(2) above.\nITEM 16.\nFORM 10-K SUMMARY\nNot applicable.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\neGain Corporation\nDate: September 10, 2021\nBy:\n/s/ ASHUTOSH ROY\nAshutosh Roy\nChief Executive Officer\nPOWER OF ATTORNEY\nKNOW ALL MEN BY THESE PRESENT, that each person whose signature appears below constitutes and appoints Ashutosh Roy and Eric N. Smit, and each of them, his or her true and lawful attorneys-in-fact and agents, each with full power of substitution and resubstitution, for him or her and in his or her name, place, and stead, in any and all capacities, to sign any and all amendments to this annual report, and to file the same, with exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission, granting unto said attorneys-in-fact and agents, and each of them, full power and authority to do and perform each and every act and thing requisite and necessary to be done, as fully to all intents and purposes as he might or could do in person, hereby ratifying and confirming all that each of said attorneys-in-fact and agents or their substitute or substitutes may lawfully do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nName\nTitle\nDate\n/s/ ASHUTOSH ROY\nChief Executive Officer and Director\n(Principal Executive Officer)\nSeptember 10, 2021\nAshutosh Roy\n/s/ ERIC N. SMIT\nChief Financial Officer\nSeptember 10, 2021\nEric N. Smit\n(Principal Financial\nand Accounting Officer)\n/s/ CHRISTINE RUSSELL\nDirector\nSeptember 10, 2021\nChristine Russell\n/s/ GUNJAN SINHA\nDirector\nSeptember 10, 2021\nGunjan Sinha\n/s/ PHIROZ P. DARUKHANAVALA\nDirector\nSeptember 10, 2021\nPhiroz P. Darukhanavala\n/s/ BRETT SHOCKLEY\nDirector\nSeptember 10, 2021\nBrett Shockley"
}