{
    "cik": "1081745",
    "company": "INTELLINETICS, INC.",
    "filing_type": "10-K",
    "filing_date": "2021-03-30",
    "period_of_report": "2020-12-31",
    "sic": "7372",
    "state_of_inc": "NV",
    "state_location": "OH",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1081745/0001493152-21-007156-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1081745/000149315221007156/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1081745/0001493152-21-007156.txt",
    "filename": "1081745_10K_2020_0001493152-21-007156.htm",
    "item_1": "ITEM 1. BUSINESS\nCompany Overview\nIntellinetics, Inc., formerly known as GlobalWise Investments, Inc. (“Intellinetics”), is a Nevada holding company incorporated in 1997, with two wholly-owned subsidiaries: (i) Intellinetics, Inc., an Ohio corporation (“Intellinetics Ohio”) and (ii) Graphic Sciences, Inc., a Michigan corporation (“Graphic Sciences,” together with Intellinetics Ohio and Intellinetics, the “Company,” “we,” “us” and “our”). Intellinetics Ohio was incorporated in 1996, and on February 10, 2012, Intellinetics Ohio became the sole operating subsidiary of Intellinetics as a result of a reverse merger and recapitalization. On March 2, 2020, Intellinetics purchased Graphic Sciences, Inc.\nThe Company is a document services and solutions software company serving both the small-to-medium business and governmental sectors. Company products and services are provided through two reporting segments: Document Management and Document Conversion. The Company’s Document Management segment consists primarily of solutions involving our software platform, which allows customers to capture and manage all documents across operations such as scanned hard-copy documents and all digital documents including those from Microsoft Office 365, digital images, audio, video and emails. The Company’s Document Conversion offerings provide assistance to clients as a part of their overall document strategy to convert documents from one medium to another, predominantly paper to digital, including migration to our software solutions, as well as long-term storage and retrieval services. The Company’s solutions create value for customers by making it easy to connect business-critical documents to the people who need them by making them easy to find, while also being secure and compliant with the customers’ audit requirements.\nCustomers obtain use of the Company’s software by either purchasing it for installation onto their equipment, referred to as a “premise” model, or by accessing the platform via the Internet, referred to as a “cloud-based,” “software as a service,” or “SaaS” model. The Company continues to see increases in its provision of SaaS-based customer activation, and this migration by clients is the most significant strategic part of its revenue growth opportunity. Our SaaS products are hosted with Amazon Web Services, Expedient, and Skynet Managed Technology Services, offering our customers reliable hosting services with best practices in data security.\nSoftware and Services\nDocument Management\nThe Company’s flagship software platform is IntelliCloudTM, reflecting the Company and market focus on growth via cloud-based managed document service delivery. Our Document Management business also provides software-related professional services that include installation, integration, training, and consulting services, as well as ongoing software maintenance and customer support.\nThe four primary components of the IntelliCloudTM solution are as follows:\n● Image Processing: includes image processing modules used for capturing, transforming and managing images of paper documents, including support of distributed and high-volume capture, optical character recognition;\n● Records Management: addresses needs relating to retention of content through automation and policies, ensuring legal, regulatory and industry compliance for our clients;\n● Workflow: supports business processes, routing content electronically, assigning work tasks and states (e.g., reviews or approvals, including incident case management), and creating related audit trails;\n● Extended Components: includes document composition and e-forms (via third party OEM integration partnership), search, content and web analytics (via third party data visualization and advanced OCR engine partnerships), email and information archiving, packaged application integration, and advanced capture for invoice processing.\nDocument Conversion\nThe Company converts images from paper to digital, paper to microfilm, and microfiche to microfilm for business and federal, county, and municipal governments. Our Document Conversion business also provides its clients with long-term paper and microfilm storage and retrieval options.\nThe four Document Conversion offerings are:\n● Digital Scanning Services. These services include paper scanning, newspaper and microfilm scanning, microfiche scanning, aperture card scanning, drawing scanning, and book scanning. Most government files must be retained for a long term or permanently, making such clients a prime candidate for digital conversion. There are four production categories for these services, consisting of document prep, scanning, indexing, and delivery.\n● Microfilm and Microfiche. We provide microfilming/microfiche, converting scanned images to microfilm or microfiche, and microfilm/microfiche preservation and duplication.\n● Box Storage Services. We provide physical document storage and retrieval services for our clients.\n● Scanning Equipment, Software and Repair. We sell and service document image software, document scanners, and microfilm scanners, readers and printers. This is a smaller, slowly declining part of our Document Conversion business.\nMarketing and Sales\nThe Company has a multi-channel sales model that directs our sales efforts toward both sales through direct sales and through intermediaries, such as software developers and resellers and multi-function device resellers. Our Document Management and Document Conversion segments each use direct and resellers channels for sales. We have developed marketing programs with resellers and distributors (collectively, “Resellers”) that facilitate their selling and support of our software solutions. We believe that our Reseller strategy improvements have increased the competitive strength of our platform of products. In addition, we have established a set of business solutions templates for specific vertical markets that provide base software configurations which we believe will facilitate our delivery and installation of software to our customers in both our direct and Reseller channels. We believe that these advancements, in the aggregate, will allow us to license and sell our products to a targeted customer base, shortening our sales cycle, making margins more consistent, and allowing us to expand our sales through existing and new Reseller partnerships and direct customers. We continue to devote significant efforts, in both development and marketing, in enhancing all channels to market.\nCompetition and Market Position\nThe market for our products is competitive, and we expect that competition will continue to intensify as the document solutions markets evolve and potentially consolidate. We believe that the trend toward electronic document management, and particularly cloud solutions, was accelerated by the COVID-19 pandemic.\nWe believe the primary competitors of our Document Management segment are DocuWare, Square 9, M-files, On-Base, and Laserfiche, who also serve small-to-medium business (SMB) and governmental sectors. The principal competitive factors affecting the market for our document conversion services include: (i) vendor and product reputation; (ii) product quality, performance and price; (iii) the availability of software products on multiple platforms; (iv) product scalability; (v) product integration with other enterprise applications; (vi) software functionality and features; (vii) software ease of use; (viii) the quality of professional services, customer support services and training; and (ix) the ability to address specific customer business problems. We believe that the relative importance of each of these factors depends upon the concerns and needs of each specific customer.\nWe believe the competitors of our Document Conversion segment vary from small, niche entities to larger entities, including Iron Mountain. The principal competitive factors affecting the market for our software products and services include: (i) vendor and services reputation and (ii) services quality, performance and price. We believe that the relative importance of each of these factors depends upon the concerns and needs of each specific customer, and that, for our current and prospective customers, maintaining secure control over the customers’ information is highly valued.\nWe believe that the consolidated Company has advantages over our competitors in the small-to-medium business market, and particularly organizations in highly regulated, risk and compliance-intensive markets, such as state and local government, non-clinical health care, and K-12 education. In our view, the Company will remain competitive by remaining a focused niche provider with product offerings aligned with buyer-specific requirements. We anticipate that the Company will benefit from five specific advantages already in place:\n● Turnkey cloud or premise document workflow and document conversion solutions targeting specific industry customers with benchmark value-to-price ratio;\n● Rigorous quality review process and maintenance of customer data confidentiality in document conversions;\n● Modular solution packaging and rapid customer activation model;\n● Integrated on-demand solutions library as standard platform feature; and\n● Proprietary AuditShieldTM compliance management module as a standard platform feature providing customers with a simple way to know if documents required by law or policy are missing.\nWe believe, with these competitive strengths, that the Company is well positioned as a cloud-based managed document services provider for the small-to-medium business and governmental sectors.\nCustomers\nDocument Management\nFor the twelve months ended December 31, 2020, the two largest customers of our Document Management segment accounted for approximately 6% and 4%, respectively, of the segment’s revenues for that period. For the twelve months ended December 31, 2019, the two largest customers of our Document Management segment accounted for approximately 7% and 6%, respectively, of the segment’s revenues for that period.\nFor the twelve months ended December 31, 2020, and 2019, government contracts represented approximately 37% of the Document Management segment’s net revenues, including a significant portion of the segment’s sales to Resellers which represent ultimate sales to government agencies. Due to their dependence on state, local and federal budgets, government contracts carry short terms, typically 12 months. Since our inception, our contracts with government customers have generally renewed on the original terms and conditions upon expiration.\nDocument Conversion\nOur Document Conversion segment has significant customer concentration with the State of Michigan. Graphic Sciences’ contract is for five years from June 1, 2018 to May 30, 2023 with a provision for two, one-year extensions. The contract is issued to Graphic Sciences through the Michigan Department of Management and Budget, Enterprise Procurement and managed through the Department of Management and Budget, Records Management Services Division (RMS).\nThe contract provides local and state government agencies access to digital and micrographic conversion services. These agencies have the option to perform these conversion services internally or go out to bid if they so choose. Typically, they elect to have these services outsourced to Graphic Sciences through RMS, which eliminates the bidding process.\nAll agencies and departments are able to use the services and prices provided under this contract. Mechanically, the work we perform is invoiced to RMS and the end user is invoiced through the State of Michigan accounting system. We do not invoice the end user directly when entities utilize this contract facility, and we have a single point of contact for managing billing and receipt. The state in effect acts as a reseller of our services to the other agencies and makes a mark-up of what is charged. For the twelve months ended December 31, 2020, the State of Michigan represented approximately 71% of our Document Conversion segment’s net revenues, and 47% of the total Intellinetics revenues.\nIntellectual Property\nOur software and most of the underlying technologies are built on a Microsoft.Net framework. We rely on a combination of copyright, trademark laws, non-disclosure agreements and other contractual provisions to establish and maintain our proprietary intellectual property rights.\nCustomers license the right to use our software products on a non-exclusive basis. We grant to third parties rights in our intellectual property that allow them to market certain of our products on a non-exclusive or limited-scope exclusive basis for a particular application of the product or to a particular geographic area.\nWhile we believe that our intellectual property as a whole is valuable and our ability to maintain and protect our intellectual property rights is important to our success, we also believe that our business as a whole is not materially dependent on any particular trademark, license, or other intellectual property right.\nGovernment Regulation\nWe are subject to federal, state and local laws and regulations affecting our business. Other than government procurement rules affecting sales to governmental customers, we do not believe that we are subject to any special governmental regulations or approval requirements affecting our products or services. Complying with the regulations and requirements applicable to our business does not entail a significant cost or burden. We believe that we are in compliance in all material respects with all applicable governmental regulations.\nSoftware Development\nWe design, develop, test, market, license, and support new software products and enhancements of current products.\nIn accordance with ASC 985-20 “Costs of Software to be Sold, Leased or Otherwise Marketed,” we expense software development costs, including costs to develop software products or the software component of products to be sold, leased, or marketed to external users, before technological feasibility is reached. Technological feasibility is typically reached shortly before the release of such products and as a result, development costs that meet the criteria for capitalization were not material for the periods presented in this report.\nIn accordance with ASC 350-40, “Internal-Use Software,” the Company capitalizes purchase and implementation costs of internal use software. No such costs were capitalized during the periods presented in this report.\nHuman Capital\nAs of March 26, 2021, we employed a total of 98 individuals; all but 9 are full-time employees. Graphic Sciences employs 79 individuals, comprised of 72 full-time and 7 part-time employees, all located in Michigan. Graphic Sciences also utilizes temporary employees, through various agencies, to provide labor for variable project work. Intellinetics Ohio employs 19 individuals, comprised of 17 full-time and 2 part-time employees, primarily located in Ohio. As a combined company, 14 of our employees work in administration and management, 17 of our employees work in software sales, maintenance and support, and software development, and 67 of our employees work in document services and storage operations.\nWe consider the integrity, experience, dedication, creativity, and team-oriented nature of our employees to be an essential driver of our business and a key to our future prospects. Personal relationships with our existing customers are an important part of our business, and our customers have come to rely on the personal service and knowledge of our workforce across all functional areas. To attract and retain qualified applicants to our company and retain our employees, we offer total benefits packages consisting of base salary or hourly wage (depending on position), a comprehensive benefits package, and equity compensation for certain employees. Annual cash bonuses are based on profitability of the Company, achievement of targets and level of responsibility. When selecting talent, we consider education, experience, diversity, and the likelihood that a candidate will espouse our values of integrity, collaboration, dedication, creativity, and superior customer service.\nThe Company is committed to fostering a diverse and inclusive workforce that attracts and retains exceptional talent. In addition, we pride ourselves on an open culture that respects co-workers, values employees’ health and well-being and fosters professional development. We support employee growth and development in a variety of ways including with training opportunities and an overall strategy of promotion from within. Our management conducts annual employee engagement surveys and annual individual employee assessments with an emphasis on individual development for each employee.\nWe remain focused on protecting the health and safety of our employees with respect to COVID-19. In April of 2020, we instituted safe distancing practices and additional cleaning procedures for all company offices and facilities, and our offices in Michigan and Ohio were reconfigured to maintain physical distancing. Wherever feasible, we have encouraged employees to work from home. To date, our remote working arrangements have not significantly affected our ability to maintain critical business operations.\nWe believe that relations with our employees are good. None of our employees are represented by a labor union, and we do not have collective bargaining arrangements with any of our employees. In addition, as of March 26, 2021, the Company engaged two independent contractors.\nExecutive Officers and Board of Directors\nOn December 31, 2020, our executive officers and directors included the following:\nName\nAge\nTitle\nJames F. DeSocio\nPresident, Chief Executive Officer, and Director\nMatthew L. Chretien\nChief Strategy Officer, Chief Technology Officer, Secretary, and Director\nJoseph D. Spain\nChief Financial Officer, Treasurer\nRye D’Orazio\nDirector\nRobert C. Schroeder\nDirector, Chairman of the Board\nSophie Pibouin\nDirector\nRoger Kahn\nDirector\nJames F. DeSocio, President, Chief Executive Officer, and Director. Mr. DeSocio joined the Company on September 25, 2017. Prior to joining the Company, Mr. DeSocio served as Chief Revenue Officer at Relayware, LLC, a global provider of Partner Relationship Management solutions, from January 2015 to September 2017. From January 2013 to November 2014, Mr. DeSocio served as Executive Vice President of Operations for XRS Corporation, a fleet management software solutions provider. From October 2007 to September 2012, Mr. DeSocio served as Executive Vice President of Sales and Business Development for Antenna Software, Inc., a business mobility solutions provider. Mr. DeSocio has extensive experience in sales, marketing, international operations, mergers and acquisitions.\nMatthew L. Chretien, Chief Strategy Officer, Chief Technology Officer, Director. Mr. Chretien is a co-founder of Intellinetics and has served as Secretary since December 19, 2017, Chief Strategy Officer since September 25, 2017, and Chief Technology Officer since September 2011. Mr. Chretien previously served as Intellinetics’ President and Chief Executive Officer from July 2013 to September 2017, and from January 1999 to September 2011; Executive Vice President from September 2011 to July 2013; Chief Financial Officer from September 2011 to September 2012; Treasurer from September 2011 to December 2016; and Vice President from 1996 until 1999. Prior to joining Intellinetics, Mr. Chretien served as the field sales engineer for Unison Industries, a manufacturer of aircraft ignition systems.\nJoseph D. Spain, Chief Financial Officer and Treasurer. Mr. Spain joined the Company on October 31, 2016 and was appointed as its Chief Financial Officer on December 1, 2016. Prior to joining the Company, Mr. Spain worked from September 2014 to October 2016 for nChannel, Inc., a software solutions provider for the small-to-medium business retail sector, ultimately serving as Chief Financial Officer of the company. From July 1995 to June 2014, Mr. Spain worked for Mettler-Toledo International, Inc., a global provider of measurement and precision instruments, ultimately serving as Vice President of Finance & Controller for one of the company’s operating units.\nRye D’Orazio, Director. Mr. D’Orazio has served as a director of Intellinetics since 2006. Mr. D’Orazio has been a partner at Ray & Barney Group since 2001. From 1995 to 2000, Mr. D’Orazio served as Vice President of Professional Services at Compucom. From 1985 to 1995, Mr. D’Orazio was a partner at NCGroup, which he founded. From 1982 to 1995, Mr. D’Orazio was employed as the Vice President of Professional Services at Triangle Systems, and from 1977 to 1982, Mr. D’Orazio was employed as a systems engineer at Electronic Data Systems.\nRobert C. Schroeder, Director. Mr. Schroeder was appointed as a member of our board of directors in September 2013, and as Chairman of the Board on October 5, 2017. Mr. Schroeder is Vice President of Investment Banking at Taglich Brothers and specializes in advisory services and capital raising for small public and private companies. Prior to that, Mr. Schroeder served as Senior Equity Analyst publishing sell-side research on publicly traded companies. Prior to joining Taglich Brothers, he served in various positions in the brokerage and public accounting industry. Mr. Schroeder received a B.S. degree in accounting and economics from New York University. He currently serves on the board of directors of publicly traded Air Industries Group, a manufacturer of aerospace parts and assemblies, Decisionpoint Systems, Inc., a leading provider and integrator of Enterprise Mobility, Wireless Applications and RFID solutions, and Akers BioSciences, Inc., a developer and manufacturer of rapid point-of-care diagnostic screening and testing products.\nSophie Pibouin, Director. Ms. Pibouin was appointed as a member of our board of directors on March 20, 2015. Ms. Pibouin is currently employed by Progress Software as the VP Sales North America. Prior to that she was Head of Sales, U.S. for Resulticks. From 2014 to June 2019 Ms. Pibouin served as the worldwide Sales Leader of the IBM Watson marketing brand. Prior to that, Ms. Pibouin served as Chief Operating Officer, from 2012 to 2014, for SDL, PLC, a global provider of customer experience management software and solutions, having previously worked as a General Manager from 2010 to 2012. From 2006 to 2009, she served as Chief Operating Officer at Chronicle Solutions, Inc., a security software company. From 1990 to 2004, she worked for CA, Inc. (formerly Computer Associates), in a variety of positions including ultimately as Senior Vice President/GM for the Mid-Atlantic Region. She graduated with Honors as a Bachelor in International Commerce from the University of Flaubert in Rouen, France.\nRoger Kahn, Director. Mr. Kahn was appointed as a member of our board of directors on October 5, 2017. Mr. Kahn has served as President and Chief Executive Officer of Bridgeline Digital, Inc. (“Bridgeline”), a web content management solutions provider, since May 2016. Mr. Kahn previously served as Co-Interim Chief Executive Officer and President of Bridgeline from December 2015 to May 2016, and as Chief Operating Officer from August 2015 to May 2016. From 2008 to September 2016, Mr. Kahn was a partner at Great Land Holdings, a resort development company. Mr. Kahn received his Ph.D. in Computer Science and Artificial Intelligence from the University of Chicago.\nAvailable Information\nOur Annual Reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and all amendments to these reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (“Exchange Act”), are available free of charge via our website (www.intellinetics.com) as soon as reasonably practicable after they are filed with, or furnished, to the SEC.",
    "item_1A": "ITEM 1A. RISK FACTORS\nOur business and future operating results may be affected by many risks, uncertainties and other factors, including those set forth below and those contained elsewhere in this report. If any of the following risks were to occur, our business, affairs, assets, financial condition, results of operations, cash flows and prospects could be materially and adversely affected. When we say that something could have a material adverse effect on us or on our business, we mean that it could have one or more of these effects.\nIn addition to the other information contained in this report, the following risk factors should be considered carefully in evaluating our company. Our business, financial condition, liquidity or results of operations could be materially adversely affected by any of these risks.\nRisks Relating to Our Business\nWe have been and could continue to be negatively impacted by the novel coronavirus pandemic (COVID-19) and related governmental actions and orders and market effects.\nThe coronavirus pandemic (COVID-19) and related economic downturn continues to pose various and interrelated risks to our customers, our employees, our vendors and the communities in which we operate, which have all negatively impacted, and may continue to negatively impact, our business. From March 24, 2020 to June 15, 2020, we were obligated to scale back operations in our Graphic Sciences operations, due to Michigan stay-at-home orders, which permitted us to process only those projects qualifying as essential under the state guidance. We resumed operating at full capacity thereafter, but we were unable to make up our ordinary level of revenues in the remainder of 2020 to offset the period in which our operations were reduced. In addition, our biggest customer, the State of Michigan, has not fully resumed its own operations, resulting in a decreased volume of work orders for our Document Conversion segment. Since the stay-at-home order was lifted in June, 2020, through December 31, 2020, Document Conversion segment delivered 89% of 2019 revenues for the same seven months. In addition, our business, financial condition and results of operations could be materially adversely affected if we suffer one or several COVID-19 outbreaks in our facilities or if the State of Michigan issues new stay-at-home orders in the future. We are also likely to be impacted further by decreased customer demand and/or subscription terminations as a result of a reduction in customer spending (especially customers that are state and local governmental entities) or as a result of government-imposed restrictions on businesses. In particular, governmental budget reductions in the State of Michigan, our largest customer, may have a material adverse effect on our business. Finally, due to the portion of our business that generates subscription-based revenue, the effect of COVID-19 may not be fully reflected in our results of operations until future periods. If the pandemic continues to reduce customer’s budgets and restrict business operations, the pandemic may have a material adverse effect on our business, results of operations, financial condition and cash flows and adversely impact the trading price of our common stock.\nAny significant reduction in the sales efforts or cooperative efforts from our partners could materially impact our revenues.\nWe rely on close cooperation with our Resellers for sales and product development as well as for the optimization of opportunities that arise in our competitive environment. In particular, the success of our reseller program is entirely dependent upon our relationships with resellers of multi-functional devices, which are currently being purchased by current and potential customers in our target markets. Our success will depend, in part, upon our ability to maintain access to existing channels of distribution and to gain access to new channels if and when they develop. We may not be able to retain a sufficient number of our existing partners or develop a sufficient number of future partners. We are unable to predict the extent to which our partners will be successful in marketing and licensing our products. A reduction in partner cooperation or sales efforts, or a decline in the number of channels, could materially reduce revenues.\nIf we are unable to continue to attract new customers and increase market awareness of our company and solutions, our revenue growth could be slower than we expect or could decline.\nWe believe that our future growth depends in part upon increasing our customer base. Our ability to achieve significant growth in revenue in the future will depend, in part, upon continually attracting new customers and obtaining subscription renewals to our solutions from those customers. Market awareness of our capabilities and solutions is essential to our ability to generate new leads for expanding our business and our continued growth. If we fail to sufficiently invest in our marketing programs or they are unsuccessful in attracting new customers by creating market awareness of our company and solutions, our business may be harmed.\nIf our existing customers fail to renew their support agreements, or if customers do not license updated products on terms favorable to us, our revenues could be adversely affected.\nWe currently derive a significant portion of our overall revenues from maintenance services and software subscriptions, and we depend on our installed customer base for future revenue from maintenance services and software subscriptions and licenses of updated products. The IT industry generally has been experiencing increasing pricing pressure from customers when purchasing or renewing support agreements. Moreover, the trend towards consolidation in certain industries that we serve, such as financial services, could result in a reduction of the software under agreement and put pressure on our maintenance and support terms with customers who have merged. Given this environment, there can be no assurance that our current customers will renew their maintenance agreements or agree to the same terms when they renew, which could result in our reducing or losing maintenance fees. If our existing customers fail to renew their maintenance agreements, or if we are unable to generate additional maintenance fees through the licensing of updated products to existing or new customers, our business and future operating results could be adversely affected.\nReduced IT or enterprise software spending may adversely impact our business.\nOur business depends on the overall demand for IT and enterprise software spend and on the economic health of our current and prospective customers. Any meaningful reduction in IT or enterprise software spending or weakness in the economic health of our current and prospective customers could harm our business in a number of ways, including longer sales cycles and lower prices for our solutions.\nCurrent and future competitors could have a significant impact on our ability to generate future revenues and profits.\nThe markets for our products are intensely competitive, and are subject to rapid technological change and other pressures created by changes in our industry. The convergence of many technologies has resulted in unforeseen competitors arising from companies that were traditionally not viewed as threats to our marketplace. We expect competition to increase and intensify in the future as the pace of technological change and adaptation quickens, and as additional companies enter our markets, including those competitors who offer similar products and services to ours, but offer them through a different form of delivery. Numerous releases of competitive products have occurred in recent history and are expected to continue in the future. We may not be able to compete effectively with current competitors and potential entrants into our marketplace. We could lose market share if our current or prospective competitors: (i) introduce new competitive products, (ii) add new functionality to existing products, (iii) acquire competitive products, (iv) reduce prices, or (v) form strategic alliances with other companies. If other businesses were to engage in aggressive pricing policies with respect to competing products, or if the dynamics in our marketplace resulted in increased bargaining power by the consumers of our products and services, we would need to lower the prices we charge for the products we offer. This could result in lower revenues or reduced margins, either of which could materially and adversely affect our business and operating results. Additionally, if prospective consumers choose other methods of document solutions delivery, different from those that we offer, our business and operating results could also be materially and adversely affected.\nConsolidation in the industry, particularly by large, well-capitalized companies, could place pressure on our operating margins which could, in turn, have a material adverse effect on our business.\nAcquisitions by large, well-capitalized technology companies have changed the marketplace for our goods and services by replacing competitors that are comparable in size to our company with companies that have more resources at their disposal to compete with us in the marketplace. In addition, other large corporations with considerable financial resources either have products that compete with the products we offer, or have the ability to encroach on our competitive position within our marketplace. These companies have considerable financial resources, channel influence, and broad geographic reach; thus, they can engage in competition with our products and services on the basis of sales price, marketing, services, or support. They also have the ability to introduce items that compete with our maturing products and services. The threat posed by larger competitors and their ability to use their better economies of scale to sell competing products and services at a lower cost may materially reduce the profit margins we earn on the goods and services we provide to the marketplace. Any material reduction in our profit margin may have a material adverse effect on the operations or finances of our business, which could hinder our ability to raise capital in the public markets at opportune times for strategic acquisitions or general operational purposes, which may prevent effective strategic growth or improved economies of scale or put us at a disadvantage to our better-capitalized competitors.\nWe must manage our internal resources during periods of company growth, or our operating results could be adversely affected.\nThe document solutions market has continued to evolve at a rapid pace. If we are successful in growing the Company, any growth will place significant strains on our administrative and operational resources, and increase demands on our internal systems, procedures and controls. Our administrative infrastructure, systems, procedures and controls may not adequately support our operations. In addition, our management may not be able to achieve a rapid, effective execution of the product and business initiatives necessary to successfully implement our operational and competitive strategy. If we are unable to manage growth effectively, our operating results will likely suffer which may, in turn, adversely affect our business.\nWe may be unable to acquire other businesses, technologies or companies or engage in other strategic transactions, and we may not be able to successfully realize the benefits of and may be exposed to a variety of risks from any such strategic transactions.\nThe Graphic Sciences Acquisition and the acquisition of CEO Image Systems, Inc. are the first strategic business acquisitions for the Company. As part of our growth strategy, we also expect to continue to evaluate and consider potential strategic transactions, including business combinations, acquisitions and strategic alliances, to enhance our existing businesses and to develop new products and services. At any given time, we may be engaged in discussions or negotiations with respect to one or more of these types of transactions, and any of these transactions could be material to our financial condition and results of operations. However, we do not know if we will be able to identify any future opportunities that we believe will be beneficial for us. Even if we are able to identify an appropriate business opportunity, we may not be able to successfully consummate the transaction, and even if we do consummate such a transaction we may be unable to obtain the benefits or avoid the difficulties and risks of such transaction.\nAny future acquisition involves risks commonly encountered in business relationships, including:\n● difficulties in assimilating and integrating the operations, personnel, systems, technologies, finance and accounting functions, internal controls, business policies, and products and services of the acquired business;\n● technologies, products or businesses that we acquire may not achieve expected levels of revenue, profitability, benefits or productivity;\n● we may not be able to achieve the expected synergies from an acquisition, or it may take longer than expected to achieve those synergies;\n● unexpected costs and liabilities and unknown risks associated with the acquisition;\n● diversion of management’s time and resources away from our daily operations;\n● risks of entering markets in which we have no or limited direct prior experience;\n● potential need for restructuring operations or reductions in workforce, which may result in substantial charges to our operations;\n● incurring future impairment charges related to diminished fair value of businesses acquired as compared to the price we paid for them; and\n● issuing potentially dilutive equity securities, or incurring debt or contingent liabilities, which could harm our financial condition.\nWe cannot assure you that we will make any additional acquisitions, or that any future acquisitions will be successful, will assist us in the accomplishment of our business strategy, or will generate sufficient revenues to offset the associated costs and other adverse effects or will otherwise result in us receiving the intended benefits of the acquisition. In addition, we cannot assure you that any future acquisition of new businesses or technology will lead to the successful development of new or enhanced customer relationships, products, and services, or that any new or enhanced products and services, if developed, will achieve market acceptance or prove to be profitable.\nRisks Related to Product Development\nWe need to continue to develop new technologically-advanced products that successfully integrate with the software products and enhancements used by our customers.\nOur success depends upon our ability to design, develop, test, market, license, and support new software products and enhancements of current products on a timely basis in response to both competitive threats and marketplace demands. Recent examples of significant trends in the software industry include cloud computing, mobility, social media, networking, browser, and software as a service. In addition, software products and enhancements must remain compatible with standard platforms and file formats. Often, we must integrate software licensed or acquired from third parties with our proprietary software to create or improve our products. If we are unable to achieve a successful integration with third-party software, we may not be successful in developing and marketing our new software products and enhancements. If we are unable to successfully integrate third-party software to develop new software products and enhancements to existing products, or to complete products currently under development which we license or acquire from third parties, our operating results will materially suffer. In addition, if the integrated or new products or enhancements do not achieve acceptance by the marketplace, our operating results will materially suffer. Also, if new industry standards emerge that we do not anticipate or adapt to, our software products could be rendered obsolete and, as a result, our business and operating results, as well as our ability to compete in the marketplace, would be materially harmed.\nIf our products and services do not gain market acceptance, our operating results may be negatively affected.\nWe intend to pursue our strategy of growing the capabilities of our document solutions software offerings through our proprietary research and the development of new product offerings. In response to customer demand, it is important to our success that we continue: (i) to enhance our products, and (ii) to seek to set the standard for document solutions capabilities in the small-to-medium market. The primary market for our software and services is rapidly evolving, due to the nature of the rapidly changing software industry, which means that the level of acceptance of products and services that have been released recently or that are planned for future release by the marketplace is not certain. If the markets for our products and services fail to develop, develop more slowly than expected or become subject to increased competition, our business may suffer. As a result, we may be unable to: (i) successfully market our current products and services, (ii) develop new software products, services and enhancements to current products and services, (iii) complete customer installations on a timely basis, or (iv) complete products and services currently under development. In addition, increased competition could put significant pricing pressures on our products, which could negatively impact our margins and profitability. If our products and services are not accepted by our customers or by other businesses in the marketplace, our business and operating results will be materially affected.\nOur investment in our current research and development efforts may not provide a sufficient, timely return.\nThe development of document solutions software products is a costly, complex, and time-consuming process, and the investment in document solutions software product development often involves a long wait until a return is achieved on such an investment. When cash is available, we make and will continue to make significant investments in software research and development and related product opportunities. Investments in new technology and processes are inherently speculative. Commercial success depends on many factors including the degree of innovation of the products developed through our research and development efforts, sufficient support from our strategic partners, and effective distribution and marketing. Accelerated product introductions and short product life cycles require high levels of expenditures for research and development. These expenditures may adversely affect our operating results if they are not offset by increased revenues. We believe that we must continue to dedicate a significant amount of resources to our research and development efforts in order to maintain our competitive position. However, significant revenues from new product and service investments may not be achieved for a number of years, if at all. Moreover, new products and services may not be profitable, and even if they are profitable, operating margins for new products and businesses may not be as high as the margins we have experienced for our current or historical products and services.\nProduct development is a long, expensive, and uncertain process, and we may terminate one or more of our development programs.\nWe may determine that certain product candidates or programs do not have sufficient potential to warrant the continued allocation of resources. Accordingly, we may elect to terminate one or more of our programs for such product candidates. If we terminate a product in development in which we have invested significant resources, our prospects may suffer, as we will have expended resources on a project that does not provide a return on our investment and we may have missed the opportunity to have allocated those resources to potentially more productive uses, and this may negatively impact our business operating results or financial condition.\nOur products may contain defects that could harm our reputation, be costly to correct, delay revenues, and expose us to litigation.\nOur products are highly complex and sophisticated and, from time to time, may contain design defects or software errors that are difficult to detect and correct. Errors may be found in new software products or improvements to existing products after delivery to our customers. If these defects are discovered, we may not be able to successfully correct such defects in a timely manner. In addition, despite the tests we conduct on all of our products, we may not be able to fully simulate the environment in which our products will operate and, as a result, we may be unable to adequately detect the design defects or software errors which may become apparent only after the products are installed in an end-user’s network. The occurrence of errors and failures in our products could result in the delay or the denial of market acceptance of our products, and alleviating such errors and failures may require us to make significant expenditure of our resources. The harm to our reputation resulting from product errors and failures may be materially damaging. Because we regularly provide a warranty with our products, the financial impact of fulfilling warranty obligations may be significant in the future. Our agreements with our strategic partners and end-users typically contain provisions designed to limit our exposure to claims. These agreements regularly contain terms such as the exclusion of all implied warranties and the limitation of the availability of consequential or incidental damages. However, such provisions may not effectively protect us against claims and the attendant liabilities and costs associated with such claims. Accordingly, any such claim could negatively affect our business, operating results or financial condition.\nThe use of open-source software in our products may expose us to the risk of having to disclose the source code to our product, rendering our software no longer proprietary and reducing or eliminating its value.\nCertain open-source software is licensed pursuant to license agreements that require a user who distributes the open-source software as a component of the user’s software to disclose publicly part or all of the source code to the user’s software. This effectively renders what was previously proprietary software open-source software. As competition in our markets increases, we must strive to be cost-effective in our product development activities. Many features we may wish to add to our products in the future may be available as open-source software, and our development team may wish to make use of this software to reduce development costs and speed up the development process. While we carefully monitor the use of all open-source software and try to ensure that no open-source software is used in such a way as to require us to disclose the source code to the related product, such use could inadvertently occur. Additionally, if a third party has incorporated certain types of open-source software into its software but has failed to disclose the presence of such open-source software, and we embed that third-party software into one or more of our products, we could, under certain circumstances, be required to disclose the source code to our product. This could have a material adverse effect on our business.\nThe loss of licenses to use third-party software or the lack of support or enhancement of such software could adversely affect our business.\nWe currently depend upon a limited number of third-party software products. If such software products were not available, we might experience delays or increased costs in the development of our products. In certain instances, we rely on software products that we license from third parties, including software that is integrated with internally-developed software, and which is used in our products to perform key functions. These third-party software licenses may not continue to be available to us on commercially reasonable terms, and the related software may not continue to be appropriately supported, maintained, or enhanced by the licensors. The loss by us of the license to use, or the inability by licensors to support, maintain, and enhance any of such software, could result in increased costs or in delays or reductions in product shipments until equivalent software is developed or licensed and integrated with internally-developed software. Such increased costs or delays or reductions in product shipments could adversely affect our business.\nFinancial Risks\nWe need to continue to maintain an effective system of internal controls, in order to be able to report our financial results accurately and timely and prevent fraud.\nEffective internal control is necessary for us to provide reliable financial reports and prevent fraud. We maintain a small accounting and reporting staff, concentrated in a few individuals. Any future weaknesses in our internal controls and procedures over financial reporting could result in material misstatements in our consolidated financial statements not being prevented or detected. We may experience difficulties or delays in completing remediation or may not be able to successfully remediate material weaknesses at all. Any material weakness or unsuccessful remediation could affect our ability to file periodic reports on a timely basis and investor confidence in the accuracy and completeness of our consolidated financial statements, which in turn could harm our business and have an adverse effect on our stock price and our ability to raise additional funds.\nWe may not be able to generate sufficient cash to service any indebtedness or contingent transaction consideration that we may incur from time to time, which could force us to sell assets, cease operations, or take other detrimental actions for our business.\nOur ability to make scheduled payments on or to refinance any debt or contingent transaction obligations that we have or may incur depends on our financial condition and operating performance, which are subject to prevailing economic and competitive conditions and to certain financial, business, and other factors beyond our control. In addition, the Company has operated with a history of losses. For the twelve months ended December 31, 2019, prior to the acquisitions, Intellinetics had a net loss of $2,133,281. For the twelve months ended December 31, 2020, Intellinetics had a net loss of $8,961 excluding significant transaction costs of $636,440 and change in fair value of earnout liabilities of $1,554,800. Intellinetics has an accumulated deficit of $22,996,267 as of December 31, 2020. These financial conditions raise substantial doubt over the Company’s ability to meet all of its obligations over the twelve months following the date of this Report. Prior to the third quarter of 2020, management has historically assessed that there was substantial doubt regarding our ability to continue as a going concern. However, management has evaluated these conditions and believes, based on its current plans and expectations, that it will be able to meet those obligations, although there is no assurance. We cannot ensure that we will maintain a level of cash flows from operating activities sufficient to permit us to pay the principal, premium, if any, and interest on any indebtedness or the contingent transaction consideration.\nIf our cash flows and capital resources are at any time insufficient to fund our obligations, we may be forced to reduce or delay investments and capital expenditures, or to sell assets, seek additional capital, restructure or refinance our indebtedness, or reduce or cease operations. There can be no assurance that additional capital or debt financing will be available to us at any time. Even if additional capital is available, we may not be able to obtain debt or equity financing on terms favorable to us. In the absence of such operating results and resources, we could face substantial liquidity problems and might be required to reduce or curtail our operations.\nIf our estimates or judgments relating to our critical accounting policies are based on assumptions that change or prove to be incorrect, our operating results could fall below expectations of securities analysts and investors,\nresulting in a decline in our stock price.\nThe preparation of consolidated financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the amounts reported in the consolidated financial statements and accompanying notes. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances, as provided in “Management’s Discussion and Analysis of Financial Condition and Results of Operations-Critical Accounting Policies and Estimates” in this Annual Report on Form 10-K, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Our operating results may be adversely affected if our assumptions change or if actual circumstances differ from those in our assumptions, which could cause our operating results to fall below the expectations of securities analysts and investors, resulting in a decline in our stock price. Significant assumptions and estimates used in preparing our consolidated financial statements include those related to revenue recognition, deferred contract costs and commission expense, accounting for business combination, troubled debt restructuring and stock compensation.\nThe loss of a major customer or the failure to collect a large account receivable could negatively affect our results of operations and financial condition.\nRevenues from a limited number of customers have accounted for a substantial percentage of our total revenues. Our two largest clients account for approximately 47% and 8%, and 6% and 10%, of our revenues for the twelve months ending December 31, 2020 and 2019, respectively. For the twelve months ended December 31, 2020, and 2019, government contracts represented approximately 64% and 41% of our net revenues, respectively. For the twelve months ended December 31, 2020, and 2019, the most significant of these government contracts, represented approximately 47% and 6% of our net revenues, respectively. Due to their dependence on state, local and federal budgets, government contracts carry short terms, typically less than 18 months. The loss of a meaningful percentage of government contracts could materially affect our business and operating results.\nA significant downturn in our business may not be immediately reflected in our operating results because of the way we recognize revenue.\nWe recognize revenue from subscription agreements ratably over the terms of these agreements, which are typically one year. As a result, a significant portion of the revenue we report in each quarter is generated from customer agreements entered into during previous periods, which is reflected as deferred revenue on our balance sheet. Consequently, a decline in new or renewed subscriptions, or a downgrade of renewed subscriptions to less-expensive editions, in any one quarter may not be fully reflected in our revenue in that quarter, and may negatively affect our revenue in future quarters. If contracts having significant value expire and are not renewed or replaced at the beginning of a quarter or are downgraded, our revenue may decline significantly in that quarter and subsequent quarters.\nLegal and Regulatory Risks\nOur contracts with government clients subject us to risks including early termination, audits, investigations, sanctions, and penalties.\nA significant portion of our revenues comes from contracts with state and local governments, and their respective agencies, which may terminate most of these contracts at any time, without cause. The percentage of revenue from governmental contracts as a percentage of total revenue for the periods ended December 31, 2020 and December 31, 2019 were 64% and 41%, respectively. At this time, governments and their agencies are operating under increased pressure to reduce spending. Contracts at the state and local levels are subject to government funding authorizations. Additionally, government contracts are generally subject to audits and investigations that could result in various civil and criminal penalties and administrative sanctions, including termination of contracts, refund of a portion of fees received, forfeiture of profits, suspension of payments, fines and suspensions, or debarment from future government business.\nThe Company is subject to the reporting requirements of federal securities laws, causing the Company to make significant compliance-related expenditures that may divert resources from other projects, thus impairing its ability to grow.\nThe Company is subject to the information and reporting requirements of the Exchange Act, and other federal securities laws, including the Sarbanes-Oxley Act. The costs of preparing and filing annual and quarterly reports, proxy statements and other information with the Commission and furnishing audited reports to stockholders causes our expenses to be higher than most other similarly-sized companies that are privately held. As a public company, we expect these rules and regulations to continue to keep our compliance costs high in 2020 and beyond, and to make certain activities more time-consuming and costly. As a public company, we also expect that these rules and regulations may make it more difficult and expensive for us to obtain director and officer liability insurance in the future, and we may be required to accept reduced policy limits and coverage or incur substantially higher costs to obtain the same or similar coverage. As a result, it may be more difficult for us to attract and retain qualified persons to serve on our board of directors or as executive officers.\nThe elimination of monetary liability against our directors, officers, agents and employees under Nevada law, and the existence of indemnification rights to such persons, may result in substantial expenditures by the Company and may discourage lawsuits against our directors, officers, agents and employees.\nOur articles of incorporation and bylaws contain provisions permitting us to eliminate the personal liability of our directors, officers, agents and employees to the Company and its stockholders for damages for breach of fiduciary duty to the extent provided by Nevada law. We may also have contractual indemnification obligations under our employment agreements with our officers. The foregoing indemnification obligations could result in the Company incurring substantial expenditures to cover the cost of settlement or damage awards against directors, officers, agents and employees, which we may be unable to recoup. These provisions and resultant costs may also discourage our Company from bringing a lawsuit against certain individuals for breaches of their fiduciary duties, and may similarly discourage the filing of derivative litigation by our stockholders against our directors, officers, agents and employees even though such actions, if successful, might otherwise benefit the Company and stockholders.\nSecurity breaches may harm our business.\nAny security breaches, unauthorized access, unauthorized usage, virus or similar breach or disruption could result in loss of confidential information, damage to our reputation, early termination of our contracts, litigation, regulatory investigations or other liabilities. Our clients may use our products and services to handle personally identifiable information, sensitive personal information, protected health information, or information that is otherwise confidential. If our security measures or those of our third-party data centers are breached as a result of third-party action, employee error, malfeasance or otherwise and, as a result, someone obtains unauthorized access to customer data, our reputation could be damaged, our business may suffer and we could incur significant liability.\nThe United States has laws and regulations relating to data privacy, security, and retention and transmission of information. We have certain measures to protect our information systems against unauthorized access and disclosure of our confidential information and confidential information belonging to our customers. We have policies and procedures in place dealing with data security and records retention. However, there is no assurance that the security measures we have put in place will be effective in every case.\nThere has been an increase in the number of private privacy-related lawsuits filed against companies in recent years. There has also been an increase in the incidence of data breaches in public companies operating in the US, resulting in unfavorable publicity and high amounts of damages against the breached companies, including the cost of obtaining credit monitoring services for all persons whose information was compromised. In addition, we are unable to predict what additional legislation or regulation in the area of privacy of personal information could be enacted and what effect that could have on our operations and business. Concerns about our practices with regard to the collection, use, disclosure, or security of personal information or other privacy-related matters, even if unfounded and even if we are in compliance with applicable laws, could damage our reputation and harm our business.\nBreaches, or perceived breaches, in security could result in a negative impact for us and for our customers, potentially affecting our business, assets, revenues, brand, and reputation, and resulting in penalties, fines, litigation, and other potential liabilities, in each case depending upon the nature of the information disclosed. These risks to our business may increase as we expand the number of products and services we offer.\nWe may become involved in litigation that may materially adversely affect us.\nFrom time to time in the ordinary course of our business, we may become involved in various legal proceedings, including commercial, product liability, employment, class action, and other litigation and claims, as well as governmental and other regulatory investigations and proceedings. We provide business management solutions that we believe are critical to the operations of our customers’ businesses and provide benefits that may be difficult to quantify. Any failure of a customer’s system installed by us or of the services offered by us could result in a claim for substantial damages against us, regardless of our responsibility for the failure. Although we attempt to limit our contractual liability for damages resulting from negligent acts, errors, mistakes, or omissions in rendering our services, we cannot assure you that the limitations on liability we include in our agreements will be enforceable in all cases, or that those limitations on liability will otherwise protect us from liability for damages. There can be no assurance that any insurance coverage we may have in place will be adequate or that current coverages will remain available at acceptable costs. Such matters can be time-consuming, divert management’s attention and resources, and cause us to incur significant expenses. Furthermore, because litigation is inherently unpredictable, the results of any such actions may have a material adverse effect on our business, operating results, or financial condition.\nAny claim that we infringe on a third party’s intellectual property could materially increase costs and materially harm our ability to generate future revenues and profits.\nClaims of infringement are becoming increasingly common as the software industry develops and as related legal protections, including patents are applied to software products. Although we are not aware of any infringement on the rights of third parties, third parties may assert infringement claims against us in the future. Although most of our technology is proprietary in nature, we do include certain third-party software in our products. In these cases, this software is licensed from the entity holding the intellectual property rights. Although we believe that we have secured proper licenses for all third-party software that is integrated into our products, third parties may assert infringement claims against us in the future. The third parties making these assertions and claims may include non-practicing entities (known as “patent trolls”) whose business model is to obtain patent-licensing revenues from operating companies, such as ours. Any such assertion, regardless of merit, may result in litigation or may require us to obtain a license for the intellectual property rights of third parties. Such licenses may not be available, or they may not be available on reasonable terms. In addition, such litigation could be time-consuming, disruptive to our ability to generate revenues or enter into new market opportunities, and may result in significantly increased costs as a result of our defense against those claims or our attempt to license the intellectual property rights or rework our products to avoid infringement of third-party rights to ensure they comply with judicial decisions. Our agreements with our partners and end-users typically contain provisions that require us to indemnify them, with certain limitations on the total amount of such indemnification, for damages sustained by them as a result of any infringement claims involving our products. Any of the foregoing results of an infringement claim could have a significant adverse impact on our business and operating results, as well as our ability to generate future revenues and profits.\nRisks Relating to Our Common Stock\nWe may have to issue additional securities at prices which may result in substantial dilution to our stockholders.\nIf we raise additional funds through the sale of equity or convertible debt, our current stockholders’ percentage ownership will be reduced. In addition, these transactions may dilute the value of ordinary shares outstanding. We may have to issue securities that may have rights, preferences, and privileges senior to our common stock. We cannot provide assurance that we will be able to raise additional funds on terms acceptable to us, if at all. If future financing is not available or is not available on acceptable terms, we may not be able to fund our future needs, which would have a material adverse effect on our business plans, prospects, results of operations, and financial condition.\nShares of our common stock that have not been registered under the Securities Act, regardless of whether such shares are restricted or unrestricted, are subject to resale restrictions imposed by Rule 144.\nPursuant to Rule 144 of the Securities Act of 1933, as amended (the “Securities Act”), a “shell company” is defined as a company that has no or nominal operations, and either no or nominal assets, assets consisting solely of cash and cash equivalents, or assets consisting of any amount of cash and cash equivalents and nominal other assets. As such, we were a shell company pursuant to Rule 144 prior to 2012. Even though we are no longer a shell company, investors may be reluctant to invest in our securities because securities of a former shell company may not be as freely tradable as securities of companies that are not former “shell companies.” In addition, since the Company is a former shell company, shareholders with restricted securities cannot rely upon Rule 144 for sales of restricted securities in the event that the Company is not current in its filing obligations under the Exchange Act.\nOur shares are quoted on the OTCQB and are subject to limited trading, a high degree of volatility, and liquidity risk.\nOur common stock is currently quoted on the OTCQB. Shares of our common stock have had very limited and sporadic trading in the past. As such, we believe our stock price to be more volatile and the share liquidity characteristics to be of higher risk than if we were listed on one of the national exchanges. Due to this volatility, our stock price as quoted by the OTCQB may not reflect an actual or perceived value of our common stock. In the past, several days have passed between trades in our common stock, meaning that at any given time, there may be few or no investors interested in purchasing our common stock at or near ask prices. This limited trading, volatility, and liquidity risk is attributable to 1) the fact that we are a small company relatively unknown to stock analysts, brokers, and institutional or other investors, and 2) analysts, brokers, and investors may also be hesitant to follow a company such as ours that faces substantial doubt about its ability to continue as a going concern. Finally, if our stock were no longer quoted on the OTCQB, the ability to trade our stock would become even more limited and investors might not be able to sell their shares. Consequently, investors must be prepared to bear the economic risk of holding the securities for an indefinite period of time. There is no assurance that a more active market for our common stock will develop or be sustained, which limits the liquidity of our common stock, and could have a material adverse effect on the price of our common stock and our ability to raise capital.\nThe market price of our common stock may limit the appeal of certain alternative compensation structures that we might offer to the high-quality employees we seek to attract and retain.\nIf the market price of our common stock performs poorly, such performance may adversely affect our ability to retain or attract critical personnel. For example, if we were to offer options to purchase shares of our common stock as part of an employee’s compensation package, the attractiveness of such a compensation package would be highly dependent upon the performance of our common stock.\nIn addition, any changes made to any of our compensation practices which are made necessary by governmental regulations or competitive pressures could adversely affect our ability to retain and motivate existing personnel and recruit new personnel. For example, any limit to total compensation which may be prescribed by the government, or any significant increases in personal income tax levels in the United States, may hurt our ability to attract or retain our executive officers or other employees whose efforts are vital to our success.\nShares eligible for future sale may adversely affect the market price of our common stock.\nFrom time to time, certain of our stockholders may be eligible to sell all or some of their shares of common stock by means of ordinary brokerage transactions in the open market pursuant to Rule 144 of the Securities Act, subject to certain limitations. Any substantial sale of our common stock pursuant to Rule 144 may have an adverse effect on the market price of our common stock.\nThe price of our common stock may fluctuate significantly and lead to losses by stockholders.\nThe common stock of public companies can experience extreme price and volume fluctuations. These fluctuations often have been unrelated or out of proportion to the operating performance of such companies. We expect our stock price to be similarly volatile. These broad market fluctuations may continue and could harm our stock price. Any negative change in the public’s perception of the prospects of our business or companies in our industry could also depress our stock price, regardless of our actual results. Factors affecting the trading price of our common stock may include:\n● Variations in operating results;\n● Announcements of technological innovations, new products or product enhancements, strategic alliances, or significant agreements by us or by competitors;\n● Recruitment or departure of key personnel;\n● Litigation, legislation, regulation, or technological developments that adversely affect our business; and\n● Market conditions in our industry, the industries of our customers, and the economy as a whole.\nFurther, the stock market in general, and securities of smaller companies in particular, can experience extreme price and volume fluctuations. Continued market fluctuations could result in extreme volatility in the price of our common stock, which could cause a decline in the value of our common stock. You should also be aware that price volatility might be worse if the trading volume of our common stock is low. Occasionally, periods of volatility in the market price of a company’s securities may lead to the institution of securities class action litigation against a company. Due to the volatility of our stock price, we may be the target of such securities litigation in the future. Such legal action could result in substantial costs to defend our interests and a diversion of management’s attention and resources, each of which would have a material adverse effect on our business and operating results.\nOur common stock is currently subject to the “penny stock” rules of the SEC, which makes transactions in our common stock more cumbersome and could adversely affect trading in our common stock.\nBroker-dealer practices in connection with transactions in “penny stocks” are regulated by certain rules adopted by the SEC. Penny stocks generally are equity securities with a market price of less than $5.00 per share, subject to exceptions. The rules require that a broker-dealer, before a transaction in a penny stock not otherwise exempt from the rules, deliver a standardized risk disclosure document that provides information about penny stocks and the risks in the penny stock market. The broker-dealer also must provide the customer with current bid and offer quotations for the penny stock, the compensation of the broker-dealer and its salesperson in connection with the transaction, and monthly account statements showing the market value of each penny stock held in the customer’s account. In addition, the rules generally require that before a transaction in a penny stock, the broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchaser’s written agreement to the transaction. These disclosure requirements may have the effect of reducing the liquidity of penny stocks. Our common stock has only briefly traded above $5.00 per share, and as such the holders of our common stock or other of our securities may find it more difficult to sell their securities.\nFINRA sales practice requirements may also limit a shareholder’s ability to buy and sell our stock.\nIn addition to the “penny stock” rules described above, the Financial Industry Regulatory Authority has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative, low-priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customer’s financial status, tax status, investment objectives, and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative, low-priced securities will not be suitable for at least some customers. The FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit your ability to buy and sell our stock and have an adverse effect on the market for our shares.\nWe do not expect to pay any dividends on our common stock for the foreseeable future.\nWe do not anticipate that we will pay any cash dividends to holders of our common stock in the foreseeable future. Instead, we plan to retain any earnings to maintain and expand our existing operations. The declaration, payment, and amount of any future dividends, if any, will be made at the discretion of our board of directors, and will depend upon, among other things, the results of our operations, cash flows and financial condition, operating and capital requirements, and other factors that the board of directors considers relevant. We currently are subject to loan covenants that would require consent from our lenders in order to pay any dividends prior to repayment of certain outstanding loans. In addition, any future credit facilities we enter into may contain terms prohibiting or limiting the amount of dividends that may be declared or paid on our common stock.\nGeneral Risks\nGlobal economic conditions and uncertainty are likely to adversely affect our operating results or financing in ways that are hard to predict or to defend against.\nOur overall performance depends on economic conditions. The United States’ and world economies are currently suffering from uncertainty, volatility, disruption, and other adverse conditions, primarily caused by the current outbreak of and containment strategies for the coronavirus disease (COVID-19), and those conditions will continue to adversely impact the business community and financial markets for some time. Moreover, instability in the global economy affects countries, including the United States, with varying levels of severity, which makes the impact on our business complex and unpredictable. During adverse economic conditions, many customers delay or reduce technology purchases. Contract negotiations are likely to become more protracted, or conditions could result in reductions in sales of our products, longer sales cycles, pressure on our margins, difficulties in collection of accounts receivable or delayed payments, increased default risks associated with our accounts receivable, slower adoption of new technologies, and increased price competition. In addition, a curtailment of the United States and global credit markets could adversely impact our ability to complete sales of our products and services, including maintenance and support renewals. Any of these prolonged events, are likely to cause a curtailment in government or corporate spending and delay or decrease customer purchases, and adversely affect our business, financial condition, and results of operations.\nBusinesses and industries throughout the world are very tightly connected to each other. Thus, financial developments seemingly unrelated to us or to our industry may adversely affect us over the course of time. For example, credit contraction in financial markets may hurt our ability to access credit in the event that we require significant access to credit for other reasons. Similarly, volatility in our stock price could hurt our ability to raise capital for the financing of acquisitions or other reasons. Any of these events, or any other events caused by the current turmoil in domestic or international financial markets, may have a material adverse effect on our business, operating results, and financial condition.\nAny disruption of service at data centers that house our equipment and deliver our solutions could harm our business.\nOur users expect to be able to access our solutions 24-hours a day, seven-days a week, without interruption. We have computing and communications hardware operations located in data centers owned and operated by third parties. We do not control the operation of these data centers and we are therefore vulnerable to any security breaches, power outages or other issues the data centers experience. We expect that we will experience interruptions, delays and outages in service and availability from time to time.\nThe owners of our data centers have no obligation to renew agreements with us on commercially reasonable terms, or at all. If we are unable to renew these agreements on commercially reasonable terms, we may be required to move to new data centers, and we may incur significant costs and possible service interruption in connection with doing so.\nThese data centers are vulnerable to damage or interruption from human error, malicious acts, earthquakes, hurricanes, tornados, floods, fires, war, terrorist attacks, power losses, hardware failures, systems failures, telecommunications failures and similar events. The occurrence of a natural disaster or an act of terrorism, vandalism or other misconduct, or a decision to close the data centers without adequate notice or other unanticipated problems could result in lengthy interruptions in availability of our solutions.\nAny changes in third-party service levels at our data centers or any errors, defects, disruptions or other performance problems with our solutions could harm our reputation and may damage our customers’ businesses. Interruptions in availability of our solutions might reduce our revenue, cause us to issue credits to customers, subject us to potential liability, and cause customers to terminate their subscriptions or decide not to renew their subscriptions with us.\nIf we are not able to attract and retain top employees, our ability to compete may be harmed.\nOur performance is substantially dependent on the performance of our executive officers and key employees. The loss of the services of any of our executive officers or other key employees could significantly harm our business. Our success is also highly dependent upon our continuing ability to identify, hire, train, retain, and motivate highly-qualified management, technical, sales, and marketing personnel. In particular, the recruitment of top software developers and experienced salespeople remains critical to our success. Competition for such people is intense, substantial, and continuous, and we may not be able to attract, integrate, or retain highly-qualified technical, sales, or managerial personnel in the future. In addition, in our effort to attract and retain critical personnel, we may experience increased compensation costs that are not offset by either improved productivity or higher prices for our products or services.\nOur products rely on the stability of infrastructure software that, if not stable, could negatively impact the effectiveness or reliability of our products, resulting in harm to our reputation and business.\nOur development of internet and intranet applications depends and will continue to depend on the stability, functionality, and scalability of the infrastructure software of the underlying internet and intranet. If weaknesses in such infrastructure exist, we may not be able to correct or compensate for such weaknesses. If we are unable to address weaknesses resulting from problems in the infrastructure software such that our products do not meet customer needs or expectations, our reputation and, consequently, our business may be significantly harmed.\nIn addition, our business and operations are highly automated, and a disruption or failure of our systems may delay our ability to complete sales and to provide services. A major disaster or other catastrophic event that results in the destruction or disruption of any of our critical business or information technology systems could severely affect our ability to conduct normal business operations, which may materially and adversely affect our future operating results.\nFailure to protect our intellectual property could harm our ability to compete effectively.\nWe are highly dependent on our ability to protect our proprietary technology. We rely on a combination of intellectual property laws, trademark laws, as well as non-disclosure agreements and other contractual provisions to establish and maintain our proprietary rights. We intend to protect our rights vigorously; however, there can be no assurance that these measures will be successful. Enforcement of our intellectual property rights may be difficult or cost prohibitive. While U.S. copyright laws may provide meaningful protection against unauthorized duplication of software, software piracy has been, and is expected to be, a persistent problem for the software industry, and piracy of our products represents a loss of revenue to us. Certain of our license arrangements may require us to make a limited confidential disclosure of portions of the source code for our products, or to place such source code into escrow for the protection of another party. Although we will take considerable precautions, unauthorized third parties, including our competitors, may be able to: (i) copy certain portions of our products, or (ii) reverse engineer or obtain and use information that we regard as proprietary. Also, our competitors could independently develop technologies that are perceived to be substantially equivalent or superior to our technologies. Our competitive position may be adversely affected by our possible inability to effectively protect our intellectual property.",
    "item_1B": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot applicable.",
    "item_2": "ITEM 2. PROPERTIES\nWe lease an office facility measuring approximately 6,000 square feet in Columbus, Ohio, for our headquarters, chief executive offices, and conducting the operations of Intellinetics Ohio. The monthly rental payment is $4,524. The lease term continues until December 31, 2021.\nOur subsidiary, Graphic Sciences, uses 36,000 square feet of leased space in Madison Heights as its main facility. Graphic Sciences uses about 20,000 square feet for its records storage services, with the remainder of the space used for production, sales, and administration. The monthly rental payment is $41,508, with a lease term continuing until August 31, 2026.\nGraphic Sciences also leases and uses the following separate facilities: a 20,000 square foot building for document storage in Highland Park, MI, with monthly rental payments of $11,250 and a lease term continuing until September 30, 2021; a 20,000 square foot building for temporary document storage in Madison Heights, MI, with monthly rental payments of $12,500 and a month-to-month lease term. Additionally, Graphic Sciences has signed a lease for a 37,000 square foot building in Sterling Heights, MI, with monthly rental payments of $20,452 commencing on May 1, 2021 and a lease term continuing to April 30, 2028. The Sterling Heights facility will be used primarily for document storage.\nGraphic Sciences owns and operates an extensive collection of the specialized equipment necessary for scanning images or converting microfilm to digital images. Graphic Sciences’ logistics department includes a fleet of four leased vehicles for pickup and delivery of client materials. Graphic Sciences also has the ability to provide on-site capture operations for clients needing such services.",
    "item_3": "ITEM 3. LEGAL PROCEEDINGS\nFrom time to time, we are subject to ordinary routine litigation and claims incidental to our business. We are not currently involved in any legal proceedings that we believe to be material.",
    "item_4": "ITEM 4. MINE SAFETY DISCLOSURE\nNot applicable.\nPart II",
    "item_5": "ITEM 5. MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nOur common stock is available for quotation on the OTCQB Venture Market under the symbol “INLX.” As such, any over-the-counter market quotations reflect inter-dealer prices, without retail mark-up, mark-down, or commission and may not necessarily represent actual transactions.\nHolders\nAs of March 26, 2021 we had 139 stockholders of record. Such number of record stockholders does not include additional stockholders or other beneficial owners whose shares are held in street or nominee name by banks, brokerage firms, and other institutions on their behalf.\nDividends\nDividends may be declared and paid out of legally available funds at the discretion of our board of directors (“Board of Directors,” or “Board”). No dividends on our common stock were paid in either of the two most recent fiscal years, and we do not anticipate paying dividends on our common stock in the foreseeable future. The timing, amount and form of dividends, if any, will depend on, among other things, our results of operations, financial condition, cash requirements and other factors deemed relevant by our Board of Directors. We currently intend to utilize all available funds to develop our business.\nUnregistered Securities Issuances in Fiscal Year 2020\nThere have been no unregistered securities issuances in Fiscal Year 2020 that have not previously been disclosed in Current Reports on 8-K or Forms 10-Q.\nIssuer Purchase of Securities\nNone.",
    "item_6": "ITEM 6. SELECTED FINANCIAL DATA\nNot applicable to smaller reporting companies.",
    "item_7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n[All references in this Item 7 to numbers of shares of our common stock are on a post-split basis reflecting the 1-50 reverse split of our common stock on March 20, 2020.]\nThe following management’s discussion and analysis of financial conditions and results of operations of the Company for the fiscal twelve months ended December 31, 2020, and 2019 should be read in conjunction with our consolidated financial statements and the notes to those consolidated financial statements that are included elsewhere in this Annual Report on Form 10-K.\nWe caution you that any forward-looking statements included in this section are not guarantees of future performance or events and are subject to a number of uncertainties, risks and other influences, many of which are beyond our control, which may influence the accuracy of the statements and the projections upon which the statements are based. Factors that may affect our results include, but are not limited to, the risk factors that are included in Part I, Item 1A of this report.\nCompany Overview\nThe Company is a document services and solutions software company serving both the small-to-medium business and governmental sectors. The Company’s software platform allows customers to capture, manage, store, and retrieve all documents across operations such as boxed hard-copy documents, scanned hard-copy documents, microfilm and microfiche, and all digital documents including those from Microsoft Office 365, digital images, audio, video and emails. The Company’s document services offerings provide assistance to clients with document conversion generally as well as migration to our software solutions. The Company also offers long term document storage and retrieval services. The Company’s solutions create value for customers by making it easy to connect business-critical documents to the people who need them by making them easy to find, while also being secure and compliant with the customers’ audit requirements.\nCustomers obtain use of the Company’s software by either purchasing it for installation onto their equipment, referred to as a “premise” model, or by accessing the platform via the Internet, referred to as a “cloud-based,” “software as a service,” or “SaaS” model. Especially in light of the increased deployment of remote workforce policies in 2020, we continue to view the provision of SaaS-based customer activation as a significant strategic part of our revenue growth opportunity. Our SaaS products are hosted with Amazon Web Services, Expedient, and Skynet Managed Technology Services, offering our customers reliable hosting services with best practices in data security. Our revenues from cloud-based delivery of our software, including hosting services, for the twelve months ended December 31, 2020, and 2019, was $1,055,016 and $859,637, respectively. Our document conversion customers are primarily repeat customers who either regularly or periodically seek services in scanning paper to digital, microfiche to microfilm, or any combination.\nWe operate a predominantly U.S. business with concentrated sales to the state of Michigan for our document conversion professional services and sales that are diversified by customer for our document management software solutions and services. We hold or compete for leading positions regionally in select markets and attribute this leadership to several factors including the strength of our brand name and reputation, our comprehensive offering of innovative solutions, and the quality of our service support. Net growth in sales of software as a service during 2019 and 2020 reflects market demand for these solutions over traditional sales of on-premise software. We expect to continue to benefit from our select niche leader positions, innovative product offering, growing installed base, and the impact of our sales and marketing programs. Examples of these programs include identifying and investing in growth and market penetration opportunities, more effectively pricing our products and services, demonstrating superior value to customers, increasing our sales force effectiveness through improved guidance, and continuing to optimize our lead generation and lead nurturing processes.\nHow We Evaluate our Business Performance and Opportunities\nThe major qualitative and quantitative factors we consider in the evaluation of our operating results include the following:\n● With respect to our Document Management segment, including the solutions recently acquired from CEO Image, our current strategy is to focus on cloud-based delivery of our software products. Historically, our revenues have mostly resulted from premise-based software licensing revenue and professional services revenue. Our observation of industry trends leads us to anticipate that cloud-based delivery will become our principal software business and a primary source of revenues for us, and we are seeing our customers migrate to cloud-based services. When we evaluate our results, we assess whether our cloud-based software revenues are increasing, relative to prior periods and relative to other sources of revenue.\n● With respect to our Document Conversion segment, our strategy is to maintain and grow our core document conversion, storage, and retrieval business, while simultaneously leveraging our software products and services to provide more attractive total document solutions for the customers of our Document Conversion segment. Accordingly, when we evaluate our results for Document Conversion, we will assess whether our revenues increase with respect to the segment’s services, relative to prior periods, but we will also be assessing whether Document Conversion customers begin to make purchases of other products or services.\n● We are focused upon sales of our document services and software solutions through resellers and directly to our customers, with a further focus on select vertical markets. We assess whether our sales resulting from relationships with resellers are increasing, relative to prior periods and relative to direct sales to customers, and whether reseller or direct efforts offer the best opportunities for growth in our targeted vertical markets.\n● Our customer engagements often involve the development and licensing of customer-specific document solutions and related consulting and software maintenance services or tailoring a document conversion program to meet customer requirements. When analyzing whether to undertake a particular customer engagement, we often consider the following factors as part of our overall strategy to grow the business: (i) the profit margins the project may yield, and (ii) whether the project would help to develop new product and service features that we could integrate into our suite of products, resulting in an overall product portfolio that better aligns with the needs of our target customers.\n● Our software sales cycle averages 1-2 months; however, large projects can be longer, lasting 3-6 months. When a software project begins, we generally perform pre-installation assessment, project scoping, and implementation consulting. On the other hand, our document conversion services typically contain a very short sales cycle, but we can have a backlog of work orders not yet processed. Therefore, when we plan our business and evaluate our results, we consider the revenue we expect to recognize from projects in our late-stage software pipeline and in our document conversion services backlog queue.\n● We monitor our costs and capital needs to ensure efficiency as well as an adequate level of support for our business plan.\n● While we are primarily focused on organic growth, we also continually monitor potential acquisitions of complementary solutions and expertise that are consistent with our core business. We look for acquisitions that can add value for our customers and are expected to be accretive to our financial performance.\nRecent Developments\nOn January 20, 2021, we received notification that the U.S. Small Business Administration (the “SBA”) has forgiven, in full, the unsecured promissory note issued to the Company under the Paycheck Protection Program (the “PPP”). The promissory note was through PNC Bank with a principal amount of $838,700, dated April 15, 2020. The PPP was established under the congressionally approved Coronavirus Aid, Relief, and Economic Security Act (the “CARES Act”) and is administered by the SBA. Under the terms of the CARES Act, PPP loan recipients can apply for, and be granted, forgiveness for all or a portion of loans granted under the PPP. The Company met the requirements for loan forgiveness, and the entire principal and interest of the loan granted to the Company under the PPP has been forgiven. No material early termination penalties were incurred as a result of this forgiveness.\nExecutive Overview of Results\nBelow are our key financial results for the fiscal year ended December 31, 2020 (consolidated unless otherwise noted) with most of the significant changes year over year resulting from our acquisition of Graphic Sciences on March 2, 2020 and CEO Image on April 21, 2020:\n● Revenues were $8,253,391, representing revenue growth of 225% year over year.\n● Cost of revenues was $3,262,653.\n● Operating expenses (excluding cost of revenues) were $7,028,982, including $636,440 of significant transaction costs and $1,554,800 in change in fair value of earnout liabilities.\n● Loss from operations was $2,038,244.\n● Net loss was $2,200,201 with basic and diluted net loss per share of $0.91.\n● Operating cash flow was $124,988.\n● Capital expenditures were $76,854, excluding cash paid to acquire business.\n● As of December 31, 2020, the number of our employees was 96, including 11 part-time.\nFinancial Impact of COVID-19\nThe spread of a novel coronavirus (“COVID-19”) and developments surrounding the global pandemic have had, and we expect will continue to have, a significant impact on our business, results of operations and financial condition.\nFrom March 24, 2020, through June 15, 2020, our Graphic Services business operations, constituting a majority of our professional services revenues, was reduced due to the State of Michigan stay-at-home order, and we were only able to process work orders deemed “essential” by the State of Michigan. We were not able to make up our ordinary level of revenues in the remainder of 2020 to offset the period in which our operations were reduced. There has not been a meaningful cancellation of future jobs or current contracts for our Graphic Services business operations; however, certain customers continue to be slow to resume operations to pre-pandemic levels, and certain customers may never fully return. In particular, the State of Michigan, our biggest customer, has not fully resumed normal operations, resulting in a decrease in the volume of work orders for our Document Conversion segment. In addition, we are seeing inconsistent demand in certain other areas of our operations, even though those operations are still currently open for business with mostly remote staff.\nWe worked closely with the State of Michigan on our reopening plans for the Graphic Services business. Most of our other employees are located in the State of Ohio, which permitted general office workers to return to work on May 4, 2020. However, the majority of our Ohio employees are continuing to work remotely as a precaution. Regardless of the lifting of stay-at-home orders in Ohio and Michigan (where most of our employees are located), many of our clients operate in a variety of other states, which had differing time periods in which their operations were or are currently restricted. Even though we have been able to fully resume our operations, we expect to see continued weakened demand in light of reduced governmental and small-business spending and general economic uncertainty.\nWe have engaged in aggressive efforts to reduce expenses and preserve cash flow during 2020, including:\n● From March 24, 2020 to June 15, 2020, we furloughed our non-essential employees in the State of Michigan who, due to the nature of their work, were not able to work remotely during the governmental shut-down in that state;\n● From April 1, 2020 to June 29, 2020, we reduced our executive officer compensation by 20% and other manager compensation by 15%, and our Board of Directors waived their director compensation for the second fiscal quarter of 2020; and\n● We applied for and received PPP funds, discussed below in Liquidity and Capital Resources, which we used to fund payroll and other limited permitted expenses such as rent and utilities.\nAdditionally, we have instituted safe distancing practices and additional cleaning procedures for all company offices, as well as established work-from-home employees wherever feasible, in order to prevent or mitigate future outbreaks and disruptions to our business.\nReportable Segments\nOur reportable segments are currently organized around the following products and services that we offer as part of our core business strategy:\n● Document Management; and\n● Document Conversion.\nPrior to the year ended December 31, 2020, our results had been reported on an aggregated basis. With the acquisition of Graphic Sciences, we determined that identification and aggregation of operating and reportable segments would be appropriate.\nDocument Management\nThe Document Management segment provides cloud-based and premise-based content services software. Its modular suite of solutions complements existing operating and accounting systems to serve a mission-critical role for organizations to make content secure, compliant, and process-ready. This segment conducts its primary operations in the United States. Markets served include highly regulated, risk and compliance-intensive markets in healthcare, K-12 education, public safety, other public sector, risk management, financial services, and others. Solutions are sold both directly to end-users and through resellers.\nDocument Conversion\nThe Document Conversion segment provides services for scanning and indexing, converting images from paper to digital, paper to microfilm, and microfiche to microfilm, as well as long-term physical document storage and retrieval. This segment conducts its primary operations in the United States. Markets served include business and state, county, and municipal governments. Solutions are sold both directly to end-users and through a reseller distributor.\nResults of Operations\nRevenues\nWe reported total revenues of $8,253,391 and $2,535,955 for the twelve months ended December 31, 2020, and 2019, respectively, representing an increase of $5,717,436 or 225%. For the twelve months ended December 31, 2020, our subsidiary acquired March 2, 2020, Graphic Sciences, accounted for $5,238,654 of the total sales, or 92% of the increase. In addition, a business line that we acquired on April 21, 2020, CEO Image, accounted for $375,863 of the total sales, or 7% of the increase. The net increase in comparable total revenues year-over-year is primarily attributable to growth software as a service and software maintenance services, partially offset by sales of software and professional services, as further described below. The following table summarizes our revenues by reportable segment for the periods indicated:\nTwelve months ended\nDecember 31, 2020 Twelve months ended\nDecember 31, 2019\nRevenues\nDocument Management $ 2,816,848 $ 2,368,140\nDocument Conversion 5,436,543 167,815\nTotal revenues $ 8,253,391 $ 2,535,955\nSale of Software\nRevenues from the sale of software principally consist of sales of additional or upgraded software licenses and applications to existing customers and resellers. These software revenues were $194,787 and $189,165, for the twelve months ended December 31, 2020, and 2019, respectively, representing an increase of $5,622, or 3%. The increase year-over-year in sales was due to $13,477 from CEO Image, partially offset by a decrease due to timing of large direct sales projects. The volatility of this revenue line item is expected to continue as the frequency of on-premise software solution sales decreases over time. Revenues from the sale of software are reported as part of our Document Management segment.\nSale of Software as a Service\nWe provide access to our software solutions as a service, accessible through the internet. Our customers typically enter into our software as a service agreement for periods of one year or more. Under these agreements, we generally provide access to the applicable software, data storage and related customer assistance and support. Our software as a service revenues were $1,055,016 and $859,637, for the twelve months ended December 31, 2020, and 2019, respectively, representing an increase of $195,379 or 23%. The increase in revenue year-over-year was primarily the result of new customers choosing a cloud-based solution, plus expanded data storage, user seats, and hosting fees for existing customers, as well as $41,727 from CEO Image. Revenues from the sale of software as a service are reported as part of our Document Management segment.\nSale of Software Maintenance Services\nSoftware maintenance services revenues consist of fees for post contract customer support services provided to license (premise-based) holders. These agreements allow our customers to receive technical support, enhancements and upgrades to new versions of our software products when and if available. A substantial portion of these revenues were generated from customers to whom we sold software in prior years who have continued to renew their maintenance agreements. The support and maintenance agreements typically have a term of 12 months. Our software maintenance support revenue was $1,257,446 and $1,011,278, for the twelve months ended December 31, 2020, and 2019, respectively, representing an increase of $246,168, or 24%. The increase in revenue year-over-year was the result of approximately $216,000 contribution from CEO Image, as well as new growth and normal price increases exceeding attrition of existing maintenance agreement renewals. Revenues from the sale of software maintenance services are reported as part of our Document Management segment.\nSales of Professional Services\nProfessional services revenues consist of revenues from document scanning and conversion services, consulting, discovery, training, and advisory services to assist customers with document management needs, as well as repair and maintenance services for customer equipment. These revenues include those arrangements where we do not sell software license as an element of the overall arrangement. Our professional services offerings, particularly with respect to scanning and document conversion, including microfilm and microfiche, were recently broadened and enhanced with our March 2, 2020 acquisition of Graphic Sciences. Professional services revenues were $5,007,617 and $475,875, for the twelve months ended December 31, 2020 and 2019, respectively, representing an increase of $4,531,742 or 952%. Document Conversion operations comprised $4,698,018 of the professional services revenues, while Document Management operations comprised $309,599. Our recently acquired subsidiary, Graphic Sciences, accounted for $4,500,129 of the total sales, or 99% of the increase. Professional services revenues excluding Graphic Sciences were $507,488 and $475,875, for the twelve months ended December 31, 2020 and 2019, respectively, representing an increase of $31,613 or 7%. The increase in revenue excluding Graphic Sciences was due to an increase in our Document Conversion services in Columbus, Ohio, due to a full year of operations. The Document Management professional services revenues include an increase of $104,481 from CEO Image, offset by a reduction in our Document Management professional services in Columbus, Ohio, due to a combination of customer-driven COVID project postponements and generally fewer custom projects in 2020.\nSale of Storage and Retrieval\nGraphic Sciences provides document storage and retrieval services to customers, primarily in Michigan. Our document storage and retrieval revenues were $738,525 and $0, respectively, for the twelve months ended December 31, 2020 and 2019, respectively. The amounts were lower than historical levels at Graphic Sciences for similar periods due to COVID shut-downs at customers and the Michigan stay-at-home order which reduced retrieval services from April through June, primarily. Revenues from the sale of storage and retrieval are reported as part of our Document Conversion segment.\nCosts of Revenue\nThe cost of revenues during the twelve months ended December 31, 2020, and 2019 were $3,262,653 and $567,843, respectively, representing an increase of $2,694,810, or 475%. The Graphic Sciences acquisition accounted for $2,486,789 of the total costs of revenue, or 92% of the increase. The cost of revenues excluding Graphic Sciences during the twelve months ended December 31, 2020 and 2019 were $775,864 and $567,843, respectively, representing an increase of $208,021, or 37%. The increase in cost of revenue excluding Graphic Sciences year-over-year is primarily the result of increased sales revenue, as well as exceptional professional services margins in 2019 on two projects that were not repeated in 2020.\nCost of Software Revenues\nCost of software revenues consists primarily of third-party software licenses that are sold in connection with our core software applications and labor costs of our software engineers and implementation consultants. Cost of software revenues was $56,664 and $8,633 for the twelve months ended December 31, 2020, and 2019, respectively, representing an increase of $48,031 or 556%.\nGross margin for this product category decreased to 71% for the twelve months ended December 31, 2020 from 95% for the twelve months ended December 31, 2019. The decrease is driven by software solution mix: lesser margin solutions in 2020 unfavorably compared to high margin solutions sold in 2019.\nCost of Software as a Service\nCost of software as a service consists primarily of technical support personnel, hosting services, and related costs. Cost of software as a service was $273,368 for the twelve months ended December 31, 2020, as compared with $254,999 for the twelve months ended December 31, 2019, representing an increase of $18,369, or 7%. The increase in cost followed the higher revenue, at slightly improved margins due to scaling of hosting infrastructure.\nGross margins for this product category were 74% and 70% for the twelve months ended December 31, 2020, and 2019, respectively.\nCost of Software Maintenance Services\nCost of software maintenance services consists primarily of technical support personnel and related costs. Cost of software maintenance services for the twelve months ended December 31, 2020 was $159,122 compared with $87,280 for the twelve months ended December 31, 2019, representing an increase of $71,842, or 82%, due to high support activity in the first quarter and one incremental FTE support personnel following the April 21, 2020 acquisition of CEO Image.\nGross margins in this product category were 87% and 91% for the twelve months ended December 31, 2020, and 2019, respectively.\nCost of Professional Services\nCost of professional services consists primarily of compensation for employees performing the document conversion services, compensation of our software engineers and implementation consultants and related third-party costs. Cost of professional services was $2,553,053 for the twelve months ended December 31, 2020, as compared with $216,931 for the twelve months ended December 31, 2019, representing an increase of $2,336,122 or 1,077%. Excluding Graphic Sciences, cost of professional services was $286,710 for the twelve months ended December 31, 2020, as compared with $216,931 for twelve months ended December 31, 2019, representing an increase of $69,779 or 32%. The increase year-over-year resulted from an unfavorable mix shift to lower margin solutions added by the CEO Image April 21, 2020 acquisition, one additional FTE related to the acquisition of CEO Image, and some project inefficiencies with stopping and restarting projects due to COVID-related customer unavailability.\nGross margins in this product category were 49% and 54% for the twelve months ended December 31, 2020, and 2019, respectively. Excluding Graphic Sciences, gross margins in this product category were 44% and 54% for the twelve months ended December 31, 2020, and 2019, respectively. Gross margins related to consulting services may vary widely, depending upon the nature of the consulting project and the amount of labor it takes to complete a project, and the second quarter of 2019 included higher margin projects.\nCost of Storage and Retrieval Services\nCost of storage and retrieval services consists primarily of compensation for employees performing the document storage and retrieval services, including logistics, provided by Graphic Sciences. Cost of storage and retrieval was $220,446 for the twelve months ended December 31, 2020, as compared with $0 for twelve months ended December 31, 2019.\nGross margins in this product category were 70% for the twelve months ended December 31, 2020. Gross margins exclude the cost of facilities rental, maintenance, and related overheads.\nGross Margins\nOverall gross margin for the twelve months ended December 31, 2020 and 2019 were 60% and 78%, respectively, representing a decrease of 18%. The decrease represents the increase of document conversion revenues from the Graphic Sciences acquisition. Excluding Graphic Sciences, overall gross margin for the twelve months ended December 31, 2020 and 2019 and 2019 were 74% and 78%, respectively, representing a decrease of 4%. The decrease in gross margin year-over-year excluding Graphic Sciences is primarily a result of unusually strong professional services margins on two projects in 2019, as well as product mix in software sales in the third quarter of 2019.\nOperating Expenses\nGeneral and Administrative Expenses\nGeneral and administrative expenses were $3,499,440 during the twelve months ended December 31, 2020 as compared with $2,131,385 during the twelve months ended December 31, 2019, representing an increase of $1,368,055 or 64%. The increase in operating expenses year-over-year was principally related to the addition of Graphic Sciences expenses. For the twelve months ended December 31, 2020 and 2019, the general and administrative expenses related to Document Management and Document Conversion segments were $1,808,184 and $1,990,342, and $1,691,256 and $141,043, respectively.\nChange in Fair Value of Earnout Liabilities\nAdjustments to fair value of earnout liabilities were $1,554,800 during the twelve months ended December 31, 2020, comprised of $1,423,800 for Graphic Sciences and $131,000 for CEO Image. The fair value adjustments were driven by updated assumptions to reflect the improved performance of both acquisitions against their threshold targets and a reduction of pandemic-related uncertainty.\nSignificant Transaction Expenses\nSignificant transaction expenses were $636,440 during the twelve months ended December 31, 2020. The significant transactions expenses were comprised of investment banker and placement agent success fees, as well as legal and consulting fees.\nSales and Marketing Expenses\nSales and marketing expenses were $1,041,367 during the twelve months ended December 31, 2020 as compared with $981,618 during the twelve months ended December 31, 2019, representing an increase of $59,749 or 6%. The increase was a result of the addition of Graphic Sciences and CEO Image expenses, partially offset by lower stock compensation costs in 2020 due to certain option grants vesting in 2019, plus other operational savings, including marketing and web site updates in 2019 not repeated in 2020. For the twelve months ended December 31, 2020 and 2019, the sales and marketing expenses related to Document Management and Document Conversion segments were $584,470 and $916,660, and $456,897 and $64,958, respectively.\nDepreciation and Amortization\nDepreciation and amortization was $296,935 for the twelve months ended December 31, 2020, as compared with $7,701 for the twelve months ended December 31, 2019, representing an increase of $289,234 or 3,756%. The increase is driven by amortization of the intangible assets acquired in March and April and the addition of Graphic Sciences and CEO Image depreciation. For the twelve months ended December 31, 2020 and 2019, the depreciation and amortization expenses related to Document Management and Document Conversion segments were $23,401 and $6,481, and $273,534 and $1,220, respectively.\nGain on Extinguishment of Debt\nGain on extinguishment of debt was $287,426 during the twelve months ended December 31, 2020. The gain was driven by the extinguishment of debt in March 2020, as part of conversion of notes payable accounted for using troubled debt restructuring.\nIncome Tax Benefit\nIncome tax benefit was $188,300 during the twelve months ended December 31, 2020. The benefit was driven by the releases of a portion of the valuation allowance in March 2020 for deferred tax liabilities of Graphic Sciences that were no longer due.\nInterest Expense\nInterest expense was $637,683 during the twelve months ended December 31, 2020 as compared with $980,689 during the twelve months ended December 31, 2019, representing a decrease of $343,006 or 35%. The decrease year-over-year resulted primarily from lower interest expense on lower net debt following the March 2020 private placement of securities and note conversion more than offsetting increased interest expense associated with accelerating the beneficial conversion option on the notes converted.\nLiquidity and Capital Resources\nWe have financed our operations primarily through a combination of cash on hand, cash generated from operations, borrowings from third parties and related parties, and proceeds from private sales of equity. From 2012 through March 2021 we raised a total of $18,555,903 in cash through issuance of debt and equity securities. As of December 31, 2020, we had $1,907,882 in cash, and net working capital deficit of $159,254, which includes $586,579 in current PPP Note Payable principal and interest. We received notice of PPP Note Payable full forgiveness in January 2021. Without the current PPP Note Payable principal and interest, the December 31, 2020 net working capital would have been $427,325.\nIn 2020, we implemented plans to increase liquidity, including the acquisitions of Graphic Sciences and CEO Image. Additionally, proceeds from issuance of shares, including conversion of convertible debt, and issuance of new debt on March 2, 2020 enabled the company to restructure its balance sheet and reduce its overall debt burden by approximately $3 million.\nThe Company’s business plan is to increase our sales and market share by focusing on a targeted marketing approach to select vertical markets, maximizing cross selling opportunities within the newly expanded customer base of the consolidated company, enhancing our direct selling results, and continuing to develop a network of select resellers through which we expect to sell our expanded document management solutions. We expect that these initiatives will require us to continue our efforts towards direct marketing campaigns and leads management, reseller on-boarding, and to develop additional software integration and customization capabilities, all of which may require additional capital. We also plan to continually monitor opportunities to make strategic acquisitions that will strengthen or complement our product and services offerings, bring more solutions to our customers, and increase revenues and liquidity.\nOur ability to meet our capital needs in the future will depend on many factors, including maintaining and enhancing our operating cash flow, successfully managing the transition of our recent acquisitions of Graphic Sciences and CEO Image, successfully retaining and growing our client base in the midst of general economic uncertainty, and managing the continuing effects of the COVID-19 pandemic on our business. We will need to successfully manage our revenues to support potential future earnout commitments for previous transactions and current debt service commitments, and our future cash resources and capital requirements may vary materially from those now planned. Our ability to obtain additional capital or debt financing on favorable terms, if needed, would likely be adversely affected by our history of operating losses. These conditions raise substantial doubt over the Company’s ability to meet all of its obligations over the twelve months following the date of this Report. Prior to the third quarter of 2020, management has historically assessed that there was substantial doubt regarding our ability to continue as a going concern. However, management has evaluated these conditions and believes, based on its improved balance sheet, improved consolidated cash flow, and current plans and expectations, that it will be able to meet those obligations, although there is no assurance.\nBased on our plans and assumptions as of the date of this report, we believe our capital resources, including our cash and cash equivalents, along with funds expected to be generated from our operations, will be sufficient to meet our anticipated cash needs, including for working capital, earnout liability payments for previous transactions, capital spending, and debt service commitments, for at least the next 12 months. However, any projections of future cash needs and cash flows are subject to risks and uncertainties, including the ongoing COVID-19 pandemic and general overall economic conditions.\nEquity Capital Resources\nAs of March 26, 2021, the Company has 2,823,072 shares of common stock issued and outstanding; and 333,232 shares reserved for issuance upon the exercise of outstanding warrants, outstanding stock options, and shares reserved for the 2015 Plan.\nOn March 2, 2020, we completed a private placement of securities equity and debt (which we refer to as our “2020 private placement”) for aggregate gross proceeds of $5.5 million (of which, $3.5 million resulted from the sale of our common stock). As a result of the 2020 private placement, after payment of the initial purchase price for the acquisition of Graphic Sciences and transaction fees and expenses, the Company retained approximately $530,000 for working capital and general corporate purposes.\nOur shares are available for quotation on the OTCQB, and we believe this is important for raising capital to finance our growth plan. We intend to deploy any future capital we may raise to expand our sales and marketing capabilities, develop ancillary software products, enhance our internal infrastructure, support the accounting, auditing and legal costs of operating as a public company, and provide working capital.\nDebt Capital Resources\nOn April 21, 2020, the Company entered into an asset purchase agreement under which the Company agreed to pay a principal amount of $170,000 (“Seller Notes Payable”) as further discussed in Note 6. The terms of the Seller Notes Payable were approximately three and six months, with $70,000 plus accrued interest paid August 3, 2020 and $100,000 plus accrued interest paid November 1, 2020. The Seller Notes Payable bore an interest rate of 1.5% per annum. These notes were installment payments for the net assets acquired.\nOn April 15, 2020, the Company secured PPP funding, through PNC Bank with a principal amount of $838,700. The term of the PPP loan is two years, with an interest rate of 1.0% per annum, which shall be deferred for the first ten months after the covered period of the loan. PPP loan recipients can be granted forgiveness for all or a portion of loans granted under the PPP, based on the use of loan proceeds for payroll costs and mortgage interest, rent or utility costs and the maintenance of employee and compensation levels. We received notice on January 20, 2021 that our forgiveness application was accepted by the Small Business Administration.\nOn March 2, 2020, we issued 12% subordinated promissory notes with a principal amount of $2 million and maturity date of February 28, 2023, as part of the 2020 private placement described above, in order to complete the acquisition of Graphic Sciences and provide additional working capital for our operations.\nSimultaneously with the closing of the 2020 private placement, we converted substantially all of the outstanding principal and accrued interest payable on our then-existing convertible debt into shares of common stock at a conversion price of $4.00 per share. As a result, a total of approximately $6 million of convertible debt coming due December 31, 2020 was converted into shares of common stock.\nSummary of Outstanding Indebtedness at December 31, 2020\nThe Company’s outstanding indebtedness at December 31, 2020 is as follows (with more details and all defined terms set forth in Note 10 to the Consolidated Financial Statements):\n● The 2020 Notes issued to accredited investors on March 2, 2020, with an aggregate original principal balance of $2,000,000, a current principal balance of $2,000,000, and accrued interest of $0.\n● PPP Note Payable held by PNC bank, dated April 15, 2020, with an original principal balance of $838,700, a current principal balance of $838,700, and accrued interest of $5,941.\nCash Provided and Used In Operating Activities.\nFrom our inception, we have generated revenues from the sales, implementation, subscriptions, and maintenance of our internally generated software applications, as well as significantly increased revenues from document conversion services beginning in 2020. Our uses of cash from operating activities include compensation and related costs, hardware costs, rent for our corporate offices, hosting fees for our cloud-based software services, other general corporate expenditures, and travel costs to client sites.\nOur plan is to increase our sales and market share by implementing a targeted marketing approach to select vertical markets, an expanded network of resellers through which we expect to sell our expanded software product portfolio, as well as continue to enhance our direct selling results. We expect our operations to continue to require additional capital in order to implement direct marketing campaigns and leads management, reseller training and on-boarding, and to develop additional software integration and customization capabilities. Although management believes that we may have access to additional capital resources, there are currently no commitments in place for new financing, and there is no assurance that we will be able to obtain funds on commercially acceptable terms, if at all.\nNet cash provided by operating activities for the twelve months ended December 31, 2020 was $124,988. During the twelve months ended December 31, 2020, the net cash provided by operating activities was primarily attributable to the net loss adjusted for non-cash expenses of $1,390,769, a decrease in operating assets of $325,132 and a decrease in operating liabilities of $609,288. Net cash used in operating activities for the twelve months ended December 31, 2019 was $982,169. During the twelve months ended December 31, 2019, the net cash used in operating activities was primarily attributable to the net loss adjusted for non-cash expenses of $631,433, an increase in operating assets of $336,589 and an increase in operating liabilities of $856,268.\nCash Used in Investing Activities.\nNet cash used in investing activities for the twelve months ended December 31, 2020, and 2019 amounted to $4,095,952 and $5,489, respectively, and was primarily related to cash paid to acquire Graphic Sciences and acquire CEO Image, amounting to $3,906,253 and $130,114, respectively, in 2020. The balance of $76,854 in 2020 and the entire amount of $5,489 in 2019 was used for purchases of property and equipment.\nCapital Expenditures\nThere were no material commitments for capital expenditures at December 31, 2020. On February 18, 2021, we committed to purchase warehouse racking in the amount of $326,864. We are evaluating equipment financing options to finance the equipment purchase.\nCash Provided and Used in Financing Activities.\nCash provided and used by financing activities primarily consist of net proceeds from issuance or repayments of debt, or new issuance of equity.\nNet cash provided by financing activities for the twelve months ended December 31, 2020 amounted to $5,474,681. The net cash provided by financing activities resulted from new borrowings of $3,008,700, partially offset by $175,924 in financing costs, and the sale of common stock resulting in $2,859,633 in net cash. Notes payable payments amounted to $170,000, which comprised of seller notes which are installment payments for net assets acquired. Notes payable payments to related parties amounted to $47,728.\nNet cash provided by financing activities for the twelve months ended December 31, 2019 amounted to $303,193. New borrowings of $350,000 were partially offset by $46,807 of notes payable repayments to related parties.\nCritical Accounting Policies and Estimates\nThese critical accounting policies and estimates by our management should be read in conjunction with Note 5 Summary of Significant Accounting Policies to the Consolidated Financial Statements.\nThe preparation of consolidated financial statements in accordance U.S. GAAP requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenue and expenses in the reporting period. We regularly make estimates and assumptions that affect the reported amounts of assets and liabilities. We base our estimates and assumptions on current facts, historical experience and various other factors that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities and the accrual of costs and expenses that are not readily apparent from other sources.\nThe actual results experienced by us may differ materially and adversely from our estimates. To the extent there are material differences between our estimates and the actual results, our future results of operations will be affected.\nWe consider the following accounting policies and estimates to be both those most important to the portrayal of our financial condition and those that require the most subjective judgment:\n● Liquidity, Going Concern and Management’s Plans\n● Revenue Recognition\n● Business Acquisition, Goodwill and Intangibles, including Contingent Liability-Earnout\n● Accounts Receivable, Unbilled\n● Parts and Supplies Allowance\n● Deferred Revenues\n● Allowance for Doubt Accounts\n● Accounting for Costs of Computer Software to be Sold, Leased or Marketed and Accounting for Internal Use Software\n● Accounting Stock-Based Compensation\nLiquidity, Going Concern and Management’s Plans\nWe have incurred substantial recurring losses since our inception. The accompanying consolidated financial statements have been prepared assuming that we will continue as a going concern, which contemplates the realization of assets and satisfaction of liabilities and commitments in the normal course of business. Thus, the consolidated financial statements do not include any adjustments relating to the recoverability and classification of recorded asset amounts or the amounts and classification of liabilities that might be necessary should we be unable to continue as a going concern.\nRevenue Recognition\nIn accordance with ASC 606, the Company follows a five-step model to assess each contract of a sale or service to a customer: identify the legally binding contract, identify the performance obligations, determine the transaction price, allocate the transaction price, and determine whether revenue will be recognized at a point in time or over time. Revenue is recognized when a performance obligation is satisfied and the customer obtains control of promised goods and services. The amount of revenue recognized reflects the consideration to which we expect to be entitled to receive in exchange for these goods and services. In addition, ASC 606 requires disclosures of the nature, amount, timing, and uncertainty of revenue and cash flows arising from contracts with customers.\nOur contracts with customers often contain multiple performance obligations. For these contracts, we account for individual performance obligations separately if they are distinct. The transaction price is allocated to the separate performance obligations on a relative standalone selling price (“SSP”) basis. We determine the SSP based on an observable standalone selling price when it is available, as well as other factors, including, the price charged to customers, our discounting practices, and our overall pricing objectives, while maximizing observable inputs. In situations where pricing is highly variable or uncertain, we estimate the SSP using a residual approach.\nRevenue from on-premises licenses is recognized upfront upon transfer of control of the software, which occurs at delivery, or when the license term commences, if later. We recognize revenue from maintenance contracts ratably over the service period. Cloud services revenue is recognized ratably over the cloud service term. Training, professional services, and storage and retrieval services are provided either on a time and material basis, in which revenues are recognized as services are delivered, or over a contractual term, in which revenues are recognized ratably. With respect to contracts that include customer acceptance provisions, we recognize revenue upon customer acceptance. Our policy is to record revenues net of any applicable sales, use or excise taxes.\nPayment terms and conditions vary by contract type, although our terms generally include a requirement of payment within 30 to 60 days. We assess whether payment terms are customary or extended in accordance with normal practice relative to the market in which the sale is occurring. In instances where the timing of revenue recognition differs from the timing of payment, we have determined our contracts do not include a significant financing component. The primary purpose of our invoicing terms is to provide customers with simplified and predictable ways of purchasing our products and services, not to receive financing from our customers or to provide customers with financing.\nWe generally do not offer rights of return or any other incentives such as concessions, product rotation, or price protection and, therefore, do not provide for or make estimates of rights of return and similar incentives.\nWe establish allowances for doubtful accounts when available information causes us to believe that credit loss is probable.\nBusiness Acquisition, Goodwill and Intangibles Assets, including Contingent Liability-Earnout\nWe preliminarily allocate the purchase price to assets acquired and liabilities assumed based on the estimated fair value of such assets and liabilities at the date of acquisition, subject to further review and analysis. We estimate a fair value of any earnout which would be owed to the seller based on the terms of the earnout and record this liability at the acquisition date. Fair value is based on future projections of metrics such as revenue or profit over the earnout period and valuation techniques that utilize expected volatility, threshold probability, and discounting of future payments. Evaluating the fair value involves a high degree of assumptions used within the valuation models, in particular, forecasts of projected revenues or margins. Changes in these assumptions could have a significant impact on the fair value of the earnout liabilities.\nThe carrying value of goodwill is not amortized, but it tested for impairment annually as of December 31, as well as on an interim basis whenever events or changes in circumstances indicate that the carrying amount of a reporting unity may not be recoverable. An impairment charge is recognized for the amount by which the carrying amount exceeds the recorded fair value. All intangible assets have finite lives and are stated at cost, net of amortization. Amortization is computed over the useful life of the related assets on a straight-line method.\nAs of December 31, 2020, we recorded a change in fair value of earnout liabilities for both Graphic Sciences and CEO Image. The assumptions were updated to reflect the improved performance of both acquisitions against their threshold targets and a reduction of uncertainty driven by the pandemic.\nAccounts Receivable, Unbilled\nWe recognize professional services revenue over time as the services are delivered using an input or output method (e.g., labor hours incurred as a percentage of total labor hours budgeted, images scanned, or similar milestones), as appropriate for the contract, provided all other revenue recognition criteria are met. When our revenue recognition policies recognize revenue that has not yet been billed, we record those contract asset amounts in accounts receivable, unbilled.\nParts and Supplies Allowance\nParts and supplies are valued at the lower of cost or net realizable value. Costs are determined using the first-in, first-out method. Parts and supplies are primarily used for scanning and document conversion services. We establish a provision for potentially obsolete or slow-moving parts and supplies inventory based on parts and supplies levels, future sales forecasted and our judgment of potentially obsolete parts and supplies.\nDeferred Revenues\nAmounts that have been invoiced are recognized in accounts receivable, deferred revenue or revenue, depending on whether the revenue recognition criteria have been met. Deferred revenue represents amounts billed for which revenue has not yet be recognized. Deferred revenues typically relate to maintenance and software-as-a-service agreements which have been paid for by customers prior to the performance of those services, and payments received for professional services and license arrangements and software-as-a-service performance obligations that have been deferred until fulfilled under our revenue recognition policy.\nAllowance for Doubtful Accounts\nWe maintain an allowance for doubtful accounts which represents estimated losses resulting from the inability, failure or refusal of our clients to make required payments.\nWe analyze historical percentages of uncollectible accounts and changes in payment history when evaluating the adequacy of the allowance for doubtful accounts. We use an internal collection effort, which may include our sales and services groups as we deem appropriate. Although we believe that our allowances are adequate, if the financial condition of our clients deteriorates, resulting in an impairment of their ability to make payments, or if we underestimate the allowances required, additional allowances may be necessary, resulting in increased expense in the period in which such determination is made.\nAccounting for Costs of Computer Software to be Sold, Leased or Marketed and Accounting for Internal Use Software\nWe design, develop, test, market, license, and support new software products and enhancements of current products.\nIn accordance with ASC 985-20 “Costs of Software to be Sold, Leased or Otherwise Marketed,” we expense software development costs, including costs to develop software products or the software component of products to be sold, leased, or marketed to external users, before technological feasibility is reached. Technological feasibility is typically reached shortly before the release of such products and as a result, development costs that meet the criteria for capitalization were not material for the periods presented in this report.\nIn accordance with ASC 350-40, “Internal-Use Software,” the Company capitalizes purchase and implementation costs of internal use software. No such costs were capitalized during the periods presented in this report.\nStock-Based Compensation\nWe maintain one stock-based compensation plan. We account for stock-based payments to employees in accordance with ASC 718, “Compensation - Stock Compensation.” Stock-based payments to employees include grants of stock that are recognized in the consolidated statement of operations based on their fair values at the date of grant. We account for stock-based payments to non-employees in accordance with ASC 718, “Compensation - Stock Compensation,” which requires that such equity instruments are recorded at their fair value on the grant date.\nThe grant date fair value of stock option awards is recognized in earnings as stock-based compensation cost over the requisite service period of the award using the straight-line attribution method. We estimate the fair value of the stock option awards using the Black-Scholes-Merton option pricing model. The exercise price of options is specified in the stock option agreements. The expected volatility is based on the historical volatility of our stock for the previous period equal to the expected term of the options. The expected term of options granted is based on the midpoint between the vesting date and the end of the contractual term. The risk-free interest rate is based upon a U.S. Treasury instrument with a life that is similar to the expected term of the options. The expected dividend yield is based upon the yield expected on date of grant to occur over the term of the option.",
    "item_7A": "ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nNot applicable to smaller reporting companies.",
    "item_8": "ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\n(1) Consolidated Financial Statements.\nPage\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets at December 31, 2020 and 2019\nConsolidated Statements of Operations for the twelve months ended December 31, 2020, and 2019\nConsolidated Statements of Stockholders’ Equity (Deficit) for the twelve months ended December 31, 2020, and 2019\nConsolidated Statements of Cash Flows for the twelve months ended December 31, 2020, and 2019\nNotes to Consolidated Financial Statements\n(2) Consolidated Financial Statement Schedules.\nConsolidated Financial Statement Schedules have been omitted because they are either not required or not applicable, or because the information required to be presented is included in the consolidated financial statements or the notes thereto included in this report.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and Board of Directors\nIntellinetics, Inc. and Subsidiaries\nColumbus, Ohio\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Intellinetics, Inc. and Subsidiaries (the “Company”) as of December 31, 2020 and 2019, the related consolidated statements of operations, stockholders’ equity (deficit), and cash flows for each of the years then ended, and related notes (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2020 and 2019, and the results of its operations and its cash flows for each of the two years in the period ended December 31, 2020, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (“PCAOB”) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nEvaluation of the Fair Value of Earnout Liabilities Related to Business Acquisitions\nDescription of the Matter\nAs discussed in Note 6 to the consolidated financial statements, the Company makes certain assumptions and judgment in determining fair value measurements for business acquisitions. During the year ended December 31, 2020, the Company consummated two business acquisitions. The acquisitions resulted in the recognition of earnout liabilities totaling $889,200, subsequently revalued at $2,444,000.\nWe identified the evaluation of the fair value of the earnout liabilities related to the acquired businesses as a critical audit matter. Evaluating the fair value involved a high degree of assumptions used within the valuation models including forecasts of projected revenues, customer attrition rate and volatility rates. In addition, changes in these assumptions could have a significant impact on the fair value of the earnout liabilities.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding and evaluated the design of internal control over the Company’s process for determining the fair value of earnout liabilities related to the business acquisitions, specifically related to the determination of the key assumptions. We evaluated the forecasts of projected revenues and customer attrition rate assumptions used by the Company by comparing the assumptions to the acquirees’ historical performance and to the growth rates of peer companies. We also compared the forecasts of projected revenue assumptions to industry data. We also involved a valuation professional with specialized skills and knowledge who assisted in evaluating certain forecasts of projected revenues used by the Company to value the earnout liabilities by independently developing these rates based on publicly available market data and comparing the results to rates used by the Company.\nGoing Concern\nDescription of the Matter\nAs described further in Note 3 to the consolidated financial statements, the Company has incurred losses each year from inception through December 31, 2020. However, management believes, based on the Company’s operating plan, that capital resources, including cash and cash equivalents, along with funds expected to be generated from our operations will be sufficient to meet the Company’s anticipated cash needs, including for working capital, earnout liability payments for previous transactions, capital spending and debt service commitments as they come due for at least one year from the consolidated financial statement issuance date.\nWe determined the Company’s ability to continue as a going concern is a critical audit matter due to the estimation and execution uncertainty regarding the Company’s future cash flows and the risk of bias in management’s judgments and assumptions in estimating these cash flows.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding and evaluated the design of internal controls over the Company’s preparation of forecasted information, including management’s assessment of the assumptions and data underlying the forecasted information and considerations of the Company’s obligations. We tested the completeness, accuracy and relevance of underlying data for forecasted revenue, operating expenses, and uses and sources of cash used in management’s assessment of whether the Company has sufficient liquidity to fund operations for at least one year from the financial statement issuance date. This testing included inquiries with management, comparison of prior period forecasts to actual results, consideration of positive and negative evidence impacting management’s forecasts, the Company’s financing arrangements in place as of the report date, market and industry factors and consideration of the Company’s relationships with its financing partners. Additionally, we evaluated the adequacy of the Company’s disclosure of these circumstances in the consolidated financial statements.\n/s/ GBQ Partners LLC\nWe have served as the Company’s auditor since 2012.\nColumbus, Ohio\nMarch 30, 2021\nPart I Financial Information\nItem 1. Financial Statements\nINTELLINETICS, INC. and SUBSIDIARIES\nConsolidated Balance Sheets\nDecember 31,\nDecember 31,\nASSETS\nCurrent assets:\nCash\n$ 1,907,882\n$ 404,165\nAccounts receivable, net\n792,380\n329,571\nAccounts receivable, unbilled\n523,522\n23,371\nParts and supplies, net\n79,784\n4,184\nPrepaid expenses and other current assets\n162,166\n110,841\nTotal current assets\n3,465,734\n872,132\nProperty and equipment, net\n698,752\n6,919\nRight of use assets\n2,641,005\n97,239\nIntangible assets, net\n1,184,971\n-\nGoodwill\n2,322,887\n-\nOther assets\n31,284\n10,284\nTotal assets\n$ 10,344,633\n$ 986,574\nLIABILITIES AND STOCKHOLDERS’ EQUITY (DEFICIT)\nCurrent liabilities:\nAccounts payable\n$ 141,823\n$ 160,911\nAccrued compensation\n271,889\n70,027\nAccrued expenses, other\n131,685\n140,079\nLease liabilities - current\n518,531\n47,397\nDeferred revenues\n996,131\n754,073\nDeferred compensation\n100,828\n117,166\nEarnout liabilities - current\n877,522\n-\nAccrued interest payable - current\n5,941\n1,212,498\nNotes payable - current\n580,638\n3,339,963\nNotes payable - related party - current\n-\n1,467,400\nTotal current liabilities\n3,624,988\n7,309,514\nLong-term liabilities:\nNotes payable\n1,802,184\n-\nLease liabilities - net of current portion\n2,196,951\n53,318\nEarnout liabilities - net of current portion\n1,566,478\n-\nTotal long-term liabilities\n5,565,613\n53,318\nTotal liabilities\n9,190,601\n7,362,832\nStockholders’ equity (deficit):\nCommon stock, $0.001 par value, 25,000,000 shares authorized; 2,810,865 and 370,497 shares issued and outstanding at December 31, 2020 and 2019, respectively\n2,811\nAdditional paid-in capital\n24,147,488\n14,419,437\nAccumulated deficit\n(22,996,267 )\n(20,796,066 )\nTotal stockholders’ equity (deficit)\n1,154,032\n(6,376,258 )\nTotal liabilities and stockholders’ equity (deficit)\n$ 10,344,633\n$ 986,574\nSee Notes to these consolidated financial statements\nINTELLINETICS, INC. and SUBSIDIARIES\nConsolidated Statements of Operations\nFor the Twelve Months\nEnded December 31,\nRevenues:\nSale of software\n$ 194,787\n$ 189,165\nSoftware as a service\n1,055,016\n859,637\nSoftware maintenance services\n1,257,446\n1,011,278\nProfessional services\n5,007,617\n475,875\nStorage and retrieval services\n738,525\n-\nTotal revenues\n8,253,391\n2,535,955\nCost of revenues:\nSale of software\n56,664\n8,633\nSoftware as a service\n273,368\n254,999\nSoftware maintenance services\n159,122\n87,280\nProfessional services\n2,553,053\n216,931\nStorage and retrieval services\n220,446\n-\nTotal cost of revenues\n3,262,653\n567,843\nGross profit\n4,990,738\n1,968,112\nOperating expenses:\nGeneral and administrative\n3,499,440\n2,131,385\nChange in fair value of earnout liabilities\n1,554,800\n-\nSignificant transaction costs\n636,440\n-\nSales and marketing\n1,041,367\n981,618\nDepreciation and amortization\n296,935\n7,701\nTotal operating expenses\n7,028,982\n3,120,704\nLoss from operations\n(2,038,244 )\n(1,152,592 )\nOther income (expense)\nGain on extinguishment of debt\n287,426\n-\nInterest expense\n(637,683 )\n(980,689 )\nTotal other expense\n(350,257 )\n(980,689 )\nLoss before income taxes\n(2,388,501 )\n(2,133,281\n)\nIncome tax benefit\n188,300\n-\nNet loss\n$ (2,200,201 )\n$ (2,133,281 )\nBasic and diluted net loss per share:\n$ (0.91 )\n$ (5.76 )\nWeighted average number of common shares outstanding - basic and diluted\n2,406,830\n370,279\nSee Notes to these consolidated financial statements\nINTELLINETICS, INC. and SUBSIDIARIES\nConsolidated Statement of Stockholders’ Equity (Deficit)\nFor the Twelve Months Ended December 31, 2020 and 2019\nCommon Stock Additional Paid-in Accumulated\nShares Amount Capital Deficit Total\nBalance, December 31, 2018 354,588 $ 355 $ 14,131,838 $ (18,662,785 ) $ (4,530,592 )\nStock Issued to Directors and Employee 15,909 87,484 - 87,500\nStock Option Compensation - - 200,115 - 200,115\nNet Loss - - - (2,133,281 ) (2,133,281 )\nBalance, December 31, 2019 370,497 $ 371 $ 14,419,437 $ (20,796,066 ) $ (6,376,258 )\nStock Issued to Directors 16,428 $ 16 57,484 -\n57,500\nStock Option Compensation - - 58,770 - 58,770\nStock Issued 955,000 3,819,045 - 3,820,000\nStock Issued for Convertible Notes 1,468,914 1,469 5,728,566 - 5,730,035\nEquity Issuance Costs - - (307,867 ) - (307,867 )\nNote Offer Warrants - - 372,053 - 372,053\nNet Loss - - - (2,200,201 ) (2,200,201 )\nBalance, December 31, 2020 2,810,839 $ 2,811 $ 24,147,488 $ (22,996,267 ) $ 1,154,032\nSee Notes to these consolidated financial statements\nINTELLINETICS, INC. and SUBSIDIARIES\nConsolidated Statements of Cash Flows\nFor the Twelve Months Ended December 31,\nCash flows from operating activities:\nNet loss\n$ (2,200,201 )\n$ (2,133,281 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nDepreciation and amortization\n296,935\n7,701\nBad debt expense\n54,834\n28,307\nParts and supplies reserve change\n15,000\n-\nAmortization of deferred financing costs\n117,091\n183,851\nAmortization of beneficial conversion option\n11,786\n70,718\nAmortization of debt discount\n88,889\n-\nAmortization of right of use asset\n405,227\n41,310\nStock issued for services\n57,500\n87,500\nStock options compensation\n58,770\n200,115\nNote conversion stock issue expense\n141,000\n-\nWarrant issue expense\n236,761\n-\nInterest on converted debt\n176,106\n-\nGain on extinguishment of debt\n(287,426 )\n-\nAmortization of original issue discount on notes\n18,296\n11,931\nChanges in operating assets and liabilities:\nAccounts receivable\n605,094\n(222,139 )\nAccounts receivable, unbilled\n(224,128 )\n41,747\nParts and supplies\n1,531\nPrepaid expenses and other current assets\n6,745\n(19,179 )\nRight of use assets\n(63,375 )\n(138,549 )\nAccounts payable and accrued expenses\n(645,596 )\n62,896\nLease liabilities, current and long-term\n(332,917 )\n100,715\nDeferred compensation\n(16,338 )\n(48,000 )\nAccrued interest, current and long-term\n5,940\n710,203\nEarnout liabilities, current and long-term\n1,554,800\n-\nDeferred revenues\n43,399\n30,454\nTotal adjustments\n2,325,189\n1,151,112\nNet cash provided by/(used in) operating activities\n124,988\n(982,169 )\nCash flows from investing activities:\nCash paid to acquire business, net of cash acquired\n(4,019,098 )\n-\nPurchases of property and equipment\n(76,854 )\n(5,489 )\nNet cash used in investing activities\n(4,095,952 )\n(5,489 )\nCash flows from financing activities:\nProceeds from issuance of common stock\n3,167,500\n-\nOffering costs paid on issuance of common stock\n(307,867 )\n-\nPayment of deferred financing costs\n(175,924 )\n-\nProceeds from notes payable\n3,008,700\n-\nProceeds from notes payable - related parties\n-\n350,000\nRepayment of notes payable\n(170,000 )\n-\nRepayment of notes payable - related parties\n(47,728 )\n(46,807 )\nNet cash provided by financing activities\n5,474,681\n303,193\nNet increase (decrease) in cash\n1,503,717\n(684,465 )\nCash - beginning of period\n404,165\n1,088,630\nCash - end of period\n$ 1,907,882\n$ 404,165\nSupplemental disclosure of cash flow information:\nCash paid during the period for interest\n$ 202,291\n$ 7,706\nCash paid during the period for income taxes\n$ 117,072\n$ -\nSupplemental disclosure of non-cash financing activities:\nAccrued interest notes payable converted to equity\n$ 796,074\n$ -\nAccrued interest notes payable related parties converted to equity\n238,883\n-\nDiscount on notes payable for beneficial conversion feature\n320,000\n-\nDiscount on notes payable for warrants\n135,292\n-\nNotes payable converted to equity\n3,421,063\n-\nNotes payable converted to equity - related parties\n1,465,515\n-\nSupplemental disclosure of non-cash investing activities relating to business acquisitions:\nCash\n$ 17,269\n$ -\nAccounts receivable\n1,122,737\n-\nAccounts receivable, unbilled\n276,023\n-\nParts and supplies\n91,396\n-\nPrepaid expenses\n73,116\n-\nOther current assets\n5,954\n-\nRight of use assets\n2,885,618\n-\nProperty and equipment\n735,885\n-\nIntangible assets\n1,361,000\n-\nAccounts payable\n(168,749 )\n-\nAccrued expenses\n(162,426 )\n-\nLease liabilities\n(2,947,684 )\n-\nFederal and state taxes payable\n(168,900 )\n-\nDeferred revenues\n(198,659 )\n-\nDeferred tax liabilities, net\n(149,900 )\n-\nNet assets acquired in acquisition\n2,772,680\n-\nTotal goodwill acquired in acquisition\n2,322,887\n-\nTotal purchase price of acquisition\n5,095,567\n-\nPurchase price of business acquisition financed with earnout liability\n(889,200 )\n-\nPurchase price of business acquisition financed with installment payments\n(170,000 )\n-\nCash paid to acquire business, excluding cash acquired\n$ 4,036,367\n$ -\nSee Notes to these consolidated financial statements\nINTELLINETICS, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\n1. Business Organization and Nature of Operations\nIntellinetics, Inc., formerly known as GlobalWise Investments, Inc., (“Intellinetics”), is a Nevada corporation incorporated in 1997, with two subsidiaries: (i) Intellinetics, Inc., an Ohio corporation that is wholly-owned by the Company (“Intellinetics Ohio), and (ii) Graphic Sciences, Inc., a Michigan corporation that is also wholly-owned by the Company (“Graphic Sciences”). Intellinetics Ohio was incorporated in 1996, and on February 10, 2012, Intellinetics Ohio became the sole operating subsidiary of the Company as a result of a reverse merger and recapitalization. On March 2, 2020, the Company purchased all the outstanding capital stock of Graphic Sciences.\nThe Company is a document management company, providing comprehensive document solutions, software, and services to its customers in both the public and private sectors. The Company’s software platform allows customers to capture and manage all documents across operations such as scanned hard-copy documents and all digital documents including those from Microsoft Office 365, digital images, audio, video and emails. The Company’s suite of document services includes indexing, conversion, and physical document storage and retrieval. The Company’s comprehensive solutions create value for customers by making it easy to connect business-critical documents to the processes they drive by making them easy to find, secure and compliant with its customers’ audit requirements.\n2. Basis of Presentation\nThe accompanying audited consolidated financial statements have been prepared in accordance with United States generally accepted accounting principles (“U.S. GAAP”). The Company has evaluated subsequent events through the issuance of this Form 10-K.\n3. Liquidity and Management’s Plans\nThrough December 31, 2020, the Company had incurred an accumulated deficit since its inception of $22,996,267, including operating losses and operating cash flow deficits in recent years. Since inception, the Company’s operations have primarily been funded through a combination of gross profits, government-sponsored loans, and the sale of both equity and debt securities. At December 31, 2020, the Company had a cash balance of $1,907,882.\nOn March 2, 2020, the Company issued shares and debt totaling $5.5 million, and converted approximately $6 million in existing debt principal and interest to equity. This resulted in a recapitalization of the balance sheet and new debt of $2 million, reducing the Company’s interest burden. Simultaneously, the Company used the proceeds from the capital raise to purchase Graphic Sciences, Inc. On April 21, 2020, the Company purchased substantially all the assets of CEO Imaging Systems, Inc. The acquisitions significantly helped the Company reach its current monthly cash flow. Further, the Company received a loan through the Paycheck Protection Program (“PPP”) in April 2020 amounting to $838,700, and received notice on January 20, 2021 that its forgiveness application was accepted by the Small Business Administration. With improved operating results over the course of the latter half of 2020, the consolidated Company has significantly better liquidity than in prior years.\nOur ability to meet our capital needs in the future will depend on many factors, including maintaining and enhancing our operating cash flow, successfully managing the transition of our recent acquisitions of Graphic Sciences and CEO Image, successfully retaining and growing our client base in the midst of general economic uncertainty, and managing the continuing effects of the COVID-19 pandemic on our business. We will need to successfully manage our revenues to support potential future earnout commitments for previous transactions and current debt service commitments, and our future cash resources and capital requirements may vary materially from those now planned. Our ability to obtain additional capital or debt financing on favorable terms, if needed, would likely be adversely affected by our history of operating losses. Prior to 2020, management has historically assessed that there was substantial doubt regarding our ability to continue as a going concern. These conditions raise substantial doubt over the Company’s ability to meet all of its obligations over the twelve months following the date of this Report. However, management has evaluated these conditions and believes, based on its improved balance sheet, improved consolidated cash flow, and current plans and expectations, that it will be able to meet those obligations, although there is no assurance.\nBased on our plans and assumptions as of the date of this report, we believe our capital resources, including our cash and cash equivalents, along with funds expected to be generated from our operations, will be sufficient to meet our anticipated cash needs, including for working capital, earnout liability payments for previous transactions, capital spending, and debt service commitments, for at least the next 12 months. However, any projections of future cash needs and cash flows are subject to risks and uncertainties, such as our history of operating losses, the current COVID-19 pandemic, as well as general overall economic conditions.\n4. Corporate Actions\nOn March 20, 2020, the Company effected a one-for-fifty (1-for-50) reverse stock split of the Company’s common stock. All share and per share amounts herein have been adjusted to reflect the reverse stock split.\n5. Summary of Significant Accounting Policies\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of Intellinetics and the accounts of all the subsidiaries in which a controlling interest is held by the Company. Under U.S. GAAP, consolidation is generally required for investments of more than 50% of the outstanding voting stock of an investee, except when control is not held by the majority owner. The Company’s subsidiaries include: Intellinetics Ohio and Graphic Sciences. The Company considers the criteria established under Financial Accounting Standards Board (“FASB”) Accounting Standard Codification (“ASC”) Topic 810, “Consolidations” in its consolidation process. All significant intercompany balances and transactions have been eliminated in consolidation.\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions. Such estimates and assumptions affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses. Actual results could differ from estimated amounts.\nSignificant estimates and assumptions include valuation allowances related to receivables, accounts receivable -unbilled, allowance for obsolescence or slow-moving parts and supplies inventory, the recoverability of long-term assets, depreciable lives of property and equipment, purchase price allocations for acquisitions including earnout liabilities, fair value for goodwill and intangibles, the lease liabilities, estimates of fair value deferred taxes and related valuation allowances. The Company’s management monitors these risks and assesses its business and financial risks on a quarterly basis.\nRevenue Recognition\nIn accordance with ASC 606, the Company follows a five-step model to assess each contract of a sale or service to a customer: identify the legally binding contract, identify the performance obligations, determine the transaction price, allocate the transaction price, and determine whether revenue will be recognized at a point in time or over time. Revenue is recognized when a performance obligation is satisfied and the customer obtains control of promised goods and services. The amount of revenue recognized reflects the consideration to which we expect to be entitled to receive in exchange for these goods and services. In addition, ASC 606 requires disclosures of the nature, amount, timing, and uncertainty of revenue and cash flows arising from contracts with customers.\nWe categorize revenue as software, software as a service, software maintenance services, professional services, and storage and retrieval services. We earn the majority of our revenue from the sale of professional services, followed by the sale of software maintenance services and software as a service. Specific revenue recognition policies apply to each category of revenue.\na) Sale of software\nRevenues included in this classification typically include sales of licenses with professional services to new customers, additional software licenses to existing customers, and sales of software with or without services to the Company’s resellers (See section j) - Reseller Agreements, below. Our software licenses are functional intellectual property and typically provide customers with the right to use our software in perpetuity as it exists when made available to the customer. We recognize revenue from software licenses at a point in time upon delivery, provided all other revenue recognition criteria are met.\nb) Sale of software as a service\nSale of software as a service (“SaaS”) consists of revenues from arrangements that provide customers the use of the Company’s software applications, as a service, typically billed on a monthly or annual basis. Advance billings of these services are not recorded to the extent that the term of the arrangement has not commenced and payment has not been received. Revenue on these services is recognized over the contract period.\nc) Sale of software maintenance services\nSoftware maintenance services revenues consist of revenues derived from arrangements that provide post-contract support (“PCS”), including software support and bug fixes, to the Company’s software license holders. Advance billings of PCS are not recorded to the extent that the term of the PCS has not commenced and payment has not been received. PCS are considered distinct services. However, these distinct services are considered a single performance obligation consisting of a series of services that are substantially the same and have the same pattern of transfer to the customer. These revenues are recognized over the term of the maintenance contract.\nd) Sale of professional services\nProfessional services revenues consist of revenues from document scanning and conversion services, consulting, discovery, training, and advisory services to assist customers with document management needs, as well as repair and maintenance services for customer equipment. We recognize professional services revenue over time as the services are delivered using an input or output method (e.g., labor hours incurred as a percentage of total labor hours budgeted, images scanned, or similar milestones), as appropriate for the contract, provided all other revenue recognition criteria are met.\ne) Sale of storage and retrieval services\nSale of document storage and retrieval services consist principally of secured warehouse storage of customer documents, which are typically retained for many years, as well as retrieval per agreement terms and certified destruction if desired. We recognize revenue from document storage and retrieval services over the term of the contract for storage and for the retrieval and destructions components, as the services are delivered. Customers are generally billed monthly based upon contractually agreed-upon terms.\nf) Arrangements with multiple performance obligations\nIn addition to selling software licenses, software as a service, software maintenance services, professional services, and storage and retrieval services on a stand-alone basis, a portion of our contracts include multiple performance obligations. For contracts with multiple performance obligations, the Company allocates the transaction price of the contract to each distinct performance obligation, on a relative basis using its standalone selling price. The Company determines the standalone selling price based on the price charged for the deliverable when sold separately.\ng) Contract balances\nWhen the timing of our delivery of goods or services is different from the timing of payments made by customers, we recognize either a contract asset (performance precedes contractual due date) or a contract liability (customer payment precedes performance). Customers that prepay are represented by deferred revenue until the performance obligation is satisfied. Contract assets represent arrangements in which the good or service has been delivered but payment is not yet due. Our contract assets consisted of accounts receivable, unbilled, which are disclosed on the consolidated balance sheets. Our contract liabilities consisted of deferred (unearned) revenue, which is generally related to software as a service or software maintenance contracts. We classify deferred revenue as current based on the timing of when we expect to recognize revenue, which are disclosed on the consolidated balance sheets.\nThe following table presents changes in our contract assets and liabilities during the twelve months ended December 31, 2020, and 2019:\nBalance at\nBeginning of Period Addition\nfrom\nacquisition\n(Note 6) Revenue\nRecognized in\nAdvance of\nBillings Billings Balance at\nEnd of\nPeriod\nTwelve months ended December 31, 2020\nContract assets: Accounts receivable, unbilled $ 23,371 $ 276,023 $ 917,361 $ (693,233 ) $ 523,522\nTwelve months ended December 31, 2019\nContract assets: Accounts receivable, unbilled $ 65,118 $ - $ 156,876 $ (198,623 ) $ 23,371\nh) Deferred revenue\nAmounts that have been invoiced are recognized in accounts receivable, deferred revenue or revenue, depending on whether the revenue recognition criteria have been met. Deferred revenue represents amounts billed for which revenue has not yet be recognized. Deferred revenues typically relate to maintenance and software-as-a-service agreements which have been paid for by customers prior to the performance of those services, and payments received for professional services and license arrangements and software-as-a-service performance obligations that have been deferred until fulfilled under our revenue recognition policy.\nRemaining performance obligations represent the transaction price from contracts for which work has not been performed or goods and services have not been delivered. We expect to recognize revenue on approximately 95% of the remaining performance obligations over the next 12 months, with the remainder recognized thereafter. As of December 31, 2020, the aggregate amount of the transaction price allocated to remaining performance obligations for software as a service and software maintenance contracts with a duration greater than one year was $45,323. As of December 31, 2019, the aggregate amount of the transaction price allocated to remaining performance obligations for software as a service and software maintenance contracts with a duration greater than one year was $69,381. This does not include revenue related to performance obligations that are part of a contract whose original expected duration is one year or less.\nBalance at\nBeginning\nof Period\nAddition\nfrom\nacquisition\n(Note 6)\nBillings\nRecognized\nRevenue\nBalance at\nEnd of\nPeriod\nTwelve months ended December 31, 2020\nContract liabilities: Deferred revenue\n$ 754,073\n$ 198,659\n$ 3,038,446\n$ (2,995,047 )\n$ 996,131\nTwelve months ended December 31, 2019\nContract liabilities: Deferred revenue\n$ 723,619\n$ -\n$ 2,637,191\n$ (2,606,737 )\n$ 754,073\ni) Rights of return and customer acceptance\nThe Company does not generally offer variable consideration, financing components, rights of return or any other incentives such as concessions, product rotation, or price protection and, therefore, does not provide for or make estimates of rights of return and similar incentives. Our contracts with customers generally do not include customer acceptance clauses.\nj) Reseller agreements\nThe Company executes certain sales contracts through resellers. The Company recognizes revenues relating to sales through resellers when all the recognition criteria have been met including passing of control. In addition, the Company assesses the credit-worthiness of each reseller, and if the reseller is undercapitalized or in financial difficulty, any revenues expected to emanate from such resellers are deferred and recognized only when cash is received and all other revenue recognition criteria are met.\nk) Contract costs\nThe Company capitalizes the incremental costs of obtaining a contract with a customer. We have determined that certain sales commissions meet the requirement to be capitalized, and we amortize these costs on a consistent basis with the pattern of transfer of the goods and services in the contract. Total capitalized costs to obtain contracts were immaterial during the periods presented and are included in other current and long-term assets on our consolidated balance sheets.\nl) Sales taxes\nSales taxes charged to and collected from customers as part of the Company’s sales transactions are excluded from revenues, as well as the determination of transaction price for contracts with multiple performance obligations, and recorded as a liability to the applicable governmental taxing authority.\nm) Disaggregation of revenue\nThe Company provides disaggregation of revenue based on product groupings in our consolidated statements of operations as it believes this best depicts how the nature, amount, timing, and uncertainty of revenue and cash flows are affected by economic factors. Revenues from contracts are primarily within the United States. International revenues were not material to the consolidated financial statements for the twelve months ended December 31, 2020 and 2019.\nn) Significant financing component\nThe Company’s customers typically do not pay in advance for goods or services to be transferred in excess of one year. As such, it is not necessary to determine if the Company benefits from the time value of money and should record a component of interest income related to the upfront payment due to the practical expedient of ASC 606-10-32-18.\nConcentrations of Credit Risk\nThe Company maintains its cash with high credit quality financial institutions. At times, the Company’s cash and cash equivalents may be uninsured or in deposit accounts that exceed the Federal Deposit Insurance Corporation insurance limit.\nThe number of customers that comprise the Company’s customer base, along with the different industries, governmental entities and geographic regions, in which the Company’s customers operate, limits concentrations of credit risk with respect to accounts receivable, with the exception of the State of Michigan. In the twelve months ended December 31, 2020, the Company’s sales to the State of Michigan totaled approximately 47% of revenues. The Company has not experienced any losses, nor is not aware of any losses by Graphic Sciences, resulting from nonpayment by the State of Michigan.\nThe Company does not generally require collateral or other security to support customer receivables; however, the Company may require its customers to provide retainers, up-front deposits or irrevocable letters-of-credit when considered necessary to mitigate credit risks. The Company has established an allowance for doubtful accounts based upon facts surrounding the credit risk of specific customers and past collections history. Credit losses have been within management’s expectations. At December 31, 2020 and 2019, the Company’s allowance for doubtful accounts was $65,927 and $35,733, respectively.\nParts and Supplies\nParts and supplies are valued at the lower of cost or net realizable value. Costs are determined using the first-in, first-out method. Parts and supplies are used for scanning and document conversion services. A provision for potentially obsolete or slow-moving parts and supplies inventory is made based on parts and supplies levels, future sales forecasted and management’s judgment of potentially obsolete parts and supplies. The Company recorded an allowance of $15,000 at December 31, 2020 and there was no allowance recorded as of December 31, 2019.\nProperty and Equipment\nProperty, equipment and leasehold improvements are stated at cost less accumulated depreciation and amortization. Depreciation and amortization is computed over the estimated useful lives of the related assets on a straight-line basis. Furniture and fixtures, computer hardware and purchased software are depreciated over three to seven years. Leasehold improvements are amortized over the life of the lease or the asset, whichever is shorter, generally seven to ten years. Upon retirement or other disposition of these assets, the cost and related accumulated depreciation and amortization of these assets are removed from the accounts and the resulting gains and losses are reflected in the results of operations.\nIntangible Assets\nAll intangible assets have finite lives and are stated at cost, net of amortization. Amortization is computed over the useful life of the related assets on a straight-line method.\nGoodwill\nThe carrying value of goodwill is not amortized, but is tested for impairment annually as of December 31, as well as on an interim basis whenever events or changes in circumstances indicate that the carrying amount of a reporting unity may not be recoverable. An impairment charge is recognized for the amount by which the carrying amount exceeds the recorded fair value.\nImpairment of Long-Lived Assets\nThe Company accounts for the impairment and disposition of long-lived assets in accordance with ASC 360, “Property, Plant, and Equipment.” The Company tests long-lived assets or asset groups, such as property and equipment, for recoverability when events or changes in circumstances indicate that their carrying amount may not be recoverable.\nCircumstances which could trigger a review include, but are not limited to: significant adverse changes in the business climate or legal factors; current period cash flow or operating losses combined with a history of losses or a forecast of continuing losses associated with the use of the asset; and a current expectation that the asset will more likely than not be sold or disposed of before the end of its estimated useful life.\nRecoverability is assessed based on comparing the carrying amount of the asset to the aggregate pre-tax undiscounted cash flows expected to result from the use and eventual disposal of the asset or asset group. Impairment is recognized when the carrying amount is not recoverable and exceeds the fair value of the asset or asset group. The impairment loss, if any, is measured as the amount by which the carrying amount exceeds fair value, which for this purpose is based upon the discounted projected future cash flows of the asset or asset group. There were no impairment of long lived assets in the periods ended December 31, 2020 or 2019.\nPurchase Accounting Related Fair Value Measurements\nThe Company allocates the purchase price, including contingent consideration, of its acquisitions to the assets and liabilities acquired, including identifiable intangible assets, based on their respective fair values at the date of acquisition. Such fair market value assessments are primarily based on third-party valuations using assumptions developed by management that require significant judgments and estimates that can change materially as additional information becomes available. The purchase price allocated to intangibles is based on unobservable factors, including but not limited to, projected revenues, expenses, customer attrition rates, a weighted average cost of capital, among others. The weighted average cost of capital uses a market participant’s cost of equity and after-tax cost of debt and reflects the risks inherent in the cash flows. The approach to valuing the initial contingent consideration associated with the purchase price also uses similar unobservable factors such as projected revenues and expenses over the term of the contingent earn-out period, discounted for the period over which the initial contingent consideration is measured, and volatility rates. The Company finalizes the purchase price allocation once certain initial accounting valuation estimates are finalized, and no later than 12 months following the acquisition date.\nLeases\nThe Company determines if an arrangement is a lease at inception. Operating leases in which the Company is the lessee are included in operating lease right-of-use (“ROU”) assets and operating lease liabilities in the consolidated balance sheets. The Company does not have any finance leases, as a lessee, and no long-term leases for which it is the lessor.\nROU assets represent the right to use an underlying asset for the lease term and lease liabilities represent our obligation to make lease payments arising from the lease. Operating lease ROU assets and liabilities are recognized at commencement date based on the present value of lease payments over the reasonably certain lease term. As the Company’s leases do not provide an implicit rate, we use our incremental borrowing rate based on the information available at commencement date in determining the present value of lease payments. The Company uses the implicit rate when readily determinable. The operating lease ROU asset also includes any lease payments made and reduced by lease incentives, such as tenant improvement allowances. The Company’s lease terms include options to extend or terminate the lease only when it is reasonably certain that we will exercise that option. Lease expense for lease payments is recognized on a straight-line basis over the lease term.\nStock-Based Compensation\nThe Company accounts for stock-based payments to employees in accordance with ASC 718, “Compensation - Stock Compensation.” Stock-based payments to employees include grants of stock that are recognized in the consolidated statement of operations based on their fair values at the date of grant.\nThe Company accounts for stock-based payments to non-employees in accordance with ASC 718, “Compensation - Stock Compensation,” which requires that such equity instruments are recorded at their fair values on the grant date.\nThe grant date fair value of stock option awards is recognized in earnings as stock-based compensation cost over the requisite service period of the award using the straight-line attribution method. The Company estimates the fair value of the stock option awards using the Black-Scholes-Merton option pricing model. The exercise price of options is specified in the stock option agreements. The expected volatility is based on the historical volatility of the Company’s stock for the previous period equal to the expected term of the options. The expected term of options granted is based on the midpoint between the vesting date and the end of the contractual term. The risk-free interest rate is based upon a U.S. Treasury instrument with a life that is similar to the expected term of the options. The expected dividend yield is based upon the yield expected on date of grant to occur over the term of the option.\nSoftware Development Costs\nThe Company designs, develops, tests, markets, licenses, and supports new software products and enhancements of current products. The Company continuously monitors its software products and enhancements to remain compatible with standard platforms and file formats. In accordance with ASC 985-20, “Costs of Software to be Sold, Leased or Otherwise Marketed,” the Company expenses software development costs, including costs to develop software products or the software component of products to be sold, leased, or marketed to external users, before technological feasibility is reached. Once technological feasibility has been established, certain software development costs incurred during the application development stage are eligible for capitalization. Based on the Company’s software development process, technical feasibility is established upon completion of a working model. Technological feasibility is typically reached shortly before the release of such products. No such costs were capitalized during the periods presented in this report.\nIn accordance with ASC 350-40, “Internal-Use Software,” the Company capitalizes purchase and implementation costs of internal use software. Once an application has reached development stage, internal and external costs, if direct and incremental, are capitalized until the software is substantially complete and ready for its intended use. Capitalization ceases upon complete of all substantial testing. The Company also capitalize costs related to specific upgrades and enhancements when it is probable that the expenditure will result in additional functionality. No such costs were capitalized during the periods presented in this report.\nFor the twelve months ended December 31, 2020, and 2019, our expensed software development costs were $293,092 and $467,364, respectively.\nRecent Accounting Pronouncements\nIntangibles - Goodwill and Other - Internal-Use Software\nIn August 2018, the FASB issued ASU 2018-15, which addresses a customer’s accounting for implementation costs incurred in a cloud computing arrangement that is a service contract. Under the new guidance, customers will apply the same criteria for capitalizing implementation costs as they would for an arrangement that has a software license. ASC 2018-15 was effective for the Company beginning in its first quarter of 2020. The Company has concluded that the impact on its consolidated financial statements and related disclosures is not material.\nFair Value\nIn August 2018, the FASB issued ASU 2018-13, which is guidance that changes the fair value measurement disclosure requirements of ASC 820. ASU 2018-13 was effective for the Company beginning in its first quarter of 2020. The Company has concluded that the impact on its consolidated financial statements and related disclosures is not material.\nRecently Issued Accounting Pronouncements Not Yet Effective\nFinancial Instruments - Credit Losses\nIn June 2016, the FASB issued ASU 2016-13, Financial Instruments - Credit Losses (Topic 326), which requires entities to measure all expected credit losses for financial assets held at the reporting date based on historical experience, current conditions, and reasonable and supportable forecasts. This replaces the existing incurred loss model and is applicable to the measurement of credit losses on financial assets measured at amortized cost. ASC 2016-16 is effective for annual reporting periods beginning after December 15, 2023, including interim reporting periods within those annual reporting periods. Early adoption is permitted. The Company is currently evaluating the impact of the new guidance on its consolidated financial statements and related disclosures.\nReference Rate Reform\nIn March 2020, the FASB issued ASU 2020-04, “Reference Rate Reform (Topic 848): Facilitation of the Effects of Reference Rate Reform on Financial Reporting” which provides optional relief through specific exceptions and practical expedients for transitioning away from reference rates that are expected to be discontinued. The relief generally applies to eligible modifications of contractual terms that change (or have the potential to change) the amount or timing of contractual cash flows related to replacement of a reference rate. The relief allows such modifications to be accounted for as continuations of existing contracts without additional analysis. The optional relief is available from March 2020 through December 31, 2022. The Company is currently evaluating the impact of this ASU.\nIncome Taxes\nIn December 2019, the FASB issued ASU 2019-12, “Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes” which removes certain exceptions related to intra-period tax allocations and deferred tax accounting on outside basis differences in foreign subsidiaries and equity method investments. Additionally, it provides other simplifying measures for the accounting for income taxes. The new standard is effective for fiscal years beginning after December 15, 2021 with early adoption permitted. The Company is currently evaluating the impact of this ASU.\nEquity Securities, Equity Method Investments and Certain Derivatives\nIn January 2020, the FASB issued ASU 2020-01, “Clarifying the Interactions Between Topic 321, Topic 323, and Topic 815.” This ASU clarifies the interaction between accounting standards related to equity securities, equity method investments and certain derivatives. The effective date of the standard will be for annual periods beginning after December 15, 2020, and interim periods within those fiscal years. The Company is currently evaluating the impact of the adoption of the new standard on its consolidated financial statements and related disclosures.\nAll other Accounting Standards Updates issued but not yet effective are not expected to have a material effect on the Company’s future consolidated financial statements.\nAdvertising\nThe Company expenses the cost of advertising as incurred. Advertising expense for the twelve months ended December 31, 2020, and 2019 amounted to $7,362 and $4,255, respectively.\nEarnings (Loss) Per Share\nBasic income or loss per share is computed by dividing net income or loss by the weighted average number of shares of common stock outstanding during the period. Diluted income or loss per share is computed by dividing net income or loss by the diluted weighted average number of shares of common stock outstanding during the period. The diluted weighted average number of shares gives effect to all dilutive potential common shares outstanding during the period using the treasure stock method. Diluted earnings per share exclude all diluted potential shares if their effect is anti-dilutive, including warrants or options which are out-of-the-money and for those periods with a net loss. The twelve months ended December 31, 2020 and 2019 reported a net loss.\nIncome Taxes\nThe Company and its subsidiaries file a consolidated federal income tax return. The provision for income taxes is computed by applying statutory rates to income before taxes.\nDeferred income taxes are recognized for the tax consequences in future years of temporary differences between the financial reporting and tax bases of assets and liabilities as of each period-end based on enacted tax laws and statutory rates. Valuation allowances are established when necessary to reduce deferred tax assets to the amount expected to be realized. A 100% valuation allowance has been established on deferred tax assets at December 31, 2020 and 2019, due to the uncertainty of our ability to realize future taxable income. For the twelve months ended December 31, 2020 the Company recovered a net $179,400 of its valuation allowance in conjunction with the consolidation of the net deferred tax liability of its wholly owned subsidiary, Graphic Sciences.\nThe Company accounts for uncertainty in income taxes in its consolidated financial statements as required under ASC 740, “Income Taxes.” The standard prescribes a recognition threshold and measurement attribute for the financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return. The standard also provides guidance on de-recognition, classification, interest and penalties, accounting in interim periods, disclosure and transition accounting. Management determined there were no material uncertain positions taken by the Company in its tax returns.\nSegment Information\nOperating segments are defined in the criteria established under ASC 280, “Segment Reporting,” as components of public entities that engage in business activities from which they may earn revenues and incur expenses for which separate financial information is available and which is evaluated regularly by the Company’s chief operating decision maker (“CODM”) in deciding how to assess performance and allocate resources. The Company’s CODM assesses performance and allocates resources based on two operating segments: Document Management and Document Conversion. These segments contain individual business components that have been combined on the basis of common management, customers, solutions offered, service processes and other economic characteristics. The Company currently has no intersegment sales. The Company evaluates the segments’ performance based on gross profits.\nThe Document Management Segment provides cloud-based content services software. Its modular suite of solutions complements existing operating and accounting systems to serve a mission-critical role for organizations to make content secure, compliant, and process-ready. This segment conducts its primary operations in the United States. Markets served include highly regulated, risk and compliance-intensive markets in healthcare, K-12 education, public safety, other public sector, risk management, financial services, and others. Solutions are sold both directly to end-users and through resellers.\nThe Document Conversion Segment provides services for scanning and indexing, converting images from paper to digital, paper to microfilm, and microfiche to microfilm, as well as long-term physical document storage and retrieval. This segment conducts its primary operations in the United States. Markets served include business and federal, county, and municipal governments. Solutions are sold both directly to end-users and through a reseller distributor.\nInformation by operating segment is as follows:\nTwelve months ended\nDecember 31, 2020\nTwelve months ended\nDecember 31, 2019\nRevenues\nDocument Management\n$ 2,816,848\n$ 2,368,140\nDocument Conversion\n5,436,543\n167,815\nTotal revenues\n$ 8,253,391\n$ 2,535,955\nGross profit\nDocument Management\n$ 2,160,807\n$ 1,868,471\nDocument Conversion\n2,829,931\n99,641\nTotal gross profit\n$ 4,990,738\n$ 1,968,112\nCapital additions, net\nDocument Management\n$ 6,440\n$ -\nDocument Conversion\n70,414\n5,489\nTotal capital additions, net\n$ 76,854\n$ 5,489\nDecember 31, 2020\nDecember 31, 2019\nTotal assets\nDocument Management\n$ 2,295,165\n$ 981,085\nDocument Conversion\n8,049,468\n5,489\nTotal assets\n$ 10,344,633\n$ 986,574\nStatement of Cash Flows\nFor purposes of reporting cash flows, cash includes cash on hand and demand deposits held by banks.\nReclassifications\nCertain amounts reported in prior filings of the consolidated financial statements have been reclassified to conform to current presentation.\n6. Business Acquisitions\nOn March 2, 2020, the Company entered into a stock purchase agreement to acquire all of the issued and outstanding stock of Graphic Sciences. The acquisition was accounted for in accordance with GAAP and was made to expand the Company’s market share in the document management industry and due to synergies of product lines and services between the Companies.\nOn April 21, 2020, the Company entered into an asset purchase agreement to acquire substantially all of the assets of CEO Image. The acquisition was accounted for in accordance with GAAP and was made to expand the Company’s market share in the document management industry and due to synergies of product lines and services between the Companies.\nThe purchase price has been preliminarily allocated to assets acquired and liabilities assumed based on the estimated fair value of such assets and liabilities at the date of acquisitions as follows:\nTotal March 2, 2020 April 21, 2020\nAssets acquired:\nCash $ 17,269 $ 17,269 $ -\nAccounts receivable 1,122,737 1,071,770 50,967\nAccounts receivable, unbilled 276,023 276,023 -\nParts and supplies 91,396 91,396 -\nPrepaid expenses 73,116 73,116 -\nOther current assets 5,954 5,954 -\nRight of use assets 2,885,618 2,885,618 -\nProperty and equipment 735,885 732,372 3,513\nIntangible assets (see Note 7) 1,361,000 1,230,000 131,000\n6,568,998 6,383,518 185,480\nLiabilities assumed:\nAccounts payable 168,749 129,622 39,127\nAccrued expenses 162,426 155,949 6,477\nLease liabilities 2,947,684 2,947,684 -\nFederal and state taxes payable 168,900 168,900 -\nDeferred revenue 198,659 39,186 159,473\nDeferred tax liabilities - Net 149,900 149,900 -\n3,796,318 3,591,241 205,077\nTotal identifiable net assets/(liabilities) 2,772,680 2,792,277 (19,597 )\nPurchase price 5,095,567 4,592,453 503,114\nGoodwill - Excess of purchase price over fair value of net assets acquired $ 2,322,887 $ 1,800,176 $ 522,711\nThe purchase price of Graphic Sciences was financed with a $686,200 seller earnout liability and $3,906,253 was paid in cash. Goodwill in the amount of $1,800,176 was recognized in the acquisition of Graphic Sciences and is attributable to the cash flows of the business derived from the potential of the Company to outperform the market due to its existing relationship and other synergies created within the Company.\nThe purchase price of CEO Image was partially financed with a $203,000 seller earnout liability and $170,000 in installment payments. $128,832 was paid in cash at the closing. On August 3, 2020, $1,282 was paid for a net working capital adjustment and $70,000 was paid, along with accrued interest, in installment payments. On November 3, 2020, $100,000 was paid, along with accrued interest, in installment payments. Goodwill in the amount of $522,711 was recognized in the acquisition of CEO Image and is attributable to the cash flows of the business derived from the potential of the Company to outperform the market due to its existing relationship and other synergies created within the Company.\nAcquisition costs which include legal and other professional fees of approximately $636,440 were expensed as nonrecurring transaction costs and are included in significant transaction costs in the accompanying consolidated statement of operations.\nThe earnout arrangement for Graphic Sciences requires the Company to pay the seller up to $833,000 annually for a three-year period based on a gross profit level achieved by Graphic Sciences on an annual basis, resulting in a max payout to the seller over a three year period of $2,500,000, as defined, with no minimum requirement. At acquisition, management estimated a fair value of the contingent liability-earnout (“earnout liability”) of $686,200 which would be owed to the seller based on the terms of the earnout, and accordingly, recorded this liability at the acquisition date in accordance with GAAP. At December 31, 2020, the Company accrued an earnout liability of $2,110,000 to reflect the improved performance of the acquisitions against its threshold target and a reduction of uncertainty driven by the pandemic. See Note 8 for the estimated fair value of the earnout liability as of December 31, 2020.\nThe earnout arrangement for CEO Image requires the Company to pay the seller up to $185,000 annually for a two-year period based on a sales revenue level achieved by certain customers of CEO Image on an annual basis, resulting in a max payout to the seller over a two year period of $370,000, as defined, with no minimum requirement. At acquisition, management estimated a fair value of the earnout liability of $203,000 which would be owed to the seller based on the terms of the earnout, and accordingly, recorded this liability at the acquisition date in accordance with GAAP. At December 31, 2020, the Company accrued an earnout liability of $334,000 to reflect the improved performance of the acquisition against its threshold target and a reduction of uncertainty driven by the pandemic. See Note 8 for the estimated fair value of the earnout liability as of December 31, 2020.\nThe following unaudited pro forma information presents a summary of the consolidated results of operations for the Company as if the acquisitions of Graphic Sciences and CEO Image had occurred on January 1, 2019.\nFor the Twelve months ended\n(unaudited)\n(unaudited)\nDecember 31, 2020\nDecember 31, 2019\nTotal revenues\n$ 9,686,354\n$ 10,324,486\nNet loss\n$ (1,993,389 )\n$ (1,565,961 )\nBasic and diluted net loss per share\n$ (0.70 )\n$ (0.56 )\nThe unaudited pro forma consolidated results are based on the Company’s historical financial statements and those of Graphic Sciences and CEO Image and do not necessarily indicate the results of operations that would have resulted had the acquisition actually been completed at the beginning of the applicable period presented. The pro forma financial information assumes that the companies were combined as of January 1, 2019.\nThe following table presents the amounts of revenue and earnings of the acquirees since the acquisition date included in the consolidated income statement for the reporting period.\nFor the twelve months ended December 31, 2020\nGraphic Sciences\nCEO Image\nTotal revenues\n$ 5,238,654\n$ 375,863\nNet income\n$ 645,042\n$ (a)\n(a) Total earnings from the CEO Image acquisition is impracticable to disclose as the operations were merged with existing operations and not accounted for separately.\n7. Intangible Assets, Net\nAt December 31, 2020, intangible assets consisted of the following:\nEstimated\nAccumulated\nUseful Life Costs Amortization Net\nTrade names 10 years $ 119,000 $ (9,917 ) $ 109,083\nCustomer contracts 5-8 years 1,242,000 (166,112 ) 1,075,888\n$ 1,361,000 $ (176,029 ) $ 1,184,971\nAmortization expense for the twelve months ended December 31, 2020, amounted to $176,029, respectively. The following table represents future amortization expense for intangible assets subject to amortization.\nFor the Twelve Months Ending December 31, Amount\n$ 216,475\n216,475\n216,475\n216,475\n199,008\nThereafter 120,063\n$ 1,184,971\n8. Fair Value Measurements\nUnder U.S. GAAP, fair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. The fair value hierarchy consists of the following three levels. Level 1 inputs are quoted prices in active markets for identical assets or liabilities. Level 2 inputs consist of quoted prices for similar assets or liabilities in an active market, quoted prices for identical or similar assets or liabilities in markets that are not active, inputs other than quoted prices that are observable and market-corroborated inputs which are derived principally from or corroborated by observable market data. Level 3 inputs are derived from valuation techniques in which one or more significant inputs or value drivers are unobservable.\nThe carrying values of cash and equivalents, accounts receivable, accounts payable, accrued expenses, and the PPP Note Payable and 2019 Related Notes approximate fair value because of their short maturity. Management believes that the carrying value of the 2020 Notes approximate fair value given the March 2, 2020 transaction proximity to December 31, 2020 in conjunction with the absence of significant net change in the overall economic environment with regards to availability of credit to Company.\nThe table below reflects all other notes payable at December 31, 2019.\nDecember 31, 2019\nFair Value\n2016 Unrelated Notes (a) $ 942,256\n2017 Unrelated Notes (a) 2,011,859\n2018 Unrelated Notes (a) 1,028,792\nTotal\n$ 3,982,907\nDecember 31, 2019\nFair Value\n2016 Related Notes (a) $ 405,784\n2017 Related Notes (a) 445,810\n2018 Related Notes (a) 457,241\nTotal\n$ 1,308,835\n(a) The fair value was based upon Level 2 inputs. See Note 10 for additional information about the Company’s 2016, 2017, and 2018 Unrelated Notes. See Note 11 for additional information about the Company’s 2016, 2017, and 2018 Related Notes.\nThe Company has earnout liabilities related to acquisitions which are measured on a recurring basis and recorded at fair value, measured using probability-weighted analysis and discounted using a rate that appropriately captures the risks associated with the obligation. The inputs used to calculate the fair value of the earnout liabilities are considered to be Level 3 inputs due to the lack of relevant market activity and significant management judgment. Key unobservable inputs include revenue growth rates, which ranged from 0% to 7%, and volatility rates, which were 20% for gross profits. An increase in future revenues and gross profits may result in a higher estimated fair value while a decrease in future revenues and gross profits may result in a lower estimated fair value of the earnout liabilities.\nThe table below provides a summary of the changes in fair value of the earnout liabilities for the twelve months ended December 31, 2020.\nDecember 31, 2020\nFair value at January 1, 2020 $ -\nAdditions 889,200\nChange in fair value 1,554,800\nFair value at December 31, 2020 $ 2,4440,000\nThe fair values of amounts owed are recorded in the current and long-term portions of earnout liabilities in the Consolidated Balance Sheets. Changes in fair value are recorded in change in fair value of earnout liabilities in the Consolidated Statements of Operations.\n9. Property and Equipment\nProperty and equipment are comprised of the following:\nDecember 31, 2020 December 31, 2019\nComputer hardware and purchased software $ 1,019,259 $ 259,959\nLeasehold improvements 275,106 221,666\nFurniture and fixtures 82,056 82,056\n1,376,421 563,681\nLess: accumulated depreciation (677,669 ) (556,762 )\nProperty and equipment, net $ 698,752 $ 6,919\nTotal depreciation expense on the Company’s property and equipment for the twelve months ended December 31, 2020, and 2019 amounted to $120,906 and $7,701, respectively.\n10. Notes Payable\nSummary of Notes Payable\nThe table below reflects all notes payable at December 31, 2020 and 2019, respectively, with the exception of related party notes disclosed in Note 11 - Notes Payable - Related Parties.\nDecember 31, 2020 December 31, 2019\nPPP Note Payable (a) $ 838,700 $ -\n2020 Notes 2,000,000 -\n2018 Unrelated Notes - 900,000\n2017 Unrelated Notes - 1,760,000\n2016 Unrelated Notes, net of beneficial conversion feature of $50,703 - 824,297\nTotal notes payable $ 2,838,700 $ 3,484,297\nLess unamortized debt issuance costs (224,767 ) (144,334 )\nLess unamortized debt discount (231,111 ) -\nLess current portion (580,638 ) 3,339,963\nLong-term portion of notes payable $ 1,802,184 $ -\nFuture minimum principal payments of these notes payable as described in this Note 10 are as follows:\nAs of December 31, Amount\n2021 (a) $ 580,638\n2022 (a)\n258,062\n2,000,000\nTotal $ 2,838,700\n(a) The PPP Note Payable totaling $838,700 was fully forgiven January 20, 2021, as described below and in Note 19 - Subsequent Events.\nAs of December 31, 2020 and 2019, accrued interest for these notes payable with the exception of the related party notes in Note 11 - Notes Payable - Related Parties, was $5,941 and $918,307, respectively. As of December 31, 2020, unamortized deferred financing costs and unamortized debt discount were reflected within long term liabilities on the consolidated balance sheets. As of December 31, 2019, unamortized deferred financing costs were $144,334, and was reflected within current liabilities on the consolidated balance sheets.\nWith respect to all notes outstanding (other than the notes to related parties), for the twelve months ended December 31, 2020 and 2019, interest expense, including the amortization of deferred financing costs, accrued loan participation fees, original issue discounts, deferred interest and related fees, interest expense related to warrants issued for the conversion of convertible notes, and the embedded conversion feature was $548,742 and $735,474, respectively.\nSeller Notes Payable\nOn April 21, 2020, the Company entered into an asset purchase agreement under which the Company agreed to pay a principal amount of $170,000 (“Seller Notes Payable”) as further discussed in Note 6. The terms of the Seller Notes Payable were approximately three and six months, with $70,000 plus accrued interest paid August 3, 2020 and $100,000 plus accrued interest paid November 3, 2020. The Seller Notes Payable bore an interest rate of 1.5% per annum.\nPaycheck Protection Program Note Payable\nOn April 15, 2020, the Company entered into an unsecured promissory note (“PPP Note Payable”) under the Paycheck Protection Program (the “PPP”), through PNC Bank with a principal amount of $838,700. The term of the PPP Note Payable is two years, with an interest rate of 1.0% per annum, which shall be deferred for the first six months of the term of the loan. PPP loan recipients can be granted forgiveness for all or a portion of loans granted under the PPP, based on the use of loan proceeds for payroll costs and mortgage interest, rent or utility costs and the maintenance of employee and compensation levels. The Company received notice on January 20, 2021 that our forgiveness application was accepted by the Small Business Administration.\nNote Issuance\nOn March 2, 2020, the Company issued and sold 2,000 units (“Units”) to certain accredited investors in a private offering, with each Unit consisting of $1,000 in 12% Subordinated Notes (“2020 Notes”) and 40 shares of common stock, for aggregate gross proceeds of $2,000,000 in Units. The entire outstanding principal and accrued interest of the 2020 Notes are due and payable on February 28, 2023. Interest on the 2020 Notes accrues at the rate of 12% per annum, payable quarterly in cash, beginning on June 30, 2020. Any accrued but unpaid quarterly installment of interest shall accrue interest at the rate of 14.0% per annum. Any overdue principal and accrued and unpaid interest at the maturity date shall accrue a mandatory default penalty of 20% of the outstanding principal balance and an interest rate of 14% per annum from the maturity date until paid in full. The Company used a portion of the net proceeds of the offering to finance the acquisition of Graphic Sciences and CEO Image and using the remaining net proceeds for working capital and general corporate purposes. The Company recognized a debt discount of $320,000 for the 80,000 shares issued in conjunction with the Units. The amortization of the debt discount will be recognized over the life of the 2020 Notes as interest expense, and was $88,889, respectively, for the twelve months ended December 31, 2020.\nNote Conversion\nOn March 2, 2020, the Company entered into amendments to all of its then-outstanding convertible promissory notes, which were issued by the Company to various related and unrelated investors in 2016, 2017, and 2018. The Note Amendments permitted the Company to convert all of the then-outstanding principal and accrued and unpaid interest payable with respect to the 2016-2018 Notes into shares of Common Stock upon the same terms as such private placement. Pursuant to the Note Amendments, on March 2, 2020, the Company converted all of the then-outstanding principal and accrued and unpaid interest payable with respect to the 2016-2018 Notes into the aggregate amount of 1,433,689 shares of Common Stock at a conversion price of $4.00 per share. Taglich Brothers, Inc. acted as the exclusive placement agent for the Note Conversion, and earned fees in the form of 35,250 shares of Common Stock at a price of $4.00 per share (with such fees relating to the conversion of both the related and unrelated notes).\nNotes\nOn September 20 and September 26, 2018, the Company issued convertible promissory notes in an aggregate amount of $900,000 (“2018 Unrelated Notes”) to unrelated accredited investors (the “2018 Note Investors”). Placement agent and escrow agent fees of $106,740 were paid out of the cash proceeds. The 2018 Unrelated Notes matured on December 31, 2020, and bore interest at an annual rate of interest of 8% until maturity, with interest of 8% payable quarterly beginning January 2, 2019. The 2018 Note Investors had the right, in their sole discretion, to convert the 2018 Unrelated Notes into shares of Company common stock under certain circumstances at a conversion rate of $6.50 per share. These notes were further amended and converted into equity on March 2, 2020, as described further below in this note, see “2020 Note Conversion.”\nNotes\nOn November 17 and November 30, 2017, the Company issued convertible promissory notes in an aggregate amount of $1,760,000 (“2017 Unrelated Notes”) to unrelated accredited investors (the “2017 Note Investors”). Placement agent and escrow agent fees of $174,810 were paid out of the cash proceeds. The 2017 Unrelated Notes had an original maturity date of November 30, 2019. On September 14, 2018, the 2017 Unrelated Notes were amended to mature on December 31, 2020. The amendment was accounted for as a troubled debt restructuring with the future undiscounted cash flows being greater than the carrying value of the debt prior to extension. No gain was recorded on the amendment, and a new effective interest rate on the 2017 Unrelated Notes was established based on the carrying value of the debt and the revised future cash flows. The 2017 Unrelated Notes bore interest at an annual rate of interest of 8% until maturity, with interest of 8% payable quarterly beginning July 1, 2018. The 2017 Note Investors had the right, in their sole discretion, to convert the 2017 Unrelated Notes into shares of Company common stock under certain circumstances at a conversion rate of $10.00 per share. These notes were further amended and converted into equity on March 2, 2020, as described further below in this note, see “2020 Note Conversion.”\nNotes\nThe Company issued convertible promissory notes on December 30, 2016 in an aggregate amount of $315,000, and on January 6, 2017 and January 31, 2017 in an aggregate amount of $560,000 (collectively, the “2016 Unrelated Notes”), to unrelated accredited investors (the “2016 Note Investors”). Placement agent and escrow agent fees of $100,255 in the aggregate for those issuances, were paid out of the cash proceeds of those issuances. The 2016 Unrelated Notes bore interest at an annual rate of interest of 12% until maturity, with partial interest of 6% payable quarterly, and an original maturity date of December 31, 2018. The 2016 Note Investors had the right, in their sole discretion, to convert the 2016 Unrelated Notes into shares of Company common stock at a conversion rate of $32.50 per share. On September 17, 2018, the 2016 Unrelated Notes were amended to mature on December 31, 2020, and bore interest at an annual rate of interest of 10% until maturity, with partial interest of 5% payable quarterly. With the amendment, the 2016 Note Investors had the right, in their sole discretion, to convert the 2016 Unrelated Notes into shares of Company common stock at a conversion rate of $20.00 per share. The amendment was accounted for as a troubled debt restructuring with the future undiscounted cash flows being greater than the carrying value of the debt prior to extension. No gain was recorded on the amendment, and a new effective interest rate on the 2016 Unrelated Notes was established based on the carrying value of the debt and the revised future cash flows. The Company recognized an initial beneficial conversion feature in the amount of $369,677, plus a fair value adjustment of $56,661 under the troubled debt restructuring accounting. Interest expense recognized on the amortization of the beneficial conversion feature of the 2016 Unrelated Notes was $50,703 for the twelve months ended December 31, 2020 and 2019. These notes were further amended and converted into equity on March 2, 2020, as described further below in this note, see “2020 Note Conversion.”\nThe Company has evaluated the terms of its convertible notes payable in accordance with ASC 815 - 40, “Derivatives and Hedging - Contracts in Entity’s Own Stock” and determined that the underlying common stock is indexed to the Company’s common stock. The Company determined that the conversion feature did not meet the definition of a derivative and therefore did not bifurcate the conversion feature and account for it as a separate derivative liability. The Company evaluated the conversion feature for a beneficial conversion feature. The effective conversion price was compared with the market price on the date of each note. If the conversion price was deemed to be less than the market value of the underlying common stock at the inception of the note, then the Company recognized a beneficial conversion feature resulting in a discount on the note payable, upon satisfaction of the contingency. The beneficial conversion features were amortized to interest expense over the life of the respective notes, starting from the date of recognition.\n11. Notes Payable - Related Parties\nSummary of Related Notes\nThe table below reflects the notes payable to related parties at December 31, 2020 and 2019, respectively:\nDecember 31, 2020 December 31, 2019\n2019 Related Notes $ - $ 397,728\n2018 Related Notes - 400,000\n2017 Related Notes - 390,000\n2016 Related Notes, net of beneficial conversion feature of $20,015 - 354,985\nTotal notes payable - related party $ - $ 1,542,713\nUnamortized original issue discount and debt issuance costs - (75,313 )\nLess current portion - (1,467,400 )\nLong-term portion of notes payable-related party $ - $ -\nAs of December 31, 2019, accrued interest for these notes payable - related parties amounted to $294,191, and on the consolidated balance sheets was reflected within current liabilities as of December 31, 2019.\nFor the twelve months ended December 31, 2020 and 2019, interest expense in connection with notes payable - related parties was $88,941 and $245,215, respectively.\nNote Conversion\nOn March 2, 2020, the Company entered into amendments to all of its currently outstanding Convertible Promissory Notes, which were issued by the Company to various related and unrelated investors in 2016, 2017, and 2018. The Note Amendments permitted the Company to convert all of the then-outstanding principal and accrued and unpaid interest payable with respect to the 2016-2018 Notes into shares of Common Stock upon the same terms as such private placement. Pursuant to the Note Amendments, on March 2, 2020, the Company converted all of the then-outstanding principal and accrued and unpaid interest payable with respect to the 2016-2018 Notes into the aggregate amount of 1,433,689 shares of Common Stock at a conversion price of $4.00 per share. Taglich Brothers, Inc. acted as the exclusive placement agent for the Note Conversion, and earned fees in the form of 35,250 shares of Common Stock at a price of $4.00 per share (with such fees relating to the conversion of both the related and unrelated notes).\nNotes\nOn November 15, 2019, the Company issued promissory notes in an aggregate principal amount of $397,728 (the “2019 Related Notes”) to Robert Taglich and Michael Taglich (each holding more than 5% beneficial interest in the Company’s Shares). The notes included an original issue discount of $47,728. Interest expense recognized on the amortization of the original discount was $11,932, for the twelve months ended December 31, 2019. The notes bore no interest in addition to the original issue discount, which was 12%, and matured on May 15, 2020. If the 2019 Related Notes had not been either fully repaid by the Company or converted into Company shares or other securities by the maturity date, then the 2019 Related Notes would have accrued interest at the annual rate of 12% from the maturity date until the date of repayment. The Company used the proceeds of the 2019 Related Notes for working capital, general corporate purposes, and debt repayment. On March 2, 2020, $350,000 of such notes were converted into equity in connection with a private placement of common stock at a conversion price of $4.00 per share. On May 15, 2020, the remaining balance of $47,728 was repaid by the Company in cash.\nNotes\nOn September 26, 2018, the Company issued convertible promissory notes in an aggregate amount of $400,000 (the “2018 Related Notes”) to accredited investors, including Robert Taglich and Michael Taglich (each holding more than a 5% beneficial interest in the Company’s shares). The 2018 Related Notes matured on December 31, 2020, and bore interest at an annual rate of 8% until maturity, with interest payable quarterly beginning January 2, 2019. The 2018 Related Note investors had the right, in their sole discretion, to convert the 2018 Related Notes into shares of Company common stock under certain circumstances at a conversion rate of $6.50 per share. These notes were further amended and converted into equity on March 2, 2020, as described further below in this note, see “2020 Note Conversion.”\nNotes\nOn September 21, 2017, the Company issued convertible promissory notes in an aggregate principal amount of $154,640 (the “2017 Bridge Notes”) to Robert Taglich and Michael Taglich (each holding more than a 5% beneficial interest in the Company’s shares). The 2017 Bridge Notes included an original issue discount of $4,640. Interest expense recognized on the amortization of the original discount was $889 for the twelve months ended December 31, 2017. The 2017 Bridge Notes bore interest at an annual rate of 8% beginning March 21, 2018 until maturity on September 21, 2018. The effective interest rate was 7% for the term of the 2017 Bridge Notes. The 2017 Bridge Note investors had the right, in their sole discretion, to convert the 2017 Bridge Notes into securities to be issued by the Company in a private placement of equity, equity equivalents, convertible debt or debt financing. In conjunction with the issue of the 2016 Bridge Notes, 3,000 warrants were issued to the 2017 Bridge Note investors. The warrants have an exercise price equal to $15.00 per share and contain a cashless exercise provision. All warrants are immediately exercisable and are exercisable for five years from issuance. The Company recognized debt issuance costs, recorded as a debt discount, on the issue of the warrants in the amount of $38,836. Interest expense recognized on the amortization of the debt discount was $38,836 for the twelve months ended December 31, 2017. On November 30, 2017, principal in the amount of $150,000 of the 2017 Bridge Notes was converted by the 2017 Bridge Note investors into the 2017 Related Notes, described below.\nOn November 17, 2017, the Company issued convertible promissory notes in an aggregate amount of $390,000 (the “2017 Related Notes”) to accredited investors, including Robert Taglich and Michael Taglich (each holding more than a 5% beneficial interest in the Company’s shares) and James DeSocio (President, Chief Executive Officer and Director), in exchange for the conversion of $150,000 principal amount under the 2017 Bridge Notes and the receipt of $240,000 cash. The 2017 Related Notes were initially scheduled to mature on November 30, 2019. On September 14, 2018, the 2017 Related Notes were amended to mature on December 31, 2020. The amendment was accounted for as a troubled debt restructuring with the future undiscounted cash flows being greater than the carrying value of the debt prior to extension. No gain was recorded, and a new effective interest rate was established based on the carrying value of the debt and the revised future cash flows. The 2017 Related Notes bore interest at an annual rate of 8% until maturity, with interest payable quarterly beginning July 1, 2018. The 2017 Related Note investors had the right, in their sole discretion, to convert the 2017 Related Notes into shares of Company common stock under certain circumstances at a conversion rate of $10.00 per share. These notes were further amended and converted into equity on March 2, 2020, as described further below in this note, see “2020 Note Conversion.”\nNotes\nOn December 30, 2016, the Company issued convertible promissory notes in an aggregate amount of $375,000 (the “2016 Related Notes”) to accredited investors (the “2016 Related Note Investors”), including Robert Taglich and Michael Taglich (each holding more than 5% beneficial interest in the Company’s shares) and Robert Schroeder (a director of the Company). The 2016 Related Notes bore interest at an annual rate of interest of 12% until maturity, with partial interest of 6% payable quarterly, and an initial maturity date of December 31, 2018. The 2016 Related Note Investors had a right, in their sole discretion, to convert the 2016 Related Notes into shares of Company common stock at a conversion rate of $32.50 per share. On September 17, 2018, the 2016 Related Notes were amended to mature on December 31, 2020, and to bear interest at an annual rate of interest of 10% until maturity, with partial interest of 5% payable quarterly. With the amendment, the 2016 Related Note Investors had the right, in their sole discretion, to convert the 2016 Related Notes into shares at a conversion rate of $20.00 per share. The amendment was accounted for as a troubled debt restructuring with the future undiscounted cash flows being greater than the carrying value of the debt prior to extension. No gain was recorded on the amendment, and a new effective interest rate on the 2016 Related Notes was established based on the carrying value of the debt and the revised future cash flows. The Company recognized an initial beneficial conversion feature in the amount of $144,231, plus a fair value adjustment of $24,710 under the troubled debt restructuring accounting. Interest expense recognized on the amortization of the beneficial conversion feature of the 2016 Related Notes was $20,015 for the twelve months ended December 31, 2020 and 2019. These notes were further amended and converted into equity on March 2, 2020, as described further below in this note, see “2020 Note Conversion.”\n12. Deferred Compensation\nPursuant to the Company’s employment agreements with the founders, the founders have earned incentive compensation totaling $100,828 and $117,166 in cash, as of December 31, 2020 and 2019, respectively, which payment obligation has been deferred by the Company until it reasonably believes it has sufficient cash to make the payment. Following the retirement of founder A. Michael Chretien on December 8, 2017, the Company made bi-weekly payments of $1,846 until his portion of the deferred compensation had been paid, which occurred in May, 2020. For the twelve months ended December 31, 2020 and 2019, the Company paid $16,338 and $48,000, respectively, which is reflected as a reduction in the deferred compensation liability.\n13. Commitments and Contingencies\nFrom time to time the Company is involved in legal proceedings, claims and litigation related to employee claims, contractual disputes and taxes in the ordinary course of business. Although the Company cannot predict the outcome of such matters, currently the Company has no reason to believe the disposition of any current matter could reasonably be expected to have a material adverse impact on the Company’s financial position, results of operations or the ability to carry on any of its business activities.\nEmployment Agreements\nThe Company has entered into employment agreements with three of its key executives. Under their respective agreements, the executives serve at will and are bound by typical confidentiality, non-solicitation and non-competition provisions. Deferred compensation for a founder of the Company, as disclosed in Note 12 above, is still outstanding as of December 31, 2020 and 2019.\nOperating Leases\nOn January 1, 2010, the Company entered into an agreement to lease 6,000 rentable square feet of office space in Columbus, Ohio. The lease commenced on January 1, 2010 and, pursuant to a lease extension dated August 9, 2016, the lease expires on December 31, 2021. The Company is currently evaluating its renewal options.\nOur subsidiary, Graphic Sciences, uses 36,000 square feet of leased space in Madison Heights as its main facility. Graphic Sciences uses about 20,000 square feet for its records storage services, with the remainder of the space used for production, sales, and administration. The monthly rental payment is $41,508, with increases annually in September up to $45,828 for the final year, with a lease term continuing until August 31, 2026. Graphic Sciences also leases and uses a separate 20,000 square foot building for document storage in Highland Park, MI, and a satellite office in Traverse City, MI for production. The monthly Highland Park rental payment is $11,250, with a lease term continuing until September 30, 2021. The monthly Traverse City rental payment is $4,500, with a lease term continuing until January 31, 2024. Graphic Sciences also leases and uses four leased vehicles for logistics. The monthly rental payments for these vehicles total $2,618, with lease terms continuing until October 31, 2024.\nGraphic Sciences also leases and uses additional temporary storage space in Madison Heights, MI. This Madison Heights temporary storage space monthly rental payment is $12,500, with a lease term on a month-to-month basis. The Company has made an accounting policy election to not record a right-of-use asset and lease liability for short-term leases, which are defined as leases with a lease term of 12 months or less. Instead, the lease payments are recognized as rent expense in the general and administrative expenses on the statement of operations.\nFuture minimum lease payments under these operating leases are as follows:\nFor the Twelve Months Ending December 31, Amount\n$ 840,812\n617,255\n617,085\n550,878\n542,750\nThereafter 366,626\n$ 3,535,406\nLease costs charged to operations for the twelve months ended December 31, 2020 and 2019 amounted to $743,373 and $51,254, respectively. Included in the lease costs for the twelve months ended December 31, 2020 was short-term lease costs of $71,411. Additional information pertaining to the Company’s lease are as follows:\nFor the Twelve Months Ending December 31, 2020:\nOperating cash flows from operating leases $ 482,425\nWeighted average remaining lease term - operating leases 5.1 years\nWeighted average discount rate - operating leases 7.96 %\nAs the Company’s leases do not provide an implicit rate, the Company uses an incremental borrowing rate based on the information available at commencement date in determining the present value of lease payments.\n14. Stockholders’ Equity\nDescription of Authorized Capital\nThe Company is authorized to issue up to 25,000,000 shares of common stock with $0.001 par value. The holders of the Company’s common stock are entitled to one vote per share. The holders of common stock are entitled to receive ratably such dividends, if any, as may be declared by the Board of Directors out of legally available funds. However, the current policy of the Board of Directors is to retain earnings, if any, for the operation and expansion of the business. Upon liquidation, dissolution or winding-up of the Company, the holders of common stock are entitled to share ratably in all assets of the Company that are legally available for distribution.\nReverse Stock Split\nEffective February 27, 2020, upon recommendation and authorization by the Board of Directors, stockholders holding a majority in interest of the issued and outstanding shares of Common Stock, acting by written consent, adopted an amendment to the Company’s Articles of Incorporation to (i) effectuate the Reverse Split at a ratio of one-for-fifty (1-for-50) and (ii) reduce the number of authorized shares of Common Stock of the Company as of the effective date of such amendment to 25,000,000 shares. On March 3, 2020, the Company filed the Reverse Split Amendment, which became effective on March 20, 2020. On March 1, 2020, upon recommendation and authorization by the Board of Directors, stockholders holding a majority in interest of the issued and outstanding shares of Common Stock of the Company, acting by written consent, adopted an amendment to the Company’s Articles of Incorporation to increase the authorized number of shares of Common Stock to 160,000,000 shares (representing 3,200,000 on a post-split basis) from 75,000,000 shares (representing 1,500,000 on a post-split basis), in order to facilitate the acquisition of Graphic Sciences, the 2020 private placement of equity and debt, and the 2020 Note Conversion. On March 2, 2020, the Company filed the Shares Increase Amendment, which was effective immediately upon filing.\nThe reverse stock split did not cause an adjustment to par value of the common stock. As a result of the reverse stock split, the Company also adjusted the share amounts for shares reserved for issuance upon the exercise of outstanding warrants, outstanding stock options, and shares reserved for the 2015 Plan. All disclosures of common shares and per share data in the accompanying consolidated financial statements related notes have been adjusted to reflect the reverse stock split for all periods presented. The December 31, 2019 balances of common stock and additional paid in capital were adjusted to $371 and $14,419,437, from previously reported amounts of $31,528 and $14,388,280, respectively.\nIssuance of Restricted Common Stock to Directors\nOn January 2, 2020 and January 7, 2019, the Company issued 16,429 and 10,454 shares, respectively, of restricted common stock to directors of the Company as part of an annual compensation plan for directors. The grant of shares was not subject to vesting. Stock compensation of $57,500 was recorded over the requisite service period for the twelve months ending December 31, 2020. Stock compensation of $57,500 was recorded on the issuance of the common stock for the twelve months ended December 31, 2019.\nIssuance of Warrants\nBetween December 30, 2016 and January 31, 2017, the Company issued convertible promissory notes, the 2016 Unrelated Notes and the 2016 Related Notes (collectively, the “2016 Notes”), in an aggregate amount of $1,250,000 to certain accredited investors, including related parties, in private placements. The Company retained Taglich Brothers, Inc. as the exclusive placement agent for the private placement offering of the 2016 Notes. In January 2017, in compensation for the placement agent’s services in the private placement offering of the 2016 Notes, the Company paid the placement agent a cash payment of $100,000, equal to 8% of the gross proceeds of the offering, along with warrants to purchase 3,077 shares of Company common stock, and the reimbursement for the placement agent’s reasonable out of pocket expenses, FINRA filing fees and related legal fees. The warrants issued to the placement agent contained an exercise price at $37.50 per share, are exercisable for a period of five years after issuance, contain customary cashless exercise provisions and anti-dilution protection and, pursuant to piggyback registration rights, the underlying shares were registered in the Company’s a Registration Statement on Form S-1 declared effective in February 2018. Of the warrants issued to the placement agent, 1,699 warrants were issued in conjunction with proceeds raised in December 2016, and underwriting expense of $65,243 was recorded for the issuance of these warrants, utilizing the Black-Scholes valuation model to value the warrants issued. The remaining 1,378 warrants were issued in conjunction with proceeds raised in January 2017, and underwriting expense of $52,951 was recorded for the issuance of these warrants, utilizing the Black-Scholes valuation model. The fair value of warrants issued was determined to be $38.50.\nOn September 21, 2017, the Company issued warrants to purchase 3,000 shares of Company common stock to Robert Taglich and Michael Taglich (each holding more than a 5% beneficial interest in the Company’s shares) in connection with the 2017 Bridge Notes. The warrants are exercisable at an exercise price of $15.00 per share, contain a cashless exercise provision, antidilution protection and are exercisable for five years after issuance. A debt discount of $38,837 was recorded for the issuance of these warrants, utilizing the Black-Scholes valuation model. The 2017 Bridge Notes were converted into the 2017 Related Notes in November 2017. The fair value of warrants issued was determined to be $13.00 utilizing the Black-Scholes valuation model.\nBetween November 17 and November 30, 2017, the Company issued convertible promissory notes, the 2017 Unrelated Notes and the 2017 Related Notes (collectively, the “2017 Notes”), in an aggregate amount of $2,150,000 to certain accredited investors, including related parties, in private placements. The Company retained Taglich Brothers, Inc. as the exclusive placement agent for the private placement offering of the 2017 Notes. In compensation for the placement agent’s services in the private placement offering of the 2017 Notes, the Company paid the placement agent a cash payment of 8% of the gross proceeds of the offering, along with warrants to purchase shares of Company common stock, and the reimbursement for the placement agent’s reasonable out of pocket expenses, FINRA filing fees and related legal fees. On November 17, 2017, the Company paid the placement agent cash in the amount of $172,000 and issued the placement agent warrants to purchase 7,080 shares at an exercise price at $12.50 per share, which are exercisable for a period of five years after issuance, contain customary cashless exercise provisions and anti-dilution protection and were entitled to piggyback registration rights that were exercised in connection with the Company’s Registration Statement on Form S-1 declared effective in February 2018. On November 30, 2017, the Company issued the placement agent warrants to purchase 10,120 shares at an exercise price at $12.50 per share, which are exercisable for a period of five years after issuance, contain customary cashless exercise provisions and anti-dilution protection and are entitled to registration rights that were exercised in connection with the Company’s Registration Statement on Form S-1 declared effective in February 2018. Debt issuance costs of $126,603 was recorded for the issuance of the November 17 and November 30, 2017 warrants, utilizing the Black-Scholes valuation model. The fair value of warrants issued was determined to be $8.50 and $6.50 for the November 17 and November 30 warrants, respectively. For the twelve months ended December 31, 2020 and 2019, interest expense of $14,726 and $88,356, respectively, was recorded as amortization of the debt issuance costs.\nBetween September 20 and September 26, 2018, the Company issued convertible promissory notes, the 2018 Unrelated Notes and the 2018 Related Notes (collectively, the “2018 Notes”), in an aggregate amount of $1,300,000 to certain accredited investors, including related parties, in private placements. The Company retained Taglich Brothers, Inc. as the exclusive placement agent for the private placement offering of the 2018 Notes. In compensation, the Company paid the placement agent a cash payment of 8% of the gross proceeds of the offering, along with warrants to purchase shares of Company common stock, and reimbursement for the placement agent’s reasonable out of pocket expenses, FINRA filing fees and related legal fees. On September 20, 2018, the Company paid the placement agent cash in the amount of $40,000 and issued the placement agent warrants to purchase 6,153 shares at an exercise price at $9.00 per share, which are exercisable for a period of five years after issuance, contain customary cashless exercise provisions and anti-dilution protection and are entitled to limited piggyback registration rights. On September 26, 2018, the Company paid the placement agent cash in the amount of $64,000 and issued the placement agent warrants to purchase 9,846 shares at an exercise price at $9.00 per share, which are exercisable for a period of five years after issuance, contain customary cashless exercise provisions and anti-dilution protection and are entitled to limited piggyback registration rights. Debt issuance costs of $64,348 was recorded for the issuance of the September 20 and September 26, 2018 warrants, utilizing the Black-Scholes valuation model. The fair value of warrants issued was determined to be $5.00 and $3.50 for the September 20 and September 26 warrants, respectively. For the twelve months ended December 31, 2020, and 2019, interest expense of $14,458 and $86,750, respectively, was recorded as amortization of the debt issuance costs.\nOn March 2, 2020, the Company entered into a Securities Purchase Agreement (the “Securities Purchase Agreement”) with certain accredited investors, pursuant to which the Company issued and sold (i) 875,000 shares of the Company’s Common Stock, at a price of $4.00 per share, for aggregate gross proceeds of $3,500,000 and (ii) 2,000 units (“Units”), with each Unit consisting of $1,000 in 12% Subordinated Notes and 40 shares, for aggregate gross proceeds of $2,000,000 in Units and $5,500,000 for the combined private placement pursuant to the Securities Purchase Agreement. The Company issued 955,000 new shares of Common Stock for the Offering. The Company retained Taglich Brothers, Inc. as the exclusive placement agent for the private placement offering of the Securities Purchase Agreement. In compensation, the Company paid the placement agent a cash payment of 8% of the gross proceeds of the offering, along with warrants to purchase shares of Company common stock, and reimbursement for the placement agent’s reasonable out of pocket expenses, FINRA filing fees and related legal fees. On March 2, 2020, the Company paid the placement agent cash in the amount of $440,000 and issued the placement agent warrants to purchase 95,500 shares at an exercise price at $4.00 per share, which are exercisable for a period of five years after issuance, contain customary cashless exercise provisions and anti-dilution protection and are entitled to limited piggyback registration rights. Underwriting expense of $236,761 and debt issuance costs of $135,291 was recorded for the issuance of the March 2, 2020 warrants, utilizing the Black-Scholes valuation model. The fair value of warrants issued was determined to be $3.90. Underwriting expense of $307,867 and debt issuance costs of $175,924 was recorded for the placement agent cash fee and other related legal fees.\nThe estimated values of warrants, as well as the assumptions that were used in calculating such values were based on estimates at the issuance date as follows:\nPlacement\nAgent\nDecember 30, 2016 Bridge\nNoteholders\nSeptember 21, 2017\nRisk-free interest rate 1.93 % 1.89 %\nWeighted average expected term years years\nExpected volatility 123.07 % 130.80 %\nExpected dividend yield 0.00 % 0.00 %\nPlacement\nAgent\nNovember 17, 2017 Placement\nAgent\nNovember 30, 2017\nRisk-free interest rate 2.06 % 2.14 %\nWeighted average expected term years years\nExpected volatility 129.87 % 129.34 %\nExpected dividend yield 0.00 % 0.00 %\nPlacement\nAgent\nSeptember 20, 2018 Placement\nAgent\nSeptember 26, 2018\nRisk-free interest rate 2.96 % 2.96 %\nWeighted average expected term years years\nExpected volatility 122.52 % 122.92 %\nExpected dividend yield 0.00 % 0.00 %\nPlacement\nAgent\nMarch 2, 2020\nRisk-free interest rate 0.88 %\nWeighted average expected term years\nExpected volatility 130.12 %\nExpected dividend yield 0.00 %\nShares Issued and Outstanding and Shares Reserved for Exercise of Warrants, Convertible Notes, and the 2015 Plan\nThe Company had 2,810,865 Shares issued and outstanding, 150,216 Shares reserved for issuance upon the exercise of outstanding warrants, and 197,330 Shares reserved for issuance under the 2015 Plan, as of December 31, 2020.\n15. Stock-Based Compensation\nOn April 30, 2015, the Company entered into a Non-qualified Stock Option Agreement with Sophie Pibouin, a director of the Company, in accordance with the 2015 Plan. The agreement granted options to purchase 2,560 shares prior to the expiration date of April 29, 2025 at an exercise price of $37.50. The options granted vested on a graded scale over a period of time through October 31, 2015.\nOn January 1, 2016, the Company granted employees stock options to purchase 5,000 shares at an exercise price of $45.00 per share in accordance with the 2015 Plan. The options were fully vested as of January 1, 2019. The total fair value of $196,250 for these stock options was recognized by the Company over the requisite service period.\nOn February 10, 2016, the Company granted employees stock options to purchase 4,200 shares at an exercise price of $48.00 per share in accordance with the 2015 Plan. The options were fully vested as of February 10, 2020. The total fair value of $174,748 for these stock options was recognized by the Company over the requisite service period.\nOn December 6, 2016, the Company granted one employee stock options to purchase 2,000 shares at an exercise price of $38.00 per share in accordance with the 2015 Plan, with vesting continuing until December 2020. The total fair value of $63,937 for these stock options was recognized by the Company over the requisite service period.\nOn September 25, 2017, the Company granted an employee stock options to purchase 15,000 shares at an exercise price of $15.00 per share and 10,000 shares at an exercise price of $19.00 per share, in accordance with the 2015 Plan. The options were fully vested as of September 25, 2019. The total fair value of $321,011 for these stock options was recognized by the Company over the requisite service period.\nOn January 30, 2019, the Company entered into a Non-qualified Stock Option Agreement with an individual consultant to the Company, in accordance with the 2015 Plan. The agreement granted options to purchase 250 shares prior to the expiration date of December 31, 2025 at an exercise price of $45.00. The options granted were 100% vested as of the grant date.\nOn March 11, 2019, the Company canceled previously granted stock options to employees in the following amounts: 3,000 shares at an exercise price of $45.00 per share; 3,200 shares at an exercise price of $48.00 per share; 2,000 shares at an exercise price of $38.00 per share; 15,000 shares at an exercise price of $15.00 per share; and 10,000 shares at an exercise price of $19.00 per share. On March 11, 2019, the Company replaced those canceled stock options exercisable for a total of 33,200 shares with virtually identical stock options at an exercise price of $6.50 per share in accordance with the 2015 Plan. The incremental fair value of $24,898 for these stock options was recognized by the Company over the requisite service periods, which ranged by tranche from fully vested at issuance through vesting by December 2020.\nOn March 11, 2019, the Company granted employees stock options to purchase 10,100 shares at an exercise price of $6.50 per share in accordance with the 2015 Plan, with vesting continuing until 2023. The total fair value of $44,591 for these stock options is being recognized by the Company over the requisite service period.\nOn September 2, 2020, the Company granted employees stock options to purchase 99,000 shares, including 37,500 shares of performance-based options, at an exercise price of $4.00 per share in accordance with the 2015 Plan, with vesting continuing until 2024. The total fair value of $327,181 for these stock options is being recognized by the Company over the requisite service period.\nThe weighted average estimated values of director and employee stock option grants, as well as the weighted average assumptions that were used in calculating such values during the twelve months ended December 31, 2020 and 2019, were based on estimates at the date of grant as follows:\nApril 30, January 1, February 10,\nGrant Grant Grant\nRisk-free interest rate 1.43 % 1.76 % 1.15 %\nWeighted average expected term years years years\nExpected volatility 143.10 % 134.18 % 132.97 %\nExpected dividend yield 0.00 % 0.00 % 0.00 %\nDecember 6, September 25, January 30,\nGrant Grant Grant\nRisk-free interest rate 1.84 % 1.85 % 2.54 %\nWeighted average expected term years years years\nExpected volatility 123.82 % 130.79 % 115.80 %\nExpected dividend yield 0.00 % 0.00 % 0.00 %\nMarch 11, September 2,\nGrant Grant\nRisk-free interest rate 2.44 % 0.26 %\nWeighted average expected term years years\nExpected volatility 116.46 % 121.33 %\nExpected dividend yield 0.00 % 0.00 %\nA summary of stock option activity during the twelve months ended December 31, 2020, and 2019 is as follows:\nWeighted-\nWeighted- Average\nShares Average Remaining Aggregate\nUnder Exercise Contractual Intrinsic\nOption Price Life Value\nOutstanding at January 1, 2020 46,860 $ 9.02 years 19,200\nGranted 99,000 4.00\nForfeited and expired (500 ) 6.50\nOutstanding at December 31, 2020 145,360 $ 5.61 years $ 19,200\nExercisable at December 31, 2020 39,160 $ 9.51 years $ 19,200\nWeighted-\nWeighted- Average\nShares Average Remaining Aggregate\nUnder Exercise Contractual Intrinsic\nOption Price Life Value\nOutstanding at January 1, 2019 36,760 $ 25.04 years 79,200\nGranted 43,550 6.72\nForfeited and expired (33,450 ) 43.00\nOutstanding at December 31, 2019 46,860 $ 9.02 years $ 19,200\nExercisable at December 31, 2019 35,460 $ 9.82 years $ 19,200\nThe weighted-average grant date fair value of options granted during the twelve months ended December 31, 2020 and 2019 was $3.30 and $4.49, respectively.\nAs of December 31, 2020 and 2019, there was $322,874 and $56,012, respectively, of total unrecognized compensation costs related to stock options granted under our stock option agreements. The unrecognized compensation cost is expected to be recognized over a weighted-average period of four years. The total fair value of stock options that vested during the twelve months ended December 31, 2020, and 2019 was $16,650 and $108,035, respectively.\n16. Concentrations\nRevenues from the Company’s services to a limited number of customers have accounted for a substantial percentage of the Company’s total revenues. For the twelve months ended December 31, 2020, the Company’s largest customer, State of Michigan (“Michigan”), a direct customer, accounted for approximately 47% of the Company’s total revenue for that period. For the twelve months ended December 31, 2019, the Company’s two largest customers each accounted for approximately 6%, of the Company’s revenues for that period.\nFor the twelve months ended December 31, 2020, and 2019, government contracts represented approximately 64% and 41% of the Company’s net revenues, respectively. A significant portion of the Company’s sales to Resellers represent ultimate sales to government agencies.\nAs of December 31, 2020, accounts receivable concentrations from the Company’s two largest customers were 54% and 16% of gross accounts receivable, respectively, and as of December 31, 2019, accounts receivable concentrations from the Company’s four largest customers were 25%, 25%, 16% and 12% of gross accounts receivable, respectively. Accounts receivable balances from the Company’s two largest customers at December 31, 2020 have been partially collected.\n17. Provision For Income Taxes\nThe Company files income tax returns in the U.S. Federal jurisdiction and various state jurisdictions. For the twelve months ended December 31, 2020, and 2019, we have recognized the minimum amount of state income tax as required by the states in which we are required to file taxes. We are not currently subject to further federal or state tax since we have incurred losses since our inception.\nIncome tax benefit consists of the following Federal, deferred components for the twelve months ended December 31, 2020 and 2019:\nDecember 31, 2020\nDecember 31, 2019\nBenefit of net operating losses\n$ (72,541 )\n$ (524,000 )\nOther timing differences\n(91,770 )\n76,070\nChange in valuation allowance, including $188,000 reduction in valuation allowance due to purchased deferred tax liability\n(23,989 )\n447,930\nTax benefit\n$ (188,300 )\n$ -\nA reconciliation is provided below of the U.S. Federal income tax expense at a statutory rate of 21% for the twelve months ended December 31, 2020 and 2019:\nDecember 31, 2020\nDecember 31, 2019\nU.S. statutory rate\n%\n%\nU.S. Federal income tax at statutory rate\n$ (501,690 )\n$ (447,930 )\nIncrease (decrease) in income taxes due to:\nNon-deductible earnout expense\n299,040\n-\nNon-deductible goodwill amortization\n33,390\n-\nOther differences\n4,949\n-\nBenefit of acquisition-date purchased deferred tax liability\n(188,300 )\n-\nOther change in valuation allowance\n164,311\n447,930\nIncome tax benefit\n$ (188,300 )\n$ -\nThe approximate tax effects of temporary differences that give rise to significant portions of the deferred tax assets and liabilities are presented below:\nDecember 31, 2020\nDecember 31, 2019\nDeferred tax assets\nReserves and accruals not currently deductible for tax purposes\n$ 51,000\n$ 35,000\nAmortizable assets\n72,000\n-\nNet operating loss carryforwards\n4,020,000\n3,987,000\n4,143,000\n4,022,000\nDeferred tax liabilities\nProperty and equipment\n(143,000 )\n-\nNet Deferred tax assets\n4,000,000\n4,022,000\nValuation allowance\n(4,000,000 )\n(4,022,000 )\n$ -\n$ -\nAs of December 31, 2020 and 2019, we had federal net operating loss carry forwards of approximately $19,129,000 and $18,986,000, respectively, which can be used to offset future federal income tax. The federal and state net operating loss carry forwards expire at various dates through 2040. We recorded a valuation allowance against all of our deferred tax assets as of both December 31, 2020, and December 31, 2019. We intend to continue maintaining a full valuation allowance on our deferred tax assets until there is sufficient evidence to support the reversal of all or some portion of these allowances. Release of the valuation allowance would result in the recognition of certain deferred tax assets and a decrease to income tax expense for the period the release is recorded. However, the exact timing and amount of the valuation allowance release are subject to change on the basis of the level of profitability that we are able to actually achieve.\n18. Certain Relationships and Related Transactions\nCertain Relationships and Related Transactions\nThe following is a summary of the related person transactions that Intellinetics has participated in at any time during the reporting period.\nNotes Payable - Related Parties\nSee Note 11 for a summary of notes issued to related parties and the subsequent conversion of such related party notes into shares of our common stock on March 2, 2020.\nPrivate Placement\nThe following related persons participated as investors a private placement of securities by the Company, on the same terms as all other investors participating in the offering. The Company issued and sold (i) shares of common stock, at a price of $4.00 per share and (ii) units, with each unit consisting of $1,000 in 12% subordinated notes and 40 shares. The principal amount of the 12% subordinated notes, together with any accrued and unpaid interest thereon, become due and payable on February 28, 2023.\nName of Investor Relationship to the Company Number of\nShares\nPurchased Date of\nTransaction\nMichael N. Taglich Beneficially owns more than 5% of the common stock of the Company. 148,750 03/02/2020\nRobert F. Taglich Beneficially owns more than 5% of the Common Stock of the Company. 118,750 03/02/2020\nRobert C. Schroeder Director and Chairman of the Board of the Company 5,000 03/02/2020\nJames F. DeSocio President and Chief Executive Officer; Director of the Company 7,500 03/02/2020\nJoseph D. Spain Chief Financial Officer of the Company 2,000 03/02/2020\nPromoters and Certain Control Persons\nRobert C. Schroeder, a director of the Company, is the Vice President of Investment Banking at Taglich Brothers, Inc. Robert F. Taglich and Michael N. Taglich, each beneficial owners of more than 5% of the Company’s common stock, are also both principals of Taglich Brothers, Inc.\nWe retained Taglich Brothers, Inc. on an exclusive basis to render financial advisory and investment banking services to the Company in connection with our acquisition of Graphic Sciences. Pursuant to an Engagement Agreement, dated April 15, 2019, we paid Taglich Brothers, Inc. a success fee of $300,000 as a result of the successful completion of the acquisition of Graphic Sciences, Inc.\nWe retained Taglich Brothers, Inc., as the exclusive placement agent for the 2020 private placement, as described above, pursuant to a Placement Agent Agreement. In connection with the 2020 private placement, we paid Taglich Brothers, Inc. $440,000, which represented an 8% commission based upon the gross proceeds of the 2020 private placement. In addition, for its services in the 2020 private placement, Taglich Brothers, Inc. was issued warrants to purchase 95,500 shares of common stock, which amount is equal to 10% of the shares and unit shares sold in the 2020 private placement, which have an exercise price of $4.00 per share of common stock, are exercisable for a period of five years, contain customary cashless exercise and anti-dilution protection rights and are entitled to piggy-back registration rights.\nWe retained Taglich Brothers, Inc. as the exclusive placement agent for the 2020 note conversion, as described above in Note 11 (Notes Payable - Related Parties), pursuant to the Placement Agent Agreement. In connection with the 2020 note conversion, we issued 35,250 shares of common stock to Taglich Brothers, Inc., which, based on the conversion price of $4.00 per share, was equal to 3% of the original principal amount of the converted notes.\n19. Subsequent Events\nPPP Loan Forgiveness\nAs discussed in Note 10 - Notes Payable, the Company applied for forgiveness of its PPP loan, and the entire principal balance and interest were forgiven in January 2021. The forgiveness income, totaling $845,083, will be recorded as other income for the year ended December 31, 2021.\nIssuance of Restricted Common Stock to Directors\nOn February 15, 2021, the Company issued 12,207 new Shares of restricted common stock to directors of the Company in accordance with the Company’s director compensation policy. Stock compensation of $57,500 was recorded on the issuance of the common stock.\nCommitment to Purchase Capital Equipment and Enter Into a Lease\nOn February 18, 2021, the Company committed to purchase warehouse racking in the amount of $326,864. The Company is evaluating equipment financing options to finance the equipment purchase. On February 5, 2021, the Company signed a lease for 37,000 square foot building, primarily for document storage, in Sterling Heights, MI, with monthly rental payments of $20,452 commencing on May 1, 2021 and a lease term continuing to April 30, 2028.",
    "item_9": "ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.",
    "item_9A": "ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of the Company’s Disclosure Controls and Procedures\nThe Company maintains “disclosure controls and procedures” as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act that are designed to ensure that information required to be disclosed by us in reports we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SEC’s rules and forms, and that such information is accumulated and communicated to our management, including our principal executive officer and principal financial office, and Board of Directors, as appropriate, to allow timely decisions regarding required disclosure. In designing and evaluating our disclosure controls and procedures, management recognizes that disclosure controls and procedures, no matter how well conceived and operated, can provide only reasonable assurance of achieving the desired objectives, and we necessarily are required to apply our judgment in evaluating the cost-benefit relationship of possible disclosure controls and procedures.\nOur management, including our principal executive officer and principal financial officer, evaluated the effectiveness of the design and operation of our disclosure controls and procedures as of December 31, 2020 and concluded that our disclosure controls and procedures were effective as of December 31, 2020.\nManagement’s Annual Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act. Internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation and fair presentation of consolidated financial statements for external purposes, in accordance with generally accepted accounting principles. The effectiveness of any system of internal control over financial reporting is subject to inherent limitations and therefore, may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness of future periods are subject to the risk that the controls may become inadequate due to change in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur management, including our principal executive officer and principal financial officer, conducted an evaluation of the effectiveness of our internal control over financial reporting using the criteria set forth by the committee of Sponsoring Organization of the Treadway Commission (COSO) in Internal Control-Integrated Framework (2013).\nA material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of our annual or interim consolidated financial statements will not be prevented or detected on a timely basis.\nBased on our evaluation, our principal executive officer and principal financial officer concluded that, as of December 31, 2020, our disclosure controls and procedures were effective as required under Rules 13a-15(e) and 15d-15(e) under the Exchange Act and we did maintain effective internal control over financial reporting, based on criteria issued by COSO.\nThis report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Management’s report was not subject to attestation by our registered public accounting firm pursuant to rules of the SEC that permit us to provide only management’s report in this report.\nChanges in Internal Control Over Financial Reporting\nDuring the first fiscal quarter ended March 31, 2020, we completed the acquisition of Graphic Sciences. As a result, there were changes in our internal control over financial reporting that occurred during the first fiscal quarter ended March 31, 2020, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting stemming from our integration of Graphic Sciences. This change in control environment may lead us to modify certain internal controls in future periods.",
    "item_9B": "ITEM 9B. OTHER INFORMATION\nNot applicable\nPart III",
    "item_10": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nIncorporated by reference to our definitive Proxy Statement for the 2021 Annual Meeting of Stockholders, which will be filed with the SEC no later than 120 days after December 31, 2020.",
    "item_11": "ITEM 11. EXECUTIVE COMPENSATION\nIncorporated by reference to our definitive Proxy Statement for the 2021 Annual Meeting of Stockholders, which will be filed with the SEC no later than 120 days after December 31, 2020.",
    "item_12": "ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nIncorporated by reference to our definitive Proxy Statement for the 2021 Annual Meeting of Stockholders, which will be filed with the SEC no later than 120 days after December 31, 2020.",
    "item_13": "ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nIncorporated by reference to our definitive Proxy Statement for the 2021 Annual Meeting of Stockholders, which will be filed with the SEC no later than 120 days after December 31, 2020.",
    "item_14": "ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nIncorporated by reference to our definitive Proxy Statement for the 2021 Annual Meeting of Stockholders, which will be filed with the SEC no later than 120 days after December 31, 2020.\nPart IV",
    "item_15": "ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\nReference is made to the Index to Financial Statements beginning on Page hereof.\nFinancial Statement Schedules.\n(a) Documents Filed as Part of Report\n(1) Financial Statements.\n(3) Exhibits.\nThe exhibits listed on the accompanying Exhibit Index are filed or incorporated by reference as part of this report and such Exhibit Index is incorporated by reference.\nSignatures\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, on March 30, 2021.\nIntellinetics, Inc.\nBy: /s/ James F. DeSocio\nJames F. DeSocio\nPresident, Chief Executive Officer and Director\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities indicated on March 30, 2021.\nName\nTitle\nPresident, Chief Executive Officer, and Director\n/s/ James F. DeSocio\n(Principal Executive Officer)\nJames F. DeSocio\nChief Financial Officer and Treasurer\n/s/ Joseph D. Spain\n(Principal Financial and Accounting Officer)\nJoseph D. Spain\n/s/ Matthew L. Chretien\nChief Strategy Officer, Chief Technology Officer, Secretary, and Director\nMatthew L. Chretien\n/s/ Rye D’Orazio\nDirector\nRye D’Orazio\n/s/ Roger Kahn\nDirector\nRoger Kahn\n/s/ Robert C. Schroeder\nChairman of the Board, and Director\nRobert C. Schroeder\n/s/ Sophie Pibouin\nDirector\nSophie Pibouin\nEXHIBIT INDEX\nExhibit\nNo.\nDescription\nIncorporation by Reference\nForm\nExhibit\nFiling Date\n2.1\nStock Purchase Agreement, dated as of March 2, 2020, by and among Intellinetics, Inc., Graphic Sciences, Inc., and Thomas M. Liebold, Gregory P. Colton, Fredrick M. Kamienny, and Frederick L. Erlich\n8-K\n2.1\n03-04-2020\n2.2\nAsset Purchase Agreement, dated April 21, 2020, by and among Intellinetics, Inc., CEO Imaging Systems, Inc., and Bradley R. Lahr\n8-K\n2.2\n04-24-2020\n3.1.1\nArticles of Incorporation of Intellinetics, Inc.\n10-SB\n3.1\n10-02-2000\n3.1.2\nCertificate of Correction, effective May 22, 2007\n8-K\n3.1\n06-15-2007\n3.1.3\nCertificate of Amendment to Articles of Incorporation of Intellinetics, Inc.\n8-K\n99.1\n09-03-2014\n3.1.4\nCertificate of Amendment to Articles of Incorporation of Intellinetics, Inc., dated March 2, 2020\n8-K\n3.1\n03-04-2020\n3.1.5\nCertificate of Amendment to Articles of Incorporation of Intellinetics, Inc., dated March 3, 2020\n8-K\n3.2\n03-04-2020\n3.2.1\nBylaws of Intellinetics, Inc.\n10-SB\n3.3\n10-02-2000\n3.2.2\nAmendment No. 1 to the Bylaws of Intellinetics, Inc.\n8-K\n3.4\n03-01-2012\n3.2.2\nAmendment No. 2 to the Bylaws of Intellinetics, Inc.\n8-K\n3.3\n03-04-2020\n4.1\nForm of Stock Certificate\n10-K\n4.1\n03-30-2020\n4.2\nForm of Warrants dated November 30, 2016\n8-K\n10.2\n12-06-2016\n4.3\nForm of Placement Agent Warrants, dated January 31, 2017\n8-K\n10.3\n01-06-2017\n4.4\nForm of Warrant to Purchase Common Stock, issued October 22, 2017\n8-K\n10.2\n10-26-2017\n4.5\nForm of Placement Agent Warrants\n8-K\n10.5\n11-24-2017\n4.6\nForm of Placement Agent Warrants\n8-K\n10.3\n09-26-18\n4.7\nForm of 12% Subordinated Notes, dated March 2, 2020\n8-K\n10.2\n03-04-2020\n4.8\nForm of Placement Agent Warrants, dated March 2, 2020\n8-K\n4.4\n03-04-2020\n4.9\nDescription of Registered Securities +\n10.1\nAmended Employment Agreement of Matthew L. Chretien, dated September 16, 2011\n8-K\n10.37\n02-13-2012\n10.2\nAmended Offer of Employment of Matthew L. Chretien, dated September 16, 2011\n8-K\n10.38\n02-13-2012\n10.3\nEmployment Agreement of Joseph D. Spain dated December 2, 2016\n8-K\n10.3\n12-06-2016\n10.4\nLease Renewal Agreement by and between Intellinetics, Inc. and Dividend Drive LLC, dated as of August 9, 2016\n10-K\n10.6\n03-30-2017\n10.5\nIntellinetics, Inc. 2015 Equity Incentive Plan\n8-K\n10.3\n04-30-2015\n10.6\nFirst Amendment to Intellinetics, Inc. 2015 Equity Incentive Plan, dated September 25, 2017\n8-K\n10.2\n09-26-2017\n10.7\nSecond Amendment to Intellinetics, Inc. 2015 Equity Incentive Plan, dated February 19, 2018\n8-K\n10.2\n02-23-2018\n10.8\nForm of Non-Qualified Stock Option Agreement under Company’s 2015 Equity Incentive Plan\n10-K\n10.9\n03-28-2016\n10.9\nForm of Incentive Stock Option Agreement under Company’s 2015 Equity Incentive Plan\n8-K\n10.6\n01-05-2016\n10.10\nOffer Letter, dated September 25, 2017, between Intellinetics, Inc. and James F. DeSocio\n8-K\n10.1\n09-26-2017\n10.11\nIntellinetics, Inc. 2018 Executive Incentive Compensation Plan\n8-K\n10.3\n02-23-2018\n10.12\nAmendment, dated February 19, 2018, between Intellinetics, Inc. and Joseph D. Spain\n8-K\n10.1\n02-23-2018\n10.13\nState of Michigan Enterprise Procurement Notice of Contract No 171 180000000749, between the State of Michigan and Graphic Sciences, Inc., with Standard Contract Terms, dated June 1, 2018\n8-K\n10.4\n03-04-2020\n10.14\nStandard Industrial Lease Agreement, by and between KHS Properties, LLC and Graphic Sciences, Inc., dated August 30, 2018. +\n10.15\nLease, by and between Liberty Park Commerce Center, LLC and Graphic Sciences, Inc., dated February 5, 2021. +\n21.1\nList of Subsidiaries of Intellinetics, Inc. +\n23.1\nConsent of Independent Registered Public Accounting Firm +\n31.1\nCertification of Principal Executive Officer pursuant to Section 302 of The Sarbanes-Oxley Act of 2002 +\n31.2\nCertification of Principal Financial Officer pursuant to Section 302 of The Sarbanes-Oxley Act of 2002 +\n32.1\nCertification of Principal Executive Officer pursuant to Section 906 of The Sarbanes-Oxley Act of 2002 +\n32.2\nCertification of Principal Financial Officer pursuant to Section 906 of The Sarbanes-Oxley Act of 2002 +\n101.INS\nXBRL Instance Document +\n101.SCH\nXBRL Taxonomy Extension Schema Document +\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase Document +\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document +\n101.LAB\nXBRL Taxonomy Extension Label Linkbase Document +\n101.PRE\nXBRL Taxonomy Extension Linkbase Document +\n+ Filed herewith:"
}