{
    "cik": "1082324",
    "company": "VirnetX Holding Corp",
    "filing_type": "10-K",
    "filing_date": "2021-03-16",
    "period_of_report": "2020-12-31",
    "sic": "6794",
    "state_of_inc": "DE",
    "state_location": "NV",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1082324/0001140361-21-008678-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1082324/000114036121008678/brhc10021150_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1082324/0001140361-21-008678.txt",
    "filename": "1082324_10K_2020_0001140361-21-008678.htm",
    "item_1": "Item 1. Business\nThe Company\nWe are an Internet security software and technology company with patented technology for various types of secure network communications, including 5G and 4G LTE network security. Our patented Secure Domain Name Registry and GABRIEL Connection Technology™, are the foundation for our GABRIEL Secure Communication Platform™ that protects communications using Zero Trust Network Access (ZTNA). Our technology generates secure connections on a “zero-click” or “single-click” basis, significantly simplifying the deployment of secure real-time communication solutions by eliminating the need for end-users to enter any encryption information. Our portfolio of intellectual property is the foundation of our business model. We currently own approximately 194 total patents and pending applications, including 70 U.S. patents/patent applications and 124 foreign patents/validations/pending applications. Our patent portfolio is primarily focused on securing real-time communications over the Internet, and related services, and is used in all our technology and products, some of which were acquired by our principal operating subsidiary; VirnetX, Inc., from Leidos, Inc., or Leidos, (f/k/a Science Applications International Corporation, or SAIC) in 2006.\nOur product portfolio includes sophisticated technologies, products and services that are available for sale worldwide. Our GABRIEL Secure Communication Platform™ includes a set of software libraries with application interfaces available for securing third-party applications seamlessly across multiple operating systems. It enables individuals and organizations to maintain complete ownership and control over their personal and confidential data, secured within their own private network, while enabling authorized secure encrypted access from anywhere at any time.\nOur GABRIEL Gateway product extends our Secure Communication Platform™ by allowing existing networked devices and services to seamlessly join the “GABRIEL SECURED” network without requiring any modifications. All these devices or services, including on-premise or cloud-based services, can now be assigned a VirnetX Secure Domain Name and use fully authenticated, secure communication channels for its communications.\nOur GABRIEL Collaboration Suite™ is a set of communication applications and tools that use our GABRIEL Secure Communication Platform™. It enables seamless and secure cross-platform communications between devices that are enrolled in our “GABRIEL SECURED” network and have our software installed. Our GABRIEL Collaboration Suite™ is available for download and free trial, for Android, iOS, Windows, Linux, and Mac OS X platforms, at https://virnetx.com.\nWe continue to enhance our products and add new functionality. We will provide updates to new and existing customers as they are released to the public. Many small and medium businesses have installed our GABRIEL Secure Communication Platform™ and GABRIEL Collaboration Suite™ products in their corporate networks. We intend to continue to expand our customer base with targeted promotions and direct sales initiatives.\nWe have an ongoing GABRIEL Licensing Program under which we offer licenses to a portion of our patent portfolio, technology, and software, including our secure domain name registry service, to domain infrastructure providers, communication service providers as well as to system integrators. Our GABRIEL Connection Technology™ License is offered to OEM customers who want to adopt the GABRIEL Connection Technology™ as their solution for establishing secure connections using secure domain names within their products. We have developed GABRIEL Connection Technology™ Software Development Kit (SDK) to assist with rapid integration of these techniques into existing software implementations. Customers who want to develop their own implementation of the VirnetX patented techniques for supporting secure domain names, or other techniques that are covered by our patent portfolio for establishing secure communication links, can purchase a patent license. The number of patents licensed, and therefore the cost of the patent license to the customer, will depend upon which of the patents are used in a particular product or service. These licenses will typically include an initial license fee, as well as an ongoing royalty.\nOur employees include the core development team behind our patent portfolio, technology, and software. Some members of this team have worked together for over twenty years and were on same team that invented and developed this technology while working at Leidos, Inc. (“Leidos”). The team has continued its research and development work and expanded the set of patents we acquired in 2006 from Leidos, into a larger patent portfolio. This portfolio now serves as the foundation of our products, services, and our licensing business. It is expected to generate most of our future revenue in license fees and royalties. We intend to continue our efforts to develop new products and technologies and further strengthen and expand our patent portfolio. We intend to continue using an outsourced and leveraged model to maintain efficiency and manage costs as we grow our licensing business by, for example, offering incentives to early licensing targets or asserting our rights for use of our patents.\nIndex\nIndustry Overview & Trends\nWe believe that the rapid growth in remote work has accelerated digital business transformation initiatives that would have taken years, into a matter of months. The demand to work remotely, explosive growth of video conferencing tools and rapid growth in the cloud has created an opportunity to secure communications regardless of a user’s location, network, or BYOD (bring your own device).\nThe shift to remote work and expansion of the enterprise network perimeter has driven the growth of ZTNA solutions. The Zero Trust concept treats all networks like the Internet, where all users and devices are untrusted by default. Their location within the network is not a factor for deciding trust. Each user and device on the network require authentication and authorization, based on policy, prior to accessing any applications or resources on the network. ZTNA facilitates security around remote work, because Zero Trust policies enable granular access control, end-to-end encryption of network communications and remove application visibility from the public Internet reducing the attack surface. Based on our research and estimates, we believe that the Zero-Trust Security Market size is projected to grow from USD 15.6 billion in 2019 to USD 38.6 billion by 2024, at a Compound Annual Growth Rate (CAGR) of 19.9% from 2019 to 2024. We believe Zero Trust represents a growing market and an ideal fit for our technology and products.\nWith large portions of the global population now living under some form of lockdown, the global coronavirus pandemic has forced many organizations to shift their business processes - and their employees are having to embrace a work-from-home culture on a scale never attempted. Remote work has accelerated the adoption of video conferencing and meeting applications across all industries making it an essential tool to connect with remote customers, workforces, and employees to prevent direct contact. Based on our estimates, we believe that the worldwide Video Conferencing Market size is projected to grow from USD 14 billion in 2019 to USD 35 billion by 2026, at a CAGR of 16.5% from 2020 to 2026. This rapid adoption, learning curve and demand to continue working remotely has created significant security concerns and breaches for enterprises. Our market research has focused on security conscious verticals such as healthcare, banking, legal and government where security breaches can significantly impact outcomes. In many cases, these enterprises adopted industry standard video conferencing tools and are now looking at more secure alternative solutions. Enterprises want video conferencing solutions that protect their information and allow them greater security control and visibility, while continuing to be reliable, easy to use and cost effective. Enterprises in these verticals are also looking for video conferencing solutions that integrate into their existing workflows and better align with specific use cases instead of forcing them to adapt to more one size fits all solutions on the market. We believe our GABRIEL Collaboration Suite™ represents a starting point to offer secure video conferencing tools built on a zero-trust architecture.\nCloud computing growth has rapidly expanded as enterprises continue to move applications and services to the cloud. The cloud offers scalability, operations and development efficiency and remote access benefits for their workforce. Based on our estimates, we believe that the global cloud computing market size is expected to grow from approximately USD 293 billion in 2020 to over USD 810 billion by 2026, at a CAGR of 18.5% during the forecast period. The cloud technology adoption is expected to increase quite significantly in industries where the Work-From-Home (WFH) initiative is helping to sustain enterprise business functions. However, shifting critical data to the cloud has resulted in security concerns and the need for enterprises to control access and gain visibility into how information is being used, who is accessing it and where it is going. We believe our scalable technology allows enterprises to secure applications and services regardless of whether hosting is on-premise or in the cloud.\nAs billions of connected Internet of Things (IoT) devices come online in support of enterprise operations, products, and industrial controls they will need to be secured and integrated into the enterprise. Facilitated by advancements in 4G/Advanced LTE and high-speed 5G networks, IoT devices will be able to operate from any network, transmit higher volumes of data including video streaming and sensor data collection and require real-time decisions based on that data. Without next generation security, these IoT devices represent a large attack surface that manages and control critical enterprise infrastructure. These IoT devices can operate from anywhere, will need to be secured with the same level of network security and ZTNA solutions enterprises are already deploying for their remote workforce. We believe that the market opportunity for our software and technology solutions is large and expanding as secure domain names are now an integral part of securing the next generation 5G and 4G/LTE Advanced wireless networks and IoT communications in areas including Smart City, Connected Car and Connected Home. Based on our estimates, we believe that the size of global Industrial Internet of Things (IIoT) market is projected to grow from USD 83.6 billion in 2020 to approximately USD 254 billion by 2027 at a CAGR of 20.35% during this forecasted period with a growing investment in securing the infrastructure around these devices.\nIndex\nOur Approach & Strategy\nOur portfolio of intellectual property is the foundation of our business model. We currently own approximately 194 total patents and pending applications, including 70 U.S. patents/patent applications and 124 foreign patents/validations/pending applications. This portfolio now serves as the foundation of our products, services, and our licensing business. It is expected to generate the majority of our future revenue in license fees and royalties.\nOur strategy is to become the market leader in securing real-time communications over the Internet and to establish our GABRIEL Connection Technology™ as the industry standard security platform. Key elements of our strategy are to:\n• Actively recruit partners in various vertical markets, including healthcare, finance, legal, government to help us rapidly expand our enterprise customer base.\n• Continue to grow our technology licensing program to commercialize our intellectual property, including our GABRIEL Connection Technology™.\n• Promote our Gabriel Secure Communication Platform™ as a solution for delivering ZTNA.\n• Grow our GABRIEL Gateway product offering to secure enterprise applications, services, and infrastructure.\n• Grow registration of GABRIEL Secure Domains as the network segmentation component of our ZTNA solution. Establish VirnetX as the exclusive, universal registry of secure domain names and enable our customers to act as registrars for their users and broker secure communication between devices.\n• Promote Gabriel Collaboration Suite™ products in the general market for sale to end-user enterprises, directly and with partners, with targeted promotions and other marketing programs. Expand GABRIEL Collaboration Suite™ to include video conferencing to assist remote workers and offer an industry leading secure meeting solution.\nGABRIEL Secure Communication Platform™ delivers ZTNA allowing enterprises to secure their information, control access and gain visibility into how information is being used, who is accessing it and where it is going. Our patented technology allows enterprises to license our technology for integration into their products and services, easily deploy our technology through our GABRIEL Gateway product for endpoint security or securing their communications with our GABRIEL Collaboration Suite™ application.\nWe believe GABRIEL Gateway will support enterprises in securing their networks as their applications, services, virtualized resources, and data moves to the cloud. GABRIEL Gateway secures applications, services and infrastructure using ZTNA. Enterprises can quickly deploy GABRIEL Gateway to protect legacy applications, secure new cloud-based services and remove application visibility from the public Internet. Enterprises can move towards more granular network access control to protect their network at the edge and away from legacy VPN technologies. GABRIEL Gateway enables remote employees to securely communication with on-premise and cloud-based applications, regardless of their location. GABRIEL Gateway is included with the GABRIEL Collaboration Suite™ and offered as a separate licensing program for enterprises that need a Gateway only solution. Enterprises can also use GABRIEL Gateway to secure open-source applications powering communications, data and analytics, infrastructure, and business services with a focus on making those applications easier to secure, access and manage.\nGABRIEL Secure Domains provide two fundamental capabilities for enterprises to manage device security and access control.\n• Unique, certificate-based device identities, tied to a user, that are used to authenticate and authorize device access (e.g., GABRIEL Connection Technology™), based on a set of policies.\n• Flexible, software-based network segmentation that enterprises can deploy on-demand, without requiring additional hardware infrastructure.\nEnterprise customers understand the complexity of device certificate management at scale, the operational costs and security ramifications, if not done properly. GABRIEL Secure Domains enable certificate-based identities and when used within the GABRIEL Secure Communication Platform™, provides a cloud-based service that automates the process of issuing, renewing, and revoking device certificates across the enterprise at scale. With GABRIEL Secure Domains, enterprises have a solution for managing device security and access control driven by the rapid growth of IoT and remote work.\nEach GABRIEL Secure Domain creates a network microsegment or secure enclave that includes a set of resources (e.g., applications, services, or data) and a set of users and devices an enterprise can assign to access those resources. Used within the GABRIEL Secure Communication Platform™, enterprises can scale and adapt their network architecture, on-demand, based on business and workforce needs. Enterprises see the power of GABRIEL Secure Domains as a way to flexibility segment their networks, enforce access policies, audit compliance, isolate and limit lateral network movement, secure and limit access for remote workers and gain access control and visibility into their network.\nIndex\nWe believe GABRIEL Collaboration Suite™ provides the foundation for real-time, secure communications and collaboration applications for the enterprise remote workforce. We bundle multiple applications together within the GABRIEL Collaboration Suite™, including Secure Chat, Secure Share, Secure Video/Voice, Secure Mail, Secure Backup/Sync and GABRIEL Gateway. We are exploring unbundling the applications within GABRIEL Collaboration Suite™ and offering à la carte product options. This approach allows us to offer more flexible licensing options to solve specific customer use-cases, align with partner product offerings and create upsell opportunities.\nCompetitive Strengths\nWe believe the following competitive strengths will enable our success in the marketplace:\n• Unique patented technology. We are focused on developing innovative technology for securing real-time communications over the Internet and establishing the exclusive secure domain name registry in the United States and other key markets around the world. Our unique solutions combine industry standard encryption methods and communication protocols with our patented techniques for automated DNS lookup mechanisms. Our technology and patented approach enable users to create a secure communication link by generating secure domain names. We currently own approximately 194 total patents and pending applications, including 70 U.S. patents/patent applications and 124 foreign patents/validations/pending applications. Our portfolio includes patents and pending patent applications in the United States and other key markets that support our secure domain name registry service for the Internet.\n• Scalable licensing business model. We are actively engaged in pursuing additional licensing agreements with OEMs, service providers and system integrators within the IP-telephony, mobility, mobile-to-mobile communications, fixed-mobile convergence, and unified communications end-markets.\n• Highly experienced research and development team. Our research and development team is comprised of nationally recognized network security and encryption technology scientists and experts that have worked together as a team for over ten years. During their careers, this team has developed several cutting-edge technologies for U.S. national defense, intelligence, and civilian agencies, many of which remain critical to our national security today. Prior to joining VirnetX, our team worked for Leidos, during which time they invented the technology that is the foundation of our technology, and software. Based on the collective knowledge and experience of our development team, we believe that we have one of the most experienced and sophisticated groups of security experts researching vulnerability and threats to real-time communication over the Internet and developing solutions to mitigate these problems.\nLicense and Service Offerings\nWe offer a diversified portfolio of license and service offerings focused on securing real-time communications over the Internet, including:\n• VirnetX technology licensing. Customers who want to develop their own implementation of the VirnetX code module for supporting secure domain names, or who want to use their own techniques that are covered by our patent portfolio for establishing secure communication links, could purchase a technology license. We anticipate that these licenses would typically include an initial license fee, as well as an ongoing royalty. We expect that these licenses will include a one-time delivery of GABRIEL software development kit including object libraries, sample code, testing and quality assurance tools and the supporting documentation necessary for a customer to implement of the techniques we have developed.\n• GABRIEL Connection Technology™ Software Development Kit or SDK. OEM customers who want to adopt the GABRIEL Connection Technology™ as their solution for establishing secure connections using secure domain names within their products could purchase an SDK license. The software development kit consists of object libraries, sample code, testing and quality assurance tools and the supporting documentation necessary for a customer to implement our technology. These tools are comprised of software for a secure domain name connection test server, a relay test server, and a registration test server. We expect that customers would pay an up-front license fee to purchase an SDK license and a royalty fee for every product shipped with the embedded VirnetX code module.\n• Secure domain name registrar service. Customers, including service providers, telecommunication companies, ISPs, system integrators and OEMs could purchase a license to our secure domain name registrar service. We would provide the software suite and technology support to enable such customers to provision devices with secure domain names and facilitate secure connections between registered devices. This suite includes the following server software modules:\nIndex\n• Registrar server software. We anticipate that our registrar server software would enable customers to operate as a secure domain name registrar that provisions devices with secure domain names. The registrar server software is designed to provide an interface for our customers to register new virtual private domains and sub-domain names. This server module must be enrolled with the VirnetX secure domain name master registry to obtain its credentials before functioning as an authorized registrar.\n• Connection server software. We anticipate that our connection server software would allow customers to provide connection services to enrolled devices. The connection services include registration of presence information for authenticated users and devices, presence information query request services, enforcement of policies and support for communication with peers behind firewalls.\n• Relay server software. We anticipate that our relay server software would allow customers to dynamically maintain connections and relay data to private IP addresses for network devices that reside behind firewalls.\n• Secure domain name master registry and connection service. As part of enabling the secure domain name registrar service, we expect that we will maintain and manage the secure domain name master registry. This service is expected to enroll all secure domain name registrar customers and generate the credentials required to function as an authorized registrar. It also is expected to provide connection services and universal name resolution, presence information and secure connections between authorized devices with secure domain names. Secure domain name registrar service customers will enter into a technology licensing and revenue sharing agreement with VirnetX whereby we will typically receive an up-front licensing fee for the secure domain name registrar technology, as well as ongoing annual royalties for each secure domain name issued by the customer.\n• Technical support services. We intend to provide high-quality technical support services to licensees and customers for the rapid customization and deployment of GABRIEL Connection Technology™ in an individual customer’s products and services.\nCustomers\nOur GABRIEL Collaboration Suite™ is available for download and free trial, for Android, iOS, Windows, Linux, and Mac OS X platforms, at http://www.gabrielsecure.com/. We continue to enhance our products and add new functionality to our products. We will provide updates to new and existing customers as they are released publicly. Over 80 small and medium businesses have installed our GABRIEL Secure Communication Platform™ and GABRIEL Collaboration Suite™ products in their corporate networks. We continue to rapidly expand our customer base with targeted promotions and direct sales initiatives.\nWe have signed Patent License Agreements with Aastra USA, Inc. Avaya, Inc., Microsoft Corporation, Mitel Networks Corporation, NEC Corporation and NEC Corporation of America, Siemens Enterprise Communications GmbH & Co. KG, and Siemens Enterprise Communications Inc. to license certain of our patents, for a one-time payment and an ongoing royalty for all future sales through the expiration of the licensed patents with respect to certain current and future IP-encrypted products.\nWe are seeking further licensing of our technology, including our GABRIEL Connection Technology™ to developers and original equipment manufacturers, or OEMs, of chips, servers, smart phones, tablets, e-Readers, laptops, net books, and other devices, within the IP-telephony, mobility, fixed-mobile convergence, and unified communications markets including 4G/LTE. We have published our royalty rates and guidelines on our website. All forward moving licenses have adhered to these guidelines and have met or exceeded these rates and we will use these rates and guidelines in all future license negotiations.\nMarketing and Sales\nWe employ a leveraged, partner-oriented, marketing strategy for our technology licenses and software product offerings. We successfully signed a number of Resellers & Managed Service Provider in various market segments, including, healthcare, finance, legal, government, etc., to assist us in selling our software products to their customers. A list of our partners can be found on our website at https://virnetx.com/partners. We plan to continue working on a number of sales and marketing promotions, in the U.S. and Japan, to recruit more resellers and partners along with direct sales programs as we seek to extend out our customer base internationally.\nIndex\nWe plan to directly market our Gabriel Secure Communication Platform™ and Gabriel Collaboration Suite™ products, domain name registry services to our service provider and system integrator customers. We market our Gabriel line of products directly to small and medium businesses using online marketing programs and tools.\nWe expect to leverage our relationship with Leidos, to extend our offering to departments and agencies within the federal government. Leidos is a FORTUNE 500® scientific, engineering and technology applications company that uses its deep domain knowledge to solve problems of vital importance to the nation and the world, in national security, energy and the environment, critical infrastructure, and health. We intend to leverage our sales team for managing current accounts and pursuing sales opportunities with new customers.\nIn January 2021, we added a Chief Operating Officer (COO) to our Japanese team to further our technology licensing efforts in Japan. We have signed a non-exclusive Distribution and Service Agreement with IP Dream, a Japanese based strategic technology developer and service provider, to sell VirnetX’s Gabriel Collaboration Suite as well as VirnetX’s Secure Domain Name technology to its clients in Japan and greater Asia. Jointly with IP Dream, we are currently pursuing a number of OEM opportunities with some of the largest services providers in Japan. Along with our efforts with IP dream, we continue to explore alternative strategies to pursue opportunities to work with other third parties in Japan, and elsewhere, using an approach that will seek to capitalize on these opportunities in part by placing more emphasis on the use of our own employees.\nOur GABRIEL Collaboration Suite™ is available for download and free trial, for Android, iOS, Windows, Linux, and Mac OS X platforms, at https://virnetx.com. We continue to enhance our products and add new functionality to our products. We will provide updates to new and existing customers as they are released publicly. We continue to rapidly expand our customer base with targeted promotions and direct sales initiatives.\nWe intend to continue to license our patent portfolio, technology, and software, including our secure domain name registry service, to domain infrastructure providers, communication service providers as well as to system integrators. We intend to seek further license of our technology, including our GABRIEL Connection Technology™ to enterprise customers, developers and original equipment manufacturers, or OEMs, of chips, servers, smart phones, tablets, e-Readers, laptops, net books, and other devices, within the IP-telephony, mobility, fixed-mobile convergence, and unified communications markets including 5G and 4G/LTE. We have published our royalty rates and guidelines on our website at https://virnetx.com/licensing. All forward moving licenses have adhered to these guidelines and have met or exceeded these rates and we will use these rates and guidelines in all future license negotiations.\nIndex\nIntellectual Property and Patent Rights\nOur intellectual property is primarily comprised of trade secrets, patented know-how, issued and pending patents, copyrights and technological innovation.\nWe currently own approximately 194 total patents and pending applications, including 70 U.S. patents/patent applications and 124 foreign patents/validations/pending applications. Our portfolio includes a number of patents that describe unique systems and methods for securing real-time communications over the Internet, as well as related services such as the establishment and maintenance of a secure domain name registry. Our software and technology solutions also may have additional applications relating to operating systems and network security. A complete list of our U.S. patents is available on our website located at www.virnetx.com. Each patent is publicly accessible on the Internet website of the U.S. Patent and Trademark Office at www.uspto.gov. The term of each of our issued U.S. and foreign patents will expire during the period from 2020 to 2024.\nNotwithstanding anything to the contrary set forth in any of our filings under the Securities Act of 1933 or the Securities Exchange Act of 1934 that might incorporate future filings, the information set forth on the United States Patent and Trademark Office, or the USPTO Website, shall not be deemed to be a part of or incorporated by reference into any such filings. The Company does not warrant the accuracy, or completeness or adequacy of the USPTO Website, and expressly disclaims liability for errors or omissions on such website.\nAssignment of Patents\nSome of our issued patents and pending patent applications were acquired by our principal operating subsidiary, VirnetX, Inc., from Leidos, pursuant to an Assignment Agreement dated December 21, 2006, and a Patent License and Assignment Agreement dated August 12, 2005, as amended on November 2, 2006, including documents prepared pursuant to the November amendment, and as further amended on March 12, 2008. We recorded the assignment from Leidos, with the U.S. Patent Office on December 21, 2006.\nKey terms of these agreements are as follows:\n• Patent Assignment. Leidos, unconditionally and irrevocably conveyed, transferred, assigned, and quitclaimed all its right, title, and interest in and to the patents and patent applications, as specifically set forth on Exhibit A to the assignment document recorded with the U.S. Patent Office, including, without limitation, the right to sue for past infringement.\n• License to Leidos, Outside the Field of Use. Effective March 12, 2008, we granted to Leidos, a non-exclusive, royalty free, fully paid, perpetual, worldwide, irrevocable, sub licensable and transferable right and license permitting Leidos, and its assignees to make, have made, import, use, offer for sale, and sell products and services covered by, and to make improvements to, the patents and patent applications we acquired from Leidos, solely outside our field of use.\n• Compensation Obligations. As consideration for the assignment of the patents and for the rights we obtained from Leidos, as amended, we are required to make payments to Leidos, based on cash or certain other values generated from those patents. The amount of such payments depends upon the type of value generated, and certain categories are subject to maximums and other limitations. In 2010, we met our maximum royalty payment requirement; however, Leidos is also entitled under certain circumstances to receive a portion of the proceeds paid to us for certain acquisitions of VirnetX and the settlement of certain patent infringement claims of ours.\nGovernment Regulation\nThe laws governing online secure communications remain largely unsettled, even in areas where there has been legislative action. It may take years to determine whether and how existing laws governing intellectual property, privacy, data protection and libel apply to online communications and media. Such legislation may interfere with the growth in use of online secure communications and decrease the acceptance of online secure communications as a viable solution, which could adversely affect our business.\nDue to the Internet’s popularity and increasing use, new laws regulating secure communications may be adopted. These laws and regulations may cover, among other things, issues relating to privacy, data protection, pricing, taxation, telecommunications over the Internet, content, copyrights, distribution and quality of products and services. We intend to comply with all new laws and regulations as they are adopted.\nThe U.S. government has controlled the authoritative domain name system, or DNS, root server since the inception of the Internet. On July 1, 1997, the President of the United States directed the U.S. Secretary of Commerce to privatize the management of the domain name system in a manner that increases competition and facilitates international participation in its management.\nIndex\nOn September 29, 2006, the U.S. Department of Commerce extended its delegation of authority by entering into a new agreement with the Internet Corporation for Assigned Names and Numbers, or ICANN, a California non-profit corporation headquartered in Marina Del Rey, California. ICANN is responsible for managing the accreditation of registry providers and registrars that manage the assignment of top-level domain names associated with the authoritative DNS root directory. Although it is possible to create and manage other DNS root directories privately without accreditation from ICANN, the possibility of conflicting name and number assignments makes it less likely that users would widely adopt a top-level domain name associated with an alternative DNS root directory provided by a non-ICANN-accredited registry service.\nEmployees\nOn December 31, 2020, the Company had 21 full and part time employees, most of whom work remotely from our corporate offices. The Company has had an at-home work force since its inception. The emphasis of our employees is on our technology research and product development with 11 employees focused on this effort. The team has been working on enhancing our products and adding new functionality along with successfully filing several new patent applications in 2021. We also continue building our sales and marketing teams to expand our product-lines and customer base. In 2021 we added a Chief Operating Officer for our subsidiary in Japan who will be focused on growing our market and products in that region.\nIn addition to our regular employees, we also engage with important consultants on a regular basis. These consultants can be involved in our product development, customer relations, legal, and/or regulatory compliance and reporting. The Company has experienced low employee turnover rates over the years with both employees and some consultants participating in our incentive stock option/RSU plans.\nAvailable Information\nWe file or furnish various reports, such as registration statements, periodic and current reports, proxy statements and other materials with the SEC. Our Internet website address is www.virnetx.com. You may obtain, free of charge on our Internet website, copies of our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act, as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. The information we post is intended for reference purposes only; none of the information posted on our website is part of this report or incorporated by reference herein.\nThe SEC also maintains an Internet site that contains reports, proxy and other information statements, and other information regarding issuers, including us, that file electronically with the SEC. The Internet address of the SEC’s Internet site is http://www.sec.gov.",
    "item_1A": "Item 1A. Risk Factors\nOur operations and financial results are subject to various risks and uncertainties, including those described below, which could adversely affect our business, financial condition, results of operations, cash flows, and the trading price of our common and capital stock. You should carefully consider the risks and uncertainties described below in addition to the other information set forth in this Annual Report on Form 10-K, including the section titled “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and our consolidated financial statements and related notes, before making any investment in our common stock. The risks and uncertainties described below are not the only ones we face. Additional risks and uncertainties not presently known to us or that we currently believe to be immaterial may also adversely affect our business. If any of these risk factors occur, you could lose substantial value or your entire investment in our shares.\nRisks Related to Our Business and Our Financial Reporting\nWe are involved and will continue to be involved in litigation defending our patent portfolio, which can be time-consuming and costly, and we cannot anticipate the results.\nWe spend a significant amount of our financial and management resources to pursue our current litigation. We believe that this litigation and others that we may pursue in the future could continue for years and consume significant financial and management resources. The counterparties to our litigation include large, well-financed companies with substantially greater resources than us. Patent litigation is risky, and the outcome is uncertain, and we cannot assure you that any of our current or future litigation matters will result in a favorable outcome for us. In addition, even if we obtain favorable interim rulings or verdicts, they may be inconsistent with the ultimate resolution of the dispute. Also, we cannot assure you that we will not be exposed to claims or sanctions against us which may be costly or impossible for us to defend. Unfavorable or adverse outcomes may result in losses, exhaustion of financial resources or other adverse effects, which could encumber our ability to develop and commercialize our products.\nIndex\nWe may not be able to capitalize on market opportunities related to our licensing strategy or our patent portfolio.\nOur business strategy includes licensing our patents and technology to other companies in order to reach a larger end-user base than we could reach through direct sales and marketing efforts; as such, our business strategy and revenues may depend on intellectual property licensing fees and royalties for the majority of our revenues. We currently derive minimal revenue from licensing activities, and royalties, and we cannot assure you that we will successfully capitalize on our market opportunities or that our current business strategy will succeed.\nAlthough to date we have entered into a limited number of settlement and license agreements, we may not be successful in entering into further licensing relationships, or if we are successful in entering into such relationships, the acquisition of them may be expensive, and they, as well as our existing settlement and our existing and pending license agreements may not generate the financial results, we expect.\nFactors that may affect our ability to execute our current business strategy include, but are not limited to, the following:\n• Third parties may challenge the validity of our patents;\n• The pendency of our various litigations may cause potential licensees not to do business with us;\n• Our patents may expire before we can make our business strategy successful;\n• We face, and we expect to continue to face, intense competition from new and established competitors who may have superior products and services or better marketing, financial or other capacities than we do; and\n• It is possible that one or more of our potential customers or licensees develops or otherwise sources products or technologies similar to, competitive with or superior to ours.\nIf we are not able to adequately protect our patent rights, our business would be negatively impacted.\nWe believe our patents are valid, enforceable, and valuable. Notwithstanding this belief, third parties may make claims of infringement or invalidity claims with respect to our patents and such claims could give rise to material cost for defense or settlement or both, jeopardize or substantially delay a successful outcome of litigation we are or may become involved in, divert resources away from our other activities, limit or cease our revenues related to such patents, or otherwise materially and adversely affect our business. Similar challenges could also prevent us from obtaining additional patents in the future. Additionally, several of our patents are currently, and other patents may in the future be, subject to United States Patent and Trademark Office (“USPTO”) post-grant inter partes review proceedings (“IPR”) which may result in all or part of these patents being invalidated, or the claims of our patents being limited. Unfavorable or adverse outcomes in our litigation or IPRs may result in losses, exhaustion of financial resources, reduction in our ability to enforce our intellectual property rights, or other adverse effects, which could encumber our ability to develop and commercialize our products. Even if we are successful in enforcing our intellectual property rights, our patents may not ultimately provide us with any competitive advantages and may be less valuable than we currently expect. These risks may be heightened in countries other than the United States where laws regarding patent protection are less developed, and may be negatively affected by the fact that legal standards in the United States and elsewhere for protection of intellectual property rights in Internet-related businesses are uncertain and still evolving. In addition, there are a significant number of United States and foreign patents and patent applications in our areas of interest, and we expect that significant litigation in these areas will continue and will add uncertainty to the value of certain patents and other intellectual property rights in our areas of interest. If we are unable to protect our intellectual property rights or otherwise realize value from them, our business would be negatively affected.\nIndex\nWe can provide no assurances that the licensing of our essential security patents under FRAND will be successful.\nAt the request of the European Telecommunications Standards Institute (“ETSI”), and the Alliance for Telecommunications Industry Solutions (“ATIS”), we agreed to update our licensing declaration to ETSI and ATIS under their respective Intellectual Property Rights policies. This was in response to our Statement of Patent Holder identifying a group of our patents and patent applications that we believe are or may become essential to certain developing specifications in the 3rd Generation Partnership Project Long Term Evolution (“LTE”), Systems Architecture Evolution project. We will make available a non-exclusive patent license under FRAND (fair, reasonable and non-discriminatory terms, and conditions, with compensation) for the patents identified by us that are or become essential to applicants desiring to implement the Technical Specifications identified by us, as set forth in the updated licensing declaration under the ATIS and ETSI Intellectual Property Rights policies. Our licensing declarations under the ATIS and ETSI Intellectual Property Rights policies may limit our flexibility in determining royalties and license terms for certain of our patents. Consequently, we cannot assure you that the licensing of the essential security patents will be successful or that third parties will be willing to enter into licenses with us on reasonable terms or at all, which could have an adverse effect on our business and harm our competitive position.\nBecause our business is conducted or expected to be conducted in an environment that is subject to rapid change, we may be subject to various developments in regulation, law, and consumer preferences to which we may not be able to adapt successfully.\nThe current regulatory environment for our products and services remains unclear. We can give no assurance that our planned product offerings will be in compliance with laws and regulations of local, state, United States federal or foreign authorities. Further, we can give no assurance that we will not unintentionally violate such laws or regulations or that such laws or regulations will not be modified, or that new laws or regulations will be enacted in the future which would cause us to be in violation of such laws or regulations. For example, Voice-Over-Internet Protocol (“VoIP”) services are not currently subject to all the same regulations that apply to traditional telephony, but it is possible that similar regulations may be applied to VoIP in the future and that these could result in substantial costs to us which could adversely affect the marketability of our products and planned products related to VoIP. For further example, the use of the Internet and private Internet Protocol (“IP”) networks for communication is largely unregulated within the United States, but may become regulated in the future; additionally, several foreign governments have enacted measures that could restrict or prohibit voice communications services over the Internet or private IP networks.\nOur business depends on the growth of instant messaging, VoIP, mobile services, streaming video, file transfer and remote desktop and other next-generation Internet-based applications. A decline in the use of these applications due to complexity or cost relative to alternate traditional or newly developed communications channels, or development of alternative technologies, could cause a material decline in the number of users in these areas.\nMore aggressive domestic or international regulation of the Internet in general, and Internet telephony providers and services specifically may materially and adversely affect our business, financial condition, operating results, and future prospects.\nOur exposure to outside influences beyond our control, including new legislation, court rulings or actions by the United States Patent and Trademark Office, could adversely affect our licensing and enforcement activities and results of operations.\nOur licensing and enforcement activities are subject to numerous risks from outside influences, including the following:\n• New legislation, regulations or rules related to obtaining patents or enforcing patents could significantly increase our operating costs and decrease our revenue. For instance, the United States Supreme Court has modified some tests used by the USPTO in granting patents during the past 20 years which may decrease the likelihood that we will be able to obtain patents and increase the likelihood of challenge of any patents we obtain or license. In addition, in 2012 the United States enacted sweeping changes to the United States patent system under the Leahy-Smith America Invents Act, including changes that transition the United States from a “first-to-invent” system to a “first to file” system and alter the processes for challenging issued patents;\n• More patent applications are filed each year resulting in longer delays in getting patents issued by the USPTO;\nIndex\n• Federal courts are becoming more crowded, and as a result, patent enforcement litigation is taking longer; and\n• As patent enforcement becomes more prevalent, it may become more difficult for us to voluntarily license our patents.\nNew legislation, regulations or court rulings related to enforcing patents could harm our business and operating results.\nIntellectual property is the subject of intense scrutiny by the courts, legislatures, and executive branches of governments around the world. Various patent offices, governments or intergovernmental bodies may implement new legislation, regulations or rulings that impact the patent enforcement process, or the rights of patent holders and such changes could negatively affect licensing efforts and/or litigations. For example, limitations on the ability to bring patent enforcement claims, limitations on potential liability for patent infringement, lower evidentiary standards for invalidating patents, increases in the cost to resolve patent disputes and other similar developments could negatively affect our ability to assert our patent or other intellectual property rights.\nIt is impossible to determine the extent of the impact of any new laws, regulations or initiatives that may be proposed, or whether any of the proposals will become enacted as laws. Compliance with any new or existing laws or regulations could be difficult and expensive, affect the manner in which we conduct our business and negatively impact our business, prospects, financial condition, and results of operations. We may need to raise additional capital to support our business growth, and this capital will be dilutive, may cause our stock price to drop or may not be available on acceptable terms, if at all.\nWe may need to raise additional capital, which may not be available to us when needed or may not be available on terms acceptable to us, to support our business growth or to respond to business opportunities, challenges, or unforeseen circumstances, including sales under our ATM or our universal shelf registration statement. Our ability to obtain additional capital, if and when required, will depend on our business plans, investor demand, our operating performance, the condition of the capital markets, the terms of our current contractual obligations and other factors. If we raise additional funds through the issuance of equity, equity-linked or debt securities, including those under our ATM or our Universal Shelf Registration Statement, those securities may have rights, preferences, or privileges senior to the rights of our common stock, and our existing stockholders may experience dilution. Additionally, we are unable to predict the future success of our ATM or any other offering. Sales of a substantial number of shares of our common stock in the public market, or the perception that these sales or other financings might occur, could depress the market price of our common stock, and could also impair our ability to raise capital through the sale of additional equity securities. If we issue debt securities or incur indebtedness, we could experience increased future payment obligations and a need to comply with restrictive covenants, such as limitations on our ability to incur additional debt, limitations on our ability to acquire, sell or license intellectual property rights and other operating restrictions that could adversely impact our ability to conduct our business. If we are unable to obtain additional capital or are unable to obtain additional capital on satisfactory terms, our ability to continue to support our business growth or to respond to business opportunities, challenges, or other circumstances could be adversely affected, and our business may be harmed.\nIf we experience security breaches, we could be exposed to liability and our reputation and business could suffer.\nWe expect to retain certain confidential and proprietary customer information in our secure data centers and secure domain name registry, as well as personal data and other confidential and proprietary information relating to our business. It will be critical to our business strategy that our facilities and infrastructure remain secure and are perceived by the marketplace to be secure. Our secure domain name registry operations will also depend on our ability to maintain our computer and telecommunications equipment in effective working order and to reasonably protect our systems against interruption, and potentially depend on protection by other registrars in the shared registration system. The secure domain name servers that we will operate will be critical hardware to our registry services operations. Therefore, we expect to have to expend significant time and money to maintain or increase the security of our products, facilities, and infrastructure. Security technologies are constantly being tested by computer professionals, academics and “hackers.” Advances in computer capabilities and the techniques for attacking security solutions, new discoveries in the field of cryptography or other events or developments could result in compromises or breaches of our security measures and could make some or all our products obsolete or unmarketable. Likewise, if any of our products are found to have significant security vulnerabilities, then we may need to dedicate engineering and other resources to eliminate the vulnerabilities and to repair or replace products already sold or licensed to our customers. Despite the security measures that we and our service providers utilize, our infrastructure and that of our service providers may be vulnerable to physical break-ins, computer viruses, attacks by hackers, phishing attacks, social engineering, or similar disruptive problems. It is possible that we may have to expend additional financial and other resources to address such problems. The COVID-19 pandemic is increasing vulnerability to cyber-attacks, as more individuals and companies work online, which increases these risks. As a provider of Internet security software and technology, we may be the target of dedicated efforts by hackers and other third parties to overcome or defeat our security measures. Any physical or electronic break-in or other security breach or compromise of the information stored at our secure data centers and domain name registration systems, including any compromise due to human error or employee or contractor malfeasance, may jeopardize the security of information stored on our premises or in the computer systems and networks of our customers. In such an event, we could face significant liability and current or potential customers could be reluctant to use our services. Additionally, any such data security incident, or the perception that one has occurred could also result in adverse publicity, harm to our reputation and competitive position, and therefore adversely affect the market’s perception of the security of electronic commerce and communications over IP networks as well as the security or reliability of our services.\nIndex\nA security breach or other security incident could require a substantial level of financial resources to rectify and otherwise respond to, may be difficult to identify or address in a timely manner, and could result in claims, investigations, and inquires by private parties or governmental entities that may divert management’s attention and require the expenditure of significant time and resources, and which may cause us to incur substantial fines, penalties, or other liability and related legal and other costs. Any actual or perceived security breach or other security incident may also harm our reputation and make it more difficult or impossible for us to successfully market to others. Any of the foregoing matters could harm our operating results and financial condition.\nPrivacy and data security concerns, and data collection and transfer restrictions and related domestic or foreign regulations may limit the use and adoption of our solutions and adversely affect our business.\nPersonal privacy, information security, and data protection are significant issues in the United States, Europe, and many other jurisdictions where we have operations or offer our products. The regulatory framework governing the collection, processing, storage and use of confidential and proprietary business information and personal data is rapidly evolving. The United States federal and various state and foreign governments have adopted or proposed requirements regarding the collection, distribution, use, security and storage of personally identifiable information and other data relating to individuals, and federal and state consumer protection laws are being applied to enforce regulations related to the online collection, use and dissemination of data.\nFurther, many foreign countries and governmental bodies, including the European Union (“EU”), where we conduct business, have laws and regulations concerning the collection and use of personal data obtained from their residents or by businesses operating within their jurisdiction. These laws and regulations often are more restrictive than those in the United States. Laws and regulations in these jurisdictions apply broadly to the collection, use, storage, disclosure, and security of data that identifies or may be used to identify or locate an individual, such as names, email addresses and, in some jurisdictions, IP addresses.\nWe also expect that there will continue to be new proposed laws, regulations and industry standards concerning privacy, data protection and information security in the United States, the EU, and other jurisdictions. For example, the European Commission adopted a General Data Protection Regulation (the “GDPR”) that became fully effective on May 25, 2018, superseding prior EU data protection legislation, imposing more stringent EU data protection requirements, and providing for greater penalties for noncompliance. The United Kingdom enacted a Data Protection Act that substantially implements the GDPR. We are evaluating obligations imposed on us by the GDPR and we may be required to incur substantial expense in order to make significant changes to our product and business operations in connection with obtaining and maintaining compliance with the GDPR and similar legislation, such as the UK Data Protection Act, all of which may adversely affect our revenue and product sales. Additionally, California recently enacted legislation, the California Consumer Privacy Act (the “CCPA”) that, among other things, requires covered companies to provide new disclosures to California consumers, and afford such consumers new abilities to opt-out of certain sales of personal information. We cannot fully predict the impact of the CCPA on our business or operations, but it may require us to modify our data processing practices and policies and to incur substantial costs and expenses in an effort to comply. Additionally, a new privacy law, the California Privacy Rights Act (“CPRA”), recently was certified by the California Secretary of State to appear on the ballot for the November 3, 2020 election. If this initiative is approved by California voters, the CPRA would significantly modify the CCPA, potentially resulting in further uncertainty and requiring us to incur additional costs. More generally, we cannot yet fully determine the impact these or future laws, regulations and standards may have on our business. Privacy, data protection and information security laws and regulations are often subject to differing interpretations, may be inconsistent among jurisdictions, and may be alleged to be inconsistent with our current or future practices. Additionally, we may be bound by contractual requirements applicable to our collection, use, processing, and disclosure of various types of data, including personal data, and may be bound by, or voluntarily comply with, self-regulatory or other industry standards relating to these matters. These and other requirements could reduce demand for our products, increase our costs, impair our ability to grow our business, or restrict our ability to store and process data or, in some cases, impact our ability to offer our service in some locations and may subject us to liability. Any failure or perceived failure to comply with applicable laws, regulations, industry standards, and contractual obligations may adversely affect our business. Further, in view of new or modified federal, state, or foreign laws and regulations, industry standards, contractual obligations and other legal obligations, or any changes in their interpretation, we may find it necessary or desirable to fundamentally change our business activities and practices or to expend significant resources to modify our product and otherwise adapt to these changes. We may be unable to make such changes and modifications in a commercially reasonable manner or at all, and our ability to develop new products and features could be limited.\nIndex\nThe costs of compliance with and other burdens imposed by laws, regulations and standards may limit the use and adoption of our service and reduce overall demand for it, or lead to significant fines, penalties, or liabilities for any noncompliance. Privacy, information security, and data protection concerns, whether valid or not valid, may inhibit market adoption of our platform, particularly in certain industries and foreign countries.\nWe expect that we will experience long and unpredictable sales cycles, which may impact our operating results.\nThe sales cycle between initial customer contact and execution of a contract or license agreement with a customer or purchaser of our products can vary widely. We expect that our sales cycles will be long and unpredictable due to several factors, including but not limited to:\n• The need to educate potential customers about our patent rights and our product and service capabilities;\n• The impact of the COVID-19 pandemic on our potential customers and their business operations, including their budgetary constraints and resources devoted to adopting new products.\n• Our customers’ willingness to invest potentially substantial resources and modify their network infrastructures to take advantage of our products;\n• Our customers’ budgetary constraints;\n• The timing of our customers’ budget cycles;\n• Delays caused by customers’ internal review processes; and\n• Long sales cycles that may increase the risk that our financial resources are exhausted before we are able to generate significant revenue.\nIn addition, potential customers of our products include local, state, federal and foreign government authorities. Sales to government authorities can be extended and unpredictable. Government authorities generally have complex budgeting, purchasing, and regulatory processes that govern their capital spending, and their spending is likely to be adversely impacted by economic conditions, including impacts from the COVID-19 pandemic. In addition, in many instances, sales to government authorities may require field trials and may be delayed by the time it takes for government officials to evaluate multiple competing bids, negotiate terms, and award contracts.\nFor these reasons, the sales cycle associated with our products is subject to a number of significant risks that are beyond our control. Consequently, if our forecasted customer orders are not realized or delayed, our revenues and results of operations could be materially and adversely affected.\nIf we are unable to expand our revenue sources or establish, sustain, grow, or replace relationships with a diversified customer base, our revenues may be limited.\nWe currently generate revenue from a limited number of customers that have entered settlement and license agreements. Our GABRIEL Collaboration Suite™ is currently generating limited revenue, and it will take time for us to grow our installed user base and generate new customers. Additionally, there is no guarantee that we will be able to derive revenue from new customers, sustain or increase revenue from existing customers or replace customers from whom we currently generate revenue. As a result, our revenue may be limited or static.\nIndex\nWe have limited technical resources and are at an early stage in commercialization of our GABRIEL products.\nPart of our business includes the internal development of commercial products we seek to monetize. This aspect of our business may require significant capital, time and resources and we cannot guarantee that it will be successful or meet our expectations. As such, we have a small technical team, which may limit our ability to rapidly adapt our product to customer requirements or add new product features to maintain our competitive edge and drive adoption. Based on the scale of our technical resources, our limited historical financial data upon which to base our projected revenue or planned operating expenses related to our GABRIEL Collaboration Suite™, we may not be able to effectively:\n• Generate revenues or profit from product sales;\n• Drive adoption of our products;\n• Attract and retain customers for our products;\n• Provide appropriate levels of customer training and support for our products;\n• Implement an effective marketing strategy to promote awareness of our products;\n• Focus our research and development efforts in areas that generate returns on our efforts;\n• Anticipate and adapt to changes in our market; or\n• Protect our products from any system failures or other breaches.\nIn addition, a high percentage of our expenses are and will continue to be fixed. Accordingly, if we do not generate revenue as and when anticipated, our losses may be greater than expected and our operating results will suffer.\nOur products are highly technical and may contain undetected errors, which could cause harm to our reputation and adversely affect our business.\nOur products are highly technical and complex and, when deployed, may contain errors or defects. Despite testing, some errors in our products may only be discovered after a product has been installed and used by customers. Any errors or defects discovered in our products after commercial release could result in failure to achieve market acceptance, loss of revenue or delay in revenue recognition, loss of customers and increased service and warranty cost, any of which could adversely affect our business, operating results, and financial condition. In addition, we could face claims for product liability, tort, or breach of warranty, including claims relating to changes to our products made by our channel partners. The performance of our products could have unforeseen or unknown adverse effects on the networks over which they are delivered as well as on third-party applications and services that utilize our services, which could result in legal claims against us, harming our business. Furthermore, we expect to provide implementation, consulting, and other technical services in connection with the implementation and ongoing maintenance of our products, which typically involves working with sophisticated software, computing and communications systems. We expect that our contracts with customers will contain provisions relating to warranty disclaimers and liability limitations, which may not be upheld. Defending a lawsuit, regardless of its merit, is costly and may divert management’s attention and adversely affect the market’s perception of us and our products. In addition, if our business liability insurance coverage proves inadequate or future coverage is unavailable on acceptable terms or at all, our business, operating results, and financial condition could be adversely impacted.\nMalfunctions of third-party communications infrastructure, hardware and software expose us to a variety of risks that we cannot control.\nOur business will depend upon, among other things, the capacity, reliability, security, and unimpeded access of the infrastructure owned by third parties that we will use to deploy our offerings. We have no control over the operation, quality, or maintenance of a significant portion of that infrastructure or whether those third parties will upgrade or improve their equipment. We depend on these companies to maintain the operational integrity of our connections. If one or more of these companies is unable or unwilling to supply or expand its levels of service to us in the future, our operations could be severely interrupted. Also, to the extent that the number of users of networks utilizing our current or future products suddenly increases, the technology platform and secure hosting services which will be required to accommodate a higher volume of traffic may result in slower response times or service interruptions. System interruptions or increases in response time could result in a loss of potential or existing users and, if sustained or repeated, could reduce the appeal of the networks to users. In addition, users depend on real-time communications; outages caused by increased traffic could result in delays and system failures. These types of occurrences could cause users to perceive that our solution does not function properly and could therefore adversely affect our ability to attract and retain licensees, strategic partners, and customers.\nIndex\nSystem failure or interruption or our failure to meet increasing demands on our systems could harm our business.\nThe success of our license and service offerings will depend on the uninterrupted operation of various systems, secure data centers and other computer and communication networks that we establish. To the extent, the number of users of networks utilizing our future products suddenly increases, the technology platform and hosting services which will be required to accommodate a higher volume of traffic may result in slower response times, service interruptions or delays or system failures. Our systems and operations will also be vulnerable to damage or interruption from, among other things:\n• Power loss, transmission cable cuts and other telecommunications failures;\n• Damage or interruption caused by fire, earthquake, and other natural disasters;\n• Computer viruses or software defects; and\n• Physical or electronic break-ins, sabotage, intentional acts of vandalism, terrorist attacks and other events beyond our control.\nSystem interruptions or failures and increases or delays in response time could result in a loss of potential or existing users and, if sustained or repeated, could reduce the appeal of the networks to users. These types of occurrences could cause users to perceive that our solution does not function properly and could therefore adversely affect our ability to attract and retain licensees, strategic partners, and customers.\nAny significant problem with our systems or operations could result in lost revenue, customer dissatisfaction or lawsuits against us. A failure in the operation of our secure domain name registration system could result in the inability of one or more registrars to register and maintain secure domain names for a period of time. A failure in the operation or update of the master directory that we plan to maintain could result in deletion or discontinuation of assigned secure domain names for a period of time. The inability of the registrar systems we establish, including our back-office billing and collections infrastructure, and telecommunications systems to meet the demands of an increasing number of secure domain name requests could result in substantial degradation in our customer support service and our ability to process registration requests in a timely manner.\nOur ability to sell our solutions will be dependent on the quality of our technical support, and our failure to deliver high- quality technical support services could have a material adverse effect on our sales and results of operations.\nIf we do not effectively assist our customers in deploying our products, succeed in helping our customers quickly resolve post- deployment issues and provide effective ongoing support, or if potential customers perceive that we may not be able achieve to the foregoing, our ability to sell our products would be adversely affected, and our reputation with current and potential customers could be harmed. In addition, as we expand our operations internationally, our technical support team will face additional challenges, including those associated with delivering support, training, and documentation in languages other than English. Our failure to deliver and maintain high-quality technical support services to our customers could result in customers choosing to use our competitors’ products and support services instead of ours in the future.\nTelephone carriers have petitioned governmental agencies to enforce regulatory tariffs, which, if granted, would increase the cost of online communication, and such increase in cost may impede the growth of online communication and adversely affect our business.\nIndex\nUse of the Internet has over-burdened existing telecommunications infrastructures, and many high traffic areas have begun to experience interruptions in service. As a result, certain local telephone carriers have petitioned governmental agencies to enforce regulatory tariffs on IP telephony traffic that crosses over their traditional telephone networks. If the relief sought in these petitions is granted, the costs of communicating via online could increase substantially, potentially adversely affecting the growth in the use of online secure communications. Any of these developments could have an adverse effect on our business.\nThe departure of Kendall Larsen, our Chief Executive Officer and President, and/or other key personnel could compromise our ability to execute our strategic plan and materially harm our business.\nOur success largely depends on the skills, experience, and performance of our key personnel. Due to the specialized nature of our business and limited staff, we are particularly dependent on Kendall Larsen, our Chief Executive Officer and President. We have no employment agreements with any of our key executives that prevent them from leaving us at any time. In addition, we do not maintain key person life insurance for any of our officers or key employees. The loss of Mr. Larsen, or our failure to retain other key personnel or adequately plan for the succession of key personnel, would jeopardize our ability to execute our strategic plan and materially harm our business.\nWe will need to recruit and retain additional qualified personnel to successfully grow our business.\nOur future success will depend, in part, on our ability to attract and retain qualified engineering, operations, marketing, sales and executive personnel. Inability to attract and retain such personnel could adversely affect our business. Competition for engineering, operations, marketing, sales, and executive personnel is intense, particularly in the technology and Internet sectors and in the regions where we conduct our business. We may need to invest significant amounts of cash and equity to attract and retain employees and expend significant time and resources to identify, recruit, train and integrate such employees, and we may never realize returns on these investments. Additionally, we can provide no assurance that we will attract or retain such personnel.\nOur international expansion will subject us to additional costs and risks, and our plans may not be successful.\nWe expect to expand our presence internationally in Japan and elsewhere through, third party arrangements such as international partnerships, joint ventures and potentially establishing international subsidiaries and offices. Our international expansion may present challenges and risks, including those inherent in international operations, to us and may require significant attention from management. For example, the COVID-19 pandemic could disrupt and slow our international expansion and partnership efforts, as our international partners’ businesses could be disrupted. We may not be successful in our international partnerships, expansion efforts, and we may incur significant operating expenses in our efforts to expand internationally.\nWe have incurred and will continue to incur significant increased costs as a result of operating as a public company, and our management will be required to continue to devote substantial time to various compliance initiatives.\nThe Sarbanes-Oxley Act of 2002, the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010, as well as other rules implemented by the SEC and the New York Stock Exchange (“NYSE”), impose various requirements on public companies, including requiring changes in corporate governance practices. These and proposed corporate governance laws and regulations under consideration may further increase our compliance costs. If compliance with these various legal and regulatory requirements diverts our management’s attention from other business concerns, it could have a material adverse effect on our business, financial condition, and operating results. The Sarbanes-Oxley Act requires, among other things, that we assess the effectiveness of our internal control over financial reporting annually and disclosure controls and procedures quarterly. If we are unable to assert in any future reporting periods that our internal control over financial reporting is effective (or if our independent registered public accounting firm is unable to express an opinion on the effectiveness of our internal controls), we could lose investor confidence in the accuracy and completeness of our financial reports, which would have an adverse effect on our share price.\nAlthough we believe that we currently maintain effective control over our disclosures and procedures and internal control over financial reporting, we may in the future identify deficiencies regarding the design and effectiveness of our system of internal control over financial reporting. If we experience any material weaknesses in our internal control over financial reporting in the future or are unable to provide unqualified management or attestation reports about our internal controls, we may be unable to meet financial and other reporting deadlines and may incur costs associated with remediation, and any of which could cause our share price to decline. Moreover, if we identify deficiencies in our internal control over financial reporting that are deemed to be material weaknesses in future periods, the market price of our ordinary shares could decline, and we could be subject to potential delisting by the NYSE and review by the NYSE, the SEC, or other regulatory authorities, which would require the expenditure by us of additional financial and management resources. As a result, our shareholders could lose confidence in our financial reporting, which would harm our business and the market price of our ordinary shares.\nIndex\nThere are inherent uncertainties involved in estimates, judgments and assumptions used in the preparation of financial statements in accordance with U.S. GAAP. Any changes in estimates, judgments and assumptions could have a material adverse effect on our business, financial condition, and operating results.\nThe preparation of financial statements in accordance with U.S. GAAP involves making estimates, judgments and assumptions that affect reported amounts of assets (including intangible assets), liabilities and related reserves, revenues, expenses, and income. Estimates, judgments and assumptions are inherently subject to change in the future, and any such changes could result in corresponding changes to the amounts of assets, liabilities, revenues, expenses, and income. Any such changes could have a material adverse effect on our business, financial condition, and operating results.\nOur results of operations and financial condition could be materially affected by the enactment of legislation implementing changes in the U.S. or foreign taxation of international business activities or the adoption of other tax reform policies.\nAs we expand the scale of our international business activities, any changes in the U.S. or foreign taxation of such activities may increase our worldwide effective tax rate and harm our business, results of operations, and financial condition. For example, in December 2017, the legislation commonly referred to as the Tax Cuts and Jobs Act (the “Tax Act”) was enacted, which contained significant changes to U.S. tax law, including, but not limited to, a reduction in the corporate tax rate and a transition to a new territorial system of taxation. The impact of future changes to U.S. and foreign tax law on our business is uncertain and could be adverse, and we will continue to monitor and assess the impact of any such changes.\nWar, terrorism, other acts of violence, or natural or manmade disasters may affect the markets in which we operates, our clients and our service delivery.\nOur business may be adversely affected by instability, disruption, or destruction in a geographic region in which we operates, regardless of cause, including war, terrorism, riot, civil insurrection, or social unrest, and natural or manmade disasters, including famine, flood, fire, earthquake, storm, or pandemic events and spread of disease, such as the COVID-19 pandemic. Such events may cause our customers to delay their decisions on spending for the services we provide and give rise to sudden significant changes in regional and global economic conditions and cycles. These events may also pose risks to our personnel and to physical facilities and operations, which could adversely affect our financial results.\nThe global COVID-19 pandemic may harm our business, financial condition, and results of operations.\nIn December 2019, a novel coronavirus, COVID-19 was reported in China and in March 2020, the World Health Organization declared it a pandemic. This contagious disease outbreak has continued to spread across the globe and is impacting worldwide economic activity and financial markets. In light of the uncertain and rapidly evolving situation relating to the spread of COVID-19, we have taken precautionary measures intended to minimize the risk of the virus to our employees, our customers, and other third parties with whom we interact. We are requiring all employees to work remotely and have also suspended all non-essential travel worldwide for our employees. While we have a distributed workforce and our employees are accustomed to working remotely or working with other remote employees, our workforce is not fully remote. Our employees and consultants travel frequently to establish and maintain relationships with one another, our customers and prospective customers, partners, and investors. Although we continue to monitor the situation and may adjust our current policies as more information and public health guidance becomes available, temporarily suspending travel and restricting the ability to do business in person could negatively affect our customer success efforts, sales and marketing efforts, challenge our ability to enter into customer contracts in a timely manner, slow down our recruiting efforts, or create operational or other challenges, any of which could harm our business, financial condition and results of operations. Furthermore, if a natural disaster, power outage, connectivity issue, or other event occurred that impacted our employees’ ability to work remotely, it may be difficult or, in certain cases, not possible, for us to continue our business for a substantial period of time. The increase in remote working may also result in consumer privacy, IT security and fraud concerns as well as increase our exposure to potential wage and hour issues. In addition, the COVID-19 pandemic may disrupt the operations of our customers, partners, suppliers, and other third-party providers for an indefinite period of time, including as a result of travel restrictions, adverse effects on budget planning processes, and/or business shutdowns, all of which could negatively impact our business, financial condition, and results of operations. More generally, the COVID-19 pandemic could continue to adversely affect economies and financial markets globally, potentially leading to an economic downturn, which could decrease technology spending and adversely affect our business.\nIndex\nRisks Related to Our Common Stock\nTrading in our common stock is limited and the price of our common shares may be subject to substantial volatility.\nOur common stock is currently listed on the NYSE and was previously listed on the NYSE American LLC (formerly the NYSE MKT LLC). Over the past years, the market price of our common stock has experienced significant fluctuations. Between January 1, 2020, and December 31, 2020, the reported last adjusted closing price on the NYSE American LLC, and now NYSE, for our common stock ranged between $3.20 and $7.54 per share. The price of our common stock may continue to be volatile as a result of several factors, some of which are beyond our control. These factors include, but not limited to, the following:\n• Developments or lack thereof in any then-outstanding litigation;\n• Quarterly variations in our operating results;\n• Large purchases or sales of common stock or derivative transactions related to our stock;\n• Actual or anticipated announcements of new products or services by us or competitors;\n• General conditions in the markets in which we compete; and\n• General social, political, economic, and financial conditions, including the significant volatility in the global financial markets, and impacts from the COVID-19 pandemic.\nIn addition, we believe there has been and may continue to be substantial trading in derivatives of our stock, including short selling activity or related similar activities, which are beyond our control and which may be beyond the full control of the SEC and Financial Institutions Regulatory Authority or “FINRA”. While the SEC and FINRA rules prohibit some forms of short selling and other activities that may result in stock price manipulation, such activity may nonetheless occur without detection or enforcement. We have held conversations with regulators concerning trading activity in our stock; however, there can be no assurance that should there be any illegal manipulation in the trading of our stock, it will be detected, prosecuted, or successfully eradicated. Significant short selling market manipulation could cause our stock trading price to decline, to become more volatile, or both.\nThe market price of our common stock has been and may continue to be volatile, and you could lose all or part of your investment.\nThe trading price of our common stock has been volatile since our initial public offering and is likely to continue to be volatile. Factors that could cause fluctuations in the market price of our common stock include, but are not limited to the following:\n• Price and volume fluctuations in the overall stock market from time to time, including fluctuations due to general economic uncertainty or negative market sentiment, in particular related to the COVID-19 pandemic;\n• Volatility in the market prices and trading volumes of companies in our industry or companies that investors consider comparable;\n• Changes in operating performance and stock market valuations of other companies generally, or those in our industry;\n• Sales of shares of our common stock by us or our stockholders;\nIndex\n• Failure of securities analysts to maintain coverage of us, changes in financial estimates by securities analysts who follow us, or our failure to meet these estimates or the expectations of investors;\n• The financial projections we may provide to the public, any changes in those projections or our failure to meet those projections;\n• Announcements by us or our competitors of new products or services;\n• The public’s reaction to our press releases, other public announcements, and filings with the SEC;\n• Rumors and market speculation involving us or other companies in our industry;\n• Actual or anticipated changes in our results of operations;\n• Actual or anticipated developments in our business, our competitors’ businesses, or the competitive landscape generally;\n• Litigation involving us, our industry or both, or investigations by regulators into our operations or those of our competitors;\n• Announced or completed acquisitions of businesses or technologies by us or our competitors;\n• New laws or regulations or new interpretations of existing laws or regulations applicable to our business;\n• Changes in accounting standards, policies, guidelines, interpretations, or principles;\n• Any significant change in our management; and\n• General economic conditions and slow or negative growth of our markets, including any economic downturn from the COVID-19 pandemic;\nFurther, in recent years the stock markets have experienced extreme price and volume fluctuations that have affected and continue to affect the market prices of equity securities of many companies. These fluctuations often have been unrelated or disproportionate to the operating performance of those companies. In addition, the stock prices of many technology companies have experienced wide fluctuations that have often been unrelated to the operating performance of those companies. These broad market and industry fluctuations, as well as general economic, political and market conditions such as recessions, government shutdowns, global pandemics (such as the COVID-19 pandemic), interest rate changes the stability of the EU and the exit of the United Kingdom or international currency fluctuations, may cause the market price of our common stock to decline. In the past, following periods of volatility in the overall market and the market price of a particular company’s securities, securities class action litigation has often been instituted against these companies.\nWe have broad discretion in how we apply our funds, and we may not use these funds effectively, which could affect our results of operations and cause our stock price to decline.\nOur management will have broad discretion in the application of our existing cash, cash equivalents and marketable securities and could spend these funds in ways that do not improve our results of operations or enhance the value of our common stock. Pending their use, we may invest our available funds in a manner that does not produce income or that loses value. The failure by our management to apply our available funds effectively could result in financial losses that could cause the price of our common stock to decline and delay the development of our products.\nIn addition, an entity that, among other things, is or holds itself out as being engaged primarily, or proposes to engage primarily, in the business of investing, reinvesting, owning, trading, or holding certain types of securities would be deemed an Investment Company under the Investment Company Act of 1940 (the “1940 Act”). If we do not manage our investments and business in a manner that meets the requirements for an exemption under the 1940 Act, we may be deemed to be an investment company under the 1940 Act and subject to additional limitations on operating our business including limitations on the issuance of securities, which may make it difficult for us to raise capital.\nIndex\nWe do not regularly pay dividends on our common stock and thus stockholders must look to appreciation of our common stock to realize a gain on their investments.\nOur dividend policy is within the discretion of our Board of Directors and will depend upon various factors, including our business, financial condition, results of operations, capital requirements, and investment opportunities. We therefore cannot make assurances that our Board of Directors will determine to pay regular or special dividends in the future. Accordingly, unless our Board of Directors determines to pay dividends, stockholders will be required to look to appreciation of our common stock to realize a gain on their investment. This appreciation may not occur.\nThe exercise of our outstanding stock options, warrants and RSUs and issuance of new shares would result in a dilution of our current stockholders’ voting power and an increase in the number of shares eligible for future resale in the public market which may negatively impact the market price of our stock.\nThe exercise of our outstanding vested stock options, warrants and RSUs would dilute the ownership interests of our existing stockholders. As of December 31, 2020, we had outstanding options, warrants and RSUs to purchase an aggregate of 6,341,844 shares of common stock representing approximately 9% of our total shares outstanding of which 4,426,250 were vested and therefore exercisable. To the extent outstanding stock options are exercised, additional shares of common stock will be issued, existing stockholders’ percentage voting interests will decline and the number of shares eligible for resale in the public market will increase. Such increase may have a negative effect on the value or market trading price of our common stock.\nThe market price of our common stock may decline because our operating results may not be consistent and may be difficult to predict.\nOur reported net income has fluctuated in the past due to several factors. We expect that our future operating results may also fluctuate due to the same or similar factors. While we had net income of $280.4 million for the year ended December 31, 2020, we had net losses of $19.2 million for 2019 and $25.4 million for 2018, and as of December 31, 2020, we had accumulated deficits of $8.0 million. The following include some of the factors that may cause our operating results to fluctuate:\n• The outcome of actions to enforce our intellectual property rights currently in progress or that we may undertake in the future, and the timing thereof;\n• The impact of the COVID-19 pandemic on our sales cycle and results;\n• The amount and timing of receipt of license fees from potential infringers, licensees, or customers;\n• The rate of adoption of our patented technologies;\n• The number of new license arrangements we may execute, or that may expire, within a particular period and the scope of those licenses, including the number of our patents which are licensed, the extent of prior infringement of our patent rights, royalty rates, timing of payment obligations, expiration date etc.;\n• The success of a licensee in selling products that use our patented technologies; and\n• The amount and timing of expenses related to our patent filings and enforcement proceedings, including litigation, related to our intellectual property rights.\nThese fluctuations may make our business particularly difficult to manage, adversely affect our business and operating results, make our operating results difficult for investors to predict and, further, cause our results to fall below investor’s expectations and adversely affect the market price of our common stock.\nBecause ownership of our common stock is concentrated, investors may have limited influence on stockholder decisions.\nAs of December 31, 2020, our executive officers and directors beneficially owned approximately 13% of our outstanding common stock. In addition, a group of stockholders that, as of December 31, 2007, held 4,766,666 shares, or approximately 7% of our outstanding common stock, have entered into a voting agreement with us that requires them to vote all of their shares of our voting stock in favor of the director nominees approved by our Board of Directors at each director election going forward, and in a manner that is proportional to the votes cast by all other voting shares as to any other matters submitted to the stockholders for a vote. However, we cannot be certain how many shares of our common stock this group of stockholders currently owns. Because of their beneficial ownership interest, our officers and directors could significantly influence stockholder actions of which you disapprove or that are contrary to your interests. This ability to exercise significant influence could prevent or significantly delay another company from acquiring or merging with us.\nIndex\nOur protective provisions in our amended and restated certificate of incorporation and bylaws could make it difficult for a third party to successfully acquire us even if you would like to sell your stock to them.\nWe have a number of protective provisions in our amended and restated certificate of incorporation and bylaws that could delay, discourage, or prevent a third party from acquiring control of us without the approval of our Board of Directors. These protective provisions include:\n• A staggered Board of Directors: This means that only one or two directors (since we have a five-person Board of Directors) will be up for election at any given annual meeting. This has the effect of delaying the ability of stockholders to affect a change in control of us because it would take two annual meetings to effectively replace a majority of the Board of Directors.\n• Blank check preferred stock: Our Board of Directors has the authority to establish the rights, preferences, and privileges of our 10,000,000 authorized, but unissued, shares of preferred stock. Therefore, this stock may be issued at the discretion of our Board of Directors with preferences over your shares of our common stock in a manner that is materially dilutive to you. In addition, blank check preferred stock can be used to create a “poison pill” which is designed to deter a hostile bidder from buying a controlling interest in our stock without the approval of our Board of Directors. We have not adopted such a “poison pill;” but our Board of Directors has the ability to do so in the future, very rapidly and without stockholder approval.\n• Advance notice requirements for director nominations and for new business to be brought up at stockholder meetings: Stockholders wishing to submit director nominations or raise matters to a vote of the stockholders must provide notice to us within very specific date windows and in very specific form in order to have the matter voted on at a stockholder meeting. This has the effect of giving our Board of Directors and management more time to react to stockholder proposals generally and could also have the effect of disregarding a stockholder proposal or deferring it to a subsequent meeting to the extent such proposal is not raised properly.\n• No stockholder actions by written consent: No stockholder or group of stockholders may take actions rapidly and without prior notice to our Board of Directors and management or to the minority stockholders. Along with the advance notice requirements described above, this provision also gives our Board of Directors and management more time to react to proposed stockholder actions.\n• Super majority requirement for stockholder amendments to the bylaws: Stockholder proposals to alter or amend our bylaws or to adopt new bylaws can only be approved by the affirmative vote of at least 66 2/3% of the outstanding shares of our common stock.\n• No ability of stockholders to call a special meeting of the stockholders: Only the Board of Directors or management can call special meetings of the stockholders. This could mean that stockholders, even those who represent a significant percentage of our shares of common stock, may need to wait for the annual meeting before nominating directors or raising other business proposals to be voted on by the stockholders.\nIn addition, the provisions of Section 203 of the Delaware General Corporation Law govern us. These provisions may prohibit large stockholders, particularly those owning 15% or more of our outstanding voting stock, from merging or combining with us for a certain period of time.\nThese and other provisions in our amended and restated certificate of incorporation, our bylaws and under Delaware law could discourage potential takeover attempts, reduce the price that investors might be willing to pay for shares of our common stock in the future and result in the market price being lower than it would be without these provisions.\nIndex\nOur amended and restated bylaws designate a state or federal court located within the State of Delaware as the exclusive forum for substantially all disputes between us and our stockholders, which could limit our stockholders’ ability to choose the judicial forum for disputes with us or our directors, officers, or employees.\nOur amended and restated bylaws provide that, unless we consent in writing to the selection of an alternative forum, the sole and exclusive forum for (1) any derivative action or proceeding brought on our behalf, (2) any action asserting a claim of breach of a fiduciary duty owed by any of our directors, stockholders, officers, or other employees to us or our stockholders, (3) any action arising pursuant to any provision of the Delaware General Corporation Law, or our amended and restated certificate of incorporation or amended and restated bylaws or (4) any other action asserting a claim that is governed by the internal affairs doctrine shall be the Court of Chancery of the State of Delaware (or, if the Court of Chancery does not have jurisdiction, another State court in Delaware or the federal district court for the District of Delaware), in all cases subject to the court having jurisdiction over indispensable parties named as defendants.\nHowever, notwithstanding the exclusive forum provisions, our amended and restated bylaws explicitly state that they would not preclude the filing of claims brought to enforce any liability or duty created under federal securities laws, including the Securities Act of 1933 or the Securities Exchange Act of 1934.\nAny person or entity purchasing or otherwise acquiring any interest in any of our securities shall be deemed to have notice of and consented to this provision. This exclusive-forum provision may limit a stockholder’s ability to bring a claim in a judicial forum of its choosing for disputes with us or our directors, officers, or other employees, which may discourage lawsuits against us and our directors, officers, and other employees. If a court were to find this exclusive-forum provision in our amended and restated bylaws to be inapplicable or unenforceable in an action, we may incur additional costs associated with resolving the dispute in other jurisdictions, which could harm our results of operations.",
    "item_1B": "Item 1B. Unresolved Staff Comments.\nNone.",
    "item_2": "Item 2. Properties\nOur principal executive offices are located at 308 Dorla Court, Suite 206, Zephyr Cove, Nevada, 89448. We lease this property, which comprises approximately 2,090 square feet of office space, from a third party for a term that ends in October 2021. We have no other properties and believe that our office facility is suitable and appropriately supports our current business needs.",
    "item_3": "Item 3. Legal Proceedings (See “Litigation” in Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations)",
    "item_4": "Item 4. Mine Safety Disclosure\nNot applicable.\nIndex\nPART II",
    "item_5": "Item 5. Market for the Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nOur common stock currently trades under the symbol “VHC” on the NYSE.\nHolders of Record\nAs of March 11, 2021, we had 53 stockholders of record. Because many of our shares of common stock are held of record by brokers and other institutions on behalf of stockholders, we are unable to estimate the total number of beneficial stockholders represented by such record holders.\nDividend Policy\n(See \"Dividend\" in Note -8, in Notes to Consolidated Financial Statements).\nSecurities Authorized for Issuance under Equity Compensation Plan\nSee Item 12, Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters for information regarding securities authorized for issuance.\nRecent Sales of Unregistered Securities\nDuring the year ended December 31, 2020, we had no sales of unregistered securities and no repurchases of stock.",
    "item_6": "Item 6. Not applicable",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe Company\nWe are an Internet security software and technology company with patented technology for various types of secure network communications, including 5G and 4G LTE network security. Our patented Secure Domain Name Registry and GABRIEL Connection Technology™, are the foundation for our GABRIEL Secure Communication Platform™ that protects communications using Zero Trust Network Access (ZTNA). Our technology generates secure connections on a “zero-click” or “single-click” basis, significantly simplifying the deployment of secure real-time communication solutions by eliminating the need for end-users to enter any encryption information. Our portfolio of intellectual property is the foundation of our business model. We currently own approximately 194 total patents and pending applications, including 70 U.S. patents/patent applications and 124 foreign patents/validations/pending applications. Our patent portfolio is primarily focused on securing real-time communications over the Internet, and related services, and is used in all our technology and products, some of which were acquired by our principal operating subsidiary; VirnetX, Inc., from Leidos, Inc., or Leidos, (f/k/a Science Applications International Corporation, or SAIC) in 2006.\nOur product portfolio includes sophisticated technologies, products and services that are available for sale worldwide. Our GABRIEL Secure Communication Platform™ includes a set of software libraries with application interfaces available for securing third-party applications seamlessly across multiple operating systems. It enables individuals and organizations to maintain complete ownership and control over their personal and confidential data, secured within their own private network, while enabling authorized secure encrypted access from anywhere at any time.\nIndex\nOur GABRIEL Gateway product extends our Secure Communication Platform™ by allowing existing networked devices and services to seamlessly join the “GABRIEL SECURED” network without requiring any modifications. All these devices or services, including on-premise or cloud-based services, can now be assigned a VirnetX Secure Domain Name and use fully authenticated, secure communication channels for its communications.\nOur GABRIEL Collaboration Suite™ is a set of communication applications and tools that use our GABRIEL Secure Communication Platform™. It enables seamless and secure cross-platform communications between devices that are enrolled in our “GABRIEL SECURED” network and have our software installed. Our GABRIEL Collaboration Suite™ is available for download and free trial, for Android, iOS, Windows, Linux, and Mac OS X platforms, at https://virnetx.com.\nWe continue to enhance our products and add new functionality. We will provide updates to new and existing customers as they are released to the public. Many small and medium businesses have installed our GABRIEL Secure Communication Platform™ and GABRIEL Collaboration Suite™ products in their corporate networks. We intend to continue to expand our customer base with targeted promotions and direct sales initiatives.\nWe have an ongoing GABRIEL Licensing Program under which we offer licenses to a portion of our patent portfolio, technology, and software, including our secure domain name registry service, to domain infrastructure providers, communication service providers as well as to system integrators. Our GABRIEL Connection Technology™ License is offered to OEM customers who want to adopt the GABRIEL Connection Technology™ as their solution for establishing secure connections using secure domain names within their products. We have developed GABRIEL Connection Technology™ Software Development Kit (SDK) to assist with rapid integration of these techniques into existing software implementations. Customers who want to develop their own implementation of the VirnetX patented techniques for supporting secure domain names, or other techniques that are covered by our patent portfolio for establishing secure communication links, can purchase a patent license. The number of patents licensed, and therefore the cost of the patent license to the customer, will depend upon which of the patents are used in a particular product or service. These licenses will typically include an initial license fee, as well as an ongoing royalty.\nOur employees include the core development team behind our patent portfolio, technology, and software. Some members of this team have worked together for over twenty years and were on same team that invented and developed this technology while working at Leidos, Inc. (“Leidos”). The team has continued its research and development work and expanded the set of patents we acquired in 2006 from Leidos, into a larger patent portfolio. This portfolio now serves as the foundation of our products, services, and our licensing business. It is expected to generate most of our future revenue in license fees and royalties. We intend to continue our efforts to develop new products and technologies and further strengthen and expand our patent portfolio. We intend to continue using an outsourced and leveraged model to maintain efficiency and manage costs as we grow our licensing business by, for example, offering incentives to early licensing targets or asserting our rights for use of our patents.\nIndex\nLitigation (all dollar amounts in this section are expressed in thousands except for rates per device)\nWe have several intellectual property infringement lawsuits pending in the United States District Court for the Eastern District of Texas, Tyler Division (“USDC”), and United States Court of Appeals for the Federal Circuit (“USCAFC”) and the Supreme Court of the United States (“SCOTUS”).\nVirnetX Inc. v. Cisco Systems, Inc. et al. (Case 6:10-CV-00417-LED) (“Apple I”)\nOn August 11, 2010, we filed a complaint against Aastra USA. Inc. (“Aastra”), Apple Inc. (“Apple”), Cisco Systems, Inc. (“Cisco”), and NEC Corporation (“NEC”) the USDC in which we alleged that these parties infringe on certain of our patents (U.S. Patent Nos. 6,502,135, 7,418,504, 7,921,211 and 7,490,151). We sought damages and injunctive relief. The cases against each defendant were separated by the judge. Aastra and NEC agreed to sign license agreements with us, and we dropped all accusations of infringement against them. A jury in USDC decided that our patents were not invalid and rendered a verdict of non-infringement by Cisco on March 4, 2013. Our motion for a new Cisco trial was denied and the case against Cisco was closed.\nOn November 6, 2012, a jury in the USDC awarded us over $368,000 for Apple’s infringement of four of our patents, plus daily interest up to the final judgment.\nApple filed an appeal of the judgment to the USCAFC. On September 16, 2014, USCAFC affirmed the USDC jury’s finding that all four of our patents at issue are valid and confirmed the USDC jury’s finding of infringement of VPN on Demand under many of the asserted claims of our ‘135 and ‘151 patents, and the USDC’s decision to allow evidence about our license and royalty rates regarding the determination of damages. However, the USCAFC vacated the USDC jury’s damages award and some of the USDC’s claim construction with respect to parts of our ‘504 and ‘211 patents and remanded the damages award and determination of infringement with respect to FaceTime back to the USDC for further proceedings.\nOn September 30, 2016, pursuant to the 2014 remand from the USCAFC, a jury in the USDC awarded us $302,400 for Apple’s infringement of four of our patents. On September 29, 2017, the USDC entered its final judgment, denied all of Apple’s post-trial motions, granted all our post-trial motions, including our motion for willful infringement and enhanced the royalty rate during the willfulness period from $1.20 to $1.80 per device, and awarded us costs, certain attorneys’ fees, and prejudgment interest. The total amount in the final judgment was $439,700, including $302,400 (jury verdict), $41,300 (enhanced damages) and $96,000 (costs, fees, and interest).\nOn October 27, 2017 Apple appealed the final judgment entered on September 29, 2017 to the USCAFC. Oral arguments in this case were held on January 8, 2019. On January 15, 2019, the Court issued a Rule 36 order affirming the district court’s final judgment. Apple filed a petition for panel rehearing and rehearing en-banc in this matter on February 21, 2019. On October 1, 2019, USCAFC issued an order denying Apple’s petition. Apple filed a petition for a writ of certiorari with the SCOTUS, which was denied on February 24, 2020. Prior to the SCOTUS decision denying Apple’s petition for a writ of certiorari, on February 20, 2020, Apple filed a Rule 60(b) motion for relief from judgment with the USDC, seeking relief from the district court’s September 29, 2017 final judgment. VirnetX filed a responsive brief in opposition on March 5, 2020.\nIndex\nOn March 13, 2020, the Company received payment of $454,034 from Apple, representing the previously announced final judgment with interest in this case. Apple sought payment relief by filing a motion under Rule 60(b). On September 1, 2020 USDC issued an order denying Apple’s motion for relief of judgement. This case is now closed.\nVirnetX Inc. v. Apple, Inc. (Case 6:12-CV-00855-LED) (“Apple II”)\nThis case began on November 6, 2012, when we had filed a complaint against Apple in USDC in which we alleged that Apple infringed on certain of our patents, (U.S. Patent Nos. 6,502,135, 7,418,504, 7,921,211 and 7,490,151). We sought damages and injunctive relief. The accused products include the iPhone 5, iPod Touch 5th Generation, iPad 4th Generation, iPad mini, and the latest Macintosh computers; these products were not included in the Apple I case because they were released after the Apple I case was initiated. Post-trial motions hearing was held on July 18, 2018. On August 31, 2018, the USDC entered a Final Judgment and issued its Memorandum Opinion and Order regarding post-trial motions, affirming the jury’s verdict of $502,600 and granting VirnetX motions for supplemental damages, a sunset royalty, and the royalty rate of $1.20 per infringing iPhone, iPad and Mac products, pre-judgment and post-judgment interest and costs. Apple filed a notice of appeal with the USCAFC in the Apple II case.\nOn October 9, 2018, USCAFC docketed the appeal as Case No. 19-1050 - VirnetX Inc. v. Apple Inc . On January 24, 2019 Apple filed its opening brief. We filed our response brief on March 1, 2019. Apple filed its reply brief on April 5, 2019. The oral arguments were heard on October 4, 2019. On November 22, 2019, the USCAFC issued an opinion affirming the district court’s findings that Apple is precluded from making certain invalidity arguments and that Apple infringed the ’135 and ’151 patents; reversing the USDC’s finding that Apple infringed the ’504 and ’211 patents; and remanding the case for proceedings on damages. Apple sought panel and en banc rehearing, which the USCAFC denied on February 10, 2020.\nOn February 22, 2020, the USDC issued a scheduling order for the parties to brief the court about the need for a new trial for recalculating the damages. We filed our motion for entry of judgment on February 28, 2020. The arguments on this matter were heard on April 14, 2020. In its order, unsealed on May 1, 2020, the USDC denied VirnetX’s motion for entry of a new judgment based on the prior jury verdict and ordered a new jury trial on damages. On August 10, 2020, the USDC granted Apple’s motion for continuance and reset the date to October 26, 2020. On October 30, 2020, a jury returned a $502,800 verdict in favor of VirnetX based on Apple’s infringement of two network security patents: VirnetX US Patents No. 6,502,135 and No. 7,490,151. The jury verdict called for damages of $0.84 per accused device since the 2013 launch of Apple’s iOS 7 operating system and represents 598,629,580 infringing units from US sales only. On January 15, 2021, the district court denied Apple’s motion for judgment as a matter of law, and on February 4, 2021, Apple filed a notice of appeal to the USCAFC.\nVirnetX Inc. v. Mangrove Partners Master Fund, Ltd., Apple Inc. (USCAFC Case 20-2271) and VirnetX Inc. v. Mangrove Partners Master Fund, Ltd., Apple Inc., and Black Swamp, LLC (USAFC Case 20-2272)\nOn September 15, 2020, we filed with the USCAFC an appeal of the invalidity findings by the PTAB in inter-partes review proceedings IPR2015-01046 and IPR2016-00062 involving our U.S. Patent No. 6,502,135, and an appeal of the invalidity findings by the PTAB in inter partes review proceedings IPR2015-1047, IPR2016- 00063, and IPR2016-00167 involving our U.S. Patent No. 7,490,151. On September 25, 2020, the USCAFC issued an order consolidating the two appeals. On December 15, 2020, we filed a motion to vacate the PTAB decisions below and to remand these appeals to the PTAB, which remains pending. In view of our motion to remand, our deadline to file an initial brief is currently stayed.\nIancu v. Luoma (SCOTUS Case 20-74)\nOn July 23, 2020, the United States and the USPTO (collectively, “the United States”) filed a petition for a writ of certiorari from several decisions by the USAFC, including decisions in VirnetX Inc. v. Cisco Systems, Inc., Nos. 2019-1671, and VirnetX Inc. v. Iancu, Nos. 2017-2593, -2594. In those cases, the USAFC granted VirnetX’s motions to vacate the underlying decisions of the PTAB on the basis of Arthrex, Inc. v. Smith & Nephew, Inc., 941 F.3d 1320 (Fed. Cir. 2019), and remanded for further proceedings. The United States requested that the SCOTUS hold its certiorari petition pending the disposition of the United States’ separate petition in United States v. Arthrex, Inc., No. 19-1434 (filed June 25, 2020). On August 26, 2020, VirnetX filed a response, agreeing that the United States’ certiorari petition should be held pending the disposition of the petition for a writ of certiorari in No. 19-1434 (and related petitions filed by private parties in Nos. 19-1452 and 19-1458), and any further SCOTUS proceedings.\nIndex\nOn October 13, 2020, SCOTUS granted the United States’ petition for a writ of certiorari in No. 19-1434 as to USAFC Case No. 2018-2140, and the petitions for writs of certiorari in Nos. 19-1452 and 19-1458, all limited to Questions 1 and 2 as set forth in the July 22, 2020 Memorandum for the United States filed in No. 19-1434. The consolidated petition is seeking review of decisions by the USCAFC holding that administrative patent judges (“APJ”) of the Patent Trial and Appeal Board of the U.S. Patent and Trademark Office must be appointed by the President and confirmed by the Senate; and, whether the remedy imposed by USCAFC that federal laws that place restrictions on when officials can be removed from office cannot apply to APJ, was the appropriate one. SCOTUS heard oral argument in these consolidated cases on March 1, 2021.\nMcKool Smith P.C. v. VirnetX, Inc., AAA Case No. 01-20-0003-7975\nOn March 23, 2020, the law firm of McKool Smith, P.C. (“McKool”) filed a Demand for Arbitration against VirnetX, Inc. with the American Arbitration Association (“AAA”). In its demand, McKool claims that a retention agreement it entered into in 2010 with VirnetX entitles it to a contingency fee arising from the recent 2020 payment made by Apple. McKool claims it is owed approximately $36,300 (or 8% of the Apple I payment). We have filed a general response with the AAA denying McKool’s claim and are contesting the matter vigorously. An evidentiary hearing was held on the matter during the week of February 22, 2021 and the parties will be submitting additional briefing. A ruling is expected sometime thereafter.\nNeal Hurwitz v. Kendall Larsen et al. (Case 2020-0425-JRS)\nOn June 2, 2020, stockholder Neal Hurwitz filed a verified derivative complaint in the Delaware Court of Chancery against Kendall Larsen, Robert D. Short Ill, Gary Feiner, Michael F. Angelo, and Thomas M. O’Brien and naming the Company as nominal defendant. The lawsuit alleges breaches of fiduciary duty, corporate waste, and unjust enrichment arising out of a series of previously-disclosed transactions and compensation awards and seeks an award of monetary damages and equitable relief. On July 1, 2020, the defendants filed a motion to dismiss the complaint based on a failure to plead demand futility and a failure to state a claim on which relief can be granted and, on August 19, 2020, the defendants filed an opening brief in support of their motion to dismiss. On October 16, 2020, plaintiff amended his complaint rather than respond to the arguments in the defendants’ opening brief. On October 23, 2020, the defendants filed a renewed motion to dismiss plaintiff’s amended complaint based on a failure to plead demand futility and a failure to state a claim on which relief can be granted. On January 12, 2021, Hurwitz voluntarily dismissed his suit without prejudice.\nOther Legal Matters\nOne or more potential intellectual property infringement claims may also be available to us against certain other companies who have the resources to defend against any such claims. Although we believe these potential claims are likely valid, commencing a lawsuit can be expensive and time-consuming, and there is no assurance that we could prevail on such potential claims if we made them. In addition, bringing a lawsuit may lead to potential counterclaims which may distract our management and our other resources, including capital resources, from efforts to successfully commercialize our products.\nCurrently, we are not a party to any other pending legal proceedings and are not aware of any proceeding threatened or contemplated against us.\nCommitments and Related Party Transactions\nWe lease our offices under an operating lease with a third party expiring in October 2021. We recognize rent expense on a straight-line basis over the term of the lease.\nWe entered into a service agreement for the use of an aircraft from K2 Investment Fund LLC (“LLC”) for business travel for employees of the Company. We incurred approximately $324, and $1,790 in rental fees and reimbursements to the LLC during the years ended December 31, 2020, and 2019, respectively. We pay for the Company’s business usage of the aircraft and have no right to purchase. Our Chief Executive Officer and Chief Administrative Officer are the managing partners of the LLC and control the equity interests of the LLC. We entered into a 12-month non-exclusive agreement with the LLC for use of the plane at a rate of $8 per flight hour, with no minimum usage requirement. The agreement contains other terms and conditions normal in such transactions and can be cancelled by either us or the LLC with 30 days’ notice. The agreement renews on an annual basis unless terminated by either party. Neither party has exercised their termination rights.\nIndex\nCritical Accounting Policies\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States (“GAAP”) requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reported period. The critical accounting policies we employ in the preparation of our consolidated financial statements are those which involve impairment of long-lived assets, income taxes, fair value of financial instruments and stock-based compensation.\nBasis of Consolidation\nThe consolidated financial statements include the accounts of VirnetX Holding Corporation and our wholly-owned subsidiaries. All intercompany balances and transactions have been eliminated.\nUse of Estimates\nWe prepare our consolidated financial statements in accordance with U.S. GAAP. In doing so, we must make estimates and assumptions that affect our reported amounts of assets, liabilities, revenues, and expenses, as well as related disclosure of contingent assets and liabilities. In some cases, we could reasonably have used different accounting policies and estimates. In some cases, changes in our accounting estimates are reasonably likely to occur. Accordingly, actual results could differ materially from our estimates. To the extent that there are material differences between these estimates and actual results, our financial condition or results of operations will be affected. We base our estimates on experience and other assumptions that we believe are reasonable under the circumstances, at the time they are made, and we evaluate these estimates on an ongoing basis. We refer to accounting estimates of this type as critical accounting policies and estimates, which we discuss further below.\nLeases\nThe Company determines if an arrangement, giving the Company a right-of-use (“ROU”) asset, is a lease at inception. Operating lease ROU assets are included in other assets on the Condensed Consolidated Balance Sheet. ROU assets represent the Company’s right to use an underlying asset for the lease term and lease liabilities represent the Company’s obligation to make lease payments arising from the lease. ROU assets and lease liabilities are recognized at the commencement date of the arrangement based on the present value of lease payments over the lease term. Other assets at December 31, 2020, include a ROU asset related to a facility lease for corporate promotional and marketing purposes. The facility lease was paid in full at inception and the ROU is being amortized over the term of the lease. Other assets also include an ROU related to our office operating lease which expires in October 2021 (See Note 13 - Leases).\nRevenue Recognition\nThe Company derives revenue from licensing and royalty fees from contracts with customers which often span several years. We account for this revenue in accordance with Accounting Standards Codification (“ASC”) Topic 606, Revenue from Contracts with Customers. A performance obligation is a promise in a contract to transfer a distinct good or service to the customer. A contract’s transaction price is allocated to each distinct performance obligation and recognized as revenue when, or as, the performance obligation is satisfied. Our revenue arrangements may consist of multiple-element arrangements, with revenue for each unit of accounting recognized as the product or service is delivered to the customer.\nWith the licensing of our patents, performance obligations are generally satisfied at a point in time as work is complete when our patent rights are transferred to our customers. We generally have no further obligation to our customers regarding our technology.\nCertain contracts may require our customers to enter into a hosting arrangement with us and for these arrangements, revenue is recognized over time, generally over the life of the servicing contract.\nThe Company actively monitors and enforces its intellectual property (“IP”) rights, including seeking appropriate compensation from third parties that utilize the Company’s IP without a license. As a result, the Company may, from time to time, receive payments as part of a settlement or compensation for a patent infringement dispute. Proceeds received are allocated to each element identified in the settlement or compensation, based on the fair value of each element. Generally, settlements and compensation may include the following elements: the value of a license or royalty agreement, cost reimbursement, damages, and interest. Elements identified related to licensing and royalty are recognized as revenue. Elements identified as reimbursed costs are generally recorded as a reduction to the reported expenses. Elements identified as damages or interest are generally recorded in other income in the condensed consolidated statement of operations.\nIndex\nLicensing Costs\nLicensing costs are incurred pursuant to favorable court decisions relating to patent infringement cases and are included in operating expenses in the Company’s consolidated statement of operations.\nContingent Gains\nASC Topic 450-30-25, Contingent Gains, prohibits recognition of contingent gains until realized. Accordingly, we do not record contingent gains ahead of such realization. Management generally considers any such gains as realized only upon the collection of cash.\nEarnings (Loss) Per Share\nBasic earnings (loss) per share are computed by dividing earnings (loss) available to common stockholders by the weighted average number of outstanding common shares during the period. Diluted earnings per share are computed by dividing net income by the weighted average number of shares outstanding during the period increased to include the number of additional shares of common stock that would have been outstanding if the potentially dilutive securities had been issued.\nConcentration of Credit Risk and Other Risks and Uncertainties\nOur cash and cash equivalents are primarily maintained at two major financial institutions in the United States. A portion of those balances are insured by the Federal Deposit Insurance Corporation. During the year ended December 31, 2020, we had funds which were uninsured. We do not believe that we are subject to any unusual financial risk beyond the normal risk associated with commercial banking relationships with major financial institutions. We have not experienced any losses on our deposits of cash and cash equivalents.\nImpairment of Long-Lived Assets\nWe identify and record impairment losses on long-lived assets used in operations when events and changes in circumstances indicate that the carrying amount of an asset might not be recoverable, but not less than annually. Recoverability is measured by comparison of the anticipated future net undiscounted cash flows to the related assets’ carrying value. If such assets are considered to be impaired, the impairment to be recognized is measured by the amount by which the carrying amount of the assets exceeds the projected discounted future net cash flows arising from the asset.\nIncome Taxes\nWe account for income taxes using the asset and liability method. The asset and liability method require the recognition of deferred tax assets and liabilities for expected future tax consequences of temporary differences that currently exist between the tax basis and financial reporting basis of our assets and liabilities. We calculate current and deferred tax provisions based on estimates and assumptions that could differ from actual results reflected on the income tax returns filed during the following years. Adjustments based on filed returns are recorded when identified in the subsequent years. The effect on deferred taxes for a change in tax rates is recognized in income in the period that the tax rate change is enacted. In assessing our deferred tax assets, we consider whether it is more likely than not that all or some portion of the deferred tax assets will not be realized.\nA valuation allowance is provided for deferred income tax assets when, in our judgment, based upon currently available information and other factors, it is more likely than not that all or a portion of such deferred income tax assets will not be realized. The determination of the need for a valuation allowance is based on an on-going evaluation of current information including, among other things, historical operating results, estimates of future earnings in different taxing jurisdictions and the expected timing of the reversals of temporary differences. We believe the determination to record a valuation allowance to reduce a deferred income tax asset is a significant accounting estimate because it is based, among other things, on an estimate of future taxable income in the United States and certain other jurisdictions, which is susceptible to change and may or may not occur, and because the impact of adjusting a valuation allowance may be material. In determining when to release the valuation allowance established against our net deferred income tax assets, we consider all available evidence, both positive and negative. Due to the 2020 income, we have released the valuation allowance against federal net deferred tax assets, and we maintain a partial valuation allowance against the state net operating loss and credit carryovers due to lack of income in California. We continually assess our ability to generate sufficient taxable income during future periods in which our deferred tax assets may be realized. If and when we believe it is more likely than not that we will recover our deferred tax assets, we will reverse the valuation allowance as an income tax benefit in our statements of operations.\nIndex\nWe account for our uncertain tax positions in accordance with U.S. GAAP. The U.S. GAAP method of accounting for uncertain tax positions utilizes a two-step approach to evaluate tax positions. Step one, recognition, requires evaluation of the tax position to determine if based solely on technical merits it is more likely than not to be sustained upon examination. Step two, measurement, is addressed only if a position is more likely than not to be sustained. In step two, the tax benefit is measured as the largest amount of benefit, determined on a cumulative probability basis, which is more likely than not to be realized upon ultimate settlement with tax authorities. If a position does not meet the more likely than not threshold for recognition in step one, no benefit is recorded until the first subsequent period in which the more likely than not standard is met, the issue is resolved with the taxing authority, or the statute of limitations expires. Positions previously recognized are derecognized when we subsequently determine the position no longer is more likely than not to be sustained. Evaluation of tax positions, their technical merits, and measurements using cumulative probability are highly subjective management estimates. Actual results could differ materially from these estimates.\nStock-based Compensation\nWe account for stock-based compensation using the fair value recognition method. We recognize these compensation costs on a straight-line basis over the requisite service period of the award, which is generally based on the option vesting term of 4 years.\nIn addition, we record stock-based compensation expense for awards granted to non-employees at fair value of the consideration received or the fair value of the equity investments issued generally as they vest over the performance period.\nFair Value\nWe apply fair value accounting to all financial assets and liabilities and non-financial assets and liabilities that are recognized or disclosed at fair value in the financial statements on a recurring basis. Fair value is estimated by applying the following hierarchy, which prioritizes the inputs used to measure fair value into three levels and bases the categorization within the hierarchy upon the lowest level of input that is available and significant to the fair value measurement:\nLevel 1 - Quoted prices in active markets for identical assets or liabilities.\nLevel 2 - Observable inputs other than quoted prices in active markets for identical assets and liabilities, quoted prices for identical or similar assets or liabilities in inactive markets, or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities.\nLevel 3 - Inputs that are generally unobservable and typically reflect management’s estimate of assumptions that market participants would use in pricing the asset or liability.\nOur financial instruments are stated at amounts that equal, or are intended to approximate, fair value. When we approximate fair value, we utilize market data or assumptions that we believe market participants would use in pricing the financial instrument, including assumptions about risk and inputs to the valuation technique. We use quoted valuation techniques, primarily the income and market approach that maximize the use of observable inputs and minimize the use of unobservable inputs for recurring fair value measurements.\nNew Accounting Pronouncements\nIn December 2019, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) 2019-12 Income Taxes (Topic 740). The amendments in this ASU simplify the accounting for income taxes by removing certain exceptions to the general principles in Topic 740. The amendments also improve consistent application of and simplify U.S. GAAP for other areas of Topic 740 by clarifying and amending existing guidance. The amendments in this ASU are effective for fiscal years, and interim periods within those fiscal years, beginning after December 15, 2020. We are currently evaluating the impact, if any this ASU will have on our consolidated financial statements and related disclosures.\nIndex\nIn June 2016, the FASB issued ASU 2016-13, Measurement of Credit Losses on Financial Instruments, and issued subsequent amendments to the initial guidance within ASU 2019-04 and ASU 2019-05 (collectively, “ASU 2016-13”). The amendments in ASU 2016-13 replace the incurred loss impairment methodology with the current expected credit loss model, which requires consideration of a broader range of reasonable and supportable information to estimate credit losses. The Company adopted this ASU effective January 1, 2020 and the adoption did not have a material impact on the Company’s financial position, results of operations or cash flows.\nResults of Operations (all amounts in this section are expressed in thousands)\nRevenue\nRevenue\n$\n302,636\n$\nRevenue generated for the year ended December 31, 2020 was $302,636 compared to revenue for the year ended December 31, 2019 of $85. During the year ended December 31, 2020, the Company collected a lump sum payment of $454,034 from Apple, Inc. (see “Legal Proceedings”), as a result of a favorable court decision relating to a patent infringement case. The one-time payment includes past royalties, damages for willful infringement, interest, court costs and attorneys’ fees. (See “Revenue Recognition” in Note 2 - Summary of Significant Accounting Policies, in the Notes to Consolidated Financial Statements.)\nWe recognized royalty revenue as part of license agreements entered into with customers during the patent infringement actions (see “Litigation”). These revenues relate to payment for use of our patented technology prior to the signing of a license agreement, and royalty payments after the execution of the license agreements.\nLicensing Costs\nIncluded in operating expenses for the year ended December 31, 2020, were $90,101 in licensing costs we incurred in conjunction with the proceeds received from Apple Inc., pursuant to a favorable court decision relating to a patent infringement case.\nResearch and Development Expenses\nResearch and Development\n$\n8,830\n$\n3,845\nResearch and development costs include expenses paid to outside development consultants and compensation-related expenses for our engineering staff. Research and development costs are expensed as incurred.\nOur research and development expenses for the year ended December 31, 2020 were $8,830 compared to December 31, 2019 of $3,845. The increase in 2020 compared to 2019 was primarily due to increased compensation expense.\nSelling, General and Administrative Expenses\nSelling, General and Administrative\n$\n45,812\n$\n15,905\nSelling, general and administrative expenses include compensation expense for management and administrative personnel, as well as expenses for outside legal, accounting, and consulting services.\nOur selling, general and administrative expenses for the year ended December 31, 2020 were $45,812 compared to December 31, 2019 of $15,905. The volatility within selling, general and administrative expenses was primarily due to legal fees related to cases involving the defense of our patents. Legal fees were $30,699 and $5,898 in 2020 and 2019, respectively and represent approximately 67% of selling, general and administrative expenses for 2020 compared to 37% for 2019.\nGain on Settlement\nFor the year ended December 31, 2020, we recorded a gain of $41,271 pursuant to a favorable court ruling in the case regarding Apple, Inc. discussed above. (See “Revenue Recognition” in Note 2 - Summary of Significant Accounting Policies, in the Notes to Consolidated Financial Statements.)\nInterest and Other Income, net\nInterest and Other Income\n$\n108,288\n$\nIndex\nInterest and other income for the year ended December 31, 2020 was $108,288 compared to December 31, 2019 of $92. During 2020 we received interest of $108,221 pursuant to a favorable court ruling in the case with Apple, Inc. discussed above. (See “Revenue Recognition” in Note 2 - Summary of Significant Accounting Policies, in the Notes to Consolidated Financial Statements.)\nEffective Income Tax Rate\nA reconciliation of the United States federal statutory income tax rate to our effective income tax rate is as follows:\nYear Ended\nDecember 31, 2020\nYear Ended\nDecember 31, 2019\nUnited States federal statutory rate\n21.00\n%\n21.00\n%\nState taxes, net of federal benefit\n0.17\n%\n1.99\n%\nValuation allowance\n(12.22\n) %\n(21.96\n) %\nStock based compensation\n(0.01\n) %\n-\nR&D Credit\n(0.21\n) %\n1.34\n%\nOther\n0.06\n%\n(0.38\n) %\nEffective income tax rate\n8.79\n%\n1.99\n%\nThe Company’s effective tax rate for both 2020 and 2019 was lower than the statutory Federal income tax rate primarily due to the change in valuation allowance. In 2020 we had pre-tax income of $307,452 and in 2019 we had pre-tax losses of $19,573. At December 31, 2020, we had state net operating loss carryforwards of $107,989. All of the Federal net operating loss (NOL) carryforwards have been utilized to offset the taxable income in 2020. The state NOL carryforwards begin expiring in 2029.\nLiquidity and Capital Resources\nFor the year ended December 31, 2020, our cash and cash equivalents totaled $192,908 and our short-term investments totaled $28,348 compared to $3,135 and $2,394, respectively, for the year ended December 31, 2019.\nWe expect that our cash and cash equivalents and short-term investments as of December 31, 2020, will be sufficient to fund our current level of selling, general and administration costs, including legal expenses and provide related working capital for the foreseeable future. Over the longer term, we expect to derive the majority of our future revenue from license fees and royalties associated with our patent portfolio, technology, software and secure domain name registry in the United States and other markets around the world.\nUniversal Shelf Registration and ATM Offering\nOn July 30, 2018 we filed a $100,000 universal shelf registration statement on SEC Form S-3 which was declared effective by the SEC on August 16, 2018. We also entered an at-the-market equity offering sales agreement (“ATM”) with Cowen & Company, LLC on August 31, 2018, under which we can offer and sell shares of our common stock having an aggregate value of up to $50,000.\nWe use the ATM proceeds for GABRIEL product development, marketing, and general corporate purposes, which may include working capital, capital expenditures, other corporate expenses and acquisitions of complementary products, technologies, or businesses. As of December 31, 2020, common stock with an aggregate value of up to $21,964 remained available for offer and sale under the ATM agreement.\nDuring the year ended December 31, 2020, we sold 1,049,382 shares under the ATM. The average sales price per common share was $4.41 and the aggregate proceeds from the sales totaled $4,627 during the period. Sales commissions, fees and other costs associated with the ATM totaled $139.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nConsistent with the rules applicable to “smaller reporting companies,” we have omitted the information required by Item 7A.\nIndex",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nFINANCIAL STATEMENTS\nFinancial Statements Index\nPage\nReport of Farber Hass Hurley LLP, Independent Registered Public Accounting Firm\nConsolidated Balance Sheets of VirnetX Holding Corporation as of December 31, 2020 and December 31, 2019\nConsolidated Statements of Operations of VirnetX Holding Corporation for the years ended December 31, 2020 and, December 31, 2019\nConsolidated Statements of Comprehensive Income (Loss) of VirnetX Holding Corporation for the years ended December 31, 2020 and December 31, 2019\nConsolidated Statements of Stockholders’ Equity of VirnetX Holding Corporation for the years ended December 31, 2020 and, December 31, 2019\nConsolidated Statements of Cash Flows of VirnetX Holding Corporation for the years ended December 31, 2020, and December 31, 2019\nNotes to Consolidated Financial Statements of VirnetX Holding Corporation\nIndex\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nStockholders of VirnetX Holding Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of VirnetX Holding Corporation (the “Company”) as of December 31, 2020 and 2019, and the related consolidated statements of operations, comprehensive income (loss), stockholders’ equity, and cash flows for each of the years in the two-year period ended December 31, 2020, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2020, and 2019, and the results of its operations and its cash flows for each of the years in the two-year period ended December 31, 2020, in conformity with accounting principles generally accepted in the United States of America.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (“PCAOB”), the Company’s internal control over financial reporting as of December 31, 2020, based on criteria established in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”), and our report dated March 16, 2021, expressed an unqualified opinion.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nIndex\nDescription of the Matter\nRevenue Recognition\nAs discussed in Notes 2 and 12 to the financial statements, during the year ended December 31, 2020 the Company collected a lump sum payment in the amount of $454 million from Apple Inc. on a judgement as a result of a favorable verdict relating to a patent infringement lawsuit. As disclosed by management, the process for determining the value of revenue from the basis of the award was identified in the Final Judgement which included, fixed royalty rate per device, damages for willful infringement, interest, and reimbursement for court costs and attorney’s fees.\nOur determination that revenue recognition pertaining to the Final Judgement is a critical audit matter results from the significant judgment exercised by management in determining the classification. Processes involving higher amounts of management judgment include the interpretation of the provisions of the Final Judgement to determine the amount of revenue to recognize and whether or not the Company is acting as a principal in the fulfillment of the identified performance obligations.\nAudit Procedures\nOur principal audit procedures related to the Company’s revenue recognition for the Final Judgement included the following:\n- We evaluated the Company’s internal controls related to the identification of distinct performance obligations and the determination of the timing of revenue recognition.\n- We evaluated management’s significant accounting policies related to the Final Judgement.\n- We obtained and read the Final Judgement and evaluated and tested management’s identification of the significant terms for completeness. From the terms in the Final Judgement, we evaluated the appropriateness of management’s application of their accounting principles, in their determination of revenue recognition conclusions.\n- We tested the mathematical accuracy of management’s calculations of the classification of the Final Judgement as well as the associated timing of revenue recognized in the financial statements.\nDescription of the Matter\nDeferred Taxes\nAs discussed in Notes 2 and 10 to the financial statements, the Company recorded a deferred tax asset, net of a valuation allowance as of December 31, 2020. In assessing the ability to realize the deferred tax assets, management considers whether it is more likely than not that some portion or all of the deferred tax assets will not be realized. The valuation allowance is based on management’s estimates of future taxable income and application of relevant income tax law.\nOur determination that valuation of deferred taxes is a critical audit matter results from the significant judgment by management when assessing the ability to realize the deferred tax assets, particularly as it relates to estimates of future taxable income. This in turn led to a high degree of auditor judgment, subjectivity, and effort in performing procedures relating to management’s assessment of the realizability of deferred tax assets, as it relates to estimates of future taxable income and application of income tax law.\nAudit Procedures\nOur principal audit procedures related to the Company’s deferred taxes included the following:\n- We evaluated management’s assessment of the realizability of deferred tax assets on a jurisdictional basis. This included evaluating estimates of future taxable income, evaluating management's application of income tax law, and testing the completeness and accuracy of underlying data used in management’s assessment.\n- We evaluated management’s estimates of future taxable income which involved evaluating whether the estimates used by management were reasonable considering the current and past performance of the respective entity and whether the estimates were consistent with evidence obtained in other areas of the audit.\n/s/ Farber Hass Hurley LLP\nWe have served as the Company’s auditor since 2008.\nChatsworth, California\nMarch 16, 2021\nIndex\nVIRNETX HOLDING CORPORATION\nCONSOLIDATED BALANCE SHEETS\n(in thousands, except share amounts)\nAs of\nDecember 31, 2020\nAs of\nDecember 31, 2019\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n192,908\n$\n3,135\nInvestments available for sale\n28,348\n2,394\nAccounts receivables\nPrepaid income tax\n2,905\n-\nPrepaid expenses and other current assets\nTotal current assets\n224,432\n5,771\nPrepaid expenses and other assets\n1,301\n1,711\nProperty and equipment, net\nLong term, deferred tax asset\n9,049\n-\nTotal assets\n$\n234,793\n$\n7,498\nLIABILITIES AND STOCKHOLDERS’ EQUITY\nCurrent liabilities:\nAccounts payable and accrued liabilities\n$\n$\n1,346\nAccrued payroll and related expenses\nAccrued licensing costs\n9,438\n-\nOther liabilities, current\nTotal current liabilities\n10,356\n1,826\nOther liabilities\n-\nTotal liabilities\n10,356\n1,870\nCommitments and contingencies (Note 4)\nStockholders’ equity:\nPreferred stock, par value $0.0001 per share Authorized: 10,000,000 shares at December 31, 2020 and December 31, 2019, Issued and outstanding: 0 shares at December 31, 2020 and December 31, 2019\n-\n-\nCommon stock, par value $0.0001 per share\nAuthorized: 100,000,000 shares at December 31, 2020 and December 31, 2019, Issued and outstanding: 71,058,570 shares and 69,586,764 shares, at December 31, 2020 and December 31, 2019, respectively\nAdditional paid-in capital\n232,457\n223,237\nAccumulated deficit\n(8,014\n)\n(217,602\n)\nAccumulated other comprehensive loss\n(13\n)\n(14\n)\nTotal stockholders’ equity\n224,437\n5,628\nTotal liabilities and stockholders’ equity\n$\n234,793\n$\n7,498\nSee accompanying notes to consolidated financial statements.\nIndex\nVIRNETX HOLDING CORPORATION\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(in thousands, except share and per share amounts)\nYear Ended\nDecember 31, 2020\nYear Ended\nDecember 31, 2019\nRevenue\n$\n302,636\n$\nOperating expense:\nLicensing costs\n90,101\n-\nResearch and development\n8,830\n3,845\nSelling, general and administrative expenses\n45,812\n15,905\nTotal operating expense\n144,743\n19,750\nIncome (loss) from operations\n157,893\n(19,665\n)\nGain on settlement\n41,271\n-\nInterest and other income, net\n108,288\nIncome (loss) before taxes\n307,452\n(19,573\n)\nIncome tax (expense) benefit\n(27,023\n)\nNet income (loss)\n$\n280,429\n$\n(19,180\n)\nBasic earnings (loss) per share\n$\n3.96\n$\n(0.28\n)\nDiluted earnings (loss) per share\n$\n3.92\n$\n(0.28\n)\nWeighted average shares outstanding basic\n70,850,311\n68,564,321\nWeighted average shares outstanding diluted\n71,615,843\n68,564,321\nVIRNETX HOLDING CORPORATION\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME (LOSS)\n(in thousands)\nYear Ended\nDecember 31, 2020\nYear Ended\nDecember 31, 2019\nNet income (loss)\n$\n280,429\n$\n(19,180\n)\nOther comprehensive (loss), net of tax:\nChange in unrealized gain (loss) on investments\n-\nChange in foreign currency translation\n(3\n)\nTotal other comprehensive gain (loss), net of tax\n-\nComprehensive income (loss)\n$\n280,430\n$\n(19,180\n)\nSee accompanying notes to consolidated financial statements.\nIndex\nVirnetX Holding Corporation\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\n(in thousands, except share amounts)\nCommon Stock\nAdditional\nAccumulated\nOther\nTotal\nStockholders’\nShares\nAmount\nPaid-in\nCapital\nAccumulated\nDeficit\nComprehensive\nLoss\nEquity\nBalance at December 31, 2018\n66,879,847\n$\n$\n208,317\n$\n(198,422\n)\n$\n(14\n)\n$\n9,888\nStock issued for cash at $4.00 -$6.49 per share, net\n1,860,483\n10,539\n10,539\nStock issued for options and RSUs, net\n846,434\nStock-based compensation\n3,711\n3,711\nComprehensive loss:\nNet loss\n(19,180\n)\n(19,180\n)\nChange in foreign currency translation, net of tax\n(3\n)\n(3\n)\nChange in unrealized gains, net of tax\nComprehensive loss\n(19,180\n)\nBalance at December 31, 2019\n69,586,764\n$\n$\n223,237\n$\n(217,602\n)\n$\n(14\n)\n$\n5,628\nStock issued for cash at $4.00 -$4.96 per share, net\n1,049,382\n4,488\n4,488\nStock issued for options and RSUs, net\n422,424\nStock-based compensation\n3,938\n3,938\nWarrants issued for services\nDividends declared and paid, $1.00 per share\n(70,841\n)\n(70,841\n)\nComprehensive income:\nNet income\n280,429\n280,429\nChange in foreign currency translation, net of tax\nComprehensive income\n280,430\nBalance at December 31, 2020\n71,058,570\n$\n$\n232,457\n$\n(8,014\n)\n$\n(13\n)\n$\n224,437\nSee accompanying notes to consolidated financial statements.\nIndex\nVIRNETX HOLDING CORPORATION\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in thousands)\nYear Ended\nDecember 31, 2020\nYear Ended\nDecember 31, 2019\nCash flows from operating activities:\nNet income (loss)\n$\n280,429\n$\n(19,180\n)\nAdjustments to reconcile net income (loss) to net cash provided by (used in) operating activities:\nDepreciation\nStock-based compensation\n3,938\n3,711\nAmortization of warrant issuance costs\n-\nDeferred income taxes\n(9,049\n)\n-\nChanges in assets and liabilities:\nPrepaid expenses and other assets\nAccounts payable and accrued liabilities\n(692\n)\nOther liabilities\n(193\n)\nAccrued payroll and related expenses\n(67\n)\nAccrued licensing costs\n9,438\n-\nAccounts receivable\n(3\n)\nPrepaid income taxes\n(2,905\n)\n(396\n)\nNet cash provided by (used in) operating activities\n281,389\n(15,080\n)\nCash flows from investing activities:\nPurchase of property and equipment\n-\n(14\n)\nPurchase of investments\n(33,065\n)\n(5,784\n)\nProceeds from sale or maturity of investments\n7,112\n5,192\nNet cash used in investing activities\n(25,953\n)\n(606\n)\nCash flows from financing activities:\nProceeds from exercise of options\n1,046\nProceeds from sale of common stock\n4,488\n10,539\nPayment of dividends on common stock\n(70,841\n)\n-\nPayments on payroll taxes on cashless vesting of RSUs\n(356\n)\n(145\n)\nNet cash (used in) provided by financing activities\n(65,663\n)\n11,210\nNet increase (decrease) in cash and cash equivalents\n189,773\n(4,476\n)\nCash and cash equivalents, beginning of period\n3,135\n7,611\nCash and cash equivalents, end of period\n$\n192,908\n$\n3,135\nCash paid for income taxes\n$\n38,977\n$\nSee accompanying notes to consolidated financial statements.\nIndex\nVirnetX Holding Corporation\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands except share, per share and per device amounts)\nNote 1 − Formation and Business of the Company\nVirnetX Holding Corporation, which we refer to as” we”, “us”, “our”, “the Company” or “VirnetX”, is engaged in the business of commercializing a portfolio of patents. We seek to license our technology, including GABRIEL Connection Technology™, to various original equipment manufacturers, or OEMs, that use our technologies in the development and manufacturing of their own products within the IP-telephony, mobility, fixed-mobile convergence, and unified communications markets. Prior to 2012 our revenue was limited to an insignificant amount of software royalties pursuant to the terms of a single license agreement. During 2012, 2013 and 2020 we had revenues from settlements of patent infringement disputes whereby we received consideration for past sales of licensees that utilized our technology, where there was no prior patent license agreement (see “Revenue Recognition”).\nOur portfolio of intellectual property is the foundation of our business model. We currently own approximately 194 total patents and pending applications, including 70 U.S. patents/patent applications and 124 foreign patents/validations/pending applications. Our patent portfolio is primarily focused on securing real-time communications over the Internet, as well as related services such as the establishment and maintenance of a secure domain name registry. Our patented methods also have additional applications in the key areas of device operating systems and network security for Cloud services, M2M communications in areas of Smart City, Connected Car and Connected Home. The subject matter of all our U.S and foreign patents and pending applications relates generally to securing communications over the Internet and such covers all our technology and other products. Our issued U.S. and foreign patents expire at various times during the period from 2020 to 2024. Some of our issued patents and pending patent applications were acquired by our principal operating subsidiary; VirnetX, Inc., from Leidos, (f/k/a Science Applications International Corporation or SAIC) in 2006 and we are required to make payments to Leidos, based on cash or certain other values generated from those patents. The amount of such payments depends upon the type of value generated, and certain categories are subject to maximums and other limitations.\nNote 2 − Summary of Significant Accounting Policies\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reported period. The critical accounting policies we employ in the preparation of our consolidated financial statements are those which involve impairment of long-lived assets, income taxes, fair value of financial instruments and stock-based compensation.\nUse of Estimates\nWe prepare our consolidated financial statements in accordance with accounting principles generally accepted in the U.S. (“U.S. GAAP”). In doing so, we have to make estimates and assumptions that affect our reported amounts of assets, liabilities, revenues, and expenses, as well as related disclosure of contingent assets and liabilities. In some cases, we could reasonably have used different accounting policies and estimates. In some cases, changes in the accounting estimates are reasonably likely to occur from period to period. Accordingly, actual results could differ materially from our estimates. To the extent that there are material differences between these estimates and actual results, our financial condition or results of operations will be affected. We base our estimates on past experience and other assumptions that we believe are reasonable under the circumstances, and we evaluate these estimates on an ongoing basis. We refer to accounting estimates of this type as critical accounting policies and estimates, which we discuss further below. We have reviewed our critical accounting policies and estimates with the audit committee of our board of directors.\nBasis of Consolidation\nThe consolidated financial statements include the accounts of VirnetX Holding Corporation and our wholly owned subsidiaries. All intercompany balances and transactions have been eliminated.\nIndex\nLeases\nThe Company determines if an arrangement is a lease at inception in accordance with Accounting Standards Codification (“ASC”) Topic 842. Operating lease right-of-use (“ROU”) assets are included in Prepaid expense, and other assets on the Consolidated Balance Sheet. ROU assets represent the Company’s right to use an underlying asset for the lease term and lease liabilities represent the Company’s obligation to make lease payments arising from the lease. ROU assets and lease liabilities are recognized at the commencement date based on the present value of lease payments over the lease term (see Note 13 - Leases).\nRevenue Recognition\nThe Company derives revenue from licensing and royalty fees from contracts with customers which often span several years. We account for this revenue in accordance with Accounting Standards Codification Topic 606, Revenue from Contracts with Customers. A performance obligation is a promise in a contract to transfer a distinct good or service to the customer. A contract’s transaction price is allocated to each distinct performance obligation and recognized as revenue when, or as, the performance obligation is satisfied. Our revenue arrangements may consist of multiple-element arrangements, with revenue for each unit of accounting recognized as the product or service is delivered to the customer.\nWith the licensing of our patents, performance obligations are generally satisfied at a point in time as work is complete when our patent rights are transferred to our customers. We generally have no further obligation to our customers regarding our technology.\nCertain contracts may require our customers to enter into a hosting arrangement with us and for these arrangements, revenue is recognized over time, generally over the life of the servicing contract.\nThe Company actively monitors and enforces its intellectual property (“IP”) rights, including seeking appropriate compensation from third parties that utilize the Company’s IP without a license. As a result, the Company may, from time to time, receive payments as part of a settlement or compensation for a patent infringement dispute. Proceeds received are allocated to each element identified in the settlement or compensation, based on the fair value of each element. Generally, settlements and compensation may include the following elements: the value of a license or royalty agreement, cost reimbursement, damages, and interest. Elements identified related to licensing and royalty are recognized as revenue. Elements identified as reimbursed costs are generally recorded as a reduction to the reported expenses. Elements identified as damages or interest are generally recorded in other income in the condensed consolidated statement of operations. During the year ended December 31, 2020, the Company collected a lump sum payment of $454,034 from Apple, Inc., because of a favorable court decision relating to a patent infringement case. The court decision identified the following as the basis of the award: $302,428 for past royalties, $41,271 in damages for willful infringement, $108,221 for interest, and $2,114 in reimbursement for court costs and attorney’s fees (see Note 12 - Litigation). Elements of the payment were recognized in the Company’s condensed consolidated statement of operations as follows:\nClassification of Payment Received in the Company’s Condensed Consolidated Statement of Operations\nYear Ended:\nDecember 31, 2020\nRevenue (royalties)\n$\n302,428\nOperating expenses: selling, general and administrative (reimbursed litigation costs)\n2,114\nOther income: gain (willful infringement)\n41,271\nOther income: interest income (pre- and post-judgment interest)\n108,221\nTotal cash received\n$\n454,034\nLicensing Costs\nIncluded in operating expenses for the year ended December 31, 2020, is $90,101 in licensing costs we incurred in conjunction with the proceeds received from Apple Inc., pursuant to a favorable court decision relating to a patent infringement case.\nContingent Gains\nWe recognize gain contingencies in accordance with ASC 450-30-25 which prohibits recognition of contingent gains until realized. Accordingly, we do not record contingent gains ahead of such realization. Management generally considers any such gains as realized only upon the collection of cash.\nIndex\nCash and Cash Equivalents\nWe consider all highly liquid investments purchased with original maturities of three months or less at the date of purchase to be cash equivalents. Our cash and cash equivalents are not subject to significant interest rate risk due to the short maturities of these investments.\nInvestments\nInvestments are classified as available-for-sale and are recorded at fair market value. Unrealized gains and losses are reported as other comprehensive income. Realized gains and losses are recorded in income in the period they are realized using specific identification of each security’s cost basis. We invest our excess cash primarily in highly liquid debt instruments including corporate, government and federal agency securities, with contractual maturities less than two years. By policy, we limit the amount of credit exposure to any one issuer.\nProperty and Equipment\nProperty and equipment are stated at historical cost, less accumulated depreciation, and amortization. Depreciation and amortization are computed using the accelerated and straight-line methods over the estimated useful lives of the assets, which range from five to seven years. Repair and maintenance costs are charged to expense as incurred.\nConcentration of Credit Risk and Other Risks and Uncertainties\nOur cash and cash equivalents are primarily maintained at two major financial institutions in the United States. Deposits held with these financial institutions may exceed the amount of insurance provided on such deposits. A portion of those balances are insured by the Federal Deposit Insurance Corporation, or FDIC. During the year ended December 31, 2020 and 2019, we had, at times, funds that were uninsured. We do not believe that we are subject to any unusual financial risk beyond the normal risk associated with commercial banking relationships. We have not experienced any losses on our deposits of cash and cash equivalents.\nFair Value\nThe carrying amounts of our financial instruments, including cash equivalents, accounts payable, and accrued liabilities, approximate fair value because of their generally short maturities.\nIntangible Assets\nWe record intangible assets at cost, less accumulated amortization. Amortization of intangible assets is provided over their estimated useful lives, which can range from 3 to 15 years, on either a straight-line basis or as revenue is generated by the assets.\nImpairment of Long-Lived Assets\nWe identify and record impairment losses on long-lived assets used in operations when events and changes in circumstances indicate that the carrying amount of an asset might not be recoverable, but not less than annually. Recoverability is measured by comparison of the anticipated future net undiscounted cash flows to the related assets’ carrying value. If such assets are considered to be impaired, the impairment to be recognized is measured by the amount by which the carrying amount of the assets exceeds the projected discounted future net cash flows arising from the asset.\nResearch and Development\nResearch and development costs include expenses paid to outside development consultants and compensation related expenses for our engineering staff. Research and development costs are expensed as incurred.\nIncome Taxes\nWe account for income taxes using the asset and liability method. The asset and liability method requires the recognition of deferred tax assets and liabilities for expected future tax consequences of temporary differences that currently exist between the tax basis and financial reporting basis of our assets and liabilities. We calculate current and deferred tax provisions based on estimates and assumptions that could differ from actual results reflected on the income tax returns filed during the following years. Adjustments based on filed returns are recorded when identified in the subsequent years. The effect on deferred taxes for a change in tax rates is recognized in income in the period that the tax rate change is enacted. In assessing our deferred tax assets, we consider whether it is more likely than not that all or some portion of the deferred tax assets will not be realized.\nIndex\nA valuation allowance is provided for deferred income tax assets when, in our judgment, based upon currently available information and other factors, it is more likely than not that all or a portion of such deferred income tax assets will not be realized. The determination of the need for a valuation allowance is based on an on-going evaluation of current information including, among other things, historical operating results, estimates of future earnings in different taxing jurisdictions and the expected timing of the reversals of temporary differences. We believe the determination to record a valuation allowance to reduce a deferred income tax asset is a significant accounting estimate because it is based, among other things, on an estimate of future taxable income in the United States and certain other jurisdictions, which is susceptible to change and may or may not occur, and because the impact of adjusting a valuation allowance may be material. In determining when to release the valuation allowance established against our net deferred income tax assets, we consider all available evidence, both positive and negative. Due to the 2020 income, we have released the valuation allowance against federal net deferred tax assets, and we maintain a partial valuation allowance against the state net operating loss and credit carryovers due to lack of income in California. We continually assess our ability to generate sufficient taxable income during future periods in which our deferred tax assets may be realized. If and when we believe it is more likely than not that we will recover our deferred tax assets, we will reverse the valuation allowance as an income tax benefit in our statements of operations.\nWe account for our uncertain tax positions in accordance with U.S. GAAP. The U.S. GAAP method of accounting for uncertain tax positions utilizes a two-step approach to evaluate tax positions. Step one, recognition, requires evaluation of the tax position to determine if based solely on technical merits it is more likely than not to be sustained upon examination. Step two, measurement, is addressed only if a position is more likely than not to be sustained. In step two, the tax benefit is measured as the largest amount of benefit, determined on a cumulative probability basis, which is more likely than not to be realized upon ultimate settlement with tax authorities. If a position does not meet the more likely than not threshold for recognition in step one, no benefit is recorded until the first subsequent period in which the more likely than not standard is met, the issue is resolved with the taxing authority, or the statute of limitations expires. Positions previously recognized are derecognized when we subsequently determine the position no longer is more likely than not to be sustained. Evaluation of tax positions, their technical merits, and measurements using cumulative probability are highly subjective management estimates. Actual results could differ materially from these estimates.\nStock-Based Compensation\nWe account for stock-based compensation using the fair value recognition method in accordance with U.S. GAAP. We recognize these compensation costs on a straight-line basis over the requisite service period of the award, which is generally the vesting term of 4 years. We do not estimate the forfeiture rate and recognize forfeitures, if any, when they occur. See Note 6 - Stock-Based Compensation below for additional information concerning our share-based compensation awards.\nIn addition, as required we record stock-based compensation expense for awards granted to non-employees at fair value of the consideration received or the fair value of the equity instruments issued as they vest over the performance period.\nEarnings per Share\nBasic earnings per share are computed by dividing earnings available to common stockholders by the weighted average number of outstanding common shares during the period. Diluted earnings per share is computed by dividing net income by the weighted average number of shares outstanding during the period increased to include the number of additional shares of common stock that would have been outstanding if the potentially dilutive securities had been issued. During 2019 we incurred losses; therefore, the effect of any common stock equivalent would be anti-dilutive during the year.\nNew Accounting Pronouncements\nIn December 2019, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) 2019-12 Income Taxes (Topic 740). The amendments in this ASU simplify the accounting for income taxes by removing certain exceptions to the general principles in Topic 740. The amendments also improve consistent application of and simplify U.S. GAAP for other areas of Topic 740 by clarifying and amending existing guidance. The amendments in this ASU are effective for fiscal years, and interim periods within those fiscal years, beginning after December 15, 2020. We are currently evaluating the impact, if any this ASU will have on our consolidated financial statements and related disclosures.\nIndex\nIn June 2016, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) 2016-13, Measurement of Credit Losses on Financial Instruments, and issued subsequent amendments to the initial guidance within ASU 2019-04 and ASU 2019-05 (collectively, “ASU 2016-13”). The amendments in ASU 2016-13 replace the incurred loss impairment methodology with the current expected credit loss model, which requires consideration of a broader range of reasonable and supportable information to estimate credit losses. The Company adopted this ASU effective January 1, 2020 and the adoption did not have a material impact on the Company’s financial position, results of operations or cash flows.\nNote 3 − Property and Equipment\nOur major classes of property and equipment were as follows:\nDecember 31\nOffice furniture\n$\n$\nComputer equipment\nTotal\nLess accumulated depreciation\n(149\n)\n(144\n)\nTotal property and equipment, net\n$\n$\nDepreciation expense for the years ended December 31, 2020 and 2019 was $5, and $7, respectively.\nNote 4 − Commitments, Contingencies and Related Party Transactions\nWe lease our offices under an operating lease with a third party expiring in October 2021. We recognize rent expense on a straight-line basis over the term of the lease. Rent expense was $56, for each of the years ended December 31, 2020, and 2019. Future minimum rents due under the lease total $46 in 2021, when the lease expires.\nWe entered into a service agreement for the use of an aircraft from K2 Investment Fund LLC (“LLC”) for business travel for employees of the Company. We incurred approximately $324 and $1,790 in rental fees and reimbursements to the LLC during the years ended December 31, 2020 and 2019, respectively. We pay for the Company’s usage of the aircraft and have no rights to purchase. Our Chief Executive Officer and Chief Administrative Officer are the managing partners of the LLC and control the equity interests of the LLC. We entered into a 12-month non-exclusive agreement with the LLC for use of the plane at a rate of $8 per flight hour, with no minimum usage requirement. The agreement contains other terms and conditions normal in such transactions and can be cancelled by either us or the LLC with 30 days’ notice. The agreement renews on an annual basis unless terminated by either party. Neither party has exercised their termination rights.\nNote 5 − Stock Plan\nWe have a stock incentive plan for employees and others called the VirnetX Holding Corporation 2013 Equity Incentive Plan (the “2013 Plan”), which has been approved by our stockholders. To the extent that any award should expire, become un-exercisable or is otherwise forfeited, the shares subject to such award will again become available for issuance under the 2013 Plan. The 2013 Plan provides for the granting of stock options and restricted stock units purchase rights (“RSUs”) to our employees and consultants. Stock options granted under the 2013 Plan may be incentive stock options or nonqualified stock options. Incentive stock options (“ISOs”) may only be granted to our employees (including officers and directors). Nonqualified stock options (“NSOs”) and stock purchase rights may be granted to our employees and consultants.\nThe 2013 Plan will expire in 2023. Options may be granted under the 2013 Plan with an exercise price determined by our Board of Directors, or a duly appointed committee thereof, provided, however, that the exercise price of an option granted to any employee shall be not less than 100% of the fair market value at the date of grant in the case of ISOs or 85% of the fair market value at the date of grant in the case of an NSO. The exercise price of an ISO or NSO granted to one of our Named Executive Officers shall not be less than 100% fair market value of the shares at the date of grant and the exercise price of an ISO granted to a 10% shareholder shall not be less than 110% of the fair market value of the shares on the date of grant. Stock options granted under the 2013 Plan typically vest over four years and have a 10-year term. All RSUs are considered to be granted at the fair value of our stock on the date of grant because they have no exercise price. RSUs typically vest over four years. At December 31, 2020, there were 545,210 shares available for grant under the 2013 Plan.\nIndex\nNote 6 − Stock-Based Compensation\nThe following tables summarize information about stock options and RSUs outstanding at December 31, 2020:\nOptions Outstanding\nOptions Vested and Exercisable\nRange of\nExercise Prices\nNumber\nOutstanding\nWeighted\nAverage\nRemaining\nContractual\nLife (Years)\nWeighted\nAverage\nExercise\nPrice\nNumber\nExercisable\nWeighted\nAverage\nRemaining\nContractual\nLife (Years)\nWeighted\nAverage\nExercise\nPrice\n$ 2.35 -  6.95 \n4,558,896\n7.04\n$\n4.53\n3,147,625\n6.47\n$\n4.26\n$ 14.52 - 35.25 \n1,253,625\n1.71\n$\n23.16\n1,253,625\n1.71\n$\n23.16\n5,812,521\n5.89\n$\n8.62\n4,401,250\n5.11\n$\n9.64\nThe following tables summarize activity under the Plan for the indicated periods:\nOptions\nNumber of\nShares\nWeighted\nAverage\nExercise\nPrice\nWeighted\nAverage\nRemaining\nContractual\nLife (Years)\nAggregate\nIntrinsic\nValue\nOutstanding at December 31, 2018\n5,998,837\n$\n7.72\n-\n$\n-\nOptions granted\n345,000\n6.06\n-\n-\nOptions exercised\n(663,816\n)\n1.23\n-\n-\nOptions cancelled\n(50,000\n)\n4.95\n-\n-\nOutstanding at December 31, 2019\n5,630,021\n$\n8.49\n6.11\n$\nOptions granted\n747,500\n6.07\n-\n-\nOptions exercised\n(262,031\n)\n3.99\n-\n-\nOptions cancelled\n(302,969\n)\n5.30\n-\n-\nOutstanding at December 31, 2020\n5,812,521\n$\n8.55\n5.89\n$\n3,650\nOptions exercisable at December 31, 2020\n4,401,250\n$\n9.64\n5.11\n$\n2,927\nRSUs\nNumber of\nRSUs\nWeighted\nAverage\nGrant Date\nFair Value\nAggregate\nIntrinsic\nValue\nOutstanding at December 31, 2018\n504,994\n$\n3.83\n$\n-\nRSUs granted\n229,996\n6.06\n-\nRSUs vested\n(207,334\n)\n4.07\n-\nRSUs cancelled\n(29,167\n)\n4.65\nOutstanding at December 31, 2019\n498,489\n$\n4.71\n$\nRSUs granted\n218,329\n6.89\n-\nRSUs vested\n(212,495\n)\n4.63\n-\nOutstanding at December 31, 2020\n504,323\n$\n5.69\n$\nIntrinsic value is calculated as the difference between the per-share market price of our common stock on the last trading day of 2020, which was $5.04 and the exercise price of the options. For options exercised, the intrinsic value is the difference between market price and the exercise price on the date of exercise. We received cash proceeds of $1,046 and $816 from stock options exercised in 2020 and 2019, respectively. The total intrinsic value of options exercised was $151 and $2,473 during the years ended December 31, 2020 and 2019, respectively.\nStock-based compensation expense is included in operating expense for each period as follows:\nStock-Based Compensation by Type of Award\nYear Ended\nDecember 31, 2020\nYear Ended\nDecember 31, 2019\nStock options\n$\n2,872\n$\n2,756\nRSUs\n1,066\nTotal stock-based compensation expense\n$\n3,938\n$\n3,711\nIndex\nAs of December 31, 2020, there was $5,249 of unrecognized stock-based compensation expense related to unvested employee stock options and $2,215 of unrecognized stock-based compensation expense related to unvested RSUs. These costs are expected to be recognized over a weighted-average period of 2.24 and 2.33 years, respectively.\nThe fair value of each option grant was estimated on the date of grant using the Black-Scholes option pricing model using the following weighted average assumptions:\nYear Ended\nDecember 31, 2020\nYear Ended\nDecember 31, 2019\nExpected stock price volatility\n93.45\n%\n92.34\n%\nRisk-free interest rate\n0.63\n%\n2.09\n%\nExpected life term\n6.21 years\n6.14 years\nExpected dividends\n%\n%\nBased on the Black-Scholes option pricing model, the weighted average estimated fair value of employee stock options granted was $4.62 and $4.63 per share during the years ended December 31, 2020 and 2019, respectively.\nThe expected life was determined using the simplified method outlined in ASC 718, “Compensation - Stock Compensation”. Expected volatility of the stock options was based upon historical data and other relevant factors. We have not provided an estimate for forfeitures because we have had nominal forfeited options and RSUs and believed that all outstanding options and RSUs at December 31, 2020, would vest.\nNote 7 − Earnings Per Share\nBasic earnings per share are based on the weighted average number of shares outstanding for a period. Diluted earnings per share are based upon the weighted average number of shares and potentially dilutive common shares outstanding. Potential common shares outstanding principally include stock options and RSUs under our stock plan and warrants. During 2019, we incurred losses; therefore, the effect of any common stock equivalent would be anti-dilutive during the year.\nThe table below sets forth the basic and diluted loss per share calculations:\nNet income (loss)\n$\n280,429\n$\n(19,180\n)\nBasic weighted average number of shares outstanding\n70,850\n68,564\nEffect of dilutive securities\n-\nDiluted weighted average number of shares outstanding\n71,616\n68,564\nBasic earnings (loss) per share\n$\n3.96\n$\n(0.28\n)\nDiluted earnings (loss) per share\n$\n3.92\n$\n(0.28\n)\nNote 8 − Common Stock\nEach share of common stock has the right to one vote. The holders of common stock are entitled to receive dividends whenever funds are legally available and when declared by our Board of Directors, subject to the prior rights of holders of all classes of stock outstanding having priority rights as to dividends. Our restated articles of incorporation authorize us to issue up to 100,000,000 shares of $0.0001 par value common stock.\nOn July 30, 2018 we filed a $100,000 universal shelf registration statement on SEC Form S-3. This replacement registration statement was declared effective by the SEC on August 16, 2018. We also entered a new ATM with Cowen on August 31, 2018, under which we could offer and sell shares of our common stock having an aggregate value of up to $50,000.\nWe use the ATM proceeds for GABRIEL product development and marketing, and general corporate purposes, which may include working capital, capital expenditures, other corporate expenses and acquisitions of complementary products, technologies, or businesses. As of December 31, 2020, common stock with an aggregate value of up to $21,964 remained available for offer and sale under the ATM agreement.\nIndex\nWe sold 1,049,382 and 1,860,483 shares of common stock under the ATM program during the years ended December 31, 2020 and 2019, respectively. The average sales price per common share sold during the year ended December 31, 2020 was $4.41 and the aggregate proceeds from the sales totaled $4,627 during the period. Sales commissions, fees and other costs associated with the ATM transactions totaled $139 for 2020. The average sales price per common share sold during the year ended December 31, 2019 was $5.84 and the aggregate proceeds from the sales totaled $10,866 during the period. Sales commissions, fees and other costs associated with the ATM transactions totaled $326 for 2019.\nDividends\nOn May 8, 2020, we declared a one-time cash dividend to shareholders of record as of the close of business on May 18, 2020 of $1 per share of common stock, payable on May 26, 2020. The timing and amounts of future dividends, if any, will depend on market conditions, corporate business and financial considerations and regulatory requirements.\nWarrants\nIn 2020, we issued warrants for the purchase of 25,000 shares of common stock at an exercise price of $5.75 per share, exercisable on the date of grant expiring in April 2025. The weighted average fair value at the grant date was $4.16 per warrant. The fair value at the grant date was estimated utilizing the Black-Scholes valuation model with the following weighted average assumptions (i) dividend yield on our common stock of 0 percent (ii) expected stock price volatility of 97 percent (iii) a risk-free interest rate of 0.27 percent and (iv) and expected option term of 5 years.\nWarrants Issued\nExercise\nPrice\nOutstanding and\nExercisable\nDecember 31, 2019\nIssued\nExercised\nTerminated /\nCancelled\nOutstanding and Exercisable\nDecember 31, 2020\nExpiration Date\n25,000\n$7.00\n25,000\n-\n-\n(25,000)\n-\nApril 30, 2020\n25,000\n$5.75\n-\n25,000\n-\n-\n25,000\nApril 30, 2025\n-\n25,000\n25,000\n-\n(25,000)\n25,000\n-\nNote 9 − Employee Benefit Plan\nWe sponsor a defined contribution 401k plan covering substantially all our employees. Our matching contribution to the plan was approximately $112 and $101 in 2020 and 2019, respectively.\nNote 10 − Income Taxes\nThe income tax provision (benefit) is comprised of the following:\nYear Ended\nDecember 31, 2020\nYear Ended\nDecember 31, 2019\nCurrent:\nFederal\n$\n35,122\n$\n-\nState\n(393\n)\n36,072\n(393\n)\nDeferred:\nFederal\n(8,816\n)\n-\nState\n(233\n)\n-\n(9,049\n)\n-\nTotal income tax provision (benefit)\n$\n27,023\n$\n(393\n)\nA reconciliation of the United States federal statutory income tax rate to our effective income tax rate is as follows:\nYear Ended\nDecember 31, 2020\nYear Ended\nDecember 31, 2019\nUnited States federal statutory rate\n21.00\n%\n21.00\n%\nState taxes, net of federal benefit\n0.17\n%\n1.99\n%\nValuation allowance\n(12.22\n)%\n(21.96\n)%\nStock based compensation\n(0.01\n)%\n-\nR&D Credit\n(0.21\n)%\n1.34\n%\nOther\n0.06\n%\n(0.38\n)%\nEffective income tax rate\n8.79\n%\n1.99\n%\nThe Company’s effective tax rate for both 2020 and 2019 was lower than the statutory federal income tax rate primarily due to the change of valuation allowance. Due to the income in 2020, our valuation allowance against federal net deferred tax assets was fully released in 2020. We continue to provide partial valuation allowance against California net operating loss and research credit carryovers due to the fact that we have no income in California.\nIndex\nDeferred tax assets (liabilities) consist of the following:\nAs of\nDecember 31, 2020\nAs of\nDecember 31, 2019\nDeferred tax assets:\nReserves and accruals\n$\n$\nResearch and development credits and other credits\n1,730\nNet operating loss carry forward\n27,907\nStock based compensation\n8,998\n8,402\nOther\nTotal deferred tax assets\n$\n9,660\n$\n38,112\nValuation allowance\n(611\n)\n(38,112\n)\nDeferred tax assets after valuation allowance\n9,049\n-\nTotal deferred tax liability\n-\n-\nNet deferred tax assets\n$\n9,049\n$\n-\nIn 2020 and 2019, we had pre-tax income of $307,452 and pre-tax losses of $19,573, respectively. At December 31, 2020, we had federal and state net operating loss carryforwards of approximately $0 and $107,989, respectively. All of the federal net operating loss carryforwards has been utilized to offset taxable income in 2020. The state net operating loss carryforward will be expiring beginning in 2029.\nA valuation allowance is provided for deferred tax assets when, in our judgment, based upon currently available information and other factors, it is more likely than not that all or a portion of such deferred income tax assets will not be realized. The determination of the need for a valuation allowance is based on an on-going evaluation of current information including, among other things, historical operating results, estimates of future earnings in different taxing jurisdictions and the expected timing of the reversals of temporary differences. We believe the determination to record, or reduce, a valuation allowance associated with a deferred income tax asset is a significant accounting estimate because it is based, among other things, on an estimate of future taxable income in the United States and certain other jurisdictions, which is susceptible to change and may or may not occur, and because the impact of adjusting a valuation allowance may be material. In determining when to release the valuation allowance established against our net deferred income tax assets, we consider all available evidence, both positive and negative.\nInternal Revenue Code Section 382 places a limitation on the amount of net operating loss carryforwards that can be used to offset taxable income after a change in control (generally greater than 50% change in ownership) of a loss corporation. California, the state in which our headquarters was once located, has similar rules. Since the Company did not have a greater than 50% change of control as defined under the Internal Revenue Code, no limitation applies to the Company’s Net Operating Losses.\nWe are required to recognize the financial statement effects of a tax position when it is more likely than not, based on the technical merits, that the position will be sustained upon examination. In 2019, we released all ASC 740-10 uncertain tax positions due to the expiring of the statute of limitation. At December 31, 2020, we have no uncertain tax positions.\nOur tax years for 2005 and forward are subject to examination by the U.S. tax authority and various state tax authorities. These years are open due to NOLs and tax credits generated in these years were utilized in 2020. The statute of limitation for these years shall expire three years after the date of filing 2020 income tax returns.\nOur policy is to recognize interest and penalties, if any, accrued on any unrecognized tax benefits, as a component of income tax expense. We had no interest or penalties accrued for the year ended December 31, 2020 or 2019.\nIndex\nReconciliation of provision for uncertain tax position discussed above:\nYear Ended\nDecember 31, 2020\nYear Ended\nDecember 31, 2019\nBalance at the beginning of the year\n$\n-\n$\nAdditions based on tax positions related to the current year\n-\n-\nAdditions for tax positions of prior years\n-\n-\nSettlements\n-\n-\nLapse of applicable statute of limitations\n-\n(316\n)\nBalance at the end of the year\n$\n-\n$\n-\nNote 11 − Fair Value Measurement\nWe apply fair value accounting for all financial assets and liabilities and non-financial assets and liabilities that are recognized or disclosed at fair value in the financial statements on a recurring basis. Fair value is estimated by applying the following hierarchy, which prioritizes the inputs used to measure fair value into three levels and bases the categorization within the hierarchy upon the lowest level of input that is available and significant to the fair value measurement:\nLevel 1 - Quoted prices in active markets for identical assets or liabilities.\nLevel 2 - Observable inputs other than quoted prices in active markets for identical assets and liabilities, quoted prices for identical or similar assets or liabilities in inactive markets, or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities.\nLevel 3 - Inputs that are generally unobservable and typically reflect management’s estimate of assumptions that market participants would use in pricing the asset or liability.\nThe carrying amounts for cash and cash equivalents, investments in certificates of deposit, accounts payable and accrued expenses approximate their fair values due to the short period of time until maturity.\nMutual funds: Valued at the quoted net asset value (NAV) of shares held.\nU.S. agency and treasury securities: Fair value measured at the closing price reported on the active market on which the individual securities are traded.\nThe following table shows the adjusted cost, gross unrealized gains, gross unrealized losses, and fair value of our financial assets as of December 31, 2020 and 2019 (in thousands):\nDecember 31, 2020\nAdjusted\nCost\nUnrealized\nGains\nUnrealized\nLosses\nFair\nValue\nCash\nand Cash\nEquivalents\nInvestments\nAvailable\nfor Sale\nCash\n$\n121,785\n$\n-\n$\n-\n$\n121,785\n$\n121,785\n$\n-\nLevel 1:\nMutual funds\n70,996\n-\n-\n70,996\n70,996\n-\nU.S. agency securities\n13,767\n-\n13,769\n13,642\nU.S. treasury securities\n14,707\n-\n(1\n)\n14,706\n-\n14,706\n99,470\n(1\n)\n99,471\n71,123\n28,348\nTotal\n$\n221,255\n$\n$\n(1\n)\n$\n221,256\n$\n192,908\n$\n28,348\nDecember 31, 2019\nAdjusted\nCost\nUnrealized\nGains\nUnrealized\nLosses\nFair\nValue\nCash\nand Cash\nEquivalents\nInvestments\nAvailable\nfor Sale\nCash\n$\n2,076\n$\n-\n$\n-\n$\n2,076\n$\n2,076\n$\n-\nLevel 1:\nMutual funds\n-\n-\n-\nU.S. agency securities\n2,837\n-\n2,840\n2,394\n3,450\n-\n3,453\n1,059\n2,394\nTotal\n$\n5,526\n$\n$\n-\n$\n5,529\n$\n3,135\n$\n2,394\nThe maturities of our marketable securities generally range from within one to two years. Actual maturities could differ from contractual maturities due to call or prepayment provisions.\nIndex\nNote 12 - Litigation (all dollar amounts in this section are expressed in thousands except for rates per device)\nWe have several intellectual property infringement lawsuits pending in the United States District Court for the Eastern District of Texas, Tyler Division (“USDC”), and United States Court of Appeals for the Federal Circuit (“USCAFC”) and the Supreme Court of the United States (“SCOTUS”).\nVirnetX Inc. v. Cisco Systems, Inc. et al. (Case 6:10-CV-00417-LED) (“Apple I”)\nOn August 11, 2010, we filed a complaint against Aastra USA. Inc. (“Aastra”), Apple Inc. (“Apple”), Cisco Systems, Inc. (“Cisco”), and NEC Corporation (“NEC”) the USDC in which we alleged that these parties infringe on certain of our patents (U.S. Patent Nos. 6,502,135, 7,418,504, 7,921,211 and 7,490,151). We sought damages and injunctive relief. The cases against each defendant were separated by the judge. Aastra and NEC agreed to sign license agreements with us, and we dropped all accusations of infringement against them. A jury in USDC decided that our patents were not invalid and rendered a verdict of non-infringement by Cisco on March 4, 2013. Our motion for a new Cisco trial was denied and the case against Cisco was closed.\nOn November 6, 2012, a jury in the USDC awarded us over $368,000 for Apple’s infringement of four of our patents, plus daily interest up to the final judgment.\nApple filed an appeal of the judgment to the USCAFC. On September 16, 2014, USCAFC affirmed the USDC jury’s finding that all four of our patents at issue are valid and confirmed the USDC jury’s finding of infringement of VPN on Demand under many of the asserted claims of our ‘135 and ‘151 patents, and the USDC’s decision to allow evidence about our license and royalty rates regarding the determination of damages. However, the USCAFC vacated the USDC jury’s damages award and some of the USDC’s claim construction with respect to parts of our ‘504 and ‘211 patents and remanded the damages award and determination of infringement with respect to FaceTime back to the USDC for further proceedings.\nOn September 30, 2016, pursuant to the 2014 remand from the USCAFC, a jury in the USDC awarded us $302,400 for Apple’s infringement of four of our patents. On September 29, 2017, the USDC entered its final judgment, denied all of Apple’s post-trial motions, granted all our post-trial motions, including our motion for willful infringement and enhanced the royalty rate during the willfulness period from $1.20 to $1.80 per device, and awarded us costs, certain attorneys’ fees, and prejudgment interest. The total amount in the final judgment was $439,700, including $302,400 (jury verdict), $41,300 (enhanced damages) and $96,000 (costs, fees and interest).\nOn October 27, 2017 Apple appealed the final judgment entered on September 29, 2017 to the USCAFC. Oral arguments in this case were held on January 8, 2019. On January 15, 2019, the Court issued a Rule 36 order affirming the district court’s final judgment. Apple filed a petition for panel rehearing and rehearing en-banc in this matter on February 21, 2019. On October 1, 2019, USCAFC issued an order denying Apple’s petition. Apple filed a petition for a writ of certiorari with the SCOTUS, which was denied on February 24, 2020. Prior to the SCOTUS decision denying Apple’s petition for a writ of certiorari, on February 20, 2020, Apple filed a Rule 60(b) motion for relief from judgment with the USDC, seeking relief from the district court’s September 29, 2017 final judgment. VirnetX filed a responsive brief in opposition on March 5, 2020.\nOn March 13, 2020, the Company received payment of $454,034 from Apple, representing the previously announced final judgment with interest in this case. Apple sought payment relief by filing a motion under rule 60(b). On September 1, 2020 USDC issued an order denying Apple’s motion for relief of judgement. This case is now closed.\nVirnetX Inc. v. Apple, Inc. (Case 6:12-CV-00855-LED) (“Apple II”)\nThis case began on November 6, 2012, when we had filed a complaint against Apple in USDC in which we alleged that Apple infringed on certain of our patents, (U.S. Patent Nos. 6,502,135, 7,418,504, 7,921,211 and 7,490,151). We sought damages and injunctive relief. The accused products include the iPhone 5, iPod Touch 5th Generation, iPad 4th Generation, iPad mini, and the latest Macintosh computers; these products were not included in the Apple I case because they were released after the Apple I case was initiated. Post-trial motions hearing was held on July 18, 2018. On August 31, 2018, the USDC entered a Final Judgment and issued its Memorandum Opinion and Order regarding post-trial motions, affirming the jury’s verdict of $502,600 and granting VirnetX motions for supplemental damages, a sunset royalty and the royalty rate of $1.20 per infringing iPhone, iPad and Mac products, pre-judgment and post-judgment interest and costs. Apple filed a notice of appeal with the USCAFC in the Apple II case.\nIndex\nOn October 9, 2018, USCAFC docketed the appeal as Case No. 19-1050 - VirnetX Inc. v. Apple Inc . On January 24, 2019 Apple filed its opening brief. We filed our response brief on March 1, 2019. Apple filed its reply brief on April 5, 2019. The oral arguments were heard on October 4, 2019. On November 22, 2019, the USCAFC issued an opinion affirming the district court’s findings that Apple is precluded from making certain invalidity arguments and that Apple infringed the ’135 and ’151 patents; reversing the USDC’s finding that Apple infringed the ’504 and ’211 patents; and remanding the case for proceedings on damages. Apple sought panel and en banc rehearing, which the USCAFC denied on February 10, 2020.\nOn February 22, 2020, the USDC issued a scheduling order for the parties to brief the court about the need for a new trial for recalculating the damages. We filed our motion for entry of judgment on February 28, 2020. The arguments on this matter were heard on April 14, 2020. In its order, unsealed on May 1, 2020, the USDC denied VirnetX’s motion for entry of a new judgment based on the prior jury verdict and ordered a new jury trial on damages. On August 10, 2020, the USDC granted Apple’s motion for continuance and reset the date to October 26, 2020. On October 30, 2020, a jury returned a $502,800 verdict in favor of VirnetX based on Apple’s infringement of two network security patents: VirnetX US Patents No. 6,502,135 and No. 7,490,151. The jury verdict called for damages of $0.84 per accused device since the 2013 launch of Apple’s iOS 7 operating system and represents 598,629,580 infringing units from US sales only. On January 15, 2021, the district court denied Apple’s motion for judgment as a matter of law, and on February 4, 2021, Apple filed a notice of appeal to the USCAFC.\nVirnetX Inc. v. Mangrove Partners Master Fund, Ltd., Apple Inc. (USCAFC Case 20-2271) and VirnetX Inc. v. Mangrove Partners Master Fund, Ltd., Apple Inc., and Black Swamp, LLC (USAFC Case 20-2272)\nOn September 15, 2020, we filed with the USCAFC an appeal of the invalidity findings by the PTAB in inter-partes review proceedings IPR2015-01046 and IPR2016-00062 involving our U.S. Patent No. 6,502,135, and an appeal of the invalidity findings by the PTAB in inter partes review proceedings IPR2015-1047, IPR2016- 00063, and IPR2016-00167 involving our U.S. Patent No. 7,490,151. On September 25, 2020, the USCAFC issued an order consolidating the two appeals. On December 15, 2020, we filed a motion to vacate the PTAB decisions below and to remand these appeals to the PTAB, which remains pending. In view of our motion to remand, our deadline to file an initial brief is currently stayed.\nIancu v. Luoma (SCOTUS Case 20-74)\nOn July 23, 2020, the United States and the USPTO (collectively, “the United States”) filed a petition for a writ of certiorari from several decisions by the USAFC, including decisions in VirnetX Inc. v. Cisco Systems, Inc., Nos. 2019-1671, and VirnetX Inc. v. Iancu, Nos. 2017-2593, -2594. In those cases, the USAFC granted VirnetX’s motions to vacate the underlying decisions of the PTAB on the basis of Arthrex, Inc. v. Smith & Nephew, Inc., 941 F.3d 1320 (Fed. Cir. 2019), and remanded for further proceedings. The United States requested that the SCOTUS hold its certiorari petition pending the disposition of the United States’ separate petition in United States v. Arthrex, Inc., No. 19-1434 (filed June 25, 2020). On August 26, 2020, VirnetX filed a response, agreeing that the United States’ certiorari petition should be held pending the disposition of the petition for a writ of certiorari in No. 19-1434 (and related petitions filed by private parties in Nos. 19-1452 and 19-1458), and any further SCOTUS proceedings.\nOn October 13, 2020, SCOTUS granted the United States’ petition for a writ of certiorari in No. 19-1434 as to USAFC Case No. 2018-2140, and the petitions for writs of certiorari in Nos. 19-1452 and 19-1458, all limited to Questions 1 and 2 as set forth in the July 22, 2020 Memorandum for the United States filed in No. 19-1434. The consolidated petition is seeking review of decisions by the USCAFC holding that administrative patent judges (“APJ”) of the Patent Trial and Appeal Board of the U.S. Patent and Trademark Office must be appointed by the President and confirmed by the Senate; and, whether the remedy imposed by USCAFC that federal laws that place restrictions on when officials can be removed from office cannot apply to APJ, was the appropriate one. SCOTUS heard oral argument in these consolidated cases on March 1, 2021.\nMcKool Smith P.C. v. VirnetX, Inc., AAA Case No. 01-20-0003-7975\nOn March 23, 2020, the law firm of McKool Smith, P.C. (“McKool”) filed a Demand for Arbitration against VirnetX, Inc. with the American Arbitration Association (“AAA”). In its demand, McKool claims that a retention agreement it entered into in 2010 with VirnetX entitles it to a contingency fee arising from the recent 2020 payment made by Apple. McKool claims it is owed approximately $36,300 (or 8% of the Apple I payment). We have filed a general response with the AAA denying McKool’s claim and are contesting the matter vigorously. An evidentiary hearing was held on the matter during the week of February 22, 2021 and the parties will be submitting additional briefing. A ruling is expected sometime thereafter.\nIndex\nNeal Hurwitz v. Kendall Larsen et al. (Case 2020-0425-JRS)\nOn June 2, 2020, stockholder Neal Hurwitz filed a verified derivative complaint in the Delaware Court of Chancery against Kendall Larsen, Robert D. Short Ill, Gary Feiner, Michael F. Angelo, and Thomas M. O’Brien and naming the Company as nominal defendant. The lawsuit alleges breaches of fiduciary duty, corporate waste, and unjust enrichment arising out of a series of previously-disclosed transactions and compensation awards and seeks an award of monetary damages and equitable relief. On July 1, 2020, the defendants filed a motion to dismiss the complaint based on a failure to plead demand futility and a failure to state a claim on which relief can be granted and, on August 19, 2020, the defendants filed an opening brief in support of their motion to dismiss. On October 16, 2020, plaintiff amended his complaint rather than respond to the arguments in the defendants’ opening brief. On October 23, 2020, the defendants filed a renewed motion to dismiss plaintiff’s amended complaint based on a failure to plead demand futility and a failure to state a claim on which relief can be granted. On January 12, 2021, Hurwitz voluntarily dismissed his suit without prejudice.\nOther Legal Matters\nOne or more potential intellectual property infringement claims may also be available to us against certain other companies who have the resources to defend against any such claims. Although we believe these potential claims are likely valid, commencing a lawsuit can be expensive and time-consuming, and there is no assurance that we could prevail on such potential claims if we made them. In addition, bringing a lawsuit may lead to potential counterclaims which may distract our management and our other resources, including capital resources, from efforts to successfully commercialize our products.\nCurrently, we are not a party to any other pending legal proceedings and are not aware of any proceeding threatened or contemplated against us.\nNote 13 - Leases\nWe lease office space under an operating lease which expires on October 31, 2021. At December 31, 2020, the underlying ROU asset and lease liability totaled $44. At December 31, 2019, the underlying ROU asset and lease liability totaled $97. Lease expense totaled $56 in both 2020 and 2019.\nWe also lease a facility for corporate promotional and marketing purposes which was prepaid at inception and originally expired in 2024. In September 2020, the lease was extended for one year to 2025, due to COVID use-restrictions in 2020. No other terms of the original agreement were affected and there was no impact on cash flow. At December 31, 2020 and 2019, the ROU asset totaled $1,248 and $1,604, respectively; lease expense totaled $356 and $385, during 2020 and 2019, respectively.\nIndex\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nStockholders of VirnetX Holding Corporation\nOpinion on Internal Control over Financial Reporting\nWe have audited VirnetX Holding Corporation’s (the Company’s) internal control over financial reporting as of December 31, 2020, based on criteria established in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2020, based on criteria established in Internal Control-Integrated Framework (2013) issued by COSO.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets and the related consolidated statements of operations, comprehensive income (loss), stockholders’ equity, and cash flows of the Company, and our report dated March 16, 2021, expressed an unqualified opinion.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Farber Hass Hurley LLP\nChatsworth, California\nMarch 16, 2021\nIndex",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nUnder the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, we conducted an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended, December 31, 2020.\nThe purpose of this evaluation was to determine whether as of December 31, 2020 our disclosure controls and procedures were effective to provide reasonable assurance that the information we are required to disclose in our filings with the SEC, (i) is recorded, processed, summarized and reported within the time periods specified in the SEC’s rules and forms and (ii) accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosure.\nBased on their evaluation, our Chief Executive Officer and Chief Financial Officer have concluded that as of December 31, 2020, our disclosure controls and procedures were effective.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal controls over financial reporting (as such term is defined in rules 13a-15(f) under the Securities Exchange Act of 1934, as amended) during the fiscal year ended December 31, 2020 that have materially affected, or are reasonably likely to materially affect, our internal controls over financial reporting.\nManagement’s Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting for the Company. Internal control over financial reporting is a process to provide reasonable assurance regarding the reliability of our financial reporting for external purposes in accordance with accounting principles generally accepted in the United States of America. Internal control over financial reporting includes maintaining records that in reasonable detail accurately and fairly reflect our transactions; providing reasonable assurance that transactions are recorded as necessary for preparation of our financial statements; providing reasonable assurance that receipts and expenditures of Company assets are made in accordance with management authorization; and providing reasonable assurance that unauthorized acquisition, use or disposition of Company assets that could have a material effect on our financial statements would be prevented or detected on a timely basis. Because of its inherent limitations, internal control over financial reporting is not intended to provide absolute assurance that a misstatement of our financial statements would be prevented or detected.\nManagement conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation, management concluded that the Company’s internal control over financial reporting was effective as of December 31, 2020. There were no changes in our internal control over financial reporting during the period ended December 31, 2020 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Farber Hass Hurley LLP has audited our internal control over financial reporting as of December 31, 2020; their report is included elsewhere herein.",
    "item_9B": "Item 9B. Other Information\nNone.\nIndex\nPART III",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nThe information required by this item will be contained in our definitive proxy statement to be filed with the SEC in connection with our 2020 Annual Meeting of Stockholders (the “Proxy Statement”), which is expected to be filed not later than 120 days after the end of our fiscal year ended December 31, 2020 and is incorporated in this report by reference.",
    "item_11": "Item 11. Executive Compensation\nThe information required by this item will be set forth in the Proxy Statement and is incorporated herein by reference.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this item will be set forth in the Proxy Statement and is incorporated herein by reference.\nSecurities Authorized for Issuance Under the Equity Compensation Plans\nWe have a stock incentive plan for employees and others called the “VirnetX Holding Corporation 2013 Stock Plan”, or the Plan, which has been approved by our stockholders. The Plan provides for the granting of up to 16,624,469 shares of our common stock, including stock options and restricted stock units, and will expire in 2023. As of December 31, 2020, there were 545,210 shares available to be granted under the Plan. We had 5,812,521 and 5,630,021 options outstanding at December 31, 2020 and December 31, 2019, respectively, with an average exercise price of $8.55 and $8.49, respectively. We had 504,323 and 498,489 restricted stock units outstanding at December 31, 2020 and December 31, 2019, respectively, with a weighted average grant price of $5.69 and $4.71, respectively.\nPlan Category\nNumber of\nSecurities to be\nIssued Upon\nExercise of\nOutstanding\nOptions and\nRSUs\nWeighted-Average\nExercise Price of\nOutstanding\nOptions and RSUs\nNumber of\nSecurities\nRemaining\nAvailable for\nFuture Issuance\nUnder Equity\nCompensation\nPlans\nEquity compensation plans approved by security holders\n6,316,844\n$\n8.32\n545,210\nEquity compensation plans not approved by security holders\n-\n-\nTotal\n6,316,844\n$\n8.32\n545,210\nOn March 19, 2020, the Compensation Committee granted 240,000 options to the employees of VirnetX, Inc. On April 2, 2020, the Compensation Committee granted 50,000 options to an employee of VirnetX Inc. On May 29, 2020, the Compensation Committee granted 37,500 options and 24,999 RSUs to members of the Board of Directors of VirnetX, Inc. On June 3, 2020, the Compensation Committee granted 290,000 options and 193,330 RSUs to the employees of VirnetX, Inc On December 18, 2020, the Compensation Committee granted 120,000 options to an employee of VirnetX Inc. and 10,000 options to a consultant.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by this item will be set forth in the Proxy Statement and is incorporated herein by reference.",
    "item_14": "Item 14. Principal Accountant Fees and Services\nThe information required by this item will be set forth in the Proxy Statement and is incorporated herein by reference.\nIndex\nPART IV",
    "item_15": "Item 15. Exhibits and Financial Statement Schedules\n(a) The following documents are filed as part of this Annual Report on Form 10-K\n(1) Financial Statements: See the Index to Consolidated Financial Statements under Item 8 of this Annual Report on Form 10-K.\n(2) Financial Statement Schedule: Financial statement schedules are omitted because they are not applicable, or the required information is shown in the financial statements or notes thereto. All other schedules are omitted because of the absence of conditions under which they are required or because the required information is given in the financial statements or the notes thereto.\n(3) Exhibits: The documents listed in the Exhibit Index of this Annual Report on Form 10-K are incorporated by reference or are filed with this Annual Report on Form 10-K, in each case as indicated therein (numbered in accordance with Item 601 of Regulation S-K).\nEXHIBIT INDEX\nExhibit\nNumber\nIncorporated by reference herein\nDescription\nForm\nExhibit No.\nFiling Date\nFile No.\n3.1\nCertificate of Incorporation of the Company.\n8-K\n3.1\n11/01/2007\n000-26895\n3.2\nBy Laws of the Company.\n8-K\n3.2\n11/01/2007\n000-26895\n4.1\nForm of Warrant Agency Agreement by and between the Company and Corporate Stock Transfer, Inc. as Warrant Agent.\nS-1/A\n4.1\n01/16/2009\n333-153645\n4.2\nForm of Series I Warrant.\n8-K\n4.1\n09/03/2009\n001-33852\n4.3\nSpecimen Common Stock Certificate.\nS-3\n4.1\n07/30/2018\n333-226413\n4.4\nForm of Senior Indenture\nS-3\n4.2\n07/30/2018\n333-226413\n4.5\nForm of Subordinated Indenture\nS-3\n4.4\n07/30/2018\n333-226413\n4.6\nDescription of Capital Stock\n10.1\nForm of Indemnification Agreement by and between the Company and each of Kendall Larsen, Robert D. Short III, Gary Feiner, Michael F. Angelo, Thomas M. O’Brien and Richard Nance.\n10-K\n10.1\n03/18/2019\n001-33852\n10.2*\n2007 Stock Plan, as amended on April 13, 2012.\n10-Q\n10.2\n05/10/2012\n001-33852\n10.3*\nAmended Form of Stock Option Agreement - 2007 Stock Plan.\n10-Q\n4.5\n05/10/2011\n001-33852\n10.4*\nForm of Restricted Stock Unit Award Agreement - 2007 Stock Plan.\n10-Q\n10.3\n05/10/2012\n001-33852\n10.5*\n2013 Equity Incentive Plan.\nDEF 14A\nAppendix A\n04/12/2013\n001-33852\n10.6*\nForm of Stock Option Agreement - 2013 Equity Incentive Plan.\n10-K\n10.6\n03/02/2015\n001-33852\n10.7*\nForm of Restricted Stock Unit Agreement - 2013 Equity Incentive Plan.\n10-K\n10.7\n03/02/2015\n001-33852\n10.8\nVoting Agreement among the Company and certain of its stockholders, dated as of December 12, 2007.\n10-K\n10.11\n03/31/2008\n001-33852\n10.9\nSecurities Purchase Agreement, dated as of September 2, 2009, by and between the Company and the Purchasers (as defined therein).\n8-K\n10.1\n09/03/2009\n001-33852\nIndex\nExhibit\nNumber\nIncorporated by reference herein\nDescription\nForm\nExhibit No.\nFiling Date\nFile No.\n10.10\nForm of Registration Rights Agreement by and between the Company and the Purchasers (as defined therein).\n8-K\n10.2\n09/03/2009\n001-33852\n10.11\nForm of Underwriting Agreement between VirnetX Holding Corporation and Gilford Securities Incorporated.\nS-1/A\n1.1\n01/16/2009\n333-153645\n10.12\nPatent License and Assignment Agreement by and between the Company and Leidos, Inc. (formerly Science Applications International Corporation) dated as of August 12, 2005.\n8-K\n10.4\n07/12/2007\n000-26895\n10.13\nAmendment No. 1 to Patent License and Assignment Agreement by and between the Company and Leidos, Inc. dated as of November 2, 2006.\n8-K\n10.6\n07/12/2007\n000-26895\n10.14\nAmendment No. 2 to Patent License and Assignment Agreement by and between VirnetX, Inc. and Leidos, Inc. dated as of March 12, 2008.\n8-K\n10.1\n03/18/2008\n001-33852\n10.15\nSecurity Agreement by and between the Company and Leidos, Inc. dated as of August 12, 2005.\n8-K\n10.5\n07/12/2007\n000-26895\n10.16\nAssignment Agreement between the Company and Leidos, Inc. dated as of December 21, 2006.\n8-K\n10.7\n07/12/2007\n000-26895\n10.17\nProfessional Services Agreement by and between the Company and Leidos, Inc. dated as of August 12, 2005.\n8-K\n10.8\n07/12/2007\n000-26895\n10.18**\nEngagement Letter dated June 8, 2009, by and between McKool Smith, a professional corporation, and VirnetX, Inc.\n10-Q\n10.1\n08/10/2009\n001-33852\n10.19**\nEngagement Letter dated April 15, 2010, by and between McKool Smith, a professional corporation, and VirnetX, Inc.\n10-Q\n10.1\n05/07/2010\n001-33852\n10.20**\nSettlement and License Agreement, by and between Microsoft Corporation and VirnetX, Inc., dated May 14, 2010.\n10-Q/A\n10.1\n01/31/2011\n001-33852\n10.21***\nAmended Settlement and License Agreement, by and between Microsoft Corporation and VirnetX, Inc., dated December 17, 2014.\n10-K\n10.23\n03/02/2015\n001-33852\n10.22*\nEmployment Offer Letter from VirnetX, Inc. to Richard H. Nance.\n10-Q\n10.4\n05/10/2012\n001-33852\n10.23**\nAmended and Restated Revenue Sharing Agreement by and between VirnetX Holding Corporation and Public Intelligence Technology Associates, dated October 18, 2017.\n10-Q\n10.1\n11/09/2017\n001-33852\nIndex\nExhibit\nNumber\nIncorporated by reference herein\nDescription\nForm\nExhibit No.\nFiling Date\nFile No.\n10.24**\nAmended and Restated Gabriel License Agreement by and between VirnetX Holding Corporation and Public Intelligence Technology Associates, dated October 18, 2017.\n10-Q\n10.2\n11/09/2017\n001-33852\n10.25\nSales Agreement, dated August 31, 2018, by and between VirnetX Holding Corporation and Cowen and Company, LLC.\n8-K\n10.1\n08/31/2018\n001-33852\n21.1\nSubsidiaries of VirnetX Holding Corporation.\n23.1\nConsent of Farber Hass Hurley LLP, Independent Registered Public Accounting Firm.\n24.1\nPower of Attorney (contained on signature page hereto)\n31.1\nChief Executive Officer Certification pursuant to Rule 13a-14(a) of the Securities Exchange Act.\n31.2\nChief Financial Officer Certification pursuant to Rule 13a-14(a) of the Securities Exchange Act.\n32.1†\nChief Executive Officer Certification pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2†\nChief Financial Officer Certification pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS\nXBRL Instance Document\n101.SCH\nXBRL Taxonomy Extension Schema Document\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nXBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase Document\n* Indicates management contract or compensatory plan.\n** Confidential treatment has been granted by the Securities and Exchange Commission as to certain portions of this Exhibit.\n*** Portions of this Exhibit have been omitted pending a determination by the Securities and Exchange Commission as to whether these portions should be granted confidential treatment.\n† The certifications attached as Exhibit 32.1 and 32.2 that accompany this Annual Report on Form 10-K are not deemed filed with the Securities and Exchange Commission and are not to be incorporated by reference into any filing of VirnetX Holding Corporation under the Securities Act of 1933, as amended, or the Securities Exchange Act of 1934, as amended, whether before or after the date of this Annual Report on Form 10-K, irrespective of any general incorporation language contained in such filing.\nIndex\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this Annual Report on Form 10-K to be signed on its behalf by the undersigned, thereunto duly authorized.\nVirnetX Holding Corporation\nBy:\n/s/ Kendall Larsen\nName: Kendall Larsen\nTitle: Chief Executive Officer and President\nDated: March 16, 2021\nIndex\nPOWER OF ATTORNEY\nKNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Kendall Larsen his or her attorney-in-fact, with full power of substitution, for him or her in any and all capacities, to sign any amendments to this Report on Form 10-K, and to file the same, with exhibits thereto and other documents in connection therewith with the Securities and Exchange Commission, hereby ratifying and confirming all that said attorney-in-fact, or his or her substitute or substitutes may do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this Annual Report on Form 10-K has been signed below by the following persons on behalf of the registrant and in the capacities indicated.\nName\nCapacity\nDate\n/s/ Kendall Larsen\nDirector, Chief Executive Officer and President\nMarch 16, 2021\nKendall Larsen\n(Principal Executive Officer)\n/s/ Richard H. Nance\nChief Financial Officer\nMarch 16, 2021\nRichard H. Nance\n(Principal Financial Officer and\nPrincipal Accounting Officer)\n/s/ Robert D. Short III\nDirector\nMarch 16, 2021\nRobert D. Short III\n/s/ Gary Feiner\nDirector\nMarch 16, 2021\nGary Feiner\n/s/ Michael F. Angelo\nDirector\nMarch 16, 2021\nMichael F. Angelo\n/s/ Thomas M. O’Brien\nDirector\nMarch 16, 2021\nThomas M. O’Brien"
}