{
    "cik": "1092699",
    "company": "SPS COMMERCE INC",
    "filing_type": "10-K",
    "filing_date": "2021-02-23",
    "period_of_report": "2020-12-31",
    "sic": "7372",
    "state_of_inc": "DE",
    "state_location": "MN",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1092699/0001564590-21-007614-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1092699/000156459021007614/spsc-10k_20201231.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1092699/0001564590-21-007614.txt",
    "filename": "1092699_10K_2020_0001564590-21-007614.htm",
    "item_1": "Item 1.\nBusiness\nOverview\nSPS Commerce is a leading provider of cloud-based supply chain management services that make it easier for retailers, suppliers, grocers, distributors, and logistics firms to orchestrate the management of item data, order fulfillment, inventory control, and sales analytics across all channels. Implementing and maintaining a suite of supply chain management capabilities is resource-intensive and is not a core competency for most businesses.\nThe services offered by SPS Commerce eliminate the need for on-premise software and support staff by taking on that capability on the customer’s behalf. The services SPS Commerce provides enable our customers to increase their supply cycle agility, optimize their inventory levels and sell-through, reduce operational costs and gain increased visibility into customer orders, ensuring that suppliers, grocers, distributors, and logistics firms can satisfy exacting retailer requirements.\nAs of December 31, 2020, we had approximately 33,000 customers with contracts to pay us monthly fees, which we refer to as recurring revenue customers. We have also generated revenues by providing our cloud-based supply chain management services to an additional 62,000 organizations that, together with our recurring revenue customers, we refer to as our customers. Once connected to the SPS Commerce cloud-based Platform, our customers often require integrations to new organizations that represent an expansion of our cloud-based Platform and new sources of revenues for us.\nFor the years ended December 31, 2020, 2019, and 2018, we generated revenues of $312.6 million, $279.1 million, and $248.2 million, respectively. Our quarter ended December 31, 2020 represented our 80th consecutive quarter of increased revenues. Recurring revenues from recurring revenue customers accounted for 94%, 94% and 93% of our total revenues for the years ended December 31, 2020, 2019, and 2018, respectively. Our revenues are not concentrated with any customer, as our largest customer represented less than 1% of total revenues for the years ended December 31, 2020, 2019, and 2018.\nOur Solutions\nSPS Commerce operates one of the largest retail trading partner networks in the world through cloud-based services that improve the way retailers, suppliers, grocers, distributors, and logistics firms manage and fulfill orders, administer sell-through performance, and source new items. Approximately 95,000 customers across approximately 80 countries are using SPS Commerce solutions to expand and optimize the performance of their trading relationships.\nThe SPS Commerce business model fundamentally changes how organizations use electronic communication to manage their omnichannel, supply chain, and other business requirements by replacing the collection of traditional, custom-built, point-to-point integrations with a model that facilitates a single automated connection to the entire SPS Commerce network of trading partners.\nFrom that single connection, a member of our network can make use of the full suite of our services, from fulfillment automation to the analysis and optimization of item sell-through performance, to sourcing new items, retailing relationships, logistics providers, or other services. These cloud services deliver value as stand-alone offerings but can also provide greater value when used collectively. This represents a fundamental change to fulfillment automation and enables inherent adaptability and flexibility not possible with traditional supply chain management system architectures.\nOur Fulfillment solution allows customers to comply with numerous rulebooks for retailers, grocers, and distributors. Maintaining current connections with retailers, grocers, and distributors removes the need for their trading partners to continually stay up-to-date with their required rulebook change. The utilization of a cloud services model eliminates (or greatly reduces) the burden on trading partners to support and maintain an on-premise software application, thereby reducing their ongoing operating costs. As the transaction hub for trading partners, we can provide increased performance visibility and data analytics capabilities across their supply chains, each of which is difficult to gain from traditional, point-to-point integration solutions.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nThe following services are enabled through the SPS Commerce cloud-based Platform:\n•\nFulfillment. The Fulfillment solution provides fulfillment automation and replaces or augments an organization’s existing staff and trading partner electronic communication infrastructure by enabling easy compliance with retailers’ rulebooks, automatic, digital exchange of information among numerous trading partners through various protocols, and greater visibility into the journey of an order.\n•\nAnalytics. The Analytics solution consists of data analytics applications that enable our customers to improve their visibility across their supply chains through greater analytics capabilities. When focused on point-of-sale data, for example, retailers and suppliers can ensure inventory is located where demand is highest. Additionally, retailers improve their visibility into supplier performance and their understanding of product sell-through.\n•\nOther Solutions. We provide several peripheral solutions, such as our assortment solution (which enables accurate order management and rapid fulfillment) and our community solution (which accelerates vendor onboarding and ensures trading partner adoption of new supply chain requirements).\nOur Customer and Sales Sources\nAs one of the largest providers of cloud services for retail supply chain management, the trading partner relationships that we enable among our retailer, supplier, grocer, distributor, and logistics customers naturally lead to new customer acquisition opportunities.\n“Network Effect”\nOnce connected to our network, trading partners can exchange electronic supply chain information with each other. The value of our network increases with the number of trading partners connected to it. The addition of each new customer enables that new customer to communicate with our existing customers and permits our existing customers to do business with the new customer. Additionally, through our Sourcing solution, our community now has a social network focused on facilitating connections and business interactions among retailers and suppliers. This “network effect” of adding additional customers to our solutions’ infrastructure creates a significant opportunity for existing customers to realize incremental sales by working with our new trading partners and vice versa. As a result of this increased volume of activity among our network participants, we earn additional revenues from these participants.\nBusiness Development Efforts.\nOur business development organization is tasked with finding new sources of revenue and the development of new business opportunities through channel partners and other areas that present an opportunity for growth.\nCustomer Acquisition Sources\nCommunity. As retailers and suppliers reshape how they do business in an omnichannel landscape, they need to bring new capabilities and services to their trading partner networks. For instance, a supplier may wish to collaborate with their retailers around point-of-sale analytics data, or a retailer may decide to change the workflow or protocol by which it interacts with its suppliers. In each case, the supplier and retailer may engage us to work with its trading partner base to enable the new capability. Performing these programs on behalf of retailers and suppliers often generates supplier sales leads for us.\nReferrals from Our Customers. We also receive sales leads from our customers seeking to communicate electronically with their trading partners. For example, a supplier may refer its third-party logistics provider or manufacturer, which is not in our network, to us.\nDirect Marketing. We employ various marketing strategies. Our marketing program include a variety of lead generating activities including digital marketing, advertising, conferences and tradeshows, events, and public relations activities targeted at key decision makers within our prospective customers.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nChannel Partners. In addition to the customer acquisition sources identified above, we market and sell our solutions through a variety of channel partners, including software providers, resellers, system integrators, and logistics partners. For example, software partners such as Microsoft, NetSuite, Oracle, SAP, Sage, and their business partner communities generate sales for us as part of broader enterprise resource planning, warehouse management system and/or transportation management system sales efforts. Our logistics partners also drive new sales both by providing leads and by embedding our solutions as part of their service offerings.\nOur Sales Force\nWe sell our solutions through a global sales force which is organized as follows:\n•\nRetailer Sales. We employ a team of sales representatives who focus on selling our cloud services suite to retailers and distributors.\n•\nSupplier Sales. We employ a team of supplier sales representatives focused on selling our cloud services suite to suppliers.\n•\nOther. We employ a team of sales representatives targeting a broad range of potential customer types such as those in logistics, distribution, ecommerce, and other areas.\nOur Growth Strategy\nOur objective is to be the leading global provider of supply chain management solutions. Key elements of our strategy include:\n•\nFurther Penetrate Our Current Market. We believe the global supply chain management market is underpenetrated and, as the retail industry continues to respond to the changing requirements of the omnichannel marketplace, and as the supply chain ecosystem becomes more complex and geographically dispersed, the demand for supply chain management solutions will increase, especially among small- and medium-sized businesses. We intend to continue leveraging our relationships with customers and their trading partners to obtain new sales leads.\n•\nIncrease Revenues from Our Customer Base. We believe our overall customer satisfaction is strong and will lead our customers to further expand their use of the solutions they have purchased, as well as purchase additional services to continue improving the performance of their trading partner relationships, generating additional revenues for us. We also expect to introduce new solutions to sell to our customers. We believe our position as the incumbent supply chain management solution provider to our customers, our integration into our recurring revenue customers’ business systems, and the modular nature of our cloud-based Platform are conducive to deploying additional solutions with customers.\n•\nExpand Our Distribution Channels. We intend to grow our business by expanding our sales capacity to gain new customers. We also believe there are valuable opportunities to promote and sell our solutions through collaboration with other providers.\n•\nExpand Our International Presence. We believe our presence in Asia Pacific, as well as in Europe, represents a significant competitive advantage. We plan to increase our global sales efforts to obtain new customers around the world. We intend to leverage our current global presence to increase the number of integrations we have with retailers in foreign markets to make our solutions more valuable to their trading partners based overseas.\n•\nEnhance and Expand Our Services. We intend to further improve and develop the functionality and features of our cloud-based Platform, including, from time to time, developing new solutions and applications.\n•\nSelectively Pursue Strategic Acquisitions. The fragmented nature of our market provides an opportunity for selective acquisitions. We plan to evaluate potential acquisitions based on the number of new customers, revenue, functionality, or geographic reach the acquisition would provide relative to the purchase price and our ability to integrate and operate the acquired business. In 2020, we acquired D Masons Software, LLC (“Data Masons”), a leading provider of electronic data interchange (“EDI”)\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nsolutions for the Microsoft Dynamics market. This acquisition further extended the power of our network.\nTechnology, Development and Operations\nTechnology\nSPS Commerce was an early provider of cloud services to the retail supply chain management industry, launching the first version of what would become our current services in 1997. We use commercially available hardware and cloud services with a combination of proprietary and commercially available software.\nOur cloud service model treats all customers as logically separate tenants within a shared virtual infrastructure. As a result, we spread the cost of delivering our solutions across our customer base. Because we do not manage thousands of distinct applications with their own business logic and database schemes, we believe that we can scale our business faster than traditional software vendors, even those that modified their products to be accessible over the Internet.\nDevelopment\nOur research and development efforts focus on maintaining, improving, and enhancing our existing solutions, as well as developing new solutions and applications. Our multi-tenant solutions serve all of our customers, which allows us to maintain relatively low research and development expenses and release software updates more frequently compared to traditional on-premise licensed software solutions that support multiple versions. Our development efforts take place at our U.S. locations in Minnesota and New Jersey, as well as in Melbourne, Australia; Toronto, Canada; and Kyiv, Ukraine.\nOperations\nWe operate our infrastructure in third-party data centers located in Minnesota, New Jersey, Texas, Florida, and Melbourne, Australia, as well as provisioned services in cloud providers. In most cases, infrastructure and services are managed by us.\nWe have internal and third-party monitoring software that continually checks our cloud-based Platform and key underlying components for continuous availability and performance, helping ensure that the network is always available and providing desired service levels. We have a technology engineering team that includes system provisioning, management, maintenance, monitoring, and back-up.\nWe operate a service architecture using industry best practices to ensure multiple points of redundancy, high availability, and scale as needed. Our databases are replicated between locations with a defined recovery point objective.\nOur Customers\nAs of December 31, 2020, we had approximately 33,000 recurring revenue customers and approximately 95,000 total customers. Our primary source of revenue is from small- to mid-sized suppliers. We also generate revenues from other members of the supply chain ecosystem, including retailers, distributors, third-party logistics providers, and other trading partners. Our revenues are not concentrated with any customer, as our largest customer represented less than 1% of total revenues for the years ended December 31, 2020, 2019, and 2018.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nCompetition\nVendors in the supply chain management industry offer solutions through three delivery methods: traditional on-premise software, cloud-based managed services, and cloud-based full-service solutions.\nThe market for cloud-based supply chain management solutions is fragmented and rapidly evolving. Cloud service vendors compete directly with each other based mainly on the following:\n•\nthe breadth of pre-built connections to retailers, third-party logistics providers, and other trading partners;\n•\na history of establishing and maintaining reliable connections with trading partners;\n•\na reputation of the cloud service vendor in the supply chain management industry;\n•\nprice;\n•\nspecialization in a customer market segment;\n•\nspeed and quality with which the cloud service vendor can integrate its customers to their trading partners;\n•\nfunctionality of the cloud service solution, such as the ability to integrate the solution with a customer’s business systems;\n•\nbreadth of complementary supply chain management solutions the cloud service vendor offers; and\n•\ntraining and customer support services provided during and after a customer’s initial integration.\nWe expect to encounter new and increased competition as this market segment consolidates and matures. Consolidation among cloud service vendors could create a direct competitor that can compete with us more effectively than the numerous, smaller vendors currently offering cloud service supply chain management solutions. Increased competition from cloud service vendors could reduce our market share, revenues, and operating margins or otherwise adversely affect our business.\nCloud service vendors also compete with traditional on-premise software companies. Traditional on-premise software companies focused on supply chain integration management include IBM Sterling Commerce and OpenText. These companies offer a “do-it-yourself” method in which customers purchase, install, and manage specialized software, hardware, and value-added networks for their supply chain integration needs. This method requires customers to invest in staff to operate and maintain the software. Traditional on-premise software companies use a single-tenant approach in which information maps to retailers are built for and used by one supplier, as compared to cloud service solutions that allow multiple customers to share information maps with a retailer.\nManaged service providers focused on the supply chain management market include IBM Sterling Commerce, OpenText, TrueCommerce/B2B Gateway, DiCentral, and many other small providers. These companies offer a cloud-based solution in which they develop and maintain the core technology, while the customer’s internal staff is responsible for the day-to-day customization, optimization, and operations of the technology.\nIn contrast, full-service providers, including SPS Commerce, offer cloud-based solutions that customize, optimize, and operate the technology. This approach offloads the time-intensive process of managing these solutions, which is not a core competency for most businesses.\nCustomers of traditional on-premise software providers must typically make significant upfront investments in the supply chain management solutions these competitors provide, which can decrease the customers’ willingness to abandon their investments in favor of a cloud service solution. Cloud service vendors compete with these traditional software solutions based on the total cost of ownership and flexibility.\nIntellectual Property and Proprietary Content\nSPS Commerce relies on a combination of copyright, trademark, and trade secret laws as well as confidentiality procedures and contractual provisions to protect our proprietary technology and our brand. We enter\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\ninto confidentiality and proprietary rights agreements with our employees, consultants and additional third parties, and control access to software, documentation, and other proprietary information. We have registered trademarks and pending trademark applications in the U.S. and certain foreign countries.\nDepending on the jurisdiction, trademarks are generally valid as long as they are in use or their registrations are properly maintained, and they have not been found to have become generic. Registrations of trademarks can also generally be renewed indefinitely as long as the trademarks are in use. We do not have any patents, but we have pending patent applications. Our trade secrets consist primarily of the software we have developed for our SPS Commerce cloud-based Platform and network. Our software is also protected under copyright law, but we do not have any registered copyrights.\nHuman Capital\nAs of December 31, 2020, we had 1,572 employees, including 737 in cost of revenues based functional areas, 417 in sales and marketing, 281 in research and development and 137 in general and administrative functions. We also employ independent contractors to support our operations. None of our employees are represented by a labor union.\nWe believe our employees have and will continue to be a primary reason for our growth and success. We offer competitive benefits as well as training, development, review, and feedback programs to develop employees’ expertise and skillsets, as well as strive to provide a safe, harassment-free work environment guided by principles of fair and equal treatment and prioritize employee engagement. As a result, we believe our employees are committed to building strong, innovative, and long-term relationships with each other and our organization in order to succeed together and with our customers. We offer our employees pay and benefits packages, which we believe are competitive with others throughout our industry, as well as within the local markets in which we operate, and aligns individual performance with our success. The health of our employees is also very important to us. In response to the threats of the COVID-19 pandemic, we have, where possible, offered remote work flexibility beginning in March 2020 which has continued through December 2020, without significant impacts to productivity.\nCompany Information\nWe were originally incorporated as St. Paul Software, Inc., a Minnesota corporation, on January 28, 1987. On May 30, 2001, we reincorporated in Delaware under our current name, SPS Commerce, Inc. Our principal executive offices are located at 333 South Seventh Street, Suite 1000, Minneapolis, Minnesota 55402, and our telephone number is (612) 435-9400. Our website address is www.spscommerce.com. Information on our website does not constitute part of this Annual Report on Form 10-K or any other report we file or furnish with the SEC. We provide free access to various reports that we file with or furnish to the SEC through our website as soon as reasonably practicable after they have been filed or furnished. These reports include, but are not limited to, our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and any amendments to these reports. Our SEC reports can be accessed through the investor relations section of our website or through the SEC’s website at www.sec.gov. Stockholders may also request copies of these documents from:\nSPS Commerce, Inc.\nAttention: Investor Relations\n333 South Seventh Street\nSuite 1000\nMinneapolis, MN 55402\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nInformation About our Executive Officers\nSet forth below are the names, ages and titles of the persons serving as our executive officers.\nName\nAge\nPosition\nArchie C. Black\nChief Executive Officer and President\nKimberly K. Nelson\nExecutive Vice President and Chief Financial Officer\nJames J. Frome\nExecutive Vice President and Chief Operating Officer\nArchie C. Black has served as our President and Chief Executive Officer and a director since 2001. Previously, Mr. Black served as our Senior Vice President and Chief Financial Officer from 1998 to 2001. Prior to joining us, Mr. Black was a Senior Vice President and Chief Financial Officer at Investment Advisors, Inc. in Minneapolis, Minnesota and also spent three years at Price Waterhouse.\nKimberly K. Nelson has served as our Executive Vice President and Chief Financial Officer since 2007. Prior to joining us, Ms. Nelson served as the Finance Director, Investor Relations for Amazon.com from 2005 through 2007 and as the Finance Director, Worldwide Application for Amazon.com’s Technology group from 2003 until 2005. Ms. Nelson also served as Amazon.com’s Finance Director, Financial Planning and Analysis from 2000 until 2003.\nJames J. Frome has served as our Executive Vice President and Chief Operating Officer since 2012. Previously, Mr. Frome served as our Executive Vice President and Chief Strategy Officer from 2001 to 2012 and as our Vice President of Marketing from 2000 to 2001. Prior to joining us, Mr. Frome served as a Divisional Vice President of Marketing at Sterling Software, Inc. from 1999 to 2000 and as a Senior Product Manager and Director of Product Management at Information Advantage, Inc. from 1993 to 1999.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020",
    "item_1A": "Item 1A.\nRisk Factors\nSet forth below and elsewhere in this Annual Report on Form 10-K, and in other documents we file with the SEC, are risks and uncertainties that could cause our actual results to differ materially from the results contemplated by the forward-looking statements contained in this Annual Report on Form 10-K and in other written and oral communications from time to time. You should carefully consider all of the following risks and the other information in this Report and our other filings with the SEC before you decide to invest in our Company or to maintain or increase your investment. Our business could be harmed by any of these risks. The trading price of our common stock could decline due to any of these risks. In assessing these risks, you should also refer to the other information contained in this Annual Report on Form 10-K, including our financial statements and related notes.\nThe risks included in this section are not the only ones we face. We operate in a very competitive and rapidly changing environment. New risk factors emerge from time-to-time, and it is not possible for management to predict all such risk factors, nor can it assess the potential impact of all such risk factors on our business or the extent to which any factor, or combination of factors, may cause actual results to differ materially from those in any forward-looking statements. If any of the following risks actually occur, our business, results of operations, financial condition and future prospects would likely suffer. In that case, the trading price of our common stock could decline, and you may lose all or part of your investment.\nOur Business\nIf we are unable to attract new customers, or sell additional solutions to existing customers, or if our customers do not increase their use of our solutions, our revenue growth and profitability will be adversely affected.\nTo increase our revenues and achieve and maintain profitability, we believe that we must regularly add new customers, sell additional solutions to existing customers, and our customers must increase their use of the solutions for which they currently subscribe. We intend to grow our business by retaining and attracting talent, developing strategic relationships with resellers, including resellers that incorporate our applications in their offerings, and increasing our marketing activities. If we are unable to hire or retain quality personnel, convert companies that have been referred to us by our existing network into paying customers, ensure the effectiveness of our marketing programs, or if our existing or new customers do not perceive our solutions to be of sufficiently high value and quality, we might not be able to increase sales and our operating results will be adversely affected. If we fail to sell our solutions to existing or new customers, we will not generate anticipated revenues from these solutions, our operating results will suffer, and we might be unable to grow our revenues or maintain profitability.\nWe do not have long-term contracts with most of our recurring revenue customers, and therefore a lack of success in maintaining or improving forecasted renewal rates will have adverse effects on revenue and financial results.\nOur contracts with our recurring revenue customers typically allow the customer to cancel the contract for any reason with 30 to 90 days’ notice. Our continued success therefore depends significantly on our ability to meet or exceed our recurring revenue customers’ expectations because most recurring revenue customers do not make long-term commitments to use our solutions. In addition, if our reputation in the supply chain management industry is harmed or diminished for any reason, our recurring revenue customers have the ability to terminate their relationship with us on short notice and seek alternative supply chain management solutions. We may also not be able to accurately predict future trends in customer renewals, and our customers’ renewal rates may decline or fluctuate because of several factors, including their dissatisfaction with our services, the cost of our services compared to the cost of services offered by our competitors and reductions in our customers’ spending levels. If a significant number of recurring revenue customers seek to terminate their relationship with us, our business, results of operations and financial condition would be adversely affected in a short period of time.\nEconomic weakness and uncertainty could adversely affect our revenue, lengthen our sales cycles and make it more difficult for us to forecast operating results accurately.\nOur revenues depend significantly on general economic conditions and the sustainability and health of retailers. Economic weakness and constrained retail spending may result in slower growth, or reductions, in revenues and gross profits in the future. We have experienced, and may experience in the future, reduced spending\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nin our business due to financial turmoil affecting the U.S. and global economy, and other macroeconomic factors affecting spending behavior. Uncertainty about future economic conditions increases the difficulty of forecasting operating results and making decisions about future investments. In addition, economic conditions or uncertainty may cause customers and potential customers to reduce or delay technology purchases, including purchases of our solutions. Our sales cycle may lengthen if purchasing decisions are delayed as a result of uncertain information technology or development budgets or contract negotiations become more protracted or difficult as customers institute additional internal approvals for information technology purchases. Delays or reductions in information technology spending could have a material adverse effect on demand for our solutions, and consequently our results of operations and prospects.\nOur continued growth could strain our personnel resources and infrastructure, and if we are unable to implement appropriate controls and procedures to manage our growth, we may not be able to implement our business plan successfully.\nWe have experienced a period of rapid growth in our headcount and operations. To the extent that we are able to sustain such growth, it might place a significant strain on our management, administrative, operational and financial resources, and infrastructure. Our success will depend in part upon the ability of our senior management to manage this growth effectively. To do so, we must continue to hire, train, and manage new employees as needed. To manage the expected growth of our operations and personnel, we will need to continue to improve our operational, financial and management controls and our reporting systems and procedures. If we fail to successfully manage our growth, we will be unable to execute our business plan as expected.\nIf we fail to attract, retain, and train members of our senior management team, including our Chief Executive Officer and other key personnel, our business plan would be impacted, and we might not be able to implement our plan successfully.\nGiven the complex nature of the cloud-based technology through which our business operates and the speed with which such technology advances, our future success is dependent, in large part, upon our ability to attract, retain and train highly qualified executive, managerial, engineering and sales personnel. Competition for talented personnel is intense, and we cannot be certain that we can retain our key personnel or that we can attract, assimilate, or retain such personnel in the future. Additionally, the loss of any key or a significant number of personnel in our engineering, project management, or sales teams might significantly delay or prevent the achievement of our business objectives and could materially harm our business, customer relationships, results of operations and financial condition.\nThe market for cloud-based supply chain management solutions is at a relatively early stage of development. If this market does not develop or develops more slowly than we expect, our revenues may decline or fail to grow and we may incur operating losses.\nWe derive, and expect to continue to derive, substantially all of our revenues from providing cloud-based supply chain management solutions to suppliers, retailers, distributors, and logistics firms. The market for these solutions is in a relatively early stage of development, and it is uncertain whether these solutions will achieve and sustain high levels of demand and market acceptance. Our success will depend on the willingness of retailers and their trading partners to accept our solutions as an alternative to traditional licensed hardware and software solutions.\nSome suppliers, retailers, distributors, or logistics firms may be reluctant or unwilling to use our cloud-based solutions for a number of reasons, including their potential significant initial investment to replace existing investments in supply chain management hardware and licensed software and perceived loss of control over user data with a cloud-based solution. Other factors that may limit market acceptance of our cloud-based supply chain management solutions include:\n•\nour ability to maintain high levels of customer satisfaction;\n•\nour ability to maintain continuity of service for all users of our cloud-based Platform;\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\n•\nthe price, performance, and availability of competing solutions; and\n•\nour ability to address suppliers’ confidentiality concerns about information stored within our cloud-based solutions.\nIf retailers and their trading partners do not perceive the benefits of our cloud-based supply chain management solutions, or if retailers and their trading partners are unwilling to accept our cloud-based Platform as an alternative to the traditional approach, demand for our solutions may not continue to develop or may develop more slowly than we expect, either of which would significantly adversely affect our revenues and growth prospects.\nThe markets in which we participate are highly competitive, and our failure to compete successfully would make it difficult for us to add and retain customers and would reduce or impede the growth of our business.\nThe markets for supply chain management solutions are increasingly competitive and global. We expect competition to increase in the future both from existing competitors and new companies that may enter our markets. We face competition from:\n•\ncloud service providers that deliver business-to-business information systems using a multi-tenant approach;\n•\ntraditional on-premise software providers; and\n•\nmanaged service providers that combine traditional on-premise software with professional information technology services.\nMoreover, our industry is highly fragmented, and we believe it is likely that our existing competitors will continue to consolidate or will be acquired. In addition, some of our competitors may enter into new alliances with each other or may establish or strengthen cooperative relationships with systems integrators, third-party consulting firms or other parties. New entrants not currently considered to be competitors may also enter the market through acquisitions, partnerships, or strategic relationships. Any such consolidation, acquisition, alliance or cooperative relationship could lead to pricing pressure, loss of customers and our loss of market share and could result in a competitor with greater financial, technical, marketing, service and other resources, all of which could have a material adverse effect on our business, operating results and financial condition. Increased competition could reduce our market share, revenues, and operating margins, increase our costs of operations, and otherwise adversely affect our business.\nTo remain competitive, we will need to invest continuously in software development, marketing, customer service and support, product delivery and other cloud-based Platform infrastructure. However, we cannot assure you that new or established competitors will not offer solutions that are superior to or lower in price than ours or both. We may not have sufficient resources to continue the investments in all areas of software development, marketing, customer service and support and infrastructure needed to maintain our competitive position which may diminish our market share and business prospects.\nWe may pursue acquisitions and our potential inability to successfully integrate or otherwise operate newly acquired companies or businesses could adversely affect our financial results.\nOur growth plans include evaluations of potential acquisitions of other companies or their businesses. If such evaluations lead to completed acquisitions, we face many risks commonly encountered with growth through acquisitions. These risks include:\n•\nincurring significantly higher than anticipated capital expenditures and operating expenses;\n•\nfailing to assimilate the operations, customers, and personnel of the acquired company or business;\n•\ndisrupting our ongoing business;\n•\ndissipating or distracting our management resources;\n•\ndilution to existing stockholders from the issuance of equity securities;\n•\nliabilities or other problems associated with the acquired business;\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\n•\nbecoming subject to adverse tax consequences, substantial depreciation, or deferred compensation charges;\n•\nimproper compliance with laws and regulations and exposure to other contingent liabilities;\n•\nfailing to maintain uniform standards, controls, and policies; and\n•\nimpairing relationships with employees and customers as a result of changes in management.\nFully integrating an acquired company or business into our operations may take a significant amount of time. In addition, we may only be able to conduct limited due diligence on an acquired company’s operations. Following an acquisition, we may be subject to liabilities arising from an acquired company’s past or present operations, including liabilities related to data security, encryption and privacy of customer data, and these liabilities may be greater than the warranty and indemnity limitations that we negotiate. We cannot assure you that we will be successful in overcoming these risks or any other problems encountered with acquisitions. To the extent we do not successfully avoid or overcome the risks or problems related to any acquisitions, our results of operations and financial condition could be adversely affected. Future acquisitions also could impact our financial position and capital needs and could cause substantial fluctuations in our quarterly and yearly results of operations. Acquisitions could include significant goodwill and intangible assets, which may result in future impairment charges that would reduce our stated earnings.\nBecause our long-term success depends, in part, on our ability to expand the sales of our solutions to customers located outside of the United States and expand operations to support such expansion, our business will be susceptible to risks associated with international operations.\nOur limited experience in operating our business outside of the United States increases the risk that our current and any future international expansion efforts will not be successful. Expanding international sales and operations subjects us to new risks that, generally, we have not faced in the U.S., including:\n•\nmisjudging the markets and competitive landscape of foreign jurisdictions;\n•\nfluctuations in currency exchange rates;\n•\nunexpected changes in foreign regulatory requirements;\n•\nlonger accounts receivable payment cycles and difficulties in collecting accounts receivable;\n•\ndifficulties in managing and staffing international operations;\n•\ndiffering technology standards;\n•\npotentially adverse tax consequences, including the complexities of foreign value added tax systems and restrictions on the repatriation of earnings;\n•\nlocalization of our solutions, including translation into foreign languages and associated expenses;\n•\nthe burdens of complying with a wide variety of foreign laws and different legal standards, including laws and regulations related to privacy;\n•\nincreased financial accounting and reporting burdens and complexities;\n•\npolitical, social, and economic instability abroad, terrorist attacks and security concerns in general;\n•\ngreater potential for corruption and bribery; and\n•\nreduced or varied protection for intellectual property rights in some countries.\nThe occurrence of any one of these risks could negatively affect our international business and, consequently, our results of operations generally. Additionally, operating in international markets also requires significant management attention and financial resources. We cannot be certain that the investment and additional resources required in establishing, acquiring, or integrating operations in other countries will produce desired levels of revenues or profitability.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nIn addition, we operate in parts of the world, such as Ukraine, that are recognized as having governmental corruption problems and where local customs and practices may not foster strict compliance with anti-corruption laws. Our continued operation and potential expansion outside the U.S. could increase the risk of such violations in the future. Despite our training and compliance programs, we cannot assure you that our internal control policies and procedures will protect us from unauthorized, reckless, or criminal acts committed by our employees or agents, including by third parties we utilize in foreign jurisdictions. In the event that we believe, or have reason to believe, that our employees or agents have or may have violated applicable anti-corruption laws, including the U.S. Foreign Corrupt Practices Act, we may be required to investigate or have outside counsel investigate the relevant facts and circumstances, which can be expensive and require significant time and attention from senior management. Violations of these laws may result in severe civil and criminal sanctions and penalties, which could disrupt our business and have a material adverse effect on our reputation, results of operations or financial condition.\nAny unrest, military activities, or sanctions impacting our international operations, should they occur, could disrupt operations, and have a material adverse effect on our business. Any such disruption to our operations may be prolonged and require a transition to alternative workforce locations. An alternative workforce location may be more expensive to train, staff, and operate and may cause delays and shortfalls in programming deliverables and services, thus potentially harming our business.\nProducts and Service Offerings\nAny new solutions and changes to existing solutions we pursue could fail to attract or retain customers or generate expected revenues.\nOur ability to retain, increase and engage our customers and to increase our revenues depends heavily on our ability to identify, develop, and launch successful new solutions. We may introduce significant changes to our existing solutions or develop and introduce new and unproven solutions which include or use technologies with which we have little or no prior development or operating experience. If new or enhanced solutions fail to garner expected customer demand in a timely manner or at all, we may fail to generate sufficient revenues, operating margin, or other value to justify our investments and our business may be adversely affected.\nOur business is dependent on our ability to maintain and scale our technical infrastructure, and any failure to effectively maintain or scale such infrastructure could damage our reputation, result in a potential loss of revenue, and adversely affect our financial results.\nOur reputation and ability to attract, retain and serve our customers is dependent upon the reliable performance of our cloud-based Platform and our underlying technical infrastructure and cloud providers. As our user base and the amount and types of information shared on our cloud-based Platform continue to grow, we will need an increasing amount of technical infrastructure, including network capacity and computing power, to continue to satisfy the needs of our users. It is possible that we or our cloud providers may fail to effectively maintain and scale our technical infrastructure to accommodate these increased demands. Any failure to effectively maintain and grow our technical infrastructure could result in interruptions or delays in service which may damage our reputation, result in a potential loss of customers, and adversely affect our financial results.\nOur inability to adapt to rapid technological change could impair our ability to remain competitive.\nThe industry in which we compete is characterized by rapid technological change, frequent introductions of new products and evolving industry standards. Existing products can become obsolete and unmarketable when vendors introduce products utilizing new technologies or new industry standards emerge, and as a result, it is difficult for us to predict the life cycles of our products. Our ability to attract new customers and increase revenues from customers will depend in significant part on our ability to anticipate technological changes, and the corresponding impact on customer needs, evolving requirements, and future industry standards, and to continue to enhance our existing solutions or introduce or acquire new solutions to keep pace with such technological developments. The success of our enhanced or new solutions depend on several factors, including the timely completion, introduction and market acceptance of the enhancement or solution. Any new solution we develop or acquire might not be introduced in a timely or cost-effective manner and might not achieve the broad market acceptance necessary to generate expected revenues. If any of our competitors or new market entrants implement new technologies or upgrades to existing technologies before we are able to implement them, they may be able to\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nprovide more effective solutions than ours at lower prices. Any delay or failure in the introduction of new or enhanced solutions could adversely affect our business, results of operations and financial condition.\nWe rely on third party infrastructure, software and services that could take a significant time, and involve a complex transition, to replace or upgrade.\nWe rely on infrastructure, software and services licensed from third parties to offer our cloud-based supply chain management solutions. This infrastructure, software, and services, as well as related maintenance and updates, may not continue to be available to us on commercially reasonable terms, or at all. If we lose the right to use or upgrade any of these licenses, our customers could experience delays or be unable to access our solutions until we can obtain and integrate equivalent technology. There might not always be commercially reasonable alternatives to the third-party infrastructure, software, and services that we currently license. Any such alternatives could be more difficult or costly to replace than what we currently license, and integration of the alternatives into our cloud-based Platform could require significant work and resources and delays. Any delays or failures associated with our cloud-based Platform could injure our reputation with current and potential customers and have an adverse effect on our business.\nInterruptions or delays from third-party data centers or to the telecommunications infrastructure we use or rely on could impair the delivery of our solutions and our business could suffer.\nWe use third-party data centers, located in the U.S. and internationally, as well as provision services from cloud providers, to conduct our operations. Our ability to deliver our services depends on the development and maintenance of telecommunications infrastructure by third parties. This includes maintenance of a reliable network backbone with the necessary speed, data capacity, bandwidth capacity, and security. Our operations depend on the protection of the equipment and information we store in these third-party centers, or utilize from third-party providers, against damage or service interruptions that may be caused by fire, flood, severe storm, power loss, telecommunications failures, natural disasters, war, criminal act, military action, terrorist attack, financial failure of the service provider, and other events beyond our control. In addition, third party malfeasance, such as intentional misconduct by computer hackers, unauthorized intrusions, computer viruses, ransomware, or denial of service attacks, may also cause substantial service disruptions. A prolonged service disruption affecting our solutions could damage our reputation with potential customers, cause us to lose existing customers, expose us to liability, or otherwise adversely affect our business. We may also incur significant costs for using alternative equipment or taking other actions in preparation for, or in reaction to, events that damage the data centers or infrastructure we use or rely on, including the additional expense of transitioning to substitute facilities or service providers.\nA failure to protect the integrity and security of our customers’ information and prevent cyber-attacks, could materially damage our reputation, expose us to claims and litigation, and lead to service disruptions and harm our business. Additionally, the growing costs to avoid or reduce the risks of such a failure could adversely affect our results of operations.\nAs demonstrated by the frequency and sophistication of material and high-profile data security breaches within the retail industry, computer malware, viruses, computer hacking, phishing attacks, spamming, ransomware, and other electronic threats have become more prevalent in our industry. Given the interconnected nature of the retail supply chain, our significant presence in the retail industry, and the occurrence of cyber-attacks on our system in the past, we believe that we are a particularly attractive target for such attacks.\nOur business involves the collection and use of confidential information of our customers and their trading partners which sometimes requires our direct access to our customers’ information systems. Our security measures may be breached as a result of third-party action, including intentional misconduct by computer hackers via cyber-attacks, employee error, malfeasance, system errors or vulnerabilities, including vulnerabilities of our third-party vendors, customers, or otherwise and result in someone obtaining unauthorized access to our customers’ information and information systems. Additionally, third parties may attempt to fraudulently induce employees or customers into disclosing sensitive information such as usernames, passwords, or other information in order to gain access to our customers’ data or our data or IT systems. Because the techniques used to obtain unauthorized access, or to sabotage systems, change frequently and generally are not recognized until launched against a target, we may be unable to anticipate these techniques or to implement adequate preventative measures. Malicious third parties may also conduct attacks designed to temporarily deny customers access to our services.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nAny failure to maintain performance, reliability, security and availability of our cloud-based Platform and solutions to the satisfaction of our customers, or any unauthorized access to our customers’ information or systems is caused by our solutions or cloud-based Platform, may cause service disruptions, harm our reputation, impair our ability to retain existing customers and attract new customers and expose us to legal claims and government action, each of which could have a material adverse impact on our financial condition, results of operations and growth prospects. Although we are allocating more resources to address cyber threats and safeguard our solutions and services, we cannot assure you that these efforts to protect this confidential information and authorized access to such information systems will be successful. In addition, because of the critical nature of information security and system access, any actual or perceived failure of our security measures could cause existing or potential customers not to use our solutions and harm our reputation.\nBusinesses in the retail industry have experienced material sales declines after discovering data security breaches, and our business could be similarly impacted in the event of a breach or other cyber incident. Furthermore, many U.S. states and international jurisdictions have enacted laws requiring companies to notify consumers of data security breaches involving their personal data. These mandatory disclosures regarding a data security breach often lead to widespread negative publicity, which may cause our customers to lose confidence in our solutions and the effectiveness of our data security measures.\nWe may experience service failures or interruptions due to defects in the hardware, software, infrastructure, third party components or processes that comprise our existing or new solutions, any of which could adversely affect our business.\nTechnology solutions like ours may contain undetected defects in the hardware, software, infrastructure, third party components or processes that are part of the solutions we provide. If these defects lead to service failures, we could experience delays or lost revenues, diversion of software engineering resources, negative media attention or increased service costs as a result of performance claims during the period required to correct the cause of the defects. We cannot be certain that defects will be avoided in our upgraded or new solutions, resulting in loss of, or delay in, market acceptance, which could have an adverse effect on our business, results of operations and financial condition.\nBecause customers use our cloud-based supply chain management solutions for critical business processes, any defect in our solutions, any disruption to our solutions or any error in execution could cause recurring revenue customers to cancel their contracts with us, cause potential customers to not join our network and harm our reputation. We could also be subject to litigation for actual or alleged losses to our customers’ businesses, which may require us to spend significant time and money in litigation or arbitration or to pay significant settlements or damages. We do not currently maintain any warranty reserves. Moreover, defending a lawsuit, regardless of its merit, could be costly and divert management’s attention and could cause our business to suffer.\nThe insurers under our existing liability insurance policy could deny coverage of a future claim that results from an error or defect in our technology or a resulting disruption in our solutions, or our existing liability insurance might not be adequate to cover any or all of the damages and other costs of such a claim. Moreover, we cannot assure you that our current liability insurance coverage will continue to be available to us on acceptable terms or at all. The successful assertion against us of one or more large claims that exceeds, or is not insured against by, our insurance coverage, or the occurrence of changes in our liability insurance policy, including an increase in premiums or imposition of large deductible or co-insurance requirements, could have an adverse effect on our business, financial condition and operating results.\nIf open source, or other no-cost products and services, expand into enterprise application and supply chain software or solutions, our prices, revenues, and operating results may decline.\nThe open source community is comprised of many different formal and informal groups of software developers and individuals who have created a wide variety of software and have made that software available for use, distribution, and modification, often free of charge. If developers contribute effective and scalable enterprise and supply chain application software to the open source community, or if competitors make such software or service available at no cost, we may need to lower our product pricing and alter our distribution strategy to compete successfully, and our revenues and operating results may decline as a result.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nThe use of open source software in our products may expose us to additional risks and harm our intellectual property.\nSome of our products use or incorporate software that is subject to one or more open source licenses. Open source software is typically licensed under terms that require making the software freely accessible, usable, and modifiable. Failure to comply with these licenses may subject us to onerous requirements, such as offering our solutions that incorporate the open source software for no cost or making the source code we create based upon, incorporating, or using the open source software available for modifications or derivative works. If an author or third party that distributes such open source software were to allege that we had not complied with the conditions of one or more of these licenses, we could be required to incur significant legal expenses defending against such allegations and could be subject to significant damages, enjoined from the sale of our services that contained the open source software and required to comply with the foregoing conditions, which could disrupt the distribution and sale of some of our services.\nWhile we monitor the use of a majority of open source software in our products, processes and technology and work to ensure that open source software is not used in such a way as to require us to disclose the source code to the related product or solution, such use could inadvertently occur. Additionally, if a third-party software provider has incorporated certain types of open source software into software we license from such third party for our products and solutions, we could, under certain circumstances, be required to disclose the source code to our products and solutions. This could harm our intellectual property position and have a material adverse effect on our business, results of operations and financial condition.\nIf we fail to protect our intellectual property and proprietary rights adequately, our business could suffer material adverse effects.\nWe believe that proprietary technology is essential to establishing and maintaining our leadership position. We seek to protect our intellectual property through trade secrets, copyrights, confidentiality, non-compete and nondisclosure agreements, license agreements, trademarks, domain names and other measures, some of which afford only limited protection. We do not have any issued patents or registered copyrights. Despite our efforts to protect our proprietary rights, unauthorized parties may attempt to copy or reverse engineer aspects of our technology or to obtain and use information that we regard as proprietary. We cannot assure you that our means of protecting our proprietary rights will be adequate or that our competitors will not independently develop similar or superior technology or design around our intellectual property. In addition, the laws of some foreign countries do not protect our proprietary rights to the same extent as the laws of the U.S. Intellectual property protections may also be unavailable, limited or difficult to enforce in some countries, which could make it easier for competitors to capture market share. Our failure to protect adequately our intellectual property and proprietary rights could adversely affect our business, financial condition, and results of operations.\nIn addition, if we resort to legal proceedings to enforce our intellectual property rights or to determine the validity and scope of the intellectual property or other proprietary rights of others, the proceedings could be burdensome and expensive, even if we were to prevail. Any such legal proceedings, including litigation, that are pursued in the future could result in substantial costs and diversion of resources and could have a material adverse effect on our business, operating results, or financial condition, regardless of whether we prevail in such proceedings.\nAn assertion by a third party that we are infringing its intellectual property, whether or not correct, could subject us to costly and time-consuming litigation or expensive licenses and our business might be materially harmed.\nThe supply chain management industry and its enabling technologies are characterized by the existence of a large number of patents, copyrights, trademarks, and trade secrets and by frequent litigation based on allegations of infringement or other violations of intellectual property rights. As we seek to extend our solutions, we could be constrained by the intellectual property rights of others.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nWe might not prevail in any intellectual property infringement litigation given, among other reasons, the complex technical issues and inherent uncertainties in such litigation. Moreover, defending such claims, regardless of their merit, could be time-consuming and distracting to management, result in costly litigation or settlement, cause development delays, require us to enter into royalty or licensing agreements or require us to redesign our solutions to avoid infringement. If our solutions violate any third-party proprietary rights, we could be required to withdraw those solutions from the market, re-develop those solutions or seek to obtain licenses from third parties, which might not be available on reasonable terms or at all. Any efforts to re-develop our solutions, obtain licenses from third parties on favorable terms or license a substitute technology might be unsuccessful and, in any case, might substantially increase our costs and harm our business, financial condition and operating results. We also face risk of infringement or misappropriation claims if we hire an employee or contractor who possesses third party proprietary information and who decides to use such information in connection with our solutions, services, or business processes without such third party’s authorization. Regardless of the source of such misuse of third-party intellectual property, any resulting withdrawal of our solutions from the market might materially harm our business, financial condition, and operating results.\nIn addition, we incorporate open source software into our cloud-based Platform. Given the nature of open source software, third parties might assert copyright and other intellectual property infringement claims against us based on our use of certain open source software programs. The terms of many open source licenses to which we are subject have not been interpreted by U.S. or foreign courts, and there is a risk that those licenses could be construed in a manner that imposes unanticipated conditions or restrictions on our ability to commercialize our solutions. In that event, we could be required to seek licenses from third parties in order to continue offering our solutions, to re-develop our solutions or to discontinue sales of our solutions, or to release our proprietary software code under the terms of an open source license, any of which could have a material adverse effect on our business.\nRegulation\nPrivacy concerns and laws, evolving regulation of cloud computing, cross-border data transfer restrictions and other domestic or foreign regulations may limit the use and adoption of our solutions and adversely affect our business.\nRegulation related to the provision of services on the internet is increasing, as federal, state, and foreign governments continue to adopt new laws and regulations addressing data privacy and the collection, processing, storage and use of personal information. In some cases, foreign data privacy laws and regulations, such as the European Union’s General Data Protection Regulation, also governs the processing of personal information. Further, laws are increasingly aimed at the use of personal information for marketing purposes, such as the European Union’s e-Privacy Directive, and the country-specific regulations that implement that directive. Such laws and regulations are subject to differing interpretations and are inconsistent among jurisdictions. These and other requirements could reduce demand for our solutions or restrict our ability to store and process data or, in some cases, impact our ability to offer our services and solutions in certain locations.\nIn addition to government activity, privacy advocacy and other industry groups have established or may establish new self-regulatory standards that may place additional burdens on us. Our customers may expect us to meet voluntary certification or other standards established by third parties. If we are unable to maintain these certifications or meet these standards, it could adversely affect our ability to provide our solutions to certain customers and could harm our business.\nThe costs of compliance with and other burdens imposed by laws, regulations and standards are significant and may limit the use and adoption of our services and reduce overall demand for them, or lead to material fines, penalties, or liabilities for noncompliance.\nFurthermore, concerns regarding data privacy may cause our customers’ customers to resist providing the data necessary to allow our customers to use our service effectively. Even the perception that the privacy of personal information is not satisfactorily protected or does not meet regulatory requirements could inhibit sales and adoption of our cloud-based solutions.\nEvolving regulation of the internet may increase our expenditures related to compliance efforts, which may adversely affect our financial condition.\nAs e-commerce continues to evolve, increasing regulation by federal, state, or foreign agencies becomes more likely. We are particularly sensitive to these risks because the internet is a critical component of our cloud-based\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nbusiness model. In addition, taxation of services provided over the internet or other charges imposed by government agencies or by private organizations for accessing the internet may adversely impact our business. Any regulation imposing greater fees for internet use or restricting information exchange over the internet could result in a deceleration or decline in the use of the internet and the viability of internet-based services, which could materially harm our business.\nIndustry-specific regulation is evolving, and unfavorable or burdensome industry-specific laws, regulations or interpretive positions could harm our business.\nOur customers and potential customers do business in a variety of industries. Regulators in certain industries have adopted and may in the future adopt regulations or interpretive positions regarding the use of cloud computing and other outsourced services. The costs of compliance with, and other burdens imposed by, industry-specific laws, regulations and interpretive positions may limit customers’ use and adoption of our services and reduce overall demand for our services. In addition, an inability to satisfy the standards of certain voluntary third-party certification bodies that our customers may expect may have an adverse impact on our business. If in the future we are unable to achieve or maintain these industry-specific certifications or other requirements or standards relevant to our customers, it may harm our business.\nIn some cases, industry-specific laws, regulations, or interpretive positions may also apply directly to us as a service provider. Any failure or perceived failure by us to comply with such requirements could have an adverse impact on our business.\nOwnership of Our Common Stock\nOur results of operations may fluctuate in the future, which could result in volatility in our stock price.\nOur quarterly revenues and results of operations have varied in the past and may fluctuate in the future. Fluctuations in our results of operations may be due to a number of factors, including, but not limited to, those listed below and identified throughout this “Risk Factors” section:\n•\nour ability to retain and increase sales to customers and attract new customers, including our ability to maintain and increase our number of recurring revenue customers;\n•\nthe timing and success of introductions of new solutions or upgrades by us or our competitors;\n•\nthe strength of the U.S and global economy, in particular, as it affects the U.S. retail sector;\n•\nthe financial condition of our customers;\n•\nchanges in our pricing policies or those of our competitors;\n•\ncompetition, including entry into the industry by new competitors;\n•\nthe amount and timing of our expenses, including stock-based compensation and expenditures related to expanding our operations, supporting new customers, performing research and development, or introducing new solutions;\n•\nregulatory compliance costs and unforeseen legal expenses, including litigation and settlement costs;\n•\nthe timing, size, and integration success of potential future acquisitions;\n•\nchanges in the payment terms for our solutions; and\n•\nsystem or service failures, security breaches or network downtime.\nDue to the foregoing factors, and other risks, including those identified in this “Risk Factors” section, comparing our operating results on a period-to-period basis may not be meaningful. You should not rely on these comparisons of our past results of operations as an indication of our future performance.\nOur operating results in one or more future quarters may fluctuate, fall below the expectations of securities analysts and investors, or be less than any guidance we may provide to the market. If this occurs, the trading price of our common stock could decline significantly.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nOur stock price may be volatile.\nShares of our common stock were sold in our April 2010 initial public offering at a split adjusted price of $6.00 per share, and through December 31, 2020, our common stock has traded as high as a split adjusted price of $111.63 per share and as low as a split adjusted price of $4.23 per share. An active, liquid, and orderly market for our common stock may not be sustained, which could depress the trading price of our common stock. Some of the factors that may cause the market price of our common stock to fluctuate include:\n•\nfluctuations in our guidance and quarterly financial results or the guidance or quarterly financial results of companies perceived to be similar to us;\n•\nfluctuations in our recorded revenue, even during periods of significant sales order activity;\n•\nfluctuations in stock market volume;\n•\nchanges in estimates of our financial results or recommendations by securities analysts;\n•\nfailure of any of our solutions to achieve or maintain market acceptance;\n•\nchanges in market valuations of companies perceived to be similar to us;\n•\nsuccess of competitive products or services;\n•\nchanges in our capital structure, such as future issuances of securities or the incurrence of debt;\n•\nannouncements by us or our competitors of significant solutions, contracts, acquisitions, or strategic alliances;\n•\nregulatory developments in the United States, foreign countries or both;\n•\nlitigation involving our company, our general industry or both;\n•\nadditions or departures of key personnel;\n•\ninvestors’ general perception of us; and\n•\nchanges in general economic, industry and market conditions.\nIn addition, if the market for software or technology stocks or the stock market in general experiences a loss of investor confidence, the trading price of our common stock could decline for reasons unrelated to our business, financial condition, or results of operations. If any of the foregoing occurs, it could cause our stock price to fall and may expose us to class action lawsuits that, even if unsuccessful, could be costly to defend and a distraction to management.\nOur charter documents and Delaware law may delay, discourage, or inhibit a takeover that stockholders consider favorable.\nProvisions of our certificate of incorporation and bylaws and applicable provisions of Delaware law may delay, discourage, or inhibit transactions involving an actual or potential change in our control or change in our management, including transactions in which stockholders might otherwise receive a premium for their shares, or transactions that our stockholders might otherwise deem to be in their best interests, and may ultimately result in the market price of our common stock being lower than it would be without these provisions. These provisions:\n•\npermit our board of directors to issue up to 5,000,000 shares of preferred stock, with any rights, preferences and privileges as our board may designate, including the right to approve an acquisition or other change in our control;\n•\nprovide that the authorized number of directors may be changed by resolution of the board of directors;\n•\nprovide that all vacancies, including newly created directorships, may, except as otherwise required by law, be filled by the affirmative vote of a majority of directors then in office, even if less than a quorum;\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\n•\nprovide that stockholders seeking to present proposals before a meeting of stockholders or to nominate candidates for election as directors at a meeting of stockholders must provide notice in writing in a timely manner, and also specify requirements as to the form and content of a stockholder’s notice; and\n•\ndo not provide for cumulative voting rights.\nIn addition, Section 203 of the Delaware General Corporation Law generally limits our ability to engage in any business combination with certain persons who own 15% or more of our outstanding voting stock or any of our associates or affiliates who at any time in the past three years have owned 15% or more of our outstanding voting stock. These provisions may have the effect of entrenching our management team and may deprive you of the opportunity to sell your shares to potential acquirers at a premium over prevailing prices. This potential inability to obtain a control premium could reduce the price of our common stock.\nWe do not intend to declare dividends on our stock in the foreseeable future.\nWe currently intend to retain all future earnings for the operation and expansion of our business and, therefore, do not anticipate declaring or paying cash dividends on our common stock in the foreseeable future. Investors may need to sell all or part of their holdings of our common stock after price appreciation, which may never occur, as the only way to realize any future gains on their investment. Any payment of future cash dividends on our common stock will be at the discretion of our board of directors and will depend upon our results of operations, earnings, capital requirements, financial condition, future prospects, contractual restrictions and other factors deemed relevant by our board of directors. Therefore, you should not expect to receive dividend income from shares of our common stock.\nGeneral Risks\nOur failure to raise additional capital or generate cash flows necessary to expand our operations and invest in new technologies could reduce our ability to compete successfully and adversely affect our results of operations.\nWe may need to raise additional capital due to shortfalls in cash flow or for other reasons, and we may not be able to obtain debt or additional equity financing on favorable terms, if at all. If we raise additional equity financing, our security holders may experience significant dilution of their ownership interests and the value of shares of our common stock could decline. If we engage in debt financing, we may be required to accept terms that restrict our ability to incur additional indebtedness, force us to maintain specified liquidity or other ratios or restrict our ability to pay dividends or make acquisitions. If we need additional capital and cannot raise it on acceptable terms, we may not be able to, among other things:\n•\ndevelop and enhance our solutions;\n•\ncontinue to expand our technology development, sales and marketing organizations;\n•\nacquire complementary technologies, products, or businesses;\n•\nhire, train and retain employees; or\n•\nrespond to competitive pressures or unanticipated working capital requirements.\nOur inability to do any of the foregoing could reduce our ability to compete successfully and adversely affect our results of operations.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nUnanticipated changes in effective tax rates or adverse outcomes resulting from examination of our income or other tax returns could adversely affect our operating results and financial condition.\nWe are subject to income taxes in the U.S. and various foreign jurisdictions, and our domestic and international tax liabilities will be subject to the allocation of expenses in differing jurisdictions. Our future effective tax rates could be subject to volatility or adversely affected by a number of factors, including:\n•\nchanges in the valuation of our deferred tax assets and liabilities;\n•\nexpected timing and amount of the release of tax valuation allowances;\n•\nexpiration of, or detrimental changes in, research and development tax credit laws;\n•\ntax effects of stock-based compensation;\n•\ncosts related to intercompany restructurings;\n•\nchanges in tax laws, regulations, accounting principles or interpretations thereof; and\n•\nfuture earnings being lower than anticipated in countries where we have lower statutory tax rates and higher than anticipated earnings in countries where we have higher statutory tax rates.\nIn addition, we are subject to audits of our income, sales, and other taxes by the Internal Revenue Service and other foreign and state tax authorities. Outcomes from these audits could have an adverse effect on our operating results and financial condition.\nOur failure to maintain adequate internal control over financial reporting in accordance with Section 404 of the Sarbanes-Oxley Act of 2002 or to prevent or detect material misstatements in our annual or interim financial statements in the future could result in inaccurate financial reporting, or could otherwise harm our business and investor confidence in our financial reporting.\nEnsuring that we have internal financial and accounting controls and procedures adequate to produce accurate financial statements on a timely basis is a costly and time-consuming effort that needs to be re-evaluated periodically. The Sarbanes-Oxley Act requires, among other things, that we maintain effective internal control over financial reporting and disclosure controls and procedures. In particular, we are required to perform annual system and process evaluation and testing of our internal control over financial reporting to allow management and our independent registered public accounting firm to report on the effectiveness of our internal control over financial reporting, as required by Section 404 of the Sarbanes-Oxley Act. Furthermore, implementing any appropriate future changes to our internal control over financial reporting may entail substantial costs in order to modify our existing accounting systems, may take a significant period of time to complete and may distract our officers, directors and employees from the operation of our business. If we are not able to comply with the requirements of Section 404 in the future, or if material weaknesses are identified, our business could be harmed and investor confidence in our financial reporting diminished.\nThe extent to which the COVID-19 outbreak and measures taken in response thereto impact our business, results of operations and financial condition will depend on on-going and future developments and outcomes, which are highly uncertain and cannot be predicted.\nOur business operations and financial results may be adversely impacted by health epidemics, pandemics, and similar outbreaks. Despite our efforts to manage these impacts, their ultimate impact also depends on factors beyond our knowledge or control, including the duration and severity of any such outbreak and actions taken to contain its spread and mitigate its public health effects.\nThe recent and rapidly spreading COVID-19 pandemic could have adverse impacts on our business operations by limiting our employees' ability to work and travel, disrupting our third party technology providers, or causing internal operational workflow to change, among other potentially unforeseen circumstances given the unprecedented and rapidly evolving situation.\nAdditionally, the COVID-19 pandemic may continue to cause significant disruptions and changes in the economic or political conditions in markets in which we operate. This may cause significant volatility in demand for\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nour services due to, among other adverse impacts, disruption and downturns in our customers’ businesses and related supply chains, an acceleration of existing customer bankruptcies, or our customers’ ability to pay for our services when due or in full. Although certain customers may have a reduced demand for our services, we also may see increased demand by certain customer segments, potentially offsetting reduced demand.",
    "item_1B": "Item 1B.\nUnresolved Staff Comments\nNone.",
    "item_2": "Item 2.\nProperties\nOur corporate headquarters, including our principal administrative, marketing, sales, technical support and research and development facilities, are located in Minneapolis, Minnesota. This location includes approximately 198,000 square feet of space and is under lease through April 2027. The lease was amended in 2020 with the previous term through April 2025. We also lease office space in or near Kyiv, Ukraine; Little Falls, New Jersey and Houston, Texas; Toronto, Canada; Melbourne and Sydney, Australia; and Beijing, Hong Kong, China, and Amsterdam, Netherlands. We believe that our current facilities are suitable and adequate to meet our current needs and that suitable additional or substitute space will be available as needed to accommodate expansion of our operations.",
    "item_3": "Item 3.\nLegal Proceedings\nWe are not currently subject to any material legal proceedings. From time to time, we may be named as a defendant in legal actions or otherwise be subject to claims arising from our normal business activities. We believe that we have obtained adequate insurance coverage or rights to indemnification in connection with potential legal proceedings that may arise.",
    "item_4": "Item 4.\nMine Safety Disclosures\nNot applicable.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nPART II",
    "item_5": "Item 5.\nMarket for Registrant’s Common Equity, Related Stockholder Matters, and Issuer Purchases of Equity Securities\nMarket Information. Our common stock has traded on the Nasdaq Global Market under the symbol “SPSC” since April 22, 2010, the date of our initial public offering.\nStockholders of Record. As of February 10, 2021, we had 71 stockholders of record of our common stock, excluding holders whose stock is held either in nominee name and/or street name brokerage accounts.\nDividends. We have not historically paid cash dividends on our common stock. We currently intend to retain our future earnings, if any, to finance the operation and expansion of our business, and, therefore, we do not expect to pay cash dividends on our common stock in the foreseeable future. Payment of future cash dividends, if any, will be at the discretion of our board of directors after taking into account various factors, including our financial condition, operating results, current and anticipated cash needs, outstanding indebtedness and plans for expansion and restrictions imposed by lenders, if any.\nStock Performance Graph and Cumulative Total Return\nNotwithstanding any statement to the contrary in any of our previous or future filings with the SEC, the following information relating to the price performance of our common stock shall not be deemed to be “filed” with the SEC or to be “soliciting material” under the Securities Exchange Act of 1934, as amended, (“Exchange Act”), and it shall not be deemed to be incorporated by reference into any of our filings under the (“Securities Act”) of 1933, as amended, or the Securities Act, or the Exchange Act, except to the extent we specifically incorporate it by reference into such filing.\nThe table and graph below compare the cumulative total stockholder return of our common stock with that of the Nasdaq US Benchmark TR Index and the Nasdaq Computer Index from December 31, 2015 through December 31, 2020, utilizing the last trading day of each respective year. The return assumes that $100 was invested in shares of our common stock and the other indexes at the close of market on December 31, 2015, and that dividends, if any, were reinvested. In our Annual Report on Form 10-K for the year ended December 31, 2019, we compared our return to the Nasdaq US Benchmark Computer Services TR Index. In 2020, this index ceased measurement, and thus is no longer used for comparison. The comparisons in this table and graph are based on historical data and are not intended to forecast or be indicative of future performance of our common stock.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nComparison of Cumulative Total Returns of SPS Commerce, Inc. to Comparable Indexes\nNasdaq US\nNasdaq\nNasdaq US\nBenchmark\nComputer\nBenchmark Computer\nDate\nSPS Commerce\nTR Index\nIndex\nServices TR Index\n12/31/2015\n100.0\n100.0\n100.0\n100.0\n12/30/2016\n99.5\n113.0\n112.3\n160.2\n12/29/2017\n69.2\n137.2\n155.8\n129.8\n12/31/2018\n117.3\n129.7\n150.1\n118.7\n12/31/2019\n157.9\n170.1\n225.6\n151.1\n12/31/2020\n309.3\n206.3\n338.3\nN/A\nRecent Sales of Unregistered Securities; Use of Proceeds from Sales of Registered Securities\nNot applicable.\nPurchases of Equity Securities by the Issuer and Affiliated Purchasers\nOn November 2, 2017, our board of directors authorized a program to repurchase up to $50.0 million of common stock over two years. Under the program we purchased approximately $46.3 million of stock and on November 2, 2019, $3.7 million expired from the program.\nOn November 2, 2019, our board of directors authorized a new program to repurchase up to $50.0 million of common stock. Under the program, purchases may be made from time to time in the open market over two years. We did not make any purchases in the fourth quarter of 2020. As of December 31, 2020, $31.1 million was available for future share repurchases under the program.\nSee Note K to our consolidated financial statements, included in this Annual Report on Form 10-K, for additional information regarding our stock repurchase program.",
    "item_6": "Item 6.\nSelected Financial Data\nOmitted.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020",
    "item_7": "Item 7.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of our financial condition and results of operations should be read together with the section titled “Selected Financial Data” and our audited financial statements and related notes which are included elsewhere in this Annual Report on Form 10-K. Our actual results could differ materially from those anticipated in the forward-looking statements included in this discussion as a result of certain factors, including, but not limited to, those discussed in “Risk Factors” included elsewhere in this Annual Report on Form 10-K.\nOverview\nSPS Commerce is a leading provider of cloud-based solutions that make it easier for retailers, suppliers, grocers, distributors, and logistics firms to orchestrate the management of item data, order fulfillment, inventory control and sales analytics across all channels. The solutions offered by SPS Commerce eliminate the need for on-premise software and support staff by taking on that capability on the customer’s behalf. We derive the majority of our revenues from numerous monthly recurring subscriptions from businesses that utilize our solutions.\nWe plan to continue to grow our business by further penetrating the supply chain management market, increasing revenues from our customers as their businesses grow, expanding our distribution channels, expanding our international presence and, from time to time, developing new solutions and applications. We also intend to selectively pursue acquisitions that will add customers, allow us to expand into new regions or allow us to offer new functionalities. On December 16, 2020, we acquired D Masons Software, LLC (Data Masons), a leading provider of EDI System Automation solutions for the Microsoft Dynamics market. Due to the date of acquisition being near year-end, the acquisition did not have a material impact on operating results.\nFor the years ended December 31, 2020, 2019, and 2018, we generated revenues of $312.6 million, $279.1 million and $248.2 million, respectively. Our quarter ended December 31, 2020 represented our 80th consecutive quarter of increased revenues. Recurring revenues from recurring revenue customers accounted for 94%, 94%, and 93% of our total revenues for the years ended December 31, 2020, 2019, and 2018, respectively. Our revenues are not concentrated with any customer, as our largest customer represented less than 1% of total revenues for the years ended December 31, 2020, 2019, and 2018.\nImpact of COVID-19\nAlthough the global emergence of COVID-19 did not have a material adverse effect on our business, operating results, and overall financial performance for the year ended December 31, 2020, the future impact remains uncertain and depends on several factors, including, but not limited to, the pandemic’s duration and continued spread, impact on our customers, impact on our partners or employees, and impact on the economic environment and financial markets, all of which are uncertain and cannot be predicted. We have seen shifts in consumer and retailer behavior during the pandemic. We believe these shifts have not had a material positive or negative impact on our business as they appear to have increased the demand for EDI services in certain customer segments and decreased it in others. We will continue to actively monitor the situation and may take further actions that alter our business operations, as may be required by federal, state, or local authorities, or that we determine are in the best interests of our employees, customers, partners, and shareholders.\nKey Financial Terms and Metrics\nSources of Revenues\nFulfillment. Our Fulfillment solution provides fulfillment automation and replaces or augments an organization’s existing trading partner electronic communication infrastructure, enabling suppliers to have visibility into the journey of an order and comply with retailers’ rule books and enabling the electronic exchange of information among numerous trading partners through various protocols.\nAnalytics. Our Analytics solution consists of data analytics applications that enable our customers to improve their visibility across, and analysis of, their supply chains. When focused on point-of-sale data, for example, retailers and suppliers can ensure inventory is located where demand is highest. Retailers improve their visibility into supplier performance and their understanding of product sell-through.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nOther. We provide several peripheral solutions such as our assortment solution (which enables accurate order management and rapid fulfillment) and our community solution (which accelerates vendor onboarding and ensures trading partner adoption of new supply chain requirements). In addition to our solution offerings, we also provide one-time services such as professional services and testing and certification.\nCost of Revenues and Operating Expenses\nCost of Revenues. Cost of revenues consist primarily of personnel costs for our customer success and implementation teams, customer support personnel and application support personnel. Cost of revenues also includes our cost of network services, which is primarily data center costs for the locations where we keep the equipment that serves our customers, cloud provider services, and connectivity costs that facilitate electronic data transmission between our customers and their trading partners.\nSales and Marketing Expenses. Sales and marketing expenses consist primarily of personnel costs for our sales, marketing and product management teams, commissions earned by our sales personnel and marketing costs.\nResearch and Development Expenses. Research and development expenses consist primarily of personnel costs for development of new and maintenance of existing solutions, net of amounts capitalized as developed software. Our research and development group is also responsible for enhancing existing solutions and applications, internal tools, and developing new information maps that integrate our customers to their trading partners in compliance with those trading partners’ requirements.\nGeneral and Administrative Expenses. General and administrative expenses consist primarily of personnel costs for finance, human resources, and internal information technology support, as well as legal, accounting, and other fees, such as bad debt expense and credit card processing fees.\nOverhead Allocation. We allocate overhead expenses such as rent, certain employee benefit costs, office supplies and depreciation of general office assets to cost of revenues and operating expenses categories based on headcount.\nOther Metrics\nRecurring Revenue Customers. As of December 31, 2020, we had approximately 33,000 customers with contracts to pay us recurring fees, which we refer to as recurring revenue customers. We report recurring revenue customers as of the end of a period. A small portion of our recurring revenue customers consist of separate units within a larger organization. We treat each of these units, which may include divisions, departments, affiliates and franchises, as distinct customers.\nAverage Recurring Revenues Per Recurring Revenue Customer. We calculate average recurring revenues per recurring revenue customer, which we also refer to as wallet share, by dividing the recurring revenues from recurring revenue customers for the period by the average of the beginning and ending number of recurring revenue customers for the period. For interim periods, we annualize this number by multiplying the quotient calculated above by the quotient of 12 divided by the number of months in the period. We anticipate that average recurring revenues per recurring revenue customer will continue to increase as we increase the number of solutions we offer and increase the penetration of those solutions across our customer base.\nNon-GAAP Financial Measures. To supplement our financial statements, we also provide investors with Adjusted EBITDA and non-GAAP income per share, both of which are non-GAAP financial measures. We believe that these non-GAAP measures provide useful information to management and investors regarding certain financial and business trends relating to our financial condition and results of operations. Our management uses these non-GAAP measures to compare the company’s performance to that of prior periods for trend analyses and planning purposes. Adjusted EBITDA is also used for purposes of determining executive and senior management incentive compensation. These measures are also presented to our board of directors.\nThese non-GAAP measures should not be considered a substitute for, or superior to, financial measures calculated in accordance with GAAP. These non-GAAP financial measures exclude significant expenses and income that are required by GAAP to be recorded in the Company’s financial statements and are subject to inherent limitations. Investors should review the reconciliations of non-GAAP financial measures to the comparable GAAP financial measures that are included in this “Management’s Discussion and Analysis of Financial Condition and Results of Operations.”\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nCritical Accounting Policies and Estimates\nThe discussion of our financial condition and results of operations is based upon our consolidated financial statements, which are prepared in accordance with GAAP. The preparation of these consolidated financial statements requires us to make estimates, judgments and assumptions that affect the reported amounts of assets, liabilities, revenues, costs and expenses and related disclosures. On an ongoing basis, we evaluate our estimates and assumptions. We base our estimates of the carrying value of certain assets and liabilities on historical experience and on various other assumptions that we believe to be reasonable. Our actual results may differ from these estimates under different assumptions or conditions.\nWe believe that our significant accounting policies, which are described in the notes to our consolidated financial statements, involve a greater degree of judgment and complexity and are material to our financial statement presentation. A critical accounting policy is one that is both material to the presentation of our financial statements and requires us to make difficult, subjective, or complex judgments for uncertain matters that could have a material effect on our financial condition and results of operations. Accordingly, these are the policies we believe are the most critical to aid in fully understanding and evaluating our financial condition and results of operations.\nRevenue Recognition\nRevenues are recognized when our services are made available to our customers, in an amount that reflects the consideration we are contractually and legally entitled to in exchange for those services. Our set-up fees from customers are one-time revenues that are specific for each connection a customer has with a trading partner and many of our customers have connections with numerous trading partners. Set-up fees related to our cloud-based supply chain management solutions are nonrefundable upfront fees that are necessary for our customers to utilize our cloud-based services. These set-up fees do not provide any standalone value to our customers.\nCertain contracts contain set-up fees that constitute a material renewal option right. This material right provides customers a significant future incentive that would not be otherwise available to that customer unless they entered into the contract as the set-up fees will not be incurred again upon contract renewal.\nFor our Fulfillment solution, we have determined that the set-up fees and related costs represent a material renewal option right to our customers as they will not be incurred again upon renewal. These set-up fees and related costs are deferred and recognized ratably over two years, which is the estimated period for which a material right is present for our customers.\nFor our Analytics solution, we have determined that the set-up fees do not represent a material customer renewal right and, as such, are deferred and recognized ratably over the estimated initial contract term, which is one year.\nInternal-Use Software\nInternal-use software consists of capitalized costs incurred during the application development stage, which include costs related to the design of the chosen path, coding, installation of the hardware necessary to run the software, and any testing done before the operational stage. Costs incurred during the preliminary project stage and post-implementation stage are expensed as incurred. Internal-use software is depreciated over the estimated useful life, three years, commencing on the date when the asset is ready for its intended use. Depreciation is computed using the straight-line method. Maintenance and enhancements of internal-use software are expensed as incurred.\nBusiness Combinations\nWe allocate the fair value of purchase consideration to the tangible assets acquired, liabilities assumed, and intangible assets acquired based on their estimated fair values. The excess of the fair value of purchase consideration over the fair values of these identifiable assets and liabilities is recorded as goodwill. Such valuations require management to make significant estimates and assumptions, especially with respect to intangible assets.\nSignificant estimates in valuing certain intangible assets include, but are not limited to, future expected cash flows from acquired customers and acquired technology from a market participant perspective, useful lives, and discount rates. Significant estimates in valuing liabilities for contingent consideration include, but are not limited to,\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\ndiscount rates, projected financial results of the acquired businesses based on our most recent internal forecasts, and factors indicating the probability of achieving the forecasted results.\nManagement’s estimates of fair value are based upon assumptions believed to be reasonable, but which are inherently uncertain and unpredictable and, as a result, actual results may differ from estimates. During the measurement period, which is not to exceed one year from the acquisition date, we may record adjustments to the assets acquired and liabilities assumed, with the corresponding offset to goodwill. Upon the conclusion of the measurement period, any subsequent adjustments are recorded to earnings.\nResults of Operations\nYear Ended December 31, 2020 Compared to Year Ended December 31, 2019\nThe following table presents our results of operations for the periods indicated:\nYear Ended December 31,\nChange\n(dollars in thousands)\n% of revenue\n% of revenue\n%\nRevenues\n$\n312,630\n100.0\n%\n$\n279,124\n100.0\n%\n$\n33,506\n12.0\n%\nCost of revenues\n99,836\n31.9\n92,239\n33.0\n7,597\n8.2\nGross profit\n212,794\n68.1\n186,885\n67.0\n25,909\n13.9\nOperating expenses\nSales and marketing\n75,955\n24.3\n70,140\n25.2\n5,815\n8.3\nResearch and development\n31,024\n9.9\n28,305\n10.1\n2,719\n9.6\nGeneral and administrative\n50,119\n16.0\n44,719\n16.0\n5,400\n12.1\nAmortization of intangible assets\n5,538\n1.8\n5,315\n1.9\n4.2\nTotal operating expenses\n162,636\n52.0\n148,479\n53.2\n14,157\n9.5\nIncome from operations\n50,158\n16.0\n38,406\n13.8\n11,752\n30.6\nOther income (expense)\nInterest income, net\n1,103\n0.4\n2,947\n1.0\n(1,844\n)\n(62.6\n)\nOther income (expense), net\n1,334\n0.4\n0.1\n1,062\n390.4\nChange in earn-out liability\n0.0\n0.2\n(360\n)\n(80.9\n)\nTotal other income, net\n2,522\n0.8\n3,664\n1.3\n(1,142\n)\n(31.2\n)\nIncome before income taxes\n52,680\n16.9\n42,070\n15.1\n10,610\n25.2\nIncome tax expense\n7,094\n2.3\n8,358\n3.0\n(1,264\n)\n(15.1\n)\nNet income\n$\n45,586\n14.6\n%\n$\n33,712\n12.1\n%\n$\n11,874\n35.2\n%\n'% of revenue' subtotals may not foot due to rounding\nRevenues. The increase in revenues resulted from two primary factors: the increase in recurring revenue customers, which is driven by continued business growth and by business acquisitions, and the increase in average recurring revenues per recurring revenue customer, which we also refer to as wallet share.\n•\nThe number of recurring revenue customers increased 8% to 33,151 at December 31, 2020 from 30,771 at December 31, 2019.\n•\nWallet share increased 6% to $9,231 at December 31, 2020 from $8,722 at December 31, 2019. This was primarily attributable to increased usage of our solutions by our recurring revenue customers.\nRecurring revenues from recurring revenue customers increased 13% in 2020, as compared to 2019, and accounted for 94% of our total revenues in 2020, unchanged from 94% in 2019. We anticipate that the number of recurring revenue customers and wallet share will continue to increase as we increase the number of solutions we offer and increase the penetration of those solutions across our customer base.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nCost of Revenues. The increase in cost of revenues was primarily due to increased headcount which resulted in an increase of $5.5 million in personnel-related costs, such as salaries and benefits, and an increase of $1.1 million in stock-based compensation expense. Additionally, a $1.5 million increase in depreciation expense pertaining to continued investment in infrastructure to support our platform contributed to the increase in cost of revenue. Last, $0.5 million increase in software subscriptions utilized in optimizing internal productivity. The increases were partially offset by a decrease of $1.0 million in network costs.\nSales and Marketing Expenses. The increase in sales and marketing expense was primarily due to increased headcount which resulted in increases of $2.7 million in personnel-related costs, such as salaries and benefits, and an increase of $1.2 million in stock-based compensation expense. The increase was also partially related to a $1.2 million increase in variable compensation earned by referral partners. Additionally, increases of $0.4 million in promotional expenses and $0.4 million in software subscriptions utilized in optimizing internal productivity.\nResearch and Development Expenses. The increase in research and development expense was primarily due to increased headcount which resulted in an increase of $0.7 million in personnel-related costs, such as salaries and benefits, and an increase of $1.0 million in stock-based compensation expense. The increase was also partially related to increases in occupancy expense of $0.4 million, depreciation expense of $0.3 million, and $0.3 million in software subscriptions utilized in optimizing internal productivity.\nGeneral and Administrative Expenses. The increase in general and administrative expense was primarily due to continued business growth which resulted in increases of $2.2 million in bad debt expense and $0.4 million in credit card fees. Additionally, increases of $2.0 million in charitable donations and $1.0 million in stock-based compensation expenses led to the overall increase, partially offset by a decrease of $0.2 million in personnel-related costs.\nAmortization of Intangible Assets. The increase in amortization of intangible assets was driven by the amortization of the acquired intangible assets related to Data Masons.\nOther Income (Expense). The decrease in interest income, net, other income (expense), net, and change in earn-out liability was primarily due to decreased interest income from investments and the decrease in the fair value of the earn-out liability, offset by increased realized gains from foreign currency on cash and investments held. The change in fair value of the earn-out liability was driven by an adjustment to the fair value of the EDIAdmin earnout liability due to actual revenue at the earn-out measurement date of December 31, 2020.\nIncome Tax Expense. The decrease in income tax expense was primarily due to the increase in excess tax deductions from stock activity which decreases income tax expense, partially offset by increases in pre-tax net income. See Note M to our consolidated financial statements, included in this Annual Report on Form 10-K, for additional information regarding our income taxes.\nAdjusted EBITDA. Adjusted EBITDA, which is a non-GAAP measure of financial performance, consists of net income adjusted for depreciation and amortization, investment income (interest income/expense, realized investments gain/loss excluding realized gain/loss from foreign currency on investments), income tax expense, stock-based compensation expense, realized gain/loss from foreign currency on cash and investments held, and other adjustments as necessary for a fair presentation. Other adjustments included the impact of the fair value adjustment for the EDIAdmin earn-out liability, returned escrow shares in 2019 related to the acquisition of Toolbox, and impairment of internally developed software. As part of executing a lease amendment, we incurred accelerated depreciation, included within Depreciation and Amortization, and offsetting accelerated tenant improvement benefit, included within Other. The following table provides a reconciliation of net income to Adjusted EBITDA:\nYear Ended December 31,\n(in thousands)\nNet income\n$\n45,586\n$\n33,712\nDepreciation and amortization\n18,665\n16,438\nInvestment income, net\n(1,208\n)\n(2,947\n)\nIncome tax expense\n7,094\n8,358\nStock-based compensation expense\n18,936\n14,690\nRealized gain from foreign currency on cash and investments held\n(1,753\n)\n-\nOther\n(326\n)\n(488\n)\nAdjusted EBITDA\n$\n86,994\n$\n69,763\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nNon-GAAP Income per Share. Non-GAAP income per share, which is also a non-GAAP measure of financial performance, consists of net income plus stock-based compensation expense, amortization expense related to intangible assets, realized gain/loss from foreign currency on cash and investments held, and other adjustments as necessary for a fair presentation, divided by the weighted average number of shares of common stock outstanding during each period. Other adjustments included the impact of the fair value adjustment for the EDIAdmin earn-out liability, returned escrow shares in 2019 related to the acquisition of ToolBox, and impairment of internally developed software. As part of executing a lease amendment, we incurred accelerated depreciation, included within Depreciation and Amortization, and offsetting accelerated tenant improvement benefit, included within Other.\nTo quantify the tax effects, we recalculated income tax expense excluding the direct book and tax effects of the specific items constituting the non-GAAP adjustments. The difference between this recalculated income tax expense and GAAP income tax expense is presented as the income tax effect of the non-GAAP adjustments.\nThe following table provides a reconciliation of net income to non-GAAP income per share:\nYear Ended December 31,\n(in thousands, except per share amounts)\nNet income\n$\n45,586\n$\n33,712\nStock-based compensation expense\n18,936\n14,690\nAmortization of intangible assets\n5,538\n5,315\nRealized gain from foreign currency on cash and investments held\n(1,753\n)\n-\nOther\n(326\n)\n(488\n)\nIncome tax effects of adjustments\n(12,285\n)\n(7,304\n)\nNon-GAAP income\n$\n55,696\n$\n45,925\nShares used to compute non-GAAP income per share\nBasic\n35,226\n35,024\nDiluted\n36,285\n36,002\nNon-GAAP income per share\nBasic\n$\n1.58\n$\n1.31\nDiluted\n$\n1.53\n$\n1.28\nYear Ended December 31, 2019 Compared to Year Ended December 31, 2018\nThe discussion of our results from operations for the year ended December 31, 2019 compared to the year ended December 31, 2018 can be found in Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in the Company’s Annual Report on Form 10-K for the year ended December 31, 2019.\nLiquidity and Capital Resources\nAt December 31, 2020, our principal sources of liquidity were cash and cash equivalents, certificates of deposit, and short-term investments totaling $187.5 million, and accounts receivable, net of allowance for credit losses, of $33.6 million, compared to $213.5 million and $31.5 million, respectively at December 31, 2019. Certificates of deposit and investments are invested in accordance with our investment policy, with a goal of maintaining liquidity and capital preservation. Our cash equivalents and short-term investments are held in highly liquid money market funds, commercial paper, federal agency securities and corporate debt securities.\nThe table below summarizes the activity within the consolidated statement of cash flows:\nTwelve Months Ended\nDecember 31,\n(in thousands)\nNet cash provided by operating activities\n$\n88,562\n$\n71,794\nNet cash used in investing activities\n(120,469\n)\n(14,313\n)\nNet cash provided by (used in) financing activities\n$\n2,328\n$\n(12,142\n)\nThe discussion of our liquidity and capital resources for the year ended December 31, 2019 compared to the year ended December 31, 2018 can be found in Part II, Item 7, “Management’s Discussion and Analysis of\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nFinancial Condition and Results of Operations” in the Company’s Annual Report on Form 10-K for the year ended December 31, 2019.\nNet Cash Flows from Operating Activities\nThe increase in operating cash flows was primarily driven by continued business growth, which resulted in increased net income.\nNet Cash Flows from Investing Activities\nThe decrease in cash used in investing activities was primarily due to an additional $87.2 million in cash used for acquisitions of business and intangible assets, driven by the larger acquisition in 2020 as compared to 2019. Additionally, the change was due to a $16.1 million increase in purchases of investments, net of maturities in 2020.\nNet Cash Flows from Financing Activities\nThis change was primarily due to the $12.4 million increase in net proceeds from stock option exercises.\nEffect of Foreign Currency Exchange Rate Changes\nFor information regarding the effect of foreign currency exchange rate changes, refer to the section entitled “Foreign Currency Exchange Risk,” included in Part II, Item 7A, “Quantitative and Qualitative Disclosures About Market Risk” of this Annual Report on Form 10-K.\nAdequacy of Capital Resources\nOur future capital requirements may vary significantly from those now planned and will depend on many factors, including:\n•\ncosts to develop and implement new solutions and applications, if any;\n•\nsales and marketing resources needed to further penetrate our market and gain acceptance of new solutions and applications that we may develop;\n•\nexpansion of our operations in the U.S. and internationally;\n•\nresponse of competitors to our solutions and applications; and\n•\nuse of capital for acquisitions, if any.\nHistorically, we have experienced increases in our expenditures consistent with the growth in our operations and personnel, and we anticipate that our expenditures will continue to increase as we expand our business.\nWe believe our cash, cash equivalents, investments, and cash flows from our operations will be sufficient to meet our working capital and capital expenditure requirements for at least the next twelve months.\nDuring the last three years, inflation and changing prices have not had a material effect on our business and we do not expect that inflation or changing prices will materially affect our business in the foreseeable future.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements, investments in special purpose entities or undisclosed borrowings or debt. Additionally, we are not a party to any derivative contracts or synthetic leases.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nContractual and Commercial Commitment Summary\nOur contractual obligations and commercial commitments as of December 31, 2020 are summarized below:\nPayments Due by Period (in thousands)\nLess Than\nMore Than\nContractual Obligations\n1 Year\n1-3 Years\n3-5 Years\n5 Years\nTotal\nOperating lease obligations, including imputed interest\n$\n3,728\n$\n9,130\n$\n7,785\n$\n4,753\n$\n25,396\nPurchase commitments\n$\n6,512\n$\n11,413\n$\n-\n$\n-\n17,925\n$\n10,240\n$\n20,543\n$\n7,785\n$\n4,753\n$\n43,321\nRecent Accounting Pronouncements\nFor information regarding recent accounting pronouncements, refer to Note A, General, in our Notes to Consolidated Financial Statements in the sections entitled “Recently Adopted Accounting Pronouncements” and “Accounting Pronouncements Not Yet Adopted” as applicable, included in Part II, Item 8, “Financial Instruments and Supplementary Data” of this Annual Report on Form 10-K.",
    "item_7A": "Item 7A.\nQuantitative and Qualitative Disclosures About Market Risk\nInterest Rate Sensitivity Risk. The principal objectives of our investment activities are to preserve principal, provide liquidity and maximize income consistent with minimizing risk of material loss. We are exposed to market risk related to changes in interest rates. However, based on the nature and current level of our investments (primarily cash and cash equivalents, which approximate fair value due to their short maturities, certificates of deposit and marketable securities), we believe there is no material risk exposure. We do not enter into investments for trading or speculative purposes.\nWe did not have any variable interest rate outstanding debt as of December 31, 2020 and 2019. We therefore do not have any material risk to interest rate fluctuations.\nForeign Currency Exchange Risk. We have revenue, expenses, assets, and liabilities that are denominated in currencies other than the U.S. dollar, primarily the Australian and Canadian dollars. As of December 31, 2020, we maintained approximately 7% of our total cash and cash equivalents outside of the U.S. in foreign currencies, primarily in Australian and Canadian dollars. Our results of operations and cash flows were not materially affected by fluctuation in foreign currency exchange rates and we believe that a hypothetical 10% change in foreign currency exchange rates or an inability to access foreign funds would not materially affect our ability to meet our operational needs or result in a material foreign currency loss in the future. As we expand internationally, our results of operations and cash flows may be impacted by changes in foreign currency exchange rates and would be adversely impacted when the U.S. dollar appreciates relative to other foreign currencies. We have not used any forward contracts or currency borrowings to hedge our exposure to foreign currency exchange risk, although we may do so in the future.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020",
    "item_8": "Item 8.\nFinancial Statements and Supplementary Data\nSPS Commerce, Inc. and Subsidiaries Consolidated Financial Statements\nReports of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets\nConsolidated Statements of Comprehensive Income\nConsolidated Statements of Stockholders’ Equity\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nSPS Commerce, Inc.:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of SPS Commerce, Inc. and subsidiaries (the Company) as of December 31, 2020 and 2019, the related consolidated statements of comprehensive income, stockholders’ equity, and cash flows for each of the years in the three-year period ended December 31, 2020, and the related notes (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2020 and 2019, and the results of its operations and its cash flows for each of the years in the three-year period ended December 31, 2020, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2020, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission, and our report dated February 23, 2021 expressed an unqualified opinion on the effectiveness of the Company’s internal control over financial reporting.\nChange in Accounting Principle\nAs discussed in Note A to the consolidated financial statements, the Company has changed its method of accounting for leases as of January 1, 2019 due to the adoption of Financial Accounting Standards Board’s Accounting Standards Codification (ASC) Topic 842, Leases.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nAssessment of the capitalized internal costs to develop internal-use software\nAs discussed in Note A to the consolidated financial statements, the Company capitalizes costs incurred to develop internal-use software during the application development stage. Capitalized internal-use software is recorded within property and equipment and depreciated over the estimated useful life.\nWe identified the assessment of the capitalized internal costs to develop internal-use software as a critical audit matter. Subjective auditor judgment was required to assess the stage of software development for new internal-use software or upgrades and enhancements for existing internal-use software, which determines when costs should be capitalized.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls related to the Company’s internal-use software process. This included controls related to the evaluation and approval of new internal-use software projects or upgrades and enhancements to existing internal-use software projects, monitoring of the software development stage, and capitalization of internal costs. We examined a sample of capitalized internal-use software costs to evaluate costs that were capitalized for new internal-use software or upgrades and enhancements for existing internal-use software. For each sample, we evaluated the capitalized costs and assessed the stage of software development by inspecting underlying documentation and inquiring of the Company’s technology developers performing the internal-use software development activities regarding the specific nature, stage of completion, and hours incurred on the project.\nEvaluation of the acquisition-date fair value of subscriber relationships and developed technology intangible assets\nAs discussed in Notes A and B to the consolidated financial statements, on December 16, 2020, the Company acquired Data Masons for a purchase price of $100 million. The Company records all assets and liabilities, including intangible assets, acquired in a business combination at fair value. As a result of the transaction, the Company acquired subscriber relationships and developed technology intangible assets. The acquisition-date fair value for these assets was $17.6 million and $25.4 million, respectively.\nWe identified the evaluation of the acquisition-date fair value of subscriber relationships and developed technology intangible assets as a critical audit matter. A higher degree of subjective auditor judgment was required in evaluating assumptions regarding future revenue growth rates from acquired subscriber relationships and acquired technology and discount rates used in the respective fair value measurements.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls related to the Company’s acquisition-date valuation process. This included controls related to the development of the future revenue growth rates and discount rates. To assess the future revenue growth rates used in the valuations, we compared forecasted revenue to Data Masons’ historical actual results, and we evaluated the future revenue growth rates from existing customers by comparing the future revenue growth rates to those of comparable companies and industry data. In addition, we involved valuation professionals with specialized skills and knowledge, who assisted in:\n-\nevaluating the discount rates by comparing them against discount rates ranges that were independently developed using publicly available market data for comparable companies, and\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\n-\nperforming a sensitivity analysis by developing estimates of the acquisition-date fair value of the subscriber relationships and developed technology intangible assets using reasonably possible changes to forecasted revenue and the independently developed discount rates, and comparing the results to the Company’s fair value estimates.\n/s/ KPMG LLP\nWe have served as the Company’s auditor since 2013.\nMinneapolis, Minnesota\nFebruary 23, 2021\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nSPS Commerce, Inc.:\nOpinion on Internal Control Over Financial Reporting\nWe have audited SPS Commerce, Inc. and subsidiaries’ (the Company) internal control over financial reporting as of December 31, 2020, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2020, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2020 and 2019, the related consolidated statements of comprehensive income, stockholders’ equity, and cash flows for each of the years in the three-year period ended December 31, 2020, and the related notes (collectively, the consolidated financial statements), and our report dated February 23, 2021, expressed an unqualified opinion on those consolidated financial statements.\nThe Company acquired the Data Masons business during 2020, and management excluded from its assessment of the effectiveness of the Company’s internal control over financial reporting as of December 31, 2020, Data Masons’ internal control over financial reporting associated with total assets of approximately 3% and total revenues of less than 1%, in the consolidated financial statements of the Company as of and for the year ended December 31, 2020. Our audit of internal control over financial reporting of the Company also excluded an evaluation of the internal control over financial reporting of the Data Masons business.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Annual Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ KPMG LLP\nMinneapolis, Minnesota\nFebruary 23, 2021\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nSPS COMMERCE, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nDecember 31,\n(in thousands, except shares)\nASSETS\nCURRENT ASSETS\nCash and cash equivalents\n$\n149,692\n$\n179,252\nShort-term investments\n37,786\n34,284\nAccounts receivable\n37,811\n33,001\nAllowance for credit losses\n(4,233\n)\n(1,469\n)\nAccounts receivable, net\n33,578\n31,532\nDeferred costs\n37,988\n35,274\nOther assets\n12,312\n11,279\nTotal current assets\n271,356\n291,621\nPROPERTY AND EQUIPMENT, net\n26,432\n23,752\nOPERATING LEASE RIGHT-OF-USE ASSETS\n15,581\n15,744\nGOODWILL\n134,853\n76,845\nINTANGIBLE ASSETS, net\n60,230\n22,668\nINVESTMENTS\n2,500\n-\nOTHER ASSETS\nDeferred costs, non-current\n12,607\n11,667\nDeferred income tax assets\n2,630\nOther assets, non-current\n2,705\n2,513\nTotal assets\n$\n526,458\n$\n447,440\nLIABILITIES AND STOCKHOLDERS’ EQUITY\nCURRENT LIABILITIES\nAccounts payable\n$\n5,354\n$\n4,274\nAccrued compensation\n22,872\n22,303\nAccrued expenses\n11,161\n6,207\nDeferred revenue\n37,947\n31,463\nOperating lease liabilities\n2,798\n3,783\nTotal current liabilities\n80,132\n68,030\nOTHER LIABILITIES\nDeferred revenue, non-current\n2,996\n2,851\nOperating lease liabilities, non-current\n19,672\n20,085\nDeferred income tax liabilities\n2,937\n1,193\nOther liabilities, non-current\n-\nTotal liabilities\n105,737\n92,564\nCOMMITMENTS and CONTINGENCIES\nSTOCKHOLDERS’ EQUITY\nPreferred stock, $0.001 par value; 5,000,000 shares authorized; 0 shares issued and outstanding\n-\n-\nCommon stock, $0.001 par value; 110,000,000 and 55,000,000 shares authorized; 37,100,467 and 36,104,619 shares issued; and 35,487,217 and 34,863,271 shares outstanding, respectively\nTreasury stock, at cost; 1,613,250 and 1,241,348 shares, respectively\n(65,247\n)\n(46,297\n)\nAdditional paid-in capital\n393,462\n354,115\nRetained earnings\n93,490\n48,973\nAccumulated other comprehensive loss\n(1,021\n)\n(1,951\n)\nTotal stockholders’ equity\n420,721\n354,876\nTotal liabilities and stockholders’ equity\n$\n526,458\n$\n447,440\nSee accompanying notes to these consolidated financial statements.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nSPS COMMERCE, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nYear Ended December 31,\n(in thousands, except per share amounts)\nRevenues\n$\n312,630\n$\n279,124\n$\n248,240\nCost of revenues\n99,836\n92,239\n81,748\nGross profit\n212,794\n186,885\n166,492\nOperating expenses\nSales and marketing\n75,955\n70,140\n71,719\nResearch and development\n31,024\n28,305\n22,087\nGeneral and administrative\n50,119\n44,719\n41,862\nAmortization of intangible assets\n5,538\n5,315\n4,093\nTotal operating expenses\n162,636\n148,479\n139,761\nIncome from operations\n50,158\n38,406\n26,731\nOther income (expense)\nInterest income, net\n1,103\n2,947\n2,329\nOther income (expense), net\n1,334\n(626\n)\nChange in earn-out liability\n(94\n)\nTotal other income, net\n2,522\n3,664\n1,609\nIncome before income taxes\n52,680\n42,070\n28,340\nIncome tax expense\n7,094\n8,358\n4,468\nNet income\n$\n45,586\n$\n33,712\n$\n23,872\nOther comprehensive income (expense)\nForeign currency translation adjustments\n1,097\n1,290\n(3,999\n)\nUnrealized gain (loss) on investments, net of tax of ($3), $122 and $132\n(10\n)\nReclassification of unrealized gain on investments into earnings, net of tax of ($52), ($133) and ($91)\n(157\n)\n(398\n)\n(273\n)\nTotal other comprehensive income (expense)\n1,259\n(3,875\n)\nComprehensive income\n$\n46,516\n$\n34,971\n$\n19,997\nNet income per share\nBasic\n$\n1.29\n$\n0.96\n$\n0.69\nDiluted\n$\n1.26\n$\n0.94\n$\n0.68\nWeighted average common shares used to compute net income per share\nBasic\n35,226\n35,024\n34,392\nDiluted\n36,285\n36,002\n35,212\nSee accompanying notes to these consolidated financial statements.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nSPS COMMERCE, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS' EQUITY\nRetained\nAccumulated\nAdditional\nEarnings\nOther\nTotal\nCommon Stock\nTreasury Stock\nPaid-in\n(Accumulated\nComprehensive\nStockholders'\n(in thousands, except shares)\nShares\nAmount\nShares\nAmount\nCapital\nDeficit)\nIncome (Loss)\nEquity\nBalances, December 31, 2017\n34,254,012\n$\n244,294\n$\n(5,815\n)\n$\n301,846\n$\n(8,611\n)\n$\n$\n288,111\nStock-based compensation\n-\n-\n-\n-\n11,270\n-\n-\n11,270\nExercise of stock options and issuance of restricted stock\n866,398\n-\n-\n14,342\n-\n-\n14,344\nEmployee stock purchase plan\n69,596\n-\n-\n-\n1,745\n-\n-\n1,745\nRepurchases of common stock\n(579,490\n)\n-\n579,490\n(19,864\n)\n-\n-\n(19,864\n)\nStock issued for acquisition\n80,956\n-\n-\n-\n3,371\n-\n-\n3,371\nNet income\n-\n-\n-\n-\n-\n23,872\n-\n23,872\nForeign currency translation adjustments\n-\n-\n-\n-\n-\n-\n(3,999\n)\n(3,999\n)\nUnrealized gain on investments, net of tax\n-\n-\n-\n-\n-\n-\nReclassification of gain on investments into earnings, net of tax\n-\n-\n-\n-\n-\n-\n(273\n)\n(273\n)\nBalances, December 31, 2018\n34,691,472\n$\n823,784\n$\n(25,679\n)\n$\n332,574\n$\n15,261\n$\n(3,218\n)\n$\n318,974\nStock-based compensation\n-\n-\n-\n-\n13,365\n-\n-\n13,365\nExercise of stock options and issuance of restricted stock\n536,034\n-\n-\n-\n6,207\n-\n-\n6,207\nEmployee stock purchase plan\n58,851\n-\n-\n-\n2,269\n-\n-\n2,269\nRepurchases of common stock\n(417,564\n)\n-\n417,564\n(20,618\n)\n-\n-\n-\n(20,618\n)\nSettlement and subsequent return of shares\n(5,522\n)\n-\n-\n-\n(300\n)\n-\n-\n(300\n)\nNet income\n-\n-\n-\n-\n-\n33,712\n-\n33,712\nForeign currency translation adjustments\n-\n-\n-\n-\n-\n-\n1,290\n1,290\nUnrealized gain on investments, net of tax\n-\n-\n-\n-\n-\n-\nReclassification of gain on investments into earnings, net of tax\n-\n-\n-\n-\n-\n-\n(398\n)\n(398\n)\nAdoption of ASU 2018-02\n-\n-\n-\n-\n-\n-\nBalances, December 31, 2019\n34,863,271\n$\n1,241,348\n$\n(46,297\n)\n$\n354,115\n$\n48,973\n$\n(1,951\n)\n$\n354,876\nStock-based compensation\n-\n-\n-\n-\n17,382\n-\n-\n17,382\nExercise of stock options and issuance of restricted stock\n934,015\n-\n-\n18,591\n-\n-\n18,592\nEmployee stock purchase plan\n61,833\n-\n-\n-\n3,374\n-\n-\n3,374\nRepurchases of common stock\n(371,902\n)\n-\n371,902\n(18,950\n)\n-\n-\n-\n(18,950\n)\nNet income\n-\n-\n-\n-\n-\n45,586\n-\n45,586\nForeign currency translation adjustments\n-\n-\n-\n-\n-\n-\n1,097\n1,097\nUnrealized loss on investments, net of tax\n-\n-\n-\n-\n-\n-\n(10\n)\n(10\n)\nReclassification of gain on investments into earnings, net of tax\n-\n-\n-\n-\n-\n-\n(157\n)\n(157\n)\nAdoption of ASU 2016-13\n-\n-\n-\n-\n-\n(1,069\n)\n-\n(1,069\n)\nBalances, December 31, 2020\n35,487,217\n$\n1,613,250\n$\n(65,247\n)\n$\n393,462\n$\n93,490\n$\n(1,021\n)\n$\n420,721\nSee accompanying notes to these consolidated financial statements.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nSPS COMMERCE, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYear Ended December 31,\n(in thousands)\nCash flows from operating activities\nNet income\n$\n45,586\n$\n33,712\n$\n23,872\nReconciliation of net income to net cash provided by operating\nactivities\nDeferred income taxes\n4,241\n7,581\n2,798\nChange in earn-out liability\n(85\n)\n(445\n)\nDepreciation and amortization of property and equipment\n13,127\n11,123\n8,593\nAmortization of intangible assets\n5,538\n5,315\n4,093\nProvision for credit losses\n5,660\n3,499\n2,592\nStock-based compensation\n18,936\n14,690\n12,510\nOther, net\n(24\n)\n(574\n)\n(364\n)\nChanges in assets and liabilities, net of effects of\nacquisition\nAccounts receivable\n(5,922\n)\n(6,771\n)\n(4,569\n)\nDeferred costs\n(3,414\n)\n(1,441\n)\n(5,564\n)\nOther current and non-current assets\n1,201\n(2,768\n)\n(3,333\n)\nAccounts payable\n1,214\n(489\n)\nAccrued compensation\n(1,257\n)\n3,957\nAccrued expenses\n(135\n)\nDeferred revenue\n4,432\n6,366\n7,094\nDeferred rent\n-\n-\n2,440\nOperating leases\n(1,234\n)\n-\nNet cash provided by operating activities\n88,562\n71,794\n55,015\nCash flows from investing activities\nPurchases of property and equipment\n(16,467\n)\n(13,585\n)\n(13,750\n)\nPurchases of investments\n(74,797\n)\n(73,700\n)\n(81,666\n)\nMaturities of investments\n69,461\n84,472\n82,224\nAcquisition of business and intangible assets, net\n(98,666\n)\n(11,500\n)\n(27,273\n)\nNet cash used in investing activities\n(120,469\n)\n(14,313\n)\n(40,465\n)\nCash flows from financing activities\nRepurchases of common stock\n(18,950\n)\n(20,618\n)\n(19,864\n)\nNet proceeds from exercise of options to purchase common stock\n18,592\n6,207\n14,344\nNet proceeds from employee stock purchase plan\n3,374\n2,269\n1,745\nPayment for earn-out liability\n(688\n)\n-\n-\nNet cash provided by (used in) financing activities\n2,328\n(12,142\n)\n(3,775\n)\nEffect of foreign currency exchange rate changes\n(43\n)\nNet increase (decrease) in cash and cash equivalents\n(29,560\n)\n45,393\n10,732\nCash and cash equivalents at beginning of year\n179,252\n133,859\n123,127\nCash and cash equivalents at end of year\n$\n149,692\n$\n179,252\n$\n133,859\nSupplemental disclosure of cash flow information\nCash paid for income taxes, net\n$\n1,656\n$\n1,545\n$\n1,534\nNon-cash financing activities:\nNet purchases of property and equipment on account\n(551\n)\nCommon stock issued for business acquisitions\n-\n-\n3,371\nSee accompanying notes to these consolidated financial statements.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nSPS COMMERCE, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE A - General\nBusiness Description\nSPS Commerce is a leading provider of cloud-based supply chain management solutions that make it easier for retailers, suppliers, distributors, and logistics firms to orchestrate the management of item data, order fulfillment, inventory control and sales analytics across all channels. Implementing and maintaining a suite of supply chain management capabilities is resource intensive and is not a core competency for most businesses.\nThe services offered by SPS Commerce eliminate the need for on-premise software and support staff by taking on that capability on the customer’s behalf. The solutions SPS Commerce provides enable our customers to increase their supply cycle agility, optimize their inventory levels and sell-through, reduce operational costs and gain increased visibility into customer orders, ensuring that suppliers, distributors, and logistics firms can satisfy retailer requirements.\nBasis of Presentation\nThe accompanying consolidated financial statements have been prepared in conformity with accounting principles generally accepted in the United States of America (“GAAP”) and include the accounts of SPS Commerce, Inc. and its subsidiaries. All intercompany accounts and transactions have been eliminated in the consolidated financial statements.\nEffective January 1, 2020, we adopted Accounting Standards Update (“ASU”) No. 2016-13, Financial Instruments - Credit Losses (Topic 326) with a modified-retrospective approach and recorded a $1.1 million cumulative-effect adjustment to retained earnings.\nOn July 25, 2019, we announced that our board of directors declared a two-for-one stock split of our common stock, effected in the form of a 100 percent stock dividend as of the record date on August 8, 2019. The stock split dividend was distributed on August 22, 2019. Earnings per share and weighted average shares outstanding are presented in this Annual Report on Form 10-K after the effect of the 100 percent stock dividend. The two-for-one stock split is reflected in the share amounts in all periods presented in this Annual Report on Form 10-K.\nForeign Currency Translation\nThe functional currency of our foreign operations is generally the applicable local currency. The functional currency is translated into U.S. dollars for balance sheet accounts using current exchange rates in effect as of the balance sheet date and for revenue and expense accounts using an average exchange rate during the year. The translation adjustments are deferred as a component of other comprehensive income within the consolidated statements of comprehensive income and the consolidated statements of stockholders' equity. Gains or losses resulting from transactions denominated in foreign currencies, if any, are included in other income (expense), net in our consolidated statements of comprehensive income.\nUse of Estimates\nPreparing financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods. Actual results could differ from those estimates.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nBusiness Combinations\nWe recognize the fair value of the assets acquired and the liabilities assumed at the acquisition date, separately from goodwill. Goodwill as of the acquisition date is measured as the excess of consideration transferred and the amount of the assets acquired and the liabilities assumed.\nAssets acquired include tangible and intangible assets. We use estimates and assumptions that we believe are reasonable as a part of the purchase price allocation, which includes the process to determine the value and useful lives of purchased intangible assets and the process to determine the value of any contingent consideration liabilities. We recorded the acquisition-date fair value of any contingent liabilities, such as earn-out provisions, as part of the consideration transferred. The earn-out liability fair value is subsequently remeasured at each reporting date. The Company evaluates each contingent consideration to determine the valuation approach. See Notes B and E for valuation methods utilized in the fair value remeasurement as of the reporting date.\nWhile we believe these estimates and assumptions are reasonable, they are inherently uncertain and subject to refinement. As a result, during the measurement period, which may be up to one year from the acquisition date, we may record adjustments to the fair value of the assets acquired and the liabilities assumed. Any such adjustments would be recorded as an offset to goodwill or a working capital adjustment as applicable. Upon the conclusion of the measurement period or final determination of the fair values, whichever comes first, any subsequent adjustments would be recorded in our consolidated statements of comprehensive income.\nSegment Information\nWe operate in and report on one segment, which is supply chain management solutions.\nRisk and Uncertainties\nWe rely on hardware and software licensed from third parties to offer our on-demand solutions. Our management believes alternate sources are available; however, disruption or termination of these relationships could adversely affect our operating results in the near term.\nConcentration of Credit Risk\nFinancial instruments that potentially subject us to concentrations of credit risk consist principally of cash and cash equivalents in financial institutions in excess of federally insured limits and accounts receivable. Cash and cash equivalents are held with financial institutions that we believe are subject to minimal risk.\nCash and Cash Equivalents\nCash and cash equivalents consist of cash and highly liquid investments with original maturities of less than 90 days. Cash and cash equivalents are stated at fair value.\nInvestments\nManagement determines the appropriate classification of certificates of deposit and marketable securities at the time of purchase and reevaluates such determination at each balance sheet date. Securities are classified as available for sale and are carried at fair value, with the change in unrealized gains and losses, net of tax, reported as unrealized gains on investments on the consolidated statements of comprehensive income. Fair value is determined based on quoted market rates when observable or utilizing data points that are observable, such as quoted prices, interest rates and yield curves. When a determination has been made that an other-than-temporary decline in fair value has occurred, the amount of the decline that is related to a credit loss is realized and is included in other income (expense), net in the consolidated statements of comprehensive income.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nFair Value of Other Financial Instruments\nThe carrying amounts of our short-term financial instruments, which include cash, cash equivalents, accounts receivable, and accounts payable, approximates fair value due to their short-term nature.\nAccounts Receivable\nAccounts receivable are initially recorded upon the sale of solutions to customers. Credit is granted in the normal course of business without collateral. Accounts receivable are stated net of allowances for credit losses, which represent estimated losses resulting from the inability of certain customers to make the required payments. When determining the allowance, we pool our outstanding accounts receivable invoices based on the contractual due date of payment at the balance sheet date. We take several factors into consideration for estimated credit losses by pool, primarily our historical credit losses, with additional adjustments made for current and future macro-economic conditions and retail bankruptcy trends. We write-off accounts receivable when they are determined to be uncollectible. Changes in the allowance are recorded as bad debt expense and are included in general and administrative expense in our consolidated statements of comprehensive income.\nProperty and Equipment\nProperty and equipment, including assets acquired under capital lease obligations, are stated at cost, net of accumulated depreciation and amortization. Depreciation and amortization are computed using the straight-line method over the estimated useful lives when placed in service, which are:\nComputer equipment and software: 2 to 3 years\nOffice equipment and furniture: 5 to 7 years\nLeasehold improvements: the shorter of the useful life of the asset or the remaining term of the lease\nSignificant additions or improvements extending asset lives beyond one year are capitalized, while repairs and maintenance are charged to expense as incurred.\nWe capitalize and amortize eligible costs to acquire or develop internal-use software that are incurred during the application development stage. Costs incurred during the preliminary project stage and post-implementation stage are expensed as incurred. Internal-use software is depreciated over the estimated useful life, three years, commencing on the date when the asset is ready for its intended use. Depreciation is computed using the straight-line method. Maintenance and enhancements of internal-use software are expensed as incurred.\nThe assets and related accumulated depreciation and amortization are adjusted for asset retirements and disposals and abandoned internal-use software with the resulting gain or loss included in our consolidated statements of comprehensive income.\nLeases\nWe determine if an arrangement is a lease at inception. Operating leases are included in operating lease right-of-use assets, current operating lease liabilities, and long-term operating lease liabilities in our consolidated balance sheets.\nRight-of-use (“ROU”) assets represent our right to use an underlying asset for the lease term and lease liabilities represent our obligation to make lease payments arising from the lease. Operating lease ROU assets and liabilities are recognized at commencement date based on the present value of lease payments over the lease term. We estimate the discount rate for a similar collateralized asset by estimating costs of borrowing. We use the implicit interest rate when readily determinable. The operating lease ROU asset also includes any lease payments made and lease incentives that have been incurred. The options to extend our leases are not recognized as part of our ROU assets and lease liabilities unless it is reasonably certain that we will exercise that option. Lease expense for lease payments is recognized on a straight-line basis over the lease term. For all leases, we combine non-lease components with the related lease components and account for it as a single lease component. The ROU assets are subject to the same impairment process as our long-lived assets. Additionally, we review our lease liabilities for remeasurement whenever there is a triggering event or when relevant facts and circumstances change.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nResearch and Development\nResearch and development costs primarily include maintenance and data conversion activities related to our cloud-based supply chain management solutions and are expensed as incurred.\nGoodwill\nGoodwill represents the excess of the purchase price over the fair value of identifiable net assets acquired in business combinations. We test goodwill for impairment annually at November 30, or more frequently if events or changes in circumstances indicate that the asset might be impaired. The impairment test is conducted by comparing the fair value of the net assets with the carrying amount of the reporting unit. We determine the fair value of the reporting unit based on our market capitalization at the testing date. If the carrying amount exceeds the fair value of the reporting unit, we would recognize an impairment loss in the consolidated statements of comprehensive income, to the extent that the carrying amount exceeds fair value.\nIntangible Assets\nAssets acquired in business combinations may include identifiable intangible assets such as subscriber relationships, developed technology, and non-competition agreements. We recognize the fair value of the identifiable intangible assets acquired separately from goodwill. We have determined the fair value and useful lives of our purchased intangible assets using certain estimates and assumptions that we believe are reasonable.\nThe purchased intangible assets are being amortized on a straight-line basis over their estimated useful lives, which are seven to ten years for subscriber relationships, three to five years for non-competition agreements and three to ten years for acquired technology.\nThird Party Implementation Assets\nThird party implementation costs are capitalized assets included in Other Assets and relate to implementation costs incurred for software hosting arrangements.\nCapitalized implementation costs are recognized on a straight-line basis beginning when the application is ready for its intended use and ending on the expected termination date of the hosting arrangement, including consideration of the noncancelable contractual term and reasonably certain renewals.\nThe terms are between four and six years for our current hosting arrangements. Recognized expense is reported in general and administrative expense, which is where the hosting arrangement subscriptions are reported.\nImpairment of Long-Lived Assets\nWe review our long-lived assets for impairment whenever events or changes in circumstances indicate that the carrying amount may not be recoverable. The carrying amount of a long-lived asset is not recoverable if the carrying amount of an asset group exceeds the sum of the undiscounted cash flows expected to result from the use and eventual disposition of the assets at the date it is tested for recoverability, whether in use or under development. An impairment loss is measured as the amount by which the carrying amount of a long-lived asset exceeds its fair value.\nRevenue Recognition\nRevenues are recognized when our services are made available to our customers, in an amount that reflects the consideration we are contractually and legally entitled to in exchange for those services.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nWe determine revenue recognition through the following steps:\n•\nIdentification of the contract, or contracts, with a customer\n•\nIdentification of the performance obligations in the contract\n•\nDetermination of the transaction price\n•\nAllocation of the transaction price to the performance obligations in the contract\n•\nRecognition of revenue when, or as, we satisfy a performance obligation\nSee Note C for further descriptions of our revenue recognition policy.\nDeferred Costs\nDeferred costs are those that are incurred to fulfill or obtain customer contracts and that are considered incremental and recoverable costs. These consist primarily of customer implementation costs, commissions paid to sales personnel and third-party partners for customer referrals, respectively. These costs are deferred and amortized over the expected period of benefit which we have determined to be two years.\nSales commissions are calculated based on estimated annual recurring revenue to be generated over the customer’s initial contract period. Amortization expense is included in sales and marketing expenses in the accompanying consolidated statements of comprehensive income.\nCustomer implementation costs are based on actual costs incurred. Amortization expense is included in cost of revenues in the accompanying consolidated statements of comprehensive income.\nStock-Based Compensation\nWe recognize the cost of all share-based payments to employees, executive officers, and non-employee members of the Company’s Board of Directors, including grants of incentive and nonqualified stock options, performance share units (“PSUs”), restricted stock awards (“RSAs”), restricted stock units (“RSUs”), deferred stock units (“DSUs”), employee stock purchase plan (“ESPP”), and 401(k) stock match in the consolidated financial statements based on the grant date fair value of those awards. This cost is recognized over the period for which an employee is required to provide service in exchange for the award or the performance period, as applicable.\nIn valuing share-based awards, excluding PSUs, judgment is required in determining the expected volatility of common stock and the expected term individuals will hold their share-based awards prior to exercising. The expected volatility of the options is based on the historical volatility of our common stock. Beginning with awards granted in 2020, the expected term of the options is derived from historical data on employee exercises and post-vesting employment termination behavior. For awards granted prior to 2020, the expected term of the options was based on the simplified method which does not consider historical employee exercise behavior. Additional valuation inputs include our expected non-issuance of future common stock dividends and the risk-free interest rate that is based on the U.S. Treasury rates at the date of grant with maturity dates approximately equaling the expected life at the grant date. For PSUs, the grant date fair value is estimated using a Monte Carlo simulation that utilizes multiple input variables that determine the probability of satisfying the performance conditions stipulated in the award. For all awards, we recognize forfeitures as they occur.\nIncome Taxes\nWe account for income taxes using the asset and liability method, which requires recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the financial statements. Under this method, deferred tax assets and liabilities are determined based on the difference between the financial statement and tax basis of assets and liabilities using enacted tax rates in effect for the year in which the differences are expected to reverse. Deferred tax assets are reduced by a valuation allowance when, in our judgement, it is more likely than not that some or all of the deferred tax asset will not be realized.\nWe assess our ability to realize our deferred tax assets at the end of each reporting period. Realization of our deferred tax assets is contingent upon future taxable earnings. Accordingly, this assessment requires estimates and\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\njudgment. If the estimates of future taxable income vary from actual results, our assessment regarding the realization of these deferred tax assets could change. Future changes in the estimated amount of deferred taxes expected to be realized will be reflected in our consolidated financial statements in the period the estimate is changed, with a corresponding adjustment to our operating results.\nWe recognize the financial statement benefit of a tax position only after determining that the relevant tax authority would “more likely than not” sustain the position following an audit. For tax positions meeting the “more likely than not” threshold, the amount recognized in the financial statements is the largest benefit that has a greater than 50% likelihood of being realized upon ultimate settlement with the relevant tax authority.\nNet Income Per Share\nBasic net income per share has been computed using the weighted average number of shares of common stock outstanding during each period. Diluted net income per share also includes the impact of our outstanding potential common shares, including options, RSUs, RSAs, PSUs, and DSUs. Potential common shares that are anti-dilutive are excluded from the calculation of diluted net income per share.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nRecently Adopted Accounting Pronouncements\nStandard\nDate of Issuance\nDescription\nDate Adopted\nEffect on the Financial Statements\nASU 2016-13, Financial Instruments - Credit Losses (Topic 326), Measurement of Credit Losses on Financial Statements\nJune\nThe amendment in this update replaces the incurred loss impairment methodology in current GAAP with a methodology that reflects expected credit losses on instruments within its scope, including trade receivables. This update is intended to provide financial statement users with more decision-useful information about the expected credit losses.\nJanuary 2020\nThe adoption of this standard did not have a material impact on our consolidated financial statements. See above under \"Accounts Receivable\" for significant inputs for the allowance for credit losses.\nASU 2018-13, Fair Value Measurement (Topic 820), Disclosure Framework - Changes to the Disclosure Requirements for Fair Value Measurement\nAugust 2018\nThis ASU adds, modifies and removes several disclosure requirements relative to the three levels of inputs used to measure fair value in accordance with Topic 820, Fair Value Measurement.\nJanuary 2020\nThe adoption of this standard did not have a material impact on our consolidated financial statements.\nASU 2017-04, Intangibles - Goodwill and Other (Topic 350), Simplifying the Test for Goodwill Impairment\nJanuary 2017\nThis amendment eliminates Step 2 from the goodwill impairment test.\nJanuary 2020\nThe adoption of this standard did not have a material impact on our consolidated financial statements.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nNOTE B - Business Acquisitions\nData Masons\nOn December 16, 2020, we acquired all of the outstanding equity ownership interests of D Masons Software, LLC (“Data Masons”), a leading provider of EDI System Automation solutions for the Microsoft Dynamics market. Pursuant to the membership interest purchase agreement, given a target working capital level, the total transaction price was $100 million. $98.7 million was paid in cash at closing and $0.4 million is due from the sellers as part of the initial net working capital adjustment. Additionally, the agreement allows for up to $1.9 million of contingent consideration based on the outcome of the PPP loan forgiveness as described below. The purchase accounting for the acquisition has not been finalized as of December 31, 2020. Provisional amounts are primarily related to intangible assets, net working capital, and tax positions. We expect to finalize the allocation of the purchase price within the one-year measurement period following the acquisition.\nIn May 2020, prior to acquisition, Data Masons received a loan (“PPP Loan”) of $1.9 million pursuant to the Paycheck Protection Program (“PPP”) as established by the Coronavirus Aid, Relief, and Economic Security (“CARES”) Act. Amounts outstanding under the loan bear interest of 1.0% per annum with a maturity date two years from the commencement date. The PPP Loan is subject to forgiveness under the PPP to the extent proceeds of the loan are used for eligible expenditures. In November 2020, Data Masons applied for full forgiveness of the PPP Loan. As of the acquisition date and December 31, 2020, there had not been determination from the Small Business Administration as to whether the Company will be eligible for forgiveness, in whole or in part. In conjunction with the provisions of the PPP loan program for a business combination, Data Masons placed the balance of the PPP Loan and accrued interest of $1.9 million in cash escrow with the lender. To the extent the PPP Loan is forgiven, this cash escrow will be released to the Company.\nAdditionally, the Company has a contingent liability with the former owners of Data Masons, that will require an additional $1.9 million payment in the event the PPP loan is forgiven. While it is unknown, the Company has determined that it is probable that Data Masons’ use of the PPP Loan proceeds will meet the conditions for full forgiveness under the PPP. As such, the Company has recorded $1.9 million of contingent consideration as part of the total transaction price, included in accrued expenses on the consolidated balance sheet. The Company has also recorded the $1.9 million PPP loan with the lender within accrued expenses, as well as a $1.9 million government grant receivable within other current assets on the consolidated balance sheet. The payout of the contingent liability will be determined based upon the PPP Loan forgiveness application ruling, which is expected to occur in 2021. If the ruling results in partial forgiveness or no forgiveness of the PPP loan, the contingent liability and the government grant receivable will each be reduced by an equal and offsetting amount of the unforgiven portion of the PPP loan.\nPurchase Price Allocation\nWe accounted for the acquisition as a business combination. We allocated the purchase price to the tangible and identifiable intangible assets acquired and liabilities assumed based on their estimated fair values as of the acquisition date. We engaged a third-party valuation firm to assist us in the determination of the value of the recognized intangible assets and certain liabilities assumed. The excess of the purchase price over the fair value of net tangible and identifiable intangible assets acquired was recorded as goodwill. Goodwill is attributed to a trained workforce and other buyer-specific value resulting from expected synergies, including long-term cost savings, which are not included in the fair values of identifiable assets. All recorded goodwill is expected to be deductible for tax purposes.\nThe following table summarizes the estimated fair values of the assets acquired and liabilities assumed at the acquisition date (in thousands):\nCash\n$\n2,949\nAccounts receivable\n3,801\nOther current and non-current assets\n2,246\nGoodwill\n56,960\nIntangible assets\n43,000\nCurrent liabilities\n(3,593\n)\nDeferred revenue\n(2,196\n)\n$\n103,167\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nPurchased Intangible Assets\nThe following table summarizes the estimated fair value of the purchased intangible assets and their estimated useful lives:\nEstimated\nEstimated\nFair Value\nLife\nPurchased Intangible Assets\n(in thousands)\n(in years)\nSubscriber relationships\n$\n17,600\nDeveloped technology\n25,400\nTotal\n$\n43,000\nNOTE C - Revenue\nWe derive our revenues primarily from the following revenue streams:\nYear Ended December 31,\n(in thousands)\nRecurring revenues:\nFulfillment\n$\n251,272\n$\n219,297\n$\n190,783\nAnalytics\n38,824\n37,038\n34,447\nOther\n4,920\n5,671\n5,424\nRecurring Revenues\n295,016\n262,006\n230,654\nOne-time revenues\n17,614\n17,118\n17,586\n$\n312,630\n$\n279,124\n$\n248,240\nRevenues are recognized when our services are made available to our customers, in an amount that reflects the consideration we are contractually and legally entitled to in exchange for those services.\nWe determine revenue recognition through the following steps:\n•\nIdentification of the contract, or contracts, with a customer\n•\nIdentification of the performance obligations in the contract\n•\nDetermination of the transaction price\n•\nAllocation of the transaction price to the performance obligations in the contract\n•\nRecognition of revenue when, or as, we satisfy a performance obligation\nRecurring Revenues\nRecurring revenues consist of recurring subscriptions from customers that utilize our Fulfillment, Analytics and Other cloud-based supply chain management solutions. Revenue for these solutions is generally recognized on a ratable basis over the contract term beginning on the date that our service is made available to the customer. Our contracts with our recurring revenue customers are recurring in nature, ranging from monthly to annual, and generally allow the customer to cancel the contract for any reason with 30 to 90 days’ notice. Timing of billings varies by customer and by contract type and are either in advance or within 30 days of the service being performed.\nThe deferred revenue liabilities for recurring revenue contracts are for one year or less and recognized on a ratable basis over the contract term. We have applied the optional exemption to not disclose information about the remaining performance obligations for contracts which have original durations of one year or less.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nOne-time Revenues\nOne-time revenues consist of set-up fees from customers and miscellaneous one-time fees.\nSet-up fees are specific for each connection a customer has with a trading partner and many of our customers have connections with numerous trading partners. Set-up fees related to our cloud-based supply chain management solutions are nonrefundable upfront fees that are necessary for our customers to utilize our cloud-based services. These set-up fees do not provide any standalone value to our customers.\nCertain contracts contain set-up fees that constitute a material renewal option right. This material right provides customers a significant future incentive that would not be otherwise available to that customer unless they entered into the contract, as the set-up fees will not be incurred again upon contract renewal.\nFor our Fulfillment solution, we have determined that the set-up fees and related costs represent a material renewal option right to our customers as they will not be incurred again upon renewal. These set-up fees and related costs are deferred and recognized ratably over two years, which is the estimated period for which a material right is present for our customers.\nFor our Analytics solution, we have determined that the set-up fees do not represent a material customer renewal right and, as such, are deferred and recognized ratably over the estimated initial contract term, which is generally one year.\nThe table below presents the activity of the portion of the deferred revenue liability relating to set-up fees:\nYear Ended December 31,\n(in thousands)\nBalance, beginning of year\n$\n10,518\n$\n9,857\nInvoiced set-up fees\n11,410\n11,056\nAmortized set-up fees\n(10,810\n)\n(10,395\n)\nBalance, end of year\n$\n11,118\n$\n10,518\nThe entire balance of set-up fees will be recognized within two years and, as such, current amounts will be recognized in the next 1-12 months and non-current amounts will be recognized in the next 13-24 months.\nMiscellaneous one-time fees consist of professional services and testing and certification. The deferred revenue liability for these one-time fees are for one year or less and recognized at the time service is provided. We have applied the optional exemption to not disclose information about the remaining performance obligations for contracts which have original durations of one year or less.\nNOTE D - Deferred Costs\nThe table below presents the activity of deferred costs and amortization of deferred costs:\nYear Ended December 31,\n(in thousands)\nBalance, beginning of year\n$\n46,941\n$\n45,475\nIncurred deferred costs\n54,421\n49,883\nAmortized deferred costs\n(50,767\n)\n(48,417\n)\nBalance, end of year\n$\n50,595\n$\n46,941\nNOTE E - Financial Instruments\nCash equivalents and investments\nWe invest primarily in money market funds, certificates of deposit, highly liquid debt instruments of the U.S. government and U.S. corporate debt securities. Highly liquid investments with original maturities of 90 days or less are classified as cash equivalents. Investments with remaining maturities of less than one year from the balance sheet date are classified as short-term investments whereas those with remaining maturities of more than one year from the balance sheet date are classified as investments. Our marketable securities are classified as available-for-sale. We\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nintend to hold marketable securities until maturity; however, we may sell these securities at any time for use in current operations or for other purposes.\nOur marketable securities are carried at fair value and unrealized gains and losses on these investments, net of taxes, are included in accumulated other comprehensive loss in the consolidated balance sheets. Realized gains or losses are included in other income (expense), net in the consolidated statements of comprehensive income. Certain securities accrue interest that is included in other income (expense), net. The unrealized gains (losses) noted below are exclusive of previously recognized interest income.\nCash equivalents and investments consisted of the following:\nDecember 31,\nAmortized\nUnrealized\nFair\nAmortized\nUnrealized\nFair\n(in thousands)\nCost\nLosses, net\nValue\nCost\nGains, net\nValue\nCash equivalents:\nMoney market funds\n$\n112,907\n$\n-\n$\n112,907\n$\n151,266\n$\n-\n$\n151,266\nCertificate of deposit\n7,708\n-\n7,708\n7,030\n-\n7,030\nMarketable securities:\nCorporate bonds\n5,069\n(29\n)\n5,040\n9,785\n9,805\nCommercial paper\n7,569\n(55\n)\n7,514\n7,503\n-\n7,503\nU.S. treasury securities\n20,051\n(27\n)\n20,024\n9,855\n9,946\n$\n153,304\n$\n(111\n)\n$\n153,193\n$\n185,439\n$\n$\n185,550\nMaturing within one year\n$\n150,693\n$\n185,550\nMaturing within one to two years\n2,500\n-\nTotal\n$\n153,193\n$\n185,550\nRecurring Fair Value Measurements\nWe measure certain financial assets at fair value on a recurring basis based on a fair value hierarchy that requires us to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. A financial instrument’s categorization within the fair value hierarchy is based upon the lowest level of input that is significant to the fair value measurement. The three levels of inputs that may be used to measure fair value are:\n•\nLevel 1 - quoted prices in active markets for identical assets or liabilities.\n•\nLevel 2 - observable inputs other than Level 1 prices, such as (a) quoted prices for similar assets or liabilities, (b) quoted prices in markets with insufficient volume or infrequent transactions (less active markets), or (c) model-derived valuations in which all significant inputs are observable or can be derived principally from or corroborated by observable market data for substantially the full term of the assets or liabilities.\n•\nLevel 3 - unobservable inputs to the valuation methodology that are significant to the measurement of fair value of assets or liabilities.\nWe obtain the fair values of our level 2 available-for-sale securities from a professional pricing service.\nFor the earn-out liability related to the EDIAdmin acquisition, the Company utilized the Monte Carlo simulation method to estimate the fair value of this contingent liability as of the reporting date. Thousands of iterations of the simulation were performed using forecasted revenues to develop a distribution of future values of recurring revenue which, in turn, provide indicated earn-out payments. The total estimated fair value equals the sum of the average present values of the indicated earn-out payments.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nThe following table presents information about our financial assets and liabilities that are measured at fair value on a recurring basis and indicates the fair value hierarchy of the valuation techniques utilized to determine such fair value:\nDecember 31, 2020\n(in thousands)\nLevel 1\nLevel 2\nLevel 3\nTotal\nAssets:\nCash equivalents:\nMoney market funds\n$\n112,907\n$\n-\n$\n-\n$\n112,907\nCertificate of deposit\n7,708\n-\n-\n7,708\nMarketable securities:\nCorporate bonds\n-\n5,040\n-\n5,040\nCommercial paper\n-\n7,514\n-\n7,514\nU.S. treasury securities\n-\n20,024\n-\n20,024\n$\n120,615\n$\n32,578\n$\n-\n$\n153,193\nLiabilities:\nData Masons Contingent Consideration\n$\n-\n$\n-\n$\n1,878\n$\n1,878\n$\n-\n$\n-\n$\n1,878\n$\n1,878\nDecember 31, 2019\n(in thousands)\nLevel 1\nLevel 2\nLevel 3\nTotal\nAssets:\nCash equivalents:\nMoney market funds\n$\n151,266\n$\n-\n$\n-\n$\n151,266\nCertificate of deposit\n7,030\n-\n-\n7,030\nMarketable securities:\nCorporate bonds\n-\n9,805\n-\n9,805\nCommercial paper\n-\n7,503\n-\n7,503\nU.S. treasury securities\n-\n9,946\n-\n9,946\n$\n158,296\n$\n27,254\n$\n-\n$\n185,550\nLiabilities:\nEDIAdmin Earn-out liability\n$\n-\n$\n-\n$\n$\n$\n-\n$\n-\n$\n$\nDuring the year ending December 31, 2020, we recognized a gain of $0.1 million in our consolidated statements of comprehensive income due to the remeasurement of the EDIAdmin contingent liability and paid $0.7 million for a portion of the contingent liability. The remaining portion of the earn-out liability that is expected to be paid in the first quarter of 2021 has been determined to be $0.1 million, given the completion of certain revenue milestones for the year ending December 31, 2020. As such, $0.1 million of the earn-out consideration is included in accrued expenses in the consolidated balance sheet at December 31, 2020 and transferred from the Level 3 earn-out liability.\nOther than the transfer relating to the EDIAdmin contingent consideration, there were no other transfers in or out of our Level 1, 2, or 3 assets or liabilities during the years ended December 31, 2020 and 2019.\nNonrecurring Fair Value Measurements\nWe measure certain assets and liabilities at fair value on a nonrecurring basis. Assets that are measured at fair value on a nonrecurring basis include long-lived assets, goodwill, and indefinite-lived intangible assets, which would generally be recorded at fair value as a result of an impairment charge. Assets acquired and liabilities assumed as part of business combinations are measured at fair value. For additional information on our business\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\ncombinations and the related nonrecurring fair value measurement of the assets acquired and liabilities assumed, refer to Note B.\nNOTE F - Allowance for Credit Losses\nThe allowance for credit losses activity, included in accounts receivable, net, was as follows:\n(in thousands)\nBalance, beginning of year\n$\n1,469\n$\n1,392\n$\nAdoption of ASU 2016-13\n1,069\n-\n-\nAllowance for Data Masons acquired receivables\n-\n-\nProvision for credit losses\n5,660\n3,499\n2,592\nWrite-offs, net of recoveries\n(4,319\n)\n(3,422\n)\n(1,963\n)\nBalance, end of year\n$\n4,233\n$\n1,469\n$\n1,392\nNOTE G - Property and Equipment, net\nProperty and equipment, net included the following:\nDecember 31,\n(in thousands)\nComputer equipment and software\n$\n63,225\n$\n54,030\nOffice equipment and furniture\n9,613\n9,205\nLeasehold improvements\n12,746\n11,091\n85,584\n74,326\nLess: accumulated depreciation and amortization\n(59,152\n)\n(50,574\n)\n$\n26,432\n$\n23,752\nDepreciation and amortization expense of property and equipment for the years ended December 31, 2020, 2019, and 2018 was $13.1 million, $11.1 million, and $8.6 million, respectively.\nNOTE H - Goodwill and Intangible Assets, net\nGoodwill\nThe changes in the net carrying amount of goodwill was as follows:\n(in thousands)\nBalance, beginning of year\n$\n76,845\n$\n69,658\nAdditions from business acquisitions\n56,960\n6,372\nForeign currency translation\n1,048\nBalance, end of year\n$\n134,853\n$\n76,845\nIntangible Assets\nIntangible assets, net included the following:\nDecember 31, 2020\n(in thousands)\nGross\nCarrying\nAmount\nAccumulated\nAmortization\nForeign\nCurrency\nTranslation\nNet\nSubscriber relationships\n54,447\n(24,792\n)\n$\n29,756\nNon-competition agreements\n(691\n)\n(4\n)\nAcquired technology\n33,195\n(2,724\n)\n-\n30,471\n$\n88,340\n$\n(28,207\n)\n$\n$\n60,230\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nDecember 31, 2019\n(in thousands)\nGross\nCarrying\nAmount\nAccumulated\nAmortization\nForeign\nCurrency\nTranslation\nNet\nSubscriber relationships\n$\n43,640\n$\n(27,287\n)\n$\n$\n16,567\nNon-competition agreements\n2,495\n(2,371\n)\nAcquired technology\n8,602\n(2,643\n)\n5,967\n$\n54,737\n$\n(32,301\n)\n$\n$\n22,668\nThe estimated annual amortization expense related to intangible assets subject to amortization for the next five years and thereafter was as follows:\n(in thousands)\n$\n9,942\n8,838\n8,758\n7,476\n7,337\nThereafter\n17,879\n$\n60,230\nNOTE I - Other Assets\nThe changes in the net amount of capitalized implementation costs for software hosting arrangements was as follows:\n(in thousands)\nBalance, beginning of year\n$\n1,166\n$\nCapitalized implementation fees\nAmortization of implementation fees\n(112\n)\n(86\n)\nBalance, end of year\n$\n1,181\n$\n1,166\nNOTE J - Commitments and Contingencies\nLeases\nWe are obligated under non-cancellable operating leases, primarily for office space and certain equipment, as follows:\nDecember 31, 2020\nDecember 31, 2019\n(In thousands, except remaining term)\nRemaining Term (years)\nRight-of-Use Asset\nRemaining Term (years)\nRight-of-Use Asset\nMinneapolis, MN lease\n$\n10,992\n$\n10,704\nKyiv, Ukraine lease\n1,930\n2,316\nOther leases\n<1 - 5\n2,659\n<1 - 5\n2,724\n$\n15,581\n$\n15,744\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nIn December 2020, we executed the fifth amendment to our lease agreement for our current headquarters located in Minneapolis, Minnesota where we lease approximately 198,000 square feet under an agreement that expires in April 2027. The lease also has two options to extend the term for five years each at a market rate determined in accordance with the lease. Incentives of $2.4 million are included as a lease component.\nIn December 2019, we executed a lease agreement for a new Kyiv, Ukraine location, where we lease approximately 17,000 square feet under an agreement that expires on May 31, 2025. The lease includes one option to extend the term for five years and six months at a market rate determined in accordance with the lease.\nThe components of lease expense were as follows:\nYear Ended December 31,\n(in thousands)\nOperating lease cost\n$\n2,719\n$\n2,569\nVariable lease cost\n3,578\n3,390\n$\n6,297\n$\n5,959\nRent expense for all operating leases, which includes minimum lease payments and other charges such as common area maintenance fees, charged to operations was as follows:\nYear Ended December 31,\n(in thousands)\nRent expense\n$\n5,577\nSupplemental cash flow information related to leases was as follows:\nDecember 31,\n(in thousands)\nCash paid for amounts included in the measurement of lease liabilities\nOperating cash flows from operating leases\n$\n4,134\n$\n4,383\nROU assets obtained in exchange for operating lease liabilities\n12,801\n2,537\nSupplemental balance sheet information related to leases was as follows:\nDecember 31, 2020\nDecember 31, 2019\nWeighted-average remaining lease term - operating leases\n5.6 years\n5.0 years\nWeighted-average discount rate - operating leases\n4.1\n%\n4.5\n%\nAt December 31, 2020, our future minimum payments under operating leases were as follows:\n(in thousands)\n$\n3,728\n4,699\n4,431\n4,070\n3,715\nThereafter\n4,753\n25,396\nLess: imputed interest\n(2,926\n)\n$\n22,470\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nPurchase Commitments\nIn 2020, we entered into separate noncancelable agreements with computing infrastructure and customer relationship management vendors for services through 2023. At December 31, 2020, the total remaining purchase commitment was $17.9 million.\nContingencies\nWe may be involved in various claims and legal actions in the normal course of business. We believe that the outcome of any such claim or legal action is not expected to have a material effect on our financial position, results of operations or cash flows.\nNOTE K - Stockholders’ Equity\nStock Split\nOn August 22, 2019, we effected a two-for-one stock split of our common stock. There was no change in the number of our authorized common shares. All share and per share data have been adjusted for all periods presented to reflect the stock split.\nStock Repurchase Program\nOn November 2, 2017, our board of directors authorized a program to repurchase up to $50.0 million of common stock over two years. On November 2, 2019, $3.7 million expired from the program. On November 2, 2019, our board of directors authorized a new program to repurchase up to $50 million of common stock. Under the program, purchases may be made from time to time in the open market over two years. As of December 31, 2020, $31.1 million of the share repurchase authorized was available for future share repurchases.\nUnder the programs, we purchased 0.4 million, 0.4 million, and 0.6 million shares at costs of $19.0 million, $20.6 million, and $19.9 million for the years ended December 31, 2020, 2019, and 2018, respectively.\nNOTE L - Stock-Based Compensation\nOur equity compensation plans provide for the grant of incentive and nonqualified stock options, as well as other stock-based awards including PSUs, RSAs, RSUs, and DSUs, to employees, non-employee directors and other consultants who provide services to us. We also provide an ESPP and 401(k) stock match.\nRSAs result in the issuance of new shares when granted. For other stock-based awards, new shares are issued when the award is exercised, vested, or released according to the terms of the agreement. In February 2020, February 2019, and January 2018, 2.1 million additional shares were reserved for future issuance under our 2010 Equity Incentive Plan. At December 31, 2020 there were approximately 15.8 million shares available for grant under approved equity compensation plans.\nStock-based compensation expense was allocated as follows:\nYear Ended December 31,\n(in thousands)\nCost of revenues\n$\n3,948\n$\n2,819\n$\n2,168\nOperating expenses\nSales and marketing\n4,119\n2,946\n2,675\nResearch and development\n3,626\n2,651\n1,505\nGeneral and administrative\n7,243\n6,274\n6,162\n$\n18,936\n$\n14,690\n$\n12,510\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nStock-based compensation expense by type was as follows:\nYear Ended December 31,\n(in thousands)\nStock options\n$\n2,232\n$\n3,211\n$\n3,355\nPSUs\n3,219\n1,379\n1,034\nRSUs\n10,367\n7,553\n5,930\nRSAs and DSUs\nESPP\n1,117\n401(k) stock match\n1,555\n1,327\n1,238\n$\n18,936\n$\n14,690\n$\n12,510\nAs of December 31, 2020, there was $24.1 million of unrecognized stock-based compensation expense under our equity compensation plans, which is expected to be recognized over a weighted-average period of 2.4 years.\nStock Options\nStock options generally vest over four years and have a contractual term of seven to ten years from the date of grant. Our stock option activity was as follows:\nWeighted Average\nOptions\nExercise Price\n(#)\n($/share)\nOutstanding at December 31, 2017\n2,194,662\n23.80\nGranted\n362,944\n29.94\nExercised\n(688,668\n)\n20.83\nForfeited\n(122,470\n)\n28.34\nOutstanding at December 31, 2018\n1,746,468\n25.93\nGranted\n184,434\n53.92\nExercised\n(346,098\n)\n21.98\nForfeited\n(40,892\n)\n30.74\nOutstanding at December 31, 2019\n1,543,912\n30.03\nGranted\n127,974\n59.02\nExercised\n(712,074\n)\n26.11\nForfeited\n(14,926\n)\n43.14\nOutstanding at December 31, 2020\n944,886\n36.71\nOf the total outstanding options at December 31, 2020, 0.7 million were exercisable. The outstanding and exercisable options had a weighted average exercise price of $32.35 per share and a weighted average remaining contractual life of 3.4 years.\nThe table below presents the intrinsic value of options exercised and outstanding and factors related to our stock options:\nYear Ended December 31,\n(in thousands, except per share data)\nFair value of options vested\n$\n3,000\n$\n3,393\n$\n3,689\nIntrinsic value of options exercised\n31,737\n11,103\n14,852\nIntrinsic value of options outstanding\n67,918\n39,194\n26,654\nWeighted-average fair value per share of options granted\n16.18\n16.86\n9.74\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nThe fair values of the options granted were estimated on the date of grant using the Black-Scholes option pricing model with the following weighted-average assumptions:\nYear Ended December 31,\nVolatility\n%\n%\n%\nDividend yield\n-\n-\n-\nLife (in years)\n4.01\n4.43\n4.44\nRisk-free interest rate\n0.99\n%\n2.41\n%\n2.54\n%\nPerformance Share Units, Restricted Stock Units and Awards, and Deferred Stock Units\nIn February 2020, 2019, and 2018, our executive officers were granted PSU awards with vesting contingent on our total shareholder return as compared to indexed total shareholder return over the course of a fiscal based three-year performance period, starting in the year of grant. Expense is recognized on a straight-line basis over the performance period, regardless of whether the market condition is satisfied as the likelihood of the market condition being met is included in the fair-value measurement of the award.\nIn February 2017, our executive officers were granted PSU awards with vesting contingent on successful attainment of pre-determined revenue targets over the course of a three-year performance period (fiscal 2017 - 2019). The awards were forfeited in 2020 as the targets were not met.\nRSUs generally vest over four years and, upon vesting, the holder is entitled to receive shares of our common stock.\nRSAs vest over one year and, upon vesting, the holder is entitled to receive shares of our common stock. In lieu of RSAs, a participant may elect to receive DSUs with one year vesting, but the participant directs delayed receipt of common shares of up to ten years after the end of service to us.\nActivity for our PSU, RSU, RSA, and DSU was as follows:\nWeighted Average\nGrant Date Fair\n(#)\nValue (per share)\nOutstanding at December 31, 2017\n646,560\n27.59\nGranted\n360,198\n33.19\nVested and common stock issued\n(176,802\n)\n28.74\nForfeited\n(71,622\n)\n27.52\nOutstanding at December 31, 2018\n758,334\n29.99\nGranted\n288,462\n55.69\nVested and common stock issued\n(217,424\n)\n31.05\nForfeited\n(31,826\n)\n34.67\nOutstanding at December 31, 2019\n797,546\n38.80\nGranted\n331,264\n62.78\nVested and common stock issued\n(222,606\n)\n36.06\nForfeited\n(167,782\n)\n30.09\nOutstanding at December 31, 2020\n738,422\n52.37\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nThe number of PSUs, RSUs, and DSUs outstanding at December 31, 2020 included 122,910 units that have vested, but the shares of common stock have not yet been issued, pursuant to the terms of the agreement.\nEmployee Stock Purchase Plan\nOur ESPP allows participating employees to purchase shares of our common stock at a discount through payroll deductions. The plan is available to all employees subject to certain eligibility requirements. Participating employees may purchase common stock, on a voluntary after-tax basis, at a price that is the lower of 85% of the fair market value of one share of common stock at the beginning or end of each stock purchase period. The plan consists of two six-month offering periods, beginning on January 1 and July 1 of each calendar year. A total of 1.9 million shares of common stock are remaining for issuance under the plan at December 31, 2020.\nOur ESPP activity was as follows:\nYear Ended December 31,\n(in thousands, except share data)\nAmounts for shares purchased\n$\n3,374\n$\n2,270\n$\n1,745\nShares purchased\n61,833\n58,851\n69,596\nThe fair value was estimated based on the market price of our common stock at the beginning of each offering period and using the Black-Scholes option pricing model with the following weighted-average assumptions:\nYear Ended December 31,\nVolatility\n%\n%\n%\nDividend yield\n-\n-\n-\nLife (in years)\n0.50\n0.50\n0.50\nRisk-free interest rate\n0.96\n%\n2.36\n%\n1.77\n%\nNOTE M - Income Taxes\nOur provisions for income taxes included current federal, foreign, and state income tax expense, as well as deferred tax expense as follows:\nYear Ended December 31,\n(in thousands)\nCurrent\nState\n$\n1,249\n$\n$\n1,103\nForeign\n1,608\nDeferred\nFederal\n4,462\n6,595\n3,011\nState\n1,156\nForeign\n(469\n)\n(161\n)\n(410\n)\n$\n7,094\n$\n8,358\n$\n4,468\nA reconciliation of the expected federal income tax at the statutory rate to the provision for income taxes was as follows:\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nYear Ended December 31,\n(in thousands)\nExpected federal income tax at statutory rate\n$\n11,063\n$\n8,835\n$\n5,951\nState income taxes, net of federal tax effect\n2,382\n1,933\n1,293\nTax impact of foreign activity\n(108\n)\nNondeductible executive compensation\nForeign derived intangible income\n(710\n)\n-\n-\nNondeductible expenses\nChange in valuation allowance\n-\n-\n(4\n)\nChange in state deferred rate\nResearch and development credit\n(294\n)\n(1,252\n)\n(1,843\n)\nTax impact of stock activity\n(6,807\n)\n(2,518\n)\n(2,438\n)\nOther\n$\n7,094\n$\n8,358\n$\n4,468\nDifferences between our effective tax rate and statutory tax rates are primarily due to tax benefits generated upon settlement or exercise of stock awards as such activities are recognized as a reduction to income tax expense as a discrete tax item in the period that such events occur, creating potentially significant fluctuations in tax expense by period. Additionally, federal research and development credit benefits are partially offset by permanently non-deductible expenses contributing to the difference in effective and statutory tax rates.\nThe significant components of our deferred tax assets and liabilities were as follows:\nDecember 31,\n(in thousands)\nDeferred tax assets\nNet operating loss and credit carryforwards\n$\n4,539\n$\n9,122\nStock-based compensation expense\n3,605\n3,944\nAccounts receivable allowances\n1,228\nAccrued expenses\n3,200\n2,916\nDeferred revenue\nLease liabilities\n5,435\n5,995\nOther\nGross deferred tax assets\n19,362\n23,150\nLess: valuation allowance\n(1,582\n)\n(1,068\n)\nTotal net deferred tax assets\n17,780\n22,082\nDeferred tax liabilities\nDeferred costs\n(12,561\n)\n(11,436\n)\nRight-of-use assets\n(3,754\n)\n(4,047\n)\nForeign operations\n(228\n)\n(144\n)\nDepreciation and amortization\n(3,980\n)\n(4,975\n)\nOther\n-\n(43\n)\nTotal deferred tax liabilities\n(20,523\n)\n(20,645\n)\nNet deferred tax assets (liabilities)\n$\n(2,743\n)\n$\n1,437\nAs of December 31, 2020, we had net operating loss carryforwards of $17.5 million for U.S. federal tax purposes and $1.5 million for state tax purposes. If not utilized, the loss carryforwards will expire between 2021 and 2024 for federal tax purposes and between 2028 and 2031 for state tax purposes. Section 382 of the U.S. Internal Revenue Code generally imposes an annual limitation on the amount of net operating loss carryforwards that might be used to offset taxable income when a corporation has undergone significant changes in stock ownership. As of December 31, 2020, all $17.5 million of our net operating loss carryforwards are subject to Section 382 limitations, of which we believe $14.6 million of federal losses will expire unused due to Section 382 limitations. Accordingly, our deferred tax assets are reported net of the Section 382 limitations.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nAs of December 31, 2020, we had federal research and development (“R&D”) credit carryforwards, net of Section 383 limitations, of $2.2 million, which, if not utilized, will begin to expire in 2039. We had state research and development credit carryforwards of $1.6 million which, if not utilized, will begin to expire in 2025.\nAs of December 31, 2020, we had a valuation allowance against our deferred tax assets of $1.6 million. The valuation allowance is established for state credit carryforwards that we do not expect to utilize based on our current expectations of future state taxable income.\nWe are subject to income taxes for U.S. federal and various state and international jurisdictions. We are generally subject to U.S. federal and state tax examinations for most prior tax years due to our net operating loss and R&D credit carryforwards and the utilization of the carryforwards in years still open under statute.\nAs of December 31, 2020, we do not have any unrecognized tax benefits. It is our practice to recognize interest and penalties accrued on any unrecognized tax benefits as a component of income tax expense. We do not expect any material changes in our unrecognized tax positions over the next 12 months.\nNOTE N - Net Income Per Share\nThe following table presents the components of the computation of basic and diluted net income per share for the periods indicated:\nYear Ended December 31,\n(in thousands, except per share amounts)\nNumerator\nNet income\n$\n45,586\n$\n33,712\n$\n23,872\nDenominator\nWeighted average common shares outstanding, basic\n35,226\n35,024\n34,392\nOptions to purchase common stock\nPSUs, RSUs, RSAs, and DSUs\nWeighted average common shares outstanding, diluted\n36,285\n36,002\n35,212\nNet income per share\nBasic\n$\n1.29\n$\n0.96\n$\n0.69\nDiluted\n$\n1.26\n$\n0.94\n$\n0.68\nThe following table presents the effect of the outstanding potential common shares that were excluded from the calculation of diluted net income per share as they were anti-dilutive:\nYear Ended December 31,\n(in thousands)\nAntidilutive shares\nNOTE O - Retirement Savings Plan\nWe sponsor a 401(k) retirement savings plan for our employees. Employees can contribute up to 80% of their compensation, subject to the limits established by law, and we match 50% of the employee’s contribution up to the first 6% of pre-tax annual compensation. A portion of our match is in company stock, which is purchased from the open market by our plan provider and immediately deposited into the employee’s 401(k) account. Additionally, we make statutory contributions to retirement plans as required by local foreign government regulations. Our total contributions to the plan were $3.9 million, $3.3 million and $2.9 million for the years ended December 31, 2020, 2019, and 2018, respectively.\nNOTE P - Related Party Transactions\nSPS Commerce Foundation (the “Foundation”) is a Minnesota non-profit organization exempt from federal taxation under Section 501(c)(3) of the Internal Revenue Code. The Foundation was formed in 2015 to engage in, advance, support, promote and administer charitable activities. The directors of the Foundation are also our officers.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nThese officers receive no compensation from the Foundation for the management services performed for the Foundation. The Foundation is not a subsidiary of ours and the financial results of the Foundation are not consolidated with our financial statements. For the years ended December 31, 2020, 2019, and 2018, we made contributions to the Foundation of $1.8 million, less than $0.1 million, and $0.7 million, respectively. We have no current legal obligations for future commitments to the Foundation.\nNOTE Q - Geographic Information\nFor the years ended December 31, 2020, 2019, and 2018, 85%, 85%, and 83%, respectively, of our revenue was attributable to customers based within the United States. No single jurisdiction outside of the U.S. had revenues in excess of 10%.\nAt December 31, 2020 and 2019, 15% and 8%, respectively, of property and equipment, net was located at subsidiary and office locations outside of the United States.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020",
    "item_9": "Item 9.\nChanges in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A.\nControls and Procedures\nEvaluation of Disclosure Controls and Procedures\nWe evaluated the effectiveness of the design and operation of our disclosure controls and procedures as of December 31, 2020, the end of the period covered by this Annual Report on Form 10-K. This evaluation was done under the supervision and with the participation of management, including our Chief Executive Officer (“CEO”) and Chief Financial Officer (“CFO”). Disclosure controls and procedures means controls and other procedures that are designed to provide reasonable assurance that information required to be disclosed in the reports that we file or submit under Exchange Act, such as this Annual Report on Form 10-K, is recorded, processed, summarized and reported within the time periods specified in the rules and forms of the SEC. Disclosure controls and procedures include, without limitation, controls and procedures designed such that information is accumulated and communicated to our management, including our CEO and CFO, as appropriate to allow timely decisions regarding required disclosure. Based on this evaluation, our CEO and CFO have concluded that as of December 31, 2020, our disclosure controls and procedures were effective.\nManagement’s Annual Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act as a process designed by, or under the supervision of, our principal executive and principal financial officer and effected by our board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP and includes those policies and procedures that:\n•\npertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of our assets;\n•\nprovide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and\n•\nprovide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on our financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nUnder the supervision and with the participation of management, including our principal executive and financial officers, we assessed our internal control over financial reporting as of December 31, 2020, based on criteria for effective internal control over financial reporting established in the Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nBased on this assessment, management concluded that we maintained effective internal control over financial reporting as of December 31, 2020 based on the specified criteria.\nFor the year ended December 31, 2020, management’s assessment of our internal control over financial reporting excluded the internal control over financial reporting of the Data Masons business, which was acquired on December 16, 2020. Pursuant to the SEC’s general guidance that an assessment of a recently acquired business may be omitted from our scope for a period not to exceed one year from the date of acquisition, the scope of our most recent assessment did not include Data Masons. Our assessment of the effectiveness of internal control over financial reporting as of December 31, 2021 will include Data Masons. As of and for the three and twelve months ended December 31, 2020, excluding net intangible assets and goodwill, Data Masons represented approximately 3% of our total consolidated assets and less than 1% of our consolidated revenues.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nThe effectiveness of our internal control over financial reporting as of December 31, 2020 has been audited by KPMG LLP, our independent registered public accounting firm, as stated in their report, which is included under Item 8 of this Annual Report on Form 10-K.\nChanges in Internal Control over Financial Reporting\nThere were no changes in our internal control over financial reporting during the most recent fiscal quarter ended December 31, 2020 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.",
    "item_9B": "Item 9B.\nOther Information\nNone.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nPART III",
    "item_10": "Item 10.\nDirectors, Executive Officers and Corporate Governance\nThe information required by this item with respect to executive officers is contained in Item 1 of this Annual Report on Form 10-K under the heading “Information About our Executive Officers” and with respect to other information relating to our directors and executive officers will be set forth in the 2021 Proxy Statement under the caption “Item 1 - Election of Directors,” which will be filed no later than 120 days after the end of the fiscal year covered by this Annual Report on Form 10-K, and is incorporated herein by reference.\nThe information required by this item under Item 407(c)(3) of Regulation S-K is incorporated herein by reference to the section titled “Information Regarding the Board of Directors and Corporate Governance-Procedures for Selecting and Nominating Director Candidates” of the 2021 Proxy Statement.\nThe information required by this item under Item 407(d)(4) and (d)(5) of Regulation S-K is incorporated herein by reference to the section titled “Information Regarding the Board of Directors and Corporate Governance-Board Committees” of the 2021 Proxy Statement.\nWe have adopted a code of business conduct applicable to our directors, officers (including our principal executive officer and principal financial officer) and employees. The Code of Conduct is available on our website at www.spscommerce.com under the Investor Relations section. We plan to post on our website at the address described above any future amendments or waivers of our Code of Conduct.",
    "item_11": "Item 11.\nExecutive Compensation\nThe information required by this item is incorporated herein by reference to the sections titled “Executive Compensation,” “Information Regarding the Board of Directors and Corporate Governance-Director Compensation” and “Certain Relationships and Related Transactions-Compensation Committee Interlocks and Insider Participation” of the 2021 Proxy Statement.",
    "item_12": "Item 12.\nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this item is incorporated herein by reference to the section titled “Security Ownership” of the 2021 Proxy Statement.\nEquity Compensation Plan Information\nThe following table summarizes the number of shares of our common stock to be issued upon exercise of outstanding stock options and settlement of restricted stock unit awards granted under our equity plans as of December 31, 2020. The table also includes the weighted-average exercise price of outstanding stock options and the number of shares of our common stock remaining available for future issuance under the plans for all awards.\nPlan Category\nNumber of shares\nto be issued upon\nexercise of\noutstanding\noptions, warrants\nand rights\nWeighted-\naverage\nexercise price of\noutstanding\noptions, warrants\nand rights\nNumber of shares\nremaining available\nfor future issuance\nunder equity\ncompensation plans\n(excluding shares\nin first column)\nEquity compensation plans\napproved by stockholders(1)(2)\n1,819,750\n(3)\n36.71\n(4)\n15,757,726\n(5)\nEquity compensation plans not\napproved by stockholders\nNone\nN/A\nNone\n(1)\nIncludes the 2001 Stock Option Plan, the 2010 Equity Incentive Plan and the Employee Stock Purchase Plan.\n(2)\nThe 2010 Equity Incentive Plan contains an “evergreen” provision, pursuant to which the number of shares of common stock reserved for issuance under the 2010 Equity Incentive Plan shall be increased on January 1 of\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\neach year beginning in 2011 and ending on January 1, 2020 in an amount equal to the lesser of 6% of the total number of our shares outstanding as of December 31 of the immediately preceding calendar year or a number of shares determined by our board of directors; provided, however, no more than 2,403,000 shares of our common stock may be issued upon the exercise of incentive stock options.\n(3)\nIncludes 944,886 shares subject to outstanding and unexercised stock options and 874,864 shares issuable in settlement of RSU and PSU awards.\n(4)\nThe weighted average exercise price reflects only the outstanding stock options, as the other forms of awards disclosed in this note entail the issuance of shares for the payment of no consideration.\n(5)\nIncludes 1,852,748 shares remaining available for future issuance under the Employee Stock Purchase Plan.",
    "item_13": "Item 13.\nCertain Relationships and Related Transactions, and Director Independence\nThe information required by this item is incorporated herein by reference to the sections titled “Certain Relationships and Related Transactions,” and “Information Regarding the Board of Directors and Corporate Governance-Director Independence” of the 2021 Proxy Statement.",
    "item_14": "Item 14.\nPrincipal Accounting Fees and Services\nThe information required by this item is incorporated herein by reference to the section titled “Audit Committee Report and Payment of Fees to Our Independent Auditor” of the 2021 Proxy Statement.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nPART IV",
    "item_15": "Item 15.\nExhibits, Financial Statement Schedules\nThe following documents are filed as a part of this Annual Report on Form 10-K:\n(a)\nFinancial Statements: The financial statements filed as a part of this report are listed in Part II, Item 8.\n(b)\nFinancial Statement Schedules: The schedules are either not applicable or the required information is presented in the consolidated financial statements or notes thereto.\n(c)\nExhibits: The exhibits incorporated by reference or filed as a part of this Annual Report on Form 10-K are listed in the Exhibit Index prior to the signatures to this report.\nItem 16.\nForm 10-K Summary\nNone.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nEXHIBIT INDEX\nIncorporated By Reference\nExhibit\nNumber\nExhibit Description\nForm\nDate of\nFirst\nFiling\nExhibit\nNumber\nFiled\nHerewith\n2.1\nMembership Interest Purchase Agreement, dated December 16, 2020\n8-K\n12/17/2020\n2.1\n3.1\nNinth Amended and Restated Certificate of Incorporation\n8-K\n05/21/2020\n3.2\n3.2\nAmended and Restated Bylaws\n8-K\n10/17/2017\n3.1\n4.1\nDescription of Capital Stock\nX\n10.1\n2001 Stock Option Plan**\nS-1/A\n01/11/2010\n10.3\n10.2\nForm of Incentive Stock Option Agreement under 2001 Stock Option Plan**\nS-1/A\n01/11/2010\n10.4\n10.3\nForm of Non-Statutory Stock Option Agreement (Director) under 2001 Stock Option Plan**\nS-1/A\n01/11/2010\n10.5\n10.4\n2010 Equity Incentive Plan, as amended effective October 29, 2014**\n10-K\n02/20/2015\n10.6\n10.5\nForm of Incentive Stock Option Agreement under 2010 Equity Incentive Plan**\n8-K\n02/17/2012\n10.2\n10.6\nForm of Non-Statutory Stock Option Agreement (Employee) under 2010 Equity Incentive Plan**\n8-K\n02/17/2012\n10.3\n10.7\nForm of Non-Statutory Stock Option Agreement (Director) under 2010 Equity Incentive Plan**\n8-K\n02/17/2012\n10.4\n10.8\nForm of Restricted Stock Unit Award Agreement under 2010 Equity Incentive Plan**\n8-K\n02/15/2017\n99.2\n10.9\nForm of Restricted Stock Award Agreement under 2010 Equity Incentive Plan**\n10-Q\n05/08/2012\n10.6\n10.10\nForm of Performance Stock Unit Agreement under 2010 Equity Incentive Plan**\n8-K\n02/18/2018\n10.1\n10.11\nForm of Deferred Stock Unit Agreement under 2010 Equity Incentive Plan\n10-Q\n04/26/2019\n10.2\n10.13\nForm of Indemnification Agreement for Independent Directors\nS-1/A\n01/11/2010\n10.18\n10.14\nForm of Indemnification Agreement for Archie C. Black**\nS-1/A\n01/11/2010\n10.19\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nIncorporated By Reference\nExhibit\nNumber\nExhibit Description\nForm\nDate of\nFirst\nFiling\nExhibit\nNumber\nFiled\nHerewith\n10.18\nManagement Incentive Plan**\n8-K\n02/03/2016\n10.2\n10.19\nAmended and Restated Executive Severance and Change in Control Agreement between the Company and Archie C. Black**\n8-K\n02/18/2020\n10.1\n10.20\nForm of Amended and Restated Executive Severance and Change in Control Agreement**\n8-K\n02/18/2020\n10.2\n10.21\nNon-Employee Director Compensation Summary**\n10-Q\n04/30/2020\n10.3\n21.1\nSubsidiaries of the registrant\nX\n23.1\nConsent of KPMG LLP\nX\n24.1\nPower of Attorney (included on signature page)\nX\n31.1\nCertification of Principal Executive Officer pursuant to Rules 13a-14(a) under the Securities Exchange Act of 1934, as amended\nX\n31.2\nCertification of Principal Financial Officer pursuant to Rules 13a-14(a) under the Securities Exchange Act of 1934, as amended\nX\n32.1\nCertification of Chief Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. Sec. 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\nInteractive Data Files Pursuant to Rule 405 of Regulation S-T\nX\nThe cover page from the Annual Report on Form 10-K for the year ended December 31, 2020, formatted in Inline XBRL.\nX\n**\nIndicates management contract or compensatory plan or arrangement.\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDated: February 23, 2021\nSPS COMMERCE, INC.\nBy:\n/s/ ARCHIE C. BLACK\nArchie C. Black\nPresident and Chief Executive Officer\nEach of the undersigned hereby appoints Archie C. Black and Kimberly K. Nelson, and each of them (with full power to act alone), as attorneys and agents for the undersigned, with full power of substitution, for and in the name, place and stead of the undersigned, to sign and file with the Securities and Exchange Commission under the Securities Exchange Act of 1934, any and all amendments and exhibits to this annual report on Form 10-K and any and all applications, instruments, and other documents to be filed with the Securities and Exchange Commission pertaining to this annual report on Form 10-K or any amendments thereto, with full power and authority to do and perform any and all acts and things whatsoever requisite and necessary or desirable. Pursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities indicated on February 23, 2021.\nName and Signature\nTitle\n/s/ ARCHIE C. BLACK\nChief Executive Officer, President and Director\nArchie C. Black\n(principal executive officer)\n/s/ KIMBERLY K. NELSON\nExecutive Vice President and Chief Financial Officer\nKimberly K. Nelson\n(principal financial and accounting officer)\n/s/ MARTIN J. LEESTMA\nDirector\nMartin J. Leestma\n/s/ JAMES B. RAMSEY\nDirector\nJames B. Ramsey\n/s/ MARTY M. RÉAUME\nDirector\nMarty M. Réaume\n/s/ TAMI L. RELLER\nDirector\nTami L. Reller\n/s/ PHILIP E. SORAN\nDirector\nPhilip E. Soran\n/s/ ANNE SEMPOWSKI WARD\nDirector\nAnne Sempowski Ward\n/s/ SVEN A. WEHRWEIN\nDirector\nSven A. Wehrwein\nSPS COMMERCE, INC.\nForm 10-K for the Annual Period ended December 31, 2020"
}