{
    "cik": "1169561",
    "company": "COMMVAULT SYSTEMS INC",
    "filing_type": "10-K",
    "filing_date": "2021-05-13",
    "period_of_report": "2021-03-31",
    "sic": "7372",
    "state_of_inc": "DE",
    "state_location": "NJ",
    "fiscal_year_end": "0331",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1169561/0001169561-21-000018-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1169561/000116956121000018/cvlt-20210331.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1169561/0001169561-21-000018.txt",
    "filename": "1169561_10K_2021_0001169561-21-000018.htm",
    "item_1": "Item 1. Business\nCompany Overview\nCommvault Systems, Inc. is a global data protection and information management software company offering customers enterprise level, intelligent data management solutions built from the ground up on a single platform and unified code base. Commvault was incorporated in Delaware in 1996.\nAt Commvault, we believe in solving hard problems for our customers. To do this, we provide capabilities which enable our customers to accelerate their digital transformation in today's ever evolving workforce using tools that are light touch and utilize artificial intelligence and machine learning to drive automation. Our product portfolio empowers our customers to reduce complexity, reign in data fragmentation, and accelerate their cloud journey. All software functionality shares the same back-end technologies to deliver the benefits of a holistic approach to protecting, managing, and accessing data. Our software addresses many aspects of storage and data management in the enterprise, while providing scalability and control of data and information. We believe our technology provides the broadest set of capabilities in the industry, which allows customers to reduce storage costs and administrative overhead. We also provide our customers with a broad range of professional services.\nProducts\nCommvault provides a portfolio of intelligent data management solutions that help organizations securely manage their data without increasing costs or complexity. These offerings are organized into three categories - (1) Data Protection, (2) Data Insights and (3) Storage.\nAll of Commvault's products are managed seamlessly through a single view. The Commvault Command Center is our user interface for managing data protection and disaster recovery initiatives. It provides default configuration values and streamlined procedures for routine data protection and recovery tasks. Customers can use the Command Center to set up their data protection environment, identify content that they want to protect, and initiate and monitor backups and restores. The main navigation pane allows customers to easily access various components including downloads, forms, analytics, monitoring and more. This provides a controlled foundation for self-service, helping to reduce the load on administrators and IT support staff.\nData Protection\nCommvault Backup and Recovery is designed to meet the needs of any size business and covers workloads across all locations: hybrid environments include on-premises and multiple cloud providers; physical servers; virtual machines; applications and databases; endpoint devices; cloud applications and more. Commvault Backup and Recovery provides backup, verifiable recovery and cost-optimized cloud workload mobility, helping to ensure data availability, even across multiple clouds. Our simplified backup and recovery solution allows customers to manage all workloads - cloud, virtual machines (\"VMs\"), containers, applications, databases and endpoints - from a single platform, while flexible copy data management allows users to multi-purpose backed-up data for DevOps, replication and more, across your entire infra-structure.\nCommvault Disaster Recovery provides an easy-to-use replication and disaster recovery solution from a single extensible platform, all managed through an intuitive user interface. Commvault’s standalone disaster recovery solution is both easy to implement and cost-effective. It provides orchestration and automated compliance reporting, flexible replication, cost-optimized cloud data mobility, and verifiable recoverability via copy data management.\nCommvault Complete Data Protection is a comprehensive, yet easy-to-use data protection solution that combines Commvault Backup and Recovery with Commvault Disaster Recovery. It delivers backup, replication, and disaster recovery for all workloads, on-premises, in the cloud, across multiple clouds, and in hybrid environments. It provides trusted recovery of data and applications, virtual machines, and containers, along with verifiable recoverability of replicas, cost-optimized cloud data mobility, security and resilient ransomware protection, and flexible copy data management to leverage protected data for DevOps, testing, and analytics.\nData Insights\nCommvault Activate is an integrated family of solutions for actionable insights, combining Commvault Data Governance, Commvault File Storage Optimization, and Commvault eDiscovery and Compliance. Activate can operate independent of Commvault Complete Data Protection or as part of a combined solution to maximize data management capabilities for any business. This means that with Activate customers can gain insights to data that isn’t managed by Commvault to drive analytics, and other tasks against those data sources.\nStorage\nHyperscale\nCommvault HyperScale X is an intuitive and easy-to-deploy, scale-out solution that is fully integrated with Commvault’s intelligent data management platform to help enterprises transition from legacy scale-up infrastructures. It provides scalability, security and resiliency to accelerate an organization’s digital transformation journey as they move to hybrid cloud, container and virtualized environments. Its flexible architecture allows customers to get up and running quickly and grow as needs change. HyperScale X technology accelerates hybrid cloud adoption with an integrated solution that delivers comprehensive data management for all workloads, including containers, virtual and databases, from a single, extensible platform. With HyperScale X, customers can leverage the entire Commvault software portfolio giving them access to all the features, functions, and industry leading integration with applications, databases, public cloud environments, hypervisors, operating systems, NAS systems and primary storage arrays, wherever the data resides. It is available in two form factors giving customers the flexibility to choose an implementation based on specific needs and preferences:\n•Commvault HyperScale X Appliance: A fully integrated appliance that streamlines operations and infrastructure and is ideally suited for smaller deployments with capacity requirements less than 150 terabytes that want the simplicity of an all-in-one integrated appliance from a single vendor\n•Commvault HyperScale X Software: Pre-validated hardware platform and configuration, provides greater flexibility and allows customer to leverage existing vendor relationships, and is ideally suited for larger environments that require greater scale\nHedvig\nThe Hedvig Distributed Storage Platform provides software-defined storage built on a truly hyperscale architecture that uses modern distributed system techniques to meet our customers primary, secondary and cloud data needs. With the capability to connect to any operating system, hypervisor, container or cloud, this unique platform also has the versatility to deploy in hyperscale or hyperconverged mode. Hedvig’s patented Universal Data Plane architecture stores, protects and replicates data across any number of private and/or public cloud data centers. The advanced software stack of the Hedvig Distributed Storage Platform simplifies all aspects of storage with a full set of enterprise data capabilities that can be provisioned at the application level and automated. The Hedvig Distributed Storage Platform is also integrated in our HyperScale X technology.\nMetallic Cloud Storage (MCSS)\nMCSS is the “easy button” to adopt secure and scalable cloud storage in minutes, right from the Commvault Command Center - delivering against an organizations hybrid cloud strategy, without the need for additional cloud expertise. It is an integrated cloud storage target that makes it simple for IT organizations to adopt cloud storage for Commvault Backup & Recovery or HyperScale X - to ease digital transformation, save costs, reduce risk and scale limitlessly.\nMetallic Backup-as-a-Service\nLaunched in October 2019, Metallic delivers data protection technology with the ease and agility of software as a service (\"SaaS\"), getting companies up and running in protecting critical business data within minutes. Powered by the same core Commvault technology, Metallic delivers enterprise-grade data protection, with the simplicity of SaaS. Metallic runs on a pre-built platform, with core code deployed in the cloud. An active SaaS layer and application program interfaces manage functions including billing, metrics, and identity management. Current Metallic offerings include data protection for virtual machines and Kubernetes, databases, files, Office 365, Salesforce and endpoints.\nServices\nCommvault offers a wide range of professional services to complement its product portfolio. The cornerstone of our service offerings is our customer support. We offer multiple levels of customer success that can be tailored to the customer’s response needs and business sensitivities.\nOur customer support services consist of:\n•Real-Time Support. Our support staff is available 24/7 by telephone to provide first response and manage the resolution of customer issues. In addition to phone support, our customers have access to an online product support database for help with troubleshooting and operational questions. Innovative use of web-based diagnostic tools provides problem analysis and resolution. Our software design is also an important element in our comprehensive customer support, including “root cause” problem analysis, intelligent alerting and troubleshooting assistance. Our software is directly linked to our online support database allowing customers to analyze problems without engaging our technical support personnel.\n•Significant Network and Hardware Expertise. Our support engineers have extensive knowledge of complex applications, servers and networks. We proactively take ownership of the customer’s problem, regardless of whether the issue is directly related to our products or to those of another vendor. We have also developed and maintain a knowledge library of storage systems and software products to further enable our support organization to quickly and effectively resolve customer problems.\n•Global Operations. Our global customer support headquarters is located at our state-of-the-art technical support center in Tinton Falls, New Jersey. We also have established support operations in Reading, United Kingdom; Sydney, Australia; Bangalore, India; and Shanghai, China, which are complemented by regional support centers. Our cloud-based support system creates a virtual global support center combining these locations to allow for the fastest possible resolution times for customer incidents. We have designed our support infrastructure to be able to scale with the increasing globalization of our customers.\n•Enhanced Support Options. We offer several enhanced customer support services such as Enterprise Support. Our Enterprise Support service is for customers with critical support needs and builds on our 24/7 real-time support deliverables and includes various levels of enhanced services to ensure dedicated support and customized reporting. Enterprise Support adds a specialized team of technical support engineers, an assigned support account manager and innovative tools to achieve our customers’ mission.\nOur technology consultants ensure that our customers' software environment is designed for optimal results and will continue to deliver over the long term. This same team of experts can install, configure, personalize and validate that environment so customers can achieve a better return on investment, faster and with more confidence.\n•Technology Consulting Services. Our technology consulting ensures that a customer’s software environment is designed for optimal results and will continue to deliver over the long term. We offer services such as architecture design; implementation; personalization; data migration; and health assessment. In addition, our residency services offer customers staff-augmentation options to assist with the rapid expert deployment of the Commvault software suite.\n•Business Consulting Services. Our business consultants provide transformational insights that align to how specific businesses gather, retain and employ data. We offer services such as disaster recovery readiness and policy implementation; private cloud services design; data classification and archive policy implementation; and operational efficiency assessment.\n•Education Services. We provide global onsite training, offsite training and self-paced online alternatives for our products.\n•Remote Managed Services. Commvault Remote Managed Services provides remote monitoring and management of the Commvault data management platform deployed on a customer's environment. Our engineers configure, maintain and optimize a customer's Commvault software environment remotely via a secure connection.\nCustomers\nOur current customer base spans thousands of organizations across a wide variety of sizes, including large global enterprise companies, and small or mid-sized businesses and government agencies. We support customers in a broad range of industries, including banking, insurance and financial services, government, healthcare, pharmaceuticals and medical services, technology, legal, manufacturing, utilities and energy.\nStrategic Relationships\nAn important element of Commvault’s strategy is to establish relationships with third parties that assist us in developing, marketing, selling and implementing our software and services. We believe that strategic and technology-based relationships with industry leaders are fundamental to our success. We have forged numerous relationships with software application, hardware and cloud vendors to enhance our combined capabilities and to create the optimal combination of data and information management applications. We believe this approach enhances our ability to expand our product offerings and customer base and to enter new markets. We have established the following types of strategic relationships:\nAlliance and Technology Partners. We maintain strategic product and technology relationships with major industry leaders to ensure that our software applications are integrated with, supported by and add value to our partners’ hardware and software products. Collaboration with these market leaders allows us to provide applications that enable our customers to improve data and information management efficiency. Our significant strategic relationships include Microsoft (including Azure), Cisco, Dell EMC, Amazon Web Services (AWS), NetApp, Nutanix, Fujitsu, Google Cloud, Hitachi, Hewlett Packard Enterprise, IBM, Lenovo, OpenStack, Oracle, Pure Storage, Red Hat, Salesforce, SAP, ServiceNow, Splunk, Supermicro and VMware. In addition to these relationships, we maintain relationships with a broad range of industry operating system, application and infrastructure vendors to verify and demonstrate the interoperability of our software applications with their equipment and technologies.\nDistributors, Value-Added Reseller, Systems Integrator, Corporate Reseller and Original Equipment Manufacturer Relationships. Our corporate resellers bundle or sell our software applications together with their own products, and our value-added resellers resell our software applications independently. As of March 31, 2021, we had more than 500 reseller partners and systems integrators that have distributed our software worldwide.\nIn order to broaden our market coverage, we work closely with our global original equipment manufacturer (\"OEM\") partners, investing significant time and resources to deliver unique, joint solutions incorporating Commvault software. These partners team with our technical, engineering, marketing and sales force on helping to enhance integration, tuning, operational management, implementation and vision for solutions that are designed to meet current and future data and information management needs. Our alliance managers work directly with global OEM partners to design, deliver and support field activities that make it easier for customers to locate, learn about, and purchase these differentiated solutions. Our most significant OEM partner is Hitachi Vantara (\"Hitachi\"). Hitachi has no obligation to recommend or offer our software applications exclusively or at all, and they have no minimum sales requirements and can terminate our relationship at any time.\nAdditionally, we have a non-exclusive distribution agreement covering our North American commercial markets and our U.S. Federal Government markets with Arrow Enterprise Computing Solutions, Inc. (\"Arrow\"), a subsidiary of Arrow Electronics, Inc. Pursuant to this distribution agreement, Arrow's primary role is to enable a more efficient and effective distribution channel for our products and services by managing our reseller partners and leveraging their own industry experience. Sales generated through our distribution agreement with Arrow accounted for 36% of our total revenue in fiscal 2021 and 37% of our total revenue in fiscal 2020.\nService Provider Partners. Our software is the data protection platform for over 200 service providers, which provide cloud-based solutions to client systems worldwide. As companies of all sizes and markets rapidly adopt cloud infrastructures for improved costs, speed and agility, we remain committed to these strategic relationships to address this growing trend. Customers looking to move IT operations into the cloud depend on service providers to help them migrate, manage and protect their cloud infrastructures. We have partnered with a broad ecosystem of managed service provider and cloud partners so they can effectively deliver data management-as-a-service solutions based on Commvault software across geographies, vertical markets and offerings. Leading providers who have integrated Commvault software into their solution portfolios include Microsoft Azure, Amazon AWS, Google Cloud, Rackspace, Meridian, Sirius and Flexential.\nCompetition\nThe data storage management market is intensely competitive, highly fragmented and characterized by rapidly changing technology and evolving standards. The principal competitive factors in our industry include product functionality, product performance, product integration, platform coverage, ability to scale, price, worldwide sales infrastructure, global technical support, name recognition and reputation. The ability of major system vendors to bundle hardware and software solutions is also a significant competitive factor in our industry.\nWe currently compete with other providers of data and information management software as well as large and emerging storage hardware manufacturers that have developed or acquired their own data and information management software products. These manufacturers have the resources and capabilities to develop their own data and information management software applications, and many have been making acquisitions and broadening their efforts to include broader data and information management and storage products. These manufacturers and our other current and potential competitors may establish cooperative relationships among themselves or with third parties, creating new competitors or alliances. Large operating system and application vendors have introduced products or functionality that includes some of the same functions offered by our software applications. In the future, further development by these vendors could cause some features of our software applications to become redundant.\nOur primary competitors in the data and information management software applications market, each of which has one or more products that compete with a part of or our entire software suite, are Dell-EMC, IBM, Veritas, Veeam, Rubrik and Cohesity.\nSome of our competitors have greater financial resources and may have the ability to offer their products at lower prices than ours. In addition, some of our competitors have greater name recognition than us, which could provide them a competitive advantage with some customers. Some of our competitors also have longer operating histories, have substantially greater technical, sales, marketing and other global resources than we do, as well as a larger installed customer base and broader product offerings, including hardware. As a result, these competitors can devote greater resources to the development, promotion, sale and support of their products than we can. Refer to our \"Risk Factors\" below.\nSales and Marketing\nWe sell our data and information management software applications and related services to large global enterprises, small and medium sized businesses, and government agencies. We sell through our worldwide direct sales force and our global network of distributors, value-added resellers, systems integrators, corporate resellers and OEM partners.\nWe have a variety of marketing programs designed to create brand awareness and market recognition for our product offerings and for sales lead generation. Our marketing efforts include webinars, active participation at trade shows, technical conferences and technology seminars; advertising; content development and distribution; public relations; social media; industry analyst relations; publication of technical and educational articles in industry journals; sales training; and preparation of competitive analyses. In addition, our strategic partners augment our marketing and sales campaigns through seminars, trade shows and joint public relations and advertising campaigns. Our customers and strategic partners provide references and recommendations that we often feature in external marketing activities.\nResearch and Development\nOur research and development organization is responsible for the design, development, testing and certification of our data and information management software applications. Our engineering efforts support product development across all major operating systems, databases, applications and network storage devices. A substantial amount of our development effort goes into certification, integration and support of our applications to ensure interoperability with our strategic partners’ hardware and software products. We have also made substantial investments in the automation of our product test and quality assurance laboratories.\nTechnology, Intellectual Property and Proprietary Rights\nWe believe our software platform serves as a major differentiator versus our competitors’ data and information management software products. Our platform’s unique indexing, cataloging, data movement, media management and policy technologies are the source of the performance, scale, management, cost of ownership\nbenefits and seamless interoperability inherent in all of our data and information management software applications. Additional options enable content search, data encryption and auditing features to support data discovery and compliance requirements. Our success and ability to compete depend on our continued development and protection of our proprietary software and other technologies, including \"open source\" software. We rely primarily on a combination of trade secret, patent, copyright and trademark laws, as well as contractual provisions, to establish and protect our intellectual property rights.\nAs of March 31, 2021, we had 883 issued patents and 399 pending patent applications in the United States, as well as 130 issued patents in foreign countries and 15 pending foreign patent applications. As disclosed, we have established proprietary trademark rights in markets across the globe, and own hundreds of U.S. and foreign trademark registrations and pending registration applications for marks comprised of or incorporating the Commvault name. Refer to our “Risk Factors” below.\nPeople\nCommvault aims to unlock potential in data, customers and our employees. To accomplish that, everyone has the green light to discover, create, nurture and sustain the energy needed to drive innovation and help our customers-by inspiring one another, by imagining what others simply don’t and by working to make what’s already great, even greater-whether that’s product, process or team. As of March 31, 2021, we had 2,671 employees worldwide, including 1,003 in sales and marketing, 724 in research and development, 621 in customer services and support and 323 in general and administration. Approximately 48% were in the United States and 52% were located internationally.\nInclusion and Diversity\nAt Commvault, we believe that diversity is more than a program - it is a business imperative at the heart of our human capital management strategy. In partnership with our leadership team, we not only drive the ability to be a best-in-class data management organization but uphold our value in the marketplace by leading as an employer of choice. Our commitment is driven and executed by a three-pronged approach to Inclusion and Diversity (\"I&D\"): Workplace Inclusion, Workforce Diversity and Personal Accountability.\nTo fortify our strategy, we continue to elevate our employee engagement efforts - which is the foundation of our approach. We have implemented an Employee Resource Group (“ERG”) operating model and have established four ERGs to provide opportunity for cross-cultural learning, mentoring and relationship building across employees:\n1.CV WIT (Women in Technology),\n2.Multi-Culture,\n3.LGBTQ+ & Allies, and\n4.VALOR (Veterans)\nIn addition to our continued employee engagement initiatives, in 2020 we launched the Courageous Conversations platform. Courageous Conversations was designed as a forum where difficult conversations can be broached in an open, safe and respectful manner. This platform has become the hub for all I&D related conversations, where employees and senior leaders share courageous life experiences related to bias and social injustice. Since its inception, we have hosted seven powerful sessions, each virtually, reaching our workforce population around the globe.\nWe continue to be committed to our focus to secure the very best talent, with a concerted effort to expound on and build a truly inclusive and diverse pipeline of candidates. We are committed to providing a clear line of sight to career progression while investing in the development, creativity and aspirational needs of all employees.\nCOVID-19 Response\nCommvault values its people. In navigating this unprecedented time, we are focused on driving business globally while honoring and caring for the health and safety of our employees, customers, and partners. During 2020, and continuing into 2021, the vast majority of our employees worked remotely, delivering successful and proactive results. We continue to monitor the spread of COVID-19 and are adhering to guidelines set forth by the World Health Organization and Centers for Disease Control as we look to reopen offices. We continue to provide employees with routine updates, resources and support to ensure everyone’s health, safety and well-being.\nInformation about our Executive Officers\nThe following table presents information with respect to our executive officers as of May 10, 2021:\nName Age Position\nSanjay Mirchandani 56 President and Chief Executive Officer\nBrian Carolan 50 Vice President, Chief Financial Officer\nRiccardo Di Blasio 49 Vice President, Chief Revenue Officer\nGary Merrill 46 Chief - Business Operations\nSanjay Mirchandani, has served as our President and Chief Executive Officer since February 2019. Prior to joining Commvault, Mr. Mirchandani served from September 2016 to January 2019 as the Chief Executive Officer of Puppet, Inc. (“Puppet”), an Oregon-based IT automation company. Mr. Mirchandani joined Puppet in May 2016 as President and Chief Operating Officer. Mr. Mirchandani brings a wealth of international business experience through his diverse well-rounded career in technology. Before joining Puppet, from October 2013 to April 2016, Mr. Mirchandani served as Corporate Senior Vice President and General Manager of Asia Pacific and Japan at VMware, Inc. and, from June 2006 to October 2013, Mr. Mirchandani held various senior leadership positions at EMC Corporation, including Chief Information Officer and leader of the Global Centers of Excellence. Prior to that, Mr. Mirchandani held various positions at Microsoft Corporation and Arthur Andersen LLP. Mr. Mirchandani has a Master of Business Administration degree from the University of Pittsburgh and a bachelor’s degree in mathematics from Drew University.\nBrian Carolan has served as our Vice President, Finance and Chief Financial Officer since October 2012. Prior to his current role, Mr. Carolan served as our Vice President, Finance and Chief Accounting Officer from July 2006 until September 2012. He also held the position of Controller from February 2001 until June 2006. Prior to joining Commvault, Mr. Carolan was with Ernst & Young LLP in its Technology, Communications and Entertainment audit practice from 1993 until January 2001. Mr. Carolan obtained his bachelor’s degree in accounting from Villanova University, his master’s degree in business administration from New York University and is a certified public accountant in the State of New Jersey.\nRiccardo Di Blasio has served as our Vice President, Chief Revenue Officer since May 2019. Prior to joining Commvault, Mr. Di Blasio led DXC Technology as Global Head of Sales for VMware Cloud Platform Services. Prior to that role, he was Chief Executive Officer at Globetouch, Inc., leading the company growth in the IoT and connected cars industry from January 2017 until April 2018. He also served as Chief Operating Officer at Cohesity from October 2015 until November 2016, where he significantly grew the sales and support organizations while expanding global operations and achieving double digit growth in sales. Previous to those positions, he served in various leadership roles for more than a decade across US and Europe, as Senior Vice President of Sales and Marketing at VMware and EMC Corporation.\nGary Merrill was appointed to Chief - Business Operations effective April 2021. Prior to his current role, Mr. Merrill served as Vice President of Operations of the Company from April 2019 through March 2021, and Vice President Finance, Chief Accounting Officer from December 2012 to March 2019. Mr. Merrill was Corporate Controller of the Company from 2007 to 2012 and Assistant Controller from 2005 to 2007. Prior to joining the Company, Mr. Merrill held accounting management positions with several publicly traded companies. Mr. Merrill began his career with Arthur Andersen LLP in its audit practice. Mr. Merrill obtained his bachelor’s degree in accounting from Elizabethtown College and is a Certified Public Accountant in the State of Pennsylvania.\nAvailable Information\nOur internet address is www.commvault.com. On the investor relations section of this website, we post the filings as soon as reasonably practicable after they are electronically filed with or furnished to the U.S. Securities and Exchange Commission (\"SEC\") including: our Annual Reports on Form 10-K, our quarterly reports on Form 10-Q, our current reports on Form 8-K, our proxy statements related to our annual stockholders’ meetings and any amendment to those reports or statements filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended. All such filings are available on the Investors Relations portion of our web site free of charge. The contents of our web site are not incorporated by reference into this Form 10-K or in any other report, statement or document we file with the SEC.\nThe SEC maintains an internet site at http://www.sec.gov that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC and you can also access our SEC filings at the SEC’s Internet address.",
    "item_1A": "Item 1A. Risk Factors\nYou should consider each of the following factors as well as the other information in this Annual Report in evaluating our business and our prospects. The risks and uncertainties described below are not the only ones we face. Additional risks and uncertainties not presently known to us or that we currently consider immaterial may also impair our business operations. If any of the following risks actually occur, our business and financial results could be harmed. In that case, the trading price of our common stock could decline. You should also refer to the other information set forth in this Annual Report, including our financial statements and the related notes.\nSummary of Risk Factors\nRisks Related to Our Business\n•The novel coronavirus (COVID-19) pandemic could adversely affect our business in a material way.\n•We have engaged, and may continue to engage, in strategic acquisitions or transactions, which could have a material adverse effect on our business, results of operations, financial condition and cash flows.\n•Our industry is intensely competitive, and many of our competitors have greater financial, technical and sales and marketing resources and larger installed customer bases than we do, which could enable them to compete more effectively than we do.\n•We rely on indirect sales channels, such as value-added resellers, systems integrators, corporate resellers, distributors, and OEMs, for the distribution of our software applications, and the failure of these channels to effectively sell our software applications could have a material adverse effect on our revenues and results of operations.\n•We may not be able to respond to rapid technological changes with new software applications and services offerings, which could have a material adverse effect on our sales and profitability.\n•If the cost for annual maintenance and support agreements, or our term-based subscription licenses, with our customers is not competitive in the market or if our customers do not renew their agreements either at all, or on terms that are less favorable to us, our business and financial performance might be adversely impacted.\n•In periods of volatile economic conditions, our exposure to credit risk and payment delinquencies on our accounts receivable significantly increases.\n•We develop software applications that interoperate with certain software, operating systems and hardware developed by others, and if the developers of those operating systems and hardware do not cooperate with us or we are unable to devote the necessary resources so that our applications interoperate with those systems, our software development efforts may be delayed or foreclosed and our business and results of operations may be adversely affected.\n•We sell a backup appliance which integrates our software with hardware. If we fail to accurately predict our manufacturing requirements and manage our supply chain we could incur additional costs or experience manufacturing delays that could harm our business.\n•We encounter long sales and implementation cycles, particularly for our larger customers, which could have an adverse effect on the size, timing and predictability of our revenues.\n•We depend on growth in the data and information management software market, and lack of growth or contraction in this market could have a material adverse effect on our sales and financial condition.\n•Our software applications are complex and may contain undetected errors, which could adversely affect not only our software applications’ performance but also our reputation and the acceptance of our software applications in the market.\n•We may not receive significant revenues from our current research and development efforts for several years, if at all.\n•We implemented a restructuring program in fiscal 2019, which we cannot guarantee will achieve its intended result.\n•Our ability to sell our software applications is highly dependent on the quality of our service offerings, and our failure to offer high quality support and professional services would have a material adverse effect on our sales of software applications and results of operations.\n•A portion of our revenue is generated by sales to government entities, which are subject to a number of challenges and risks.\n•Change in senior management could cause disruption in the Company and have a material effect on our business. Furthermore, the loss of key personnel or the failure to attract and retain highly qualified personnel could have an adverse effect on our business.\n•Risks from investing in growth opportunities could impact our business.\nRisks Related to our International Operations\n•Volatility in the global economy could adversely impact our continued growth, results of operations and our ability to forecast future business.\n•Our international sales and operations are subject to factors that could have an adverse effect on our results of operations.\n•We may experience fluctuations in foreign currency exchange rates that could adversely impact our results of operations.\nRisks Related to Information Technology and Security\n•We may be subject to information technology system failures, network disruptions and breaches in data security.\n•Many of our key financial systems used for internal purposes are cloud-based solutions provided by third parties.\nRisks Related to Legal Matters and Intellectual Property\n•We are, and may in the future become, involved in litigation that may have a material adverse effect on our business.\n•Protection of our intellectual property is limited, and any misuse of our intellectual property by others could materially adversely affect our sales and results of operations.\n•Claims that we misuse the intellectual property of others could subject us to significant liability and disrupt our business, which could have a material adverse effect on our results of operations and financial condition.\n•Our use of “open source” software could negatively affect our business and subjects us to possible litigation.\nRisks Related to Tax and Accounting\n•Our effective tax rate is difficult to project, and changes in such tax rate or adverse results of tax examinations could adversely affect our operating results.\n•Our reported financial results may be adversely affected by changes in accounting principles generally accepted in the United States.\nRisks Related to our Common Stock\n•Certain provisions of our certificate of formation and our amended and restated bylaws or Delaware law could prevent or delay a potential acquisition of control of our Company, which could decrease the trading price of our common stock.\n•Although we believe we currently have adequate internal control over financial reporting, we are required to assess our internal control over financial reporting on an annual basis, and any future adverse results from such assessment could result in a loss of investor confidence in our financial reports and have an adverse effect on our stock price.\n•We may experience a decline in revenues or volatility in our quarterly operating results, which may adversely affect the market price of our common stock.\n•The price of our common stock may be highly volatile and may decline regardless of our operating performance.\nGeneral Risks\n•Our business could be materially and adversely affected as a result of natural disasters, terrorism or other catastrophic events.\nRisks Related to Our Business\nThe novel coronavirus (COVID-19) pandemic could adversely affect our business in a material way.\nAs a global company, with employees and customers located around the world in a variety of industries, our performance may be impacted by global economic and other conditions, including the COVID-19 pandemic which has caused global economic uncertainty. Efforts to combat this pandemic to date include a range of travel restrictions, shelter in place orders, and mandatory business and other closure, each of which may cause significant disruption to our customers and cause them to curtail or limit spending. As a software company, our ability to support our customers has not been significantly impacted by work-from-home orders or travel restrictions. However, these measures have caused disruptions to our sales efforts and decreased customer spending, which may negatively impact our performance. The extent to which COVID-19 will impact our business is difficult to predict as it depends on factors outside of our control, including the duration of the pandemic and the impact on our customers’ businesses. We have taken precautionary measures to protect the health and safety of our employees and to preserve our cash position and we continue to monitor events.\nWe have engaged, and may continue to engage, in strategic acquisitions or transactions, which could have a material adverse effect on our business, results of operations, financial condition and cash flows.\nAcquisitions involve a number of risks, including diversion of management’s attention, ability to finance the acquisition on attractive terms, failure to retain key personnel or valuable customers, legal liabilities and the need to amortize acquired intangible assets, any of which could have a material adverse effect on our business, results of operations, financial condition and cash flows. Any additional future acquisitions may also result in the incurrence of indebtedness or the issuance of additional equity securities.\nThe intellectual property of an acquired business may be an important component of the value that we agree to pay for such a business. Although we conduct due diligence in connection with each of our acquisitions, such acquisitions are subject to the risks that the acquired business may not own the intellectual property that we believe we are acquiring, that the intellectual property is dependent upon licenses from third parties, that the acquired business infringes upon the intellectual property rights of others or that the technology does not have the acceptance in the marketplace that we anticipated.\nWe could also experience financial or other setbacks if transactions encounter unanticipated problems, including problems related to execution, integration or underperformance relative to prior expectations. Our management may not be able to successfully integrate any acquired business into our operations or maintain our standards, controls and policies, which could have a material adverse effect on our business, results of operations and financial condition. Consequently, any acquisition we complete may not result in long-term benefits to us or we may not be able to further develop the acquired business in the manner we anticipated.\nFollowing the completion of acquisitions, we may have to rely on the seller to provide administrative and other support, including financial reporting and internal controls, and other transition services to the acquired business for a period of time. There can be no assurance that the seller will do so in a manner that is acceptable to us.\nOur industry is intensely competitive, and many of our competitors have greater financial, technical and sales and marketing resources and larger installed customer bases than we do, which could enable them to compete more effectively than we do.\nThe data and information management software market is intensely competitive, highly fragmented and characterized by rapidly changing technology and evolving standards, changing customer requirements and frequent new product introductions. Competitors vary in size and in the scope and breadth of the products and services offered. Our primary competitors include Dell-EMC, IBM, Veritas, Veeam, Rubrik and Cohesity.\nThe principal competitive factors in our industry include product functionality, product integration, platform coverage, ability to scale, price, worldwide sales infrastructure, global technical support, name recognition and reputation. The ability of major system vendors to bundle hardware and software solutions is also a significant competitive factor in our industry. If we are unable to address these factors, our competitive position could weaken and we could experience a decline in revenues that could adversely affect our business.\nMany of our current and potential competitors have longer operating histories and have substantially greater financial, technical, sales, marketing and other resources than we do, as well as larger installed customer bases, greater name recognition and broader product offerings, including hardware. Some of these competitors can devote greater resources to the development, promotion, sale and support of their products than we can and have the ability to bundle their hardware and software products in a combined offering. As a result, these competitors may be able to respond more quickly to new or emerging technologies and changes in customer requirements.\nIt is also costly and time-consuming to change data and information management systems. Most of our new customers have installed data and information management software, which gives an incumbent competitor an advantage in retaining a customer because it already understands the network infrastructure, user demands and information technology needs of the customer, and also because some customers are reluctant to invest the time and money necessary to change vendors.\nOur current and potential competitors may establish cooperative relationships among themselves or with third parties. If so, new competitors or alliances that include our competitors may emerge that could acquire significant market share. In addition, large operating system and application vendors, as well as some hardware manufacturers, have introduced products or functionality that includes some of the same functions offered by our software applications. In the future, further development by these vendors could cause our software applications and services to become redundant, which could seriously harm our sales, results of operations and financial condition.\nNew competitors entering our markets can have a negative impact on our competitive positioning. In addition, we expect to encounter new competitors as we enter new markets. Furthermore, many of our existing competitors are broadening their operating systems platform coverage. We also expect increased competition from OEMs, including those we partner with, and from systems and network management companies, especially those that have historically focused on the mainframe computer market and have been making acquisitions and broadening their efforts to include data and information management and storage products. We expect that competition will increase as a result of future software industry consolidation. Increased competition could harm our business by causing, among other things, price reductions of our products, reduced profitability and loss of market share.\nWe rely on indirect sales channels, such as value-added resellers, systems integrators, corporate resellers, distributors, and OEMs, for the distribution of our software applications, and the failure of these channels to effectively sell our software applications could have a material adverse effect on our revenues and results of operations.\nWe rely significantly on our value-added resellers, systems integrators and corporate resellers, which we collectively refer to as resellers, for the marketing and distribution of our software applications and services. Resellers are our most significant distribution channel. However, our agreements with resellers are generally not exclusive, are generally renewable annually, typically do not contain minimum sales requirements and in many cases may be terminated by either party without cause. Many of our resellers carry software applications that compete with ours. These resellers may give a higher priority to other software applications, including those of our competitors, or may not continue to carry our software applications at all. If a number of resellers were to discontinue or reduce the sales of our products, or were to promote our competitors’ products in lieu of our own, it could have a material adverse effect on our future revenues. Events or occurrences of this nature could seriously harm our sales and results of operations. If we fail to manage our resellers successfully, there may be conflicts between resellers or they could fail to perform as we anticipate, including required compliance with the terms and obligations of our reseller agreement, either of which could reduce our sales or impact our reputation in the market. In addition, we expect that a portion of our sales growth will depend upon our ability to identify and attract new reseller partners. Our competitors also use reseller arrangements and may be more successful in attracting reseller partners and could enter into exclusive relationships with resellers that make it difficult to expand our reseller network. Any failure on our part to maintain and/or expand our network of resellers could impair our ability to grow revenues in the future.\nSome of our resellers possess significant resources and advanced technical abilities. These resellers, particularly our corporate resellers, may, either independently or jointly with our competitors, develop and market products and related services that compete with our offerings. If this were to occur, these resellers might discontinue marketing and distributing our software applications and services. In addition, these resellers would have an advantage over us when marketing their competing products and related services because of their existing\ncustomer relationships. The occurrence of any of these events could have a material adverse effect on our revenues and results of operations.\nIn addition, we have a distribution agreement covering our North American commercial markets and our U.S. Federal Government market with Arrow. Pursuant to this distribution agreement, Arrow’s primary role is to enable a more efficient and effective distribution channel for our products and services by managing our reseller partners and leveraging their own industry experience. Many of our North American resellers buy from Arrow. Sales through our distribution agreement with Arrow accounted for approximately 36% of our total revenues for fiscal 2021 and 37% of our total revenues for fiscal 2020. If Arrow was to discontinue or reduce the sales of our products or if our agreement with Arrow was terminated, and if we were unable to take back the management of our reseller channel or find another North American distributor to replace Arrow, then it could have a material adverse effect on our future revenues.\nOur OEMs sell our software applications and in some cases incorporate our data and information management software into systems that they sell. A material portion of our revenues is generated through these arrangements. However, we have no control over the shipping dates or volumes of systems these OEMs ship and they have no obligation to ship systems incorporating our software applications. They also have no obligation to recommend or offer our software applications exclusively or at all, and they have no minimum sales requirements and can terminate our relationship at any time. These OEMs also could choose to develop their own data and information management software internally and incorporate those products into their systems instead of our software applications. The OEMs that we do business with also compete with one another. If one of our OEM partners views our arrangement with another OEM as competing with its products, it may decide to stop doing business with us. Any material decrease in the volume of sales generated by OEMs we do business with, as a result of these factors or otherwise, could have a material adverse effect on our revenues and results of operations in future periods.\nWe may not be able to respond to rapid technological changes with new software applications and services offerings, which could have a material adverse effect on our sales and profitability.\nThe markets for our software applications are characterized by rapid technological changes, changing customer needs, frequent new product introductions and evolving industry standards. The introduction of software applications embodying new technologies and the emergence of new industry standards could make our existing and future software applications obsolete and unmarketable. As a result, we may not be able to accurately predict the lifecycle of our software applications, and they may become obsolete before we receive the amount of revenues that we anticipate from them. If any of the foregoing events were to occur, our ability to retain or increase market share in the data and information management software market could be materially adversely affected.\nWe devote significant resources to the development of new products and the enhancement of existing products. To be successful, we need to anticipate, develop and introduce new software applications and services on a timely and cost-effective basis that keep pace with technological developments and emerging industry standards and that address the increasingly sophisticated needs of our customers. We may fail to develop and market software applications and services that respond to technological changes or evolving industry standards, experience difficulties that could delay or prevent the successful development, introduction and marketing of these applications and services or fail to develop applications and services that adequately meet the requirements of the marketplace or achieve market acceptance. Our failure to develop and market such applications and services on a timely basis, or at all, could have a material adverse effect on our sales and profitability.\nIf the cost for annual maintenance and support agreements, or our term-based subscription licenses, with our customers is not competitive in the market or if our customers do not renew their agreements either at all, or on terms that are less favorable to us, our business and financial performance might be adversely impacted.\nMost of our maintenance agreements are for a one-year term. As the end of the annual period approaches, we pursue the renewal of the agreement with the customer. Historically, maintenance renewals have represented a significant portion of our total revenue. Because of this characteristic of our business, if our customers do not renew their annual maintenance and support agreements either at all, or on terms that are less favorable to us, our business and financial performance might be adversely impacted.\nAdditionally, beginning in fiscal 2018 we began to increase a significant amount of our sales to term-based, or subscription, license arrangements. The arrangements are typically three years in duration. If at the end of the initial term, customers elect to not renew their licenses, or they renew them on terms that are less favorable to us, our business and financial performance might be adversely impacted.\nIn periods of volatile economic conditions, our exposure to credit risk and payment delinquencies on our accounts receivable significantly increases.\nOur outstanding accounts receivables are generally not secured. Our standard terms and conditions permit payment within a specified number of days following the receipt of our product. Volatile economic conditions, including those related to the recent COVID-19 pandemic, could result in our customers and resellers facing liquidity concerns leading to them not being able to satisfy their payment obligations to us, which would have a material adverse effect on our financial condition, operating results and cash flows.\nIn addition, in the future we may transition a more significant percentage of our revenue to subscription, or term based, arrangements. In these arrangements, our customers may pay for software and related services over a period of several years. Due to the potential for extended period of collection, we may be exposed to more significant credit risk.\nWe develop software applications that interoperate with certain software, operating systems and hardware developed by others, and if the developers of those operating systems and hardware do not cooperate with us or we are unable to devote the necessary resources so that our applications interoperate with those systems, our software development efforts may be delayed or foreclosed and our business and results of operations may be adversely affected.\nOur software applications operate primarily on the Windows, UNIX, Linux and Novell Netware operating systems; used in conjunction with Microsoft SQL; and on hardware devices of numerous manufacturers. When new or updated versions of these operating systems, software applications, and hardware devices are introduced, it is often necessary for us to develop updated versions of our software applications so that they interoperate properly with these systems and devices. We may not accomplish these development efforts quickly or cost-effectively, and it is not clear what the relative growth rates of these operating systems and hardware will be. These development efforts require the cooperation of the developers of the operating systems, software applications, and hardware, substantial capital investment and the devotion of substantial employee or financial resources. For some operating systems, we must obtain some proprietary application program interfaces from the owner in order to develop software applications that interoperate with the operating system. Operating system and software owners have no obligation to assist in these development efforts. If they do not provide us with assistance, the contractual right, or the necessary proprietary application program interfaces on a timely basis, we may experience delays or be unable to expand our software applications into other areas.\nWe sell a backup appliance which integrates our software with hardware. If we fail to accurately predict our manufacturing requirements and manage our supply chain we could incur additional costs or experience manufacturing delays that could harm our business.\nWe generally provide forecasts of our requirements to our supply chain partners on a rolling basis. If our forecast exceeds our actual requirements, a supply chain partner may assess additional charges or we may incur costs for excess inventory, each of which could negatively affect our gross margins. If our forecast is less than our actual requirements, the applicable supply chain partner may have insufficient time or components to produce or fulfill our product requirements, which could delay or interrupt manufacturing of our products or fulfillment of orders for our products, and result in delays in shipments, customer dissatisfaction, and deferral or loss of revenue. Further, we may be required to purchase sufficient inventory to satisfy our future needs in situations where a\ncomponent or product is being discontinued. If we fail to accurately predict our requirements, we may be unable to fulfill those orders or we may be required to record charges for excess inventory. Any of the foregoing could adversely affect our business, financial condition or results of operations.\nWe encounter long sales and implementation cycles, particularly for our larger customers, which could have an adverse effect on the size, timing and predictability of our revenues.\nPotential or existing customers, particularly larger enterprise customers, generally commit significant resources to an evaluation of available software and require us to expend substantial time, effort and money educating them as to the value of our software and services. Sales of our core software products to these larger customers often require an extensive education and marketing effort.\nWe could expend significant funds and resources during a sales cycle and ultimately fail to win the customer. Our sales cycle for all of our products and services is subject to significant risks and delays over which we have little or no control, including:\n•our customers’ budgetary constraints;\n•the timing of our customers’ budget cycles and approval processes;\n•our customers’ willingness to replace their current software solutions;\n•our need to educate potential customers about the uses and benefits of our products and services; and\n•the timing of the expiration of our customers’ current license agreements or outsourcing agreements for similar services.\nIf our sales cycles lengthen unexpectedly, they could adversely affect the timing of our revenues or increase costs, which may cause fluctuations in our quarterly revenues and results of operations. Finally, if we are unsuccessful in closing sales of our products after spending significant funds and management resources, our operating margins and results of operations could be adversely impacted, and the price of our common stock could decline.\nWe depend on growth in the data and information management software market, and lack of growth or contraction in this market could have a material adverse effect on our sales and financial condition.\nDemand for data and information management software is linked to growth in the amount of data generated and stored, demand for data retention and management (whether as a result of regulatory requirements or otherwise) and demand for and adoption of new storage devices and networking technologies. Because our software applications are concentrated within the data and information management software market, if the demand for storage devices, storage software applications, storage capacity or storage networking devices declines, our sales, profitability and financial condition would be materially adversely affected. Segments of the computer and software industry have in the past experienced significant economic downturns. The occurrence of any of these factors in the data and information management software market could materially adversely affect our sales, profitability and financial condition.\nFurthermore, the data and information management software market is dynamic and evolving. Our future financial performance will depend in large part on continued growth in the number of organizations adopting data and information management software for their computing environments. The market for data and information management software may not continue to grow at historic rates, or at all. If this market fails to grow or grows more slowly than we currently anticipate, our sales and profitability could be adversely affected.\nOur software applications are complex and may contain undetected errors, which could adversely affect not only our software applications’ performance but also our reputation and the acceptance of our software applications in the market.\nSoftware applications as complex as those we offer contain undetected errors or failures, especially when products are first introduced or new versions are released. Despite extensive testing by us and by our customers, we have in the past discovered errors in our software applications and will do so in the future. As a result of past discovered errors, we experienced delays and lost revenues while we corrected those software applications. In addition, customers in the past have brought to our attention “bugs” in our software created by the customers’ unique operating environments, which are often characterized by a wide variety of both standard and non-standard configurations that make pre-release testing very difficult and time consuming. Although we have been able to fix\nthese software bugs in the past, we may not always be able to do so. Our software products may also be subject to intentional attacks by viruses that seek to take advantage of these bugs, errors or other weaknesses. Any of these events may result in the loss of, or delay in, market acceptance of our software applications and services, which would seriously harm our sales, results of operations and financial condition.\nFurthermore, we believe that our reputation and name recognition are critical factors in our ability to compete and generate additional sales. Promotion and enhancement of our name will depend largely on our success in continuing to provide effective software applications and services. The occurrence of errors in our software applications or the detection of bugs by our customers may damage our reputation in the market and our relationships with our existing customers, and as a result, we may be unable to attract or retain customers.\nIn addition, because our software applications are used to manage data that is often critical to our customers, they may have a greater sensitivity to defects in our products than to defects in other, less critical, applications. As a result, the licensing and support of our software applications involve the risk of product liability claims. Our license agreements with our customers typically contain provisions designed to limit our exposure to potential product liability claims. However, the limitation of liability provisions contained in our license agreements vary and may not be effective as a result of existing or future national, federal, state, or local laws or ordinances or unfavorable judicial decisions. Although we have not experienced any material product liability claims to date, the sale and support of our products entail the risk of such claims, which could be substantial in light of the use of our products in enterprise-wide environments. In addition, our insurance against product liability may not be adequate to cover all potential claims.\nWe may not receive significant revenues from our current research and development efforts for several years, if at all.\nDeveloping software is expensive, and the investment in product development may involve a long payback cycle. Our research and development expenses were $133.4 million, or 18% of our total revenues in fiscal 2021, $110.0 million, or 16% of our total revenues in fiscal 2020 and $92.6 million, or 13% of our total revenues in fiscal 2019. Our future plans include significant investments in software research and development and related product opportunities. We believe that we must continue to dedicate a significant amount of resources to our research and development efforts to maintain our competitive position. However, we may not recognize significant revenues from these investments for several years, if at all.\nWe implemented a restructuring program in fiscal 2019, which we cannot guarantee will achieve its intended result.\nIn fiscal 2019 we initiated a restructuring plan to increase efficiency in our sales, marketing and distribution functions while reducing costs across all functional areas. We cannot guarantee the restructuring program will achieve its intended result. Risks associated with this restructuring program also include additional unexpected costs, adverse effects on employee morale and the failure to meet operational and growth targets due to the loss of key employees, any of which may impair our ability to achieve anticipated results of operations or otherwise harm our business.\nOur ability to sell our software applications is highly dependent on the quality of our service offerings, and our failure to offer high quality support and professional services would have a material adverse effect on our sales of software applications and results of operations.\nOur services include the assessment and design of solutions to meet our customers’ storage management requirements and the efficient installation and deployment of our software applications based on specified business objectives. Further, once our software applications are deployed, our customers depend on us to resolve issues relating to our software applications. A high level of service is critical for the successful marketing and sale of our software. If we or our partners do not effectively install or deploy our applications, or succeed in helping our customers quickly resolve post-deployment issues, it would adversely affect our ability to sell software products to existing customers and could harm our reputation with prospective customers. As a result, our failure to maintain high quality support and professional services would have a material adverse effect on our sales of software applications and results of operations.\nA portion of our revenue is generated by sales to government entities, which are subject to a number of challenges and risks.\nSales to U.S. and foreign federal, state, and local governmental agency end-customers have accounted for a portion of our revenue, and we may in the future increase sales to government entities. However, government entities have recently announced reductions in, or experienced increased pressure to reduce spending. In particular, such measures have adversely affected European public sector transactions, and U.S. debt issues and budget concerns may adversely impact future U.S. public sector transactions. Such budgetary constraints or shifts in spending priorities of government entities may adversely affect sales of our products and services to such entities. In addition, sales to government entities are subject to a number of risks. Selling to government entities can be highly competitive, expensive and time consuming, often requiring significant upfront time and expense without any assurance that we will successfully sell our products to such governmental entity. Government entities may require contract terms that differ from our standard arrangements. Government contracts may require the maintenance of certain security clearances for facilities and employees which can entail administrative time and effort possibly resulting in additional costs and delays. In addition, government demand for our products may be more volatile as they are affected by public sector budgetary cycles, funding authorizations, and the potential for funding reductions or delays, making the time to close such transactions more difficult to predict. This risk is enhanced as the size of such sales to the government entities increases. If the use of our products expands to more sensitive, secure or mission critical uses by our government customers, we may be subject to increased scrutiny, potential reputational risk, or potential liability should our products fail to perform as expected or should we not comply with the terms of our government contracts or government contracting requirements.\nMost of our sales to government entities have been made indirectly through providers that sell our products. Government entities may have contractual or other legal rights to terminate contracts with our providers for convenience or due to a default, and any such termination may adversely impact our future results of operations. Governments routinely audit and investigate government contractors, and we may be subject to such audits and investigations. If an audit or investigation uncovers improper or illegal activities, including any misuse of confidential or classified information by our employees, we may be subject to civil or criminal penalties and administrative sanctions.\nChange in senior management could cause disruption in the Company and have a material effect on our business. Furthermore, the loss of key personnel or the failure to attract and retain highly qualified personnel could have an adverse effect on our business.\nWe have had, and could have, changes in senior management which could be disruptive to management and operations of the Company and could have a material effect on our business, operating results and financial conditions. Turnover at the senior management level may create instability within the Company, which could impede the Company’s day to day operations. Such instability could impede our ability to fully implement our business plan and growth strategy, which would harm our business and prospects.\nOur future performance depends on the continued service of our key technical, sales, services and management personnel. We rely on our executive officers and senior management to execute our existing business operations and identify and pursue new growth opportunities. The loss of key employees could result in significant disruptions to our business, and the integration and training of replacement personnel could be time consuming, cause additional disruptions to our business and be unsuccessful. We do not carry key person life insurance covering any of our employees.\nOur future success also depends on our continued ability to attract and retain highly qualified technical, sales, services and management personnel. Competition for such personnel is intense, and we may fail to retain our key technical, sales, services and management employees or attract or retain other highly qualified technical, sales, services and management personnel in the future.\nFurthermore, in the past, we have experienced higher levels of turnover in our sales force compared to other employee groups in our company. Increases in the turnover rate of our sales force may affect our ability to generate license revenue growth. Although we have hired replacements in our sales force and are continuing to hire additional sales personnel to grow our business, we sometimes experience lower productivity from newly hired sales personnel for a period up to twelve months. In addition, we periodically make adjustments to our sales organization in response to a variety of internal and external factors, such as market opportunities, competitive threats, product introductions or enhancements and sales performance. Such adjustments could be temporarily disruptive and result in reduced productivity.\nThe volatility of our stock price may from time to time adversely affect our ability to attract or retain employees. If we are unable to hire or retain qualified employees across our organization, or conversely, if we fail to manage employee performance or reduce staffing levels when required by market conditions, our personnel costs would be excessive and our business and profitability could be adversely affected.\nRisks from investing in growth opportunities could impact our business.\nWe may invest in growth opportunities, such as high-value market segments of enterprise computing, managed services and cloud computing. Even though we believe cloud computing, in its various forms, represents a long term industry trend in the way that applications are delivered, data is stored and information is retrieved, there can be no assurance that our investment in cloud, and related managed services and infrastructure management will be validated in the marketplace. Similarly, there is no assurance that our investments in high-value market segments will drive revenue growth or market share gains. Customer adoption rates and viable economic models are less certain in high-value and rapidly-growing segments, and new product and services offerings may unfavorably impact demand for our other products or services.\nRisks Related to our International Operations\nVolatility in the global economy could adversely impact our continued growth, results of operations and our ability to forecast future business.\nAs our business has expanded globally, we have become increasingly subject to the risks arising from adverse changes in domestic and global economic and political conditions. Uncertainty in the macroeconomic environment and associated global economic conditions have resulted in volatility in credit, equity, debt and foreign currency markets as well as government budgets worldwide.\nThese global economic conditions can result in slower economic activity, decreased consumer confidence, reduced corporate profits and capital spending, adverse business conditions and liquidity concerns. There has also been increased volatility in foreign exchange markets. These factors make it difficult for our customers, our vendors and us to accurately forecast and plan future business activities. In addition, these factors could cause customers to slow or defer spending on our software products and services, which would delay and lengthen sales cycles and negatively affect our results of operations. If such conditions deteriorate or if the pace of economic recovery is slower or more uneven, our results of operations could be adversely affected, we may not be able to sustain the growth rates we have experienced recently, and we could fail to meet the expectations of stock analysts and investors, which could cause the price of our common stock to decline.\nWe continue to invest in our business in the Asia-Pacific and Europe, Middle East, and Africa regions. There are significant risks with overseas investments and growth prospects in these regions. Increased volatility or declines in the credit, equity, debt and foreign currency markets in these regions could cause delays in or cancellations of orders. Deterioration of economic conditions in the countries in which we do business could also cause slower or impaired collections on accounts receivable. In addition, we could experience delays in the payment obligations of our worldwide resellers if they experience weakness in the end-user market, which would increase our credit risk exposure and harm our financial condition.\nOur international sales and operations are subject to factors that could have an adverse effect on our results of operations.\nWe have significant sales and services operations outside the United States and derive a substantial portion of our revenues from these operations. We also plan to continue to expand our international operations. We generated approximately 48% of our revenues from outside the United States in fiscal 2021 and 49% were outside the United States in fiscal 2020. International revenue increased 5% in fiscal 2021 compared to fiscal 2020. Expansion of our international operations will require a significant amount of attention from our management and substantial financial resources and might require us to add qualified management in these markets.\nIn addition to facing risks similar to the risks faced by our domestic operations, our international operations are also subject to risks related to the differing legal, political, social and regulatory requirements and economic conditions of many countries, including:\n•adverse effects in economic conditions in the countries in which we operate related specifically to the COVID-19 outbreak and the governmental regulations put in place as a result of the virus;\n•difficulties in staffing and managing our international operations;\n•foreign countries may impose additional withholding taxes or otherwise tax our foreign income, impose tariffs or adopt other restrictions on foreign trade or investment, including currency exchange controls;\n•difficulties in coordinating the activities of our geographically dispersed and culturally diverse operations;\n•general economic conditions in the countries in which we operate, including seasonal reductions in business activity in the summer months in Europe and in other periods in other countries, could have an adverse effect on our earnings from operations in those countries;\n•imposition of, or unexpected adverse changes in, foreign laws or regulatory requirements may occur, including those pertaining to export restrictions, privacy and data protection, trade and employment restrictions and intellectual property protections;\n•longer payment cycles for sales in foreign countries and difficulties in collecting accounts receivable;\n•competition from local suppliers;\n•greater risk of a failure of our employees and partners to comply with both U.S. and foreign laws, including antitrust regulations, the U.S. Foreign Corrupt Practices Act, the U.K. Bribery Act of 2010, and any trade regulations ensuring fair trade practices;\n•costs and delays associated with developing software in multiple languages; and\n•political unrest, war or acts of terrorism.\nOur business in emerging markets requires us to respond to rapid changes in market conditions in those markets. Our overall success in international markets depends, in part, upon our ability to succeed in differing legal, regulatory, economic, social and political conditions. We may not continue to succeed in developing and implementing policies and strategies that will be effective in each location where we do business. Furthermore, the occurrence of any of the foregoing factors may have a material adverse effect on our business and results of operations.\nWe may experience fluctuations in foreign currency exchange rates that could adversely impact our results of operations.\nOur international sales are generally denominated in foreign currencies, and this revenue could be materially affected by currency fluctuations. Our primary exposure is to fluctuations in exchange rates for the U.S. dollar versus the Euro and, to a lesser extent, the Australian dollar, British pound sterling, Canadian dollar, Chinese yuan, Indian rupee, Korean won and Singapore dollar. Changes in currency exchange rates could adversely affect our reported revenues and could require us to reduce our prices to remain competitive in foreign markets, which could also have a material adverse effect on our results of operations. An unfavorable change in the exchange rate of foreign currencies against the U.S. dollar would result in lower revenues when translated into U.S. dollars, although operating expenditures would be lower as well.\nIn recent fiscal years, we have selectively hedged our exposure to changes in foreign currency exchange rates on the balance sheet. In the future, we may enter into additional foreign currency-based hedging contracts to reduce our exposure to significant fluctuations in currency exchange rates on the balance sheet, although there can be no assurances that we will do so. However, as our international operations grow, or if dramatic fluctuations in foreign currency exchange rates continue or increase or if our hedging strategies become ineffective, the effect of changes in the foreign currency exchange rates could become material to revenue, operating expenses, and income.\nRisks Related to Information Technology and Security\nWe may be subject to information technology system failures, network disruptions and breaches in data security.\nInformation technology system failures, network disruptions and breaches of data security could disrupt our operations by causing delays or cancellation of customer orders, impeding the shipment of software products, negatively affecting our service offerings, preventing the processing of transactions and reporting of financial results. Information technology system failures, network disruptions and breaches of data security could also result in the unintentional disclosure of customer or our information as well as damage our reputation. There can be no assurance that a system failure, network disruption or data security breach will not have a material adverse effect on our financial condition and operating results.\nThird parties regularly attempt to gain unauthorized access to our information technology systems, and many such attempts are increasingly more sophisticated. The perception that the COVID-19 pandemic has made companies’ information technology systems more vulnerable has increased the already significant volume of such attempts. These attempts, which might be related to industrial, corporate or other espionage, criminal hackers or state-sponsored intrusions, include trying to covertly introduce malware to our computers and networks and impersonating authorized users, among others. We may also be subject to ransom-style cyber-attacks, which could impact our information technology systems and cause widespread disruption to our business, and expose our confidential or propriety information. In addition, third parties that we may rely on to store and/or process our confidential information may also be subject to similar threats. Such threats could result in the misappropriation, theft, misuse, disclosure, loss or destruction of the technology, intellectual property, or the proprietary, confidential or personal information, of us or our employees, customers, licensees, suppliers or other third parties, as well as damage to or disruptions in our information technology systems. These threats are constantly evolving, increasing the difficulty of successfully defending against them or implementing adequate preventative measures. We seek to detect and investigate all security incidents and to prevent their recurrence, but attempts to gain unauthorized access to our information technology systems or other attacks may be successful, and in some cases, we might be unaware of an incident or its magnitude and effects.\nMany of our key financial systems used for internal purposes are cloud-based solutions provided by third parties.\nOur enterprise resource planning system as well as certain other stand-alone internal financial systems are cloud-based solutions provided by third parties. The use of cloud-based systems provided by third parties exposes us to certain risks of those third parties. If a disruption of services by these third party cloud financial system providers were to occur it could have a material adverse effect on our financial position, results of operations and cash flows.\nRisks Related to Legal Matters and Intellectual Property\nWe are, and may in the future become, involved in litigation that may have a material adverse effect on our business.\nFrom time to time, we may become involved in various other legal proceedings relating to matters incidental to the ordinary course of our business, including patent, commercial, product liability, employment, class action, whistleblower and other litigation and claims, and governmental and other regulatory investigations and proceedings. Such matters can be time-consuming, divert management’s attention and resources and cause us to incur significant expenses. Furthermore, because litigation is inherently uncertain, there can be no assurance that the results of any of these actions will not have a material adverse effect on our business, results of operations or financial condition.\nProtection of our intellectual property is limited, and any misuse of our intellectual property by others could materially adversely affect our sales and results of operations.\nOur success depends significantly upon proprietary technology in our software, documentation and other written materials. To protect our proprietary rights, we rely on a combination of:\n•patents;\n•copyright and trademark laws;\n•trade secrets;\n•confidentiality procedures; and\n•contractual provisions.\nThese methods afford only limited protection. Despite this limited protection, any issued patent may not provide us with any competitive advantages or may be challenged by third parties, and the patents of others may seriously impede our ability to conduct our business. Further, our pending patent applications may not result in the issuance of patents, and any patents issued to us may not be timely or broad enough to protect our proprietary rights. We may also develop proprietary products or technologies that cannot be protected under patent law. We also seek to maintain certain intellectual property as trade secrets. The secrecy could be compromised by outside parties, or by our employees, which would cause us to lose the competitive advantage resulting from these trade secrets.\nDespite our efforts to protect our proprietary rights, unauthorized parties may attempt to copy aspects of our software applications or to obtain and use information that we regard as proprietary. Policing unauthorized use of our software applications is difficult, and we expect software piracy to continue to be a persistent problem. In licensing our software applications, we typically rely on “shrink wrap” or “click wrap” licenses that are not signed by licensees. We may have difficulty enforcing these licenses in some jurisdictions. In addition, the laws of some foreign countries do not protect our proprietary rights to as great an extent as do the laws of the United States. Our attempts to protect our proprietary rights may not be adequate. Our competitors may independently develop similar technology, duplicate our software applications or design around patents issued to us or other intellectual property rights of ours. Litigation may be necessary in the future to enforce our intellectual property rights, protect our trade secrets or determine the validity and scope of the proprietary rights of others. Litigation could result in substantial costs and diversion of resources and management attention. In addition, from time to time we are participants or members of various industry standard-setting organizations or other industry technical organizations. Our participation or membership in such organizations may, in some circumstances, require us to enter into royalty or licensing agreements with third parties regarding our intellectual property under terms established by those organizations, which we may not find favorable. In addition, many of our agreements with our customers and partners require us to indemnify them for certain intellectual property infringement claims against them, which would increase our costs as a result of defending such claims, and may require that we pay significant damages if there were an adverse ruling in any such claims. Furthermore, such customers and partners may discontinue the use of our products, services, and technologies, as a result of injunctions or otherwise, which could result in loss of revenues and adversely impact our business.\nOn April 21, 2020, the Company filed suit against Cohesity, Inc. (\"Cohesity\") in the District of Delaware alleging that Cohesity has infringed and continues to infringe at least one claim of each of U.S. Patent Nos. 7,725,671, 7,840,533, 8,762,335, 9,740,723, 10,210,048, and 10,248,657. Due to the inherent uncertainties of litigation, the Company cannot accurately predict the ultimate timing or outcome of this matter. The Company is unable at this time to determine whether the outcome of the litigation will have a material impact on its results of operations, financial condition, or cash flows.\nOn April 21, 2020, the Company filed suit against Rubrik, Inc. (\"Rubrik\") in the District of Delaware alleging that Rubrik has infringed and continues to infringe at least one claim of each of U.S. Patent Nos. 7,725,671, 7,840,533, 8,447,728, 9,740,723, 10,210,048, and 10,248,657. Due to the inherent uncertainties of litigation, the Company cannot accurately predict the ultimate timing or outcome of this matter. The Company is unable at this time to determine whether the outcome of the litigation will have a material impact on its results of operations, financial condition, or cash flows.\nClaims that we misuse the intellectual property of others could subject us to significant liability and disrupt our business, which could have a material adverse effect on our results of operations and financial condition.\nDue to the nature of our business, we may become subject to material claims of infringement by competitors and other third parties with respect to current or future software applications, trademarks or other proprietary rights. We expect that software developers will increasingly be subject to infringement claims as the number of software applications and competitors in our industry segment grows and the functionality of software applications in different industry segments overlaps. Future litigation may also involve third parties such as individuals, non-practicing entities, patent holding companies, and/or patent assertion entities that have no relevant product offerings or revenue in the marketplace, and against whom our own patents may provide little or no deterrence or protection. Such parties may purchase or otherwise obtain intellectual property assets for the purpose of monetizing these assets; they often make broad and sweeping claims of infringement against product manufacturing companies such as Commvault and its customers, seeking a percentage of sales as license fees, seeking injunctions to pressure us into taking a license, or a combination thereof. Claims such as these have increased in recent years and may continue to do so. Any such claims, whether meritorious or not, could be time-consuming, result in costly litigation, cause shipment delays or require us to enter into royalty or licensing agreements with third parties, which may not be available on terms that we deem acceptable, if at all. In addition, we may decide to settle a claim or action against us, which settlement could be costly. We may also be liable for any past infringement. If there is an adverse ruling against us in an infringement lawsuit, an injunction could be issued barring production or sale of any infringing product. It could also result in a damage award equal to a reasonable royalty or lost profits or, if there is a finding of willful infringement, treble damages. Any of these claims could disrupt our business and have a material adverse effect on our results of operations and financial condition.\nIn addition, we license and use software from third parties in our business. These third-party software licenses may not continue to be available to us on acceptable terms or at all, and may expose us to additional liability. This liability, or our inability to use any of this third-party software, could result in shipment delays or other disruptions in our business that could materially and adversely affect our operating results.\nOur use of “open source” software could negatively affect our business and subjects us to possible litigation.\nSome of the products or technologies acquired, licensed or developed by us may incorporate so-called “open source” software, and we may incorporate open source software into other products in the future. Such open source software is generally licensed by its authors or other third parties under open source licenses, including, for example, the GNU General Public License, the GNU Lesser General Public License, the Common Public License, “Apache-style” licenses, “Berkley Software Distribution or BSD-style” licenses and other open source licenses. We monitor our use of open source software to avoid subjecting our products to conditions we do not intend, but these efforts may not be successful. Although we believe that we have complied with our obligations under the various applicable licenses for open source software that we use, there is little or no legal precedent governing the interpretation of many of the terms of certain of these licenses, and therefore the potential impact of these terms on our business is somewhat unknown and may result in unanticipated obligations regarding our products and technologies. The use of such open source software may ultimately subject some of our products to unintended conditions, which may negatively affect our business, financial condition, operating results, cash flow and ability to commercialize our products or technologies.\nSome of these open source licenses may subject us to certain conditions, including requirements that we offer our products that use the open source software for no cost, that we make available source code for modifications or derivative works we create based upon, incorporating or using the open source software and/or that we license such modifications or derivative works under the terms of the particular open source license. If an author or other third-party that distributes such open source software were to allege that we had not complied with the conditions of one or more of these licenses, we could be required to incur significant legal expenses defending against such allegations. If our defenses were not successful, we could be enjoined from the distribution of our products that contained the open source software and required to make the source code for the open source software available to others, to grant third parties certain rights of further use of our software or to remove the open source software from our products, which could disrupt the distribution and sale of some of our products. In addition, if we combine our proprietary software with open source software in a certain manner, under some open source licenses we could be required to release the source code of our proprietary software. If an author or other third-party that distributes open source software were to obtain a judgment against us based on allegations that we had not\ncomplied with the terms of any such open source licenses, we could also be subject to liability for copyright infringement damages and breach of contract for our past distribution of such open source software.\nRisks Related to Tax and Accounting\nOur effective tax rate is difficult to project, and changes in such tax rate or adverse results of tax examinations could adversely affect our operating results.\nWe are a U.S.-based multinational company subject to tax in multiple U.S. and foreign tax jurisdictions. Our results of operations would be adversely affected to the extent that our geographical mix of income becomes more weighted toward jurisdictions with higher tax rates and would be favorably affected to the extent the relative geographic mix shifts to lower tax jurisdictions. Any change in our mix of earnings is dependent upon many factors and is therefore difficult to predict.\nThe process of determining our anticipated tax liabilities involves many calculations and estimates that are inherently complex and make the ultimate tax obligation determination uncertain. As part of the process of preparing our consolidated financial statements, we are required to estimate our income taxes in each of the jurisdictions in which we operate prior to the completion and filing of tax returns for such periods. These estimates involve complex issues, require extended periods of time to resolve, and require us to make judgments, such as anticipating the outcomes of audits with tax authorities and the positions that we will take on tax returns prior to our actually preparing the returns.\nFurthermore, our overall effective income tax rate and tax expenses may be affected by various factors in our business, including changes in our legal structure, changes in the geographic mix of income and expenses, changes in tax laws and applicable accounting pronouncements and variations in the estimated and actual level of annual profits before income tax.\nWe also determine the need to record deferred tax liabilities and the recoverability of deferred tax assets. A valuation allowance is established to the extent recovery of deferred tax assets is not likely based on our estimation of future taxable income and other factors in each jurisdiction. In assessing the need for a valuation allowance in fiscal 2018, we considered all available objective and verifiable evidence both positive and negative, including historical levels of pre-tax income (loss) both on a consolidated basis and tax reporting entity basis, legislative developments, expectations and risks associated with estimates of future pre-tax income, and prudent and feasible tax planning strategies. As a result of this analysis, we determined that it is more likely than not that we will not realize the benefits of our gross deferred tax assets and therefore have recorded a valuation allowance to reduce the carrying value of these gross deferred tax assets, net of the impact of the reversal of taxable temporary differences, to zero.\nOur reported financial results may be adversely affected by changes in accounting principles generally accepted in the United States.\nGenerally accepted accounting principles in the United States are subject to interpretation by the Financial Accounting Standards Board, the SEC, and various bodies formed to promulgate and interpret appropriate accounting principles. A change in these principles or interpretations could have a significant effect on our reported financial results, and may even affect the reporting of transactions completed before the announcement or effectiveness of a change.\nRisks Related to our Common Stock\nCertain provisions of our certificate of formation and our amended and restated bylaws or Delaware law could prevent or delay a potential acquisition of control of our Company, which could decrease the trading price of our common stock.\nOur certificate of formation, amended and restated bylaws and the laws in the State of Delaware contain provisions that are intended to deter coercive takeover practices and inadequate takeover bids by making such practices or bids unacceptably expensive to the prospective acquirer and to encourage prospective acquirers to negotiate with our Board of Directors rather than to attempt a hostile takeover. Delaware law also imposes restrictions on mergers and other business combinations between us and any holder of 15% or more of our outstanding common stock.\nWe believe that these provisions protect our shareholders from coercive or otherwise unfair takeover tactics by effectively requiring those who seek to obtain control of the Company to negotiate with our Board of Directors and by providing our Board of Directors with more time to assess any acquisition of control. However, these provisions could apply even if an acquisition of control of the Company may be considered beneficial by some shareholders and could delay or prevent an acquisition of control that our Board of Directors determines is not in the best interests of our Company and our shareholders.\nAlthough we believe we currently have adequate internal control over financial reporting, we are required to assess our internal control over financial reporting on an annual basis, and any future adverse results from such assessment could result in a loss of investor confidence in our financial reports and have an adverse effect on our stock price.\nPursuant to Section 404 of the Sarbanes-Oxley Act of 2002 (\"SOX 404\"), and the rules and regulations promulgated by the SEC to implement SOX 404, we are required to furnish a report in our Form 10-K regarding the effectiveness of our internal control over financial reporting. The report’s assessment of our internal control over financial reporting as of the end of our fiscal year must include disclosure of any material weaknesses in our internal control over financial reporting identified by management. Management’s assessment of internal control over financial reporting requires management to make subjective judgments and some of our judgments will be in areas that may be open to interpretation.\nAlthough we currently believe our internal control over financial reporting is effective, the effectiveness of our internal controls in future periods is subject to the risk that our controls may become inadequate or may not operate effectively. In future years, if we fail to timely complete this assessment, or if our independent auditors are unable to express an opinion on the effectiveness of our internal controls, there may be a loss of public confidence in our internal controls, the market price of our stock could decline and we could be subject to regulatory sanctions or investigations by the NASDAQ Stock Market, the Securities and Exchange Commission or other regulatory authorities, which would require additional financial and management resources. In addition, any failure to implement required new or improved controls, or difficulties encountered in their implementation, could harm our operating results or cause us to fail to timely meet our regulatory reporting obligations.\nDuring the past several years, our organizational structure has increased in complexity due to compliance with tax regulations and tax accounting requirements and other regulatory and compliance requirements, including compliance with anti-corruption and anti-bribery laws such as the U.S. Foreign Corrupt Practices Act (the “FCPA”) and the UK Bribery Act of 2010 (the “UK Bribery Act”). Further, we have expanded our presence in the Asia-Pacific region, where business practices can differ from those in other regions of the world and can create internal control risks. We provide business practices training to our employees worldwide. Overall, the combination of increased structural complexity and the ever-increasing regulatory complexity make it more critical for us to attract and retain qualified and technically competent employees.\nWe may experience a decline in revenues or volatility in our quarterly operating results, which may adversely affect the market price of our common stock.\nWe cannot predict our future quarterly revenues or operating results with certainty because of many factors outside of our control. A significant revenue or profit decline, lowered forecasts or volatility in our operating results could cause the market price of our common stock to decline substantially. Factors that could affect our revenues and operating results include the following:\n•the unpredictability of the timing and magnitude of orders for our software applications, particularly software transactions greater than $100,000 - in recent fiscal years, a majority of our quarterly revenues were earned and recorded near the end of each quarter;\n•the possibility that our customers may cancel, defer or limit purchases as a result of reduced information technology budgets;\n•the possibility that our customers may defer purchases of our software applications in anticipation of new software applications or updates from us or our competitors;\n•the ability of our OEMs and resellers to meet their sales objectives;\n•market acceptance of our new applications and enhancements;\n•our ability to control expenses;\n•changes in our pricing, packaging and distribution terms or those of our competitors; and\n•the demands on our management, sales force and services infrastructure as a result of the introduction of new software applications or updates.\nOur expense levels are relatively fixed and are based, in part, on our expectations of future revenues. If revenue levels fall below our expectations and we are profitable at the time, our net income would decrease because only a small portion of our expenses varies with our revenues. Therefore, any significant decline in revenues for any period could have an immediate adverse impact on our results of operations for that period. We believe that period-to-period comparisons of our results of operations should not be relied upon as an indication of future performance. In addition, our results of operations could be below expectations of public market analysts and investors in future periods, which would likely cause the market price of our common stock to decline.\nThe price of our common stock may be highly volatile and may decline regardless of our operating performance.\nThe market price of our common stock could be subject to significant fluctuations in response to:\n•variations in our quarterly or annual operating results;\n•changes in financial estimates, treatment of our tax assets or liabilities or investment recommendations by securities analysts following our business or our competitors;\n•the public’s response to our press releases, rumors, our other public announcements and our filings with the SEC;\n•changes in accounting standards, policies, guidance or interpretations or principles;\n•sales of common stock by our directors, officers and significant stockholders;\n•announcements of technological innovations or enhanced or new products by us or our competitors;\n•our failure to achieve operating results consistent with securities analysts’ projections;\n•the operating and stock price performance of other companies that investors may deem comparable to us;\n•broad market and industry factors; and\n•other events or factors, including those resulting from war, incidents of terrorism or responses to such events.\nThe market prices of software companies have been extremely volatile. Stock prices of many software companies have often fluctuated in a manner unrelated or disproportionate to the operating performance of such companies. In the past, following periods of market volatility, stockholders have often instituted securities class action litigation. Securities litigation could have a substantial cost and divert resources and the attention of management from our business.\nGeneral Risks\nOur business could be materially and adversely affected as a result of natural disasters, terrorism or other catastrophic events.\nAny economic failure or other material disruption caused by natural disasters, including fires, floods, hurricanes, earthquakes, and tornadoes; power loss or shortages; environmental disasters; telecommunications or business information systems failures or break-ins and similar events could also adversely affect our ability to conduct business. If such disruptions result in cancellations of customer orders or contribute to a general decrease in economic activity or corporate spending on IT, or impair our ability to meet our customer demands, our operating results and financial condition could be materially adversely affected.\nIn addition, our business has been and will likely be adversely affected by the impact of a widespread outbreak of contagious diseases, including the recent outbreak of COVID-19. This, or any other outbreak of contagious diseases, and other adverse public health developments, may cause us or our customers to temporarily suspend operations. Further, a significant outbreak of contagious diseases in the human population could result in a widespread health crisis that could adversely affect the economies and financial markets of many countries, resulting in an economic downturn that could affect demand for our products, our ability to collect against existing trade receivables and our operating results.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNone.",
    "item_2": "Item 2. Properties\nOur principal administrative, sales, marketing, customer support and research and development facility is located at our owned corporate headquarters in Tinton Falls, New Jersey.\nIn addition, we have offices in the United States in California and Texas; and outside the United States in Australia, Austria, Belgium, Brazil, Canada, China, Denmark, France, Germany, Hong Kong, India, Ireland, Israel, Italy, Japan, Netherlands, Poland, Russia, Saudi Arabia, Singapore, South Africa, South Korea, Spain, Sweden, Switzerland, Taiwan, United Arab Emirates, and United Kingdom.",
    "item_3": "Item 3. Legal Proceedings\nSee Note 8 Commitments and Contingencies - Legal Proceedings of the consolidated financial statements for a discussion of a lawsuit filed by Rubrik, Inc.\nFrom time to time, we are subject to claims in legal proceedings arising in the normal course of our business. We do not believe that we are currently party to any other pending legal action that could reasonably be expected to have a material adverse effect on our business or operating results.",
    "item_4": "Item 4. Mine Safety Disclosures\nNot Applicable.\nPART II",
    "item_5": "Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket for our Common Stock\nOur common stock is listed and traded on The NASDAQ Global Market under the symbol “CVLT”.\nStockholders\nAs of May 10, 2021, there were approximately 48 holders of our common stock. The number of record holders does not represent the actual number of beneficial owners of shares of our common stock because shares are frequently held in street name by securities dealers and others for the benefit of individual owners who have the right to vote their shares.\nDividend Policy\nWe have never paid cash dividends on our common stock, and we intend to retain our future earnings, if any, to fund the growth of our business. We therefore do not anticipate paying any cash dividends on our common stock in the foreseeable future. Our future decisions concerning the payment of dividends on our common stock will depend upon our results of operations, financial condition and capital expenditure plans, as well as any other factors that the Board of Directors, in its sole discretion, may consider relevant.\nStock Performance Graph\nThe graph set forth below compares the cumulative total stockholder return on our common stock between March 31, 2016 and March 31, 2021, with the cumulative total return of (i) The NASDAQ Computer Index and (ii) The NASDAQ Composite Index, over the same period. This graph assumes the investment of $100,000 on March 31, 2016 in our common stock, The NASDAQ Composite Index and The NASDAQ Computer Index, and assumes the reinvestment of dividends, if any. The graph assumes the initial value of our common stock on March 31, 2016 was the closing sales price of $43.17 per share.\nThe comparisons shown in the graph below are based upon historical data. The stock price performance shown in the graph below is not necessarily indicative of, nor is it intended to forecast, the future performance of our common stock. Information used in the graph was obtained from NASDAQ, a source we believe to be reliable, but we are not responsible for any errors or omissions in such information.\nThe performance graph shall not be deemed “filed” for purposes of Section 18 of the Exchange Act or otherwise subject to the liabilities under that Section, and shall not be deemed to be incorporated by reference into any filing of Commvault under the Securities Act or the Exchange Act.\n3/31/2016 3/31/2017 3/31/2018 3/31/2019 3/31/2020 3/31/2021\nCommvault 100.0 117.7 132.5 150.0 93.8 149.4\nNASDAQ Composite Index 100.0 121.4 145.0 158.7 158.1 272.0\nNASDAQ Computer Index 100.0 125.7 158.4 176.6 198.1 347.3\nIssuer Purchases of Equity Securities\nDuring the three months ended March 31, 2021, we repurchased $62.1 million of common stock (0.9 million shares), under our repurchase program. During the year ended March 31, 2021, we repurchased $95.3 million of common stock (1.6 million shares), under our repurchase program.\nPeriod Total number of shares purchased as part of publicly announced programs Average price paid per share Total of Purchases Approximate dollar value of shares that may yet be purchased under the program\nJanuary 2021 - $ - $ - $ 166,868,443\nFebruary 2021 425,000 66.94 28,450,887 138,417,556\nMarch 2021 517,600 65.06 33,676,893 104,740,663\nThree months ended March 31, 2021 942,600 $ 65.91 $ 62,127,780",
    "item_6": "Item 6. Selected Financial Data\nConsistent with the final rules promulgated by the SEC on November 19, 2020 (Release 33-10890 titled “Management’s Discussion and Analysis, Selected Financial Data, and Supplementary Financial Data”), we have elected early adoption of the elimination of Item 301 of Regulation S-K.",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nYou should read the following discussion and analysis along with our consolidated financial statements and the related notes included elsewhere in this Annual Report on Form 10-K. The statements in this discussion regarding our expectations of our future performance, liquidity and capital resources, and other non-historical statements are forward-looking statements. These forward-looking statements are subject to numerous risks and uncertainties, including, but not limited to, the risks and uncertainties described under “Risk Factors” and elsewhere in this Annual Report on Form 10-K. Our actual results may differ materially from those contained in or implied by any forward-looking statements.\nOverview\nCommvault Systems, Inc. is a global data protection and information management software company offering customers enterprise level, intelligent data management solutions built from the ground up on a single platform and unified code base. Commvault was incorporated in Delaware in 1996.\nAt Commvault, we believe in solving hard problems for our customers. To do this, we provide capabilities which enable our customers to accelerate their digital transformation in today's ever evolving workforce using tools that are light touch and utilize artificial intelligence and machine learning to drive automation. Our product portfolio empowers our customers to reduce complexity, reign in data fragmentation, and accelerate their cloud journey. All software functionality shares the same back-end technologies to deliver the benefits of a holistic approach to protecting, managing, and accessing data. Our software addresses many aspects of storage and data management in the enterprise, while providing scalability and control of data and information. We believe our technology provides the broadest set of capabilities in the industry, which allows customers to reduce storage costs and administrative overhead. We also provide our customers with a broad range of professional services.\nIndustry\nThe industry in which we currently operate continues to go through accelerating changes as the result of compounding data growth and the introduction of new technologies. We are continuing to pursue an aggressive product development program in both data and information management solutions. Our data management solutions include not only traditional backup, but also new innovations in de-duplication, data movement, virtualization, snap-based backups and enterprise reporting. Our information management innovations are primarily in the areas of archiving, eDiscovery, records management, governance, operational reporting and compliance. We remain focused on both the data and information management trends in the marketplace and, in fact, a material portion of our existing research and development expenses are utilized toward the development of such new technologies discussed above. While we feel confident in our ability to meet these changing industry demands with our Commvault suite and potential future releases, the development, release and timing of any features or functionality remain at our sole discretion and our solutions or other technologies may not be widely adopted.\nGiven the nature of the industry in which we operate, our software applications are subject to obsolescence. We continually develop and introduce updates to our existing software applications in order to keep pace with evolving industry technologies. In addition, we must address evolving industry standards, changing customer requirements and competitive software applications that may render our existing software applications obsolete.\nFor each of our software applications, we provide full support for the current generally available release and one prior release. When we declare a product release obsolete, a customer notice is delivered twelve months prior to the effective date of obsolescence announcing continuation of full product support for the first six months. We provide an additional six months of extended assistance support in which we only provide existing workarounds or fixes that do not require additional development activity. We do not have existing plans to make any of our software products permanently obsolete.\nSources of Revenues\nWe derive a significant portion of our total revenues from sales of licenses of our software applications and related appliance products. We do not customize our software or products for a specific end-user customer. We sell our software applications and products to end-user customers both directly through our sales force and indirectly through our global network of value-added reseller partners, systems integrators, corporate resellers and original equipment manufacturers. Our software and products revenue was 45% of our total revenues for fiscal 2021, 41% in fiscal 2020 and 44% in fiscal 2019.\nDuring fiscal 2021, we continued to focus on subscription and other recurring revenue arrangements and began generating revenue from the renewals of subscription licenses sold in prior years. Any of our licensing models (capacity, instance based, etc.) can be sold via a subscription arrangement. In these arrangements the customer has the right to use the software over a designated period of time. The capacity of the license is fixed and the customer has made an unconditional commitment to pay. Software revenue in these arrangements is generally recognized when the software is delivered. During the fiscal year ended March 31, 2021, approximately 59% of software license revenue was sold under a subscription model. Software license revenue sold under a subscription model was 41% and 40% in the fiscal years ended March 31, 2020 and 2019, respectively. We expect revenue from these types of arrangements as a percentage of our total revenue to continue to increase in the next few years. We also sell to some customers, primarily managed service providers, via utility, or pay-as-you-go models. In these arrangements actual usage is regularly measured and billed. Revenue in these utility arrangements is recognized as the software is used.\nIn recent fiscal years, we generated an average of 80% of our software and products revenue from our existing customer base and approximately 20% of our software and products revenue from new customers. In addition, our total software and products revenue in any particular period is, to a certain extent, dependent upon our ability to generate revenues from large customer software and products deals, which we refer to as larger deal transactions. Larger deal transactions (transactions greater than $0.1 million of software and product revenue) represented approximately 69% of our software and products revenue in fiscal 2021 and 65% in both fiscal 2020 and fiscal 2019.\nSoftware and products revenue generated through indirect distribution channels accounted for over 90% of total software and products revenue in recent fiscal years. Software and products revenue generated through direct distribution channels accounted for less than 10% of total software and products revenue in recent fiscal years. Deals initiated by our direct sales force are sometimes transacted through indirect channels based on end-user customer requirements, which are not always in our control and can cause this overall percentage split to vary from fiscal year to fiscal year. As such, there may be fluctuations in the dollars and percentage of software and products revenue generated through our direct distribution channels from time to time. We believe that the growth of our software and products revenue, derived from both our indirect channel partners and direct sales force, are key attributes to our long-term growth strategy. We intend to continue to invest in both our channel relationships and direct sales force in the future, but we continue to expect more revenue to be generated through indirect distribution channels over the long term. The failure of our indirect distribution channels or our direct sales force to effectively sell our software applications could have a material adverse effect on our revenues and results of operations.\nWe have a non-exclusive distribution agreement covering our North American commercial markets and our U.S. Federal Government market with Arrow Enterprise Computing Solutions, Inc. (\"Arrow\"), a subsidiary of Arrow Electronics, Inc. Pursuant to this distribution agreement, Arrow's primary role is to enable a more efficient and effective distribution channel for our products and services by managing our reseller partners and leveraging their own industry experience. We generated approximately 36% of our total revenues through Arrow in fiscal 2021, approximately 37% of our total revenues in fiscal 2020 and approximately 38% of our total revenues in fiscal 2019. If Arrow was to discontinue or reduce the sales of our products or if our agreement with Arrow was terminated, and if we were unable to take back the management of our reseller channel or find another North American distributor to replace Arrow, then it could have a material adverse effect on our future business.\nOur services revenue was 55% of our total revenues for fiscal 2021, 59% in fiscal 2020 and 56% in fiscal 2019. Our services revenue is made up of fees from the delivery of customer support and other professional services, which are typically sold in connection with the sale of our software applications. Customer support agreements provide technical support and unspecified software updates on a when-and-if-available basis for an annual fee based on licenses purchased and the level of service subscribed. Other professional services include consulting, assessment and design services, implementation and post-deployment services and training, all of which to date have predominantly been sold in connection with the sale of software applications. Our newly\nlaunched software-as-a-service solution, branded Metallic, is also included in services revenue. Revenue from Metallic is recognized ratably over the contract period.\nMost of our customer support agreements related to perpetual licenses are for a one-year term. As the end of the annual period approaches, we pursue the renewal of the agreement with the customer. Historically, maintenance renewals have represented a significant portion of our total revenue. Because of this characteristic of our business, if our customers choose not to renew their maintenance and support agreements with us on beneficial terms, or at all, our business, operating results and financial condition could be harmed.\nThe gross margin of our services revenue was 79% for fiscal 2021, 78% for fiscal 2020 and 77% for fiscal 2019. Overall, our services revenue has lower gross margins than our software and products revenue. The gross margin of our software and products revenue was 92% for fiscal 2021, 90% for fiscal 2020 and 92% for fiscal 2019. The increase in gross margin percentage of software and products is a result of reduced sales of hardware associated with our appliance as well as reduced software royalties associated with sales of HyperScale appliances and software. Beginning with the launch of HyperScale X in the second half of fiscal 2021, we will transition to a software only model. HyperScale X also has reduced software royalties relative to prior versions of HyperScale.\nDescription of Costs and Expenses\nOur cost of revenues is as follows:\n•Cost of Software and Products Revenue, consists primarily of the cost of appliance hardware, third-party royalties and other costs such as media, manuals, translation and distribution costs; and\n•Cost of Services Revenue, consists primarily of salary and employee benefit costs in providing customer support and other professional services as well as third party hosting fees.\nOur operating expenses are as follows:\n•Sales and Marketing, consists primarily of salaries, commissions, employee benefits, stock-based compensation and other direct and indirect business expenses, including travel and related expenses, sales promotion expenses, public relations expenses and costs for marketing materials and other marketing events (such as trade shows and advertising);\n•Research and Development, which is primarily the expense of developing new software applications and modifying existing software applications, consists principally of salaries, stock-based compensation and benefits for research and development personnel and related expenses; contract labor expense and consulting fees as well as other expenses associated with the design, certification and testing of our software applications; and legal costs associated with the patent registration of such software applications;\n•General and Administrative, consists primarily of salaries, stock-based compensation and benefits for our executive, accounting, human resources, legal, information systems and other administrative personnel. Also included in this category are other general corporate expenses, such as outside legal and accounting services, compliance costs and insurance; and\n•Depreciation and Amortization, consists of depreciation expense primarily for our owned corporate campus headquarters location and computer equipment we use for information services and in our development and test labs as well as amortization of intangible assets acquired through the purchase of Hedvig beginning in the third quarter of fiscal year 2020 through the second quarter of fiscal year 2021 when the intangible assets were impaired to zero.\nForeign Currency Exchange Rates’ Impact on Results of Operations\nSales outside the United States were approximately 48% of our total revenue for fiscal 2021, 49% of our total revenue for fiscal 2020 and 47% for fiscal 2019. The income statements of our non-U.S. operations are translated into U.S. dollars at the average exchange rates for each applicable month in a period. To the extent the U.S. dollar weakens against foreign currencies, the translation of these foreign currency denominated transactions generally results in increased revenue, operating expenses and income from operations for our non-U.S. operations. Similarly, our revenue, operating expenses and net income will generally decrease for our non-U.S. operations if the U.S. dollar strengthens against foreign currencies.\nUsing the average foreign currency exchange rates from fiscal 2020, our software and products revenue would have been lower by $6.8 million, our services revenue would have been lower by $6.6 million, our cost of sales would have been lower by $1.8 million and our operating expenses would have been lower by $4.5 million from non-U.S. operations for fiscal 2021.\nIn addition, we are exposed to risks of foreign currency fluctuation primarily from cash balances, accounts receivables and intercompany accounts denominated in foreign currencies and are subject to the resulting transaction gains and losses, which are recorded as a component of general and administrative expenses. We recognized net foreign currency transaction losses of $1.9 million in fiscal 2021, gains of $0.4 million in fiscal 2020, and gains of $1.0 million in fiscal 2019.\nCritical Accounting Policies\nIn presenting our consolidated financial statements in conformity with U.S. generally accepted accounting principles, we are required to make estimates and judgments that affect the amounts reported therein. Some of the estimates and assumptions we are required to make relate to matters that are inherently uncertain as they pertain to future events. We base these estimates on historical experience and on various other assumptions that we believe to be reasonable and appropriate. Actual results may differ significantly from these estimates. The following is a description of our accounting policies that we believe require subjective and complex judgments, which could potentially have a material effect on our reported financial condition or results of operations.\nRevenue Recognition\nWe account for revenue in accordance with ASC 606, Revenue from Contracts with Customers. Our revenue recognition policies require us to make significant judgments and estimates. In applying our revenue recognition policy, we must determine which portions of our revenue are recognized currently (generally software and products revenue) and which portions must be deferred and recognized in future periods (generally services revenue). We analyze various factors including, but not limited to, the selling price of undelivered services when sold on a stand-alone basis, our pricing policies, the credit-worthiness of our customers, and contractual terms and conditions in helping us to make such judgments about revenue recognition. Changes in judgment on any of these factors could materially impact the timing and amount of revenue recognized in a given period.\nWe derive revenue from two primary sources: software and products, and services. Software and products revenue includes our software and integrated appliances that combine our software with hardware. Services include customer support (software updates and technical support), consulting, assessment and design services, installation services, customer education and Commvault software-as-a-service, which is branded as Metallic. A typical contract includes both licenses and services.\nWe sell both perpetual and term-based licenses of our software. We refer to our term-based software licenses as subscription arrangements. We do not customize our software and installation services are not required. The software is delivered before related services are provided and is functional without professional services, updates and technical support. We have concluded that our software licenses (both perpetual and subscription) are functional intellectual property that is distinct as the user can benefit from the software on its own. Software revenue for both perpetual and subscription licenses is typically recognized when the software is delivered and/or made available for download as this is the point the user of the software can direct the use of, and obtain substantially all of the remaining benefits from the functional intellectual property. We do not recognize software revenue related to the renewal of subscription software licenses earlier than the beginning of the new subscription period.\nWe also sell appliances that integrate our software with hardware and address a wide-range of business needs and use cases, ranging from support for remote or branch offices with limited IT staff up to large corporate data centers. Revenue related to appliances is recognized when control of the appliances passes to the customer; typically upon delivery. In the second half of fiscal 2021 we began transitioning to a software only model in which we sell software to a third party, which assembles an integrated appliance that is sold to end user customers. As a result, we expect the revenue and costs associated with hardware will decline going forward. The revenue for hardware is included in software and products revenue and associated costs are included in cost of software and products revenue.\nServices revenue includes revenue from customer support and other professional services. Customer support includes software updates on a when-and-if-available basis, telephone support, integrated web-based support and bug fixes or patches. Commvault sells its customer support contracts as a percentage of net software purchases the support is related to. Customer support revenue is recognized ratably over the term of the customer support agreement, which is typically one year. The term of our subscription arrangements is typically three years.\nOur other professional services include consulting, assessment and design services, installation services and customer education. Customer education services include courses taught by our instructors or third-party contractors. Revenue related to other professional services and customer education services is typically recognized as the services are performed. In fiscal 2020 Commvault launched Metallic, which is a Commvault software-as-a-service offering. Revenue from Metallic is recognized ratably as services revenue.\nMost of our contracts with customers contain multiple performance obligations. For these contracts, we account for individual performance obligations separately if they are distinct. The transaction price is allocated to the separate performance obligations on a relative standalone selling price basis. Standalone selling prices of software and appliances are typically estimated using the residual approach. Standalone selling prices of services are typically estimated based on observable transactions when these services are sold on a standalone basis.\nOur typical performance obligations include the following:\nPerformance Obligation When Performance Obligation\nis Typically Satisfied When Payment is\nTypically Due How Standalone Selling Price is\nTypically Estimated\nSoftware and Products Revenue\nSoftware Licenses Upon shipment or made available for download (point in time) Within 90 days of shipment except for certain subscription licenses which are paid for over time Residual approach\nAppliances When control of the appliances passes to the customer; typically upon delivery Within 90 days of delivery Residual approach\nCustomer Support Revenue\nSoftware Updates Ratably over the course of the support contract (over time) At the beginning of the contract period Observable in renewal transactions\nCustomer Support Ratably over the course of the support contract (over time) At the beginning of the contract period Observable in renewal transactions\nOther Services Revenue\nOther Professional Services (except for education services) As work is performed (over time) Within 90 days of services being performed Observable in transactions without multiple performance obligations\nEducation Services When the class is taught (point in time) Within 90 days of services being performed Observable in transactions without multiple performance obligations\nSoftware-as-a-service (Metallic) Ratably over the course of the contract (over time) Annual or monthly payments Observable in transactions without multiple performance obligations\nAccounting for Income Taxes\nUnder ASC 740, deferred income taxes arise from temporary differences between the tax basis of assets and liabilities and their reported amounts. Valuation allowances are established when, in our judgment, it is more likely than not that deferred tax assets will not be realized. In assessing the need for a valuation allowance, we weigh the available positive and negative evidence, including historical levels of pre-tax income, legislative developments, expectations and risks associated with estimates of future pre-tax income, and prudent and feasible tax planning strategies. During the year ended March 31, 2018, we concluded that based on the amount, and trend, of pre-tax loss in recent fiscal years it is more likely than not that we will not realize the benefits of its gross deferred tax assets and therefore have recorded a valuation allowance to reduce the carrying value of these gross deferred tax assets, net of the impact of the reversal of taxable temporary differences, to zero. The valuation allowance is material to our financial statements. In the future, changes to our estimates regarding the realizability of our gross deferred tax assets could materially impact our results of operations.\nWe conduct business globally and as a result, file income tax returns in the United States and in various state and foreign jurisdictions. In the normal course of business, we are subject to examination by taxing authorities throughout the world, including such major jurisdictions as the United States, Australia, Canada, Germany, Netherlands and United Kingdom.\nGoodwill and Purchased Intangible Asset\nWe test goodwill for impairment at least annually (January 1) by performing a quantitative assessment of whether the fair value of each reporting unit or asset exceeds its carrying amount. We have one reporting unit. Goodwill is tested at this reporting unit level and indefinite-lived intangible assets are tested at the individual asset level. This requires us to assess and make judgments regarding a variety of factors which impact the fair value of the reporting unit or asset being tested, including business plans, anticipated future cash flows, economic projections and other market data. Because there are inherent uncertainties involved in these factors, significant differences between these estimates and actual results could result in future impairment charges and could materially impact our future financial results. As noted below, during the second quarter of fiscal year 2021, we impaired our intangible assets. At which time, we also assessed the carrying value of goodwill and concluded it was not impaired. During the fourth quarter of 2021, we completed the annual impairment test for goodwill and determined that these assets had not been impaired as of the test date, January 1, 2021.\nIntangible assets are recognized apart from goodwill whenever an acquired intangible asset arises from contractual or other legal rights, or whenever it is capable of being separated or divided from the acquired entity and sold, transferred, licensed, rented, or exchanged, either individually or in combination with a related contract, asset or liability. We determined the fair value of our intangible assets using the income method. This model utilizes certain unobservable inputs classified as Level 3 measurements as defined by ASC 820, Fair Value Measurements and Disclosures. The determination of fair value requires considerable judgment and is sensitive to changes in underlying assumptions, estimates and market factors. Estimating fair value requires us to make assumptions and estimates regarding our future plans, as well as industry and economic conditions. The fair values of the intangible assets will be amortized over their useful lives. Impairment losses are recognized if the carrying amounts of finite-lived intangible assets are both not recoverable and exceed the fair values.\nOur purchased intangible assets were acquired in connection with the Hedvig Inc. transaction. The most material of these assets was developed technology. The value of this asset was attributable to forecasted incremental revenues directly attributable to this technology. While we have successfully integrated this technology into our existing HyperScale X technology, we did not meet our forecasts for standalone sales of this acquired technology. In the second quarter of fiscal 2021, the Company concluded that the carrying values were not recoverable on an undiscounted basis and recorded an impairment charge.\nResults of Operations\nFiscal year ended March 31, 2021 compared to fiscal year ended March 31, 2020\nRevenues (in millions)\n- Total revenues increased $52.6 million, or 8%\n- Software and products revenue represented 45% of our total revenues in fiscal 2021 and 41% of our total revenues in fiscal 2020.Software and products revenue increased $51.5 million, or 19%, primarily due to the following:\n•Increase of $46.5 million, or 26%, in larger deal transactions (deals greater than $0.1 million in software and products revenue)\n•Increase of 12% in the number of larger deal transactions as well as an increase of 13% in the average dollar amount of such transactions\n•The average dollar amount of larger deal transactions was approximately $335 thousand in fiscal 2021 and approximately $298 thousand in fiscal 2020.\n•Larger deal transactions represented approximately 69% of our software and products revenue in fiscal 2021 and 65% of our software and products revenue in fiscal 2020.\n•There was also an Increase of $5.0 million in transactions less than $0.1 million\n- Services revenue represented 55% of our total revenues in fiscal 2021 and 59% of our total revenues in fiscal 2020. Services revenue increased $1.0 million, primarily due to an increase in professional services and software-as-a-service revenue, partially offset by a decline in customer support revenue.\nWe track software and products revenue on a geographic basis. The geographic regions that are tracked are the Americas (United States, Canada, Latin America), EMEA (Europe, Middle East, Africa) and APJ (Australia, Japan, Southeast Asia, China). Americas, EMEA and APJ represented 57%, 31% and 12% of total software and products revenue, respectively, for the fiscal year ended March 31, 2021. The year over year increase of Software and Products Revenue was 32% in the Americas and 7% in EMEA while APJ was flat.\n▪The increase in Americas software and products revenue was primarily due to a 39% increase from larger deal transactions. This increase was the result of both an increase in average deal size and an increase in the number of transactions compared to prior year.\n▪EMEA software and products revenue increased primarily as a result of a 9% increase in deals less than $0.1 million. Large deal transactions also increased 5% driven by an increase in average deal size.\n▪APJ revenue from larger deal transactions increased 10% which was the result of an increase in average deal size. This increase was offset by deals less than $0.1 million which declined 8%.\nOur software and products revenue in EMEA and APJ is subject to changes in foreign exchange rates as more fully discussed above in the “Foreign Currency Exchange Rates’ Impact on Results of Operations” section.\nCost of Revenues and Gross Margin ($ in millions)\n- Total cost of revenues decreased $7.7 million, representing 15% of our total revenues in fiscal 2021 compared to 17% in fiscal 2020. Temporary salary cuts during the first half of fiscal year 2021 related to COVID-19 resulted in savings of $1.1 million in cost of revenues. The remaining decrease is primarily due to a decrease in employee-related expenses attributable to our restructuring and reorganization initiatives and a decrease in cost of revenue associated with our appliance.\n- Cost of software and products revenue decreased $0.9 million, representing 8% of software and products revenue in fiscal 2021 compared to 10% in fiscal 2020. The decrease is the result of lower cost of sales associated with our appliance with the introduction of HyperScale X compared to the same period in the prior year. Beginning with HyperScale X we began transitioning to a software only model. As a result, we expect the revenue and costs associated with hardware will decline going forward.\n- Cost of services revenue decreased $6.8 million, representing 21% of our services revenue in fiscal 2021 and 22% in fiscal 2020. The decline in cost of services revenue is primarily related to a decrease in employee-related expenses attributable to our restructuring and reorganization initiatives. Additionally, there was a decrease in expenses associated with temporary salary cuts during the first half of fiscal year 2021 related to COVID-19.\nOperating Expenses ($ in millions)\n- Sales and marketing expenses: decreased $3.8 million, or 1%, primarily due to the following:\n•Decreases related to the decline of travel and related expenses as a result of COVID-19.\n•Temporary salary cuts during the first half of fiscal year 2021 related to COVID-19.\n•These declines were partially offset by an increase in variable compensation associated with increased revenue, particularly during the second half of the year.\n- Research and development expenses: increased $23.4 million, or 21%, as a result of an increase in employee compensation and related expenses attributable to the expansion of our engineering group, including the following:\n•An increase in employee-related costs resulting from additional headcount due to the acquisition of Hedvig. Hedvig was acquired in October 2019; therefore, the prior year period includes only six months of such expenses compared to twelve months during this period.\n•Additionally, certain Hedvig shareholders will receive cash payments totaling $14.1 million over the course of the 30 months following the date of acquisition, contingent on their continued employment with the Company. While these payments are proportionate to these shareholders' ownership of Hedvig, they are accounted for as compensation expense over the course of the thirty month service period. Research and development expenses in fiscal 2021 includes $5.6 million of expense related to this arrangement compared to $2.8 million in the fiscal 2020.\n•Investing in research and development has been a priority for Commvault, and we anticipate continued spending related to the development of our data and information management software applications.\n- General and administrative expenses: remained relatively flat year over year but included the following:\n•Reduction of non-recurring prior year expenses associated with a non-routine shareholder matter and Hedvig acquisition costs.\n•Temporary salary cuts during the first half of fiscal year 2021 related to COVID-19.\n•Partially offset by increases in legal expenses for intellectual property associated with ongoing litigation and foreign currency losses due to the weakening of the US dollar.\n- Restructuring: In fiscal 2019 we initiated a restructuring plan to increase efficiency in our sales, marketing and distribution functions as well as reduce costs across all functional areas. Restructuring expenses were $23.5 million and $21.3 million for the years ended March 31, 2021 and 2020, respectively. These restructuring charges relate primarily to severance and related costs associated with headcount reductions. These charges include $2.7 million in fiscal 2021 and $1.8 million in fiscal 2020 of stock-based compensation related to modifications of existing awards granted to certain employees included in the restructuring. We cannot guarantee the restructuring program will achieve its intended result. Risks associated with this restructuring program also include additional unexpected costs, adverse effects on employee morale and the failure to meet operational and growth targets due to the loss of key employees, any of which may impair our ability to achieve anticipated results of operations or otherwise harm our business.\n- Depreciation and amortization expense: decreased $1.2 million, from $15.8 million in fiscal 2020 to $14.6 million in fiscal 2021.\nInterest Income\nInterest income decreased $3.9 million, from $5.0 million in fiscal 2020 to $1.0 million in fiscal 2021. The decrease was the result of a decrease in short term investments and decreased yield on those investments. Our short-term investments were in U.S. Treasury Bills.\nIncome Tax Expense\nIncome tax expense was $9.7 million in fiscal 2021 compared to a benefit of $6.9 million in fiscal 2020. The income tax expense for the year ended March 31, 2021 relates primarily to the impact of the U.S. CARES Act and current foreign taxes. The income tax benefit for the year ended March 31, 2020 relates primarily to the impact of the U.S. CARES Act. In the fourth quarter of fiscal 2020, we recorded a current tax benefit of approximately $10.0 million which represented our estimate of the net operating loss carryback resulting from the CARES Act. In the first quarter of fiscal 2021, we recorded an adjustment of $3.2 million to reduce the current benefit of the net operating loss carryback benefit we realized from the CARES Act.\nLiquidity and Capital Resources\nAs of March 31, 2021, our cash balance was $397.2 million. In recent fiscal years, our principal source of liquidity has been cash provided by operations.\nAs of March 31, 2021, the amount of cash and cash equivalents held outside of the United States by our foreign legal entities was approximately $174 million. These balances are dispersed across many international locations around the world. We believe that such dispersion meets the current and anticipated future liquidity needs of our foreign legal entities. In the event we needed to repatriate funds from outside of the United States, such repatriation would likely be subject to restrictions by local laws and/or tax consequences including foreign withholding taxes.\nDuring the year ended March 31, 2021, we repurchased $95.3 million of common stock (1.6 million shares) under our share repurchase program. Our stock repurchase program has been funded by our existing cash and cash equivalent balances as well as cash flows provided by our operations. Our Board has approved, and we intend to execute, a capital allocation policy that provides for the repurchase of $200 million of our common stock for the period from February 1, 2021 through the end of our 2022 fiscal year, plus the use of approximately 75% of our free cash flow for additional repurchases during fiscal year 2022. From February 1, 2021 through March 31, 2021 we repurchased $62.1 million of our common stock.\nThe following chart summarizes the cash used to repurchase shares of our common stock:\nOur summarized annual cash flow information is as follows (in thousands):\nYear Ended March 31,\n2021 2020 2019\nNet cash provided by operating activities $ 123,955 $ 88,464 $ 110,180\nNet cash provided by (used in) investing activities 35,469 (74,005) (5,261)\nNet cash used in financing activities (74,738) (39,403) (90,713)\nEffects of exchange rate - changes in cash 16,469 (6,966) (16,998)\nNet increase (decrease) in cash, cash equivalents and restricted cash $ 101,155 $ (31,910) $ (2,792)\n- Net cash provided by operating activities was impacted by:\n•Fiscal 2021: net loss adjusted for the impact of non-cash charges, including the impairment of intangible assets, and increases in deferred revenue and accrued expenses, partially offset by increases in accounts receivable and deferred commissions\n•Fiscal 2020: net loss adjusted for the impact of non-cash charges and decreases in accounts receivable\n•Fiscal 2019: net income adjusted for the impact of non-cash charges and increases in deferred revenue and accrued expenses, partially offset by increase in accounts receivable\n- Net cash provided by or used in investing activities was impacted by:\n•Fiscal 2021: $43.6 million of proceeds of short-term investments of U.S. Treasury bills, partially offset by $8.1 million of capital expenditures.\n•Fiscal 2020: $157.5 million used for the acquisition of Hedvig and $3.2 million of capital expenditures, partially offset by $86.7 million of net proceeds of short-term investments of U.S. Treasury Bills\n•Fiscal 2019: $1.3 million of net proceeds of short-term investments of U.S. Treasury Bills and $6.6 million of capital expenditures as we continue to invest in and enhance our global infrastructure. Included in this balance was a purchase of land adjacent to our global corporate headquarters.\n- Net cash used in financing activities was impacted by:\n•Fiscal 2021: $95.3 million used to repurchase shares of our common stock under our repurchase program, partially offset by $20.5 million of proceeds from the exercise of stock options and the employee stock purchase plan\n•Fiscal 2020: $77.2 million used to repurchase shares of our common stock under our repurchase program, partially offset by $37.8 million of proceeds from the exercise of stock options and the employee stock purchase plan\n•Fiscal 2019: $132.7 million used to repurchase shares of our common stock under our repurchase program, partially offset by $42.0 million of proceeds from the exercise of stock options and the employee stock purchase plan\nA summary of the cash used for the stock repurchase program consists of the following:\nYear Ended March 31,\n2021 2020 2019 2018 2017\nCash used for repurchases (in thousands) $ 95,259 $ 77,198 $ 132,697 $ 112,218 $ 49,998\nShares repurchased (in thousands) 1,643 1,701 2,115 2,098 982\nAverage price per share $ 57.97 $ 45.37 $ 62.74 $ 53.49 $ 50.91\nWorking capital increased $49.2 million from $185.1 million as of March 31, 2020 to $234.4 million as of March 31, 2021. The increase in working capital is primarily due to cash provided by operating activities partially offset by cash used for share repurchases during the fiscal year.\nWe believe that our existing cash, cash equivalents and our cash from operations will be sufficient to meet our anticipated cash needs for working capital, capital expenditures and potential stock repurchases for at least the next 12 months. We may seek additional funding through public or private financings or other arrangements during this period. Adequate funds may not be available when needed or may not be available on terms favorable to us, or at all. If additional funds are raised by issuing equity securities, dilution to existing stockholders will result. If we raise additional funds by obtaining loans from third parties, the terms of those financing arrangements may include negative covenants or other restrictions on our business that could impair our operational flexibility, and would also require us to fund additional interest expense. If funding is insufficient at any time in the future, we may be unable to develop or enhance our products or services, take advantage of business opportunities or respond to competitive pressures, any of which could have a material adverse effect on our business, financial condition and results of operations.\nSummary Disclosures about Contractual Obligations and Commercial Commitments\nOur material capital commitments consist of obligations under facilities and operating leases. Some of these leases have free or escalating rent payment provisions. Refer to Notes 2, 8 and 15 of the notes to the consolidated financial statements for further discussion on operating leases. We anticipate that we will experience an increase in our capital expenditures and lease commitments as a result of our anticipated growth in operations, infrastructure, personnel and resources devoted to building our brand name.\nWe have certain software royalty commitments associated with the shipment and licensing of certain products. Royalty expense is generally based on a fixed cost per unit shipped or a fixed fee for unlimited units shipped over a designated period. Royalty expense, included in cost of software and products revenues, was $16.3 million in fiscal 2021 and $12.5 million in fiscal 2020.\nWe offer a 90-day limited product warranty for our software. To date, costs relating to this product warranty have not been material.\nOff-Balance Sheet Arrangements\nAs of March 31, 2021, we did not have off-balance sheet financing arrangements, including any relationships with unconsolidated entities or financial partnerships, such as entities often referred to as structured finance or special purpose entities.\nIndemnifications\nCertain of our software licensing agreements contain certain provisions that indemnify our customers from any claim, suit or proceeding arising from alleged or actual intellectual property infringement. These provisions continue in perpetuity along with our software licensing agreements. We have never incurred a liability relating to one of these indemnification provisions in the past and we believe that the likelihood of any future payout relating to these provisions is remote. Therefore, we have not recorded a liability during any period related to these indemnification provisions.\nImpact of Recently Issued Accounting Standards\nSee Note 2 of the consolidated financial statements for a discussion of the impact of recently issued accounting standards.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nInterest Rate Risk\nNone.\nForeign Currency Risk\nEconomic Exposure\nAs a global company, we face exposure to adverse movements in foreign currency exchange rates. Our international sales are generally denominated in foreign currencies and this revenue could be materially affected by currency fluctuations. Approximately 48% of our sales were outside the United States in fiscal 2021 and 49% were outside the United States in fiscal 2020. Our primary exposures are to fluctuations in exchange rates for the U.S. dollar versus the Euro, and to a lesser extent, the Australian dollar, British pound sterling, Canadian dollar, Chinese yuan, Indian rupee, Korean won and Singapore dollar. Changes in currency exchange rates could adversely affect our reported revenues and require us to reduce our prices to remain competitive in foreign markets, which could also have a material adverse effect on our results of operations. Historically, we have periodically reviewed and revised the pricing of our products available to our customers in foreign countries and we have not maintained excess cash balances in foreign accounts.\nWe estimate that a 10% change in all foreign exchange rates would impact our reported operating profit by approximately $11.1 million annually. This sensitivity analysis disregards the possibilities that rates can move in opposite directions and that losses from one geographic area may be offset by gains from another geographic area.\nTransaction Exposure\nOur exposure to foreign currency transaction gains and losses is primarily the result of certain net receivables due from our foreign subsidiaries and customers being denominated in currencies other than the functional currency of the subsidiary. Our foreign subsidiaries conduct their businesses in local currency and we generally do not maintain excess U.S. dollar cash balances in foreign accounts.\nForeign currency transaction gains and losses are recorded in General and administrative expenses in the Consolidated Statements of Operation. We recognized net foreign currency transaction losses of $1.9 million, gains of $0.4 million and gains of $1.0 million in fiscal 2021, fiscal 2020, and fiscal 2019 respectively.",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nCommvault Systems, Inc.\nConsolidated Financial Statements\nFiscal Years Ended March 31, 2021, 2020 and 2019\nIndex to Consolidated Financial Statements\nPage\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of March 31, 2021 and 2020\nConsolidated Statements of Operations for the years ended March 31, 2021, 2020 and 2019\nConsolidated Statements of Comprehensive Loss for the years ended March 31, 2021, 2020 and 2019\nConsolidated Statements of Stockholders’ Equity for the years ended March 31, 2021, 2020 and 2019\nConsolidated Statements of Cash Flows for the years ended March 31, 2021, 2020 and 2019\nNotes to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Stockholders of Commvault Systems, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Commvault Systems, Inc. (the Company) as of March 31, 2021 and 2020, the related consolidated statements of operations, comprehensive loss, stockholders' equity and cash flows for each of the three years in the period ended March 31, 2021, and the related notes and financial statement schedule listed in the Index at Item 15 (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at March 31, 2021 and 2020, and the results of its operations and its cash flows for each of the three years in the period ended March 31, 2021, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of March 31, 2021, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated May 13, 2021 expressed an unqualified opinion thereon.\nAdoption of New Accounting Standard\nAs discussed in Note 2 to the consolidated financial statements, the Company changed its method for accounting for leases in 2020.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosure to which it relates.\nAccounting for Revenue Recognition\nDescription of the Matter\nAs described in Note 3 to the consolidated financial statements, the Company derives revenues from two primary sources: software and services. Most of the Company’s contracts with customers contain multiple performance obligations which are accounted for separately, if they are distinct. The transaction price is allocated to separate performance obligations on a relative standalone selling price basis. The standalone selling prices of software are typically estimated using the residual approach. Standalone selling prices of services are typically estimated based on observable transactions when those services are sold on a standalone basis.\nAuditing the identification of performance obligations in a software contract requires significant judgment as it relates to the evaluation of the contractual terms of the arrangement. Auditing the allocation of the transaction price to performance obligations requires significant judgment in determining whether the use of the residual approach to estimate the standalone selling prices of software is appropriate.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the Company’s revenue recognition process, including the evaluation of the contractual terms of the revenue arrangements and the Company’s assessment of the appropriateness of the residual approach for estimating the standalone selling prices of software.\nTo test the amount of revenue recognized, we performed audit procedures that included, among others, testing a sample of revenue transactions during the year and evaluating the identification of performance obligations based on analysis of the contractual terms and independent confirmations of the terms and conditions of the contract directly with customers. Our testing of the application of the residual approach to estimate standalone selling prices of software included inquiries with management and analysis of the variability of actual software pricing during the year by customer class.\nWe have served as the Company’s auditor since 1998.\n/s/ Ernst & Young LLP\nIselin, New Jersey\nMay 13, 2021\nCommvault Systems, Inc.\nConsolidated Balance Sheets\n(In thousands, except per share data)\nMarch 31,\n2021 2020\nASSETS\nCurrent assets:\nCash and cash equivalents $ 397,237 $ 288,082\nRestricted cash - 8,000\nShort-term investments - 43,645\nTrade accounts receivable, net 188,126 146,990\nOther current assets 22,237 26,969\nTotal current assets 607,600 513,686\nProperty and equipment, net 112,779 114,519\nOperating lease assets 20,778 15,009\nDeferred commissions cost 38,444 31,394\nIntangible assets, net - 46,350\nGoodwill 112,435 112,435\nOther assets 12,137 11,683\nTotal assets $ 904,173 $ 845,076\nLIABILITIES AND STOCKHOLDERS’ EQUITY\nCurrent liabilities:\nAccounts payable $ 374 $ 307\nAccrued liabilities 112,148 87,051\nCurrent portion of operating lease liabilities 7,469 7,699\nDeferred revenue 253,211 233,497\nTotal current liabilities 373,202 328,554\nDeferred revenue, less current portion 119,231 92,723\nDeferred tax liabilities, net 761 849\nLong-term operating lease liabilities 15,419 8,808\nOther liabilities 1,526 2,238\nCommitments and contingencies (Note 8)\nStockholders’ equity:\nPreferred stock, $0.01 par value: 50,000 shares authorized, no shares issued and outstanding\n- -\nCommon stock, $0.01 par value, 250,000 shares authorized, 46,482 shares and 46,011 shares issued and outstanding at March 31, 2021 and 2020, respectively\n463 458\nAdditional paid-in capital 1,069,695 978,659\nAccumulated deficit (665,774) (553,790)\nAccumulated other comprehensive loss (10,350) (13,423)\nTotal stockholders’ equity 394,034 411,904\nTotal liabilities and stockholders’ equity $ 904,173 $ 845,076\nSee accompanying notes to consolidated financial statements\nCommvault Systems, Inc.\nConsolidated Statements of Operations\n(In thousands, except per share data)\nYear Ended March 31,\n2021 2020 2019\nRevenues:\nSoftware and products $ 326,843 $ 275,308 $ 309,899\nServices 396,629 395,577 401,058\nTotal revenues 723,472 670,885 710,957\nCost of revenues:\nSoftware and products 27,218 28,082 25,691\nServices 82,155 88,996 91,315\nTotal cost of revenues 109,373 117,078 117,006\nGross margin 614,099 553,807 593,951\nOperating expenses:\nSales and marketing 331,948 335,785 370,088\nResearch and development 133,401 110,020 92,647\nGeneral and administrative 92,214 92,130 100,946\nRestructuring 23,471 21,348 14,765\nImpairment of intangible assets 40,700 - -\nDepreciation and amortization 14,628 15,815 10,597\nNet change in contingent consideration - (3,783) -\nTotal operating expenses 636,362 571,315 589,043\nIncome (loss) from operations (22,263) (17,508) 4,908\nInterest income 1,028 4,962 5,519\nIncome (loss) before income taxes (21,235) (12,546) 10,427\nIncome tax expense (benefit) 9,719 (6,901) 6,866\nNet income (loss) $ (30,954) $ (5,645) $ 3,561\nNet income (loss) per common share:\nBasic $ (0.66) $ (0.12) $ 0.08\nDiluted $ (0.66) $ (0.12) $ 0.07\nWeighted average common shares outstanding:\nBasic 46,652 45,793 45,827\nDiluted 46,652 45,793 47,601\nSee accompanying notes to consolidated financial statements\nCommvault Systems, Inc.\nConsolidated Statements of Comprehensive Loss\n(In thousands)\nYear Ended March 31,\n2021 2020 2019\nNet income (loss) $ (30,954) $ (5,645) $ 3,561\nOther comprehensive income (loss):\nForeign currency translation adjustment 3,073 (1,855) (6,096)\nComprehensive loss $ (27,881) $ (7,500) (2,535)\nSee accompanying notes to consolidated financial statements\nCommvault Systems, Inc.\nConsolidated Statements of Stockholders’ Equity\n(In thousands)\nCommon Stock Additional\nPaid-In\nCapital Accumulated\nDeficit Accumulated\nOther\nComprehensive\nLoss Total\nShares Amount\nBalance at March 31, 2018 45,118 $ 450 $ 782,764 $ (373,678) $ (5,472) $ 404,064\nStock-based compensation 80,487 80,487\nShare issuances related to stock-based compensation 2,579 25 41,959 41,984\nRepurchase of common stock (2,115) (21) (17,303) (115,373) (132,697)\nNet income 3,561 3,561\nOther comprehensive loss (6,096) (6,096)\nBalance at March 31, 2019 45,582 454 887,907 (485,490) (11,568) 391,303\nStock-based compensation 65,888 65,888\nShare issuances related to business combinations 1,616 1,616\nShare issuances related to stock-based compensation 2,131 21 37,774 37,795\nRepurchase of common stock (1,702) (17) (14,526) (62,655) (77,198)\nNet loss (5,645) (5,645)\nOther comprehensive loss (1,855) (1,855)\nBalance at March 31, 2020 46,011 458 978,659 (553,790) (13,423) 411,904\nCumulative effect of adoption of ASU 2016-13 (84) (84)\nStock-based compensation 84,833 84,833\nShare issuances related to stock-based compensation 2,115 21 20,500 20,521\nRepurchase of common stock (1,644) (16) (14,297) (80,946) (95,259)\nNet loss (30,954) (30,954)\nOther comprehensive income 3,073 3,073\nBalance at March 31, 2021 46,482 463 1,069,695 (665,774) (10,350) 394,034\nSee accompanying notes to consolidated financial statements\nCommvault Systems, Inc.\nConsolidated Statements of Cash Flows\n(In thousands)\nYear Ended March 31,\n2021 2020 2019\nCash flows from operating activities\nNet income (loss) $ (30,954) $ (5,645) $ 3,561\nAdjustments to reconcile net income (loss) to net cash provided by operating activities:\nDepreciation and amortization 15,878 17,065 12,060\nNoncash stock-based compensation 84,833 65,888 80,487\nNon-cash change in contingent consideration - (3,783) -\nImpairment of intangible assets 40,700 - -\nDeferred income taxes (92) (1,783) 164\nAmortization of deferred commissions cost 18,318 17,717 17,348\nImpairment of operating lease assets 1,684 2,761 -\nChanges in operating assets and liabilities:\nTrade accounts receivable (34,622) 26,096 (24,092)\nOperating lease assets and liabilities, net (1,157) (1,226) -\nOther current assets and Other assets 11,887 (1,246) 11,400\nDeferred commissions cost (24,095) (16,063) (18,967)\nAccounts payable 49 (2,474) 1,485\nAccrued liabilities 10,660 (1,997) 5,075\nDeferred revenue 31,740 (6,230) 21,719\nOther liabilities (874) (616) (60)\nNet cash provided by operating activities 123,955 88,464 110,180\nCash flows from investing activities\nPurchase of short-term investments - (43,645) (130,338)\nProceeds from maturity of short-term investments 43,645 130,338 131,637\nPurchase of property and equipment (8,176) (3,203) (6,560)\nBusiness combination, net of cash acquired - (157,495) -\nNet cash provided by (used in) investing activities 35,469 (74,005) (5,261)\nCash flows from financing activities\nRepurchase of common stock (95,259) (77,198) (132,697)\nProceeds from stock-based compensation plans 20,521 37,795 41,984\nNet cash used in financing activities (74,738) (39,403) (90,713)\nEffects of exchange rate - changes in cash 16,469 (6,966) (16,998)\nNet increase (decrease) in cash, cash equivalents and restricted cash 101,155 (31,910) (2,792)\nCash, cash equivalents and restricted cash at beginning of year 296,082 327,992 330,784\nCash, cash equivalents and restricted cash at end of year $ 397,237 $ 296,082 $ 327,992\nSupplemental disclosures of cash flow information\nIncome taxes paid $ 2,959 $ 6,002 $ 11,491\nSee accompanying notes to consolidated financial statements\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements\n(In thousands, except per share data)\n1. Nature of Business\nCommvault Systems, Inc. and its subsidiaries (\"Commvault,\" \"we,\" \"us,\" or \"our\") is a provider of data protection and information management software applications and products. We develop, market and sell a suite of software applications and services, globally, that provides our customers with data protection solutions. We also provide our customers with a broad range of professional and customer support services, including backup-as-a-service, branded as Metallic.\n2. Summary of Significant Accounting Policies\nBasis of Presentation\nThe consolidated financial statements include the accounts of Commvault. All intercompany transactions and balances have been eliminated in consolidation.\nUse of Estimates\nThe preparation of financial statements and related disclosures in conformity with U.S. generally accepted accounting principles (\"U.S. GAAP\") requires management to make judgments and estimates that affect the amounts reported in our consolidated financial statements and the accompanying notes. We base our estimates and judgments on historical experience and on various other assumptions that we believe are reasonable under the circumstances. The amounts of assets and liabilities reported in our balance sheets and the amounts of revenues and expenses reported for each of the periods presented are affected by estimates and assumptions, which are used for, but not limited to, the accounting for revenue recognition, income taxes and related reserves, and goodwill and purchased intangible assets. Actual results could differ from those estimates.\nRevenue\nWe account for revenue in accordance with Accounting Standards Codification (\"ASC\") Topic 606, Revenue from Contracts with Customers (\"ASC 606\"). For a further discussion of our accounting policies related to revenue see Note 3 of the consolidated financial statements.\nShipping and Handling Costs\nShipping and handling costs are included in cost of revenues for all periods presented.\nSales Tax\nWe record revenue net of sales tax.\nAccounting for Stock-Based Compensation\nRestricted stock units without a market condition are measured based on the fair market values of the underlying stock on the date of grant. We recognize stock-based compensation expense using the straight-line method for all stock awards that do not include a market or performance condition. Awards that include a market or performance condition are expensed using the accelerated method.\nSoftware Development Costs\nResearch and development expenditures are charged to operations as incurred. Based on our software development process, technological feasibility is established upon completion of a working model, which also requires certification and extensive testing. Costs incurred by us between completion of the working model and the point at which the product is ready for general release are immaterial.\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\nAdvertising Costs\nWe expense advertising costs as incurred. Advertising expenses were $9,560, $5,579, and $4,678 for the years ended March 31, 2021, 2020 and 2019, respectively.\nAccounting for Income Taxes\nWe account for income taxes in accordance with ASC Topic 740, Income Taxes (\"ASC 740\"). The provision for income taxes and effective tax rates are calculated by legal entity and jurisdiction and are based on a number of factors, including the level of pre-tax earnings, income tax planning strategies, differences between tax laws and accounting rules, statutory tax rates and credits, uncertain tax positions and valuation allowances. We use significant judgment and estimates in evaluating tax positions. The effective tax rate in a given financial statement period may be materially impacted by changes in the mix and level of earnings by taxing jurisdiction.\nUnder ASC 740, deferred income taxes arise from temporary differences between the tax basis of assets and liabilities and their reported amounts. Valuation allowances are established when, in our judgment, it is more likely than not that deferred tax assets will not be realized. In assessing the need for a valuation allowance, we weigh the available positive and negative evidence, including historical levels of pre-tax income, legislative developments, expectations and risks associated with estimates of future pre-tax income, and prudent and feasible tax planning strategies.\nForeign Currency Translation\nThe functional currencies of our foreign operations are deemed to be the local country’s currency. Assets and liabilities of our international subsidiaries are translated at their respective period-end exchange rates, and revenues and expenses are translated at average currency exchange rates for the period. The resulting balance sheet translation adjustments are included in Other comprehensive loss and are reflected as a separate component of Stockholders’ equity.\nForeign currency transaction gains and losses are recorded in General and administrative expenses in the Consolidated Statements of Operations. These gains and losses relate primarily to receivables and payables that are not denominated in the functional currency of the subsidiary they relate to. We recognized net foreign currency transaction losses of $1,918 in the year ended March 31, 2021, and net foreign currency transaction gains of $355 and $984 in the years ended March 31, 2020, and 2019, respectively.\nNet Income per Common Share\nBasic net income per common share is computed by dividing net income by the weighted average number of common shares during the period. Diluted net income per share is computed using the weighted average number of common shares and, if dilutive, potential common shares outstanding during the period. Potential common shares consist of the incremental common shares issuable upon the exercise of stock options, vesting of restricted stock units and shares to be purchased under the Employee Stock Purchase Plan. The dilutive effect of such potential common shares is reflected in diluted earnings per share by application of the treasury stock method.\nThe following table sets forth the reconciliation of basic and diluted common share:\nYear Ended March 31,\n2021 2020 2019\nBasic weighted-average shares outstanding 46,652 45,793 45,827\nDilutive effect of stock options, restricted stock units, and employee stock purchase plan - - 1,774\nDiluted weighted-average shares outstanding 46,652 45,793 47,601\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\nThe following table summarizes our potential outstanding common stock equivalents at the end of each period, which have been excluded from the computation of diluted net income per common share, as their effect is anti-dilutive.\nYear Ended March 31,\n2021 2020 2019\nStock options, restricted stock units, and shares under the employee stock purchase plan 5,024 4,933 998\nCash, Cash Equivalents and Restricted Cash\nWe consider all highly liquid investments purchased with maturities of three months or less at the date of purchase to be cash equivalents, primarily in the form of money market funds. Amounts held in Restricted cash as of March 31, 2020, and classified as such on the Consolidated Balance Sheets, related to a contingent consideration arrangement which required us to pay up to $8,000 of cash, contingent on us receiving one or more bona fide and valid purchase orders from a specified customer, no later than April 30, 2020 (see Note 4).\nShort-term Investments\nShort-term investments consist of investments with maturities of twelve months or less that do not meet the criteria to be cash equivalents. We determine classification of the investment as trading, available-for-sale or held-to-maturity at the time of purchase and reevaluate classification whenever changes in circumstances indicate changes in classification may be necessary. As of March 31, 2021, we did not hold any short-term investments. Our short-term investments as of March 31, 2020 were classified as held-to-maturity. Held-to-maturity investments consist of securities that we have the intent and ability to retain until maturity. Held-to-maturity investments are initially recorded at cost and adjusted for the amortization of discounts from the date of purchase through maturity. Income related to investments is recorded as interest income in the Consolidated Statements of Operations. Cash inflows and outflows related to the sale, maturity and purchase of investments are classified as investing activities in our Consolidated Statements of Cash Flows.\nTrade and Other Receivables\nTrade and other receivables are primarily comprised of trade receivables that are recorded at the invoice amount, net of an allowance for doubtful accounts, which is not material. Unbilled receivables represent amounts for which revenue has been recognized but which have not yet been invoiced to the customer. The current portion of unbilled receivables is included in Trade accounts receivable on the Consolidated Balance Sheets. Long-term unbilled receivables are included in Other assets.\nHistorically, we have not experienced material losses related to the inability to collect receivables from our customers. While there is presently no indication that we will not collect material amounts of accounts receivable as of March 31, 2021, we continue to closely monitor the impact of COVID-19 on our customers. In these current economic conditions, payment from our customers may be delayed or receivables may become uncollectible. The inability to collect receivables could have a material impact on our results of operations.\nConcentration of Credit Risk\nWe grant credit to customers in a wide variety of industries worldwide and generally do not require collateral. Credit losses relating to these customers have been minimal.\nSales through our distribution agreement with Arrow Enterprise Computing Solutions, Inc. (\"Arrow\") totaled approximately 36%, 37% and 38% of total revenues for the years ended March 31, 2021, 2020 and 2019, respectively. Arrow accounted for approximately 33% and 31% of total accounts receivable as of March 31, 2021 and 2020, respectively.\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\nFair Value of Financial Instruments\nThe carrying amounts of our cash, cash equivalents, restricted cash, accounts receivable, accounts payable and accrued expenses approximate their fair values due to the short-term maturity of these instruments. Our short-term investments balance as of March 31, 2020 consisted of U.S. Treasury Bills with maturities of one year or less. We account for these short-term investments as held to maturity. The contingent consideration liability associated with the Hedvig acquisition as discussed further in Note 4 of the consolidated financial statements was valued based on the total bona fide and valid purchase orders received through April 30, 2020 from a specified customer.\nFair value is defined as the exchange price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for such asset or liability in an orderly transaction between market participants on the measurement date. Valuation techniques used to measure fair value should maximize the use of observable inputs and minimize the use of unobservable inputs. To measure fair value, we use the following fair value hierarchy based on three levels of inputs, of which the first two are considered observable and the last unobservable:\nLevel 1 - Quoted prices in active markets for identical assets or liabilities.\nLevel 2 - Inputs other than Level 1 that are observable for the asset or liability, either directly or indirectly, such as quoted prices for similar assets and liabilities in active markets; quoted prices for identical or similar assets or liabilities in markets that are not active; or other inputs that are observable or can be corroborated by observable market data by correlation or other means.\nLevel 3 - Unobservable inputs that are supported by little or no market activity and that are significant to the fair value of the assets or liabilities.\nThere were no financial assets measured at fair value on a recurring basis at March 31, 2021. The following table summarizes the composition of our financial assets measured at fair value at March 31, 2020:\nMarch 31, 2020 Level 1 Level 2 Level 3 Total\nAssets:\nShort-term investments $ - 44,484 - $ 44,484\nLiabilities:\nContingent consideration - $ - 217 $ 217\nLeases\nWe account for leases in accordance with ASC 842, Leases, which was adopted on April 1, 2019. We determine if an arrangement contains a lease at inception. We generally lease our facilities under operating leases. Operating lease right-of-use (\"ROU\") assets are included in Operating lease assets on our Consolidated Balance Sheets. Current portion of operating lease liabilities and Long-term operating lease liabilities are included on our Consolidated Balance Sheets.\nROU assets represent our right to use an underlying asset for the lease term and lease liabilities represent our obligation to make lease payments arising from the lease. Operating lease ROU assets and liabilities are recognized at commencement date based on the present value of lease payments over the lease term. As most of our leases do not provide an implicit rate, we generally use our incremental borrowing rate based on the estimated rate of interest for collateralized borrowing over a similar term of the lease payments at commencement date.\nWe recognize operating lease costs over the estimated term of the lease, which includes options to extend lease terms that are reasonably certain of being exercised, starting when possession of the property is taken from the landlord. When a lease contains a predetermined fixed escalation of the minimum rent, we recognize the related operating lease cost on a straight-line basis over the lease term. In addition, certain of our lease agreements include variable lease payments, such as estimated tax and maintenance charges. These variable lease payments are excluded from minimum lease payments and are included in the determination of lease cost when it is probable that the expense has been incurred and the amount can be reasonably estimated.\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\nProperty and Equipment\nProperty and equipment are stated at cost, less accumulated depreciation and amortization. Land is not depreciated. We provide for depreciation on a straight-line basis over the estimated useful lives of the assets. The depreciable assets that comprise our owned headquarters are classified as Buildings and are being depreciated over lives ranging from ten to sixty years. Computer and related equipment is generally depreciated over eighteen months to three years and furniture and fixtures are generally depreciated over three to twelve years. Leasehold improvements are amortized over the shorter of the useful life of the improvement or the term of the related lease. Expenditures for routine maintenance and repairs are charged against operations. Major replacements, improvements and additions are capitalized.\nAsset Retirement Obligation\nA liability for the fair value of an asset retirement obligation and corresponding increase to the carrying value of the related leasehold improvements are recorded at the time leasehold improvements are acquired. We maintain certain office space for which the lease agreement requires that we return the office space to its original condition upon vacating the premises. Accordingly, the balance of the asset retirement obligation was $780 as of March 31, 2021 and $1,420 as of March 31, 2020.\nGoodwill and Intangible Assets\nGoodwill is recorded when the consideration paid for an acquisition exceeds the fair value of net tangible and intangible assets acquired. The carrying value of goodwill is tested for impairment on an annual basis on January 1, or more often if an event occurs or circumstances change that would more likely than not reduce the fair value of its carrying amount. For the purpose of impairment testing, we have a single reporting unit. The impairment test consists of comparing the fair value of the reporting unit with its carrying amount that includes goodwill. If the carrying amount of the reporting unit exceeds the fair value of the reporting unit, an impairment loss would be recognized to reduce the carrying amount to its fair value.\nPurchased intangible assets with finite lives were valued using the income method and were being amortized on a straight-line basis over their economic lives of five years for developed technology and two years for customer relationships as we believed this method most closely reflects the pattern in which the economic benefits of the assets will be consumed. Impairment losses are recognized if the carrying amount of an intangible asset is both not recoverable and exceeds its fair value. During the fiscal year ended March 31, 2021, we recognized an impairment charge on these assets that reduced their carrying value to zero. Refer to Note 5 for further discussion.\nLong-Lived Assets\nWe review our long-lived assets for impairment whenever events or changes in circumstances indicate that the carrying amount of the assets may not be fully recoverable. To determine the recoverability of our long-lived assets, we evaluate the estimated future undiscounted cash flows that are directly associated with, and that are expected to arise as a direct result of, the use and eventual disposition of the long-lived asset. If the estimated future undiscounted cash flows demonstrate that recoverability is not probable, an impairment loss would be recognized. An impairment loss would be calculated based on the excess carrying amount of the long-lived asset over the long-lived asset’s fair value. The fair value would be determined based on valuation techniques such as a comparison to fair values of similar assets.\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\nDeferred Commissions Cost\nSales commissions, bonuses, and related payroll taxes earned by our employees are considered incremental and recoverable costs of obtaining a contract with a customer. Our typical contracts include performance obligations related to software licenses, software updates, customer support and other services, including software-as-a-service offerings. In these contracts, incremental costs of obtaining a contract are allocated to the performance obligations based on the relative estimated standalone selling prices and then recognized on a systematic basis that is consistent with the transfer of the goods or services to which the asset relates. We do not pay commissions on annual renewals of contracts for software updates and customer support for perpetual licenses. The costs allocated to software and products are expensed at the time of sale, when revenue for the functional software license or appliance is recognized. The costs allocated to software updates and customer support for perpetual licenses are amortized ratably over a period of approximately five years, the expected period of benefit of the asset capitalized. We currently estimate a period of five years is appropriate based on consideration of historical average customer life and the estimated useful life of the underlying software or appliance sold as part of the transaction. Costs related to software updates and support for term-based, or subscription software licenses, are limited to the contractual period of the arrangement as we intend to pay a commensurate commission upon renewal of the subscription license and related updates and support. The costs related to professional services are amortized over the period the related professional services are provided and revenue is recognized. Amortization expense related to these costs is included in Sales and marketing expenses in the accompanying Consolidated Statements of Operations.\nDeferred Revenue\nDeferred revenues represent amounts collected from, or invoiced to, customers in excess of revenues recognized. This results primarily from the billing of annual customer support agreements, and billings for other professional services fees that have not yet been performed by us. The value of deferred revenues will increase or decrease based on the timing of invoices and recognition of revenue.\nShare Repurchases\nWe consider all shares repurchased as canceled shares restored to the status of authorized but unissued shares on the trade date. The aggregate purchase price of the shares of our common stock repurchased is reflected as a reduction to Stockholders’ equity. We account for shares repurchased as an adjustment to common stock (at par value) with the excess repurchase price allocated between Additional paid-in capital and Accumulated deficit.\nComprehensive Income (Loss)\nComprehensive income (loss) is defined to include all changes in equity, except those resulting from investments by stockholders and distribution to stockholders.\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\nRecently Adopted Accounting Standards\nStandard Description Effective Date Effect on the Consolidated Financial Statements (or Other Significant Matters)\nAccounting Standards Update (\"ASU\") No. 2016-13 (Topic 326), Financial Instruments-Credit Losses The standard amends guidance on the impairment of financial instruments. The ASU estimates credit losses based on expected losses and provides for a simplified accounting model for purchased financial assets with credit deterioration. The standard requires a modified retrospective basis adoption through a cumulative-effect adjustment to retained earnings as of the beginning of the period of adoption. We adopted this new standard as of April 1, 2020, using the modified retrospective method recognized as of the date of initial application. The adoption of this new standard resulted in an $84 thousand cumulative effect on our consolidated financial statements related to an adjustment to our allowance for doubtful accounts.\nUnder the new standard, we assess credit losses on accounts receivable by taking into consideration past collection experience, credit quality of the customer, age of the receivable balance, current economic conditions, and forecasts that affect the collectability of the reported amount.\nRecently Issued Accounting Standards Not Yet Adopted\nStandard Description Effective Date Effect on the Consolidated Financial Statements (or Other Significant Matters)\nASU No. 2019-12 (Topic 740), Income Taxes In December 2019, the Financial Accounting Standards Board (\"FASB\") issued a new standard to simplify the accounting for income taxes. The guidance eliminates certain exceptions related to the approach for intraperiod tax allocation, the methodology for calculating income taxes in an interim period, and the recognition of deferred tax liabilities for outside basis differences related to changes in ownership of equity method investments and foreign subsidiaries. The guidance also simplifies aspects of accounting for franchise taxes and enacted changes in tax laws or rates, and clarifies the accounting for transactions that result in a step-up in the tax basis of goodwill. The standard became effective for us beginning April 1, 2021. We do not expect the adoption to have a material impact in our consolidated financial statements, including accounting policies, processes, and systems.\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\n3. Revenue\nWe derive revenues from two primary sources: software and products, and services. Software and products revenue includes our software and integrated appliances that combine our software with hardware. Services include customer support (software updates and technical support), consulting, assessment and design services, installation services, customer education and Commvault software-as-a-service, which is branded as Metallic.\nWe sell both perpetual and term-based licenses of our software. We refer to our term-based software licenses as subscription arrangements. We do not customize our software and installation services are not required. The software is delivered before related services are provided and is functional without professional services, updates and technical support. We have concluded that our software licenses (both perpetual and subscription) are functional intellectual property that is distinct as the user can benefit from the software on its own. Software revenue for both perpetual and subscription licenses is typically recognized when the software is delivered and/or made available for download as this is the point the user of the software can direct the use of, and obtain substantially all of the remaining benefits from the functional intellectual property. We do not recognize software revenue related to the renewal of subscription software licenses earlier than the beginning of the new subscription period.\nWe also sell appliances that integrate our software with hardware and address a wide-range of business needs and use cases, ranging from support for remote or branch offices with limited IT staff up to large corporate data centers. Revenue related to appliances is recognized when control of the appliances passes to the customer; typically upon delivery. In the second half of fiscal 2021 we began transitioning to a software only model in which we sell software to a third party, which assembles an integrated appliance that is sold to end user customers. As a result, we expect the revenue and costs associated with hardware will decline going forward. The revenue for hardware is included in software and products revenue and associated costs are included in cost of software and products revenue.\nServices revenue includes revenue from customer support and other professional services. Customer support includes software updates on a when-and-if-available basis, telephone support, integrated web-based support and bug fixes or patches. We sell our customer support contracts as a percentage of net software purchases the support is related to. Customer support revenue is recognized ratably over the term of the customer support agreement, which is typically one year on our perpetual licenses. The term of our subscription arrangements is typically three years.\nOur other professional services include consulting, assessment and design services, installation services and customer education. Customer education services include courses taught by our instructors or third-party contractors. Revenue related to other professional services and customer education services is typically recognized as the services are performed. In fiscal 2020 Commvault launched Metallic, which is a Commvault software-as-a-service offering. Revenue from Metallic is recognized ratably as services revenue.\nMost of our contracts with customers contain multiple performance obligations. For these contracts, we account for individual performance obligations separately if they are distinct. The transaction price is allocated to the separate performance obligations on a relative standalone selling price basis. Standalone selling prices of software and appliances are typically estimated using the residual approach. Standalone selling prices of services are typically estimated based on observable transactions when these services are sold on a standalone basis.\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\nOur typical performance obligations include the following:\nPerformance Obligation When Performance Obligation\nis Typically Satisfied When Payment is\nTypically Due How Standalone Selling Price is\nTypically Estimated\nSoftware and Products Revenue\nSoftware Licenses Upon shipment or made available for download (point in time) Within 90 days of shipment except for certain subscription licenses which are paid for over time\nResidual approach\nAppliances When control of the appliances passes to the customer; typically upon delivery Within 90 days of delivery\nResidual approach\nCustomer Support Revenue\nSoftware Updates Ratably over the course of the support contract (over time) At the beginning of the contract period Observable in renewal transactions\nCustomer Support Ratably over the course of the support contract (over time) At the beginning of the contract period Observable in renewal transactions\nOther Services Revenue\nOther Professional Services (except for education services) As work is performed (over time) Within 90 days of services being performed\nObservable in transactions without multiple performance obligations\nEducation Services When the class is taught (point in time) Within 90 days of services being performed\nObservable in transactions without multiple performance obligations\nSoftware-as-a-service (Metallic) Ratably over the course of the contract (over time) Annual or monthly payments Observable in transactions without multiple performance obligations\nDisaggregation of Revenue\nWe disaggregate revenue from contracts with customers into the nature of the products and services and geographical regions. The geographic regions that are tracked are the Americas (United States, Canada, Latin America), EMEA (Europe, Middle East, Africa) and APJ (Australia, New Zealand, Southeast Asia, China). We operate in one segment.\nYear Ended March 31, 2021\nAmericas EMEA APJ Total\nSoftware and Products Revenue $ 187,027 $ 101,673 $ 38,143 $ 326,843\nCustomer Support Revenue 215,831 100,620 41,330 357,781\nProfessional Services 21,264 12,138 5,446 38,848\nTotal Revenue $ 424,122 $ 214,431 $ 84,919 $ 723,472\nYear Ended March 31, 2020\nAmericas EMEA APJ Total\nSoftware and Products Revenue $ 141,856 $ 95,356 $ 38,096 $ 275,308\nCustomer Support Revenue 230,226 88,965 40,939 360,130\nProfessional Services 18,778 10,459 6,210 35,447\nTotal Revenue $ 390,860 $ 194,780 $ 85,245 $ 670,885\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\nYear Ended March 31, 2019\nAmericas EMEA APJ Total\nSoftware and Products Revenue $ 170,114 $ 95,913 $ 43,872 $ 309,899\nCustomer Support Revenue 237,190 82,895 38,662 358,747\nProfessional Services 23,076 12,380 6,855 42,311\nTotal Revenue $ 430,380 $ 191,188 $ 89,389 $ 710,957\nInformation about Contract Balances\nAmounts collected in advance of services being provided are accounted for as deferred revenue. Nearly all of our deferred revenue balance is related to services revenue, primarily customer support contracts.\nIn some arrangements we allow customers to pay for term-based software licenses and products over the term of the software license. Amounts recognized as revenue in excess of amounts billed are recorded as unbilled receivables. Unbilled receivables, which are anticipated to be invoiced in the next twelve months, are included in Accounts receivable on the Consolidated Balance Sheets. Long-term unbilled receivables are included in Other assets. The opening and closing balances of our Accounts receivable, Unbilled receivables and Deferred revenues are as follows:\nAccounts Receivable Unbilled Receivable\n(current) Unbilled Receivable\n(long-term) Deferred Revenue\n(current) Deferred Revenue\n(long-term)\nOpening Balance as of March 31, 2020 $ 129,856 $ 17,134 $ 7,857 $ 233,497 $ 92,723\nIncrease/(decrease), net 39,129 2,007 (394) 19,714 26,508\nEnding Balance as of March 31, 2021 $ 168,985 $ 19,141 $ 7,463 $ 253,211 $ 119,231\nThe increase in accounts receivable (inclusive of unbilled receivables) is primarily a result of an increase in software and products revenue relative to the prior year. The increase in deferred revenue is primarily the result of an increase in deferred customer support revenue related to software and products revenue transactions and a weakening of the U.S. dollar.\nThe amount of revenue recognized in the period that was included in the opening deferred revenue balance was $247,579 for the year ended March 31, 2021. The vast majority of this revenue consists of customer support arrangements. The amount of revenue recognized from performance obligations satisfied in prior periods was not material.\nRemaining Performance Obligations\nIn addition to the amounts included in deferred revenue as of March 31, 2021, approximately $46,163 of revenue may be recognized from remaining performance obligations, of which approximately $12,000 was related to software and products. We expect most of the software and products revenue to be recognized in the first half of fiscal 2022. The majority of the services revenue is related to other professional services which may be recognized over the next twelve months but is contingent upon a number of factors, including customers’ needs and schedules.\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\n4. Business Combination\nDuring fiscal 2020, on October 1, 2019, we completed the acquisition of Hedvig Inc., a Delaware corporation, (“Hedvig”), for a purchase price of $163,205, which consisted of $157,589 of cash, $1,616 of restricted stock units and $4,000 of contingent consideration. In the fourth quarter of fiscal 2020 we reduced our estimate of the contingent consideration to $217. The decrease in this liability was reflected as a gain in the Consolidated Statements of Operations for the year ended March 31, 2020.\nWe also entered into compensation arrangements with the employees of Hedvig. This included the issuance of restricted stock units that vest over the next three years (a portion of which is allocated to the purchase price). Refer to Note 10 of the consolidated financial statements for further discussion on stock awards. Additionally, certain Hedvig shareholders will receive cash payments totaling $14,100 over the course of the 30 months following the date of acquisition, contingent on their continued employment with us. While these payments are proportionate to these shareholders' ownership of Hedvig, under U.S. GAAP they are accounted for as compensation expense over the course of the 30 month service period, and not included in the purchase price.\nThe following table summarizes the purchase price and purchase price allocation made as of the date of acquisition:\nPurchase price allocation:\nCash paid at closing 157,589\nFair value of restricted stock units included in purchase price 1,616\nFair value of contingent consideration 4,000\nTotal purchase price $ 163,205\nAssets acquired and liabilities assumed:\nCash 94\nTrade accounts receivable 1,074\nOther current assets 104\nProperty and equipment 202\nIntangible assets 52,000\nOther assets 682\nAccounts payable and accrued liabilities (1,060)\nDeferred revenue (2,231)\nOperating lease liability, net of operating lease assets (11)\nDeferred tax liability (84)\nTotal identifiable net assets acquired and liabilities assumed 50,770\nGoodwill 112,435\nTotal purchase price $ 163,205\nContingent consideration\nThe contingent consideration arrangement required us to pay up to $8,000 of cash to the former owners of Hedvig, contingent on us receiving one or more bona fide and valid purchase orders from a specified customer, no later than April 30, 2020. At the time the acquisition was completed, the fair value of the contingent consideration was estimated to be $4,000 based on a probability weighted-average approach and was included in the purchase price. As of March 31, 2020, we expected to receive one valid purchase order prior to April 30, 2020 from the specified customer; therefore, the fair value was estimated to be $217 with the revaluation of $3,783 recorded in Net change in contingent consideration in the Consolidated Statements of Operations. As of April 30, 2020, we received the one valid purchase order from the specified customer of $217 which resulted in the release of $7,783 of restricted cash during the first quarter of fiscal year 2021.\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\n5. Goodwill and Intangible Assets, Net\nGoodwill\nThe goodwill of $112,435 arising from the fiscal year 2020 acquisition of Hedvig represents the estimated value of potential expansion with new customers, the opportunity to further develop sales relationships with new customers and intangible assets that do not qualify for separate recognition. None of the goodwill recorded is expected to be deductible for income tax purposes.\nThere were no additions, impairments or any other changes to the carrying amount of goodwill during the fiscal year ended March 31, 2021.\nGoodwill balances are as follows:\nBalance as of March 31, 2020\n$ 112,435\nAdditions/(Impairments) -\nBalance as of March 31, 2021\n$ 112,435\nAs noted below, during the second quarter of fiscal year 2021, we impaired our intangible assets, at which time we assessed the carrying value of goodwill. Based on our assessment, we concluded there was no impairment of goodwill. We also completed our annual impairment review as of January 1, 2021 and concluded there were no impairments to goodwill.\nIntangible assets, net\nIntangible assets subject to amortization as of March 31, 2021 are as follows:\nGross Carrying Amount Accumulated Amortization Impairment Charge Net Carrying Value\nDeveloped technology $ 49,000 $ (9,800) $ (39,200) $ -\nCustomer relationships 3,000 (1,500) (1,500) -\nTotal intangible assets $ 52,000 $ (11,300) $ (40,700) $ -\nAmortization expense from acquired intangible assets was $5,650 for both the fiscal years ended March 31, 2021 and 2020, respectively.\nOur intangible assets (developed technology and customer relationships) were acquired in connection with the Hedvig, Inc. (\"Hedvig\") transaction. The most material of these assets was the developed technology. The value of this asset was attributable to forecasted incremental revenues directly attributable to this technology. While we have successfully integrated this technology into our existing HyperScale X technology, we have not met our forecasts for standalone sales of this acquired technology. During the second quarter of fiscal year 2021 we identified an indicator of impairment and concluded that the carrying values of the developed technology and customer relationships acquired in connection with the Hedvig transaction were not recoverable on an undiscounted basis. As a result, we remeasured the fair value of these assets and concluded their value was de minimis. We recorded a $40,700 impairment charge in the accompanying Consolidated Statements of Operations for the year ended March 31, 2021. These non-recurring fair value measurements were categorized as Level 3, as significant unobservable inputs were used in the valuation analysis. Key assumptions used in the valuation include forecasts of revenue and expenses over an extended period, the useful life of the asset, tax rates, and estimated costs of debt and equity capital to discount the projected cash flows. Certain of these assumptions involve significant judgment and are based on management’s estimate of current and forecasted market conditions.\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\n6. Property and Equipment\nProperty and equipment consist of the following:\nMarch 31,\n2021 2020\nLand $ 9,445 $ 9,445\nBuildings 103,244 103,244\nComputers, servers and other equipment 42,117 40,044\nFurniture and fixtures 14,689 14,919\nLeasehold improvements 8,089 9,252\nPurchased software 1,955 1,637\nConstruction in process 4,304 2,021\n183,843 180,562\nLess: Accumulated depreciation and amortization (71,064) (66,043)\n$ 112,779 $ 114,519\nWe recorded depreciation and amortization expense of $10,228, $11,415, and $12,060 for the years ended 2021, 2020 and 2019, respectively. Approximately $1,250 of depreciation expense is allocated to our cost of goods sold for the years ended 2021, 2020 and 2019.\n7. Accrued Liabilities\nAccrued liabilities consist of the following:\nMarch 31,\n2021 2020\nCompensation and related payroll taxes $ 69,890 $ 47,356\nOther 42,258 39,695\n$ 112,148 $ 87,051\n8. Commitments and Contingencies\nPurchase Commitments\nWe, in the normal course of business, enter into various purchase commitments for goods or services. Total non-cancellable purchase commitments as of March 31, 2021, which relate primarily to marketing and IT services are as follows:\n2022 2023 2024 2025 and beyond Total\nPurchase commitments $ 23,339 $ 5,266 $ 804 $ 591 $ 30,000\nWe have certain software royalty commitments associated with the shipment and licensing of certain products. Royalty expense is generally based on a fixed cost per unit shipped or a fixed fee for unlimited units shipped over a designated period. Royalty expense, included in Cost of software and products revenues, was as follows:\nYear Ended March 31,\n2021 2020 2019\nRoyalty expense $ 16,256 $ 12,545 $ 12,319\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\nWarranties and Indemnifications\nWe typically offer a 90-day limited product warranty for our software. To date, costs related to this product warranty have not been material.\nWe provide certain provisions within our software licensing agreements to indemnify our customers from any claim, suit or proceeding arising from alleged or actual intellectual property infringement. These provisions continue in perpetuity, along with our software licensing agreements. We have never incurred a liability relating to one of these indemnification provisions, and management believes that the likelihood of any future payout relating to these provisions is remote. Therefore, we have not recorded a liability during any period for these indemnification provisions.\nLegal Proceedings\nFrom time to time, we are subject to claims in legal proceedings arising in the normal course of business. On February 9, 2021, Rubrik, Inc. filed a patent-infringement lawsuit against Commvault Systems, Inc. in the United States District Court for the Western District of Texas - Waco Division. Rubrik asserts U.S. Patents 10,852,998, 10,133,495 and 9,075,773. Due to the inherent uncertainties of litigation, we cannot accurately predict the ultimate timing or outcome of this matter. We are unable at this time to determine whether the outcome of the litigation will have a material impact on our results of operations, financial condition, or cash flows. We believe that Rubrik’s claims are without merit, and we intend to vigorously contest them.\nWe do not believe that we are currently party to any other pending legal action that could reasonably be expected to have a material adverse effect on our business or operating results. See Risk Factors \"Protection of our intellectual property is limited, and any misuse of our intellectual property by others could materially adverse our sales and results of operations\" for additional information.\n9. Capitalization\nCommon Stock\nWe have 46,482 and 46,011 shares of common stock, par value $0.01, outstanding at March 31, 2021 and March 31, 2020, respectively.\nDuring fiscal 2021, we repurchased $95,259 of common stock, or 1,643 shares, under our share repurchase program. Our stock repurchase program has been funded by our existing cash and cash equivalent balances as well as cash flows provided by our operations. Our Board has approved, and we intend to execute, a capital allocation policy that provides for the repurchase of $200,000 of our common stock for the period from February 1, 2021 through the end of our 2022 fiscal year, plus the use of approximately 75% of our free cash flow for additional repurchases during fiscal year 2022. From February 1, 2021 through March 31, 2021 we repurchased $62,127 of our common stock.\nShares Reserved for Issuance\nAt March 31, 2021, we have reserved 5,075 shares in connection with our Stock Plans discussed in Note 10 of the notes to the consolidated financial statements.\n10. Stock Plans\nWe maintain the Omnibus Incentive Plan (the “2016 Incentive Plan”) for granting awards to employees. On October 22, 2020, our shareholders approved an amendment to the 2016 Incentive Plan to increase the maximum number of shares of common stock that may be delivered under plan to 8,050, an increase of 1,000 shares. The 2016 Incentive Plan authorizes a broad range of awards including stock options, stock appreciation rights, full value awards (including restricted stock, restricted stock units, performance shares or units and other stock-based awards) and cash-based awards.\nIn consideration for the acquisition of Hedvig, we issued a total of 1,018 restricted stock units to Hedvig employees in the third quarter of fiscal 2020. These awards were granted at a fair value of $44.49 per share. These awards were granted as inducement grants under our 2016 Omnibus Incentive Plan, and therefore are not counted against the equity available for grant under such plan.\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\nWe have one additional plan, the 2006 Long-Term Stock Incentive Plan (the “LTIP”), with outstanding options and awards but the LTIP cannot be used for future grants.\nThe 2016 Incentive Plan permits the grant of incentive stock options, non-qualified stock options, restricted stock awards, restricted stock units, stock appreciation rights, performance stock awards and stock unit awards based on, or related to, shares of our common stock. As of March 31, 2021, approximately 2,110 shares were available for future issuance under the 2016 Incentive Plan.\nAs of March 31, 2021, we have granted non-qualified stock options, restricted stock units and performance stock awards under our stock incentive plans. Historically, most equity awards granted by us under our stock incentive plans generally vest quarterly over a three-year period, except that the shares that would otherwise vest quarterly over the first twelve months do not vest until the first anniversary of the grant. We anticipate that future grants under our stock incentive plans will be restricted stock units and performance stock awards and do not anticipate that we will grant stock options.\nAs of March 31, 2021, there was approximately $120,658 of unrecognized stock-based compensation expense related to all of our employee stock plans that is expected to be recognized over a weighted-average period of 1.88 years. To the extent the actual forfeiture rate is different from what we have anticipated, stock-based compensation related to these awards will be different from our expectations.\nThe following summarizes the activity for our stock incentive plans from March 31, 2018 to March 31, 2021:\nOptions Number of\nOptions Weighted-\nAverage\nExercise Price Weighted-\nAverage\nRemaining\nContractual\nTerm (Years) Aggregate\nIntrinsic\nValue\nOutstanding at March 31, 2020 1,904 60.03\nOptions granted - -\nOptions exercised (257) 41.68\nOptions forfeited - -\nOptions expired (290) 66.79\nOutstanding at March 31, 2021 1,357 $ 62.06 2.12 $ 13,711\nExercisable at March 31, 2021 1,357 $ 62.06 2.12 $ 13,711\nThe total intrinsic value of options exercised was $4,306, $13,428, and $39,502 in the years ended March 31, 2021, 2020 and 2019, respectively. Our policy is to issue new shares upon exercise of options as we do not hold shares in treasury.\nRestricted stock unit activity is as follows:\nNon-Vested Restricted Stock Units Number\nof\nAwards Weighted-\nAverage\nGrant Date\nFair Value\nNon-vested as of March 31, 2020 3,237 50.47\nGranted 2,096 42.04\nVested (1,585) 51.32\nForfeited (297) 51.76\nNon-vested as of March 31, 2021 3,451 $ 44.90\nThe total fair value of the restricted stock units that vested during the years ended March 31, 2021, 2020 and 2019 was $72,544, $48,221 and $82,957, respectively.\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\nThe following table presents the stock-based compensation expense included in Cost of services revenue, Sales and marketing, Research and development and General and administrative expenses for the years ended March 31, 2021, 2020 and 2019.\nYear Ended March 31,\n2021 2020 2019\nCost of services revenue $ 3,317 $ 2,604 $ 2,922\nSales and marketing 35,577 31,779 34,874\nResearch and development 24,823 14,594 8,601\nGeneral and administrative 18,369 15,158 31,458\nRestructuring 2,747 1,753 2,632\nStock-based compensation expense $ 84,833 $ 65,888 $ 80,487\nAwards with a Market Condition\nIn fiscal 2021, we granted 299 market performance stock units to certain executives. The vesting of these awards is contingent upon us meeting certain total shareholder return (\"TSR\") levels as compared to the Russell 3000 market index over the next three years. The awards vest in three annual tranches and have a maximum potential to vest at 200% (598 shares) and a minimum of 0% (no shares) based on TSR performance. The related stock-based compensation expense is determined based on the estimated fair value of the underlying shares on the date of grant and is recognized using the accelerated method over the vesting term. The estimated fair value was calculated using a Monte Carlo simulation model. The weighted-average fair value of the awards granted during the year was $36.76 per share, which approximated the market value of a share of stock at the time of grant. The awards are included in the restricted stock unit table above.\nIn fiscal 2020, we granted 95 market performance stock units to certain executives. The vesting of these awards is contingent upon us meeting certain total shareholder return (\"TSR\") levels as compared to a market index over the succeeding three years. The awards vest in three annual tranches and have a maximum potential to vest at 200% (190 shares) and a minimum of 0% (no shares) based on TSR performance. The related stock-based compensation expense is determined based on the estimated fair value of the underlying shares on the date of grant and is recognized using the accelerated method over the vesting term. The estimated fair value is calculated using a Monte Carlo simulation model. The weighted-average fair value of the awards granted was $48.26 per share. The awards are included in the restricted stock unit table above.\nPerformance Based Awards\nIn May 2019, we granted 88 performance stock units (\"PSUs\") to certain executives and in November 2019, we granted an additional 17 PSUs to certain executives for a total of 105 granted PSUs for fiscal 2020. Vesting of these awards is contingent upon i) us meeting certain company-wide revenue and non-GAAP performance goals (performance-based) in fiscal 2020 and ii) our customary service periods. The awards vest in three annual tranches and have a maximum potential to vest at 200% (210 shares) based on actual fiscal 2020 performance. The related stock-based compensation expense is determined based on the value of the underlying shares on the date of grant and is recognized over the vesting term using the accelerated method. During each financial period, management estimates the probable number of PSUs that would vest until the ultimate achievement of the performance goals is known. Based on our results, the PSUs granted in May 2019 will be eligible to vest at 0% and the PSUs granted in November 2019 will be eligible to vest at 46%. The awards are included in the restricted stock units table.\nThere were no performance stock units granted during fiscal 2021.\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\nEmployee Stock Purchase Plan\nThe Employee Stock Purchase Plan (the “Purchase Plan”) is a shareholder approved plan under which substantially all employees may purchase our common stock through payroll deductions at a price equal to 85% of the lower of the fair market values of the stock as of the beginning or the end of six-month offering periods. An employee’s payroll deductions under the Purchase Plan are limited to 10% of the employee’s salary and employees may not purchase more than $25 of stock during any calendar year. Employees purchased 272 shares in exchange for $9,812 of proceeds in fiscal 2021 and 273 shares in exchange for $9,670 of proceeds in fiscal 2020. The Purchase Plan is considered compensatory and the fair value of the discount and look back provision are estimated using the Black-Scholes formula and recognized over the six-month withholding period prior to purchase. The total expense associated with the Purchase Plan for fiscal 2021, 2020 and 2019 was $3,417, $2,939 and $3,080, respectively. As of March 31, 2021, there was approximately $1,139 of unrecognized cost related to the current purchase period of our Purchase Plan.\nImpact on Stock Compensation Expense for Changes in Senior Leadership\nDuring fiscal 2019, Commvault’s Chief Executive Officer, N. Robert Hammer, announced his retirement effective February 1, 2019. As part of his retirement, we modified his equity awards to allow for continued vesting of his restricted stock awards and performance based awards. We also increased the timeframe for which his stock options shall remain exercisable to their original ten years expiration date and not thirty days from his last date of employment. The expense related to these modifications was $12,157 for the year ended March 31, 2019.\n11. Income Taxes\nImpact of U.S. CARES Act 2020\nIn response to the COVID-19 Pandemic, many governments implemented measures to provide aid and economic stimulus in the form of tax incentives. On March 27, 2020, President Trump signed into law the Coronavirus Aid, Relief, and Economic Security (“CARES”) Act. The CARES Act includes several significant business tax provisions as well as relief for individual taxpayers. The CARES Act modified the tax rules related to net operating loss (\"NOL\") uses. In the fourth quarter of fiscal 2020, we recorded a current tax benefit of approximately $10.0 million which represented our estimate of the net operating loss carryback resulting from the CARES Act. In the first quarter of fiscal 2021, we recorded an adjustment of $3.2 million to reduce the current benefit of the net operating loss carryback benefit we realized from the CARES Act.\nImpact of U.S. Tax Reform 2017\nThe Tax Cuts and Jobs Act (the \"Act\") was enacted on December 22, 2017. The Act reduces the US federal corporate tax rate from 35% to 21%, required companies to pay a one-time transition tax on earnings of certain foreign subsidiaries that were previously tax deferred and created new taxes on certain foreign sourced earnings. The most significant impact of the legislation for the Company was the reduction of the value of the Company's net deferred tax assets (which represent future tax benefits) as a result of lowering the U.S. corporate income tax rate from 35% to 21%. The Act also included a requirement to pay a one-time transition tax on the cumulative value of earnings and profits that were previously not repatriated for U.S. income tax purposes. We have concluded that the one-time transition tax is zero. In addition, we no longer consider the undistributed earnings held outside of the U.S. by most of its foreign subsidiaries to be indefinitely reinvested.\nThe Act subjects a U.S. shareholder to tax on Global Intangible Low-Taxed Income (\"GILTI\") earned by certain foreign subsidiaries. The FASB Staff Q&A, Topic 740, No. 5, Accounting for GILTI, states that an entity can make an accounting policy election to either recognize deferred taxes for temporary basis differences expected to reverse as GILTI in future years or to provide for the tax expense related to GILTI in the year the tax is incurred as a period expense only. Because the Company was evaluating the provisions of GILTI as of the fiscal year ended March 31, 2018, it recorded no GILTI-related deferred amounts in the financial statements for the year ended March 31, 2018. After further consideration, the Company has elected to account for GILTI in the year the tax is incurred, and has recorded an estimate of GILTI as a component of the projected tax provision for the fiscal years ending March 31, 2021, 2020 and 2019.\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\nValuation Allowance\nNet deferred tax assets arise due to the recognition of income and expense items for tax purposes, which differ from those used for financial statement purposes. ASC 740, Income Taxes, provides for the recognition of deferred tax assets if realization of such assets is more likely than not. In assessing the need for a valuation allowance, we considered all available objective and verifiable evidence both positive and negative, including historical levels of pre-tax income (loss) both on a consolidated basis and tax reporting entity basis, legislative developments, expectations and risks associated with estimates of future pre-tax income, and prudent and feasible tax planning strategies. As a result of this analysis, we determined that it is more likely than not that we will not realize the benefits of our gross deferred tax assets and therefore have recorded a valuation allowance to reduce the carrying value of these gross deferred tax assets, net of the impact of the reversal of taxable temporary differences.\nThe components of income (loss) before income taxes were as follows:\nYear Ended March 31,\n2021 2020 2019\nDomestic $ (28,628) $ (16,670) $ (1,762)\nForeign 7,393 4,124 12,189\n$ (21,235) $ (12,546) $ 10,427\nThe components of income tax expense (benefit) were as follows:\nYear Ended March 31,\n2021 2020 2019\nCurrent:\nFederal $ 3,399 $ (10,071) $ (1,772)\nState 196 (613) 103\nForeign 6,215 5,566 8,371\nDeferred:\nFederal (113) 284 144\nState - - -\nForeign 22 (2,067) 20\n$ 9,719 $ (6,901) $ 6,866\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\nA reconciliation of the statutory tax rates and the effective tax rates for the years ended March 31, 2021, 2020 and 2019 are as follows:\nYear Ended March 31,\n2021 2020 2019\nStatutory federal income tax expense (benefit) rate (21.0) % (21.0) % 21.0 %\nState and local income tax expense, net of federal income tax effect 0.9 % (4.9) % 1.0 %\nForeign earnings taxed at different rates 10.0 % 12.3 % 25.5 %\nU.S. tax on Global Intangible Low-Taxed Income 1.8 % 14.5 % 72.9 %\nDomestic permanent differences including acquisition items 1.7 % 7.7 % 7.8 %\nForeign tax credits (7.8) % (19.3) % (22.4) %\nResearch credits (68.6) % (32.9) % (51.8) %\nTax reserves (0.1) % (0.6) % (5.2) %\nValuation allowance 74.4 % 64.0 % (76.7) %\nEnacted tax law changes - % 10.6 % (7.8) %\nStock-based compensation 36.3 % (43.1) % 97.2 %\nCARES Act Impact 15.0 % (82.1) % - %\nReduction of NOL for carryback - % 59.2 % - %\nOther differences, net 3.2 % (19.4) % 4.3 %\nEffective income tax expense (benefit) 45.8 % (55.0) % 65.8 %\nThe significant components of our deferred tax assets are as follows:\nMarch 31,\n2021 2020\nDeferred tax assets:\nNet operating losses $ 12,586 $ 16,075\nEquity investment 1,193 1,192\nStock-based compensation 16,280 20,792\nDeferred revenue 14,879 16,027\nTax credits 39,062 24,936\nAccrued expenses 3,568 4,675\nAllowance for doubtful accounts and other reserves 801 546\nLess: valuation allowance (78,339) (61,702)\nTotal deferred tax assets 10,030 22,541\nDeferred tax liabilities:\nDepreciation and amortization (4,553) (16,349)\nDeferred commissions and other (6,238) (7,041)\nTotal deferred tax liabilities $ (10,791) $ (23,390)\nNet deferred tax liability $ (761) $ (849)\nDuring fiscal 2019, the Company could no longer assert that it had the intent to indefinitely reinvest the earnings and profits of the foreign subsidiaries, with the exception of India. Accordingly, the Company was required to adjust its deferred tax liability for the effects of this change in assertion. This effect was not significant. Our position during fiscal 2021 remains unchanged.\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\nAt March 31, 2021, we had NOL carry forwards of $47,976. There are $22,061 NOLs that will expire between 2034 and 2036 and $25,915 NOLs that will not expire. As of March 31, 2021, we had deferred tax assets related to state NOL carry forwards of $1,779 which expire over various years beginning in 2030 depending on the jurisdiction.\nWe also had federal and state research tax credits (\"R&D credit\") carryforwards of approximately $27,828 and $13,743, respectively. The federal R&D credit carryforwards expire from 2034 through 2041, and the state R&D credit carryforwards expire from 2022 through 2036.\nWe conduct business globally and as a result, file income tax returns in the United States and in various state and foreign jurisdictions. In the normal course of business, we are subject to examination by taxing authorities throughout the world. The following table summarizes the tax years subject to income tax examinations by tax authorities as of March 31, 2021. The years subject to income tax examination in our foreign jurisdictions cover the maximum time period with respect to these jurisdictions. Due to NOLs, in some cases the tax years continue to remain subject to examination with respect to such NOLs.\nTax Jurisdiction Years Subject to Income\nTax Examination\nU.S. Federal 2017 - Present\nForeign jurisdictions 2013 - Present\nThe calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax regulations in each of our tax jurisdictions. The number of years with open tax audits varies depending on the tax jurisdiction. A number of years may lapse before a particular matter is audited and finally resolved. A reconciliation of the amounts of unrecognized tax benefits is as follows:\nBalance at March 31, 2018 $ 1,740\nAdditions for tax positions related to fiscal 2019 -\nAdditions for tax positions related to prior years 547\nSettlements and effective settlements with tax authorities and remeasurements -\nReductions related to the expiration of statutes of limitations (695)\nForeign currency translation adjustment -\nBalance at March 31, 2019 1,592\nAdditions for tax positions related to fiscal 2020 170\nAdditions for tax positions related to prior years -\nSettlements and effective settlements with tax authorities and remeasurements -\nReductions related to the expiration of statutes of limitations (100)\nForeign currency translation adjustment -\nBalance at March 31, 2020 1,662\nAdditions for tax positions related to fiscal 2021 614\nAdditions for tax positions related to prior years -\nSettlements and effective settlements with tax authorities and remeasurements -\nReductions related to the expiration of statutes of limitations (65)\nForeign currency translation adjustment -\nBalance at March 31, 2021 2,211\nWe estimate that no significant remaining unrecognized tax benefits will be realized during the fiscal year ending March 31, 2022. Interest and penalties related to unrecognized tax benefits are recorded in Income tax expense. In the years ended March 31, 2021, 2020 and 2019, we recognized $9, $6 and $40, respectively, of net interest and penalties in the Consolidated Statements of Operations.\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\n12. Employee Benefit Plan\nWe have a defined contribution plan, as allowed under Section 401(k) of the Internal Revenue Code, covering substantially all employees. Effective January 1, 2012, we make contributions equal to a discretionary percentage of the employee’s contributions determined by us. During the years ended March 31, 2021, 2020 and 2019, we made contributions of $2,445, $2,487, and $2,786, respectively.\n13. Segment Information\nWe operate in one segment. Our products and services are sold throughout the world, through direct and indirect sales channels. Our chief operating decision maker (the “CODM”) is the Chief Executive Officer. The CODM makes operating performance assessment and resource allocation decisions on a global basis. The CODM does not receive discrete financial information about asset allocation, expense allocation or profitability by product or geography.\nRevenues by geography are based upon the billing address of the customer. All transfers between geographic regions have been eliminated from consolidated revenues. The following table sets forth revenue and long-lived assets by geographic area:\nYear Ended March 31,\n2021 2020 2019\nRevenue:\nUnited States $ 379,106 $ 342,660 $ 379,221\nOther 344,366 328,225 331,736\n$ 723,472 $ 670,885 $ 710,957\nNo individual country other than the United States accounts for 10% or more of revenues in the years ended March 31, 2021, 2020 and 2019. Revenue included in the “Other” caption above primarily relates to our operations in Europe, Australia, Canada and Asia.\nMarch 31,\n2021 2020\nLong-lived assets:\nUnited States $ 248,386 $ 300,662\nOther 48,187 30,728\n$ 296,573 $ 331,390\nAt March 31, 2021 and 2020 no other individual country, other than the United States, accounts for 10% or more of long-lived assets.\n14. Restructuring\nOur restructuring plan, initiated in the first quarter of fiscal 2019, is aimed to increase efficiency in our sales, marketing and distribution functions as well as reduce costs across all functional areas. These restructuring charges relate primarily to severance and related costs associated with headcount reductions, stock-based compensation related to modifications of existing unvested awards granted to certain employees impacted by the restructuring plan and lease abandonment charges.\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\nFor the years ended March 31, 2021, 2020 and 2019, restructuring charges were comprised of the following:\nYear Ended March 31,\n2021 2020 2019\nEmployee severance and related costs $ 19,040 $ 16,834 $ 12,133\nLease impairments related costs (1)\n1,684 2,761 -\nStock-based compensation 2,747 1,753 2,632\nTotal restructuring charges $ 23,471 $ 21,348 $ 14,765\n(1) Lease impairment charges relate to seven and six offices for the years ended March 31, 2021 and 2020, respectively. There were no lease impairment charges for the year ended March 31, 2019.\nRestructuring accrual\nThe activity in our restructuring accrual for the years ended March 31, 2021 and 2020 is as follows:\nYear Ended March 31,\n2021 2020\nBeginning balance $ 2,531 $ 1,089\nEmployee severance and related costs 19,040 16,834\nPayments (18,476) (15,392)\nEnding balance $ 3,095 $ 2,531\n15. Leases\nIn February 2016, the Financial Accounting Standards Board (“FASB”) issued accounting standards update ASU No. 2016-02, Leases. Under the new guidance, we recognized lease liabilities and right-of-use assets for our long-term leases. We adopted the new guidance on April 1, 2019 using the optional transition method, which allows for the prospective application of the standard, and as a result, we did not record an adjustment to retained earnings. In addition, we elected the package of practical expedients, for all of its leases, permitted under the transition guidance within the standard, which allowed us to carry forward our historical lease classification, to not reassess prior conclusions related to initial direct costs and to not reassess whether any expired or existing contracts are or contain leases. We also elected the lessee practical expedient to combine lease and non-lease components for new leases and modified leases. We also made an accounting policy election in accordance with the new standard to apply accounting similar to ASC 840 to short-term leases, which are defined as leases that have a term of 12 months or less.\nOur lease liabilities relate primarily to operating leases for our global office infrastructure. These operating leases expire at various dates through fiscal 2031. We did not have any finance leases for either the years ended March 31, 2021 or 2020.\nNet lease cost recognized in our Consolidated Statements of Operations is summarized as follows:\nCommvault Systems, Inc.\nNotes to Consolidated Financial Statements - (Continued)\n(In thousands, except per share data)\nYear Ended March 31,\n2021 2020\nOperating lease cost $ 9,048 $ 8,795\nShort-term lease cost 232 410\nVariable lease cost 1,938 2,088\nNet lease cost $ 11,218 $ 11,293\nDisclosures related to periods prior to the adoption of the new lease standard\nRental expense was $11,474 for the year ended March 31, 2019.\nCash flow information\nYear Ended March 31,\n2021 2020\nCash paid for operating lease liabilities $ 10,370 $ 9,476\nAdditions of operating lease assets $ 17,603 $ 8,448\nAs of March 31, 2021, the minimum lease commitment amount for operating leases signed but not yet commenced, was immaterial.\nAs of March 31, 2021, the maturities of lease liabilities based on the total minimum lease commitment amount including options to extend lease terms that are reasonably certain of being exercised are as follows:\n2022 $ 7,526\n2023 4,816\n2024 4,071\n2025 3,978\n2026 2,143\nThereafter 2,535\nTotal Minimum Lease Payments $ 25,069\nLess: Imputed Interest (2,181)\nPresent value of operating lease liabilities $ 22,888\nLess: Current Portion of operating lease liabilities 7,469\nLong-term operating lease liabilities $ 15,419\nThe weighted-average discount rate was 4% for operating leases recognized in the Consolidated Balance Sheets for both the years ended March 31, 2021 and 2020. The weighted-average remaining operating lease term was 4.43 years and 3.09 years for the years ended March 31, 2021 and 2020, respectively.",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A. Controls and Procedures\n(a)Evaluation of Disclosure Controls and Procedures\nOur management, with the participation of the Chief Executive Officer and Chief Financial Officer, has evaluated the effectiveness of our disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) of the Securities Exchange Act of 1934, as of March 31, 2021. Based on that evaluation, the Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were effective as of March 31, 2021.\n(b)Management’s Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over our financial reporting as defined in Rules 13a-15(f) of the Exchange Act. There are inherent limitations in the effectiveness of any internal control, including the possibility of human error and the circumvention or overriding of controls. Accordingly, even an effective internal control can provide only reasonable assurance with respect to financial statement preparation. Further, because of changes in conditions, the effectiveness of any internal control may vary over time.\nOur management, with the participation of our principal executive officer and principal financial officer, has evaluated the effectiveness of our internal control over financial reporting as of March 31, 2021. In making this assessment, management used the framework set forth by the Committee of Sponsoring Organizations of the Treadway Commission (\"COSO\") in the 2013 Internal Control-Integrated Framework.\nBased on our assessment, using those criteria, our management concluded that, as of March 31, 2021, our internal control over financial reporting was effective. The effectiveness of our internal control over financial reporting as of March 31, 2021 has been audited by Ernst & Young LLP, our independent registered public accounting firm, as stated in their report, which is included below in this Annual Report on Form 10-K.\n(c)Changes in Internal Control over Financial Reporting\nThere was no change in our internal control over financial reporting that occurred during the fourth quarter of fiscal 2021 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Stockholders of Commvault Systems, Inc.\nOpinion on Internal Control over Financial Reporting\nWe have audited Commvault Systems, Inc.’s internal control over financial reporting as of March 31, 2021, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Commvault Systems, Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of March 31, 2021, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of March 31, 2021 and 2020, the related consolidated statements of operations, comprehensive loss, stockholders' equity and cash flows for each of the three years in the period ended March 31, 2021, and the related notes and financial statement schedule listed in the Index at Item 15 and our report dated May 13, 2021 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nIselin, New Jersey\nMay 13, 2021",
    "item_9B": "Item 9B. Other Information\nNone.\nPART III",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nWe will furnish to the SEC a definitive Proxy Statement not later than 120 days after the close of the fiscal year ended March 31, 2021. Information with respect to this Item is incorporated herein by reference from the sections of our 2021 Proxy Statement captioned, “Our Board of Directors” and “Corporate Governance”.\nOur Board of Directors has adopted a code of business ethics and conduct, which applies to all of our employees. The code of business ethics and conduct is in addition to our code of ethics for senior financial officers. The full texts of our code of business ethics and conduct and our code of ethics for senior financial officers can be found on our website, www.commvault.com.",
    "item_11": "Item 11. Executive Compensation\nInformation with respect to this Item is incorporated herein by reference from the sections of our 2021 Proxy Statement captioned “Executive Compensation” and \"Compensation Committee Report\".",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nInformation with respect to this Item is incorporated herein by reference from the section of our 2021 Proxy Statement captioned “Security Ownership of Certain Beneficial Ownership and Management”.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe following table provides information as of March 31, 2021 with respect to the shares of our common stock that may be issuable upon the exercise of options, warrants and rights under or existing equity compensation plans. The following information is as of March 31, 2021:\nNumber of Securities\nto be Issued Upon Exercise of\nOutstanding Options,\nWarrants and Rights\n(a) Weighted-Average\nExercise Price of\nOutstanding\nOptions, Warrants\nand Rights\n(b) Number of Securities\nRemaining Available for\nFuture Issuance Under Equity\nCompensation Plans\n(Excluding\nSecurities Reflected in\nColumn (a))\n(c)\nEquity compensation plans approved by security holders (1) 4,808,433 $ 49.74 2,110,398\nEquity compensation plans not approved by security holder - - -\nTotals 4,808,433 $ 49.74 2,110,398\n(1)Consists of shares of common stock to be issued upon exercise of outstanding options and vesting of restricted stock awards under our Omnibus Incentive Plan. These amounts do not include potentially issuable shares under the Employee Stock Purchase Plan. We have reserved 2,965 thousand shares for the future issuance of shares under the Employee Stock Purchase Plan.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nInformation with respect to this Item is incorporated herein by reference from the sections of our 2021 Proxy Statement captioned “Transactions with Related Persons”, \"Corporate Governance - Independence and Composition of our Board of Directors\" and \"Corporate Governance - The Board of Directors and Its Committees-General\".",
    "item_14": "Item 14. Principal Accountant Fees and Services\nInformation with respect to this Item is incorporated herein by reference from the section of our 2021 Proxy Statement captioned “Ratification of the Appointment of Independent Auditors - Audit, Audit-related, Tax and All Other Fees”.\nPART IV",
    "item_15": "Item 15. Exhibits and Financial Statement Schedules\nFinancial Statements\nSee “Index to Consolidated Financial Statements” set forth in Item 8 for a list of financial statements filed as part of this report.\nFinancial Statement Schedules\nThe following financial statement schedule should be read in conjunction with the Consolidated Financial Statements set forth in Item 8 and appears below:\nSchedule II - Valuation and Qualifying Accounts for the years ended March 31, 2019, 2020 and 2021.\nAll other schedules are omitted because they are not required or the required information is shown in the financial statements or notes thereto.\nSchedule II - Valuation and Qualifying Accounts\nAdditions\nBalance at\nBeginning of\nYear Charged\n(Credited) to\nCosts and\nExpenses Charged to Other Accounts Write-offs/Deductions Balance at\nEnd of\nYear\n(In thousands)\nYear Ended March 31, 2019\nAllowance for doubtful accounts $ 104 $ 569 $ - $ (184) $ 489\nValuation allowance for deferred taxes $ 58,350 $ (8,190) $ - $ - $ 50,160\nYear Ended March 31, 2020\nAllowance for doubtful accounts $ 489 $ (246) $ - $ (121) $ 122\nValuation allowance for deferred taxes $ 50,160 $ 11,542 $ - $ - $ 61,702\nYear Ended March 31, 2021\nAllowance for doubtful accounts $ 122 $ 333 $ 84 $ (56) $ 483\nValuation allowance for deferred taxes $ 61,702 $ 16,637 $ - $ - $ 78,339\nExhibits\nThe following exhibits are incorporated by reference or filed herewith.\nExhibit No. Description\n3.1\nAmended and Restated Certificate of Incorporation of Commvault Systems, Inc., as amended (Incorporated by reference to Exhibit 3.1 to the Registrant’s Form 10-Q for the quarter ended September 30, 2019).\n3.2\nCertificate of Amendment of Amended and Restated Certificate of Incorporation of Commvault Systems, Inc. (Incorporated by reference to Exhibit 3.1 to the Registrant's Form 8-K dated August 28, 2020).\n3.3\nAmended and Restated Bylaws of Commvault Systems, Inc. (Incorporated by reference to Exhibit 3.2 to the Registrant’s Form 8-K dated August 28, 2020).\n3.4\nCertification of Designation of Series A Junior Participating Preferred Stock of Commvault Systems, Inc. (Incorporated by reference to Exhibit 3.1 to the Registrant’s Form 8-K dated November 14, 2008).\n4.1\nForm of Common Stock Certificate (Incorporated by reference to Exhibit 4.1 to the Registrant’s Registration Statement on Form S-1, Commission File No. 333-132550).\n4.2\nRights Agreement between Commvault Systems, Inc. and Computershare Trust Company, N.A. (Incorporated by reference to Exhibit 4.1 to the Registrant’s Form 8-K dated April 6, 2020).\n4.3\nAmendment No. 1 to Rights Agreement, dated as of November 16, 2020, by and between Commvault Systems, Inc. and Computershare Trust Company, N.A. as rights agent (Incorporated by reference to Exhibit 4.1 to the Registrant’s Form 8-K dated November 16, 2020).\n4.4\nDescription of Securities\n9.1\nForm of Voting Trust Agreement (Incorporated by reference to Exhibit 9.1 to the Registrant’s Registration Statement on Form S-1, Commission File No. 333-132550).\n10.1*\nForm of Non-Qualified Stock Option Agreement (Incorporated by reference to Exhibit 10.4 to the Registrant’s Registration Statement on Form S-1, Commission File No. 333-132550).\n10.2*\nForm of Restricted Stock Unit Agreement (Incorporated by reference to Exhibit 10.5 to the Registrant’s Annual Report on Form 10-K for the year ended March 31, 2007).\n10.3*\nEmployment Agreement, dated as of February 1, 2004, between Commvault Systems, Inc. and N. Robert Hammer (Incorporated by reference to Exhibit 10.5 to the Registrant’s Registration Statement on Form S-1, Commission File No. 333-132550).\n10.4*\nForm of Employment Agreement between Commvault Systems, Inc. and Alan G. Bunte and Louis F. Miceli (Incorporated by reference to Exhibit 10.6 to the Registrant’s Registration Statement on Form S-1, Commission File No. 333-132550).\n10.5*\nForm of Corporate Change of Control Agreement between Commvault Systems, Inc. and Alan G. Bunte and Louis F. Miceli (Incorporated by reference to Exhibit 10.7 to the Registrant’s Registration Statement on Form S-1, Commission File No. 333-132550).\n10.6*\nForm of Corporate Change of Control Agreement between Commvault Systems, Inc. and Brian Carolan, and Ron Miiller (Incorporated by reference to Exhibit 10.8 to the Registrant’s Registration Statement on Form S-1, Commission File No. 333-132550).\n10.7*\nForm of Indemnity Agreement between Commvault Systems, Inc. and each of its current officers and directors (Incorporated by reference to Exhibit 10.9 to the Registrant’s Registration Statement on Form S-1, Commission File No. 333-132550).\n10.8*\nCommvault Systems, Inc. Employee Stock Purchase Plan dated December 9, 2013 (Incorporated by reference to Exhibit 10.10 to the Registrant’s Annual Report on Form 10-K for the year ended March 31, 2014).\n10.9*\nThe Commvault Systems, Inc. Omnibus Incentive Plan (As Amended Through the Fourth Amendment Thereof) (Incorporated by reference to Exhibit 10.1 to the Registrant’s Form 10-Q for the quarter ended September 30, 2020)\n10.10\nAgreement, dated as of June 7, 2020, by and among Commvault Systems, Inc., Starboard Value LP and the other parties set forth therein (Incorporated by reference to Exhibit 10.1 of Commvault Systems, inc. Form 8-K dated June 8, 2020).\n10.11\nLetter Agreement, by and among Commvault Systems, Inc., Elliott Associates, L.P., Elliott International, L.P. and Elliott International Capital Advisors Inc., dated April 30, 2018. (Incorporated by reference to Exhibit 10.1 to the Registrant’s Form 8-K dated April 30, 2018)\n10.12*\nEmployment Agreement, dated January 8, 2019, between the Company and Sanjay Mirchandani. (Incorporated by reference to Exhibit 10.1 to the Registrant’s Form 8-K dated February 5, 2019)\n10.13*\nAgreement and General Release, dated February 1, 2019, between the Company and N. Robert Hammer. (Incorporated by reference to Exhibit 10.2 to the Registrant’s Form 8-K dated February 5, 2019)\n10.14*\nExecutive Retention and Severance Agreement, dated March 5, 2019, between Commvault Systems, Inc. and Alan Bunte (Incorporated by reference to Exhibit 10.1 to the Registrant’s Form 8-K dated February 1, 2019)\n* Management contract or compensatory plan or arrangement.\nExhibit No. Description\n10.15*\nExecutive Retention and Severance Agreement, dated April 1, 2019, between Commvault Systems, Inc. and Jay Whalen (Incorporated by reference to Exhibit 10.1 to the Registrant’s Form 8-K dated March 31, 2019)\n21.1\nList of Subsidiaries of Commvault Systems, Inc.\n23.1\nConsent of Ernst & Young LLP\n31.1\nCertification of Chief Executive Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2\nCertification of Chief Financial Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1\nCertification of Chief Executive Officer Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2\nCertification of Chief Financial Officer Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS XBRL Instance Document\n101.SCH XBRL Taxonomy Extension Schema Document\n101.CAL XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB XBRL Taxonomy Extension Label Linkbase Document\n101.PRE XBRL Taxonomy Extension Presentation Linkbase Document\n104 Cover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, in the city of Tinton Falls, State of New Jersey, on May 13, 2021.\nCOMMVAULT SYSTEMS, INC.\nBy: /s/ SANJAY MIRCHANDANI\nSanjay Mirchandani\nDirector, President and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed by the following persons on behalf of the registrant and in the capacities indicated on May 13, 2021.\nSignature Title\n/s/ SANJAY MIRCHANDANI Director, President and Chief Executive Officer\nSanjay Mirchandani\n/s/ BRIAN CAROLAN Vice President, Chief Financial Officer\nBrian Carolan\n/s/ JAMES WHALEN Vice President, Chief Accounting Officer\nJames Whalen\n/s/ NICHOLAS ADAMO Chairman of the Board\nNicholas Adamo\n/s/ MARTHA H. BEJAR Director\nMartha H. Bejar\n/s/ R. TODD BRADLEY Director\nR. Todd Bradley\n/s/ KEITH GEESLIN Director\nKeith Geeslin\n/s/ VIVIE LEE Director\nVivie Lee\n/s/ CHARLES E. MORAN Director\nCharles E. Moran\n/s/ ALLISON PICKENS Director\nAllison Pickens\n/s/ ARLEN SHENKMAN Director\nArlen Shenkman\n/s/ GARY SMITH Director\nGary Smith\n/s/ DAVID F. WALKER Director\nDavid F. Walker"
}