{
    "cik": "1301991",
    "company": "SmartMetric, Inc.",
    "filing_type": "10-K",
    "filing_date": "2021-10-12",
    "period_of_report": "2021-06-30",
    "sic": "3990",
    "state_of_inc": "NV",
    "state_location": "NV",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1301991/0001829126-21-011870-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1301991/000182912621011870/smartmetric_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1301991/0001829126-21-011870.txt",
    "filename": "1301991_10K_2021_0001829126-21-011870.htm",
    "item_1": "Item 1. Business\nCorporate History and Overview\nSmartMetric, Inc. (“SmartMetric” or the “Company”) is a company that was incorporated pursuant to the laws of Nevada on December 18, 2002 and is engaged in the biometric technology manufacturing industry. SmartMetric has an issued patent covering technology that involves connection to networks using data cards (smart cards and EMV cards). In addition, SmartMetric holds the sole license to five issued patents covering features of its biometric fingerprint activated cards. SmartMetric’s main products are a fingerprint sensor activated payments card for use in the credit and debit card industry. The SmartMetric fingerprint biometric cards have a rechargeable battery allowing for portable biometric identification and card activation prior to being presented to or inserted in, a credit or debit card reader. These cards are herein sometimes referred to as a biometric card or the SmartMetric Biometric Card.\nThe Market for Biometric Credit Cards\nEstimated Market Size\nThe estimated size of the market for biometric credit and debit cards is significant. While the company is not making any projections on the actual size of the market a number of industry figures point to the outsized market size and potential.\nAccording to EMVCo which is a credit card standards body responsible for the licensing and rules governing EMV chips used on today’s credit and debit cards, more than 10 billion EMV chip cards have been issued by banks globally.\nSmartMetric contracted an independent consumer market research company to ascertain the potential consumer demand for a credit card with incorporated fingerprint biometrics. The survey was conducted in the USA and the respondents were Visa credit card users.\nThe result of the consumer research survey is as follows.\n1: Are you concerned about credit card or identity fraud?\nAnswered Yes: 80.1%\n2: Would you pay for a safer biometric secured credit card that has a built-in fingerprint reader for your protection?\nAnswered Yes: 65.5%\n3: What would you prefer to pay for a biometric fingerprint secured safer credit card?\nAnswer 1: $69.95 onetime charge for the life of the card (3 years)\t 60.2%\nAnswer 2: $8.95 per month (includes identity theft insurance)\t 39.7%\nGiven these consumer research results and given the number of credit cards issued by banks, it is a massively large potential market that SmartMetric has developed its product for.\nAll credit and debit cards that are to be issued by a Bank must be tested and approved of by the card brand network that the card is to operate on. Visa, MasterCard, American Express and Diners brands and networks all have their own individual testing and approval procedures. The card brand that SmartMetric is working with published its biometric testing procedures in March of 2021. This caused the company to make changes to its card. Adding its newly invented anti spoofing live fingerprint detection technology to its biometric card.\nThe SmartMetric Biometric Technology and Products\nSmartMetric’s founder, Chaya Hendrick is the originator and inventor of various miniature biometric activated cards, including the SmartMetric biometric fingerprint activated payments card with an embedded fully functional fingerprint reader inside the card. The card is the size and thickness of a standard credit card. The SmartMetric biometric payments card provides for high level security for credit and debit cards by adding biometric authentication and activation to Europay, MasterCard and Visa (“EMV”) chip cards in use around the world. The SmartMetric biometric payments card has been manufactured to be totally interoperable with existing EMV chip card readers, ATMs as well as banking payments infrastructure. Using the advanced electronic miniaturization by SmartMetric to make its biometric credit/debit cards the Company has also created a multi-functional biometric building access control and logical network access card.\nSmartMetric has commenced efforts towards creating a biometric health insurance card with memory for storing a person’s medical files, including medical images. This allows a person to securely take with them their private medical files inside the card when traveling away from home. For the first time, a person’s complete medical files can be stored in a credit card-sized card and the information is only able to be accessed by the card holder’s own fingerprint.\nSmartMetric has developed its rechargeable battery powered fingerprint reader that is of a scale that fits “inside” a standard credit or debit card. The cardholder has stored inside the card his or her fingerprint. To activate the card the person swipes the fingerprint sensor, the sensor is connected to an internal microprocessor that manages the fingerprint sensor, fingerprint image capture and comparison matching with the pre-stored fingerprint of the cardholder held in the internal electronic memory of the card. The card has a surface mounted EMV chip as found on EMV banking chip cards that is activated or turned on only after a card holder’s fingerprint has been scanned and verified using the SmartMetric miniature “in-card” biometric scanner.\nThere are over ten (10) billion EMV chip cards used by banks around the world for credit cards, ATM cards and debit cards according to EMVco. SmartMetric sees this existing user base as a natural market for its advanced biometric activated card technology for the credit and debit card market. SmartMetric has established a network of card manufacturers and technology distributors to market its in-card biometric products to card issuing banks and in the case of the SmartMetric biometric security card, to businesses.\nSmartMetric has also developed a multi-function logical and physical access security card the size and thickness of a standard credit card. Utilizing the small size breakthroughs by the Company in its biometric payments card development, SmartMetric has successfully developed a biometric security card that is the size and thickness of a standard credit card that can easily fit inside a person’s wallet.\nAs with the biometric payments card, the SmartMetric security card has an internal rechargeable battery that is used to power the card’s internal processor used in the biometric fingerprint scan. All functions and operations of the card are subject to a valid fingerprint scan and match of the card user.\nAdditional technological advances have now been made on both the Company’s biometric credit/debit card and its multifunction cyber security, building access biometric card.\nIn Card Fingerprint Matching and Verification\nThe SmartMetric Biometric card incorporates a rechargeable, lithium polymer battery. This battery is rechargeable, very thin and has been designed by SmartMetric to fit inside the SmartMetric fingerprint credit card sized card. This battery is manufactured by a third party unaffiliated with the Company to SmartMetric’s specifications. This battery is embedded inside the card.\nOther components needed for manufacture of the SmartMetric Biometric Card include, but are not limited to, sensors, microchips, memory chips and processor chips. The ultra-thin circuit board developed by SmartMetric has, in total, nearly 200 active and passive components. The sources and availability of these materials are numerous, readily available and should not affect the ability of SmartMetric to meet future demand. The supply of memory processors and passive components may be interrupted at any time based on global supply/demand issues. We have not experienced component supply issues to date and the Company, as a matter of policy, has alternative component sources to mitigate and protect against supply chain issues.\nThe biometric card has been designed to offer the option of a built-in radio frequency transmitter for contactless access and identity verification. The RFID contactless chip transmission is turned on using the card users fingerprint verification.\nThe thinness form factor of many of the components, has also resulted in the Company having to develop its own process for high volume electronic assembly. The Company has also successfully overcome the challenge of developing a process of encapsulating the electronics in plastic to create the credit card sized biometric fingerprint activated card that also has an internal rechargeable battery.\nStandard credit card manufacturing utilizes machines that require high pressure and high temperature in fusing top and bottom sheets of plastic together thereby encasing any electronics inside the card. Given the complexity of the card’s electronics and vulnerability to an assembly process involving high heat and high pressure, damage to the electronic circuitry was a major challenge for the Company to overcome. Research and development activities of the Company allowed the Company to achieve this ability through a trade secret process that protects the silicon and internal battery that is mounted directly onto the card’s internal electronics circuit board.\nThe Security Technology Industry\nSmartMetric Biometric Multi-Function Security Card\nSmartMetric has developed a multi-function logical and physical access security card the size and thickness of a standard credit card. Utilizing the small size breakthroughs by the Company in its biometric payments card development, SmartMetric has successfully developed a biometric security card that can easily fit inside a person’s wallet.\nAs with the biometric payments card, the SmartMetric security card has an internal rechargeable battery that is used to power the card’s internal processor used in the biometric fingerprint scan. All functions and operations of the card are subject to a valid fingerprint scan and match of the card user.\nThe main features of the SmartMetric biometric security card are:\n1. Logical access smartcard card chip for insertion into a card reader attached to a computer or network\n2. RFID transceiver for physical access i.e. doorways, elevators, etc.\n3. Validation indicator light that glows green immediately following a fingerprint validation\n4. Rechargeable battery to power the card\n5. Size and thickness of a credit card\n6. Changeable security code on reverse of card for additional log on security\nCybersecurity and identity validation for network access control, physical building entry and secure on-the-spot identity security is now handled by the revolutionary biometric activated cyber and ID multi-function security card which has been developed by SmartMetric after over a decade of R&D.\nFrom governments to the workplace, better, stronger security is desired across the enterprise. Our new biometric multifunction security card provides a revolutionary biometric based solution that is portable, easily integrated and backward compatible to existing backend security infrastructure.\nThe new multifunction biometric security card by SmartMetric is a revolutionary leap forward in the Cyber and Access Security world according to SmartMetric.\nAccess management market is estimated to grow from USD 8.09 billion in 2016 to USD 14.82 billion by 2021, at a CAGR of 12.9% between 2016 and 2021 according to a recent research report by KBV Research in a publication titled Identity & Access Management Market - Global Forecast by Marqual IT Solutions Pvt. Ltd (KBV Research) November 2016 KBV Research is a name owned by IT Solutions Pvt. Ltd.\nBiometrics\nBiometric technologies identify users by electronically capturing a specific biological or behavioral characteristic of that individual, such as a fingerprint or voice or facial feature, and creating a unique digital identifier from that characteristic. Because this process relies on largely unalterable human characteristics, positive identification can be achieved independent of any information possessed by the individual seeking authorization.\nThe process of identity authentication typically requires that a person present for comparison with one or more of the following factors:\n● Something known such as a password, PIN or mother’s maiden name;\n● Something carried such as a token, card, or key; or\n● something physical such as fingerprint, voice pattern, signature motion, facial shape or other biological or behavioral characteristic.\nComparison of biological and behavioral characteristics has historically been the most reliable and accurate of the three factors but has also been the most difficult and costly to implement into a single product that can automatically verify the identity of a user accessing a computer network or the Internet. However, recent advances in biometric collection technologies (both biometric hardware products and their associated processing software) have increased the speed and accuracy and reduced the cost of implementing biometrics in commercial environments. Management believes that individuals, website operators, government organizations, and businesses will increasingly use this method of identity authentication.\nBiometrics refers to the automatic identification of a person based on his/her physiological or behavioral characteristics. This method of identification is preferred over traditional methods involving passwords and personal identification numbers (“PINs”) for two reasons: (i) the person to be identified is required to be physically present at the point of identification to be identification; and (ii) identification based on biometric techniques obviates the need to remember a password or carry a token. By replacing PINs, biometric techniques can potentially prevent unauthorized access to or fraudulent use of cellular phones, Biometric cards, desktop PCs, workstations and computer networks. It can be used during transactions conducted via telephone and Internet (e-commerce and e-banking). In automobiles, biometrics could replace keys-less entry devices. The SmartMetric fingerprint activated credit card that has the fingerprint encased inside the credit card has been developed to replace the less secure PIN’s for credit and debit cards.\nPINs and passwords may be forgotten, may be hacked and token-based methods of identification, e.g., passports and driver’s licenses, may be forged, stolen or lost. Various types of biometric systems are being used for real-time identification, with the most popular based on facial recognition and fingerprint matching. Other biometric systems utilize iris and retinal scanning, speech, facial thermograms and hand geometry. Of the biometric options available to work with a credit or debit card, fingerprint scanning is the only biometric methodology that has been successfully reduced in size to fit inside such cards.\nA biometric system is essentially a pattern recognition system, which makes a personal identification by determining the authenticity of a specific physiological or behavioral characteristic possessed by the user. An important issue in designing a practical system is to determine how an individual is identified.\nThere are two different ways to resolve a person’s identity; verification and identification. Verification (Am I whom I claim I am?) involves confirming or denying a person’s claimed identity. In identification, one has to establish a person’s identity (Who am I?).\nAs stated above, the SmartMetric fingerprint biometric card has been designed as a credit-card sized card embedded with an integrated circuit, contact chip and biometric fingerprint sensor. The SmartMetric card has been designed to provide not only memory capacity, but also computational capability along with secure non-refutable identification of the user. We believe that the self-containment of SmartMetric’s card makes it substantially resistant to attack, as it will not need to depend upon vulnerable external resources. Because of this characteristic, we expect that the SmartMetric biometric card may be used in different applications, which require strong security protection and authentication.\nThe physical structure of a card is specified by the International Standards Organization (“ISO”). Generally, this structure is made up of three elements: (i) the plastic card, which is the most basic one and has the dimensions of 85.60mm x 53.98 x 0.80mm; (ii) an electronic circuit board inlay; and (iii) a contact chip that are embedded in the card.\nThe SmartMetric card has been designed to conform to ISO standards. The electronic circuit inlay is a part of, and not distinct from, the biometric card.\nThe communication line between the card and ATMs and other standard Smart Card reading devices is bi-directional serial transmission, which conforms to ISO standards. Card commands and input data are sent to the chip that responds with status words and output data upon the receipt of these commands and data. Information is sent in half duplex mode (transmission of data is in one direction at a time). This protocol, together with the restriction of the bit rate, is designed to prevent data attack on the card. Other data protection systems are utilized inside the card including advanced encryption.\nIn general, the size, the thickness and bend requirements for the biometric card were designed to protect the card from being spoiled physically.\nRecent Developments\nThe COVID-19 has had an impact on SmartMetric’s final card production. While the delays are due to supply line disruption, the Company is confident that these delays will be short-lived based on advice from our manufacturing partners, manufacturing alternatives and alternative supply lines that are being put into place by the Company.\nSmartMetric has presented its fingerprint activated biometric card to a large global payments network and credit/debit card brand. The company has been advised that the card testing and approval requirements for this network is that the company’s biometric fingerprint scanning must be able to differentiate between a live finger and a fake finger at the time of fingerprint scanning. This is to protect the card from what is called in the industry, spoofing.\nThe adopted method for this kind of anti-spoofing detection within the biometric industry is performed through intelligent software analysis done at the time of the fingerprint scan. SmartMetric has tested this methodology and was not confident in its robustness in performing the task at hand. So as to ensure the highest level of anti-spoofing capability, SmartMetric has developed its own method that it believes is far in advance to the normal standard within the biometric industry.\nSmartMetric has completed the invention of its advanced live finger detection method and is now working on its incorporation into the company’s biometric card. Once this has been completed the company will then be presenting its card for testing as a biometric card to the global payments network. SmartMetric has received a license from this network to move forward with its product testing by the networks designated biometric card test laboratory.\nThe company’s product is different from most other biometric cards that have been announced in that it has its own internal rechargeable battery. This is important and a must if the card is to be used at ATM’s.\nOther differentiations are the now newly developed advanced anti-spoofing technology.\nVarious versions of the SmartMetric fingerprint biometric card are under development including but not limited to a version that has one time password OTP display and another that has a small display for showing the cards CVV.\nOther cards under development based on the company’s biometric technology include memory cards with up to 2GB of memory. Also cards that have much larger display screens that can display such things as Q-Codes.\nThe large-scale memory fingerprint biometric protected card has potential application in the portable medical records industry as well as advanced applications in the banking and financial transaction industries.\nYears of research and development has gone into the miniaturization of the electronics at the core of the SmartMetric fingerprint biometric card. All of the design and electronic engineering has been undertaken by SmartMetric and is the owned property and trade secrets of the company.\nThe card developed by SmartMetric has its own ARM Cortex processor along with additional memory. The user’s fingerprint is stored inside the cards memory and is protected by advanced very strong elliptic curve cryptography.\nGHS Equity Financing Agreement and Registration Rights Agreement\nOn March 6, 2020, the Company entered into an equity financing agreement (the “Equity Financing Agreement”), and a registration rights agreement (the “Registration Rights Agreement”) with GHS Investments LLC, a Nevada limited liability company (“GHS”). Under the terms of the Equity Financing Agreement, GHS agreed to provide the Company with up to $4,000,000 over the course of 36 months in return for shares of the Company’s common stock. The 36-month period will commence upon effectiveness of a registration statement on Form S-1 (the “Registration Statement”) filed with the U.S. Securities and Exchange Commission (the “Commission”) on August 6, 2020.\nFollowing effectiveness of the Registration Statement, the Company shall have the discretion to deliver puts to GHS and GHS will be obligated to purchase shares of the Company’s common stock, par value $0.001 per share (the “Common Stock”) based on the investment amount specified in each put notice. The maximum amount that the Company shall be entitled to put to GHS in each put notice shall not exceed two hundred percent (200%) of the average daily trading dollar volume of the Company’s Common Stock during the ten (10) trading days preceding the put, so long as such amount does not exceed $500,000. Pursuant to the Equity Financing Agreement, GHS and its affiliates will not be permitted to purchase, and the Company may not put shares of the Company’s Common Stock to GHS that would result in GHS’s beneficial ownership equaling more than 4.99% of the Company’s outstanding Common Stock. The price of each put share shall be equal to eighty percent (80%) of the Market Price (as defined in the Equity Financing Agreement). Puts may be delivered by the Company to GHS until the earlier of thirty-six (36) months after the effectiveness of the Registration Statement, the date on which GHS has purchased an aggregate of $4,000,000 worth of Common Stock under the terms of the Equity Financing Agreement, or at such time that the Registration Statement is no longer in effect. Additionally, in accordance with the Equity Financing Agreement, the Company issued GHS a convertible promissory note in the principal amount of $35,000 and a 9 month maturity date (the “Commitment Note”), with the first $20,000 of the Commitment Note deemed earned upon execution of the Equity Financing Agreement and the remaining $15,000 of the Commitment Note deemed earned upon payment by GHS of the Company’s legal fees.\nThe Registration Rights Agreement provides that the Company shall (i) use its best efforts to file with the Commission the Registration Statement within 60 days of the date of the Registration Rights Agreement; and (ii) have the Registration Statement declared effective by the Commission within 30 days after the date the Registration Statement is filed with the Commission, but in no event more than 90 days after the Registration Statement is filed.\nSales and Marketing\nSmartMetric has engaged distributors and dealers in both North and South America. SmartMetric has entered into an agreement with Redsys the owner of the ADVANTIS credit and debit card chip that is used in over 1.4 Billion credit/debit cards globally. RedSys/Advantis is owned by card issuing Banks. Five hundred (500) card issuing banking organizations around the world are issuing credit and debit cards with the RedSys/ADVANTIS chip.\nSmartMetric has added the ADVANTIS credit/debit card chip onto the SmartMetric biometric card thereby allowing the existing RedSys / ADVANTIS banks already issuing credit and debit cards with their chip on board to now issue seamlessly the SmartMetric biometric credit/debit card. RedSys/ ADVANTIS have agreed to work closely with SmartMetric in promoting the SmartMetric card globally. RedSys/ADVANTIS is owned by some of the largest Banks in Europe and Latin America.\nManufacturing\nThe Company designs and develops its biometric technology. Current production capacity is approximately 250,000 cards per week that can be substantially increased over a relatively short period of time.\nSmartMetric’s President & CEO in the card lamination factory.\nIntellectual Property\nWe rely on patents, licenses, trade secrets, trademarks, copyright registrations and non-disclosure agreements to establish and protect our proprietary rights in our technologies and products. A number of patents are in process (Patents Pending) that cover critical aspects of the engineering and function of the SmartMetric biometric card. The founder of SmartMetric, Chaya Hendrick, is the inventor of these patents, and has provided SmartMetric with an option over biometric card related pending patents invented by her.\nSome of the most recent Patents Pending have not been disclosed on the publicly searchable USPTO database of filed for patents and remain trade secrets within the Company. Publishing of such Patents Pending will be done in due course.\nPatents\nSmartMetric biometric card is protected by five (5) USPTO issued patents. Other patents are pending. Our technology is also dependent upon unpatented trade secrets. However, trade secrets are difficult to protect. In an effort to protect our trade secrets, we have a policy of requiring our employees, consultants and advisors to execute non-disclosure agreements. The principal shareholder of SmartMetric and technology inventor, Chaya Hendrick, through various corporate investment vehicles and companies also owns other technologies, patents, and has financial interest in other technology companies. Chaya Hendrick, under an executed employment agreement is not subject to any restriction on using and owning any technology, methodology, process or invention created by Chaya Hendrick.\nGovernment Regulation\nThere are currently no governmental regulations, which have any bearing on the raw materials or the manufacturing of our payments card products. United States federal departments such as the Department of Defense have rules and regulations concerning security features of smart cards used as identity or building and cyber access cards. These regulations stipulate a specific licensing and testing protocol for such cards.\nBanking Industry Self-Regulation\nThe EMV chip used in chip cards are subject to licensing and testing by the banking-controlled body called EMVco. EMVco is an acronym standing for Europay, MasterCard and Visa. These international payments card networks were the founding parties of EMVco.\nIndividual payments networks such as Visa, Mastercard, Europay, American Express, Union Pay Dinners and JCB all have their own individual licensing and testing standards and processes.\nResearch and Development\nOur research and development program is focused on ongoing development of new products built on our existing biometric card. We continue to refine our technology and develop further improvements to our biometric card products. We have finalized our first biometric EMV payments card product. We have also concluded the design and electronic engineering for our soon-to-be released multi-function security and access control biometric cards. Research and development will continue as the Company continues to innovate and develop new biometric card-based products. Future biometric card-based products the Company is now working on, include but are not limited to: (a) health insurance card with stored in-card medical records; (b) national identity card; and (c) drivers’ licenses.\nThe Company has developed and is continuing to develop its own embedded systems and application software that works with the SmartMetric Biometric Card. This development software and systems and ongoing electronic design and development requires the company to continue to expend time and financial resources on significant software development. Currently, the Company has electronic and software engineers working in Tel Aviv, Israel and Buenos Aires, Argentina.\nCompetition\nVarious potential competitors have announced products similar to that of SmartMetric’s. It is understood that “announced” is defined as a person to hold their finger on the cards fingerprint sensor while it is in a card reader. Unlike the SmartMetric biometric card that is powered from its own internal rechargeable battery, this other type of card does not allow the card to be used in most restaurants that need to take the card away from the table for processing at the checkout. It also does not allow their other type of card to be used at the vast majority of ATM’s.\nEmployees\nAs of the date of this annual report, we have one full time employee, our Chief Executive Officer and President, Chaya Hendrick. We primarily use direct contract hires in administration and engineering, as is common in the information technology world. All work product developed by all of our engineers remains the intellectual property of SmartMetric. Engineers who work for SmartMetric under contract are primarily based in Tel Aviv, Israel. Some software engineering is conducted in Buenos Aires, Argentina.\nCorporate History\nWe were incorporated in the State of Nevada on December 18, 2002 and our principal office is located in Las Vegas, Nevada. Since our inception, we have invested a substantial portion of our efforts and financial resources in the development of our products. We have generated no revenues from the sale of our products and have experienced substantial net operating losses.\nWe entered into a royalty and licensing agreement with Chaya Hendrick, our CEO, which requires substantial payments by us on an annual basis and additionally in the event gross revenues are derived, which could harm our financial position.\nPursuant to a licensing and royalty agreement, entered into on September 11, 2017 by the Company and Chaya Hendrick, our founder and CEO, we received a license to certain patents related to our technologies until the expiration of such patents in exchange for the following : (i) issuance of 200,000 Series B Convertible Preferred Shares, (ii) 5% of gross revenues derived from the sale of products derived from the patents, and (iii) annual payments beginning at $50,000 per annum, increased by 100% of each previous year (offset against 5% gross revenue royalty payments). We believe these patents are instrumental our business plan and if we are unable to make such required payments under the plan, Chaya Hendrick may terminate the agreement, which may materially impact our business plan. Furthermore, there can be no assurances that we will be able to continue to meet our financial obligations under the terms of the agreement unless we are able to raise additional capital through the sale of our securities or derive revenue from some other source.\nWhere to Find More Information\nWe make our public filings with the SEC, including our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and all exhibits and amendments to these reports. These materials are available on the Company’s website at www.smartmetric.com or on the SEC’s web site, http://www.sec.gov.",
    "item_1A": "Item 1A. Risk Factors\nWe have described below a number of uncertainties and risks which, in addition to uncertainties and risks presented elsewhere in this Annual Report, may adversely affect our business, operating results and financial condition. The uncertainties and risks enumerated below as well as those presented elsewhere in this Annual Report should be considered carefully in evaluating us, our business and the value of our securities. The following important factors, among others, could cause our actual business, financial condition and future results to differ materially from those contained in forward-looking statements made in this Annual Report or presented elsewhere by management from time to time.\nRisks Related to Our Financial Position and Need to Raise Additional Capital\nWe have a limited operating history as a company and may not be able to effectively operate our business.\nOur limited staff and operating history mean that there is a high degree of uncertainty regarding our ability to:\n● develop our technologies and proposed products;\n● identify, hire and retain the needed personnel to implement our business plan and sell our products;\n● Manage our growth and / or successfully scale our business; or\n● respond to competition.\nNo assurances can be given as to exactly when, if at all, we will be able to fully develop, and take the necessary steps to derive any revenues from our proposed products.\nOur business depends upon our ability to keep pace with the latest technological changes, and our failure to do so could make us less competitive in our industry.\nThe market for our services is characterized by rapid change and technological improvements. Failure to respond in a timely and cost-effective way to these technological developments may result in serious harm to our business and operating results. As a result, our success will depend, in part, on our ability to develop and market service offerings that respond in a timely manner to the technological advances of available to our customers, evolving industry standards and changing preferences.\nRaising capital may be difficult as a result of our history of losses and limited operating history in our current stage of development.\nWhen making investment decisions, investors typically look at a company’s management, earnings and historical performance in evaluating the risks and operations of the business and the business’s future prospects. Our history of losses and relatively limited operating history in our current stage of development makes such evaluation, as well as any estimation of our future performance, substantially more difficult. As a result, investors may be unwilling to invest in us or on terms or conditions which are acceptable. If we are unable to secure additional financing, we may need to materially scale back our business plan and/or operations or cease operations altogether.\nWe are an early-stage company, have no product revenues, are not profitable and may never be profitable.\nFrom inception through June 30, 2021, we have raised approximately $26,000,000 through the sale of our securities. During this same period, we have recorded an accumulated deficit of approximately $28,859,366. Our net losses for the two most recent fiscal years ended June 30, 2021 and 2020 were $924,728 and $805,577, respectively. We have never made any sales and have never generated revenues and we anticipate none will be generated for the foreseeable future. We expect to incur significant operating losses for the foreseeable future as we continue the development of our products. Accordingly, we will need additional capital to fund our continuing operations and any expansion plans. Since we do not generate any revenue, the most likely source of such additional capital is the sale of our securities. To the extent that we raise additional capital by issuing equity securities, our stockholders are likely to experience dilution with regard to their percentage ownership of the company, which may be significant. If we raise additional capital by incurring debt, we could incur significant interest expense and become subject to covenants that could affect the manner in which we conduct our business, including securing such debt obligations with our assets.\nTo date, we have generated only losses, which are expected to continue for the foreseeable future.\nFor the years ended June 30, 2021 and 2020, we incurred a net loss of $924,728 and $805,577, respectively. We may not be able to achieve expected results, including any guidance or outlook it may provide from time to time.\nWe may continue to incur losses and may be unable to achieve profitability. We cannot assure you that our net losses and negative cash flow will not accelerate and surpass our expectations nor can we assure you that we will ever generate any net income or positive cash flow.\nWe may not be able to continue as a going concern if we do not obtain additional financing by December 31, 2021.\nSince our inception, we have funded our operations primarily through the sale of our securities. Our cash and cash equivalents balance at June 30, 2021 was $10,325. Based on our current expected level of operating expenditures, we expect to only be able to fund our operations through the second quarter (ending December 31, 2021) of fiscal year ending June 30, 2022, at which time we will need additional capital. Our ability to continue as a going concern is wholly dependent upon obtaining sufficient capital to fund our operations. We have no committed sources of additional capital and our access to capital funding is always uncertain. Accordingly, despite our ability to secure capital in the past, we cannot assure you that we will be able to secure additional capital through financing transactions, including issuance of debt, or through other means. In the event that we are not able to secure additional funding, we may be forced to curtail operations, delay or stop ongoing clinical trials, cease operations altogether or file for bankruptcy.\nManagement’s opinion about our ability to continue as a going concern.\nAs of June 30, 2021, management has expressed the opinion that our capital resources as of the date of their audit report were sufficient to sustain operations and complete our planned activities for the upcoming year. Our current cash is sufficient to continue as a going concern past June 30, 2022. The COVID-19 has had an impact on SmartMetric’s final card production. While the delays are due to supply line disruption, the Company is confident that these delays will be short-lived based on advice from our manufacturing partners, manufacturing alternatives and alternative supply lines that are being put into place by the Company.\nWe entered into a royalty and licensing agreement with Chaya Hendrick, our CEO, which requires substantial payments by us on an annual basis and additionally in the event gross revenues are derived, which could harm our financial position.\nPursuant to a licensing and royalty agreement, entered into on September 11, 2017 by the Company and Chaya Hendrick, our founder and CEO, we received a license to certain patents related to our technologies until the expiration of such patents in exchange for the following : (i) Issuance of 200,000 Series B Convertible Preferred Shares, (ii) 5% of gross revenues derived from the sale of products derived from the patents, and (iii) annual payments beginning at $50,000 per annum, increased by 100% of each previous year (offset against 5% gross revenue royalty payments). We believe these patents are instrumental our business plan and if we are unable to make such required payments under the plan, Chaya Hendrick may terminate the agreement, which may materially impact our business plan. Furthermore, there can be no assurances that we will be able to continue to meet our financial obligations under the terms of the agreement unless we are able to raise additional capital through the sale of our securities or derive revenue from some other source.\nAs of June 30, 2021, we owe Chaya Hendrick, our CEO, $737,642 in deferred salary, of which the failure to pay could result in Chaya Hendrick’s termination of employment, the result of which would materially harm our business.\nWe currently have not paid $737,642 in salary owed to Chaya Hendrick pursuant to Chaya Hendrick’s employment agreement outstanding with us as of June 30, 2021. While Chaya Hendrick continues to support the Company and continues to operate as its CEO, President and chairman of the Board of Directors, there can be no assurances that this will continue if we fail to pay back salaries and future salary owed. Additionally, as of July 1, 2017, all prior and future deferred salary owed will bear interest at a rate of 7% per annum. In the event Chaya Hendrick terminates employment for lack of payment, the Company believes such loss would cause irreparable harm to our product development and would materially harm our business prospects. Additionally, there can be no assurances that Chaya would not attempt to foreclose on our assets in order to satisfy such debt obligations.\nRisks Relating to our Stage of Development and Business\nOur potential competitors have significantly greater resources than we have, which may make competing difficult.\nWe compete against numerous companies, many of which have substantially greater resources than we have. Several such competitors have large teams of engineers and scientists that attempt to develop products and technologies similar to ours. Companies such as Gemalto, Giesecke & Devrient, IDEMIA, as well as others, have substantially greater financial, research, manufacturing and marketing resources than we do. As a result, such competitors may find it easier to compete in our industry and bring competing products to market.\nOur business depends upon our ability to keep pace with the latest technological changes, and our failure to do so could make us less competitive in our industry.\nThe market for our services is characterized by rapid change and technological improvements. Failure to respond in a timely and cost-effective way to these technological developments may result in serious harm to our business and operating results. As a result, our success will depend, in part, on our ability to develop and market service offerings that respond in a timely manner to the technological advances of available to our customers, evolving industry standards and changing preferences.\nOur key personnel and directors are critical to our business, and such key personnel may not remain with our company in the future.\nWe depend on the continued employment of our President and CEO, Chaya Henrick and technical contracted personnel. If any of these key personnel were to leave and not be replaced with sufficiently qualified and experienced personnel, our business could be adversely affected. In particular, our current strategy to penetrate the market for contactless logical access identification and transaction solutions is heavily dependent on the vision, leadership and experience of our President and CEO, Chaya Hendrick.\nOur continued success will depend, to a significant extent, upon the performance and contributions of Chaya Henrick and upon our ability to attract motivate and retain highly qualified management personnel and employees. We depend on Chaya Henrick to effectively manage our business in a highly competitive environment. If one or more of our key officers join a competitor or form a competing company, we may experience interruptions in product development, delays in bringing products to market, difficulties in our relationships with customers and loss of additional personnel, which could significantly harm our business, financial condition, operating results and projected growth.\nWe currently employ a part-time Chief Financial Officer, Mr. Jay Needelman, who is also a member of the Company’s Board of Directors. The loss of services of any of our key management personnel, whether through resignation or other causes, the reduced services of our part-time Chief Financial Officer, or the inability to attract qualified personnel as needed, could prevent us from adequately executing our business strategy.\nRapid technological changes could make our services or products less attractive.\nThe smart card, biometric identification and personal identification industries are characterized by rapid technological change, frequent new product innovations, changes in customer requirements and expectations and evolving industry standards. If we are unable to keep pace with these changes, our business may be harmed. Products using new technologies, or emerging industry standards, could make our technologies less attractive. If addition, we may face unforeseen problems when developing our products, which could harm our business. Furthermore, our competitors may have access to technologies not available to us, which may enable them to produce products of greater interest to consumers or at a more competitive cost.\nSales of our products depend on the development of emerging applications in their target markets and on diversifying and expanding our customer base in new markets and geographic regions, all of which may be financially burdensome or unsuccessful.\nOur intent is to market and sell our products primarily to the private sector while addressing emerging applications that have not yet reached a stage of mass adoption or deployment. The market for some of these solutions (electronic biometric fingerprinting) is at an early stage of deployment in the private sector compared to other forms of services that try to identify a person through simpler means (by their name, social security number, etc.) Additionally, we have a strategy of expanding sales of existing products into new geographic markets. Our target market initially will be South America and Australia. In the event that we are unable to adequately develop our applications or gain traction in these emerging markets, or that the cost of the foregoing is too great, our business may be harmed.\nContinuing disruption in the global financial markets may adversely impact customers and customer spending patterns.\nContinuing disruption in the global financial markets as a result of the ongoing global financial uncertainty may cause consumers, businesses and governments to defer purchases in response to tighter credit, decreased cash availability and declining consumer confidence. Accordingly, demand for our products could decrease and differ materially from their current expectations. Further, some of our customers may require substantial financing in order to fund their operations and make purchases from us. The inability of these customers to obtain sufficient credit to finance purchases of our products and meet their payment obligations to us or possible insolvencies of our customers could result in decreased customer demand, an impaired ability for us to collect on outstanding accounts receivable, significant delays in accounts receivable payments, and significant write-offs of accounts receivable, each of which could adversely impact our financial results.\nRisks Related to Our Intellectual Property\nIf we are not able to adequately protect our intellectual property, we may not be able to compete effectively.\nOur ability to compete depends in part upon the strength of our proprietary rights in our technologies, brands and content. The efforts we have taken to protect our intellectual property and proprietary rights may not be sufficient or effective at stopping unauthorized use of our intellectual property and proprietary rights. In addition, effective trademark, patent, copyright and trade secret protection may not be available or cost-effective in every country in which our products are made available. There may be instances where we are not able to fully protect or utilize our intellectual property in a manner that maximizes competitive advantage. If we are unable to protect our intellectual property and proprietary rights from unauthorized use, the value of our products may be reduced, which could negatively impact our business. Our inability to obtain appropriate protections for our intellectual property may also allow competitors to enter our markets and produce or sell the same or similar products. In addition, protecting our intellectual property and other proprietary rights is expensive and diverts critical managerial resources. If any of the foregoing were to occur, or if we are otherwise unable to protect our intellectual property and proprietary rights, our business and financial results could be adversely affected. If we are forced to resort to legal proceedings to enforce our intellectual property rights, the proceedings could be burdensome and expensive. In addition, our proprietary rights could be at risk if we are unsuccessful in, or cannot afford to pursue, those proceedings.\nWe may incur substantial costs as a result of litigation or other proceedings relating to patent and other intellectual property rights and we may be unable to protect our rights to, or use of, our technology.\nSome or all of our patent applications may not issue as patents, or the claims of any issued patents may not afford meaningful protection for our technologies or products. In addition, patents issued to us or our licensors, if any, may be challenged and subsequently narrowed, invalidated or circumvented. Patent litigation is widespread in our industry and could harm our business. Litigation might be necessary to protect our patent position or to determine the scope and validity of third-party proprietary rights. If we choose to go to court to stop someone else from using the inventions claimed in our patents, that individual or company would have the right to ask the court to rule that such patents are invalid and/or should not be enforced against that third party. These lawsuits are costly and we may not have the required resources to pursue such litigation or to protect our patent rights. In addition, there is a risk that the court might decide that these patents are not valid and that we do not have the right to stop the other party from using the inventions. There is also the risk that, even if the validity of these patents is upheld, the court could refuse to stop the other party on the grounds that such other party’s activities do not infringe on our rights contained in these patents.\nFurthermore, a third party may claim that we are using inventions covered by their patent rights and may go to court to stop us from engaging in our normal operations and activities, including making or selling our product candidates. These lawsuits are costly and could materially increase our operating expenses and divert the attention of managerial and technical personnel. There is a risk that a court would decide that we are infringing the third party’s patents and would order us to stop the activities covered by the patents. In addition, there is a risk that a court would order us to pay the other party damages for having violated the other party’s patents. It is not always clear to industry participants, including us, which patents cover various types of products or methods of use. The coverage of patents is subject to interpretation by the courts, and the interpretation is not always uniform.\nBecause some patent applications in the United States may be maintained in secrecy until the patents are issued, patent applications in the United States and many foreign jurisdictions are typically not published until eighteen months after filing, and publications in the scientific literature often lag behind actual discoveries, we cannot be certain that others have not filed patent applications for technology covered by our issued patents or that we were the first to invent the technology. Our competitors may have filed, and may in the future file, patent applications covering technology similar to ours. Any such patent application may have priority over our patent applications and could further require us to obtain rights to issued patents covering such technologies.\nIf another party has filed a United States patent application on inventions similar to ours, we may have to participate in an interference or other proceeding in the U.S. Patent and Trademark Office, or the PTO, or a court to determine priority of invention in the United States. The costs of these proceedings could be substantial, and it is possible that such efforts would be unsuccessful, resulting in a loss of our United States patent position with respect to such inventions.\nSome of our competitors may be able to sustain the costs of complex patent litigation more effectively than we can because they have substantially greater resources. In addition, any uncertainties resulting from the initiation and continuation of any litigation could have a material adverse effect on our ability to raise the capital necessary to continue our operations.\nRisks Relating to Market Approval and Government Regulations\nCompliance with regulation of corporate governance and public disclosure diverts time and attention away from revenue generating activities.\nOur management team invests significant time and financial resources to comply with existing standards for public companies, which has led to management time and attention from developing our business to compliance activities which could have an adverse effect on our business.\nOur technology relies on our ability to gain the acceptance and approval of large banking / credit card institutions, the failure to do so may materially harm our business.\nIn the event that our SmartMetric Biometric Card does not gain acceptance/approval amongst the large card issuing institutions in the United States and abroad, our cards will not be provided for use to customers. We currently have no plans to open our own bank/credit card issuing institution and accordingly, we plan to rely on our ability to have our products accepted within the banking/credit card industries. Our failure to do so will have a material impact on our ability to generate revenues and continue to operate our business.\nRisks Relating to the Development and Manufacturing of Our Products\nWe currently rely on third party manufacturers and suppliers for certain components of our product; with such parties being, to some extent, outside of our control.\nWe currently have limited internal manufacturing capability and intend to rely on third party contract manufacturers or suppliers for the foreseeable future. Accordingly, factors outside of our control may result in material manufacturing delays and product shortages, which could delay or otherwise negatively impact our manufacturing and product development plans. Should we be forced to manufacture our proposed products, we cannot give any assurance that we would be able to develop internal manufacturing capabilities. In the event that we seek third party suppliers or alternative manufacturers, they may require us to purchase a minimum amount of materials or could require other unfavorable terms. Any such event could materially impact our business prospects and could delay the development and manufacturing of our products. Moreover, we cannot give any assurance that the contract manufacturers or suppliers that we select will be able to supply our products in a timely or cost-effective manner or in accordance with our specifications.\nWe have a limited number of suppliers of key components and may experience difficulties in obtaining components for which there is significant demand, which would materially impact our business prospects.\nWe rely upon a limited number of suppliers for some key components of our products. Our reliance on a limited number of suppliers may expose us to various risks including, without limitation, an inadequate supply of components, price increases, late deliveries and poor component quality. In addition, some of the basic components we use in our products, such as biometric fingerprint devices and various smart card technologies may at any time be in great demand. This could result in components not being available to us in a timely manner or at all, particularly if larger companies have ordered more significant volumes of those components, or in higher prices being charged for components. Disruption or termination of the supply of components or software used in our products could delay shipments of these products. The following delays/factors from our third-party suppliers could have a material adverse effect on our business and operating results and could also damage relationships with current and prospective customers:\n● Difficulties in staffing;\n● Adequate resources of qualified technicians, engineers/assemblers, and programmers;\n● Potentially adverse tax consequences;\n● Unexpected changes in regulatory requirements;\n● Tariffs and other trade barriers;\n● Export controls;\n● Political and economic instability; and\n● Late delivery of our products.\nWe utilize third party manufacturing plants for silicon for the manufacturing our products, which, in the event of growth would need to use large quantities of silicon, for which raw material shortages may occur.\nWhile we currently use silicon in our products, and no shortage currently exists of these materials, there can be no assurances that there will not be a shortage in the future, which may materially impact our manufacturing capabilities, growth prospects, and ability to generate revenue in the future.\nRisks Related to our Securities\nOur board of directors has broad discretion to issue additional securities.\nWe are authorized under our certificate of incorporation to issue up to 605,000,000 shares consisting of 600,000,000 shares of common stock and 5,000,000 “blank check” shares of preferred stock. Shares of our blank check preferred stock provide the board of directors with broad authority to determine voting, dividend, conversion, and other rights. As of September 24, 2021, we have issued and outstanding 472,859,208 shares of common stock; 610,000 shares of Series B Convertible Preferred Stock that are convertible into 30,500,000 shares of common stock at the election of the holder; and 239,025 shares of shares of Series C Convertible Preferred Stock. Additionally, we have 124,888,519 shares of common stock reserved upon the exercise of outstanding purchase warrants. Accordingly, as of June 30, 2021 we are entitled to issue up to 127,140,792 additional shares of common stock, and 4,390,000 additional shares of “blank check” preferred stock. Our board may generally issue those common and preferred shares, or convertible securities to purchase those shares, without further approval by our shareholders. Any additional preferred shares we may issue could have such rights, preferences, privileges, and restrictions as may be designated from time-to-time by our board, including preferential dividend rights, voting rights, conversion rights, redemption rights and liquidation provisions.\nIt is likely that we will issue additional securities to raise capital in order to further our business plans. It is also likely that we will issue additional securities to directors, officers, employees and consultants as compensatory grants in connection with their services. Any issuances could be made at a price that reflects a discount to, or a premium from, the then-current market price of our common stock. These issuances would dilute the percentage ownership interest of our current shareholders, which would have the effect of reducing your influence on matters on which our stockholders vote and might dilute the net tangible book value per share of our common stock.\nIf securities or industry analysts do not publish research or reports or if they publish unfavorable research or reports, an active market for our common stock may not develop and the price of our common stock could decline.\nWe are a small company which is relatively unknown to stock analysts, stockbrokers, institutional investors and others in the investment community that generate or influence sales volume. Even if we come to the attention of such persons, they may be reluctant to follow or recommend an unproven company such as ours until such time as we became more seasoned and viable. Generally, the trading market for a company’s securities depends in part on the research and reports that securities or industry analysts publish. We currently have limited research coverage by securities and industry analysts. As a consequence, there may be periods of time when trading activity in our shares is minimal or non-existent, as compared to a seasoned issuer with significant research coverage. We cannot give you any assurance that a broader or more active public trading market for our common stock will develop or if developed, will be sustained, or that current trading levels could be sustained or not diminish. In addition, in the event any analyst downgrades our securities, the price of our shares would likely decline. If one or more of these analysts ceases to cover us or fails to publish regular reports on us, interest in the purchase of our securities could decrease, which could cause the price of our common stock and its trading volume, if any, to decline.\nOur common stock may be considered a “penny stock,” and may be subject to additional sale and trading regulations that may make it more difficult to sell.\nOur common stock may be considered a “penny stock.” The principal result or effect of being designated a penny stock is that securities broker-dealers participating in sales of our common stock may be subject to the penny stock regulations set forth in Rules 15g-2 through 15g-9 promulgated under the Exchange Act. For example, Rule 15g-2 requires broker-dealers dealing in penny stocks to provide potential investors with a document disclosing the risks of penny stocks and to obtain a manually signed and dated written receipt of the document at least two business days before effecting any transaction in a penny stock for the investor’s account. Moreover, Rule 15g-9 requires broker-dealers in penny stocks to approve the account of any investor for transactions in such stocks before selling any penny stock to that investor. This procedure requires the broker-dealer to (i) obtain from the investor information concerning his or her financial situation, investment experience and investment objectives; (ii) reasonably determine, based on that information, that transactions in penny stocks are suitable for the investor and that the investor has sufficient knowledge and experience as to be reasonably capable of evaluating the risks of penny stock transactions; (iii) provide the investor with a written statement setting forth the basis on which the broker-dealer made the determination in (ii) above; and (iv) receive a signed and dated copy of such statement from the investor, confirming that it accurately reflects the investor’s financial situation, investment experience and investment objectives. Compliance with these requirements may make it more difficult and time consuming for holders of our common stock to resell their shares to third parties or to otherwise dispose of them in the market or otherwise.\nOur CEO and Chairman, as the sole holder of our Series B Convertible Preferred Stock, controls our company.\nChaya Hendrick, our CEO and Chairman, holds (via shares in her name or shares in the name of an entity she controls - Applied Cryptography, Inc. (“ACI”)) all 610,000 shares of Series B Convertible Preferred Stock outstanding. The outstanding shares of Series B Convertible Preferred Stock are entitled to vote on any matter with the holders of Common Stock voting together as one (1) class and shall have that number of votes (identical in every other respect to the voting rights of the holder of common stock entitled to vote at any regular or special meeting of Stockholders) equal to that number of common shares which is not less than 51% of the vote required to approve any action, which Nevada law provides may or must be approved by vote or consent of the common shares or the holders of other securities entitled to vote, if any. Each share of Series B Convertible Preferred Stock is convertible, at the option of the holder, into fifty (50) shares of Common Stock upon the satisfaction of certain conditions and for purposes of determining a quorum of a shareholder meeting, the outstanding shares of Series B Convertible Preferred Stock shall be deemed the equivalent of 51% of all shares of the Company’s Common Stock entitled to vote at such meetings. Accordingly, Ms. Hendrick can (without the approval of our other shareholders) elect our entire Board of Directors and determine the outcome of various matters submitted to shareholders for approval, including fundamental corporate transactions. Voting control by Ms. Hendrick may discourage certain types of transactions involving an actual or potential change in control of us, including transactions in which the holders of our common stock might receive a premium for their shares over prevailing market prices.\nFailure to maintain effective internal controls in accordance with Section 404 of the Sarbanes-Oxley Act could have a material adverse effect on our business and operating results and stockholders could lose confidence in our financial reporting.\nEffective internal controls are necessary for us to provide reliable financial reports and effectively prevent fraud. If we cannot provide reliable financial reports or prevent fraud, our operating results could be harmed. Failure to achieve and maintain an effective internal control environment, regardless of whether we are required to maintain such controls, could also cause investors to lose confidence in our reported financial information, which could have a material adverse effect on our stock price. The Company’s management assessed the design and operating effectiveness of internal control over financial reporting as of June 30, 2021 based on the framework set forth in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission. In connection with the assessment described above, management identified no control deficiencies that represented a material weakness at June 30, 2021. See “Item 9A. Controls and Procedures” for more detailed discussion.\nWe have not paid dividends on our common stock in the past and do not expect to pay dividends on our common stock for the foreseeable future. Any return on investment may be limited to the value of our common stock.\nNo cash dividends have been paid on our common stock. We expect that any income received from operations will be devoted to our future operations and growth. We do not expect to pay cash dividends on our common stock in the near future. Payment of dividends would depend upon our profitability at the time, cash available for those dividends, and other factors as our board of directors may consider relevant. If we do not pay dividends, our common stock may be less valuable because a return on an investor’s investment will only occur if our stock price appreciates.\nThe requirements of being a public company may strain our resources, divert management’s attention and affect our ability to attract and retain qualified board members.\nThe Exchange Act requires, among other things, that we file annual, quarterly and current reports with respect to our business and financial condition. The Sarbanes-Oxley Act requires, among other things, that we maintain effective disclosure controls and procedures and internal controls for financial reporting. For example, Section 404 of the Sarbanes-Oxley Act of 2002 requires that our management report on, and our independent auditors attest to, the effectiveness of our internal controls structure and procedures for financial reporting. Section 404 compliance may divert internal resources and will take a significant amount of time and effort to complete. We may not be able to successfully complete the procedures and certification and attestation requirements of Section 404 by the time we will be required to do so. If we fail to do so, or if in the future our chief executive officer, chief financial officer or independent registered public accounting firm determines that our internal controls over financial reporting are not effective as defined under Section 404, we could be subject to sanctions or investigations by the SEC or other regulatory authorities. Furthermore, investor perceptions of our company may suffer, and this could cause a decline in the market price of our common stock. Irrespective of compliance with Section 404, any failure of our internal controls could have a material adverse effect on our stated results of operations and harm our reputation. If we are unable to implement these changes effectively or efficiently, it could harm our operations, financial reporting or financial results and could result in an adverse opinion on internal controls from our independent auditors. We may need to hire a number of additional employees with public accounting and disclosure experience in order to meet our ongoing obligations as a public company, which will increase costs. Our management team and other personnel will need to devote a substantial amount of time to new compliance initiatives and to meeting the obligations that are associated with being a public company, which may divert attention from other business concerns, which could have a material adverse effect on our business, financial condition and results of operations. In addition, because our management team has limited experience managing a public company, we may not successfully or efficiently manage our transition into a public company.\nWe face risks related to Novel Coronavirus (COVID-19) which could significantly disrupt our research and development, operations, sales, and financial results.\nOur business will be adversely impacted by the effects of COVID-19. In addition to global macroeconomic effects, the COVID-19 outbreak and any other related adverse public health developments will cause disruption to our operations and sales activities and our final card production. While the delays to our final card production are due to supply line disruption, these delays may be short-lived based on advice from our manufacturing partners, manufacturing alternatives and alternative supply lines that are being put into place by the Company.\nOur customers have been and will be disrupted by worker absenteeism, quarantines and restrictions on employees’ ability to work, office and factory closures, disruptions to ports and other shipping infrastructure, border closures, or other travel or health-related restrictions. In addition, COVID-19 or another disease outbreak will in the short-run and may over the longer term adversely affect the economies and financial markets of many countries, resulting in an economic downturn that will affect demand for our products and services and impact our operating results. There can be no assurance that any decrease in sales resulting from COVID-19 will be offset by increased sales in subsequent periods. Although the magnitude of the impact of COVID-19 outbreak on our business and operations remains uncertain, the continued spread of COVID-19 or the occurrence of other epidemics and the imposition of related public health measures and travel and business restrictions will adversely impact our business, financial condition, operating results and cash flows. In addition, we have experienced and will experience disruptions to our business operations resulting from quarantines, self-isolations, or other movement and restrictions on the ability of our employees to perform their jobs that may impact our ability to develop and design our products and services in a timely manner or meet required milestones or customer commitments.",
    "item_1B": "Item 1B. Unresolved Staff Comments.\nNot Applicable.",
    "item_2": "Item 2. Properties.\nOur principal office is located at 3960 Howard Hughes Parkway, Suite 500, Las Vegas, Nevada 89109. We currently lease this property at a rate of approximately $1,100 per month. We believe that our existing office facility is adequate for our current needs and that additional space will be available if, and when needed.",
    "item_3": "Item 3. Legal Proceedings.\nFrom time to time we may be a defendant or plaintiff in various legal proceedings arising in the normal course of our business. As of the date of this Annual Report, there are no material pending legal or governmental proceedings relating to us or properties to which we are a party, and, to our knowledge, there are no material proceedings to which any of our directors, executive officers or affiliates are a party adverse to us or which have a material interest adverse to us.",
    "item_4": "Item 4. Mine Safety Disclosures.\nNot Applicable\nPART II",
    "item_5": "Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nAs of September 24, 2021, 472,859,208 shares of our common stock were issued and outstanding.\nHolders\nAs of September 24, 2021, the Company had 1,131 shareholders of record of our common stock, including the shares held in street name by brokerage firms.\nTransfer Agent\nThe transfer agent for our common stock is Worldwide Stock Transfer, LLC, One University Plaza, Suite 505, Hackensack, NJ 07601.\nRule 10B-18 Transactions\nDuring the fiscal year ended June 30, 2021, there were no repurchases of the Company’s common stock by the Company.\nRecent Sales of Unregistered Securities\nDuring the years ended June 30, 2021 and 2020, we issued securities that were not registered under the Securities Act. Except where noted, all of the securities discussed in this Item 5 were issued in reliance on the exemption under Section 4(a)(2) of the Securities Act.\n● During the three months ended September 30, 2019, the Company sold for cash 6,337,500 shares of common stock and warrants to purchase: (i) 6,337,500 shares at prices ranging from $0.10 per share to $0.25 per share for net proceeds of $133,495. The warrants expire at various times through September 17, 2021. None of these shares were issued during the quarter ended September 30, 2019, with all 6,337,500 shares being recorded as stock payable. There were 52,800 Preferred C shares issued for net proceeds of $45,000 and 70,000 Preferred C shares converted to 3,224,643 Common shares for the three month period ending September 30, 2019, see Note 6.\n● During the three month period ending December 31, 2019, the Company increased its total number of shares of authorized capital stock to 600,000,000 shares, par value $0.001 per share.\n● During the three months ended December 31, 2019, the Company sold for cash 40,675,000 shares of common stock and warrants to purchase: (i) 825,000 shares at prices ranging from $0.20 per share to $0.25 per share for net proceeds of $214,510. The warrants expire at various times through November 1, 2021. None of these shares were issued during the quarter ended December 31, 2019, with all 40,675,000 shares being recorded as stock payable. There were 36,300 Preferred C shares converted to 2,370,696 Common shares for the three month period ending December 31, 2019, see Note 6.\n● During the three months ended March 31, 2020, the Company sold for cash 9,550,000 shares of common stock and warrants to purchase: (i) 3,500,000 shares at prices ranging from $0.05 per share to $1.00 per share for net proceeds of $66,500. The warrants expire at various times through March 12, 2022. None of these shares were issued during the quarter ended March 31, 2020, with all 9,550,000 shares being recorded as stock payable. There were 53,700 Preferred C shares converted to 6,384,864 Common shares for the three month period ending March 31, 2020. The Company issued 41,800 preferred shares for net proceeds of $35,000 and another 33,600 preferred shares for which the net proceeds of $30,000 had not been received as of March 31, 2020. At March 31, 2020, the Company had 316,875,686 shares of common stock issued and outstanding.\n● During the three months ended June 30, 2020, the Company sold for cash 40,000,000 shares of common stock and warrants to purchase: (i) 12,000,000 shares at prices ranging from $0.10 per share to $0.20 per share for net proceeds of $200,905. The warrants expire at various times through June 12, 2021. 31,000,000 of these shares were issued during the quarter ended June 30, 2020, with 9,000,000 shares being recorded as stock payable. There were 53,100 Preferred C shares converted to 5,259,814 Common shares for the three month period ending June 30, 2020. The Company issued 41,800 preferred shares for net proceeds of $35,000. The Company issued 50,000 common shares, for services rendered, to Director Elizabeth Ryba.\n● During the three months ended September 30, 2020, the Company sold for cash 17,500,000 shares of common stock and warrants to purchase: (i) 17,500,000 shares at prices ranging from $0.05 per share to $0.10 per share and (ii) 14,500,000 shares at prices ranging from $0.10 to $0.20 for net proceeds of $77,409. The warrants expire at various times through September 21, 2022. All 17,500,000 of these shares were issued during the quarter ended December 31, 2020, with all 17,500,000 shares being recorded as stock payable. The Company issues 6,032,260 shares. Of these shares, 585,000 were issues for consulting services and 5,447,260 were converted from Preferred shares.\n● During the three months ended December 31, 2020, the Company sold 16,500,000 shares of common stock for net proceeds of $82,455. With these issuances the company also issued warrants to purchase: (i) 16,500,000 shares at prices ranging from $0.05 to $0.10 per share and (ii) 16,500,000 shares at prices ranging from $0.10 to $0.20 and (iii) 1,500,000 at a price of $0.30. The warrants expire at various times through December 21, 2022. None of the 16,500,000 shares were issued during the quarter ended December 31, 2020, and were recognized as stock payable.\n● During the three months ended December 31, 2020, the Company issued 32,034,876 shares for $75,000, of which 15,000,000 were issued from stock payable and 16,034,876 were converted from 78,100 Preferred shares.\n● During the three months ended March 31, 2021, the Company sold 11,000,000 shares of common stock for net proceeds of $59,957. With these issuances the company also issued warrants to purchase: (i) 3,333,333 shares at a price of $0.10 per share and (ii) 3,000,000 shares at a price of $0.20. The warrants expire at various times through February 4, 2022. None of the 12,000,000 shares were issued during the quarter ended March 31, 2021, and were recognized as stock payable.\n● During the three months ended March 31, 2021, the Company issued 26,769,540 shares, of which 17,000,000 were issued from stock payable, 6,709,100 were converted from 72,600 Preferred shares and 2,560,440 shares were issued for legal services.\n● During the three months ended June 30, 2021, the Company sold 3,333,333 shares of common stock for net proceeds of $20,000. With these issuances the company also issued warrants to purchase: (i) 3,333,333 shares at a price of $0.10 per share and (ii) 3,333,333 shares at a price of $0.20. The warrants expire at various times through June 7, 2022. None of the 3,333,333 shares were issued during the quarter ended June 30, 2021, and were recognized as stock payable.\n● During the three months ended June 30, 2021, the Company issued 3,025,952 shares, of which all were converted from 36,300 Preferred C shares.",
    "item_6": "Item 6. Selected Financial Data\nNot Applicable as we are a smaller reporting company.",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nOur Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) is provided in addition to the accompanying financial statements and notes to assist readers in understanding our results of operations, financial condition, and cash flows. MD&A is organized as follows:\n● Company Overview - Discussion of our business plan and strategy in order to provide context for the remainder of MD&A.\n● Critical Accounting Policies - Accounting policies that we believe are important to understanding the assumptions and judgments incorporated in our reported financial results and forecasts.\n● Results of Operations - Analysis of our financial results comparing the year ended June 30, 2021 and June 30, 2020.\n● Liquidity and Capital Resources - Liquidity discussion of our financial condition and potential sources of liquidity.\nCompany Overview\nBusiness\nSmartMetric, Inc. was incorporated pursuant to the laws of Nevada on December 18, 2002. “SmartMetric is a development stage company engaged in the technology industry. SmartMetric’s main products are a fingerprint sensor activated payments card and security card with a finger sensor and fully functional fingerprint reader embedded inside the card. The SmartMetric biometric cards have a rechargeable battery allowing for portable biometric identification and card activation. This card is referred to as a biometric card or the SmartMetric Biometric Card.”\nTo date, we have devoted a substantially all of our efforts and financial resources to the development of our SmartMetric Card. Since our inception in 2002, we have generated no revenue from product sales and have funded our operations principally through the private sales of our equity securities. We have never been profitable and, as of June 30, 2021, we had an accumulated deficit of approximately $28,878,841. We expect to continue to incur significant operating losses for the foreseeable future as we continue the development of our technologies and advance them to market.\nOur cash and cash equivalents balance at June 30, 2021 was approximately $10,325 representing 20.5% of total assets. Notwithstanding our recent capital raises, based on our current expected level of operating expenditures, we expect to be able to fund our operations into the quarter beginning April 1, 2022. This period could be shortened if there are any significant increases in spending that were not anticipated or other unforeseen events.\nWe anticipate raising additional cash through the private or public sales of equity or debt securities to continue to fund our operations and the development of our technologies. There is no assurance that financing will be available to us when needed in order to allow us to continue our operations, or if available, on terms acceptable to us. If we do not raise sufficient funds in a timely manner, we may be forced to curtail operations, delay or stop our ongoing clinical trials, cease operations altogether, or file for bankruptcy. We currently do not have commitments for future funding from any source.\nGoing Concern\nThe consolidated financial statements do not include any adjustments relating to the carrying amounts of recorded assets or the carrying amounts and classification of recorded liabilities that may be required should the Company be unable to continue as a going concern.\nAs shown in the accompanying consolidated financial statements the Company has incurred recurring losses of $944,203 and $805,577 for the period ending June 30, 2021 and 2020, respectively, and has incurred a cumulative loss of $28,878,841 since inception (December 18, 2002). These conditions raise substantial doubt about the Company’s ability to continue as a going concern within one year from the date of this filing. The Company is currently in the development stage and has spent a substantial portion of its time in the development of its technology.\nThere is no guarantee that the Company will be able to raise enough capital or generate revenues to sustain its operations.\nManagement believes that the Company’s capital requirements will depend on many factors. These factors include the final phase of development and mass production being successful as well as product implementation and distribution. Management plans to continue its relationship with Geneva Roth Remark in order to raise capital beyond exclusively private placement stock sales.\nThe consolidated financial statements do not include any adjustments relating to the carrying amounts of recorded assets or the carrying amounts and classification of recorded liabilities that may be required should the Company be unable to continue as a going concern.\nIn December 2019, an outbreak of a novel strain of coronavirus originated in Wuhan, China (“COVID-19”) and has since spread worldwide, including to the Unites States, posing public health risks that have reached pandemic proportions (the “COVID-19 Pandemic”). The COVID-19 Pandemic poses a threat to the health and economic wellbeing of our employees, customers and vendors. Like most businesses world-wide, the COVID-19 Pandemic has impacted the Company financially; however, management cannot presently predict the scope and severity with which COVID-19 will impact our business, financial condition, results of operations and cash flows.\nCritical Accounting Policies\nWe have prepared our financial statements in conformity with accounting principles generally accepted in the United States, which requires management to make significant judgments and estimates that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of expenses during the reporting period. We base these significant judgments and estimates on historical experience and other applicable assumptions we believe to be reasonable based upon information presently available. These estimates may change as new events occur, as additional information is obtained and as our operating environment changes. These changes have historically been minor and have been included in the financial statements as soon as they became known. Actual results could materially differ from our estimates under different assumptions, judgments or conditions.\nAll of the Company’s significant accounting policies are discussed in Note 2, Summary of Significant Accounting Policies, to our financial statements, included elsewhere in this Quarterly Report. We have identified the following as our significant accounting policies and estimates, which are defined as those that are reflective of significant judgments and uncertainties, are the most pervasive and important to the presentation of our financial condition and results of operations and could potentially result in materially different results under different assumptions, judgments or conditions.\nWe believe the following critical accounting policies reflect our more significant estimates and assumptions used in the preparation of our financial statements:\nUse of Estimates - The preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the amounts reported in the financial statements and accompanying disclosures. Actual results may differ from those estimates.\nResearch and Development Costs - Research and development costs are charged to expense as incurred. Our research and development expenses consist primarily of expenditures for electronics design and engineering, software design and engineering, component sourcing, component engineering, manufacturing, product trials, compensation and consulting costs.\nEarnings Per Share - In accordance with FASB ASC 260, “Earnings Per Share,” the basic loss per share is computed by dividing the loss attributable to common stockholders by the weighted average number of common shares outstanding during the period. Basic net loss per share excludes the dilutive effect of stock options or warrants and convertible notes. Diluted net earnings (loss) per common share is determined using the weighted-average number of common shares outstanding during the period, adjusted for the dilutive effect of common stock equivalents, consisting of shares that might be issued upon exercise of common stock options and warrants. In periods where losses are reported, the weighted-average number of common shares outstanding excludes common stock equivalents, because their inclusion would be anti-dilutive.\nPatent Impairment - When the carrying balance of the Company’s patent is more than what it could be sold for on the open market and/or is not recoverable through future use, the Company decreases its value. In determining whether the carrying value is not recoverable, the Company estimates the sum of the expected cash flows from the use of the patent or its possible sale. If the results in an amount less that the patent’s value on the financial statements, the Company will deem the patent’s carrying value on the balance sheet to be impaired by the amount that the carrying value exceeds the fair market value of the asset. The decrease in the patent’s value will then be included as a loss in the Company’s profit and loss statement. The Company had no patent asset recorded at June 30, 2021.\nCash - The Company considers all highly liquid debt instruments and other short-term investments with an initial maturity of three months or less to be cash equivalents. Any amounts of cash in financial institutions which exceed FDIC insured limits exposes the Company to cash concentration risk. The Company had no cash equivalents at June 30, 2021 and 2020.\nResult of Operations\nYear Ended June 30, 2021 Compared to the Year Ended June 30, 2020\nOur results of operations have varied significantly from year to year and quarter to quarter and may vary significantly in the future. We did not have revenue during the years ending June 30, 2021 and 2020. We did not generate any revenues during the years ending June 30, 2021 and 2020. Net loss for the years ended June 30, 2021 and 2020 were $944,203 and $805,577, respectively, resulting from the operational activities described below.\nOperating Expenses\nOperating expenses were $821,824 and $747,478 during the years ended June 30, 2021 and 2020, respectively. The decrease in operating expenses is the result of the following factors.\nYear Ended\nJune 30, Change in 2021\nVersus 2020\n$ %\nOperating Expenses\nResearch and development $ 76,344 $ 89,240 $ (12,896 ) (14.5 )%\nGeneral and administrative 555,480 468,238 87,242 18.6 %\nOfficer salary 190,000 190,000 - (0 )%\nTotal operating expense $ 821,824 $ 747,478 $ 74,346 9.9 %\nResearch and Development\nResearch and development expenses were 76,344 and $89,240 for the years ended June 30, 2021 and 2020, respectively. The decrease of $12,896, or 14.5%, in 2021 compared to 2020 was primarily attributable to a decrease in engineering costs.\nOur research and development expenses consist primarily of expenditures related to engineering.\nGeneral and Administrative\nGeneral and administrative expenses were $555,480 and $468,238 for the years ended June 30, 2021 and 2020, respectively. The increase of $87,242 or 18.6%, in 2021 compared to 2020 was primarily the result of an increase in consulting expenses.\nOur general and administrative expenses consist primarily of expenditures related to employee compensation, legal, accounting and tax, other professional services, and general operating expenses.\nOfficer salary were $190,000 for the years ended June 30, 2021 and 2020, respectively.\nLiquidity and Capital Resources\nWe have incurred losses since our inception in 2002 as a result of significant expenditures for operations and research and development and the lack of any revenue. We have an accumulated deficit of approximately $28.9 million as of June 30, 2021 and anticipate that we will continue to incur additional losses for the foreseeable future. Through June 30, 2021, we have funded our operations through the private sale of our equity securities and exercise of options and warrants, resulting in gross proceeds of approximately $27 million. Cash and cash equivalents at June 30, 2021 were $10,325.\nWe are actively seeking sources of financing to fund our continued operations and research and development programs. To raise additional capital, we may sell shares of equity or debt securities. There can be no assurance that we will be able to complete any financing transaction in a timely manner or on acceptable terms or otherwise. If we are not able to raise additional cash, we may be forced to further delay, curtail, or cease development of our product candidates, or cease operations altogether.\nYear Ended\nJune 30,\nCash at beginning of period\n$ 71,377\n$ 10,161\nNet cash used in operating activities\n(567,582 )\n(744,003 )\nNet cash used in investing activities\n-\n-\nNet cash provided by financing activities\n506,530\n805,219\nCash at end of period\n$ 10,325\n$ 71,377\nNet Cash Used in Operating Activities\nNet cash used in operating activities was $567,582 and $744,003 for the years ended June 30, 2021 and 2020, respectively. The decrease of $135,078 in cash used during 2021 compared to 2020 was primarily attributable to lower consulting and legal expenses.\nNet Cash Used in Investing Activities\nCash used in investing activities was $0 and $0 for years ended June 30, 2021 and 2020, respectively.\nNet Cash Provided by Financing Activities\nNet cash provided by financing activities was $506,530 for the year ended June 30, 2021 compared to $805,219 for the year ended June 30, 2020. The decrease of $257,346 was due to decreased private placement sales. We are actively seeking sources of financing to fund our continued operations and research and development programs.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nNot Applicable.",
    "item_8": "Item 8. Financial Statements and Supplementary Data.\nOur audited consolidated financial statements for the fiscal years ended June 30, 2021 and 2020, together with the reports of the independent registered public accounting firms thereon and the notes thereto, are presented beginning at page.\nItem 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nWe maintain “disclosure controls and procedures,” as such term is defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934 (the “Exchange Act”), that are designed to ensure that information required to be disclosed by us in reports that we file or submit under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in Securities and Exchange Commission rules and forms, and that such information is accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate, to allow timely decisions regarding required disclosure. In designing and evaluating our disclosure controls and procedures, management recognized that disclosure controls and procedures, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the disclosure controls and procedures are met. Additionally, in designing disclosure controls and procedures, our management necessarily was required to apply its judgment in evaluating the cost-benefit relationship of possible disclosure controls and procedures. The design of any disclosure controls and procedures also is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions.\nIn connection with the preparation of this Quarterly Report on Form 10-K for the year ended June 30, 2021, our principal executive officer and principal financial officer have concluded that our disclosure controls and procedures (as defined in Rules 13a-15(c) and 15d-15(e) under the Exchange Act) are not effective to ensure that information required to be disclosed by us in report that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the U.S. Securities and Exchange Commission’s rules and forms and to ensure that information required to be disclosed by us in the reports that we file or submit under the Exchange Act is accumulated and communicated to our management, including our Chief Executive Officer, as appropriate to allow timely decisions regarding required disclosure.\nManagement’s Annual Report on Internal Control Over Financial Reporting\nThe management of the Company is responsible for establishing and maintaining adequate internal control over financial reporting (“ICFR”) for the Company. Our internal control system was designed to, in general, provide reasonable assurance to the Company’s management and board regarding the preparation and fair presentation of published financial statements, but because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur management assessed the effectiveness of the Company’s internal control over financial reporting as of June 30, 2021. The framework used by management in making that assessment was the criteria set forth in the document entitled “2013 Internal Control - Integrated Framework” issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on that assessment, management concluded that, during the period covered by this report, such internal controls and procedures were effective as of June 30, 2021.\nA material weakness is a deficiency, or a combination of deficiencies, within the meaning of Public Company Accounting Oversight Board (“PCAOB”) Auditing Standard AS 2201, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the Company’s annual or interim financial statements will not be prevented or detected on a timely basis. Management has not identified any material weaknesses as of June 30, 2021 and our internal controls over financial reporting were effective at the reasonable assurance level.\nDue to our size and nature, segregation of all conflicting duties may not always be possible and may not be economically feasible. However, to the extent possible, the initiation of transactions, the custody of assets and the recording of transactions are being performed by separate individuals.\nThis Annual Report does not include an attestation report of the Company’s registered public accounting firm regarding internal control over financial reporting. Management’s report was not subject to attestation by the Company’s registered public accounting firm as we are a smaller reporting company and are not required to provide the report.\nLimitations on Controls\nManagement does not expect that the Company’s disclosure controls and procedures or the Company’s internal control over financial reporting will prevent or detect all error and fraud. Any control system, no matter how well designed and operated, is based upon certain assumptions and can provide only reasonable, not absolute, assurance that its objectives will be met. Further, no evaluation of controls can provide absolute assurance that misstatements due to error or fraud will not occur or that all control issues and instances of fraud, if any, within the Company have been detected. The Company’s disclosure controls and procedures are designed to provide reasonable assurance of achieving their objectives and the Company’s chief executive officer and chief financial officer have concluded that the Company’s disclosure controls and procedures are not effective.\nDue to our size and nature, segregation of all conflicting duties may not always be possible and may not be economically feasible. However, to the extent possible, the initiation of transactions, the custody of assets and the recording of transactions are being performed by separate individuals. Management evaluated the impact of our limitation to have segregation of duties in all of our financially significant processes and have concluded that this control did not meet the criteria of a material weakness.\nNotwithstanding the assessment that our disclosure controls and procedures and our internal controls over financial reporting were not effective and that there are material weaknesses as identified herein, we believe that our consolidated financial statements contained in this annual report fairly present our financial position, results of operations and cash flows for the periods covered thereby in all material respects.\nChanges in Internal Controls\nDuring the fiscal year ended June 30, 2021, there have been no changes in our internal control over financial reporting that have materially affected or are reasonably likely to materially affect our internal controls over financial reporting\nItem 9B. Other Information\nNone.\nPART III\nItem 10. Directors, Executive Officers and Corporate Governance\nThe following table sets forth the names and ages of the members of our Board of Directors and our executive officers and the positions held by each. Each member of the Board of Directors serves for a term of one year, or until his or her successor has been duly elected and has been qualified. Each of our officers serve until they are replaced by the Board of Directors.\nName\nAge\nPosition with the Company\nChaya Hendrick\nPresident, Chief Executive Officer and Chairman of the Board\nJay M. Needelman, CPA\nChief Financial Officer, Director\nElizabeth Ryba\nDirector\nCHAYA HENDRICK has been President, Chief Executive Officer and Chairman of the Board of Directors of SmartMetric since the Company’s inception in 2002. C. Hendrick has served as President and CEO of Smart Micro Chip, Inc., an Australian corporation from 2000 to 2002. From 1999 to 2001, C. Hendrick was President and Chief Executive Officer of Smarticom Inc. and FastEcom, Inc., Australian corporations. From 1994 to 1998, C. Hendrick served as executive officer of Applied Computing Science (Australia), an Australian company involved in e-commerce systems, research and development. Ms. Hendrick founded Asset Developments a property development company that created and sold regional residential land subdivisions. The last being a 1,000-acre subdivision named Claire Valley Estates in the Canberra region of Australia. All of the property development projects were funded by C. Hendrick and were financially profitable. C. Hendrick attended Dandenong College in Australia.\nWe believe Ms. Hendrick is qualified to serve on our Board due to her extensive experience in technology development and as an executive at technology companies.\nJAY M. NEEDELMAN, CPA, has been the Chief Financial Officer and a director of SmartMetric since 2007. Mr. Needelman has over 28 years of experience in public accounting. A 1991 graduate of Florida State University in Tallahassee, Fl, Mr. Needelman began his career in public accounting in Miami, Fl, in 1991. After working for two different firms, Mr. Needelman founded his own firm in late 1992.\nWe believe Mr. Needelman is qualified to serve on our Board due to his financial expertise.\nELIZABETH RYBA has been a director of SmartMetric since April 5, 2006. From 2015 to the present, Ms. Ryba has been Vice President of Marketing at the Design and Decoration Building in New York, one of the premier destinations for luxury interior design showrooms in the country. From 2006 to 2015, Ms. Ryba had marketing positions at two luxury home decor brands. Ms. Ryba was a promotion director at Hearst Publishing from 2002 through 2005. Between 2001 and 2004, Ms. Ryba was a consultant at Stratus Rewards Credit Cards where she launched a Visa Luxury credit card where points were redeemable on private jets. Between 2000 and 2001, Ms. Ryba worked as a Marketing Consultant for SpaFinder. From 1991 through 1999, Ms. Ryba worked at Master Card where she launched a Smart Card in Australia. Ms. Ryba received her M.S. in Marketing from the University of Illinois, and her B.A. in English from the State University of New York at Stony Brook.\nWe believe Ms. Ryba is qualified to serve on our Board due to her extensive experience in the credit card industry as well as her extensive experience in marketing in the luxury sector which we believe is a sector to which we may be able to sell our products.\nFamily Relationships\nThere are no family relationships among officers or directors of the Company.\nCommittees of the Board\nOur business, property and affairs are managed by or under the direction of the Board. Members of the Board are kept informed of our business through discussion with the chief executive and financial officers and other officers, by reviewing materials provided to them and by participating at meetings of the Board. We have not previously had an audit committee, compensation committee or nominations and governance committee.\nAudit Committee\nWe currently do not have an acting audit committee, and our Board of Directors currently acts as our audit committee.\nAudit Committee Financial Expert\nWe do not have an audit committee and thus do not have an audit committee financial expert.\nCompensation Committee\nWe do not presently have a compensation committee. Our Board currently acts as our compensation committee.\nDirector Independence\nFor purposes of determining independence, we have adopted the definition of “independence” contained in the NASDAQ Market Place Rules. Pursuant to the definition, the company has determined that Elizabeth Ryba qualifies as independent.\nCode of Ethics\nThe Company has adopted a Code of Ethics that applies to its Chief Executive Officer and Chief Financial Officer. A copy of the Company’s code of ethics is available to any person without charge upon written request to the Company at SmartMetric, Inc., 3960 Howard Hughes Parkway, Suite 500, Las Vegas, NV, 89109. Attn: Secretary.\nInvolvement in Certain Legal Proceedings\nTo the best of our knowledge, none of our directors or executive officers has, during the past ten years:\n● been convicted in a criminal proceeding or been subject to a pending criminal proceeding (excluding traffic violations and other minor offenses);\n● had any bankruptcy petition filed by or against the business or property of the person, or of any partnership, corporation or business association of which he was a general partner or executive officer, either at the time of the bankruptcy filing or within two years prior to that time;\n● been subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction or federal or state authority, permanently or temporarily enjoining, barring, suspending or otherwise limiting, his involvement in any type of business, securities, futures, commodities, investment, banking, savings and loan, or insurance activities, or to be associated with persons engaged in any such activity;\n● been found by a court of competent jurisdiction in a civil action or by the SEC or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated;\n● been the subject of, or a party to, any federal or state judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated (not including any settlement of a civil proceeding among private litigants), relating to an alleged violation of any federal or state securities or commodities law or regulation, any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order, or any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n● been the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nExcept as set forth in our discussion below in “Certain Relationships and Related Transactions, and Director Independence” none of our directors or executive officers has been involved in any transactions with us or any of our directors, executive officers, affiliates or associates which are required to be disclosed pursuant to the rules and regulations of the SEC.\nItem 11. Executive Compensation\nSummary Compensation Table\nThe table below sets forth, for the fiscal years ended June 30, 2021 and 2020, the compensation earned by each person acting as our Chief Executive Officer and Chief Financial Officer. The Company’s only employee is our Chief Executive Officer.\nName and Principal Position Fiscal Year Ended Salary ($) Bonus ($) Stock Awards ($) Option Awards ($) Non-equity Incentive Plan Compensation ($) Nonqualified Deferred Compensation Earnings ($) All Other Compensation ($) Total ($)\nChaya Hendrick (President, Chief Executive Officer, $ 190,000 (3) -0- -0- $ 190,000 $ 190,000\nChairman of the Board (1) $ 174,167 (2) -0- -0- $ 15,833 (4) $ 190,000\nJay Needelman (Chief and Principal Financial Officer, $ 15,000 -0- -0- -0- $ 15,000\nDirector) (5) $ 15,000 -0- -0- -0- $ 15,000\n(1) Chaya Hendrick has been President, Chief Executive Officer and director of the Company since inception. Chaya Hendrick also has a car allowance in her employment agreement which she has forgone for the years ended June 30, 2021 and 2020.\n(2) The Company paid Chaya Hendrick $174,167 for the year ended June 30, 2020 out of her total aggregate salary of $190,000, with the remainder being accrued but unpaid. As of June 30, 2021 the Company has accrued $737,642 of unpaid salary, which includes previously accrued but unpaid salary for periods not covered under this Summary Compensation Table.\n(3) The Company paid Chaya Hendrick $190,000 for the year ended June 30, 2021 out of her total aggregate salary of $190,000.\n(4) Includes $0 in accrued but unpaid salary for the year end June 30, 2021. As of June 30, 2021, the Company has accrued $737,642 of unpaid salary, which includes previously accrued but unpaid salary for periods not covered under this Summary Compensation Table.\n(5) Jay Needelman has served as our Chief Financial Officer since 2007. Mr. Needelman receives annual compensation of $15,000 for his services as our Chief Financial Officer.\nOutstanding Equity Awards at Fiscal Year End\nNone.\nChaya Hendrick Employment\nPrevious Employment Agreement\nOn July 1, 2012, the Company entered into an employment agreement (the “Prior Agreement”) with Chaya Hendrick, the Company’s Chief Executive Officer that expired on July 1, 2017. Pursuant to the Prior Agreement, Ms. Hendrick received an annual base salary of $190,000 per year. Ms. Hendrick was also entitled to receive a management fee equal to $50,000 per year beginning with the Company’s fiscal year ended June 30, 2012 and each fiscal year thereafter during the term of the Agreement provided that the Company has manufactured its first product. This fee was to increase by 25% per annum at the conclusion of each calendar year and was based on the continued manufacturing and sales of products by the Company. As of the end of the term of the Prior Agreement, no compensation was paid pursuant to this management fee.\nMs. Hendrick was also entitled to participate in any and all benefit plans, from time to time, in effect for senior management, along with vacation, sick and holiday pay in accordance with the Company’s policies established and in effect from time to time. The Company also provided Ms. Hendrick with the use of an automobile of Ms. Hendrick’s choice at a purchase price not to exceed $60,000. Executive’s employment with the Company was subject to termination at any time, with cause, as such terms are defined in the Prior Agreement.\nThe Prior Agreement may be terminated on 30 days’ notice by Ms. Hendrick but may only be terminated by the Company for “cause.” In the event that Ms. Hendrick’s employment was terminated by the Company, the Company was obligated to pay to Ms. Hendrick an amount equal to $350,000 plus salary remaining on the term of the Prior Agreement.\nAddendum to Prior Agreement\nOn September 30, 2015, the Company and Ms. Hendrick entered into an Addendum to the Agreement (the “Addendum”) pursuant to which in consideration for the issuance of 200,000 shares of the Company’s Series B Convertible Preferred Stock, Ms. Hendrick granted the Company the first right to purchase or license any patents (the “Patent Option”) relating to “Smartcards” which Ms. Hendrick (i) shall apply for with the relevant patent authorities during the term of the Agreement, and (ii) are currently applied for with the relevant patent authorities or pending as of the date of the Prior Agreement (the “Patent Rights”). In exchange for the Patent Option the Company agrees, during the term of the Prior Agreement, to pay for any fees and/or expenses related to the application for the Ms. Hendrick’s Patent Rights with the relevant patent authorities, including, but not limited to, legal or filing fees. If, upon the Company’s receipt of notice of any Patent Rights of Ms. Hendrick’s in writing (“Patent Notification”) the parties fail to successfully negotiate and execute a purchase or license agreement as it relates to the Patent Right that is the subject of such Patent Notification within 60 calendar days of the receipt of such Patent Notification, the Ms. Hendrick shall be permitted to retain or transfer the Patent Rights to a third party without any subsequent notice to the Company.\nAmended and Restated Employment Agreement\nOn July 1, 2017, the Company and Ms. Hendrick entered into an amended and restated employment agreement (“Agreement”) with a duration of sixty (60) months. Pursuant to the Agreement, Ms. Hendrick shall receive (i) an annual base salary of $190,000, subject to adjustment at the end of each fiscal year at the discretion of the board of directors, with a minimum increase of 10% per annum for the duration of the term, (ii) an incentive management fee equal to $50,000 upon the Company manufacturing its first product, which shall increase by 25% per annum and based on the continued manufacturing and sales of products by our Company.\nAdditionally, Ms. Hendrick shall maintain certain rights to initiate, write, invent and / or create inventions separate from SmartMetric, Inc. and to retain the intellectual property rights of such patents, inventions or new products.\nThe Agreement may be terminated on 30 days’ notice by Ms. Hendrick but may only be terminated by the Company for “cause.” In the event that Ms. Hendrick’s employment is terminated by the Company for such “cause,” the Company is obligated to pay to Ms. Hendrick an amount equal to $350,000 plus the remaining salary on the term of the Agreement.\nJay Needelman Contract\nWe currently have an oral agreement with Jay Needelman, our part-time Chief Financial Officer, whereby we pay Mr. Needelman an annual fee of $15,000 for his services, payable in quarterly installments of $3,750.\nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table sets forth certain information, as of August 5, 2021, with respect to the beneficial ownership of the outstanding common stock by (i) any holder of more than five (5%) percent; (ii) each of the Company’s executive officers and directors; and (iii) the Company’s directors and executive officers as a group. Except as otherwise indicated, each of the stockholders listed below has sole voting and investment power over the shares beneficially owned.\nAmount and Nature of Beneficial Ownership\nTitle of Class\nName and Address of Beneficial Owner\nDirector/Officer\nNumber of\nShares\nof Common\nStock (1)\nPercentage\nof Class (1)\nDirectors and Executive Officers\nCommon Stock\nChaya Hendrick (2)\n145 East Harmon Avenue, Unit 19620\nLas Vegas, NV 89109\nChief Executive Officer,\nChairman of the Board of Directors\n89,127,778 (2)\n20.0 %\nCommon Stock\nJay Needelman, CPA\nWest 47th Street\nMiami Beach, FL 33140\nDirector; Chief Financial Officer\n%\nCommon Stock\nElizabeth Ryba\n73 Brown Road\nScarsdale, New York 10583\nDirector\n40,000\n* %\nAll Executive Officers and Directors as a Group (3 persons)\n89,167,778\n18.9 %\n5% Shareholders\n* Less than one percent (1%)\n(1) In determining beneficial ownership of our common stock as of a given date, the number of shares shown includes shares of common stock which may be acquired on exercise of warrants or options or conversion of convertible securities within 60 days of that date. In determining the percent of common stock owned by a person or entity on June 30, 2021, (a) the numerator is the number of shares of the class beneficially owned by such person or entity, including shares which may be acquired within 60 days on exercise of warrants or options and conversion of convertible securities, and (b) the denominator is the sum of (i) 472,859,208, the total shares of common stock outstanding on September 24, 2021, and (ii) the total number of shares that the beneficial owner may acquire upon conversion of any preferred stock and on exercise of the warrants and options. Unless otherwise stated, each beneficial owner has sole power to vote and dispose of its shares.\n(2) The 89,127,778 shares of common stock include (i) 58,627,778 of Common Stock and; (ii) 610,000 shares of Series B Convertible Preferred Stock convertible into 30,500,000 shares of common stock held by Applied Cryptography, Inc. (“ACI”) and / or Chaya Hendrick. The outstanding shares of Series B Convertible Preferred Stock are entitled to vote on any matter with the holders of Common Stock voting together as one (1) class and shall have that number of votes (identical in every other respect to the voting rights of the holder of common stock entitled to vote at any regular or special meeting of Stockholders) equal to that number of common shares which is not less than 51% of the vote required to approve any action, which Nevada law provides may or must be approved by vote or consent of the common shares or the holders of other securities entitled to vote, if any. Each share of Series B Convertible Preferred Stock is convertible, at the option of the holder, into fifty (50) shares of Common Stock upon the satisfaction of certain conditions and for purposes of determining a quorum of a shareholder meeting, the outstanding shares of Series B Convertible Preferred Stock shall be deemed the equivalent of 51% of all shares of the Company’s Common Stock entitled to vote at such meetings. Our Chairman and Chief Executive Officer, has sole voting and dispositive power over all of the shares beneficially owned by ACI.\nItem 13. Certain Relationships and Related Transactions, and Director Independence\nInformation regarding disclosure of an employment relationship or transaction involving an executive officer and any related compensation solely resulting from that employment relationship or transaction is incorporated by reference from the section of this Annual Report on Form10-K entitled “Executive Compensation.”\nInformation related to “Director Independence” is incorporated by reference from the section of this this Annual Report on Form10-K entitled “Directors, Executive Officers, and Corporate Governance.”\nRelated Party Transactions:\n● Chaya Hendrick, our CEO has made cash advances to the Company periodically in exchange for promissory notes of such face values. As of the years ended June 30, 2021 and 2020, we owed $0 and $0, respectively. These notes bear interest at 7.00% per annum.\n● During the years ended June 30, 2021 and 2020, Chaya Hendrick, our CEO deferred $0 and $15,833 in annual salary, respectively. As of June 30, 2021 and 2020, respectively, the Company has accrued the amounts of $737,642 and $759,948 as deferred salary for the difference between Chaya Hendrick’s contractual annual salary and the amounts actually paid. These amounts include previously deferred salary prior to the years ended June 30, 2021 and 2020.\n● On September 30, 2015, we entered into an Addendum to the then existing employment agreement of Chaya Hendrick, pursuant to which in consideration for the issuance of 200,000 shares of the Company’s Series B Convertible Preferred Stock, Chaya Hendrick granted the us the first right to purchase or license any patents (the “Patent Option”) relating to “Smartcards” which the Hendrick (i) shall apply for with the relevant patent authorities during the term of the employment agreement, and (ii) are currently applied for with the relevant patent authorities or pending as of the date of the employment agreement. In exchange for the Patent Option the Company agreed, during the term of the such employment agreement, to pay for any fees and/or expenses related to the application for the such patent rights with the relevant patent authorities, including, but not limited to, legal or filing fees. If, upon our receipt of notice of any patent rights in writing; we and Hendrick fail to successfully negotiate and execute a purchase or license agreement as it relates to such patent rights within 60 calendar days of such receipt, Hendrick shall be permitted to retain or transfer such patent rights to a third party without any subsequent notice to us.\n● On September 11, 2017, we entered into a licensing a royalty agreement with Chaya Hendrick, our founder and CEO, whereby we received a license to certain patents related to our technologies until the expiration of such patents in exchange for the following : (i) the Issuance to Chaya Hendrick of 200,000 Series B Convertible Preferred Shares, (ii) the payment of 5% of gross revenues derived from the sale of products derived from the patents in the future, and (iii) annual payments beginning at $50,000 per annum, increased by 100% of each previous year (offset against 5% gross revenue royalty payments) for the duration of the term of the agreement. The agreement continues until (i) the terms of the licensed patents expire, (ii) we terminate the agreement with notice to Chaya Hendrick, or (iii) Chaya Hendrick terminates the agreement pursuant to a material breach of our duties or payments contained thereunder.\nItem 14. Principal Accounting Fees and Services\nType of Fees Year end\nJune 30,\nYear end\nJune 30,\nAudit Fees\nPrager Metis, LLC $ 23,000 $ 19,546\nAudit Related Fees\nTax Fees - -\nAll Other Fees $ - -\nTotal Fees $ 23,000 $ 19,546\nPolicy on Pre-Approval of Audit and Permissible Non-audit Services of Independent Auditors\nConsistent with the SEC policies regarding auditor independence, our Board of Directors has responsibility for appointing, setting compensation and overseeing the work of the independent auditor. In recognition of this responsibility, our Board of Directors has established a policy to pre-approve all audit and permissible non-audit services provided by the independent auditor.\nPrior to engagement of the independent auditor for the next year’s audit, management will submit an aggregate of services expected to be rendered during that year for each of the following four categories of services to the Board of Directors for approval.\n1. Audit services include audit work performed in the preparation of financial statements, as well as work that generally only the independent auditor can reasonably be expected to provide, including comfort letters, statutory audits, and attest services and consultation regarding financial accounting and/or reporting standards.\n2. Audit-Related services are for assurance and related services that are traditionally performed by the independent auditor, including due diligence related to mergers and acquisitions, employee benefit plan audits, and special procedures required to meet certain regulatory requirements.\n3. Tax services include all services performed by the independent auditor’s tax personnel except those services specifically related to the audit of the financial statements, and includes fees in the areas of tax compliance, tax planning, and tax advice.\n4. Other Fees are those associated with services not captured in the other categories.\nItem 15. Exhibits, Financial Statements Schedules\n1. Financial Statements: See “Index to Financial Statements” in Part II, Item 8 of this Form 10-K.\n2. Exhibits: The exhibits listed in the accompanying index to exhibits are filed or incorporated by reference as part of this Form 10-K.\nCertain of the agreements filed as exhibits to this Form 10-K contain representations and warranties by the parties to the agreements that have been made solely for the benefit of the parties to the agreement. These representations and warranties:\n● may have been qualified by disclosures that were made to the other parties in connection with the negotiation of the agreements, which disclosures are not necessarily reflected in the agreements;\n● may apply standards of materiality that differ from those of a reasonable investor;\n● and were made only as of specified dates contained in the agreements and are subject to later developments.\nAccordingly, these representations and warranties may not describe the actual state of affairs as of the date they were made or at any other time, and investors should not rely on them as statements of fact.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nSMARTMETRIC, INC.\nDate: October 12, 2021 By: /s/ Chaya Hendrick\nChaya Hendrick\nPresident, Chief Executive Officer and Chairman\n(Principal Executive Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nName\nTitle\nDate\n/s/ Chaya Hendrick\nChief Executive Officer and Director\nOctober 12,\nChaya Hendrick\n(principal executive officer)\n/s/ Jay Needelman\nChief Financial Officer\nOctober 12,\nJay Needelman\n(principal financial and accounting officer) and Director\n/s/ Elizabeth Ryba\nDirector\nOctober 12,\nElizabeth Ryba\nSMARTMETRIC INC. AND SUBSIDIARY\nCONSOLIDATED FINANCIAL STATEMENTS\nYEARS ENDED JUNE 30, 2021 AND 2020\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nCONSOLIDATED BALANCE SHEETS FOR THE YEARS ENDED JUNE 30, 2021 AND 2020\nCONSOLIDATED STATEMENTS OF OPERATIONS FOR THE YEARS ENDED JUNE 30, 2021 AND 2020\nCONSOLIDATED STATEMENTS OF CASH FLOWS FOR THE YEARS ENDED JUNE 30, 2021 AND 2020\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS’ DEFICIT FOR THE YEARS ENDED JUNE 30, 2021 AND 2020\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nBoyle CPA, LLC\nCertified Public Accountants & Consultants\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and\nBoard of Directors of Smartmetric, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheet of Smartmetric, Inc. (the “Company”) as of June 30, 2021, the related consolidated statements of operations, changes in stockholders’ (deficit), and cash flows for the year ended June 30, 2021, and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2021, and the results of its operations and its cash flows for the year ended June 30, 2021, in conformity with accounting principles generally accepted in the United States of America.\nSubstantial Doubt About the Company’s Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the financial statements, the Company has sustained recurring losses and has an accumulated deficit as of June 30, 2021. These factors raise substantial doubt about its ability to continue as a going concern for one year from the issuance of these financial statements. Management’s plans are also described in Note 1. The financial statements do not include adjustments that might result from the outcome of this uncertainty.\nBasis of Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (“PCAOB”) and are required to be independent with respect to the Company in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with standards of the Public Company Accounting Oversight Board (United States). Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to fraud or error. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ Boyle CPA, LLC\nWe have served as the Company’s auditor since 2021\nRed Bank, NJ\nOctober 12, 2021\n331 Newman Springs Road P (732) 784-1582\nBuilding 1, 4th Floor, Suite 143 F (732) 510-0665\nRed Bank, NJ 0770\nSMARTMETRIC, INC. AND SUBSIDIARY\nConsolidated Balance Sheet\n(Audited)\nJune 30,\nJune 30,\n(Audited)\n(Audited)\nAssets\nCurrent assets:\nCash\n$ 10,325\n$ 71,377\nPrepaid expenses and other current assets\n5,000\n7,020\nTotal current assets\n15,325\n78,397\nNon-current assets\nDeferred financing costs\n35,000\n35,000\nTotal assets\n$ 50,325\n$ 113,397\nLiabilities and Stockholders’ Deficit\nCurrent liabilities:\nAccounts payable and accrued expenses\n$ 1,073,786\n$ 916,728\nLiability for stock to be issued\n127,321\n50,000\nDeferred Officer’s salary\n737,642\n759,948\nRelated party interest payable\n201,846\n149,481\nDividends payable\n2,442\n2,945\nDue to shareholders\n41,343\n41,343\nCovid19 SBA loan\n41,664\n20,832\nConvertible note payable, net of discount\n35,000\n32,127\nDerivative liability\n45,524\n-\nConvertible interest payable\n3,801\n-\nInterest payable\n-\nShareholder loan\n-\n-\nTotal current liabilities\n2,331,244\n1,973,404\nCommitments and contingencies (See note 4)\nSeries C mandatory redeemable convertible preferred stock, net of discount, authorized 1000,000 shares, 239,025 and 117,200 shares issued and outstanding, respectively\n196,083\n101,661\nStockholders’ deficit:\nPreferred stock, $.001 par value; 5,000,000 shares authorized, 610,000 and 610,000 shares issued and outstanding\nClass A Preferred stock, $.001 par value; 50,000,000 shares authorized 0 and 0 shares issued and outstanding Common stock, $.001 par value; 600,000,000 shares authorized, 446,385,628 and 379,523,000 shares issued and outstanding, respectively\n446,386\n379,524\nAdditional paid-in capital\n25,955,367\n25,429,261\nAccumulated deficit\n(28,859,365 )\n(27,771,062 )\nTotal stockholders’ deficit\n(2,457,002 )\n(1,961,668 )\nTotal liabilities and stockholders’ deficit\n$ 50,325\n$ 113,397\nSee notes to consolidated financial statements.\nSMARTMETRIC, INC. AND SUBSIDIARY\nConsolidated Statements Of Operations\n(Audited)\nYear\nYear\nEnded\nEnded\nJune 30,\nJune 30,\n(Audited)\n(Audited)\nRevenues\n$ -\n$ -\nExpenses:\nOfficer’s salary\n190,000\n190,000\nOther general and administrative\n555,480\n468,238\nResearch and development\n76,344\n89,240\nTotal operating expenses\n821,824\n747,478\nLoss from operations before income taxes\n(821,824 )\n(747,478 )\nInterest & Financing Expense\n(59,914 )\n(58,099 )\nGain (loss) on change in derivatives\n(42,990 )\n-\nNet loss\n(924,728 )\n(805,577 )\nPreferred stock dividends\n(163,575 )\n(32,024 )\nNet loss available for common stockholders\n$ (1,088,303 )\n$ (837,601 )\nNet loss per share, basic and diluted\n$ (0.00 )\n$ (0.00 )\nWeighted average number of common shares outstanding, basic and diluted\n413,974,288\n299,094,207\nSee notes to consolidated financial statements.\nSMARTMETRIC, INC. AND SUBSIDIARY\nConsolidated Statements of Changes In Stockholders’ (Deficit)\n(Audited)\nPreferred\nSeries C\nAdditional\nPaid\nAccumulated\nStock\nCommon Stock\nIn Capital\nDeficit\nTotal\nBalance June 30, 2019\n610,000\n$\n-\n$ -\n264,648,821\n$ 264,649\n$ 24,663,528\n$ (26,933,461 )\n$ (2,004,674 )\nShares issued of common stock for warrants and cash\n-\n-\n-\n-\n97,584,162\n97,584\n576,703\n-\n$ 674,287\nPreferred C shares Converted to Common\n-\n-\n-\n-\n17,240,017\n17,240\n182,580\n-\n$ 199,820\nBeneficial conversion feature related to convertible debt\n-\n-\n-\n-\n-\n-\n5,000\n-\n5,000\nSeries C dividends\n-\n-\n-\n-\n-\n-\n-\n(32,024 )\n(32,024 )\nShares of Common Stock issued for services\n-\n-\n-\n-\n50,000\n1,450\n-\n1,500\nNet loss for period\n-\n-\n-\n-\n-\n-\n-\n(805,577 )\n(805,577 )\nBalance June 30, 2020\n610,000\n$\n-\n$ -\n379,523,000\n$ 379,523\n$ 25,429,261\n$ (27,771,062 )\n$ (1,966,668 )\nCommon shares issued for services\n-\n-\n-\n-\n3,145,440\n3,145\n15,780\n-\n18,925\nShares issued of common stock and warrants for cash\n-\n-\n-\n-\n32,500,000\n32,500\n130,000\n-\n162,500\nShares converted from Preferred C shares to common\n-\n-\n-\n-\n31,217,188\n31,218\n172,149\n-\n203,367\nValuation of Preferred C & derivative liability\n-\n-\n-\n-\n-\n-\n208,177\n-\n208,177\nPreferred C dividends\n-\n-\n-\n-\n-\n-\n-\n(163,575 )\n(163,575 )\nNet loss for period\n-\n-\n-\n-\n-\n-\n-\n(924,728 )\n(924,728 )\nBalance June 30, 2021\n610,000\n$\n-\n$ -\n446,385,628\n$ 446,386\n$ 25,955,367\n$ (28,859,365 )\n$ (2,457,002 )\nSee notes to consolidated financial statements.\nSMARTMETRIC, INC. AND SUBSIDIARY\nConsolidated Statements Of Cash Flows\nYear\nYear\nEnded Ended\nJune 30, June 30,\n(Audited) (Audited)\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss $ (924,728 ) $ (805,577 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nCommon stock issued and issuable for services 18,926 1,500\nNon cash financing expense 49,322 -\nGain (loss) on fair value of derivative liability 112,565 -\nAmortization of debt discount 2,873 2,127\nChanges in assets and liabilities\nIncrease (Decrease) in prepaid expenses and other current assets 2,017 (567 )\nIncrease in accounts payable and accrued expenses 157,058 32,588\n(Decrease) in deferred officer salary (22,306 ) (30,067 )\nIncrease in Convertible interest payable 3,801 -\nIncrease in accrued interest payable 52,365 55,993\nNet cash used in operating activities (567,582 ) (744,003 )\nCASH FLOWS FROM FINANCING ACTIVITIES\nLoans from related parties - (3,759 )\nProceeds from notes payable - 35,000\nDeferred financing costs - (35,000\n)\nProceeds from sale of common stock 240,698 576,803\nProceeds from CARES Act PPP loan 20,832 20,832\nDue to shareholder - 41,343\nProceeds from sale of Series C Preferred stock 245,000 170,000\nNet cash provided by financing activities 506,530 805,219\nNET INCREASE (DECREASE) IN\nCASH (61,052 ) 61,216\nCASH BEGINNING OF PERIOD 71,377 10,161\nEND OF PERIOD 10,325 71,377\nNon-cash investing and financing activities $ 66,000 $ 191,636\nConversion of 72,600 & 104,000 Preferred C Shares into 21,482,136 & 5,595,339 shares of common stock\nCASH PAID DURING THE PERIOD FOR: $ - $ -\nIncome taxes $ - $ -\nInterest\nSee notes to consolidated financial statements.\nSMARTMETRIC INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1 - ORGANIZATION AND BASIS OF PRESENTATION\nSmartMetric, Inc. (the “Company” or “SmartMetric”) was incorporated in the State of Nevada on December 18, 2002. SmartMetric’s main product is a fingerprint sensor-activated card with a finger sensor onboard the card and a built-in rechargeable battery for portable biometric identification. This card may be referred to as a biometric card or the SmartMetric Biometric Datacard. SmartMetric has completed development of its card along with pre-mass manufacturing cards but has not yet begun to mass manufacture the biometric fingerprint activated cards.\nBasis of Presentation\nThe financial statements present the balance sheets, statements of operations, stockholder’s equity (deficit) and cash flows of the Company. The financial statements of the Company have been prepared in accordance with generally accepted accounting principles in the United States of America.\nThe Company has adopted June 30 as its fiscal year end.\nGoing Concern\nAs shown in the accompanying condensed consolidated financial statements the Company has sustained recurring losses of $924,728 and $805,577 for the period ended June 30, 2021 and 2020, respectively, and has an accumulated deficit of $28,859,365 at June 30, 2021.\nThese conditions raise substantial doubt about the Company’s ability to continue as a going concern within one year of the date of this filing. The financial statements do not include any adjustments relating to the recoverability and classification of asset carrying amounts or the amount and classification of liabilities that might be necessary should the Company be unable to continue as a going concern. The COVID-19 has had an impact on SmartMetric’s final card production. While the delays are due to supply line disruption, the Company is confident that these delays will be short-lived based on advice from our manufacturing partners, manufacturing alternatives and alternative supply lines that are being put into place by the Company.\nManagement believes that the Company’s capital requirements will depend on many factors. These factors include product marketing and distribution. The management plans include equity sales and borrowing in order to fund the operations. The Company plans to continue its relationship with Geneva Roth Remark in order to raise capital through means other than private placement stock sales.\nThere are no assurances that the Company will be able to achieve the level of revenues adequate to generate sufficient cash flow from operations to support the Company’s working capital requirements. To the extent that funds generated are insufficient, the Company will have to raise additional working capital. No assurance can be given that additional financing will be available, or if available, will be on terms acceptable to the Company. If adequate working capital is not available, the Company may not continue its operations.\nOn March 5, 2020, the Company entered into an agreement with GHS Investments, LLC whereas the investor agrees to invest up to four million dollar ($4,000,000) over the 36 months immediately subsequent to the effective date of the agreement.\nIn December 2019, an outbreak of a novel strain of coronavirus originated in Wuhan, China (“COVID-19”) and has since spread worldwide, including to the Unites States, posing public health risks that have reached pandemic proportions (the “COVID-19 Pandemic”). The COVID-19 Pandemic poses a threat to the health and economic wellbeing of our employees, customers and vendors. Like most businesses world-wide, the COVID-19 Pandemic has impacted the Company financially; delaying the beginning of production.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nRecent Accounting Pronouncements\nThe Company does not expect the adoption of recently issued accounting pronouncements to have a significant impact on the Company’s results of operations, financial position or cash flow except as noted below.\nIn February 2016, the FASB issued authoritative guidance ASC 842, “Leases.” This guidance requires lessees to recognize most leases on the balance sheet by recording a right-of-use asset and a lease liability. The Company has made the decision to adopt this guidance early, and it was adopted by the Company as of March 1, 2019. Based on the completed analysis, the Company has determined that the adjustment did not have a material impact on the financial statements.\nIn June 2018, the FASB issued ASU 2018-07, Compensation-Stock Compensation (Topic 718): Improvements to Nonemployee Share-Based Payment Accounting, which aligns accounting for share-based payments issued to nonemployees to that of employees under the existing guidance of Topic 718, with certain exceptions. This update supersedes previous guidance for equity-based payments to nonemployees under Subtopic 505-50, Equity-Equity-Based Payments to Non-Employees. This guidance was adopted by the Company as of March 1, 2019. Based on the completed analysis, the Company has determined the adjustment did not have a material impact on the financial statements.\nSMARTMETRIC INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (CONTINUED)\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of the Company and its wholly owned subsidiary, SmartMetric Australia Pty. Ltd. All significant intercompany accounts and transactions have been eliminated in consolidation.\nFair Value of Financial Instruments\nThe carrying amounts reflected in the balance sheets for cash, accounts payable and related party payables approximate the respective fair values due to the short maturities of these items.\nAs required by the Fair Value Measurements and Disclosures Topic of the FASB ASC, fair value is measured based on a three-tier fair value hierarchy, which prioritizes the inputs used in measuring fair value as follows: (Level 1) observable inputs such as quoted prices in active markets; (Level 2) inputs, other than the quoted prices in active markets, that are observable either directly or indirectly; and (Level 3) unobservable inputs in which there is little or no market data, which require the reporting entity to develop its own assumptions.\nThe three levels of the fair value hierarchy are described below:\nLevel 1: Unadjusted quoted prices in active markets that are accessible at the measurement date for identical, unrestricted assets or liabilities;\nLevel 2: Quoted prices in markets that are not active, or inputs that are observable, either directly or indirectly, for substantially the full term of the asset or liability;\nLevel 3: Prices or valuation techniques that require inputs that are both significant to the fair value measurement and unobservable (supported by little or no market activity).\nThe Company at present does not have any Level 2 or Level 3 fair value instruments.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. On an ongoing basis, the Company evaluates its estimates, including, but not limited to, those related to income taxes and contingencies. The Company bases its estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying value of assets and liabilities that are not readily apparent from other sources. Actual results could differ from those estimates.\nCash\nThe Company considers all highly liquid debt instruments and other short-term investments with an initial maturity of three months or less to be cash equivalents. Any amounts of cash in financial institutions which exceed FDIC insured limits exposes the Company to cash concentration risk. The Company had no cash equivalents at June 30, 2021 and 2020.\nResearch and Development\nResearch and development costs are charged to expense as incurred. Our research and development expenses consist primarily of expenditures for electronics design and engineering, software design and engineering, component sourcing, component engineering, manufacturing, product trials, compensation and consulting costs.\nRevenue Recognition\nThe Company has not recognized revenues to date. Therefore, the Company has not yet adopted a revenue recognition policy.\nSMARTMETRIC INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (CONTINUED)\nReclassifications\nCertain prior year amounts have been reclassified for consistency with the current period presentation. These reclassifications had no effect on the reported results of operations.\nUncertainty in Income Taxes\nGAAP requires the recognition and measurement of uncertain income tax positions using a “more-likely-than-not” approach. Management evaluates Company tax positions on an annual basis and has determined that as of June 30, 2021 and 2020, no accrual for uncertain income tax positions is necessary.\nLoss Per Share of Common Stock\nIn accordance with FASB ASC 260, “Earnings Per Share,” the basic loss per share is computed by dividing the loss attributable to common stockholders by the weighted average number of common shares outstanding during the period. Basic net loss per share excludes the dilutive effect of stock options or warrants and convertible notes. Diluted net earnings (loss) per common share is determined using the weighted-average number of common shares outstanding during the period, adjusted for the dilutive effect of common stock equivalents, consisting of shares that might be issued upon exercise of common stock options and warrants. In periods where losses are reported, the weighted-average number of common shares outstanding excludes common stock equivalents, because their inclusion would be anti-dilutive. As of June 30, 2021 and 2020, 124,888,519 and 53,280,406 dilutive shares were excluded from the calculation of diluted loss per common share, with all dilutive shares being Common stock warrants at June 30, 2021 and 2020.\nNOTE 3 - PREPAID EXPENSES\nPrepaid expenses were $5,000 at June 30, 2021.\nSMARTMETRIC INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 4 - COMMITMENTS\nLease Agreement\nThe Company’s main office is in Las Vegas, Nevada. Rent expense under all leases for the years ended June 30, 2021 and 2020 was $5,238 and $5,133 respectively. The Company maintains only one office. This office is in Las Vegas, NV and is a month-to-month lease.\nRelated Party Transactions\nThe Company’s Chief Executive Officer has made cash advances to the Company with an aggregate amount due of $0 and $0 as of June 30, 2021 and 2020, respectively. These advances bear interest at 7.00% per annum.\nAs of June 30, 2021 and June 30, 2020, the Company has accrued the amounts of $737,642 and $759,948, respectively, as deferred Officer’s salary for the difference between the president’s annual salary and the amounts paid.\nAs a result of these shareholder loans and deferred officer salary, the Company has accrued a balance of $201,846 and $149,481 as interest payable as of June 30, 2021 and 2020.\nOn September 11, 2017, we received a license to certain patents from Chaya Hendrick, our founder and CEO, related to our technologies until the expiration of the patents. As consideration, we issued Chaya Hendrick, or her assigns, (i) 200,000 shares of Series B Convertible Preferred Stock, (ii) a royalty equal to 5% of gross revenues derived from products sold related to the patents, and (iii) certain minimum required payments beginning at $50,000 and doubling each year thereafter. The Series B Preferred Shares may be converted at the election of holder on a basis for 50 common shares for each preferred share at any time or an aggregate of 10,000,000 common shares in exchange for all 200,000 preferred shares.\nOur CEO maintains an employment agreement that stipulates a $190,000 annual salary. This agreement is in effect until mutual agreement between its CEO and the Company to terminate.\nNOTE 5 - DEBT\nIn March of 2020, the Company applied for the SBA PPP government loan and was approved. On April 17,2020, the Company received $20,832 as proceeds from this loan. The Company successfully applied to have this loan forgiven.\nIn March of 2021, the Company applied for the SBA PPP government loan and was approved. On March 29, 2021, the Company received $20,832 as proceeds from this loan.\nOn March 5, 2020, the Company issued a $35,000 10% convertible note. The note was due on December 5, 2020 and is convertible at a rate of $0.0175 per share which resulted in a discount from the beneficial conversion feature totalling $5,000. During the year ended June 30, 2020, $2,127 of the debt discount was amortized. During the year ended June 30, 2021, the remaining $2,873 of the debt discount was amortized As of June 30, 2021, the note was shown net of unamortized discount of $35,000.\nThe 10% convertible note is currently in default. Upon default, the fixed conversion price became a Variable Conversion Price, which is 70% multiplied by the lowest trading price for the Company’s common stock during the 20 trading day period ending on the latest complete trading day prior to the conversion date.\nThe Company analyzed the conversion option for derivative accounting consideration under ASC 815, “Derivatives and Hedging,” and determined that the convertible notes should be classified as a liability since the conversion option becomes effective at default resulting in there being no explicit limit to the number of shares to be delivered upon settlement of the above conversion options. The Company has recorded the embedded derivative liability at its’ fair value utilizing the Black-Scholes Merton option pricing model, as follows:\nLevel 1 Level 2 Level 3 Total\nDerivative liability $ - $ - $ 45,524 $ 45,524\nNOTE 6 - STOCKHOLDERS’ DEFICIT\nPreferred Stock\nAs of June 30, 2021, the Company has 5,000,000 shares of Series B preferred stock, par value $0.001, authorized and 610,000 shares issued and outstanding.\nEach share of Series B Convertible Preferred Stock has a par value of $0.001, and a stated value equal to $5.00 (“Stated Value”). Holders of the Series B Convertible Preferred Stock are entitled to receive dividends or other distributions with the holders of the common stock of the Company on an as converted basis when, as, and if declared by the directors of the Company. Holders of the Series B Convertible Preferred Stock are entitled to convert all or any one (1) share of the Series B Convertible Preferred Stock into fifty (50) shares of common stock.\nSMARTMETRIC INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 6 - STOCKHOLDERS’ DEFICIT (CONTINUED)\nUpon any liquidation, dissolution or winding-up of the Company, whether voluntary or involuntary (“liquidation”), holders of the Series B Convertible Preferred Stock are entitled to receive out of the assets, whether capital or surplus, of the Company an amount equal to the Stated Value, pro rata with the holders of the common stock.\nThe Company issued 200,000 Series B preferred shares upon its inception in 2004.\nIn October 2015, the Company issued 200,000 Series B preferred shares.\nOn September 11, 2017, the Company issued an additional 210,000 shares of Series B preferred shares to its CEO, Chaya Hendrick, in consideration for grant of exclusive rights to the licensed patent.\nClass A Common Stock\nAs of June 30, 2021, the Company has 50,000,000 shares of Class A common stock, par value $0.001, authorized and no shares issued and outstanding.\nDuring the three month period ending December 31, 2019, the Company increased its total number of shares of authorized capital stock to 600,000,000 shares, par value $0.001 per share.\nCommon Stock and Warrants\n● During the three months ended September 30, 2019, the Company sold for cash 6,337,500 shares of common stock and warrants to purchase: (i) 6,337,500 shares at prices ranging from $0.10 per share to $0.25 per share for net proceeds of $133,495. The warrants expire at various times through September 17, 2021. None of these shares were issued during the quarter ended September 30, 2019, with all 6,337,500 shares being recorded as stock payable.\n● During the three months ended December 31, 2019, the Company sold for cash 40,675,000 shares of common stock and warrants to purchase: (i) 825,000 shares at prices ranging from $0.20 per share to $0.25 per share for net proceeds of $214,510. The warrants expire at various times through November 1, 2021. None of these shares were issued during the quarter ended December 31, 2019, with all 40,675,000 shares being recorded as stock payable. There were 36,300 Preferred C shares converted to 2,370,696 Common shares for the three month period ending December 31, 2019, see Note 6.\n● During the three months ended March 31, 2020, the Company sold for cash 9,550,000 shares of common stock and warrants to purchase: (i) 3,500,000 shares at prices ranging from $0.05 per share to $1.00 per share for net proceeds of $66,500. The warrants expire at various times through March 12, 2022. None of these shares were issued during the quarter ended March 31, 2020, with all 9,550,000 shares being recorded as stock payable.\n● During the three months ended June 30, 2020, the Company sold for cash 40,000,000 shares of common stock and warrants to purchase: (i) 12,000,000 shares at prices ranging from $0.10 per share to $0.20 per share for net proceeds of $200,905. The warrants expire at various times through June 12, 2021. 31,000,000 of these shares were issued during the quarter ended June 30, 2020, with 9,000,000 shares being recorded as stock payable.\n● During the three months ended September 30, 2020, the Company sold for cash 17,500,000 shares of common stock and warrants to purchase: (i) 17,500,000 shares at prices ranging from $0.05 per share to $0.10 per share and (ii) 14,500,000 shares at prices ranging from $0.10 to $0.20 for net proceeds of $77,409. The warrants expire at various times through September 21, 2022. All 17,500,000 of these shares were issued during the quarter ended December 31, 2020, with all 17,500,000 shares being recorded as stock payable. The Company issued 6,032,260 shares. Of these shares, 585,000 were issues for consulting services and 5,447,260 were converted from Preferred shares.\nSMARTMETRIC INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 6 - STOCKHOLDERS’ DEFICIT (CONTINUED)\n● During the three months ended December 31, 2020, the Company sold 16,500,000 shares of common stock for net proceeds of $82,455. With these issuances the company also issued warrants to purchase: (i) 16,500,000 shares at prices ranging from $0.05 to $0.10 per share and (ii) 16,500,000 shares at prices ranging from $0.10 to $0.20 and (iii) 1,500,000 at a price of $0.30. The warrants expire at various times through December 21, 2022. None of the 16,500,000 shares were issued during the quarter ended December 31, 2020, and were recognized as stock payable.\n● During the three months ended December 31, 2020, the Company issued 32,034,876 shares for $75,000, of which 15,000,000 were issued from stock payable and 16,034,876 were converted from 78,100 Preferred shares.\n● During the three months ended March 31, 2021, the Company sold 11,000,000 shares of common stock for net proceeds of $59,957. With these issuances the company also issued warrants to purchase: (i) 12,000,000 shares at a price of $0.10 per share and (ii) 12,000,000 shares at a price of $0.20. The warrants expire at various times through February 4, 2022. None of the 12,000,000 shares were issued during the quarter ended March 31, 2021, and were recognized as stock payable.\n● During the three months ended March 31, 2021, the Company issued 26,769,540 shares, of which 17,000,000 were issued from stock payable, 6,709,100 were converted from 72,600 Preferred shares and 2,560,440 shares were issued for legal services.\n● During the three months ended June 30, 2021, the Company sold 3,333,333 shares of common stock for net proceeds of $20,000. With these issuances the company also issued warrants to purchase: (i) 3,333,333 shares at a price of $0.10 per share and (ii) 3,333,333 shares at a price of $0.20. The warrants expire at various times through June 8, 2022. None of the 3,333,333 shares were issued during the quarter ended June 30, 2021, and were recognized as stock payable.\n● During the three months ended June 30, 2021, the Company issued 3,025,952 shares, all of which were converted from 36,300 Preferred C shares.\nThe following information summarizes the warrants outstanding and exercisable.\nWarrants Outstanding and Exercisable at June 30, 2021:\nRange of Exercise Prices Number of Warrants Outstanding Weighted-\nAverage Contractual Life Remining in Years\nWeighted-\nAverage Exercise Price\nNumber Exercisable Weighted-\nAverage Exercise Price\nWarrants Outstanding and Exercisable at June 30, 2020:\n$0.05 - $1.00 53,280,406 1.120 $ 0.33 53,280,406 $ 0.33\nWarrants Outstanding and Exercisable at June 30, 2021:\n$0.10 - $0.20 124,888,519 0.623 $ 0.18 124,888,519 $ 0.623\nSMARTMETRIC INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 6 - STOCKHOLDERS’ DEFICIT (CONTINUED)\nWarrant Activity:\nAs of June 30, 2021 and 2020, the following is a breakdown of the activity:\nJune 30, 2021:\nOutstanding - beginning of year 53,280,406\nIssued 98,500,000\nExercised -\nExpired (26,891,887 )\nOutstanding - end of year 124,888,519\nJune 30, 2020:\nOutstanding - beginning of year 26,526,234\nIssued 34,662,500\nExercised -\nExpired (7,908,328 )\nOutstanding - end of year 53,280,406\nAt June 30, 2021, all of the 124,888,519 warrants are vested, all 124,888,519 warrants expire at various times through June 2022.\nEquity Financing\nOn March 5, 2020, the Company entered into an equity financing agreement with GHS Investments, LLC, a Nevada limited liability company (“Investor”). Pursuant to the agreement, the Company agrees the sell to the investor an indeterminate amount of shares of the Company’s common stock, par value $0.001 per share, up to an aggregate price of four million dollars ($4,000,000).\nPursuant to the agreement, the Company is required, to within sixty (60) calendar days upon the date of execution of this agreement, use its best efforts to file with the SEC a registration statement or registration statements (as is necessary) on Form S-1, covering the resale of all of the registrable securities, which registration statement(s) shall state that, in accordance with Rule 416 promulgated under the 1933 Act, such registration statement also covers such indeterminate number of additional shares of Common Stock as may become issuable upon stock splits, stock dividends or similar transactions. Pursuant to this equity financing agreement, the Company filed the Registration S-1 on August 6, 2020.\nFollowing effectiveness of the Registration Statement, the Company shall have the discretion to deliver puts to GHS and GHS will be obligated to purchase shares of the Company’s common stock, par value $0.001 per share (the “Common Stock”) based on the investment amount specified in each put notice. The maximum amount that the Company shall be entitled to put to GHS in each put notice shall not exceed two hundred percent (200%) of the average daily trading dollar volume of the Company’s Common Stock during the ten (10) trading days preceding the put, so long as such dollar amount does not exceed $500,000. Pursuant to the Equity Financing Agreement, GHS and its affiliates will not be permitted to purchase and the Company may not put shares of the Company’s Common Stock to GHS that would result in GHS’s beneficial ownership, equaling more than 4.99% of the Company’s outstanding Common Stock. The price of each put share shall be equal to eighty percent (80%) of the Market Price (as defined in the Equity Financing Agreement). Puts may be delivered by the Company to GHS until the earlier of thirty-six (36) months after the effectiveness of the Registration Statement. The Registration Statement has not been deemed effective as of the date of this filing.\nConcurrently with the execution of the equity financing agreement, the company entered into a convertible promissory note, for the principal balance of $35,000. Per the terms of the convertible note agreement, the Company agrees to pay the investor interest at the rate of ten percent (10%) until it is due on December 5, 2020. The holder shall have the right at any time to convert all or any part of the outstanding and unpaid principal and interest at a fixed conversion price of $0.0175. See note 5. The $35,000 has been recognized as deferred financing costs in current assets on the accompanying Consolidated Balance Sheet, and will be charged against the gross proceeds of each put when received. Although the Company has not as of yet put to GHS, the agreement is in effect for three years, through March, 2023, and as the Company does plan to put to GHS, the Company has determined it is proper for the deferred costs to remain for the length of the agreement.\nSMARTMETRIC INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 7 - MANDATORY REDEEMABLE CONVERTIBLE PREFERRED STOCK\nIssuances of Series C Mandatory Redeemable Convertible Preferred Stock\nOn January 10, 2019, the Board of Directors of the Company adopted a resolution pursuant to the Company’s Certificate of Incorporation, as amended, providing for the designations, preferences and relative, participating, optional and other rights, and the qualifications, limitations and restrictions, of the Series C Convertible Preferred Stock.\nOn January 14, 2019, the Company filed a Certificate of Designations for a Series C Convertible Preferred Stock. The authorized number of Series C Convertible Preferred Stock is 1,000,000 shares, par value 0.001. The Series C Preferred Stock will, with respect to dividend rights and rights upon liquidation, winding-up or dissolution, rank: (a) senior with respect to dividends and right of liquidation with the Company’s common stock, (b) junior with respect to dividends and right of liquidation with respect to the Company’s Series B Preferred Stock; and (c) junior with respect to dividends and right of liquidation to all existing indebtedness of the Company. Series C Preferred Stock will carry an annual ten percent (10%) cumulative dividend, compounded daily, payable solely upon redemption, liquidation or conversion. The Company will have a right, at any time in the period of 180 days from the date of the issuance, at the Company’s option, to redeem all or any portion of the Series C Preferred Stock at prices ranging from 105% to 130%, based on the passage of time.\nThe number of Series C, mandatory redeemable convertible preferred stock shares issued and outstanding were 239,025 and 117,200, respectively, for June 30, 2021 and June 30, 2020.\nThe Holder shall have the right at any time during the period beginning on the date which is six (6) months following the Issuance Date, to convert all or any part of the outstanding Series C Preferred Stock into fully paid and non-assessable shares of Common Stock at the Variable Conversion Price. The “Variable Conversion Price” shall mean 71% multiplied by the Market Price (representing a discount rate of 29%). “Market Price” means the average of the two (2) lowest Trading Prices (as defined here) for the Common Stock during the fifteen (15) Trading Day period ending on the latest complete Trading Day prior to the Conversion Date.\nOn the date which is eighteen (18) months following the Issuance Date or upon the occurrence of an Event of Default (the “Mandatory Redemption Date”), the Company shall redeem all of the shares of Series C Preferred Stock of the Holder (which have not been previously redeemed or converted). With five (5) days of the Mandatory Redemption Date, the Company shall make payment to each Holder of an amount in cash equal to the total number of shares of Series C Preferred Stock held by such Holder multiplied by the then current Stated Value.\nAll shares of mandatorily redeemable convertible preferred stock have been presented outside of permanent equity in accordance with ASC 480, Classification and Measurement of Redeemable Securities. The Company accretes the carrying value of its Series C mandatory redeemable convertible preferred stock to its estimate of fair value (i.e. redemption value) at period end.\nThe carrying value of the Series C mandatory redeemable convertible preferred stock at June 30, 2021 and 2020 was $196,083 and $101,661, respectively.\nThe estimated fair value of the Series C, mandatory redeemable convertible preferred stock at June 30, 2021 and 2020 was $196,083 and $101,661 respectively.\nThe Company recorded preferred stock dividends of $163,575 and $32,024 and accrued dividends payable of $2,442 and $2,945 during fiscal year end 2021 and 2020, respectively.\nSMARTMETRIC INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 8 - INCOME TAXES\nDeferred income taxes are determined using the liability method for the temporary differences between the financial reporting basis and income tax basis of the Company’s assets and liabilities. Deferred income taxes are measured based on the tax rates expected to be in effect when the temporary differences are included in the Company’s tax return. Deferred tax assets and liabilities are recognized based on anticipated future tax consequences attributable to differences between financial statement carrying amounts of assets and liabilities and their respective tax bases. The Company recognizes interest and penalties related to income tax matters as a component of income tax expense.\nAt June 30, 2021 and 2020, deferred tax assets consist of the following:\nNet operating loss carryforward $ 9,789,107 $ 8,983,161\nWarrant issuances - -\nDeferred officer compensation 737,642 805,848\nOther\nValuation allowance (10,526,749 ) (9,789,107 )\n$ - $ -\nAt June 30, 2021, the Company had a net operating loss carry-forwards in the amount of approximately $28.9 million available to offset future taxable income through 2038. These amounts may be carried forward indefinitely, subject to the 80% of taxable income limitation rule. The Company established valuation allowances equal to the full amount of the deferred tax assets due to the uncertainty of the utilization of the operating losses in future periods. A reconciliation of the Company’s effective tax rate as a percentage of income before taxes and federal statutory rate for the period ended June 30, 2021 and 2020 is summarized as follows:\nTax on income before income tax 21.00 % 21.00 %\nEffect of non-temporary differences (0.01 )% (0.01 )%\nEffect of prior year items - % - %\nEffect of temporary differences - % - %\nChange in valuation allowance (20.99 )% (20.99 )%\n0.00 % 0.00 %\nThe total amount of unrecognized tax benefits can change due to tax examination activities, lapse of applicable statutes of limitations and the recognition and measurement criteria under the guidance related to accounting for uncertainty in income taxes. The Company does not believe any significant increases or decreases will occur within the next twelve months.\nThe Company files income tax returns in the United States (“U.S.”) federal jurisdiction. Generally, the Company is no longer subject to U.S. federal examinations by tax authorities for fiscal years prior to 2017. The Company does not file in any other jurisdiction and remains open for audit for all tax years as the statute of limitations does not begin until the returns are filed. The Company remains subject to U.S. federal examination for tax years ended 2017, 2018, 2019, 2020 and 2021.\nNOTE 9 - LITIGATION\nFrom time to time we may be a defendant or plaintiff in various legal proceedings arising in the normal course of our business. We know of no material, active, pending or threatened proceeding against us or our subsidiaries, nor are we, or any subsidiary, involved as a plaintiff or defendant in any material proceeding or pending litigation.\nNOTE 10 - SUBSEQUENT EVENTS\nIn accordance with ASC 855-10, the Company has reviewed its operations subsequent to June 30, 2021 to the date these financial statements were issued.\nSubsequent to June 30, 2021, the Company issued 48,125 Preferred C shares for $43,745 cash and 26,473,580 common shares. The Company converted 51,850 preferred shares into 5,940,247 common shares.\nINDEX TO EXHIBITS\nIncorporated by Reference\nFiled or\nExhibit\nNumber\nExhibit Description\nForm\nExhibit\nFiling Date\nFurnished\nHerewith\n3.01\nArticles of Incorporation of SmartMetric, Inc. filed 12/18/02\nSB-2\n3.1\n9/3/04\n3.02\nAmendment to Articles of Incorporation dated 12/11/09\n8-K\n3.1\n12/18/09\n3.03\nAmendment to Articles of Incorporation dated June 8, 2016\n10-K\n3.5\n9/28/16\n3.04\nCertificate of Designation of Series B Preferred Stock\n8-K\n3.2\n12/18/09\n3.05\nAmendment to Certificate of Designation of Series B Preferred Stock dated 11/5/14\n10-Q\n3.1\n11/14/14\n3.06\nAmendment to Certificate of Designation of Series B Preferred Stock dated 6/8/16\n10-K\n3.4\n9/28/16\n3.07\nAmended and Restated Bylaws of SmartMetric\n8-K\n3.1\n4/26/16\n3.08\nSeries C Preferred Stock Certificate of Designations dated 1/14/19\n8-K\n3.1\n1/18/19\n4.01\nCommon Stock Certificate Specimen\nX\n4.02\nForm of Warrant issued to May 2013 Investor\n8-K\n4.1\n5/28/13\n4.03\nForm of Warrant issued to investors between 2015 - 2017\n10-K\n4.03\n10/13/17\n4.04*\nSmartMetric, Inc. 2017 Equity Compensation Plan\n10-Q\n4.04\n11/14/17\n4.05*\nForm of Option Grant under 2017 Equity Compensation Plan\n10-Q\n4.05\n11/14/17\n4.06*\nForm of Restricted Stock Grant under 2017 Equity Compensation Plan\n10-Q\n4.06\n11/14/17\n4.07*\nForm of Restricted Stock Unit Grant under 2017 Equity Compensation Plan\n10-Q\n4.07\n11/14/17\n4.08\nConvertible Promissory Note dated March 5, 2020 issued by SmartMetric, Inc. in favor of GHS Investments LLC\nS-1\n4.08\n8/6/20\n10.01*\nAssignment and Assumption Agreement dated 11/12/12 with Applied Cryptography\n8-K\n10.1\n11/16/12\n10.02\nSubscription Agreement with May 2013 Investor\n8-K\n10.1\n5/28/13\n10.03*\nEmployment Agreement dated July 1, 2012 with Chaya Hendrick and Addendum dated 9/30/15\n8-K\n10.8\n10/5/15\n10.05\nForm of Securities Purchase Agreement with investors used between 2015 - 2017\n10-K\n10.05\n10/13/17\n10.06*\nEmployment Agreement with Chaya Hendrick dated July 1, 2017\n10-K\n10.06\n10/13/17\n10.07*\nIssued Patent License and Royalty Agreement dated 9/11/17 with Chaya Hendrick\n10-K\n10.07\n10/13/17\n10.08*\nJay Needelman Services Agreement\n10-K/A\n10.01\n10/27/17\n10.09\nManufacturer’s Representative Agreement\n8-K\n10.01\n12/26/17\n10.10\nAgreement by and between the Company and Hogier Gartner CIA S.A. dated February 16, 2018\n8-K\n10.1\n2/23/18\n10.11\n2018 Professional/Consultant Stock Compensation Plan\nS-8\n10.1\n1/18/18\n10.12\nSecurities Purchase Agreement by and between the Company and Geneva Roth Remark Holdings, Inc., dated January 9, 2019\n8-K\n10.1\n1/18/19\n10.13\nEquity Financing Agreement dated March 5, 2020 by and between SmartMetric, Inc. and GHS Investments LLC\nS-1\n10.13\n8/6/20\n10.14\nRegistration Rights Agreement by and between the Company and GHS Investments LLC, dated March 5, 2020\nS-1\n10.14\n8/6/20\n14.01\nSmartMetric Code of Ethics\nSB-2\n16.1\n9/3/04\n21.01\nSubsidiaries of the Registrant\nS-B/A\n21.1\n2/3/05\n31.1\nCertification by the Principal Executive Officer of Registrant pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (Rule 13a-14(a) or Rule 15d-14(a))\nX\n31.2\nCertification by the Principal Financial Officer of Registrant pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (Rule 13a-14(a) or Rule 15d-14(a))\nX\n32.1\nCertification by the Principal Executive Officer pursuant to 18 U.S.C. 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n32.2\nCertification by the Principal Financial Officer pursuant to 18 U.S.C. 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n101.INS\nXBRL Instance Document\nX\n101.SCH\nXBRL Taxonomy Extension Schema\nX\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase\nX\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase\nX\n101.LAB\nXBRL Taxonomy Extension Label Linkbase\nX\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase\nX\n* Management contracts or compensation plans or arrangements in which directors or executive officers are eligible to participate.",
    "item_9": "",
    "item_9A": "Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nWe maintain “disclosure controls and procedures,” as such term is defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934 (the “Exchange Act”), that are designed to ensure that information required to be disclosed by us in reports that we file or submit under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in Securities and Exchange Commission rules and forms, and that such information is accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate, to allow timely decisions regarding required disclosure. In designing and evaluating our disclosure controls and procedures, management recognized that disclosure controls and procedures, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the disclosure controls and procedures are met. Additionally, in designing disclosure controls and procedures, our management necessarily was required to apply its judgment in evaluating the cost-benefit relationship of possible disclosure controls and procedures. The design of any disclosure controls and procedures also is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions.\nIn connection with the preparation of this Quarterly Report on Form 10-K for the year ended June 30, 2021, our principal executive officer and principal financial officer have concluded that our disclosure controls and procedures (as defined in Rules 13a-15(c) and 15d-15(e) under the Exchange Act) are not effective to ensure that information required to be disclosed by us in report that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the U.S. Securities and Exchange Commission’s rules and forms and to ensure that information required to be disclosed by us in the reports that we file or submit under the Exchange Act is accumulated and communicated to our management, including our Chief Executive Officer, as appropriate to allow timely decisions regarding required disclosure.\nManagement’s Annual Report on Internal Control Over Financial Reporting\nThe management of the Company is responsible for establishing and maintaining adequate internal control over financial reporting (“ICFR”) for the Company. Our internal control system was designed to, in general, provide reasonable assurance to the Company’s management and board regarding the preparation and fair presentation of published financial statements, but because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur management assessed the effectiveness of the Company’s internal control over financial reporting as of June 30, 2021. The framework used by management in making that assessment was the criteria set forth in the document entitled “2013 Internal Control - Integrated Framework” issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on that assessment, management concluded that, during the period covered by this report, such internal controls and procedures were effective as of June 30, 2021.\nA material weakness is a deficiency, or a combination of deficiencies, within the meaning of Public Company Accounting Oversight Board (“PCAOB”) Auditing Standard AS 2201, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the Company’s annual or interim financial statements will not be prevented or detected on a timely basis. Management has not identified any material weaknesses as of June 30, 2021 and our internal controls over financial reporting were effective at the reasonable assurance level.\nDue to our size and nature, segregation of all conflicting duties may not always be possible and may not be economically feasible. However, to the extent possible, the initiation of transactions, the custody of assets and the recording of transactions are being performed by separate individuals.\nThis Annual Report does not include an attestation report of the Company’s registered public accounting firm regarding internal control over financial reporting. Management’s report was not subject to attestation by the Company’s registered public accounting firm as we are a smaller reporting company and are not required to provide the report.\nLimitations on Controls\nManagement does not expect that the Company’s disclosure controls and procedures or the Company’s internal control over financial reporting will prevent or detect all error and fraud. Any control system, no matter how well designed and operated, is based upon certain assumptions and can provide only reasonable, not absolute, assurance that its objectives will be met. Further, no evaluation of controls can provide absolute assurance that misstatements due to error or fraud will not occur or that all control issues and instances of fraud, if any, within the Company have been detected. The Company’s disclosure controls and procedures are designed to provide reasonable assurance of achieving their objectives and the Company’s chief executive officer and chief financial officer have concluded that the Company’s disclosure controls and procedures are not effective.\nDue to our size and nature, segregation of all conflicting duties may not always be possible and may not be economically feasible. However, to the extent possible, the initiation of transactions, the custody of assets and the recording of transactions are being performed by separate individuals. Management evaluated the impact of our limitation to have segregation of duties in all of our financially significant processes and have concluded that this control did not meet the criteria of a material weakness.\nNotwithstanding the assessment that our disclosure controls and procedures and our internal controls over financial reporting were not effective and that there are material weaknesses as identified herein, we believe that our consolidated financial statements contained in this annual report fairly present our financial position, results of operations and cash flows for the periods covered thereby in all material respects.\nChanges in Internal Controls\nDuring the fiscal year ended June 30, 2021, there have been no changes in our internal control over financial reporting that have materially affected or are reasonably likely to materially affect our internal controls over financial reporting",
    "item_9B": "Item 9B. Other Information\nNone.\nPART III",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nThe following table sets forth the names and ages of the members of our Board of Directors and our executive officers and the positions held by each. Each member of the Board of Directors serves for a term of one year, or until his or her successor has been duly elected and has been qualified. Each of our officers serve until they are replaced by the Board of Directors.\nName\nAge\nPosition with the Company\nChaya Hendrick\nPresident, Chief Executive Officer and Chairman of the Board\nJay M. Needelman, CPA\nChief Financial Officer, Director\nElizabeth Ryba\nDirector\nCHAYA HENDRICK has been President, Chief Executive Officer and Chairman of the Board of Directors of SmartMetric since the Company’s inception in 2002. C. Hendrick has served as President and CEO of Smart Micro Chip, Inc., an Australian corporation from 2000 to 2002. From 1999 to 2001, C. Hendrick was President and Chief Executive Officer of Smarticom Inc. and FastEcom, Inc., Australian corporations. From 1994 to 1998, C. Hendrick served as executive officer of Applied Computing Science (Australia), an Australian company involved in e-commerce systems, research and development. Ms. Hendrick founded Asset Developments a property development company that created and sold regional residential land subdivisions. The last being a 1,000-acre subdivision named Claire Valley Estates in the Canberra region of Australia. All of the property development projects were funded by C. Hendrick and were financially profitable. C. Hendrick attended Dandenong College in Australia.\nWe believe Ms. Hendrick is qualified to serve on our Board due to her extensive experience in technology development and as an executive at technology companies.\nJAY M. NEEDELMAN, CPA, has been the Chief Financial Officer and a director of SmartMetric since 2007. Mr. Needelman has over 28 years of experience in public accounting. A 1991 graduate of Florida State University in Tallahassee, Fl, Mr. Needelman began his career in public accounting in Miami, Fl, in 1991. After working for two different firms, Mr. Needelman founded his own firm in late 1992.\nWe believe Mr. Needelman is qualified to serve on our Board due to his financial expertise.\nELIZABETH RYBA has been a director of SmartMetric since April 5, 2006. From 2015 to the present, Ms. Ryba has been Vice President of Marketing at the Design and Decoration Building in New York, one of the premier destinations for luxury interior design showrooms in the country. From 2006 to 2015, Ms. Ryba had marketing positions at two luxury home decor brands. Ms. Ryba was a promotion director at Hearst Publishing from 2002 through 2005. Between 2001 and 2004, Ms. Ryba was a consultant at Stratus Rewards Credit Cards where she launched a Visa Luxury credit card where points were redeemable on private jets. Between 2000 and 2001, Ms. Ryba worked as a Marketing Consultant for SpaFinder. From 1991 through 1999, Ms. Ryba worked at Master Card where she launched a Smart Card in Australia. Ms. Ryba received her M.S. in Marketing from the University of Illinois, and her B.A. in English from the State University of New York at Stony Brook.\nWe believe Ms. Ryba is qualified to serve on our Board due to her extensive experience in the credit card industry as well as her extensive experience in marketing in the luxury sector which we believe is a sector to which we may be able to sell our products.\nFamily Relationships\nThere are no family relationships among officers or directors of the Company.\nCommittees of the Board\nOur business, property and affairs are managed by or under the direction of the Board. Members of the Board are kept informed of our business through discussion with the chief executive and financial officers and other officers, by reviewing materials provided to them and by participating at meetings of the Board. We have not previously had an audit committee, compensation committee or nominations and governance committee.\nAudit Committee\nWe currently do not have an acting audit committee, and our Board of Directors currently acts as our audit committee.\nAudit Committee Financial Expert\nWe do not have an audit committee and thus do not have an audit committee financial expert.\nCompensation Committee\nWe do not presently have a compensation committee. Our Board currently acts as our compensation committee.\nDirector Independence\nFor purposes of determining independence, we have adopted the definition of “independence” contained in the NASDAQ Market Place Rules. Pursuant to the definition, the company has determined that Elizabeth Ryba qualifies as independent.\nCode of Ethics\nThe Company has adopted a Code of Ethics that applies to its Chief Executive Officer and Chief Financial Officer. A copy of the Company’s code of ethics is available to any person without charge upon written request to the Company at SmartMetric, Inc., 3960 Howard Hughes Parkway, Suite 500, Las Vegas, NV, 89109. Attn: Secretary.\nInvolvement in Certain Legal Proceedings\nTo the best of our knowledge, none of our directors or executive officers has, during the past ten years:\n● been convicted in a criminal proceeding or been subject to a pending criminal proceeding (excluding traffic violations and other minor offenses);\n● had any bankruptcy petition filed by or against the business or property of the person, or of any partnership, corporation or business association of which he was a general partner or executive officer, either at the time of the bankruptcy filing or within two years prior to that time;\n● been subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction or federal or state authority, permanently or temporarily enjoining, barring, suspending or otherwise limiting, his involvement in any type of business, securities, futures, commodities, investment, banking, savings and loan, or insurance activities, or to be associated with persons engaged in any such activity;\n● been found by a court of competent jurisdiction in a civil action or by the SEC or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated;\n● been the subject of, or a party to, any federal or state judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated (not including any settlement of a civil proceeding among private litigants), relating to an alleged violation of any federal or state securities or commodities law or regulation, any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order, or any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n● been the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nExcept as set forth in our discussion below in “Certain Relationships and Related Transactions, and Director Independence” none of our directors or executive officers has been involved in any transactions with us or any of our directors, executive officers, affiliates or associates which are required to be disclosed pursuant to the rules and regulations of the SEC.",
    "item_11": "Item 11. Executive Compensation\nSummary Compensation Table\nThe table below sets forth, for the fiscal years ended June 30, 2021 and 2020, the compensation earned by each person acting as our Chief Executive Officer and Chief Financial Officer. The Company’s only employee is our Chief Executive Officer.\nName and Principal Position Fiscal Year Ended Salary ($) Bonus ($) Stock Awards ($) Option Awards ($) Non-equity Incentive Plan Compensation ($) Nonqualified Deferred Compensation Earnings ($) All Other Compensation ($) Total ($)\nChaya Hendrick (President, Chief Executive Officer, $ 190,000 (3) -0- -0- $ 190,000 $ 190,000\nChairman of the Board (1) $ 174,167 (2) -0- -0- $ 15,833 (4) $ 190,000\nJay Needelman (Chief and Principal Financial Officer, $ 15,000 -0- -0- -0- $ 15,000\nDirector) (5) $ 15,000 -0- -0- -0- $ 15,000\n(1) Chaya Hendrick has been President, Chief Executive Officer and director of the Company since inception. Chaya Hendrick also has a car allowance in her employment agreement which she has forgone for the years ended June 30, 2021 and 2020.\n(2) The Company paid Chaya Hendrick $174,167 for the year ended June 30, 2020 out of her total aggregate salary of $190,000, with the remainder being accrued but unpaid. As of June 30, 2021 the Company has accrued $737,642 of unpaid salary, which includes previously accrued but unpaid salary for periods not covered under this Summary Compensation Table.\n(3) The Company paid Chaya Hendrick $190,000 for the year ended June 30, 2021 out of her total aggregate salary of $190,000.\n(4) Includes $0 in accrued but unpaid salary for the year end June 30, 2021. As of June 30, 2021, the Company has accrued $737,642 of unpaid salary, which includes previously accrued but unpaid salary for periods not covered under this Summary Compensation Table.\n(5) Jay Needelman has served as our Chief Financial Officer since 2007. Mr. Needelman receives annual compensation of $15,000 for his services as our Chief Financial Officer.\nOutstanding Equity Awards at Fiscal Year End\nNone.\nChaya Hendrick Employment\nPrevious Employment Agreement\nOn July 1, 2012, the Company entered into an employment agreement (the “Prior Agreement”) with Chaya Hendrick, the Company’s Chief Executive Officer that expired on July 1, 2017. Pursuant to the Prior Agreement, Ms. Hendrick received an annual base salary of $190,000 per year. Ms. Hendrick was also entitled to receive a management fee equal to $50,000 per year beginning with the Company’s fiscal year ended June 30, 2012 and each fiscal year thereafter during the term of the Agreement provided that the Company has manufactured its first product. This fee was to increase by 25% per annum at the conclusion of each calendar year and was based on the continued manufacturing and sales of products by the Company. As of the end of the term of the Prior Agreement, no compensation was paid pursuant to this management fee.\nMs. Hendrick was also entitled to participate in any and all benefit plans, from time to time, in effect for senior management, along with vacation, sick and holiday pay in accordance with the Company’s policies established and in effect from time to time. The Company also provided Ms. Hendrick with the use of an automobile of Ms. Hendrick’s choice at a purchase price not to exceed $60,000. Executive’s employment with the Company was subject to termination at any time, with cause, as such terms are defined in the Prior Agreement.\nThe Prior Agreement may be terminated on 30 days’ notice by Ms. Hendrick but may only be terminated by the Company for “cause.” In the event that Ms. Hendrick’s employment was terminated by the Company, the Company was obligated to pay to Ms. Hendrick an amount equal to $350,000 plus salary remaining on the term of the Prior Agreement.\nAddendum to Prior Agreement\nOn September 30, 2015, the Company and Ms. Hendrick entered into an Addendum to the Agreement (the “Addendum”) pursuant to which in consideration for the issuance of 200,000 shares of the Company’s Series B Convertible Preferred Stock, Ms. Hendrick granted the Company the first right to purchase or license any patents (the “Patent Option”) relating to “Smartcards” which Ms. Hendrick (i) shall apply for with the relevant patent authorities during the term of the Agreement, and (ii) are currently applied for with the relevant patent authorities or pending as of the date of the Prior Agreement (the “Patent Rights”). In exchange for the Patent Option the Company agrees, during the term of the Prior Agreement, to pay for any fees and/or expenses related to the application for the Ms. Hendrick’s Patent Rights with the relevant patent authorities, including, but not limited to, legal or filing fees. If, upon the Company’s receipt of notice of any Patent Rights of Ms. Hendrick’s in writing (“Patent Notification”) the parties fail to successfully negotiate and execute a purchase or license agreement as it relates to the Patent Right that is the subject of such Patent Notification within 60 calendar days of the receipt of such Patent Notification, the Ms. Hendrick shall be permitted to retain or transfer the Patent Rights to a third party without any subsequent notice to the Company.\nAmended and Restated Employment Agreement\nOn July 1, 2017, the Company and Ms. Hendrick entered into an amended and restated employment agreement (“Agreement”) with a duration of sixty (60) months. Pursuant to the Agreement, Ms. Hendrick shall receive (i) an annual base salary of $190,000, subject to adjustment at the end of each fiscal year at the discretion of the board of directors, with a minimum increase of 10% per annum for the duration of the term, (ii) an incentive management fee equal to $50,000 upon the Company manufacturing its first product, which shall increase by 25% per annum and based on the continued manufacturing and sales of products by our Company.\nAdditionally, Ms. Hendrick shall maintain certain rights to initiate, write, invent and / or create inventions separate from SmartMetric, Inc. and to retain the intellectual property rights of such patents, inventions or new products.\nThe Agreement may be terminated on 30 days’ notice by Ms. Hendrick but may only be terminated by the Company for “cause.” In the event that Ms. Hendrick’s employment is terminated by the Company for such “cause,” the Company is obligated to pay to Ms. Hendrick an amount equal to $350,000 plus the remaining salary on the term of the Agreement.\nJay Needelman Contract\nWe currently have an oral agreement with Jay Needelman, our part-time Chief Financial Officer, whereby we pay Mr. Needelman an annual fee of $15,000 for his services, payable in quarterly installments of $3,750.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table sets forth certain information, as of August 5, 2021, with respect to the beneficial ownership of the outstanding common stock by (i) any holder of more than five (5%) percent; (ii) each of the Company’s executive officers and directors; and (iii) the Company’s directors and executive officers as a group. Except as otherwise indicated, each of the stockholders listed below has sole voting and investment power over the shares beneficially owned.\nAmount and Nature of Beneficial Ownership\nTitle of Class\nName and Address of Beneficial Owner\nDirector/Officer\nNumber of\nShares\nof Common\nStock (1)\nPercentage\nof Class (1)\nDirectors and Executive Officers\nCommon Stock\nChaya Hendrick (2)\n145 East Harmon Avenue, Unit 19620\nLas Vegas, NV 89109\nChief Executive Officer,\nChairman of the Board of Directors\n89,127,778 (2)\n20.0 %\nCommon Stock\nJay Needelman, CPA\nWest 47th Street\nMiami Beach, FL 33140\nDirector; Chief Financial Officer\n%\nCommon Stock\nElizabeth Ryba\n73 Brown Road\nScarsdale, New York 10583\nDirector\n40,000\n* %\nAll Executive Officers and Directors as a Group (3 persons)\n89,167,778\n18.9 %\n5% Shareholders\n* Less than one percent (1%)\n(1) In determining beneficial ownership of our common stock as of a given date, the number of shares shown includes shares of common stock which may be acquired on exercise of warrants or options or conversion of convertible securities within 60 days of that date. In determining the percent of common stock owned by a person or entity on June 30, 2021, (a) the numerator is the number of shares of the class beneficially owned by such person or entity, including shares which may be acquired within 60 days on exercise of warrants or options and conversion of convertible securities, and (b) the denominator is the sum of (i) 472,859,208, the total shares of common stock outstanding on September 24, 2021, and (ii) the total number of shares that the beneficial owner may acquire upon conversion of any preferred stock and on exercise of the warrants and options. Unless otherwise stated, each beneficial owner has sole power to vote and dispose of its shares.\n(2) The 89,127,778 shares of common stock include (i) 58,627,778 of Common Stock and; (ii) 610,000 shares of Series B Convertible Preferred Stock convertible into 30,500,000 shares of common stock held by Applied Cryptography, Inc. (“ACI”) and / or Chaya Hendrick. The outstanding shares of Series B Convertible Preferred Stock are entitled to vote on any matter with the holders of Common Stock voting together as one (1) class and shall have that number of votes (identical in every other respect to the voting rights of the holder of common stock entitled to vote at any regular or special meeting of Stockholders) equal to that number of common shares which is not less than 51% of the vote required to approve any action, which Nevada law provides may or must be approved by vote or consent of the common shares or the holders of other securities entitled to vote, if any. Each share of Series B Convertible Preferred Stock is convertible, at the option of the holder, into fifty (50) shares of Common Stock upon the satisfaction of certain conditions and for purposes of determining a quorum of a shareholder meeting, the outstanding shares of Series B Convertible Preferred Stock shall be deemed the equivalent of 51% of all shares of the Company’s Common Stock entitled to vote at such meetings. Our Chairman and Chief Executive Officer, has sole voting and dispositive power over all of the shares beneficially owned by ACI.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nInformation regarding disclosure of an employment relationship or transaction involving an executive officer and any related compensation solely resulting from that employment relationship or transaction is incorporated by reference from the section of this Annual Report on Form10-K entitled “Executive Compensation.”\nInformation related to “Director Independence” is incorporated by reference from the section of this this Annual Report on Form10-K entitled “Directors, Executive Officers, and Corporate Governance.”\nRelated Party Transactions:\n● Chaya Hendrick, our CEO has made cash advances to the Company periodically in exchange for promissory notes of such face values. As of the years ended June 30, 2021 and 2020, we owed $0 and $0, respectively. These notes bear interest at 7.00% per annum.\n● During the years ended June 30, 2021 and 2020, Chaya Hendrick, our CEO deferred $0 and $15,833 in annual salary, respectively. As of June 30, 2021 and 2020, respectively, the Company has accrued the amounts of $737,642 and $759,948 as deferred salary for the difference between Chaya Hendrick’s contractual annual salary and the amounts actually paid. These amounts include previously deferred salary prior to the years ended June 30, 2021 and 2020.\n● On September 30, 2015, we entered into an Addendum to the then existing employment agreement of Chaya Hendrick, pursuant to which in consideration for the issuance of 200,000 shares of the Company’s Series B Convertible Preferred Stock, Chaya Hendrick granted the us the first right to purchase or license any patents (the “Patent Option”) relating to “Smartcards” which the Hendrick (i) shall apply for with the relevant patent authorities during the term of the employment agreement, and (ii) are currently applied for with the relevant patent authorities or pending as of the date of the employment agreement. In exchange for the Patent Option the Company agreed, during the term of the such employment agreement, to pay for any fees and/or expenses related to the application for the such patent rights with the relevant patent authorities, including, but not limited to, legal or filing fees. If, upon our receipt of notice of any patent rights in writing; we and Hendrick fail to successfully negotiate and execute a purchase or license agreement as it relates to such patent rights within 60 calendar days of such receipt, Hendrick shall be permitted to retain or transfer such patent rights to a third party without any subsequent notice to us.\n● On September 11, 2017, we entered into a licensing a royalty agreement with Chaya Hendrick, our founder and CEO, whereby we received a license to certain patents related to our technologies until the expiration of such patents in exchange for the following : (i) the Issuance to Chaya Hendrick of 200,000 Series B Convertible Preferred Shares, (ii) the payment of 5% of gross revenues derived from the sale of products derived from the patents in the future, and (iii) annual payments beginning at $50,000 per annum, increased by 100% of each previous year (offset against 5% gross revenue royalty payments) for the duration of the term of the agreement. The agreement continues until (i) the terms of the licensed patents expire, (ii) we terminate the agreement with notice to Chaya Hendrick, or (iii) Chaya Hendrick terminates the agreement pursuant to a material breach of our duties or payments contained thereunder.",
    "item_14": "Item 14. Principal Accounting Fees and Services\nType of Fees Year end\nJune 30,\nYear end\nJune 30,\nAudit Fees\nPrager Metis, LLC $ 23,000 $ 19,546\nAudit Related Fees\nTax Fees - -\nAll Other Fees $ - -\nTotal Fees $ 23,000 $ 19,546\nPolicy on Pre-Approval of Audit and Permissible Non-audit Services of Independent Auditors\nConsistent with the SEC policies regarding auditor independence, our Board of Directors has responsibility for appointing, setting compensation and overseeing the work of the independent auditor. In recognition of this responsibility, our Board of Directors has established a policy to pre-approve all audit and permissible non-audit services provided by the independent auditor.\nPrior to engagement of the independent auditor for the next year’s audit, management will submit an aggregate of services expected to be rendered during that year for each of the following four categories of services to the Board of Directors for approval.\n1. Audit services include audit work performed in the preparation of financial statements, as well as work that generally only the independent auditor can reasonably be expected to provide, including comfort letters, statutory audits, and attest services and consultation regarding financial accounting and/or reporting standards.\n2. Audit-Related services are for assurance and related services that are traditionally performed by the independent auditor, including due diligence related to mergers and acquisitions, employee benefit plan audits, and special procedures required to meet certain regulatory requirements.\n3. Tax services include all services performed by the independent auditor’s tax personnel except those services specifically related to the audit of the financial statements, and includes fees in the areas of tax compliance, tax planning, and tax advice.\n4. Other Fees are those associated with services not captured in the other categories.",
    "item_15": "Item 15. Exhibits, Financial Statements Schedules\n1. Financial Statements: See “Index to Financial Statements” in Part II, Item 8 of this Form 10-K.\n2. Exhibits: The exhibits listed in the accompanying index to exhibits are filed or incorporated by reference as part of this Form 10-K.\nCertain of the agreements filed as exhibits to this Form 10-K contain representations and warranties by the parties to the agreements that have been made solely for the benefit of the parties to the agreement. These representations and warranties:\n● may have been qualified by disclosures that were made to the other parties in connection with the negotiation of the agreements, which disclosures are not necessarily reflected in the agreements;\n● may apply standards of materiality that differ from those of a reasonable investor;\n● and were made only as of specified dates contained in the agreements and are subject to later developments.\nAccordingly, these representations and warranties may not describe the actual state of affairs as of the date they were made or at any other time, and investors should not rely on them as statements of fact.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nSMARTMETRIC, INC.\nDate: October 12, 2021 By: /s/ Chaya Hendrick\nChaya Hendrick\nPresident, Chief Executive Officer and Chairman\n(Principal Executive Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nName\nTitle\nDate\n/s/ Chaya Hendrick\nChief Executive Officer and Director\nOctober 12,\nChaya Hendrick\n(principal executive officer)\n/s/ Jay Needelman\nChief Financial Officer\nOctober 12,\nJay Needelman\n(principal financial and accounting officer) and Director\n/s/ Elizabeth Ryba\nDirector\nOctober 12,\nElizabeth Ryba\nSMARTMETRIC INC. AND SUBSIDIARY\nCONSOLIDATED FINANCIAL STATEMENTS\nYEARS ENDED JUNE 30, 2021 AND 2020\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nCONSOLIDATED BALANCE SHEETS FOR THE YEARS ENDED JUNE 30, 2021 AND 2020\nCONSOLIDATED STATEMENTS OF OPERATIONS FOR THE YEARS ENDED JUNE 30, 2021 AND 2020\nCONSOLIDATED STATEMENTS OF CASH FLOWS FOR THE YEARS ENDED JUNE 30, 2021 AND 2020\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS’ DEFICIT FOR THE YEARS ENDED JUNE 30, 2021 AND 2020\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nBoyle CPA, LLC\nCertified Public Accountants & Consultants\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and\nBoard of Directors of Smartmetric, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheet of Smartmetric, Inc. (the “Company”) as of June 30, 2021, the related consolidated statements of operations, changes in stockholders’ (deficit), and cash flows for the year ended June 30, 2021, and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2021, and the results of its operations and its cash flows for the year ended June 30, 2021, in conformity with accounting principles generally accepted in the United States of America.\nSubstantial Doubt About the Company’s Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the financial statements, the Company has sustained recurring losses and has an accumulated deficit as of June 30, 2021. These factors raise substantial doubt about its ability to continue as a going concern for one year from the issuance of these financial statements. Management’s plans are also described in Note 1. The financial statements do not include adjustments that might result from the outcome of this uncertainty.\nBasis of Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (“PCAOB”) and are required to be independent with respect to the Company in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with standards of the Public Company Accounting Oversight Board (United States). Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to fraud or error. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ Boyle CPA, LLC\nWe have served as the Company’s auditor since 2021\nRed Bank, NJ\nOctober 12, 2021\n331 Newman Springs Road P (732) 784-1582\nBuilding 1, 4th Floor, Suite 143 F (732) 510-0665\nRed Bank, NJ 0770\nSMARTMETRIC, INC. AND SUBSIDIARY\nConsolidated Balance Sheet\n(Audited)\nJune 30,\nJune 30,\n(Audited)\n(Audited)\nAssets\nCurrent assets:\nCash\n$ 10,325\n$ 71,377\nPrepaid expenses and other current assets\n5,000\n7,020\nTotal current assets\n15,325\n78,397\nNon-current assets\nDeferred financing costs\n35,000\n35,000\nTotal assets\n$ 50,325\n$ 113,397\nLiabilities and Stockholders’ Deficit\nCurrent liabilities:\nAccounts payable and accrued expenses\n$ 1,073,786\n$ 916,728\nLiability for stock to be issued\n127,321\n50,000\nDeferred Officer’s salary\n737,642\n759,948\nRelated party interest payable\n201,846\n149,481\nDividends payable\n2,442\n2,945\nDue to shareholders\n41,343\n41,343\nCovid19 SBA loan\n41,664\n20,832\nConvertible note payable, net of discount\n35,000\n32,127\nDerivative liability\n45,524\n-\nConvertible interest payable\n3,801\n-\nInterest payable\n-\nShareholder loan\n-\n-\nTotal current liabilities\n2,331,244\n1,973,404\nCommitments and contingencies (See note 4)\nSeries C mandatory redeemable convertible preferred stock, net of discount, authorized 1000,000 shares, 239,025 and 117,200 shares issued and outstanding, respectively\n196,083\n101,661\nStockholders’ deficit:\nPreferred stock, $.001 par value; 5,000,000 shares authorized, 610,000 and 610,000 shares issued and outstanding\nClass A Preferred stock, $.001 par value; 50,000,000 shares authorized 0 and 0 shares issued and outstanding Common stock, $.001 par value; 600,000,000 shares authorized, 446,385,628 and 379,523,000 shares issued and outstanding, respectively\n446,386\n379,524\nAdditional paid-in capital\n25,955,367\n25,429,261\nAccumulated deficit\n(28,859,365 )\n(27,771,062 )\nTotal stockholders’ deficit\n(2,457,002 )\n(1,961,668 )\nTotal liabilities and stockholders’ deficit\n$ 50,325\n$ 113,397\nSee notes to consolidated financial statements.\nSMARTMETRIC, INC. AND SUBSIDIARY\nConsolidated Statements Of Operations\n(Audited)\nYear\nYear\nEnded\nEnded\nJune 30,\nJune 30,\n(Audited)\n(Audited)\nRevenues\n$ -\n$ -\nExpenses:\nOfficer’s salary\n190,000\n190,000\nOther general and administrative\n555,480\n468,238\nResearch and development\n76,344\n89,240\nTotal operating expenses\n821,824\n747,478\nLoss from operations before income taxes\n(821,824 )\n(747,478 )\nInterest & Financing Expense\n(59,914 )\n(58,099 )\nGain (loss) on change in derivatives\n(42,990 )\n-\nNet loss\n(924,728 )\n(805,577 )\nPreferred stock dividends\n(163,575 )\n(32,024 )\nNet loss available for common stockholders\n$ (1,088,303 )\n$ (837,601 )\nNet loss per share, basic and diluted\n$ (0.00 )\n$ (0.00 )\nWeighted average number of common shares outstanding, basic and diluted\n413,974,288\n299,094,207\nSee notes to consolidated financial statements.\nSMARTMETRIC, INC. AND SUBSIDIARY\nConsolidated Statements of Changes In Stockholders’ (Deficit)\n(Audited)\nPreferred\nSeries C\nAdditional\nPaid\nAccumulated\nStock\nCommon Stock\nIn Capital\nDeficit\nTotal\nBalance June 30, 2019\n610,000\n$\n-\n$ -\n264,648,821\n$ 264,649\n$ 24,663,528\n$ (26,933,461 )\n$ (2,004,674 )\nShares issued of common stock for warrants and cash\n-\n-\n-\n-\n97,584,162\n97,584\n576,703\n-\n$ 674,287\nPreferred C shares Converted to Common\n-\n-\n-\n-\n17,240,017\n17,240\n182,580\n-\n$ 199,820\nBeneficial conversion feature related to convertible debt\n-\n-\n-\n-\n-\n-\n5,000\n-\n5,000\nSeries C dividends\n-\n-\n-\n-\n-\n-\n-\n(32,024 )\n(32,024 )\nShares of Common Stock issued for services\n-\n-\n-\n-\n50,000\n1,450\n-\n1,500\nNet loss for period\n-\n-\n-\n-\n-\n-\n-\n(805,577 )\n(805,577 )\nBalance June 30, 2020\n610,000\n$\n-\n$ -\n379,523,000\n$ 379,523\n$ 25,429,261\n$ (27,771,062 )\n$ (1,966,668 )\nCommon shares issued for services\n-\n-\n-\n-\n3,145,440\n3,145\n15,780\n-\n18,925\nShares issued of common stock and warrants for cash\n-\n-\n-\n-\n32,500,000\n32,500\n130,000\n-\n162,500\nShares converted from Preferred C shares to common\n-\n-\n-\n-\n31,217,188\n31,218\n172,149\n-\n203,367\nValuation of Preferred C & derivative liability\n-\n-\n-\n-\n-\n-\n208,177\n-\n208,177\nPreferred C dividends\n-\n-\n-\n-\n-\n-\n-\n(163,575 )\n(163,575 )\nNet loss for period\n-\n-\n-\n-\n-\n-\n-\n(924,728 )\n(924,728 )\nBalance June 30, 2021\n610,000\n$\n-\n$ -\n446,385,628\n$ 446,386\n$ 25,955,367\n$ (28,859,365 )\n$ (2,457,002 )\nSee notes to consolidated financial statements.\nSMARTMETRIC, INC. AND SUBSIDIARY\nConsolidated Statements Of Cash Flows\nYear\nYear\nEnded Ended\nJune 30, June 30,\n(Audited) (Audited)\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss $ (924,728 ) $ (805,577 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nCommon stock issued and issuable for services 18,926 1,500\nNon cash financing expense 49,322 -\nGain (loss) on fair value of derivative liability 112,565 -\nAmortization of debt discount 2,873 2,127\nChanges in assets and liabilities\nIncrease (Decrease) in prepaid expenses and other current assets 2,017 (567 )\nIncrease in accounts payable and accrued expenses 157,058 32,588\n(Decrease) in deferred officer salary (22,306 ) (30,067 )\nIncrease in Convertible interest payable 3,801 -\nIncrease in accrued interest payable 52,365 55,993\nNet cash used in operating activities (567,582 ) (744,003 )\nCASH FLOWS FROM FINANCING ACTIVITIES\nLoans from related parties - (3,759 )\nProceeds from notes payable - 35,000\nDeferred financing costs - (35,000\n)\nProceeds from sale of common stock 240,698 576,803\nProceeds from CARES Act PPP loan 20,832 20,832\nDue to shareholder - 41,343\nProceeds from sale of Series C Preferred stock 245,000 170,000\nNet cash provided by financing activities 506,530 805,219\nNET INCREASE (DECREASE) IN\nCASH (61,052 ) 61,216\nCASH BEGINNING OF PERIOD 71,377 10,161\nEND OF PERIOD 10,325 71,377\nNon-cash investing and financing activities $ 66,000 $ 191,636\nConversion of 72,600 & 104,000 Preferred C Shares into 21,482,136 & 5,595,339 shares of common stock\nCASH PAID DURING THE PERIOD FOR: $ - $ -\nIncome taxes $ - $ -\nInterest\nSee notes to consolidated financial statements.\nSMARTMETRIC INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1 - ORGANIZATION AND BASIS OF PRESENTATION\nSmartMetric, Inc. (the “Company” or “SmartMetric”) was incorporated in the State of Nevada on December 18, 2002. SmartMetric’s main product is a fingerprint sensor-activated card with a finger sensor onboard the card and a built-in rechargeable battery for portable biometric identification. This card may be referred to as a biometric card or the SmartMetric Biometric Datacard. SmartMetric has completed development of its card along with pre-mass manufacturing cards but has not yet begun to mass manufacture the biometric fingerprint activated cards.\nBasis of Presentation\nThe financial statements present the balance sheets, statements of operations, stockholder’s equity (deficit) and cash flows of the Company. The financial statements of the Company have been prepared in accordance with generally accepted accounting principles in the United States of America.\nThe Company has adopted June 30 as its fiscal year end.\nGoing Concern\nAs shown in the accompanying condensed consolidated financial statements the Company has sustained recurring losses of $924,728 and $805,577 for the period ended June 30, 2021 and 2020, respectively, and has an accumulated deficit of $28,859,365 at June 30, 2021.\nThese conditions raise substantial doubt about the Company’s ability to continue as a going concern within one year of the date of this filing. The financial statements do not include any adjustments relating to the recoverability and classification of asset carrying amounts or the amount and classification of liabilities that might be necessary should the Company be unable to continue as a going concern. The COVID-19 has had an impact on SmartMetric’s final card production. While the delays are due to supply line disruption, the Company is confident that these delays will be short-lived based on advice from our manufacturing partners, manufacturing alternatives and alternative supply lines that are being put into place by the Company.\nManagement believes that the Company’s capital requirements will depend on many factors. These factors include product marketing and distribution. The management plans include equity sales and borrowing in order to fund the operations. The Company plans to continue its relationship with Geneva Roth Remark in order to raise capital through means other than private placement stock sales.\nThere are no assurances that the Company will be able to achieve the level of revenues adequate to generate sufficient cash flow from operations to support the Company’s working capital requirements. To the extent that funds generated are insufficient, the Company will have to raise additional working capital. No assurance can be given that additional financing will be available, or if available, will be on terms acceptable to the Company. If adequate working capital is not available, the Company may not continue its operations.\nOn March 5, 2020, the Company entered into an agreement with GHS Investments, LLC whereas the investor agrees to invest up to four million dollar ($4,000,000) over the 36 months immediately subsequent to the effective date of the agreement.\nIn December 2019, an outbreak of a novel strain of coronavirus originated in Wuhan, China (“COVID-19”) and has since spread worldwide, including to the Unites States, posing public health risks that have reached pandemic proportions (the “COVID-19 Pandemic”). The COVID-19 Pandemic poses a threat to the health and economic wellbeing of our employees, customers and vendors. Like most businesses world-wide, the COVID-19 Pandemic has impacted the Company financially; delaying the beginning of production.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nRecent Accounting Pronouncements\nThe Company does not expect the adoption of recently issued accounting pronouncements to have a significant impact on the Company’s results of operations, financial position or cash flow except as noted below.\nIn February 2016, the FASB issued authoritative guidance ASC 842, “Leases.” This guidance requires lessees to recognize most leases on the balance sheet by recording a right-of-use asset and a lease liability. The Company has made the decision to adopt this guidance early, and it was adopted by the Company as of March 1, 2019. Based on the completed analysis, the Company has determined that the adjustment did not have a material impact on the financial statements.\nIn June 2018, the FASB issued ASU 2018-07, Compensation-Stock Compensation (Topic 718): Improvements to Nonemployee Share-Based Payment Accounting, which aligns accounting for share-based payments issued to nonemployees to that of employees under the existing guidance of Topic 718, with certain exceptions. This update supersedes previous guidance for equity-based payments to nonemployees under Subtopic 505-50, Equity-Equity-Based Payments to Non-Employees. This guidance was adopted by the Company as of March 1, 2019. Based on the completed analysis, the Company has determined the adjustment did not have a material impact on the financial statements.\nSMARTMETRIC INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (CONTINUED)\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of the Company and its wholly owned subsidiary, SmartMetric Australia Pty. Ltd. All significant intercompany accounts and transactions have been eliminated in consolidation.\nFair Value of Financial Instruments\nThe carrying amounts reflected in the balance sheets for cash, accounts payable and related party payables approximate the respective fair values due to the short maturities of these items.\nAs required by the Fair Value Measurements and Disclosures Topic of the FASB ASC, fair value is measured based on a three-tier fair value hierarchy, which prioritizes the inputs used in measuring fair value as follows: (Level 1) observable inputs such as quoted prices in active markets; (Level 2) inputs, other than the quoted prices in active markets, that are observable either directly or indirectly; and (Level 3) unobservable inputs in which there is little or no market data, which require the reporting entity to develop its own assumptions.\nThe three levels of the fair value hierarchy are described below:\nLevel 1: Unadjusted quoted prices in active markets that are accessible at the measurement date for identical, unrestricted assets or liabilities;\nLevel 2: Quoted prices in markets that are not active, or inputs that are observable, either directly or indirectly, for substantially the full term of the asset or liability;\nLevel 3: Prices or valuation techniques that require inputs that are both significant to the fair value measurement and unobservable (supported by little or no market activity).\nThe Company at present does not have any Level 2 or Level 3 fair value instruments.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. On an ongoing basis, the Company evaluates its estimates, including, but not limited to, those related to income taxes and contingencies. The Company bases its estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying value of assets and liabilities that are not readily apparent from other sources. Actual results could differ from those estimates.\nCash\nThe Company considers all highly liquid debt instruments and other short-term investments with an initial maturity of three months or less to be cash equivalents. Any amounts of cash in financial institutions which exceed FDIC insured limits exposes the Company to cash concentration risk. The Company had no cash equivalents at June 30, 2021 and 2020.\nResearch and Development\nResearch and development costs are charged to expense as incurred. Our research and development expenses consist primarily of expenditures for electronics design and engineering, software design and engineering, component sourcing, component engineering, manufacturing, product trials, compensation and consulting costs.\nRevenue Recognition\nThe Company has not recognized revenues to date. Therefore, the Company has not yet adopted a revenue recognition policy.\nSMARTMETRIC INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (CONTINUED)\nReclassifications\nCertain prior year amounts have been reclassified for consistency with the current period presentation. These reclassifications had no effect on the reported results of operations.\nUncertainty in Income Taxes\nGAAP requires the recognition and measurement of uncertain income tax positions using a “more-likely-than-not” approach. Management evaluates Company tax positions on an annual basis and has determined that as of June 30, 2021 and 2020, no accrual for uncertain income tax positions is necessary.\nLoss Per Share of Common Stock\nIn accordance with FASB ASC 260, “Earnings Per Share,” the basic loss per share is computed by dividing the loss attributable to common stockholders by the weighted average number of common shares outstanding during the period. Basic net loss per share excludes the dilutive effect of stock options or warrants and convertible notes. Diluted net earnings (loss) per common share is determined using the weighted-average number of common shares outstanding during the period, adjusted for the dilutive effect of common stock equivalents, consisting of shares that might be issued upon exercise of common stock options and warrants. In periods where losses are reported, the weighted-average number of common shares outstanding excludes common stock equivalents, because their inclusion would be anti-dilutive. As of June 30, 2021 and 2020, 124,888,519 and 53,280,406 dilutive shares were excluded from the calculation of diluted loss per common share, with all dilutive shares being Common stock warrants at June 30, 2021 and 2020.\nNOTE 3 - PREPAID EXPENSES\nPrepaid expenses were $5,000 at June 30, 2021.\nSMARTMETRIC INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 4 - COMMITMENTS\nLease Agreement\nThe Company’s main office is in Las Vegas, Nevada. Rent expense under all leases for the years ended June 30, 2021 and 2020 was $5,238 and $5,133 respectively. The Company maintains only one office. This office is in Las Vegas, NV and is a month-to-month lease.\nRelated Party Transactions\nThe Company’s Chief Executive Officer has made cash advances to the Company with an aggregate amount due of $0 and $0 as of June 30, 2021 and 2020, respectively. These advances bear interest at 7.00% per annum.\nAs of June 30, 2021 and June 30, 2020, the Company has accrued the amounts of $737,642 and $759,948, respectively, as deferred Officer’s salary for the difference between the president’s annual salary and the amounts paid.\nAs a result of these shareholder loans and deferred officer salary, the Company has accrued a balance of $201,846 and $149,481 as interest payable as of June 30, 2021 and 2020.\nOn September 11, 2017, we received a license to certain patents from Chaya Hendrick, our founder and CEO, related to our technologies until the expiration of the patents. As consideration, we issued Chaya Hendrick, or her assigns, (i) 200,000 shares of Series B Convertible Preferred Stock, (ii) a royalty equal to 5% of gross revenues derived from products sold related to the patents, and (iii) certain minimum required payments beginning at $50,000 and doubling each year thereafter. The Series B Preferred Shares may be converted at the election of holder on a basis for 50 common shares for each preferred share at any time or an aggregate of 10,000,000 common shares in exchange for all 200,000 preferred shares.\nOur CEO maintains an employment agreement that stipulates a $190,000 annual salary. This agreement is in effect until mutual agreement between its CEO and the Company to terminate.\nNOTE 5 - DEBT\nIn March of 2020, the Company applied for the SBA PPP government loan and was approved. On April 17,2020, the Company received $20,832 as proceeds from this loan. The Company successfully applied to have this loan forgiven.\nIn March of 2021, the Company applied for the SBA PPP government loan and was approved. On March 29, 2021, the Company received $20,832 as proceeds from this loan.\nOn March 5, 2020, the Company issued a $35,000 10% convertible note. The note was due on December 5, 2020 and is convertible at a rate of $0.0175 per share which resulted in a discount from the beneficial conversion feature totalling $5,000. During the year ended June 30, 2020, $2,127 of the debt discount was amortized. During the year ended June 30, 2021, the remaining $2,873 of the debt discount was amortized As of June 30, 2021, the note was shown net of unamortized discount of $35,000.\nThe 10% convertible note is currently in default. Upon default, the fixed conversion price became a Variable Conversion Price, which is 70% multiplied by the lowest trading price for the Company’s common stock during the 20 trading day period ending on the latest complete trading day prior to the conversion date.\nThe Company analyzed the conversion option for derivative accounting consideration under ASC 815, “Derivatives and Hedging,” and determined that the convertible notes should be classified as a liability since the conversion option becomes effective at default resulting in there being no explicit limit to the number of shares to be delivered upon settlement of the above conversion options. The Company has recorded the embedded derivative liability at its’ fair value utilizing the Black-Scholes Merton option pricing model, as follows:\nLevel 1 Level 2 Level 3 Total\nDerivative liability $ - $ - $ 45,524 $ 45,524\nNOTE 6 - STOCKHOLDERS’ DEFICIT\nPreferred Stock\nAs of June 30, 2021, the Company has 5,000,000 shares of Series B preferred stock, par value $0.001, authorized and 610,000 shares issued and outstanding.\nEach share of Series B Convertible Preferred Stock has a par value of $0.001, and a stated value equal to $5.00 (“Stated Value”). Holders of the Series B Convertible Preferred Stock are entitled to receive dividends or other distributions with the holders of the common stock of the Company on an as converted basis when, as, and if declared by the directors of the Company. Holders of the Series B Convertible Preferred Stock are entitled to convert all or any one (1) share of the Series B Convertible Preferred Stock into fifty (50) shares of common stock.\nSMARTMETRIC INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 6 - STOCKHOLDERS’ DEFICIT (CONTINUED)\nUpon any liquidation, dissolution or winding-up of the Company, whether voluntary or involuntary (“liquidation”), holders of the Series B Convertible Preferred Stock are entitled to receive out of the assets, whether capital or surplus, of the Company an amount equal to the Stated Value, pro rata with the holders of the common stock.\nThe Company issued 200,000 Series B preferred shares upon its inception in 2004.\nIn October 2015, the Company issued 200,000 Series B preferred shares.\nOn September 11, 2017, the Company issued an additional 210,000 shares of Series B preferred shares to its CEO, Chaya Hendrick, in consideration for grant of exclusive rights to the licensed patent.\nClass A Common Stock\nAs of June 30, 2021, the Company has 50,000,000 shares of Class A common stock, par value $0.001, authorized and no shares issued and outstanding.\nDuring the three month period ending December 31, 2019, the Company increased its total number of shares of authorized capital stock to 600,000,000 shares, par value $0.001 per share.\nCommon Stock and Warrants\n● During the three months ended September 30, 2019, the Company sold for cash 6,337,500 shares of common stock and warrants to purchase: (i) 6,337,500 shares at prices ranging from $0.10 per share to $0.25 per share for net proceeds of $133,495. The warrants expire at various times through September 17, 2021. None of these shares were issued during the quarter ended September 30, 2019, with all 6,337,500 shares being recorded as stock payable.\n● During the three months ended December 31, 2019, the Company sold for cash 40,675,000 shares of common stock and warrants to purchase: (i) 825,000 shares at prices ranging from $0.20 per share to $0.25 per share for net proceeds of $214,510. The warrants expire at various times through November 1, 2021. None of these shares were issued during the quarter ended December 31, 2019, with all 40,675,000 shares being recorded as stock payable. There were 36,300 Preferred C shares converted to 2,370,696 Common shares for the three month period ending December 31, 2019, see Note 6.\n● During the three months ended March 31, 2020, the Company sold for cash 9,550,000 shares of common stock and warrants to purchase: (i) 3,500,000 shares at prices ranging from $0.05 per share to $1.00 per share for net proceeds of $66,500. The warrants expire at various times through March 12, 2022. None of these shares were issued during the quarter ended March 31, 2020, with all 9,550,000 shares being recorded as stock payable.\n● During the three months ended June 30, 2020, the Company sold for cash 40,000,000 shares of common stock and warrants to purchase: (i) 12,000,000 shares at prices ranging from $0.10 per share to $0.20 per share for net proceeds of $200,905. The warrants expire at various times through June 12, 2021. 31,000,000 of these shares were issued during the quarter ended June 30, 2020, with 9,000,000 shares being recorded as stock payable.\n● During the three months ended September 30, 2020, the Company sold for cash 17,500,000 shares of common stock and warrants to purchase: (i) 17,500,000 shares at prices ranging from $0.05 per share to $0.10 per share and (ii) 14,500,000 shares at prices ranging from $0.10 to $0.20 for net proceeds of $77,409. The warrants expire at various times through September 21, 2022. All 17,500,000 of these shares were issued during the quarter ended December 31, 2020, with all 17,500,000 shares being recorded as stock payable. The Company issued 6,032,260 shares. Of these shares, 585,000 were issues for consulting services and 5,447,260 were converted from Preferred shares.\nSMARTMETRIC INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 6 - STOCKHOLDERS’ DEFICIT (CONTINUED)\n● During the three months ended December 31, 2020, the Company sold 16,500,000 shares of common stock for net proceeds of $82,455. With these issuances the company also issued warrants to purchase: (i) 16,500,000 shares at prices ranging from $0.05 to $0.10 per share and (ii) 16,500,000 shares at prices ranging from $0.10 to $0.20 and (iii) 1,500,000 at a price of $0.30. The warrants expire at various times through December 21, 2022. None of the 16,500,000 shares were issued during the quarter ended December 31, 2020, and were recognized as stock payable.\n● During the three months ended December 31, 2020, the Company issued 32,034,876 shares for $75,000, of which 15,000,000 were issued from stock payable and 16,034,876 were converted from 78,100 Preferred shares.\n● During the three months ended March 31, 2021, the Company sold 11,000,000 shares of common stock for net proceeds of $59,957. With these issuances the company also issued warrants to purchase: (i) 12,000,000 shares at a price of $0.10 per share and (ii) 12,000,000 shares at a price of $0.20. The warrants expire at various times through February 4, 2022. None of the 12,000,000 shares were issued during the quarter ended March 31, 2021, and were recognized as stock payable.\n● During the three months ended March 31, 2021, the Company issued 26,769,540 shares, of which 17,000,000 were issued from stock payable, 6,709,100 were converted from 72,600 Preferred shares and 2,560,440 shares were issued for legal services.\n● During the three months ended June 30, 2021, the Company sold 3,333,333 shares of common stock for net proceeds of $20,000. With these issuances the company also issued warrants to purchase: (i) 3,333,333 shares at a price of $0.10 per share and (ii) 3,333,333 shares at a price of $0.20. The warrants expire at various times through June 8, 2022. None of the 3,333,333 shares were issued during the quarter ended June 30, 2021, and were recognized as stock payable.\n● During the three months ended June 30, 2021, the Company issued 3,025,952 shares, all of which were converted from 36,300 Preferred C shares.\nThe following information summarizes the warrants outstanding and exercisable.\nWarrants Outstanding and Exercisable at June 30, 2021:\nRange of Exercise Prices Number of Warrants Outstanding Weighted-\nAverage Contractual Life Remining in Years\nWeighted-\nAverage Exercise Price\nNumber Exercisable Weighted-\nAverage Exercise Price\nWarrants Outstanding and Exercisable at June 30, 2020:\n$0.05 - $1.00 53,280,406 1.120 $ 0.33 53,280,406 $ 0.33\nWarrants Outstanding and Exercisable at June 30, 2021:\n$0.10 - $0.20 124,888,519 0.623 $ 0.18 124,888,519 $ 0.623\nSMARTMETRIC INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 6 - STOCKHOLDERS’ DEFICIT (CONTINUED)\nWarrant Activity:\nAs of June 30, 2021 and 2020, the following is a breakdown of the activity:\nJune 30, 2021:\nOutstanding - beginning of year 53,280,406\nIssued 98,500,000\nExercised -\nExpired (26,891,887 )\nOutstanding - end of year 124,888,519\nJune 30, 2020:\nOutstanding - beginning of year 26,526,234\nIssued 34,662,500\nExercised -\nExpired (7,908,328 )\nOutstanding - end of year 53,280,406\nAt June 30, 2021, all of the 124,888,519 warrants are vested, all 124,888,519 warrants expire at various times through June 2022.\nEquity Financing\nOn March 5, 2020, the Company entered into an equity financing agreement with GHS Investments, LLC, a Nevada limited liability company (“Investor”). Pursuant to the agreement, the Company agrees the sell to the investor an indeterminate amount of shares of the Company’s common stock, par value $0.001 per share, up to an aggregate price of four million dollars ($4,000,000).\nPursuant to the agreement, the Company is required, to within sixty (60) calendar days upon the date of execution of this agreement, use its best efforts to file with the SEC a registration statement or registration statements (as is necessary) on Form S-1, covering the resale of all of the registrable securities, which registration statement(s) shall state that, in accordance with Rule 416 promulgated under the 1933 Act, such registration statement also covers such indeterminate number of additional shares of Common Stock as may become issuable upon stock splits, stock dividends or similar transactions. Pursuant to this equity financing agreement, the Company filed the Registration S-1 on August 6, 2020.\nFollowing effectiveness of the Registration Statement, the Company shall have the discretion to deliver puts to GHS and GHS will be obligated to purchase shares of the Company’s common stock, par value $0.001 per share (the “Common Stock”) based on the investment amount specified in each put notice. The maximum amount that the Company shall be entitled to put to GHS in each put notice shall not exceed two hundred percent (200%) of the average daily trading dollar volume of the Company’s Common Stock during the ten (10) trading days preceding the put, so long as such dollar amount does not exceed $500,000. Pursuant to the Equity Financing Agreement, GHS and its affiliates will not be permitted to purchase and the Company may not put shares of the Company’s Common Stock to GHS that would result in GHS’s beneficial ownership, equaling more than 4.99% of the Company’s outstanding Common Stock. The price of each put share shall be equal to eighty percent (80%) of the Market Price (as defined in the Equity Financing Agreement). Puts may be delivered by the Company to GHS until the earlier of thirty-six (36) months after the effectiveness of the Registration Statement. The Registration Statement has not been deemed effective as of the date of this filing.\nConcurrently with the execution of the equity financing agreement, the company entered into a convertible promissory note, for the principal balance of $35,000. Per the terms of the convertible note agreement, the Company agrees to pay the investor interest at the rate of ten percent (10%) until it is due on December 5, 2020. The holder shall have the right at any time to convert all or any part of the outstanding and unpaid principal and interest at a fixed conversion price of $0.0175. See note 5. The $35,000 has been recognized as deferred financing costs in current assets on the accompanying Consolidated Balance Sheet, and will be charged against the gross proceeds of each put when received. Although the Company has not as of yet put to GHS, the agreement is in effect for three years, through March, 2023, and as the Company does plan to put to GHS, the Company has determined it is proper for the deferred costs to remain for the length of the agreement.\nSMARTMETRIC INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 7 - MANDATORY REDEEMABLE CONVERTIBLE PREFERRED STOCK\nIssuances of Series C Mandatory Redeemable Convertible Preferred Stock\nOn January 10, 2019, the Board of Directors of the Company adopted a resolution pursuant to the Company’s Certificate of Incorporation, as amended, providing for the designations, preferences and relative, participating, optional and other rights, and the qualifications, limitations and restrictions, of the Series C Convertible Preferred Stock.\nOn January 14, 2019, the Company filed a Certificate of Designations for a Series C Convertible Preferred Stock. The authorized number of Series C Convertible Preferred Stock is 1,000,000 shares, par value 0.001. The Series C Preferred Stock will, with respect to dividend rights and rights upon liquidation, winding-up or dissolution, rank: (a) senior with respect to dividends and right of liquidation with the Company’s common stock, (b) junior with respect to dividends and right of liquidation with respect to the Company’s Series B Preferred Stock; and (c) junior with respect to dividends and right of liquidation to all existing indebtedness of the Company. Series C Preferred Stock will carry an annual ten percent (10%) cumulative dividend, compounded daily, payable solely upon redemption, liquidation or conversion. The Company will have a right, at any time in the period of 180 days from the date of the issuance, at the Company’s option, to redeem all or any portion of the Series C Preferred Stock at prices ranging from 105% to 130%, based on the passage of time.\nThe number of Series C, mandatory redeemable convertible preferred stock shares issued and outstanding were 239,025 and 117,200, respectively, for June 30, 2021 and June 30, 2020.\nThe Holder shall have the right at any time during the period beginning on the date which is six (6) months following the Issuance Date, to convert all or any part of the outstanding Series C Preferred Stock into fully paid and non-assessable shares of Common Stock at the Variable Conversion Price. The “Variable Conversion Price” shall mean 71% multiplied by the Market Price (representing a discount rate of 29%). “Market Price” means the average of the two (2) lowest Trading Prices (as defined here) for the Common Stock during the fifteen (15) Trading Day period ending on the latest complete Trading Day prior to the Conversion Date.\nOn the date which is eighteen (18) months following the Issuance Date or upon the occurrence of an Event of Default (the “Mandatory Redemption Date”), the Company shall redeem all of the shares of Series C Preferred Stock of the Holder (which have not been previously redeemed or converted). With five (5) days of the Mandatory Redemption Date, the Company shall make payment to each Holder of an amount in cash equal to the total number of shares of Series C Preferred Stock held by such Holder multiplied by the then current Stated Value.\nAll shares of mandatorily redeemable convertible preferred stock have been presented outside of permanent equity in accordance with ASC 480, Classification and Measurement of Redeemable Securities. The Company accretes the carrying value of its Series C mandatory redeemable convertible preferred stock to its estimate of fair value (i.e. redemption value) at period end.\nThe carrying value of the Series C mandatory redeemable convertible preferred stock at June 30, 2021 and 2020 was $196,083 and $101,661, respectively.\nThe estimated fair value of the Series C, mandatory redeemable convertible preferred stock at June 30, 2021 and 2020 was $196,083 and $101,661 respectively.\nThe Company recorded preferred stock dividends of $163,575 and $32,024 and accrued dividends payable of $2,442 and $2,945 during fiscal year end 2021 and 2020, respectively.\nSMARTMETRIC INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 8 - INCOME TAXES\nDeferred income taxes are determined using the liability method for the temporary differences between the financial reporting basis and income tax basis of the Company’s assets and liabilities. Deferred income taxes are measured based on the tax rates expected to be in effect when the temporary differences are included in the Company’s tax return. Deferred tax assets and liabilities are recognized based on anticipated future tax consequences attributable to differences between financial statement carrying amounts of assets and liabilities and their respective tax bases. The Company recognizes interest and penalties related to income tax matters as a component of income tax expense.\nAt June 30, 2021 and 2020, deferred tax assets consist of the following:\nNet operating loss carryforward $ 9,789,107 $ 8,983,161\nWarrant issuances - -\nDeferred officer compensation 737,642 805,848\nOther\nValuation allowance (10,526,749 ) (9,789,107 )\n$ - $ -\nAt June 30, 2021, the Company had a net operating loss carry-forwards in the amount of approximately $28.9 million available to offset future taxable income through 2038. These amounts may be carried forward indefinitely, subject to the 80% of taxable income limitation rule. The Company established valuation allowances equal to the full amount of the deferred tax assets due to the uncertainty of the utilization of the operating losses in future periods. A reconciliation of the Company’s effective tax rate as a percentage of income before taxes and federal statutory rate for the period ended June 30, 2021 and 2020 is summarized as follows:\nTax on income before income tax 21.00 % 21.00 %\nEffect of non-temporary differences (0.01 )% (0.01 )%\nEffect of prior year items - % - %\nEffect of temporary differences - % - %\nChange in valuation allowance (20.99 )% (20.99 )%\n0.00 % 0.00 %\nThe total amount of unrecognized tax benefits can change due to tax examination activities, lapse of applicable statutes of limitations and the recognition and measurement criteria under the guidance related to accounting for uncertainty in income taxes. The Company does not believe any significant increases or decreases will occur within the next twelve months.\nThe Company files income tax returns in the United States (“U.S.”) federal jurisdiction. Generally, the Company is no longer subject to U.S. federal examinations by tax authorities for fiscal years prior to 2017. The Company does not file in any other jurisdiction and remains open for audit for all tax years as the statute of limitations does not begin until the returns are filed. The Company remains subject to U.S. federal examination for tax years ended 2017, 2018, 2019, 2020 and 2021.\nNOTE 9 - LITIGATION\nFrom time to time we may be a defendant or plaintiff in various legal proceedings arising in the normal course of our business. We know of no material, active, pending or threatened proceeding against us or our subsidiaries, nor are we, or any subsidiary, involved as a plaintiff or defendant in any material proceeding or pending litigation.\nNOTE 10 - SUBSEQUENT EVENTS\nIn accordance with ASC 855-10, the Company has reviewed its operations subsequent to June 30, 2021 to the date these financial statements were issued.\nSubsequent to June 30, 2021, the Company issued 48,125 Preferred C shares for $43,745 cash and 26,473,580 common shares. The Company converted 51,850 preferred shares into 5,940,247 common shares.\nINDEX TO EXHIBITS\nIncorporated by Reference\nFiled or\nExhibit\nNumber\nExhibit Description\nForm\nExhibit\nFiling Date\nFurnished\nHerewith\n3.01\nArticles of Incorporation of SmartMetric, Inc. filed 12/18/02\nSB-2\n3.1\n9/3/04\n3.02\nAmendment to Articles of Incorporation dated 12/11/09\n8-K\n3.1\n12/18/09\n3.03\nAmendment to Articles of Incorporation dated June 8, 2016\n10-K\n3.5\n9/28/16\n3.04\nCertificate of Designation of Series B Preferred Stock\n8-K\n3.2\n12/18/09\n3.05\nAmendment to Certificate of Designation of Series B Preferred Stock dated 11/5/14\n10-Q\n3.1\n11/14/14\n3.06\nAmendment to Certificate of Designation of Series B Preferred Stock dated 6/8/16\n10-K\n3.4\n9/28/16\n3.07\nAmended and Restated Bylaws of SmartMetric\n8-K\n3.1\n4/26/16\n3.08\nSeries C Preferred Stock Certificate of Designations dated 1/14/19\n8-K\n3.1\n1/18/19\n4.01\nCommon Stock Certificate Specimen\nX\n4.02\nForm of Warrant issued to May 2013 Investor\n8-K\n4.1\n5/28/13\n4.03\nForm of Warrant issued to investors between 2015 - 2017\n10-K\n4.03\n10/13/17\n4.04*\nSmartMetric, Inc. 2017 Equity Compensation Plan\n10-Q\n4.04\n11/14/17\n4.05*\nForm of Option Grant under 2017 Equity Compensation Plan\n10-Q\n4.05\n11/14/17\n4.06*\nForm of Restricted Stock Grant under 2017 Equity Compensation Plan\n10-Q\n4.06\n11/14/17\n4.07*\nForm of Restricted Stock Unit Grant under 2017 Equity Compensation Plan\n10-Q\n4.07\n11/14/17\n4.08\nConvertible Promissory Note dated March 5, 2020 issued by SmartMetric, Inc. in favor of GHS Investments LLC\nS-1\n4.08\n8/6/20\n10.01*\nAssignment and Assumption Agreement dated 11/12/12 with Applied Cryptography\n8-K\n10.1\n11/16/12\n10.02\nSubscription Agreement with May 2013 Investor\n8-K\n10.1\n5/28/13\n10.03*\nEmployment Agreement dated July 1, 2012 with Chaya Hendrick and Addendum dated 9/30/15\n8-K\n10.8\n10/5/15\n10.05\nForm of Securities Purchase Agreement with investors used between 2015 - 2017\n10-K\n10.05\n10/13/17\n10.06*\nEmployment Agreement with Chaya Hendrick dated July 1, 2017\n10-K\n10.06\n10/13/17\n10.07*\nIssued Patent License and Royalty Agreement dated 9/11/17 with Chaya Hendrick\n10-K\n10.07\n10/13/17\n10.08*\nJay Needelman Services Agreement\n10-K/A\n10.01\n10/27/17\n10.09\nManufacturer’s Representative Agreement\n8-K\n10.01\n12/26/17\n10.10\nAgreement by and between the Company and Hogier Gartner CIA S.A. dated February 16, 2018\n8-K\n10.1\n2/23/18\n10.11\n2018 Professional/Consultant Stock Compensation Plan\nS-8\n10.1\n1/18/18\n10.12\nSecurities Purchase Agreement by and between the Company and Geneva Roth Remark Holdings, Inc., dated January 9, 2019\n8-K\n10.1\n1/18/19\n10.13\nEquity Financing Agreement dated March 5, 2020 by and between SmartMetric, Inc. and GHS Investments LLC\nS-1\n10.13\n8/6/20\n10.14\nRegistration Rights Agreement by and between the Company and GHS Investments LLC, dated March 5, 2020\nS-1\n10.14\n8/6/20\n14.01\nSmartMetric Code of Ethics\nSB-2\n16.1\n9/3/04\n21.01\nSubsidiaries of the Registrant\nS-B/A\n21.1\n2/3/05\n31.1\nCertification by the Principal Executive Officer of Registrant pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (Rule 13a-14(a) or Rule 15d-14(a))\nX\n31.2\nCertification by the Principal Financial Officer of Registrant pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (Rule 13a-14(a) or Rule 15d-14(a))\nX\n32.1\nCertification by the Principal Executive Officer pursuant to 18 U.S.C. 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n32.2\nCertification by the Principal Financial Officer pursuant to 18 U.S.C. 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n101.INS\nXBRL Instance Document\nX\n101.SCH\nXBRL Taxonomy Extension Schema\nX\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase\nX\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase\nX\n101.LAB\nXBRL Taxonomy Extension Label Linkbase\nX\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase\nX\n* Management contracts or compensation plans or arrangements in which directors or executive officers are eligible to participate."
}