{
    "cik": "1342936",
    "company": "Advanced Voice Recognition Systems, Inc",
    "filing_type": "10-K",
    "filing_date": "2021-03-31",
    "period_of_report": "2020-12-31",
    "sic": "1311",
    "state_of_inc": "NV",
    "state_location": "AZ",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1342936/0001376474-21-000115-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1342936/000137647421000115/avoi-20201231.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1342936/0001376474-21-000115.txt",
    "filename": "1342936_10K_2020_0001376474-21-000115.htm",
    "item_1": "Item 1. Business.\nGeneral Overview.\nAdvanced Voice Recognition Systems, Inc. (the “Company”, “we” or “us”), is a software development company headquartered in Scottsdale, Arizona. We specialize in creating interface and application solutions for speech recognition technologies. Our speech recognition software and related firmware was first introduced in 1994 at an industry trade show. We currently have limited capital resources. We are not currently engaged in marketing any products. We are currently engaged in discussions with a certain firm dedicated to assisting in the commercialization of intellectual assets.\nOur principal assets are our patents. We currently hold six issued patents. U.S. Patent #7,558,730 (“the ‘730”) entitled “Speech Recognition and Transcription Among Users Having Heterogeneous Protocols” discloses a system for facilitating speech recognition and transcription among users employing incompatible protocols for generating, transcribing and exchanging speech. U.S. Patent #7,949,534, (“the ‘534”) entitled “Speech Recognition and Transcription Among Users Having Heterogeneous Protocols,” is an expansion of the coverage of the ‘730 patent and incorporates speech recognition and transcription among transcription engines employing incompatible protocols. U.S. Patent #8,131,557, (“the 557”) entitled “Speech Recognition and Transcription Among Users Having Heterogeneous Protocols,” is an expansion of the coverage of AVRS’s ‘730 and the ‘534 patents and incorporates speech recognition and transcription among transcription engines employing incompatible protocols for generating, transcribing, and exchanging speech among users employing incompatible protocols utilizing peer-to-peer networks, node-to-node networks, and the cloud. U.S. Patent #8,498,871, (“the ‘871”) entitled “Dynamic Speech Recognition and Transcription Among Users Having Heterogeneous Protocols,” is a system for facilitating free form dictation, including directed dictation and constrained recognition and /or structured transcription among users having heterogeneous protocols for generating, transcribing and exchanging recognized and transcribed speech. U.S. Patent #9,142,217, (“the 217”) entitled “Speech Recognition and Transcription Among Users Having Heterogeneous Protocols,” is an expansion of the coverage of the ‘871. U.S. Patent #9,934,786 (“the ‘786”) was issued April 3, 2018 and is an extension of the coverage in the ‘871 patent. Our business strategy is to attempt to interest other companies in entering into license agreements or other strategic relationships and to enforce and defend our patents through infringement and interference proceedings, as appropriate.\nIndustry Overview\nWe believe that speech recognition technology has a multitude of potential applications including but not limited to dictation and transcription, mobile messaging (voice to texting), server based web search, customer relations and translation.\nSpeech recognition technology, which provides for the conversion of speech into written text, is the threshold feature of our solutions. Our technology focuses on improving speech recognition technology by increasing speech conversion precision, with the goal of achieving near 100% accuracy and allowing the user to speak naturally. We also focus on improving user productivity and profitability by enabling the user to effectively utilize the written text produced by speech recognition technology (the End-Text) in multiple applications specific to the user’s business purposes and goals.\nWe believe our main competitors are Microsoft, Nuance, Google Voice, Amazon Alexa and Apple. We also compete, and anticipate that we will compete, with several smaller niche suppliers.\nPrincipal Proposed Products or Services\nWe have not achieved any revenues from product sales. In addition, we will need substantial additional capital to achieve our marketing objectives as described below.\nSpeech Recognition Software and Related Firmware\nOur principal proposed product is speech recognition software and related firmware which allows for dictation into a broad range of applications, including DOS applications running in Windows, UNIX and mainframe applications accessed through terminal emulation programs, various custom applications, and all Windows 3.x, 95, 98, 2000, XP, Vista, Windows 7 and Windows 10 programs. Through this product, we seek to provide full functionality including audio proofreading, deferred and delegated correction and additional capabilities that we believe are not available with other products. This product is designed to allow for deferred dictation, where the text is saved with the associated audio, and the users can resume when stopped and can play back dictated content. Similarly, the recognized text and associated audio can be saved to be used when text is corrected.\nAVRS Enterprise Solutions\nAVRS patented technology is applicable to many main stream speech enabled applications ranging from traditional desktop applications to mobile, web-based and cloud solutions. The technology reaches beyond simple speech recognition and transcription into many other applications thus enabling the exchange of spoken text transcription amongst numerous users on diverse system platforms, as well as enabling the transcribed text to be utilized by many interface applications. The key is the recognition of, and in many cases the transcription of, spoken text in a myriad of applications to allow a seamless interface among users and /or systems having disparate protocols. Recognition of dictated speech including spoken text and commands, over many platforms provides operations of systems having diverse requirements and capabilities.\nAVRS patents cover both a method of implementation and a system whereby speech recognition and transcription can be operated upon and exchanged amongst users employing disparate legacy protocols through one or more transaction managers having a systems protocol. An underlying key factor in all AVRS patented technology lies in its enabling capability whereby any legacy application protocol can be made compatible with speech recognition and transcription engines with or without modification of the application or the protocol upon which the initiating or the receiving application relies.\nMarket\nWe believe that our patented technology has applications in vertical markets that require individuals and organizations to create reports, letters, e-mail, data entry, manuals, books, and virtually any other document or end product involving written data. These organizations include corporations, hospitals, medical product and service providers, governmental entities, legal professionals, sales and service organizations law enforcement agencies and mobile search and voicemail to text.\nOriginal Equipment Manufacturer (OEM)\nWe believe that our patented technology has applications in OEM markets, targeting both software developers and hardware manufacturers. When we have sufficient available resources, we may approach the larger OEM companies with a joint marketing approach strategy while using a direct sale basis to approach small and medium-sized OEMs.\nHardware Manufacturers\nWe believe that our patented technology has applications in hardware manufacturing, and to that end, when we have sufficient available resources, we may approach hardware manufacturers both on a direct basis and through joint sales and marketing programs. We anticipate that we will offer technology and patent licenses to manufacturers of medical devices, digital dictation systems, recorders, workstation PCs, mobile phones, PDAs, WAPs and intelligent electronics. Alternatively, we may offer these manufacturers limited versions of our speech recognition software and related firmware product line for embedding into hardware. When we have sufficient available resources, we expect to develop joint sales and marketing programs for mainframe, thin-client, telephony and other large hardware processing systems.\nIntellectual Property\nOur primary assets are U.S. Patent #7,558,730, U.S. Patent #7,949,534, U.S. Patent #8,131,557, U.S. Patent #8,498,871, U.S. Patent #9,142,217 and U.S. Patent 9,934,786.\nU.S. Patent #7,558,730, entitled “Speech Recognition and Transcription Among Users Having Heterogeneous Protocols”, was issued by the U.S. Patent and Trademark Office on July 7, 2009. In accordance with 35 USC 154, the term for the above referenced patent began on July 7, 2009 and ends 20 years from the date on which the application for the patent was filed in the United States. Therefore, the patent will expire on November 27, 2021. The invention discloses a system for facilitating speech recognition and transcription among users employing incompatible protocols for generating, transcribing, and exchanging speech. We expect this patent to strengthen our position in voice recognition. Costs totaling $58,277 were capitalized during the third quarter of 2009 and the Company began amortization\nOn May 24, 2011, U.S. Patent # 7,949,534, entitled “Speech Recognition and Transcription Among Users Having Heterogeneous Protocols,” was issued by the U.S. Patent and Trademark Office. In accordance with 35 U.S.C. 154, the patent shall be for a term beginning May 24, 2011 and ending 20 years from the application date of the parent application (US Patent #7,558,730) of November 27, 2001, or November 27, 2021. Costs totaling $3,365 were capitalized during the second quarter of 2011 and the Company began amortization\nOn March 6, 2012, U.S. Patent #8,131,557, entitled “Speech Recognition and Transcription Among Users Having Heterogeneous Protocols,” was issued by the U.S. Patent and Trademark Office. In accordance with 35 U.S.C. 154, the patent shall be for a term beginning March 6, 2012 and ending 20 years from the application date of the parent application (US Patent #7,558,730) of November 27, 2021, or November 27, 2021. Costs totaling $5,092 were capitalized during the first quarter of 2012 and the Company began amortization.\nOn July 30, 2013, U.S. Patent #8,498,871, entitled “Dynamic Speech Recognition and Transcription Among Users Having Heterogeneous Protocols,” was issued by the U.S. Patent and Trademark Office. In accordance with 35 U.S.C. 154, the patent shall be for a term beginning on July 30, 2013 and ending 20 years from the application date of November 27, 2001, or November 27, 2021. Costs totaling $21,114 were capitalized during the third quarter of 2013 and the Company began amortization.\nOn September 22, 2015, U.S. Patent #9,142,217, entitled “Speech Recognition and Transcription Among Users Having Heterogeneous Protocols,” was issued by the U.S. Patent and Trademark Office. In accordance with 35 U.S.C. 154, the patent shall be for a term beginning September 22, 2015 and ending 20 years from the application date of the parent application (U.S. Patent No 7,558,730) of November 27, 2001, or November 27, 2021. Costs totaling $35,068 were capitalized during the third quarter of 2015 and the Company began amortization.\nOn April 3, 2018, U.S. Patent #9,934,786, entitled “Speech Recognition and Transcription Among Users Having Heterogeneous Protocols,” was issued by the U.S. Patent and Trademark Office. In accordance with 35 U.S.C. 154, the patent shall be for a term beginning April 3, 2018 and ending 20 years from the application date of the parent application (U.S. Patent No 7,558,730) of November 27, 2001, or November 27, 2021. Costs totaling $4,575 were capitalized during the second quarter of 2018 and the Company began amortization.\nResearch and Development\nDuring fiscal years 2020 and 2019, we did not incur any expense for research and development activities.\nEmployees\nWe currently have two employees, Diana Jakowchuk our Secretary, Treasurer and Principal Accounting Officer and Walter Geldenhuys, our President, Chief Executive Officer and Chief Financial Officer. We may engage consultants and other service providers in the future to help us carry out our business plan.\nAvailable Information\nWe file the following reports with the SEC under Section 13(a) of the Securities Exchange Act of 1934 as a smaller reporting company: Annual Reports on Form 10-K; Quarterly Reports on Form 10-Q; Current Reports on Form 8-K; and any amendments to these reports. You may request a copy of these filings at no cost. Please direct your requests to:\nDiana Jakowchuk\nSecretary, Treasurer, Principal Accounting Officer\nAVRS, Inc.\n7659 E. Wood Drive\nScottsdale, AZ 85260\nOur website is located at www.avrsys.com. Information contained on our website is not a part of, and is not incorporated into this Annual Report on Form 10-K. The Annual Report on Form 10-K, our Quarterly Reports on Form 10-Q, our Current Reports on Form 8-K, and all amendments to these reports and other information that we file with or furnish to the Securities and Exchange Commission, or the SEC, are accessible free of charge on our website. We make these documents available as soon as reasonably practicable after we file them with or furnish them to the SEC. You can also read and copy any materials that we file with the SEC at the SEC’s Public Reference Room at 100 F Street, NE, Washington DC 20549. You can obtain information on the operation of the Public Reference Room by calling the SEC at 1-800-SEC-0330. The SEC also maintains an Internet site at www.sec.com that contains our reports, proxy and information statements and other information that we file electronically with the SEC.",
    "item_1A": "",
    "item_1B": "",
    "item_2": "Item 2. Properties.\nOur principal executive offices are located at 7659 E. Wood Drive, Scottsdale, Arizona and are provided to us free of charge by Diana Jakowchuk, our Secretary, Treasurer and Principal Accounting Officer.",
    "item_3": "Item 3. Legal Proceedings.\nOn November 6, 2017 Advanced Voice Recognition Systems, Inc (“AVRS”) received notice that Meyers & Associates, LLC filed Complaint number 2017CV32482 in Arapahoe County District Court on October 30, 2017. The Complaint relates to purported legal fees owed by AVRS. On January 31, 2018 AVRS entered into a Settlement Agreement and Promissory Note with Meyers & Associates, LLC. AVRS promises to pay the principal sum of Fifty-Two Thousand Three Hundred Eighty-Five Dollars and Forty-Six Cents ($52,385.46) as well as accrued interest. AVRS shall pay $1,000 per month on the first day of each month beginning February 1, 2018 and continuing through July 1, 2018 and pay all remaining unpaid principal and accrued interest (12% annual) on August 1, 2018. All payments have been made.\nOn August 1, 2018 AVRS and Meyers & Associates entered into an Agreement to Amend Promissory Note. AVRS shall pay $6,000 on or before August 1, 2018, shall pay $1,500 on the first day of each month beginning September 1, 2018 and continuing through November 1, 2018 and shall pay all remaining unpaid principal and accrued interest on December 1, 2018. All payments have been made.\nOn November 21, 2018 AVRS and Meyers & Associates entered into a Second Agreement to Amend Promissory Note. AVRS shall pay $20,000 on or before November 21, 2018, shall pay $1,500 on the first day of each month beginning January 1, 2019 and continuing through June 1, 2019 and shall pay all remaining principle and interest on July 1, 2019. On June 7, 2019 the Company made the final payment of $11,046.74. The note is paid in full. A $1,500 gain from early extinguishment of Note Payable was reported as income on June 30, 2019.\nAVRS filed a Complaint in the United States District Court Northern District for Arizona (Case No. 2-18-cv-2083) on July 3, 2018, and alleges that Apple products infringe U.S. Patent No. 7,558,730 entitled “Speech Recognition and Transcription Among Users Having Heterogeneous Protocols” (the “‘730 Patent”). AVRS is seeking, among other things, a Judgement of infringement, past damages no less than a reasonable royalty, attorneys’ fees, pre and post Judgement interest and costs including expenses and disbursements and any other relief deemed proper by the Court.\nOn July 22, 2019 Apple, Inc. submitted a petition for Inter Partes Review (“IPR”) of the AVRS patent. It was ordered in the case of AVRS, Inc. v. Apple Inc (Case No. 2-18-cv-2083) that the parties’ stipulation was granted and the case is stayed pending the resolution of the IPR proceeding. Buether Joe and Carpenter, LLC (“BJC”), our representation in the AVRS v. Apple litigation will represent AVRS in the IPR. The IPR response to the Patent Trial and Appeal Board (“PTAB”) was made on November 8, 2019. The PTAB has instituted the IPR on some of the grounds asserted by Apple and denied institution on other grounds asserted by Apple. This means that the IPR will proceed but only on the grounds instituted by the PTAB. Due to the interruption from COVID-19 the Company responded to the PTAB on September 18, 2020. Oral arguments were presented remotely on October 26, 2020. On January 13, 2021 the PTAB Final Written Decision under 35 U.S.C. § 318(a) in Inter Partes Review petitioned by Apple Inc. The decision found that claims 15 and 17 of AVRS’s U.S. Patent No. 7,558,730 B2 were invalid under 35 U.S.C. § 103(a). On March 17, 2021 AVRS filed an appeal to the United States Court of Appeals for the Federal Circuit Docket Number 2021-1745.",
    "item_4": "Item 4. Submission of Matters to a Vote of Security Holders.\nNone\nPART II",
    "item_5": "Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nCommencing on June 19, 2008, our common stock has been quoted on the OTC under the symbol “AVOI”. The following table sets forth the high and low bid prices per share of our common stock for each full quarterly period in 2020 and 2019. These prices represent inter-dealer quotations without retail markup, markdown or commission and may not necessarily represent actual transactions.\nHigh\nLow\n$\n$\nThree Months Ended December 31, 2020\n0.02\n0.02\nThree Months Ended September 30, 2020\n0.02\n0.02\nThree Months Ended June 30, 2020\n0.02\n0.02\nThree Months Ended March 31, 2020\n0.01\n0.01\nThree Months Ended December 31, 2019\n0.02\n0.02\nThree Months Ended September 30, 2019\n0.03\n0.03\nThree Months Ended June 30, 2019\n0.04\n0.03\nThree Months Ended March 31, 2019\n0.02\n0.02\nHolders\nAs of December 31, 2020, we have approximately 74 holders of record of our common stock and 280,386,935 shares issued and outstanding. The number of record holders was determined from the records of our transfer agent and does not include beneficial owners of common stock, whose shares is held in the names of various securities brokers, dealers and registered clearing agencies. The transfer agent of our common stock is Pacific Stock Transfer, 6725 Via Austi Pkwy, Suite 300, Las Vegas NV 89119.\nDividends\nWe have not declared any cash dividends, nor do we have any current plans to do so. We are not subject to any legal restrictions respecting the payment of dividends, except that they may not be paid to render us insolvent. We currently anticipate that we will retain all of our future earnings for use in the expansion and operation of our business and do not anticipate paying any cash dividends in the foreseeable future.\nUnregistered Sales of Equity Securities\nWe have not sold any equity securities during the period covered by this Annual Report on Form 10-K that were not previously disclosed by us in a Quarterly Report on Form 10-Q or in a Current Report on Form 8-K.",
    "item_6": "Item 6. Selected Financial Data.\nAs a \"smaller reporting company\" as defined by Item 10 of Regulation S-K, we are not required to provide information required by this Item.",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operation.\nThe following discussion and analysis should be read in conjunction with the consolidated financial statements and related notes included elsewhere in this Annual Report on Form 10-K. This document contains certain forward-looking statements that involve risks and uncertainties, such as statements of the Company’s plans, objectives, expectations and intentions. When used in this document, the words “expects”, “anticipates”, “intends” and “plans” and similar expressions are intended to identify certain of these forward-looking statements. The cautionary statements made in this document should be read as being applicable to all related forward-looking statements wherever they appear in this document. Our actual results could differ materially from those discussed in this document.\nResults of Operation\nWe completed a stock exchange on May 19, 2008 and changed our business model. We have not generated any revenue since inception and do not have any cash generating product or licensing sales. We have incurred losses since Inception (March 15, 1994).\nWe had a net loss of $81,529 for the year ended December 31, 2020, as compared to a net loss of $68,302 in 2019. Professional fees were $43,598 in 2020, as compared to $28,014 in 2019, an increase of $15,584. An increase in our auditing fees is responsible for the increase in professional fees. Compensation was $7,839 in 2020, as compared to $4,916 in 2019, an increase of $2,923 which increased our net loss.\nLiquidity and Capital Resources\nDuring the year ended December 31, 2020, we used $33,026 of cash in operating activities and $0 cash in investing activities. We received $22,600 of cash from the sale of shares of our common stock. As a result, for the year ended December 31, 2020, we recognized an $5,893 net decrease in\ncash on hand. For the year ended December 31, 2019, we used $56,244 of cash in operating activities and $-0- of cash in investing activities, and received net cash of $69,002 provided by financing activities, resulting in a $11,342 decrease in cash on hand for the year.\nAt December 31, 2020, we had current assets of $348 and current liabilities of $276,955 as compared to current assets of $6,241 and current liabilities of $238,622 at December 31, 2019. Our decrease in current assets resulted from a decreased amount of financing activities in 2020 as compared to 2019.\nBecause of our history of losses, net capital deficit and lack of assurance of additional financing, the audit report on our financial statements contains a “going concern” opinion regarding doubt about our ability to continue as a going concern.\nIn an attempt to address our financing needs, we have made sales of our common stock in private transactions.\nDuring the twelve months ended December 31, 2020, we entered into Stock Purchase Agreements for the private sale to four persons or entities of an aggregate of 2,166,667 shares of the common stock for aggregate proceeds of $22,600. All of the proceeds were paid during the 12 months ended December 31, 2020.\nDuring the twelve months ended December 31, 2019, we entered into Stock Purchase Agreements for the private sale to six persons or entities of an aggregate of 11,200,000 shares of the common stock for aggregate proceeds of $69,002. All of the proceeds were paid during the 12 months ended December 31, 2019.\nOn March 16, 2015 we entered into a letter agreement with Adapt IP Ventures, LLC (Adapt IP) confirming the retention of Adapt IP to assist us in identifying companies that might be interested in acquiring and / or licensing our patents, to attempt to negotiate financial terms and conditions for acquisition and / or licensing and to assist with collection of compensation from such entities. Adapt IP will receive a success fee of 15% of net compensation received from such entities based upon Adapt IP’s efforts. We or Adapt IP may terminate the agreement upon 30 days’ notice to the other party.\nOn April 20, 2015 we made a Promissory Note to Adapt IP for $20,000, and Adapt IP agreed to pay to our patent counsel up to $20,000 for patent work on our behalf. The Note matures one year from the date of the Note. We are obligated to repay the funds advanced by Adapt IP plus a premium of 10% of the principal amount and a percentage of proceeds received by us from any monetization event involving the patents. If we repay the Note within the six months of the date of the Note, the percentage will be 1%, and it will be 2% after six months. As of December 31, 2020 $11,961 interest has accrued.\nOn August 20, 2015, AVRS entered into a letter agreement with Dominion Harbor Group, LLC pursuant to which Dominion will provide strategic advisory services to AVRS to support the common goal of the acquisition, sale, licensing, prosecution, enforcement, and settlement with respect to AVRS’s intellectual property, including patents held by AVRS. On June 28, 2017 AVRS and Dominion agreed to terminate the August 20, 2015 Letter Agreement. AVRS did not incur any material early termination penalties in connection of the early termination of the agreement.\nOn November 1, 2016, AVRS entered into a Contingent Fee Agreement with Buether Joe and Carpenter, LLC to represent AVRS in connection with investigating and asserting claims including negotiating license agreements and the filing and prosecution of lawsuits against any potential infringers of the Patent rights. On June 6, 2017 AVRS and BJC revised the Contingent Fee Agreement as it related to the termination of the August 20, 2017 Dominion Harbor Letter Agreement.\nHistorically, our President has loaned or advanced to us funds for working capital on an “as needed” basis. There is no assurance that these loans or advances will continue in the future. At December 31, 2020 and December 31, 2019, we owed our officers an aggregate of $162,382 for accrued payroll. On September 24, 2018, the Company entered into a Promissory Note with Walter Geldenhuys, who is our President, Chief Executive Officer and Chief Financial Officer, and who serves as a member of our Board of Directors. The Promissory Note is effective as of September 24, 2018 in the principal amount of $9,000 with a maturity date of September 24, 2019. Interest at 4% per annum was charged and $91.00 accrued at December 31, 2018. On December 10, 2018 the Company repaid $2,500 leaving a balance of $6,500. During 2019 the Company repaid $6,500, paying the note in full on December 27, 2019. Our Secretary / Treasurer advanced the Company a total of $4533 at December 31, 2020.\nBecause of our history of losses, and lack of assurance of additional financing, the audit reports on our financial statements at December 31, 2020 and 2019 contained a “going concern” opinion regarding doubt about our ability to continue as a going concern.\nWe will require additional debt or equity financing or a combination of both in order to carry out our business plan. We plan to raise additional funds through future sales of our securities, until such time as our revenues are sufficient to meet our cost structure, and ultimately achieve profitable operations. There is no assurance we will be successful in raising additional capital or achieving profitable operations. Our board of directors may attempt to use non-cash consideration to satisfy obligations that may consist of restricted shares of our common stock. These actions would result in dilution of the ownership interests of existing shareholders and may further dilute our common stock book value.\nTo obtain sufficient funds to meet our future needs for capital, we will from time to time, evaluate opportunities to raise financing through some combination of the private sale of equity, or issuance of convertible debt securities. However, future equity or debt financing may not be available to us at all, or if available, may not be on terms acceptable to us. We do not intend to pay dividends to shareholders in the foreseeable future.\nU.S. Patent #7,558,730 expands an extremely broad base of features in speech recognition and transcription across heterogeneous protocols. Costs totaling $58,277 have been capitalized and amortization began in the third quarter 2009.\nU.S. Patent #7,949,534 is an expansion of the coverage of our second patent and incorporates speech recognition and transcription among transcription engines employing incompatible protocols. Costs totaling $3,365 have been capitalized and amortization began in the second quarter 2011.\nU.S. Patent #8,131,557 is an expansion of our second and third patent. Costs totaling $5,092 have been capitalized and amortization began in the first quarter 2012.\nU.S. Patent #8,498,871 titled “Dynamic Speech Recognition and Transcription Among Users Having Heterogeneous Protocols” was issued July 30, 2013 by the U.S. Patent and Trademark Office. Costs totaling $21,114 have been capitalized and amortization began in the third quarter 2013.\nU.S. Patent #9,142,217, an expansion of our fourth patent was issued September 22, 2015 by the U.S. Patent and Trademark Office. Costs totaling $35,068 have been capitalized and amortization began in the third quarter 2015.\nU.S. Patent #9,934,786 issued April 3, 2018 by the U.S. Patent and Trademark Office. Costs totaling $4,575 have been capitalized and amortization began in the second quarter of 2018.\nIn order for our operations to continue, we will need to generate revenues from our intended operations sufficient to meet our anticipated cost structure. We may encounter difficulties in establishing these operations due to our inability to successfully prosecute any patent enforcement actions or our inability to effectively execute our business plan.\nOff-Balance Sheet Arrangements\nOn March 16, 2015 Advanced Voice Recognition Systems, Inc. (AVRS) entered into a material Letter Agreement with Adapt IP Ventures, LLC (Adapt IP) in which it retained Adapt IP on an exclusive basis. Adapt IP will assist AVRS in identifying companies that might be interested in acquiring and / or licensing the Patents, attempt to negotiate financial terms and conditions for the acquisition and /or licensing of the Patents with such Entity(ies) and assist with collection of compensation from such entities. In connection with services provided under this Agreement, AVRS shall pay Adapt IP a success fee.\nOn August 20, 2015, Advanced Voice Recognition Systems, Inc. (AVRS) entered into a letter agreement with Dominion Harbor Group, LLC (Dominion) pursuant to which Dominion will provide strategic advisory services to AVRS to support the common goal of the acquisition, sale, licensing, prosecution, enforcement, and settlement with respect to AVRS’s intellectual property, including patents held by AVRS. Dominion has agreed to advance costs recommended by it, including court filing fees, discovery and other litigation costs, and patent prosecution costs, up to an aggregate of $10,000,000. AVRS will be responsible for costs not recommended by Dominion, as well as travel and ordinary business expenses incurred by AVRS. Except for the advanced costs by Dominion, AVRS will be responsible for any contingency payments to law firms. On June 28, 2017 AVRS and Dominion agreed to terminate the August 20, 2015 Letter Agreement. AVRS did not incur any material early termination penalties in connection of the early termination of the agreement.\nOn November 1, 2016, Advanced Voice Recognition Systems, Inc. (“AVRS”) entered into a Contingent Fee Agreement (the “Agreement”) with Buether Joe & Carpenter, LLC (“BJC”) pursuant to which BJC will represent AVRS in connection with investigating and asserting claims relating to certain patents, including the negotiation of license agreements and the filing and prosecution of lawsuits, against any potential infringers of rights associated with such patents (the “Patent Rights”) BJC will handle licensing and litigation activities under the Agreement on a contingent fee basis. BJC’s fee will depend upon whether AVRS recovers any sums by way of licensing, settlement, trial or otherwise with respect to the Patent Rights. On June 6, 2017 AVRS and BJC revised the Contingent Fee Agreement as it related to the termination of the August 20, 2015 Dominion Harbor Letter Agreement.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nAs a \"smaller reporting company\" as defined by Item 10 of Regulation S-K, we are not required to provide information required by this Item.",
    "item_8": "Item 8. Financial Statements and Supplementary Data.\nReport of Independent Registered Public Accounting Firm\nReport of Independent Registered Public Accounting Firm\nTo the shareholders and the board of directors of Advanced Voice Recognition Systems, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Advanced Voice Recognition Systems, Inc. (the \"Company\") as of December 31, 2020 and 2019, the related statements of operations, stockholders' equity (deficit), and cash flows for the years then ended, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2020 and 2019, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States.\nSubstantial Doubt about the Company’s Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has suffered recurring losses from operations and has a significant accumulated deficit. In addition, the Company continues to experience negative cash flows from operations. These factors raise substantial doubt about the Company's ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engage to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\n/s/ BF Borgers CPA PC\nWe have served as the Company's auditor since 2013.\nLakewood, CO\nMarch 31, 2021\nPart I. Financial Information\nAdvanced Voice Recognition Systems, Inc.\nConsolidated Balance Sheets\nDecember 31, 2020\nDecember 31, 2019\nASSETS\nCurrent Assets\nCash and cash equivalents\n$\n$\n6,241\nTotal Current Assets\n6,241\nNon-Current Assets\nPatent, net\n13,984\n28,687\nTotal Non-Current Assets\n13,984\n28,687\nTotal Assets\n$\n14,332\n$\n34,928\nLIABILITIES AND STOCKHOLDERS' DEFICIT\nCurrent Liabilities\nAccounts payable\n$\n78,144\n$\n46,083\nPayroll\n162,382\n162,382\nNote Payable AIP\n19,935\n19,935\nAdvance Related Party\n4,533\n-\nAccrued Interest\n11,961\n10,222\nTotal Current Liabilities\n276,955\n238,622\nTotal Liabilities\n$\n276,955\n$\n238,622\nCommitments and Contingencies\nStockholders' Deficit\nCommon stock, $0.001 par value; 547,500,000 shares authorized\n280,386,935 and 278,220,268, issued and outstanding respectively\n$\n280,387\n$\n278,220\nAdditional paid-in capital\n7,957,033\n7,936,600\nAccumulated Deficit\n(8,500,043)\n(8,418,514)\nTotal Stockholders' Deficit\n(262,623)\n(203,694)\nTotal Liabilities and Stockholders' Deficit\n$\n14,332\n$\n34,928\nThe accompanying notes are an integral part of these financial statements.\nAdvanced Voice Recognition Systems, Inc.\nConsolidated Statement of Operations\nYear Ended\nYear Ended\nDecember 31,\nDecember 31,\nSales\n$\n-\n$\n-\nCost of goods sold\n-\n-\nGross profit\n-\n-\nOperating expenses:\nGeneral and administrative:\nCompensation\n7,839\n4,916\nProfessional fees\n43,598\n28,014\nOffice\n23,801\n29,701\nTravel\n-\n1,614\nOther\n1,578\n2,403\nTotal operating expenses\n76,816\n66,648\nLoss from operations\n(76,816)\n(66,648)\nOther income and (expense):\nInterest expense\n(4,713)\n(5,488)\nGain from Settlement\n-\n3,834\nNet other expense\n(4,713)\n(1,654)\nLoss before income taxes\n(81,529)\n(68,302)\nProvision for income taxes\n-\n-\nNet Loss\n$\n(81,529)\n$\n(68,302)\nBasic and diluted loss per common share\n$\n-\n$\n-\nWeighted average number of common shares\n280,012,962\n273,368,169\n*less than $0.01 per share\nThe accompanying notes are an integral part of these financial statements\nAdvanced Voice Recognition Systems, Inc.\nConsolidated Statement of Shareholder's Deficit\nFor the years ended December 31, 2020 and December 31, 2019\nCommon Stock\nAdditional\nAccumulated\nShares\nPar Value\nPaid-in Capital\nDeficit\nTotal\nBalance at December 31, 2018\n267,020,268\n267,020\n7,878,798\n(8,350,212)\n(204,394)\nSales of Common Stock\n11,200,000\n11,200\n57,802\n-\n69,002\nNet Loss\n-\n-\n-\n(68,302)\n(68,302)\nBalance at December 31, 2019\n278,220,268\n278,220\n7,936,600\n(8,418,514)\n(203,694)\nSales of Common Stock\n2,166,667\n2,167\n20,433\n-\n22,600\nNet Loss\n-\n-\n-\n(81,529)\n(81,529)\nBalance at December 31, 2020\n280,386,935\n280,387\n7,957,033\n(8,500,043)\n(262,623)\nThe accompanying notes are an integral part of these financial statements.\nAdvanced Voice Recognition Systems, Inc.\nStatements of Cash Flows\nYears Ended December 31,\nCash Flows from Operating Activities:\nNet loss\n$\n(81,529)\n$\n(68,302)\nAdjustments to reconcile net loss to net cash used in operating activities:\nAmortization and depreciation\n14,703\n14,703\nGain from settlement\n-\n(3,834)\nChanges in operating assets:\nChanges in operating liabilities:\nAccounts payable and accrued liabilities\n33,800\n1,189\nNet cash used in operating activities\n(33,026)\n(56,244)\nCash Flows from Financing Activities:\nProceeds from sale of common stock\n22,600\n69,002\nNote payable related party\n-\n(6,500)\nAdvance from related party\n4,533\n-\nPayments on notes payable\n-\n(17,600)\nNet cash provided by financing activities\n27,133\n44,902\nNet change in cash\n(5,893)\n(11,342)\nCash at Beginning of Period\n6,241\n17,583\nCash at End of Period\n$\n$\n6,241\nSupplemental Disclosure of Cash Flow Information:\nCash paid during the period for:\nAccount payable converted to note payable\n-\n52,385\nInterest\n$\n1,739\n$\n2,157\nIncome taxes\n$\n-\n$\n-\nThe accompanying notes are an integral part of these financial statements.\nAdvanced Voice Recognition Systems, Inc.\nNotes to Audited Financial Statements\nNote 1. Nature of Operations\nCompany Overview\nThe operations of Advanced Voice Recognition Systems, Inc. (“AVRS” or the “Company”), http://www.avrsys.com, commenced in 1994 with a predecessor entity called NCC, Inc. NCC, Inc. was incorporated on March 15, 1994 in the State of Ohio. NCC, Inc. operated as a software and hardware development company that marketed voice recognition and transcription products for commercial applications.\nIn May 2000, WG Investments, LLC acquired the assets of NCC, Inc. and subsequently changed its name to NCC, LLC. NCC, LLC (also a predecessor to AVRS) continued the operations of NCC, Inc. until approximately December 31, 2001, when shifts in the industry’s markets caused NCC, LLC to suspend its operations.\nAVRS was incorporated in the State of Colorado on July 7, 2005. In September 2005, the members of NCC, LLC transferred all of their membership interests in NCC, LLC to AVRS in exchange for 93,333,333 shares (post-recapitalization) of AVRS common stock. In December 2005, the Board of Directors approved a 1.5-to-1 stock split issuing 46,666,667 common shares (post-recapitalization), which increased the number of common shares outstanding to 140 million shares (post-capitalization). Following the incorporation of AVRS, the Company initiated a new business plan and intends to continue its operations in the voice recognition and transcription industry.\nAVRS is a software development company specializing in speech recognition technologies. AVRS has successfully obtained patent protection of its proprietary technology (refer to Note 3, Intangible Assets). The Company has currently engaged a firm to investigate and asserting claims relating to certain patents including negotiating licensing agreements and the filing and prosecution of lawsuits.\nStock Exchange Agreement\nOn April 28, 2008, the Company entered into a Stock Exchange Agreement (“the Agreement”) with Samoyed Energy Corp., a Nevada corporation (“Samoyed”), which resulted in a reverse acquisition. The Agreement provided for the reorganization of AVRS with Samoyed. In connection with the Agreement, Samoyed acquired all of the issued and outstanding common shares of AVRS in exchange for 140 million shares of Samoyed’s common stock. On May 19, 2008, at the closing of the Agreement, the former shareholders of AVRS owned approximately 85% of the outstanding common stock of Samoyed, resulting in a change in control.\nFor accounting purposes, this acquisition has been treated as a reverse acquisition and recapitalization of AVRS, with Samoyed the legal surviving entity. Since Samoyed had, prior to the recapitalization, minimal assets and limited operations, the recapitalization has been accounted for as the sale of 24,700,008 shares of AVRS common stock for the net liabilities of Samoyed. Therefore, the historical financial information prior to the date of the recapitalization is the financial information of AVRS. Costs of the transaction have been charged to the period in which they are incurred.\nIn connection with the Agreement, a shareholder of Samoyed holding an aggregate of 3.5 million shares of Samoyed’s common stock made payments totaling $565,651 since 2008 in lieu of tendering shares to the Company. The Company received the final payment of $6,000 on February 15, 2012.\nStock Purchase Agreements\nDuring the year ended December 31, 2020 the Company entered into Stock Purchase Agreements for the private sale to four persons or entities of an aggregate of 2,166,667 shares of the common stock for aggregate proceeds of $22,600, full payment of which was received in the period. During the year ended December 31, 2019, the Company entered into Stock Purchase Agreements to six persons for the private sale of an aggregate of 11,200,000 shares of the common stock for aggregate proceeds of $69,002, full payment of which was received in the period.\nCommitments and Contingencies\nOn April 20, 2015 Advanced Voice Recognition Systems, Inc. (“AVRS”) entered into a Material Letter Agreement with an unrelated third party (Third Party) in which they promise to pay to patent legal counsel funds to continue prosecuting Patents on behalf of AVRS. AVRS promises to pay to the Third Party, or to such other holder of this promissory note (Note) as designate, the principal, together with any additional amounts owed pursuant to the terms set forth in this Note. Interest at 2% was accrued and reported at December 31, 2020.\nOn August 20, 2015, Advanced Voice Recognition Systems, Inc. (“AVRS”) entered into a letter agreement with unrelated third party (Third Party) pursuant to which the Third Party will provide strategic advisory services to AVRS to support the common goal of the acquisition, sale, licensing, prosecution, enforcement, and settlement with respect to AVRS’s intellectual property, including patents held by AVRS. The Third Party has agreed to advance costs recommended by it, including court filing fees, discovery and other litigation costs, and patent prosecution costs, up to an aggregate of $10,000,000. AVRS will be responsible for costs not recommended by the Third Party, as well as travel and ordinary business expenses incurred by AVRS. Except for the advanced costs by the Third Party, AVRS will be responsible for any contingency payments to law firms. Any and all advanced costs will only become liabilities if successful. On June 28, 2017 AVRS and the Third Party agreed to terminate the August 20, 2015\nLetter Agreement. AVRS did not incur any material early termination penalties in connection of the early termination of the agreement.\nOn November 1, 2016, Advanced Voice Recognition Systems, Inc. (“AVRS”) entered into a Contingent Fee Agreement (the “Agreement”) with Legal Representation pursuant to which they will represent AVRS in connection with investigating and asserting claims relating to certain patents, including the negotiation of license agreements and the filing and prosecution of lawsuits, against any potential infringers of rights associated with such patents (the “Patent Rights”) Legal representation will handle licensing and litigation activities under the Agreement on a contingent fee basis. The fee will depend upon whether AVRS recovers any sums by way of licensing, settlement, trial or otherwise with respect to the Patent Rights. On June 6, 2017 AVRS and Legal Representation revised the Contingent Fee Agreement as it related to the termination of the August 20, 2015 Letter Agreement which was to provide advisory services, court filing fees, discovery and other litigation costs. The revised Contingent Fee Agreement assumed the responsibility for the costs and expenses in the Terminated August 20, 2015 Letter Agreement and provides for the payment of twenty percent (20%) of all gross Licensing Agreement Proceeds and thirty percent (30%) of all Litigation Proceeds received by AVRS. In addition if the Litigation Proceeds agreed to or received by AVRS at any time are $100,000 or less then Legal Representative shall receive forty percent (40%) of the Litigation Proceeds.\nOn November 6, 2017 Advanced Voice Recognition Systems, Inc (“AVRS”) received notice that Meyers & Associates, LLC filed Complaint number 2017CV32482 in Arapahoe County District Court on October 30, 2017. The Complaint relates to purported legal fees owed by AVRS. On January 31, 2018 AVRS entered into a Settlement Agreement and Promissory Note with Meyers & Associates, LLC. AVRS promises to pay the principal sum of Fifty-Two Thousand Three Hundred Eighty-Five Dollars and Forty-Six Cents ($52,385.46) as well as accrued interest. AVRS shall pay $1,000 per month on the first day of each month beginning February 1, 2018 and continuing through July 1, 2018 and pay all remaining unpaid principal and accrued interest (12% annual) on August 1, 2018. All payments have been made.\nOn August 1, 2018 AVRS and Meyers & Associates entered into an Agreement to Amend Promissory Note. AVRS shall pay $6,000 on or before August 1, 2018, shall pay $1,500 on the first day of each month beginning September 1, 2018 and continuing through November 1, 2018 and shall pay all remaining unpaid principal and accrued interest on December 1, 2018. All payments have been made.\nOn November 21, 2018 AVRS and Meyers & Associates entered into a Second Agreement to Amend Promissory Note. AVRS shall pay $20,000 on or before November 21, 2018, shall pay $1,500 on the first day of each month beginning January 1, 2019 and continuing through June 1, 2019 and shall pay all remaining principle and interest on July 1, 2019. On June 7, 2019 the Company made the final payment of $11,047. The note is paid in full. A $1,500 gain from early extinguishment of Note Payable was reported as income on June 30, 2019.\nOn June 21, 2018, Advanced Voice Recognition Systems, Inc. (“AVRS”) and Buether Joe & Carpenter, LLC (“BJC) entered into a Letter of Engagement for Legal Services Limited Scope Agreement (“Agreement”) with Schmeiser, Olsen & Watts LLP (“the Firm”) pursuant to which the Firm will serve as local counsel in the United States District Court, District of Arizona. The Firm has been hired to represent AVRS as local counsel in connection with forthcoming litigation in the U.S. District Court, District of Arizona. AVRS may terminate the Agreement at any time.\nOn September 24, 2018, Advanced Voice Recognition Systems, Inc., a Nevada corporation (“AVRS”, “we” or “us”), entered into Promissory Note with Walter Geldenhuys, who is our President, Chief Executive Officer and Chief Financial Officer, and who serves as a member of our Board of Directors. The Promissory Note is effective as of September 24, 2018 in the principal amount of $9,000 with a maturity date of the Promissory Note September 24, 2019. Interest at 4% per annum was charged and accrued at December 31, 2018. The Company repaid $2500 of the note on December 10, 2018. Interest at 4% per annum was charged and accrued at December 31, 2019. During 2019 the Company repaid $6,500, paying the note in full on December 27, 2019.\nNote 2. Significant Accounting Policies\nGoing Concern\nThe accompanying financial statements have been prepared on a going concern basis, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business. Liabilities exceed assets and there is a capital deficiency of $262,623 and no significant revenues. The Company may be unable to continue as a going concern for a reasonable period of time.\nThe financial statements do not include any adjustments relating to the recoverability and classification of assets and liabilities that might be necessary should the Company be unable to continue as a going concern. The Company’s continuation as a going concern is dependent upon its ability to generate sufficient cash flow to meet its obligations on a timely basis and ultimately to attain profitability. During the twelve months ended December 31, 2020 the Company received an aggregate of $22,600 from the sale of shares in private offerings of its common stock. During the twelve months ended December 31, 2019 the Company received an aggregate of $69,002 from the sale of shares in private offerings of its common stock.\nThe Company’s current operations are related to patent monetization and filing of additional patents. The Company has entered into a letter agreement with Dominion Harbor Group, LLC to provide strategic advisory services to AVRS. Dominion has agreed to advanced costs up to an aggregate of $10,000,000. On June 28, 2017 the Company and Dominion agreed to terminate the August 20, 2015 Letter Agreement. The Company did not incur any material early termination penalties. In addition the Company has revised the Contingent Fee Agreement with Buether Joe & Carpenter, LLC which will represent AVRS in connection with investigating and asserting claims to the AVRS patents including licensing and litigation activities. Any and all advanced costs will only become liabilities if successful. On June 6, 2017 AVRS and BJC revised the Contingent\nFee Agreement as it related to the termination of the August 20, 2015 Dominion Harbor Letter Agreement. There is no guarantee that AVRS will be able to provide the capital required for the Company to continue as a going concern.\nUse of Estimates\nThe preparation of financial statements in accordance with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nCash and Cash Equivalents\nThe Company considers all highly liquid debt instruments with original maturities of three months or less when acquired to be cash equivalents. The Company had cash at December 31, 2020 of $348 and $6,241 at December 31, 2019. No amounts resulted from cash equivalents.\nNote 3. Intangible Assets\nIntangible Assets\nThe Company monitors the anticipated outcome of legal actions, and if it determines that the success of the defense of a patent is probable, and so long as the Company believes that the future economic benefit of the patent will be increased, the Company capitalizes external legal costs incurred in the defense of the patent. Upon successful defense of litigation, the amounts previously capitalized are amortized over the remaining life of the patent.\nOn July 7, 2009, U.S. Patent # 7,558,730, entitled “Speech Recognition and Transcription Among Users Having Heterogeneous Protocols,” was issued by the U.S. Patent and Trademark Office. In accordance with 35 U.S.C. 154, the patent shall be for a term beginning on July 7, 2009 and ending 20 years from the application date of November 27, 2001, or November 27, 2021. The deferred fees were capitalized during the quarter ended September 30, 2009 and the Company began amortization.\nOn May 24, 2011, U.S. Patent #7,949,534, entitled “Speech Recognition and Transcription Among Users Having Heterogeneous Protocols,” was issued by the U.S. Patent and Trademark Office. In accordance with 35 U.S.C. 154, the patent shall be for a term beginning May 24, 2011 and ending 20 years from the application date of the parent application (U.S. Patent #7,558,730) of November 27, 2001, or November 27, 2021. The deferred fees were capitalized during the quarter ended June 30, 2011 and the Company began amortization.\nOn March 6, 2012, U.S. Patent #8,131,557, entitled “Speech Recognition and Transcription Among Users Having Heterogeneous Protocols,” was issued by the U.S. Patent and Trademark Office. In accordance with 35 U.S.C. 154, the patent shall be for a term beginning March 6, 2012 and ending 20 years from the application date of the parent application (U.S. Patent #7,558,730) of November 27, 2001, or November 27, 2021. The deferred fees were capitalized during the quarter ended March 31, 2012 and the Company began amortization.\nOn July 30, 2013, U.S. Patent #8,498,871, entitled “Dynamic Speech Recognition and Transcription Among Users Having Heterogeneous Protocols,” was issued by the U.S. Patent and Trademark Office. In accordance with 35 U.S.C. 154, the patent shall be for a term beginning on July 30, 2013 and ending 20 years from the application date of November 27, 2001, or November 27, 2021. The deferred fees were capitalized during the quarter ended September 30, 2013 and the Company began amortization.\nOn June 27, 2013, the Company filed two additional continuation applications 13/928/381 and 13/928,383 with the U.S. Patent and Trademark Office entitled “Speech Recognition and Transcription Among Users Having Heterogeneous Protocols.” On August 31, 2015, Application 13/928,381 was abandoned by the Company. Deferred costs were charged to operations the quarter ended September 30, 2015.\nOn September 22, 2015, U.S. Patent #9,142,217, entitled “Speech Recognition and Transcription Among Users Having Heterogeneous Protocols,” was issued by the U.S. Patent and Trademark Office. In accordance with 35 U.S.C. 154, the patent shall be for a term beginning September 22, 2015 and ending 20 years from the application date of the parent application (US Patent No. 7,558,730) of November 27, 2001, or November 27, 2021. The deferred fees were capitalized during the quarter ended September 30, 2015 and the Company began amortization.\nOn April 3, 2018, U.S. Patent #9,934,786, entitled “Speech Recognition and Transcription Among Users Having Heterogeneous Protocols,” was issued by the U.S. Patent and Trademark Office. In accordance with 35 U.S.C. 154, the patent shall be for a term beginning April 3, 2018 and ending 20 years from the application date of the parent application (U.S. Patent #7,558,730) of November 27, 2001 or November 27, 2021. The deferred costs were capitalized during the quarter ended June 30, 2018 and the Company began amortization.\nAmortization at December 31, 2019 is as follows:\nSCHEDULE OF INTANGIBLE ASSETS\nEnded December 31, 2019\nU.S. Patent #\nCarrying Value\nAmortization\nBalance\n7,558,730\n58,277\n49,266\n9,011\n7,949,534\n3,365\n2,739\n8,131,557\n5,092\n4,090\n1,002\n8,498,871\n21,114\n16,247\n4,867\n9,142,217\n35,068\n24,278\n10,790\n9,934,786\n4,575\n2,184\n2,391\n$\n127,491\n$\n98,804\n$\n28,687\nAmortization at December 31, 2020 is as follows:\nEnded December 31, 2020\nU.S. Patent #\nCarrying Value\nAmortization\nBalance\n7,558,730\n$\n58,277\n53,958\n4,319\n7,949,534\n3,365\n3,052\n8,131,557\n5,092\n4,612\n8,498,871\n21,114\n18,779\n2,335\n9,142,217\n35,068\n29,674\n5,394\n9,934,786\n4,575\n3,432\n1,143\n$\n127,491\n$\n113,507\n$\n13,984\nAmortization expense totaled $14,703 and $14,703 for the years ended December 31, 2020 and 2019. Estimated aggregate amortization expense for each of the next two years is as follows:\nSCHEDULE OF FUTURE AMORTIZATION\nYear ending December 31,\n13,984\n$\n13,984\nNote 4. Related Party Transactions\nRelated Parties Transactions and Indebtedness\nDuring the years from 2000 through 2013, certain officers advanced the Company working capital to maintain the Company’s operations. The Company owed the officers -0- and $6,500 at December 31, 2020 and 2019 respectively. The Company also owed the officers aggregate of $162,382 at December 31, 2020 and December 31, 2019 for accrued payroll. During the period of year ending December 31, 2020, and December 31, 2019 the Company paid gross payroll of $7,839 and $4,916 to the CEO and for payroll expenses. On September 24, 2018, Walter Geldenhuys, who is our President, Chief Executive Officer and Chief Financial Officer, and who serves as a member of our Board of Directors loaned the Company $9,000. This loan was paid in full December 27, 2019. Beginning September 2020 and continuing through December, 31 2020 Diana Jakowchuk, who serves as our Secretary Treasurer, advanced the Company $4,533. During the year ending December 31, 2020, AVRS completed Stock Purchase Agreements totaling 2,166,667 shares of AVRS stock to four shareholders. All shares were paid in the period ending December 31, 2020, for a total amount of $22,600. At period ending December 31, 2020 one shareholder owned 8.83% of the issued and outstanding stock.\nNote 5. Income Taxes\nA reconciliation of the U.S. statutory federal income tax rate to the effective rate is as follows.\nINCOME TAXES\nDecember 31, 2020\nDecember 31, 2019\nU.S. federal statutory graduated rate\n21.00 %\n21.00 %\nState income tax rate, net of federal benefit\n0.00 %\n0.00 %\nContributed services\n00.00 %\n00.00 %\nCosts capitalized under Section 195\n-21.00 %\n-21.00 %\nEffective rate\n0.00 %\n0.00 %\nThe Company is considered a start-up company for income tax purposes. As of December 31, 2020, the Company had not commenced its trade operations, so all costs were capitalized under Section 195. Accordingly, the Company had no net operating loss carry forwards at December 31, 2020.\nNote 6 . Concentration of Risk\nBeginning March 31, 2010, through December 31, 2020, all noninterest-bearing transaction accounts are fully insured, regardless of the balance of $250,000, at all FDIC-insured institutions. On December 31, 2020, the Company had cash balances at one FDIC insured financial institution of $348 in non-interest-bearing accounts that were fully insured by the FDIC.\nNote 7. Note Payable & Accounts Payable\nOn April 20, 2015 Advanced Voice Recognition Systems, Inc. (AVRS) entered into a Material Letter Agreement with an unrelated third party (Third Party) in which they promise to pay to patent legal counsel funds to continue prosecuting Patents on behalf of AVRS. AVRS promises to pay to the Third Party, or to such other holder of this promissory note (Note) as designate, the principal, together with any additional amounts owed pursuant to the terms set forth in this Note. Interest at 10% was accrued and reported at December 31, 2020.\nOn November 21, 2018 AVRS and Meyers & Associates entered into a Second Agreement to Amend Promissory Note. AVRS shall pay $20,000 on or before November 21, 2018, shall pay $1,500 on the first day of each month beginning January 1, 2019 and continuing through June 1, 2019 and shall pay all remaining principle and interest on July 1, 2019. On June 7, 2019 the Company made the final payment of $11,047. The note is paid in full. A $1,500 gain from early extinguishment of Note Payable was reported as income on June 30, 2019.\nOn September 24, 2018, Advanced Voice Recognition Systems, Inc., a Nevada corporation (“AVRS”, “we” or “us”), entered into Promissory Note with Walter Geldenhuys, who is our President, Chief Executive Officer and Chief Financial Officer, and who serves as a member of our Board of Directors. The Promissory Note is effective as of September 24, 2018 in the principal amount of $9,000 with a maturity date of the Promissory Note September 24, 2019. Interest at 4% per annum was charged and accrued at December 31, 2018. The Company repaid $2,500 of the note on December 10, 2018. During 2019 the Company repaid $6,500, paying the note in full on December 27, 2019. Interest at 4% per annum was charged and accrued at December 31, 2019.\nNote 8.Stockholder Equity / (Deficit)\nThe Company has issued shares of its common stock pursuant to certain agreements as described in Note 1.\nNote 9. Subsequent Events\nOur Secretary / Treasurer, Diana Jakowchuk continues to advance the Company funds. As of March 18, 2021, Ms. Jakowchuk has advanced a total of $6,378.75.\nOn January 13, 2021, the United States Patent and Trademark Office Patent Trial and Appeal Board (PTAB) issued a Final Written Decision under 35 U.S.C. § 318(a) in Inter Partes Review petitioned by Apple Inc. The decision found that claims 15 and 17 of AVRS’s U.S. Patent No. 7,558,730 B2 were invalid under 35 U.S.C. § 103(a).\nOn March 17, 2021, AVRS filed an appeal to the United States Court of Appeals for the Federal Circuit Docket Number 2021-1745. AVRS appeals the Patent Trial and Appeal Boards (“PTAB”) Final Written Decision on January 13, 2021 in the Inter Partes Review (IPR 2019-01352) petitioned by Apple, Inc of U. S. Patent No. 7,558,730.",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone.",
    "item_9A": "Item 9A(T). Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nOur management, with the participation of our chief executive officer, who also is our chief financial officer, evaluated the effectiveness of our disclosure controls and procedures as defined in Rules 13a-15(e) and 15d-15(e) and pursuant to Rules 13a-15(b) and 15d-15(b) under the Securities Exchange Act of 1934, as amended (the “Exchange Act”) as of December 31, 2020 Disclosure controls and procedures are controls and procedures that are designed to ensure that information required to be disclosed in our reports filed or submitted under the Exchange Act, such as this Form 10-K, is recorded, processed, summarized and reported, within the time period specified in the SEC’s rules and forms, and that such information is accumulated and is communicated to our management, including our principal executive and principal financial officers, or persons performing\nsimilar functions, as appropriate, to allow timely decisions regarding required disclosure. In designing and evaluating the disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives. In addition, the design of disclosure controls and procedures must reflect the fact that there are resource constraints and that management is required to apply its judgment in evaluating the benefits of possible controls and procedures relative to their costs.\nBased on our review and evaluation, our chief executive officer, who also is our chief financial officer, concluded that our disclosure controls and procedures were adequate and effective, including consideration of the matters identified below to ensure that material information relating to us would be made known to them by others within the Company in a timely manner, particularly during the period in which this annual report on Form 10-K was being prepared, and that no changes are required at this time. The evaluation of our disclosure controls and procedures and the conclusion as to their adequacy and effectiveness, included consideration of the deficiency noted below and the fact that our chief executive officer and chief financial officer is extensively involved in day-to-day transactional activities combined with the fact that the volume of transactions and activities of the Company are limited.\nWe have identified, as of December 31, 2020 and 2019, a lack of segregation of duties in accounting and financial reporting activities, which we do not believe is a material weakness. The size of our business necessarily imposes practical limitations on the effectiveness of those internal control practices and procedures that rely on the segregation of duties. Our chief executive officer and chief financial officer work closely and review all day to day transactional activities with the secretary Treasurer. The volume of the transactions of the Company is limited.\nManagement believes this lack of segregation of duties in accounting and financial reporting did not result in material inaccuracies or omissions of material fact and, to the best of its knowledge, believes that the financial statements for the years ended December 31, 2020 and 2019 fairly present in all material respects the financial condition and results of operations for the Company in conformity with GAAP. There is, however, a reasonable possibility that a material misstatement of the annual or interim financial statements would not have been prevented or detected as a result of this weakness.\nManagement’s Annual Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Our internal control over financial reporting includes those policies and procedures that:\n(1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets;\n(2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. GAAP, and that our receipts and expenditures are being made only in accordance with the authorization of its management and directors; and\n(3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\nOur management assessed the effectiveness of its internal control over financial reporting as of December 31, 2020. We have identified, as of December 31, 2020, a lack of segregation of duties in accounting and financial reporting activities, which we believe is a material weakness. The size of our business necessarily imposes practical limitations on the effectiveness of those internal control practices and procedures that rely on the segregation of duties.\nManagement believes this deficiency in internal control did not result in material inaccuracies or omissions of material fact and, to the best of its knowledge, believes that the financial statements for the years ended December 31, 2020 and 2019 fairly present in all material respects the financial condition and results of operations for the Company in conformity with GAAP. There is, however, a reasonable possibility that a material misstatement of the annual or interim financial statements would not have been prevented or detected as a result of this weakness.\nThis Annual Report on Form 10-K does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Management’s report was not subject to attestation by our registered public accounting firm pursuant to temporary rules of the SEC that permit us to provide only management’s report in this Annual Report on Form 10-K.\nChanges in internal control over financial reporting.\nWe regularly review our system of internal control over financial reporting and make changes to our processes and systems to improve controls and increase efficiency, while ensuring that we maintain an effective internal control environment. Changes may include such activities as implementing new, more efficient systems, consolidating activities, and migrating processes.\nThere were no changes in our internal controls over financial reporting that occurred during the period covered by this Annual Report on Form 10-K that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.",
    "item_9B": "Item 9B. Other Information.\nNone.\nPART III",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance.\nThe following table and paragraphs provide the name and age of each of our current directors, executive officers and significant employees, the principal occupation of each during the past five years and, with respect to directors, the year in which the director was first elected as a member of our Board of Directors. Information as to the stock ownership of each of our directors and all of our current executive officers as a group is provided above under “Security Ownership of Certain Beneficial Owners and Management.” There are no family relationships between any director or executive officer. Our directors and officers serve until their respective successors are elected or appointed, as the case may be.\nName of Director and Executive Officers(1)\nAge\nMonth and Year\nElected as Director\nPosition with the Company\nWalter Geldenhuys\nMay 2008\nPresident, Chief Executive Officer, Chief Financial Officer and Sole Director\nDiane Jakowchuk\n-\nSecretary, Treasurer and Principal Accounting Officer\n(1) Donald Getty served as Director in 2015 until he passed in February 2016.\nWalter Geldenhuys, Sole Director, President and Chief Executive Officer\nMr. Geldenhuys, sole director of AVRS, has served as a member of our Board of Directors since May 2008. Mr. Geldenhuys served as the President of Advanced Voice Recognition Systems, Inc., a Colorado corporation, also known as AVRS, from 2005 until AVRS was merged with and into us in June 2008. From 2000 to 2005, Mr. Geldenhuys was a member of NCC, LLC, which became AVRS’s wholly-owned subsidiary in 2005. In addition, Mr. Geldenhuys has owned Progressive Technologies LLC, a design and manufacturing concern, since 2002.\nDiana Jakowchuk, Secretary, Treasurer and Principal Accounting Officer\nMs. Jakowchuk has served as our Secretary, Treasurer and Principal Accounting Officer since May 2008. Ms. Jakowchuk served as Secretary to AVRS, Inc. (a Colorado company). Between December 2004 and July 2006, Ms. Jakowchuk served as office manager for a retail hardware company. From December 2001 to December 2004, Ms. Jakowchuk served as the State Victim Assistance Coordinator for MADD Victim Services. Prior to December 2001, Ms. Jakowchuk served as Records Manager for NCC, LLC a predecessor to AVRS. Ms. Jakowchuk received an Associates of Arts degree from Scottsdale Community College in 1979.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Exchange Act requires our directors and designated officers to file reports of ownership and changes in ownership of our equity securities with the Securities and Exchange Commission. Based solely on our review of the copies of such forms that we have received and on written representations from reporting persons, we believe that during the fiscal year ended December 31, 2020 all reporting persons complied with all applicable filing requirements.\nCorporate Governance, Code of Ethics\nWe are committed to maintaining sound corporate governance practices. These practices are essential to running our business efficiently and to maintaining our integrity in the marketplace. Our Board of Directors is responsible for providing effective governance oversight over our affairs. Our corporate governance practices are designed to promote honesty and integrity throughout our company.\nWe have adopted a Code of Ethics applicable to anyone who serves as our Chief Executive Officer, Chief Financial Officer, principal accounting officer or controller. A copy of the Company’s Code of Ethics is incorporated by reference to this Form 10-K as Exhibit 14.1.\nAudit Committee\nThe entire Board of Directors operates as the Audit Committee. We currently do not have a written audit committee charter or similar document. When the audit committee is formed, we intend to have a designated audit committee “financial expert” who will be responsible for reviewing the results and scope of the audit, and other services provided by the independent auditors, and review and evaluate the system of internal controls.",
    "item_11": "Item 11. Executive Compensation.\nSummary Compensation Table\nThe following table sets forth all compensation paid to our principal executive officer and those individuals who received compensation in excess of $100,000 per year (collectively, the “Named Executive Officers”) for our last two completed fiscal years.\nSummary Compensation Table\nA\nName and Principal\nPosition with AVRS\nB\nYear\nC\nSalary\n($)\nD\nBonus\n($)\nE\nStock\nAwards\nF\nOption\nAwards\n($)\nG\nNon-Equity\nIncentive\nPlan\nCompensation\n($)\nH\nNonqualified\nDeferred\nCompensation\nEarnings\n($)\nI\nAll Other\nCompensation\n($)\nJ\nTotal (1)\nWalter Geldenhuys,\n7,133\n7,133\nPresident, CEO, CFO Director (1)\n4,400\n4,400\nDiane Jakowchuk,\nPrincipal Accounting Officer(2)\n1 Mr. Geldenhuys was appointed to our Board of Directors and as our President, Chief Executive Officer and Chief Financial Officer in May 2008. Mr. Geldenhuys also served as the President, Chief Executive Officer and Director of AVRS during the year ended December 31, 2007 and until AVRS merged with and into us in June 2008. The amounts reflected in this table include compensation Mr. Geldenhuys received as President, Chief Executive Officer of AVRS in 2019 and 2020.\n2 Ms. Jakowchuk was appointed as our Secretary, Treasurer and Principal Accounting Officer in May 2008. The amounts reflected in this table include compensation Ms. Jakowchuk received as Secretary, Treasurer and Principal Accounting Officer in 2019 and 2020.\n3 Due to reduced sales of shares in private offerings of common stock in 2013, $162,383 of officer compensation was accrued as payroll payable. Total Officer Compensation paid in 2019 was $4,400 and $7,133 in 2020. The Company continued to experience a reduction in income. The officers agreed that no payroll would accrue.\nSalary (Column C)\nThe amounts reported in column C represent base salaries paid to each of the Named Executive Officers for the relevant fiscal year.\nBonus (Column D)\nThe amounts reported in column D represent the cash bonuses paid each of the Named Executive Officers for the relevant fiscal year.\nOption Awards (Column F)\nThe amounts reported in column F represent the dollar amount of stock option awards recognized for each of the Named Executive Officers as compensation costs for financial reporting purposes (excluding forfeiture assumptions) in accordance with FAS 123(R) for the relevant fiscal years.\nEffective January 1, 2006, we adopted the provisions of SFAS No. 123(R), which requires the measurement and recognition of compensation expense for all share-based payment awards (including stock options) made to employees and directors based on estimated fair value. We previously accounted for the stock options under the fair value recognition provisions of FASB Statement No. 123, Accounting for Stock-Based Compensation, as amended by SFAS No. 148, Accounting for Stock-Based Compensation - Transition and Disclosure now known as ASC 718 “Compensation - Stock Compensation.”\nThe fair value of each option award is estimated on the date of grant using the Black-Scholes valuation model that uses the assumptions noted in the following table. Expected volatilities are based on implied volatilities from similar companies that operate within the same industry sector index. We calculated the historical volatility for each comparable company to come up with an expected average volatility\nand then adjusted the expected volatility based on factors such as historical stock transactions, major business transactions, and industry trends. The expected terms of the options are estimated based on factors such as vesting periods, contractual expiration dates and historical exercise behavior. The risk-free rate for periods within the contractual life of the option is based on the U.S. Treasury yield curve in effect at the time of grant.\nEmployment Contracts and Termination of Employment and Change-In-Control Arrangements\nWe do not have written employment agreements or other employment arrangements with any of our executive officers. Our Board of Directors periodically evaluates the appropriate terms and conditions for the employment of our executive officers.\nOutstanding Equity Awards At Fiscal Year End\nWe do not have any unexercised stock options outstanding for any of our named executive officers.\nDirector Compensation\nWe have made no arrangements for the remuneration of our directors, except that they will be entitled to receive reimbursement for actual, demonstrable out -of -pocket expenses, including travel expenses, if any, made on our behalf. No remuneration has been paid to our directors for services to date.\nThe following table sets forth all compensation paid to our directors for the last completed fiscal year.\nName\nFees Earned\nOr\nPaid in Cash\n($)\nStock Awards\n($)\nOption Awards\n($)\nNon-Equity Incentive\nPlan\nCompensation\n($)\nChange in Pension\nValue and\nNonqualified\nDeferred\nCompensation\nEarnings\n($)\nAll Other\nCompensation\n($)\nTotal\n($)\nWalter Geldenhuys (1)\n1.Mr. Geldenhuys did not receive any compensation during the years ended December 31, 2019 and 2020 for his service as one of our Directors.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table sets forth certain information with respect to the beneficial ownership of shares of our common stock as of December 31, 2018, unless otherwise indicated, (i) individually by our Chief Executive Officer and each of our other executive officers and by each of our directors, (ii) by all our executive officers and directors as a group, and (iii) by each person known to us to be the beneficial owner of more than five percent of the outstanding shares of our common stock. Except as noted in the footnotes below, each of the persons listed has sole investment and voting power with respect to the shares indicated. The information in the table is based on information available to us. The total number of shares of common stock outstanding on December 31, 2020 was 280,386,935.\nBeneficial Owner(1)\nAmount and Nature\nOf\nBeneficial\nOwnership\nPercentage of\nCommon Stock\nOutstanding\n†Walter Geldenhuys, President, Chief Executive Officer, Chief Financial Officer and Director\n112 E. Spruce Street\nMitchell, SD 57301\n49,728,520\n(2)\n17.74%\nDiana Jakowchuk, Secretary, Treasurer and Principal Accounting Officer\n7659 E. Wood Drive\nScottsdale, AZ 85260\n3,612,142\n1.28%\nBlake Thorshov\n220 Rock Falls Road\nArroyo Grande, CA 93420\n44,542,857\n15.87%\nLDB Provident Investments, LLC\n86 South Florentine Lane\nCenterville, UT 84014\n24,766,236\n8.83%\n† Named executive officer.\n(1)\n“Beneficial ownership” is defined in the regulations promulgated by the SEC as (A) having or sharing, directly or indirectly (i) voting power, which includes the power to vote or to direct the voting, or (ii) investment power, which includes the power to dispose or to direct the disposition, of shares of the common stock of an issuer; or (B) directly or indirectly creating or using a trust, proxy, power of attorney, pooling arrangement or any other contract, arrangement or device with the purpose or effect of divesting such person of beneficial ownership of a security or preventing the vesting of such beneficial ownership. Unless otherwise indicated, the beneficial owner has sole voting and investment power.\n(2)\nThis amount includes 136,000 shares of common stock held by Mr. Geldenhuys’ daughter, of which Mr. Geldenhuys may be deemed to have indirect ownership because of the father daughter relationship.\nSecurities Authorized for Issuance under Equity Compensation Plans\nWe currently do not have any securities authorized for issuance under an equity compensation plan.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence.\nTransactions with Related Persons\nAside from the relevant provisions of the Nevada Revised Statutes and other applicable laws, we currently do not have a formal policy or procedure for the review, approval or ratification of related party transactions.\nDirector Independence\nOur Board of Directors affirmatively determines the independence of each director and nominee for election as a director, and has adopted the independence standards of the NASDAQ Capital Market, LLC. At this time, Walter Geldenhuys, the sole member of the Board of Directors, is not independent.",
    "item_14": "Item 14. Principal Accounting Fees and Services.\nThe following table sets forth the fees billed to us for professional services rendered by our principal accountant for years ended December 31, 2020 and December 31, 2019.\nServices\nAudit Fees\n21,600\n21,600\nAudit Related Services\nTax Fees\nTotal Fees\n22,570\n22,450\nAudit fees consist of fees for the audit of our financial statements. Audit related services include review of our financial statements and quarterly reports that are not reported as audit fees. Tax fees included tax planning and various taxation matters.",
    "item_15": "Item 15. Exhibits\nITEM 15. EXHIBITS\n2.1\nStock Exchange Agreement dated April 14, 2008 between Samoyed Energy Corp. and Certain Shareholders of Advanced Voice Recognition Systems, Inc. (1)\n2.2\nAgreement and Plan of Merger between Samoyed Energy Corp. and Advanced Voice Recognition Systems, Inc. (2)\n2.3\nAgreement and Plan of Merger between Advanced Voice Recognition Systems, Inc. and NCC, LLC (7)\n3.1\nArticles of Incorporation (3)\n3.2\nCertificate of Change to Articles of Incorporation (4)\n3.3\nBylaws (3)\n10.1\nTermination Agreement dated January 22, 2008 between Samoyed Energy Corp. and 313866 Alberta Ltd. (5)\n10.2\nPurchase and Sale Agreement dated May 15, 2008 between Samoyed Energy Corp. and Stone Canyon Resources, Inc. (6)\n10.3\nPurchase Agreement dated January 19, 2016 between Advanced Voice Recognition Systems, Inc. and an Investor. (9)\n10.4\nPurchase Agreement dated February 19, 2016 between Advanced Voice Recognition Systems, Inc. and an Investor. (10)\n10.5\nDeparture of Directors or Certain Officers dated February 26, 2016. (11)\n10.6\nPurchase Agreement dated March 10, 2016 between Advanced Voice Recognition Systems, Inc. and an Investor. (12)\n10.7\nPurchase Agreement dated March 10, 2016 between Advanced Voice Recognition Systems, Inc. and an Investor. (13)\n10.8\nPurchase Agreement dated March 22, 2016 between Advanced Voice Recognition Systems, Inc. and an Investor. (14)\n10.9\nPurchase Agreement dated July 14, 2016 between Advanced Voice Recognition Systems, Inc. and an Investor. (15)\n10.10\nPurchase Agreement dated September 19, 2016 between Advanced Voice Recognition Systems, Inc. and an Investor. (16)\n10.11\nPurchase Agreement dated October 11, 2016 between Advanced Voice Recognition Systems, Inc. and an Investor. (17)\n10.12\nPurchase Agreement dated October 21, 2016 between Advanced Voice Recognition Systems, Inc. and an Investor. (18)\n10.13\nLetter Agreement dated November 1, 2016 between Advanced Voice Recognition Systems, Inc. and BJC. (19)\n10.14\nPurchase Agreement dated November 16, 2016 between Advanced Voice Recognition Systems, Inc. and an Investor. (20)\n10.15\nPurchase Agreement dated December 14, 2016 between Advanced Voice Recognition Systems, Inc. and an Investor. (21)\n10.16\nPurchase Agreement dated January 12, 2017 between Advanced Voice Recognition Systems, Inc. and an Investor. (22)\n10.17\nPurchase Agreement dated February 3, 2017 between Advanced Voice Recognition Systems, Inc. and an Investor. (23)\n10.18\nPurchase Agreement dated February 21, 2017 between Advanced Voice Recognition Systems, Inc. and an Investor. (24)\n10.19\nPurchase Agreement dated February 27, 2017 between Advanced Voice Recognition Systems, Inc. and an Investor. (25)\n10.20\nPurchase Agreement dated March 23, 2017 between Advanced Voice Recognition Systems, Inc. and an Investor. (26)\n10.21\nLetter Agreement March 31, 2017 between Advanced Voice Recognition Systems, Inc. and Schmeiser (27)\n10.22\nPurchase Agreement dated April 14, 2017 between Advanced Voice Recognition Systems, Inc. and an Investor. (28)\n10.23\nPurchase Agreement dated May 1, 2017 between Advanced Voice Recognition Systems, Inc. and an Investor. (29)\n10.24\nPurchase Agreement dated May 1, 2017 between Advanced Voice Recognition Systems, Inc. and an Investor. (30)\n10.25\nPurchase Agreement dated May 4, 2017 between Advanced Voice Recognition Systems, Inc. and an Investor. (31)\n10.26\nPurchase Agreement dated June 5, 2017 between Advanced Voice Recognition Systems, Inc. and an Investor. (32)\n10.27\nPurchase Agreement dated June 19, 2017 between Advanced Voice Recognition Systems, Inc. and an Investor. (33)\n10.28\nLetter of Termination dated June 28, 2017 between Advanced Voice Recognition Systems, Inc. and Dominion (34)\n10.29\nPurchase Agreement dated October 26, 2017 between Advanced Voice Recognition Systems, Inc. and an Investor. (35)\n10.30\nPurchase Agreement dated November 9, 2017 between Advanced Voice Recognition Systems, Inc. and an Investor. (36)\n10.31\nPurchase Agreement dated December 20, 2017 between Advanced Voice Recognition Systems, Inc. and an Investor. (37)\n10.32\nPurchase Agreement dated January 21, 2018 between Advanced Voice Recognition Systems, Inc. and an Investor. (38)\n10.33\nPurchase Agreement dated February 21, 2018 between Advanced Voice Recognition Systems, Inc. and an Investor. (39)\n10.34\nPurchase Agreement dated March 6, 2018 between Advanced Voice Recognition Systems, Inc. and an Investor. (40)\n10.35\nPurchase Agreement dated March 19, 2018 between Advanced Voice Recognition Systems, Inc. and an Investor. (41)\n10.36\nPurchase Agreement dated April 5, 2018 between Advanced Voice Recognition Systems, Inc. and an Investor. (42)\n10.37\nPurchase Agreement dated April 30, 2018 between Advanced Voice Recognition Systems, Inc. and an Investor. (43)\n10.38\nPurchase Agreement dated April 30, 2018 between Advanced Voice Recognition Systems, Inc. and an Investor. (44)\n10.39\nPurchase Agreement dated May 18, 2018 between Advanced Voice Recognition Systems, Inc. and an Investor. (45)\n10.40\nLetter Agreement dated June 21, 2018 between Advanced Voice Recognition Systems, Inc. and Schmeiser (46)\n10.41\nPurchase Agreement dated July 17, 2018 between Advanced Voice Recognition Systems, Inc. and an Investor. (47)\n10.42\nLetter Agreement dated August 1, 2018 between Advanced Voice Recognition Systems, Inc. and Meyers & Associate. (48)\n10.43\nLetter Agreement dated September 24, 2018 between Advanced Voice Recognition Systems, Inc. and W. Geldenhuys. (49)\n10.44\nPurchase Agreement dated November 14, 2018 between Advanced Voice Recognition Systems, Inc and an investor.(50)\n10.45\nLetter Agreement dated December 10, 2018 between Advanced Voice Recognition Systems, Inc. and Meyers&Associate(51)\n10.46\nPurchase Agreement dated March 27, 2019 between Advanced Voice Recognition Systems, Inc. and an Investor (52)\n10.47\nPurchase Agreement dated March 27, 2019 between Advanced Voice Recognition Systems, Inc. and an Investor (53)\n10.48\nPurchase Agreement dated March 27, 2019 between Advanced Voice Recognition Systems, Inc. and an Investor (54)\n10.49\nPurchase Agreement dated April 5, 2019 between Advanced Voice Recognition Systems, Inc. and an Investor (55)\n10.50\nPurchase Agreement dated May 1, 2019 between Advanced Voice Recognition Systems, Inc. and an Investor (56)\n10.51\nPurchase Agreement dated May 1, 2019 between Advanced Voice Recognition Systems, Inc. and an Investor (57)\n10.52\nOther Event dated July 22, 2019 (58)\n10.53\nPurchase Agreement dated August 29, 2019 between Advanced Voice Recognition Systems, Inc. and an Investor (59)\n10.54\nPurchase Agreement dated December 4, 2019 between Advanced Voice Recognition Systems, Inc. and an Investor (60)\n10.55\nPurchase Agreement dated December 4, 2019 between Advanced Voice Recognition Systems, Inc. and an Investor (61)\n10.56\n10.57\n10.58\n10.59\nPurchase Agreement dated January 2, 2020 between Advanced Voice Recognition Systems, Inc. and an Investor (62)\nPurchase Agreement dated January 3, 2020 between Advanced Voice Recognition Systems, Inc. and an Investor (63)\nPurchase Agreement dated June 5, 2020 between Advanced Voice Recognition Systems, Inc. and an Investor (64)\nPurchase Agreement dated November 17, 2020 between Advanced Voice Recognition Systems, Inc and an Investor (65)\n14.1\nCode of Ethics (7)\n21.1\nSubsidiaries of the Registrant (7)\n31.1\nSection 302 Certification - Principal Executive Officer (8)\n31.2\nSection 302 Certification - Principal Financial Officer (8)\n32.1\nSection 906 Certification (8)\n(1) Incorporated by reference from the Company’s Current Report on Form 8-K filed on May 1, 2008.\n(2) Incorporated by reference from the Company’s Current Report on Form 8-K filed on June 10, 2008.\n(3) Incorporated by reference from the Company’s Registration Statement on Form SB-2 filed on October 31, 2005.\n(4) Incorporated by reference from the Company’s Current Report on Form 8-K filed on December 18, 2007.\n(5) Incorporated by reference from the Company’s Quarterly Report on Form 10-Q filed on February 14, 2008.\n(6) Incorporated by reference from the Company’s Current Report on Form 8-K filed on May 21, 2008.\n(7) Incorporated by reference from the Company’s Current Report on Form 8-K filed on March 30, 2009\n(8) Certifications\n(9) Incorporated by reference from the Company’s Current Report on Form 8-K filed on January 25, 2016\n(10) Incorporated by reference from the Company’s Current Report on Form 8-K filed on February 23, 2016\n(11) Incorporated by reference from the Company’s Current Report on Form 8-K filed on March 1, 2016\n(12) Incorporated by reference from the Company’s Current Report on Form 8-K filed on March 14, 2016\n(13) Incorporated by reference from the Company’s Current Report on Form 8-K filed on March 14, 2016\n(14) Incorporated by reference from the Company’s Current Report on Form 8-K filed on March 22, 2016\n(15) Incorporated by reference from the Company’s Current Report on Form 8-K filed on July 19, 2016\n(16) Incorporated by reference from the Company’s Current Report on Form 8-K filed on September 19, 2016\n(17) Incorporated by reference from the Company’s Current Report on Form 8-K filed on October 17, 2016\n(18) Incorporated by reference from the Company’s Current Report on Form 8-K filed on October 25, 2016\n(19) Incorporated by reference from the Company’s Current Report on Form 8-K filed on November 7, 2016\n(20) Incorporated by reference from the Company’s Current Report on Form 8-K filed on November 21, 2016\n(21) Incorporated by reference from the Company’s Current Report on Form 8-K filed on December 14, 2016\n(22) Incorporated by reference from the Company’s Current Report on Form 8-K filed on January 13, 2017\n(23) Incorporated by reference from the Company’s Current Report on Form 8-K filed on February 8, 2017\n(24) Incorporated by reference from the Company’s Current Report on Form 8-K filed on February 27, 2017\n(25) Incorporated by reference from the Company’s Current Report on Form 8-K filed on March 3, 2017\n(26) Incorporated by reference from the Company’s Current Report on Form 8-K filed on March 28, 2017\n(27) Incorporated by reference from the Company’s Current Report on Form 8-K filed on April 4, 2017\n(28) Incorporated by reference from the Company’s Current Report on Form 8-K filed on April 18, 2017\n(29) Incorporated by reference from the Company’s Current Report on Form 8-K filed on May 4, 2017\n(30) Incorporated by reference from the Company’s Current Report on Form 8-K filed on May 4, 2017\n(31) Incorporated by reference from the Company’s Current Report on Form 8-K filed on May 8, 2017\n(32) Incorporated by reference from the Company’s Current Report on Form 8-K filed on June 8, 2017\n(33) Incorporated by reference from the Company’s Current Report on Form 8-K filed on June 22, 2017\n(34) Incorporated by reference from the Company’s Current Report on Form 8-K filed on June 28, 2017\n(35) Incorporated by reference from the Company’s Current Report on Form 8-K filed on October 27, 2017\n(36) Incorporated by reference from the Company’s Current Report on Form 8-K filed on November 13, 2017\n(37) Incorporated by reference from the Company’s Current Report on Form 8-K filed on December 21, 2017\n(38) Incorporated by reference from the Company’s Current Report on Form 8-K filed on January 23, 2018\n(39) Incorporated by reference from the Company’s Current Report on Form 8-K filed on February 23, 2018\n(40) Incorporated by reference from the Company’s Current Report on Form 8-K filed on March 9, 2018\n(41) Incorporated by reference from the Company’s Current Report on Form 8-K filed on March 21, 2018\n(42) Incorporated by reference from the Company’s Current Report on Form 8-K filed on April 9, 2018\n(43) Incorporated by reference from the Company’s Current Report on Form 8-K filed on May 1, 2018\n(44) Incorporated by reference from the Company’s Current Report on Form 8-K filed on May 1, 2018\n(45) Incorporated by reference from the Company’s Current Report on Form 8-K filed on May 21, 2018\n(46) Incorporated by reference from the Company’s Current Report on Form 8-K filed on June 28, 2018\n(47) Incorporated by reference from the Company’s Current Report on Form 8-K filed on July 20, 2018\n(48) Incorporated by reference from the Company’s Current Report on Form 8-K filed on August 6, 2018\n(49) Incorporated by reference from the Company’s Current Report on Form 8-K filed on September 28, 2018\n(50) Incorporated by reference from the Company’s Current Report on Form 8-K filed on November 20, 2018\n(51) Incorporated by reference from the Company’s Current Report on Form 8-K filed on December 13, 2018\n(52) Incorporated by reference from the Company’s Current Report on Form 8-K filed on April 2, 2019\n(53) Incorporated by reference from the Company’s Current Report on Form 8-K filed on April 2, 2019\n(54) Incorporated by reference from the Company’s Current Report on Form 8-K filed on April 2, 2019\n(55) Incorporated by reference from the Company’s Current Report on Form 8-K filed on April 16, 2019\n(56) Incorporated by reference from the Company’s Current Report on Form 8-K filed on May 7, 2019\n(57) Incorporated by reference from the Company’s Current Report on Form 8-K filed on May 7, 2019\n(58) Incorporated by reference from the Company’s Current Report on Form 8-K filed on July 29, 2019\n(59) Incorporated by reference from the Company’s Current Report on Form 8-K filed on August 30, 2019\n(60) Incorporated by reference from the Company’s Current Report on Form 8-K filed on December 10, 2019\n(61) Incorporated by reference from the Company’s Current Report on Form 8-K filed on December 10, 2019\n(62) Incorporated by reference from the Company’s Current Report on Form 8-K filed on January 7, 2020\n(63) Incorporated by reference from the Company’s Current Report on Form 8-K filed on January 7, 2020\n(64) Incorporated by reference from the Company’s Current Report on Form 8-K filed on June 10, 2020\n(65) Incorporated by reference from the Company’s Current Report on Form 8-K filed on November 18, 2020\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this Annual Report to be signed on its behalf by the undersigned, thereunto duly authorized, this 31th of March, 2021.\nADVANCED VOICE RECOGNITION SYSTEMS, INC.\n/s/ Walter Geldenhuys\nWalter Geldenhuys, President, Chief Executive Officer,\nPrincipal Executive Officer, Chief Financial Officer,\nPrincipal Financial Officer, Sole Director\nMarch 31, 2021\nPursuant to the requirements of the Securities Exchange Act of 1934, this Annual Report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Walter Geldenhuys\nWalter Geldenhuys\nPresident, Chief Executive Officer, Principal Executive Officer, Chief Financial Officer, Principal Financial Officer, and Sole Director\nMarch 31, 2021\n/s/ Diana Jakowchuk\nDiane Jakowchuk\nSecretary, Treasurer, Principal Accounting Officer\nMarch 31, 2021"
}