{
    "cik": "1353499",
    "company": "Max Sound Corp",
    "filing_type": "10-K",
    "filing_date": "2021-03-26",
    "period_of_report": "2020-12-31",
    "sic": "7374",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1353499/0001344676-21-000004-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1353499/000134467621000004/maxd10k2020.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1353499/0001344676-21-000004.txt",
    "filename": "1353499_10K_2020_0001344676-21-000004.htm",
    "item_1": "ITEM 1. BUSINESS\nOverview\nMax Sound Corporation (“we,” “us,” “our,” or the “Company”) was incorporated in the State of Delaware on December 9, 2005 as 43010, Inc. to engage in any lawful corporate undertaking, including, but not limited to, locating and negotiating with a business entity for combination in the form of a merger, stock-for-stock exchange or stock-for-assets exchange. On October 7, 2008, pursuant to the terms of a stock purchase agreement, Mr. Greg Halpern purchased a total of 100,000 shares of our common stock from Michael Raleigh for an aggregate of $30,000 in cash. As part of the acquisition, and pursuant to the Stock Purchase Agreement,\nRaleigh, resigned from all the key executive positions he held in the company, and Mr. Halpern was appointed as our President, CEO, CFO and Chairman. The original business model was developed by Mr. Halpern from October 2008 until January 2011, which focused on developing an Internet search engine and social networking web site launched in January of 2010 featuring an outstanding endorsement and web based commercial by William Shatner for stock warrants.\nBetter capitalized, Silicon Valley, Venture-funded companies crowding the same space with more advanced products, caused the Company to diversify on May 11, 2010, when it acquired the worldwide rights, title and interest to all fields of use for MAX-D HD Audio Technology to which our current website https://www.maxd.audio/showcases, what finally in 2021, is living up to its original vision as major breakthrough technology.\nOn March 8, 2011, the Company changed its name to Max Sound Corporation and its trading symbol on the OTC Bulletin Board to MAXD.\nMAX-D is to Audio what High Definition is to Video and today it works by delivering the best-in-class consumer audio experience rivaling any existing product available to listeners globally. Remarkably, MAX-D accomplishes its auditory miracle without increasing file size and saves on bandwidth usage and cost in the process.\nIn Q2 of 2014, MAXD announced that it had acquired the license and representation rights to VSL’s patented video and data technology known as “Optimized Data Transmission System and Method” (ODT) which enables end-user licensees to transport 100% of data bandwidth content in only 3% of the bandwidth with the identical lossless quality. Significantly, this represented a 33 times reduction associated with transport cost and the time it takes for the video or digital content to be delivered to and viewed by the end-user.\nAlso, in Q2 of 2014, MAXD entered into a representation agreement with architect Eli Attia giving MAXD the exclusive rights to sue violators of Eli Attia’s intellectual property rights. While Eli Attia was teaching his invention at Google [x], the project was internally valued by Google at $120 Billion USD a year in the Architecture, Engineering and Construction industry to which Attia has been a leader for half a century.\nThe Racketeering (RICO) version of the case has been spearheaded by John E. Floyd, the leading authority on RICO in all fifty states and the protégé of G. Robert Blakey, the creator of the original RICO statute and the co-author of the Attia’s initial RICO suit against Google and the founders, Larry Page and Sergey Brin as well as Google X CEO Astro Teller, Sebastian Thrun, and Flux Factory with its falsely claimed co-inventors Nicholas Chim, Jennifer Carlile, Michelle Kaufmann, Augusto Roman and Astro Teller. In the appealed RICO opening brief, Floyd makes the following points as part of his argument -\n“The district court misapplied the law in each of its rulings. The court’s statutory standing finding was premised on an unduly restrictive reading of the DTSA and 18 U.S.C. § 1832 that actually protects-indeed, rewards-the most egregious trade secret mis-appropriators - those who, like Google, steal and then extinguish trade secrets altogether by wrongfully publishing them. Neither the DTSA nor § 1832, however, can be construed in such a self-defeating manner. And in any event, Google and Flux are equitably estopped from invoking Google’s wrongful publication of Plaintiffs’ trade secrets to evade liability under either the DTSA or RICO.”\nIn October 2019, the Federal Circuit ruled that the Inter Partes Review (IPR) Judges at the Patent Trademark and Appeals Board (PTAB) were not qualified under the United States Constitution, so therefore Googles impairment of the ‘339 ODT Patent was illegal in the process Max Sound’s Chairman Halpern has been calling “criminal theft of legitimate American Small Business Inventors under the license for big Corporations to steal known as America Invents Act.”\nTo further clarify MAXD’s current role in the Attia and ODT legal matters described above, the Company is not a party to any of these legal cases that it has an interest in and the potential to profit from in the future. The Company has brought together IP rights holders since 2014 with both Contingency Law Firms and Litigation Financed Law Firms to create the enforcement of Intellectual Property rights holders with cases currently addressing Patent Infringement, Trade Secret Theft, Breach of Contract and Racketeering (“RICO”). MAXD has secured the potential to profit therefrom, as the power of attorney, to negotiate and approve a final financial deal with Google on behalf of the rights holders as either settlements or licensing arrangements both of which have been in and out of negotiations for the past six years. Halpern recently was quoted, \"There are many more cases that will be filed against Anti-trust Monopoly Google for its bad-business-practices for the past decade ultimately going forward until they change their worst-in-class, anti-American approach to inventors. Samsung recently called them the most dishonest company in history. Eight years ago, Google never had heard of little MAX-D. Now, they wish they'd never heard of us. Next up is a few trillion dollars more of exposure to theft where the courts have just looked the other way. While we are finally able to build our business successfully around Google's premeditated thefts, their judicial manipulation and total lack of any ethical standard, MAX-D will never bow down until Google is forced to pay.\"\nDescription of Our Business\nAfter years of R & D and business development that pushed and pulled the company and its HD Audio and Biometric Security technologies in many directions, MAX-D has finally become an important player to several major industries, requiring the best-in-class solutions it offers.\nAs subsequent events all this month of March, MAXD has signed three actual revenue events that create a standard for licensing going forward as follows - MAX-D receives at least 6 figures of upfront money, at least 7 figures over ten years to maintain exclusivity in specific industry or geographical categories, and finally the clear potential for up to 8 figures of residuals from related joint revenue sharing opportunities.\nThanks now to the massive value growth and popularity of Tesla Motors, the Hende Moto Signed License Agreement, has opened up a host of other incoming offers to license from Electric and Hybrid vehicles in several major countries that are in fast moving negotiations at this time. The sudden positive demand for MAX-D, clearly illustrates that it can provide an immediate competitive market advantage over virtually any other brand solution, while simultaneously co-existing as a tremendous complimentary addition to any other popular brand already imbedded in existing hardware and software in the Audio Categories that MAX-D will effortlessly compete in going forward.\nMax Sound (MAX-D) has finally arrived at the on-time moment in history where it has an endless audience of licensing opportunities resulting in newly closed deals that assure MAX-D - at least 6 figures in up front money, 7 figures over ten years and 8 figures of projectible revenue share residuals.\nQualcomm - MAX-D Mobile Voice\nThe Company is currently working under its existing license with Qualcomm offering software code for 600 series Snap Dragon chips. MAX-D Mobile Voice provides clean, intelligible voice call over a standard mobile line without increasing file size and it eliminates the need for special codecs.\nMAX-D Mobile Voice -\n• Does not require “special” hardware in order to work.\n• Can be implemented into ANY Mobile voice application.\n• Works on Any Mobile platforms without extra bandwidth use\n• Can be immediately applied in any cell phone dsp.\n• Is a dynamic process that adjusts itself according to the use or the needs of the user\n(1.) Test voice enters\n(2.) the ANALYZE VOICE module where the harmonic and amplitude of the voice are analyzed for content.\n(3.)This analyzing will produce a harmonic and dynamic map in the DETERMINE HARMONIC AND AMPLITUDE module to drive the next module.\n(4.) A new voice will be generated using the GENERATE ENHANCED VOICE module. This module will compare the original voice with a model that has been optimized for harmonic and dynamic ranges and apply the difference of the two to create an entirely new voice that has been optimized for clarity in the host device.\n(5.) The ENHANCED VOICE OUTPUT will be output to the host device.\nMAX-D Mobile Voice\nThere is a consumer driven need to improve accuracy & quality of Mobile voice audio.\nThe Problem -\nCell phone electronics commonly have a very limited frequency range. This results in anything from degraded to garbled hearing on the receiving device. The voice recognition engines in devices are very DSP intensive. Usually, to\nimplement a better quality one requires more DSP powering the device, or you can add the Max Sound process and increase the productivity of the existing one.\nThe Solution-\nBy applying the MAX-D VOICE ENHANCEMENT to this audio it becomes much clearer and easir to dicern the voice you are listening to. This process is a digital process meant to be used in the DSP of a device. It can be used on both inbound and outbound calls for improvement of both. On the outbound call, the device receiving the call will receive better than “normal” audio quality because of the process.\nAs the process increase the intelligability of the audio, it provides the existing voice recognition engine with processed audio of much greater intelligability than without. Thus allowing the existing engine to function with a higher degree of accuracy at a lower DSP cost than totally replacing it.\nSummary of the Invention\n1. A computer implemented method for enhancing processed voice comprising:\na. receiving voice audio; and\nb. enhancing the voice audio in several harmonic and dynamic ranges.\n2. The computer implemented method of embodiment 1, wherein the audio is enhanced by resynthesizing it into full range PCM wave.\n3. The computer implemented method of embodiment 1 or 2, wherein the received mobile voice audio is in compressed format.\n4. The computer implemented method of any one of embodiments 1-3, wherein the voice audio is from an inbound mobile call.\n5. The computer implemented method of any one of embodiments 1-3, wherein the voice audio is from an outbound mobile call.\nDetailed Description of the Invention\nMAX-D Mobile Voice process is used to help clarify both inbound and outbound voice on a Mobile Device. This is accomplished by restoring (resynthesizing) the Mobile Device audio to a much greater harmonic and dynamic range than the original.\nInbound:\nThe user talks into the device, where it goes into the MAX-D Mobile Voice enhancement module. There, the harmonic and dynamic properties are resynthesized into a full range PCM (Pulse-code modulation) wave with extended audio content. Therefore, it has much more clarity to work from instead of the compressed, band limited audio available in the existing cell audio.\nOutbound:\nThe user speaks into the device's microphone and the result is much clearer, more real sounding wave that is transmitted to the call receiver. The transmitted wave retains much of the quality of the original voice, even though it has to be compressed by the cell phone system.\nFigure\nFigure\nThe above picture is an unprocessed voice call from a mobile device.\nHere's a Voice call from a device processed with MAX-D Mobile Voice.\nIn the two graphic examples of a voice call without and with the MAX-D Mobile Voice you can clearly see that we have resynthesized material into the processed wave, thus making it much clearer and much more discernable to the listener.\nOptimized Data Transmission (ODT)\nIn November 2016, MAX-D entered into an agreement with Vedanti Licensing Limited (VLL), and become co-owners of the ODT patents and technology.\nAbout MAX-D HD Audio:\nThe MAX-D software improves the sound heard from any device. Consumers have unknowingly sacrificed better audio quality for portable convenience and MAX-D rectifies this problem by: analyzing what content is missing from the compressed audio signal; dynamically resynthesizing lost harmonics and natural sound fields in real time; maximizing the output potential of any device without increasing original file size; and without requiring consumers or OEM’s to change equipment or infrastructure.\nMAX-D Benefits: Increases dynamic range, eliminates destructive effects of audio compression with no increase in file size or transmission bandwidth; High-resolution audio reproduction with an omni-directional sound field using only two speakers; “Real” three-dimensional sound field, versus artificial sound field created by competing technologies; and More realistic “live performance” quality of all recordings with optimal dynamic range, bass response and overall clarity.\nMAX-D Audio Market:\nMAX-D is targeting primarily Mobile Communication - Voice, Multi-media & Entertainment\nMAX-D is fully compatible with existing playback technology. We believe that no current competitor can provide the level of sound quality and end user experience that MAX-D delivers.\nMAX-D is beginning R&D for integration into the Blockchain Space, finding new ways to use sound to enhance security, provide new ways to imbed and track data of digital assets.\nMAX-D App:\nIn 2018, the Company’s Mobile App user base (with no dedicated marketing budget being employed) had over 1,000,000 subscribers on the free version of our HD Audio App for MP3’s on Android and Apple.\nIn March 2021, the company signed an agreement with TIP SOLUTIONS to develop an updated version of the MAX-D app for Apple iOS and Android.\nMAX-D Technology\nMAX-D is a unique approach to processing sound, based on the physics of acoustics rather than electronics. Remarkably simple to deploy, MAX-D is a technology that dramatically raises the standard for sound quality, with no corresponding increase in file size or transmission channel bandwidth. This is accomplished by processing audio with our proprietary, patent-pending process. This embedded and duplicating format either remains the same or can be converted to whatever format the user desires, while retaining unparalleled fidelity and dynamic range. MAX-D restores the original recorded acoustical space in any listening environment. MAX-D is the only technology that both aligns phase and corrects phase distortion in a completed recording. MAX-D supplies missing audio content by adding acoustics and frequency response lost in the original recording or in the compression and transmission processes. MAX-D corrects and optimizes harmonic content and low frequency responses, greatly enhancing acoustic accuracy and we believe reduces ear fatigue. MAX-D integrates time, phase, harmonics, dynamics, and sub-harmonic region\noptimizations in a fully dynamic fashion. MAX-D is a lossless dynamic process, requiring no destructive encoding/decoding process, or any specialized decoder at all. MAX-D needs no additional hardware or critical monitoring stage after processing. The end result is that every aspect of audio processed with MAX-D - voice, instrument, or special effects - sounds refreshingly clear, realistic, and natural. The MAX-D HD Audio Technology creates an optimum sound field throughout every listening environment - from the corners of a theater; on your living room couch; to the back seat of your car. MAX-D HD Audio Technology requires no equipment changeover and can be embedded into any product (e.g. speakers, headphones, mobile devices), or online content delivery systems (e.g. streaming, cable, video games) to provide better sounding audio.\nMarket\nMAX-D products and services are designed and intended to add high-definition quality and cost-savings to audio components and delivery of several separate industries, including consumer electronics, motion picture, broadcasting, video game, recording, mobile phone, internet, and VOIP applications.\nCompetition\nThe Company’s management believes there are no current direct competitors capable of delivering as high quality of audio technology as its MAXD HD Audio. Although other companies, like DTS or Dolby, have technologies that enhance sound; we do not believe these technologies negatively affect the Company because the MAX-D process can enhance the other audio company’s technology.\nWe believe we will be considered friendly competition in the future for three reasons; (1) we believe that MAX-D technology delivers the best sound quality available today, (2) MAX-D does not require any additional equipment; and (3) MAX-D makes any competition’s audio processes sound better.\nIntellectual Property\nMax-D and HD Audio technologies and designs are Patented, Patents Pending and Trademarked. The Company currently owns Patent No. 9300262, Audio Processing Application for Windows, which was published on November 12, 2015 and then unlawfully assigned to Adli Law Group. Adli Law Group states that the patent has been reassigned to the Company, notwithstanding, the Company is pursuing damages against Adli Law Group. On February 8, 2011, the words “Max Sound” were issued to the Company by the U.S. Patent and Trademark office under Serial Number 85050705.\nOn June 13, 2017, the U.S. Patent and Trademark office Company was granted a “Biometric audio security” patent to the Company under Serial Number 9,679,427\nOn June 2, 2015, the words “HD Audio” were issued to the Company by the U.S. Patent and Trademark office under Serial Number 86395458 for the following applications: Computer application software for mobile phones, namely, software for HD audio; Computer hardware and software systems for delivery of improved HD audio; Computer hardware for communicating audio, video and data between computers via a global computer network, wide-area computer networks, and peer-to-peer computer networks; Computer software for manipulating digital audio information for use in audio media applications; Computer software to control and improve computer and audio equipment sound quality; Digital materials, namely, CD's, DVD's, MP3's, streaming media, movies, videos, music, concerts, news, pre-recorded video, downloadable audio and video and high definition audio and video featuring improved HD audio; Digital media, namely, pre-recorded DVDs, downloadable audio and video recordings, and CDs featuring and promoting improved HD audio; Digital media, namely, pre-recorded video cassettes, digital video discs,\ndigital versatile discs, downloadable audio and video recordings, DVDs, and high definition digital discs featuring improved HD audio; Digital media, namely, CD's, DVD's, MP3's, movies, videos, music, concerts, news, pre-recorded video, downloadable and streaming audio and video and high definition audio and video featuring improved HD audio; Downloadable MP3 files, MP3 recordings, on-line discussion boards, webcasts, webinars and podcasts featuring music, audio books in the field of entertainment and general subjects, and news broadcasts; Software to control and improve audio equipment sound quality; Sound recordings featuring improved HD audio.\nResearch and Development\nThe MAX-D API can be deployed across all streaming platforms along with most audio/video web-based services including mobile audio hardware such as speakers and audio receivers including car smart head units. After nearly a decade of time, and innovation and several million dollars of expenditures, the Company believes in 2021, that it will\ninally license the MAX-D HD Audio on a major scale working with two strategic partners who have global reach and can help to solve a few specific problems for each other by pushing the MAXD HD Audio forward in their technology eco-system.\nOn March 4, 2021, the Company signed a 10-year exclusive licensing agreement with TIP Solutions (Licensee) to implement the MAXD HD Audio Source Code into their mobile phone app and platforms. The Licensee was granted an exclusive license of MAX-D HD audio technology for an annual payment of $100,000 or $25,000 paid quarterly for up to 10 years.\nThe agreement also calls for a license fee split in the event the following occurs:\n• If Licensor is TIP - 20% of total license revenue received by TIP will be paid to Max Sound within 30 days of such receipts.\n• If the Licensor is Max Sound and combined with TIP Solutions Smart Call Assistant, 20% of total license revenue received by Max Sound will be paid to TIP within 30 days.\nOn March 9, 2021, the Company received a $100,000 payment from the Licensee.\nEmployees\nAs of December 31, 2020, we had 1 full time employee.\nAnticipated Milestones for the Next Twelve Months\nFor the next twelve months, our most important goal is to become cash flow positive by growing Max Sound HD Audio sales through licensing and recurring revenue streams. Our goal is to have this growth improve our stock value and investor liquidity. We expect our financial requirements to increase with the additional expenses needed to promote the MAX-D HD Audio Technology. We plan to fund these additional expenses by equity loans from our existing lines of credit and we are also considering various private funding opportunities until such time that our revenue stream is adequate enough to provide the necessary funds.\nThree agreements have been signed in March 2021 under the following general terms -\nLICENSOR hereby grants LICENSEE an individual non-transferable, indivisible and non-exclusive worldwide license as set forth in this Agreement. LICENSEE hereby grants LICENSOR an individual non-transferable, indivisible and non-exclusive worldwide license as set forth in this Agreement.\nLICENSOR can use, but not modify, the Licensed Works (including the MAX SOUND MAX-D DSP audio processor source code) in order to process content available or streamed onto the device and can run on Licensed Products, for processors designated as adequate by LICENSEE.\nLICENSEE shall be granted an exclusive license per their unique industry category upon the completion of the payment of One Hundred Thousand Dollars (100k USD). This exclusive license is maintainable with a 100k payment paid annually, or 25k paid quarterly, for up to 10 years. This annual license fee will maintain LICENSEE’s exclusivity. If for any reason the license fee is defaulted in the future, LICENSOR reserves the right to cancel exclusivity, but not the license.\nParties shall be responsible for their own NRE (Non-Recurring Engineering costs) except when designated otherwise. In the current updates to MAXD Audio on Qualcomm 800 Series Chipset, and for iOS and Android Apps respectively, Tip is assuming the cost of the NRE for final development of MAXD HD Audio as provided for herein.\nSeveral more are under consideration\nTIP SOLUTIONS\nMax Sound Corp. Announced The Official Signing of Its First Major, Fee-based, License for MAX-D HD Audio® Technology in a Joint Venture Agreement with Tip Solutions, Inc.\nMax Sound Corp. has signed a Joint Venture Agreement with TIP Solutions, that brings their revolutionary technologies to market together with game-changing Patented and Trademarked MAX-D HD Audio and TIP's Cutting Edge Call Management Platform.\nUnder the Joint Venture, TIP has now licensed MAX-D’s HD Audio breakthrough with a six-figure, up-front fee and projected fees and royalties of at least seven-figures over ten years.\nHighly popular, beloved and retired NBA Champion and Superstar Shaquille O’Neal is already a Brand Ambassador for TIP Solutions, and a TIP Equity holder, noting on-air previously “I came together with TIP Solutions for the opportunity to shape the future of mobile communication... we aim to shake up the world of new technology, and reset the boundaries of what's possible.\"\nFor the past several years, TIP and MAX-D have separately been working with Qualcomm, each under the Chip Giant's Developer program to bring their respective technologies into the Qualcomm Snapdragon chip set eco-system. Now, thankfully, both firms will double their strength by working together on their mutually compatible goals which will build even better overall products for end users.\nUnder the agreement, TIP has picked up MAX-D's non-recurring engineering costs (NREs) to develop onto the elite Snapdragon 800 series, as well as a current updating of MAX-D’s iOS and Android apps, which will add the Spotify paid service option and a monthly subscription program for dynamically improved sonic benefits.\nAdditional developments will include launching MAX-D into new cutting-edge, automatically pairing, voice activated Bluetooth speakers. When presented with any choice between MAX-D HD Audio or standard audio, consumers always prefer MAX-D.\nFormula 4 Protocol\nMax Sound Corp (MAX-D) Signs Landmark Agreement with Formula 4 Protocol For HD Audio Branded Content that Includes National and then International Distribution in Major Retail\nMAX-D signed a 6-figure Joint Venture Licensing Agreement providing its HD Audio Technology to Formula 4 Protocol, one of the top up and coming Life Mastery and Meditation programs.\nFormula 4 Protocol will be upgrading its successful line as an improved, premium offering of courses and meditations processed and branded with MAX-D HD Audio to provide users the option of an even deeper, more immersive transformational experience\nUtilizing the MAX-D technology, Formula 4 Protocol will deliver some of the most advanced, most effective meditations in the world today.\nMAX-D will be receiving royalties for up to 10 years from the sales of the MAX-D HD Audio version of Formula 4 Protocol.\nHende Moto\nMAX-D signed a 6-figure Joint Venture Licensing Agreement providing its HD Audio Technology to Hende Moto, an African based hybrid car company who’s at the forefront of bringing advanced car technology to Africa while simultaneously reducing their carbon footprint.\nHende Moto has licensed MAX-D’s HD Audio breakthrough with a six-figure, up-front fee and projected fees and royalties of at least seven-figures over ten years for all their hybrid vehicles in Africa. (More specific details, including revenue sharing components that could create greater projectable sales growth, will appear this month in MAX-D's upcoming 10k annual report in the Subsequent Events section.)\nProducing affordable and fuel efficient vehicles that are both electric and petrol powered, Hende Moto has an extraordinary ability to bring new resources and technology to one of the fastest growing economies in the world. Founder Divine Mafa has been shortlisted for the Top 100 Leaders in Automotive and Transportation Award at the ITAS Conference this June at the MGM hotel in Las Vegas, Nevada where they will be recognized for their innovation.\nOver the next twelve months, our focus will be on achieving and implementing the following:\n• MAX-D is available to Qualcomm OEM’s on the 600 Series Snap Dragon\n• Settle our litigations. Coordinate licensing among two of the largest strategic partners leading to several years of substantial revenue growth\n• Licensing MAX-D technology and Brand to a number of different companies and multimedia providers.\n• Expanding the MAX-D product line through partnerships of electronics manufacturers such as Bluetooth speakers, Electric Cars and Mobile Apps.\n• Partnering with companies that are innovating the multimedia industry through implementation of new platforms and technologies that utilize blockchain, cryptocurrency, Non-fungible tokens (NFTS) to create and distribute HD Audio and MAX-D Biometric Security into new spaces.\n• MAX-D is beginning to plan and develop their patented process into an Audio Plugin that end users can use in a variety of applications to apply MAX-D to their multimedia content.\nLong-Term Goals\n• Increase Max Sound’s customer base producing scalable consumer adoption and branding differentiated as a deliverer of game-changing audio technology.\n• Make a financial return on the investments of the last three years with new sales and reduction of indirect costs, to become cash flow positive and then profitable in 2020.",
    "item_1A": "ITEM 1A. RISK FACTORS\nNot applicable for smaller reporting companies.",
    "item_1B": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot applicable for smaller reporting companies.",
    "item_2": "ITEM 2. PROPERTIES.\nOffice Arrangements and Operational Activities\nIn November 2010, we leased our MAX-D post-production facility at 2902A Colorado Ave., Santa Monica, CA, 90404. The lease was for two years with one-year renewable options. On February 5, 2016, the Company closed the Santa Monica office space located at 2902A Colorado AvenueSanta Monica, CA 90404 centralizing its new address of record at 3525 Del Mar Heights Road, #802, San Diego, CA 92130",
    "item_3": "ITEM 3. LEGAL PROCEEDINGS.\nSee NOTE 5 titled LITIGATION for information on Legal Proceedings.\nNo assurance can be given as to the ultimate outcome of these actions or its effect on the Company.",
    "item_4": "ITEM 4. SAFETY DISCLOSURES.\nNot applicable.\nPART II",
    "item_5": "ITEM 5. MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nMarket Information\nOur shares of common stock are traded on the OTC Bulletin Board under the symbol “MAXD.” The following table sets forth, for the period indicated, the high and low bid quotations for the Company’s common stock. These quotations represent inter-dealer quotations, without adjustment for retail markup, markdown or commission, and may not represent actual transactions.\nPrice High\nLow\nFirst quarter $ .0002 $ .00001\nSecond quarter $ .0001 $ .00003\nThird quarter $ .0002 $ .00005\nFourth quarter $ .0012 $ .0001\nFirst quarter $ .0003 $ .0001\nSecond quarter $ .0002 $ .0001\nThird quarter $ .0002 $ .0001\nFourth quarter $ .0002 $ .0001\nHolders\nAs of December 31, 2020, in accordance with our transfer agent records, we had 2612 record holders of our Common Stock. This number excludes individual stockholders holding stock under nominee security position listings.\nDividends\nTo date, we have not declared or paid any dividends on our common stock. We currently do not anticipate paying any cash dividends in the foreseeable future on our common stock, when issued pursuant to this offering. Although we intend to retain our earnings, if any, to finance the exploration and growth of our business, our Board of Directors will have the discretion to declare and pay dividends in the future.\nPayment of dividends in the future will depend upon our earnings, capital requirements, and other factors, which our Board of Directors may deem relevant.\nSecurities Authorized For Issuance Under Equity Compensation Plans.\nNone.\nStock Option Grants\nNONE\nRecent Sales of Unregistered Securities\nNONE\nSee NOTE 3 - DEBT\nCompensation-based Issuances\nSee NOTE 7 - COMMITMENTS\nThe Company determined that the securities described above were issued in transactions that were exempt from the registration under the Securities Act of 1933, as amended (the “Securities Act”), pursuant to Section 4(a)(2) thereunder. This determination was based on the non-public manner in which we offered the securities and on the representations of the recipients of the securities, which included, in pertinent part, that they were “accredited investors” within the meaning of Rule 501 of Regulation D promulgated under the Securities Act, that they were acquiring such securities for investment purposes for their own account and not with a view toward resale or distribution, and that they understood such securities may not be sold or otherwise disposed of without registration under the Securities Act or an applicable exemption therefrom.",
    "item_6": "ITEM 6. SELECTED FINANCIAL DATA.\nNot applicable.",
    "item_7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following plan of operation provides information which management believes is relevant to an assessment and understanding of our results of operations and financial condition. The discussion should be read along with our financial statements and notes thereto. This section includes a number of forward-looking statements that reflect our current views with respect to future events and financial performance. Forward-looking statements are often identified by words like believe, expect, estimate, anticipate, intend, project and similar expressions, or words which, by their nature, refer to future events. You should not place undue certainty on these forward-looking statements. These forward-looking statements are subject to certain risks and uncertainties that could cause actual results to differ materially from our predictions.\nOverview\nWe were incorporated in the State of Delaware as of December 9, 2005 as 43010, Inc. to engage in any lawful corporate undertaking, including, but not limited to, locating and negotiating with a business entity for combination in the form of a merger, stock-for-stock exchange or stock-for-assets exchange. On October 7, 2008, pursuant to the terms of a stock purchase agreement, Mr. Greg Halpern purchased a total of 100,000 shares of our common stock from Michael Raleigh for an aggregate of $30,000 in cash. The total of 100,000 shares represents 100% of our issued and outstanding common stock at the time of the transfer. As a result, Mr. Halpern became our sole shareholder. As part of the acquisition, and pursuant to the Stock Purchase Agreement, Michael Raleigh, our then President, CEO, CFO, and Chairman resigned from all the positions he held in the company, and Mr. Halpern was appointed as our President, CEO CFO and Chairman.\nIn May of 2010, we acquired the world-wide rights to all fields of use for Max Sound HD Audio Technology. In November of 2010, we opened our post-production facility for Max Sound HD Audio in Santa Monica California. In February of 2012, after several successful demonstrations to multi-media industry company executives, we decided to shift the focus of the Company to the marketing of the Max Sound HD Audio Technology and commenced the name change from So Act Network, Inc. to Max Sound Corporation and the symbol from SOAN to MAXD.\nOn December 3, 2012, the Company completed the purchase of the assets of Liquid Spins, Inc., a Colorado corporation (“Liquid Spins”). Pursuant to the Asset Purchase Agreement, the assets of Liquid Spins were exchanged for 24,752,475 shares of common stock of the Company (the “Shares”), equal to $10,000,000 and a purchase price of $.404 per share. The assets of Liquid Spins purchased included: record label distribution agreements; Liquid Spins technology inventory; independent arts programs; retail contracts for music distribution; physical inventory and office equipment; design and retail ready concepts; brand value; records; publishing catalog; and web assets. During 2016, the Company reviewed the intangible asset for impairment and determined that certain items had been impaired due to obsolescence. As a result of this review, the Company recorded an impairment loss of $ 15,703,617 that is recorded as impairment loss on intangible asset.\nNo later than June 20, 2014, MAXD entered into a representation agreement with VSL Communications, Inc., making MAXD the exclusive agent to VSL to enforce all rights with respect to patented technology owned and controlled by VSL. In particular, the Company announced that it had acquired a worldwide license and\nrepresentation rights to a patented video and data technology “Optimized Data Transmission System and Method” which enables end-user licensees to transport 100% of data bandwidth content in only 3% of the bandwidth with the identical lossless quality. Significantly, this represents thirty-three times reduction associated with transport cost and the time it takes for the video or digital content to be viewed by an end-user. As described more fully in the Legal Proceedings Section, The Company has since filed suit against Google, Inc., YouTube, LLC, and On2 Technologies, Inc., alleging willful infringement of the patent.\nOn May 22, 2014, MAXD entered into a representation agreement with architect Eli Attia giving MAXD the exclusive rights to sue violators of Eli Attia’s intellectual property rights. While Eli Attia was teaching his invention at Google [x], the project was internally valued by Google at $120 Billion USD a year. Since then, Flux has since been spun-out of Google [x], funded and has quickly growing, upon information and belief, to over 800 employees according to one of its founders. MAXD, on behalf of Attia’s, have since filed suit against Google, Inc., Flux Factory, and various executives of these companies for misappropriation of trade secrets. Since this time, the Company has advanced the case(s) and has signed additional agreements with the inventor as late\nas February 21st, 2017 and with additional counsel in June 2018 to support the RICO claim.\nOn November 29, 2016, MAXD entered into an agreement with Vedanti Systems Limited and Vedanti Licensing Limited (VLL) that resolves their dispute over the international Optimized Data Transmission (ODT) patent portfolio previously owned by Vedanti. The agreement further provides that VLL and MAXD will become co-owners of the pioneering portfolio.\nVideos and news relating to the Company is available on the company website at www.maxd.audio. The MAX-D Technology Highlights Video summarizes the HD Audio™ process and shows the need for high definition (HD) Audio in several key vertical markets. The video explains MAX-D as what we believe to be the only dynamic HD Audio™ that is being offered to various markets.\nPlan of Operation\nWe began our operations on October 8, 2008, when we purchased the Form 10 Company from the previous owners. Since that date, we have conducted financings to raise initial start-up money for the building of our internet search engine and social networking website and to start our operations. In 2011, the Company shifted the focus of its business operations from their social networking website to the marketing of the MaxSound HD Audio Technology and in 2014 the Company began litigations against Google and others for infringement of its technologies and associated legal rights to the various proprietary technologies.\nThe Company believes that Max Sound HD Audio Technology is a game changer for several vertical markets whose demand will create revenue opportunities in 2021.\nWe expect our financial requirements to increase with the additional expenses needed to market and promote the MAX-D HD Audio Technology. We plan to fund these additional expenses through financings and through loans from our stockholders and/or officers based on existing lines of credit and we are also considering various private funding opportunities until such time that our revenue stream is adequate enough to provide the necessary funds.\nResults of Operations\nFor the year ended December 31, 2020 and December 31, 2019:\nGeneral and Administrative Expenses: Our general and administrative expenses were $89,929 for the year ended December 31, 2020 and $110,547 for the year ended December 30, 2019, representing a decrease of 20,618, or approximately 19%, as a result of decrease in the general operation of the Company included decreasing personnel, product development and marketing of our Max Sound Technology.\nConsulting Fees: Our consulting fees were $0 for the year ended December 31, 2020 and $20,800 for the year ended December 31, 2019, representing an decrease of $ 20,800, or approximately 100%. The Company has decreased the use of consultants to assist the Company.\nProfessional Fees: Our professional fees were $59,200 for the year ended December 31, 2020 and $32,754 for the year ended December 31, 2019, representing increase of $26,446 or approximately 81%, an increase in professional fees was attributable to fees required in connection with filing with the Security and Exchange Commission .\nCompensation: Our compensation expenses were $342,000 for the year ended December 31, 2020 and $450,000 for the twelve months ended December 31, 2019, representing a decrease of $108,000, or approximately 24% as a result of decrease in our expensing of monthly compensation to our management.\nNet Loss: Our net loss for the year ended December 31, 2020 was $1,497,818. While the operational expenses in marketing our Max Sound technology decreased from the same period of last year, the overall amount of our net loss substantially decreased as a result of a decrease in operating expenses and a decrease in the fair value of embedded derivative liability associated with the convertible debt.\nLiquidity and Capital Resources\nRevenues for the twelve months ended December 31, 2020 and 2019, were $0 and $0, respectively. We have an accumulated deficit of $82,972,471 for the period from December 9, 2005 (inception) to December 31, 2020 and have negative cash flow from operations of $18,236 for the year ended December 31, 2020.\nOur financial statements have been presented on the basis that it is a going concern, which contemplates the realization of revenues from our subscriber base and the satisfaction of liabilities in the normal course of business. We have incurred losses from inception. These factors raise substantial doubt about our ability to continue as a going concern.\nFrom our inception through December 31, 2020, our primary source of funds has been the proceeds of private offerings of our common stock, private financing, and loans from stockholders. For the past 24 months we have not conducted any capital raising activities.\nIn the year ended December 31, 2020 the Company issued no convertible notes and agreed with its only two debt holders to eliminate all of the moving conversion rights until the S.E.C rightfully enforces Regulation Sho to restore the Company’s equity stolen by Knight Securities and other bad market actors who continue unimpeded in their daily illegal naked short selling of the Company’s shares and in absolute and direct violation of the existing law.\nLoans and Advances\nOn July 6, 2017, the Company entered into a two-year line of credit agreement with the principal stockholder in the amount of $100,000. Subsequently, on October 2, 2017, the Company entered into a two-year line of credit agreement with the principal stockholder in the amount of $200,000. The line of credit carries an interest rate of 4%.\nOn October 2, 2017, the Company, in exchange for Greg Halpern's consideration issuing the Company a line of credit of $100,000 on July 6, 2017 and another line of credit of $200,000 on October 2, 2017 and for Mr. Halpern's forgiveness of $960,000 of interest owed to Mr. Halpern for his Preferred Shares accrued dividend rate of 8% per annum of his already owned 5 million Series A Convertible Preferred Shares, the Board deemed it proper to grant Mr. Halpern an additional 800,000,000 shares of the Company's common stock, which at Mr. Halpern's election he may convert into 5,000,000 additional Series A Convertible Preferred Shares with the same voting rights and percentages as his previously granted and owned 5,000,000 Series A Convertible Preferred Shares.\nThe line of credit balance and accrued interest as of December 31, 2020 is $436,373. During the year ended December 31, 2020, line of credit increased by $89,655.\nRecent Accounting Pronouncements\nAll other newly issued accounting pronouncements but not yet effective have been deemed either immaterial or not applicable.\nCritical Accounting Policies and Estimates\nOur financial statements and related public financial information are based on the application of accounting principles generally accepted in the United States (“GAAP”). GAAP requires the use of estimates; assumptions, judgments and subjective interpretations of accounting principles that have an impact on the assets, liabilities, revenues and expense amounts reported. These estimates can also affect supplemental information contained in our external disclosures including information regarding contingencies, risk and financial condition. We\nbelieve our use of estimates and underlying accounting assumptions adhere to GAAP and are consistently and conservatively applied. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances. Actual results may differ materially from these estimates under different assumptions or conditions. We continue to monitor significant estimates made during the preparation of our financial statements.\nUse of Estimates:\nIn preparing financial statements in conformity with generally accepted accounting principles, management is required to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the financial statements and revenues and expenses during the reported period. Actual results could differ from those estimates.\nRevenue Recognition:\nRevenue is recognized when persuasive evidence of an arrangement exists, delivery has occurred, the fee is fixed or determinable and collectability is assured. We had $0 and $0 in revenue for the ended December 31, 2020 and 2019, respectively.\nStock-Based Compensation:\nIn December 2004, the FASB issued FASB Accounting Standards Codification No. 718, Compensation - Stock Compensation. Under FASB Accounting Standards Codification No. 718, companies are required to measure the compensation costs of share-based compensation arrangements based on the grant-date fair value and recognize the costs in the financial statements over the period during which employees are required to provide services. Share-based compensation arrangements include stock options, restricted share plans, performance-based awards, share appreciation rights and employee share purchase plans. As such, compensation cost is measured on the date of grant at their fair value. Such compensation amounts, if any, are amortized over the respective vesting periods of the option grant. The Company applies this statement prospectively.\nEquity instruments (“instruments”) issued to other than employees are recorded on the basis of the fair value of the instruments, as required by FASB Accounting Standards Codification No. 718. FASB Accounting Standards Codification No. 505, Equity Based Payments to Non-Employeesdefines the measurement date and recognition period for such instruments. In general, the measurement date is when either a (a) performance commitment, as defined, is reached or (b) the earlier of (i) the non-employee performance is complete or (ii) the instruments are vested. The measured value related to the instruments is recognized over a period based on the facts and circumstances of each particular grant as defined in the FASB Accounting Standards Codification.\nDerivative Financial Instruments\nFair value accounting requires bifurcation of embedded derivative instruments such as conversion features in convertible debt or equity instruments, and measurement of their fair value for accounting purposes. In determining the appropriate fair value, the Company uses the Black-Scholes option-pricing model. In assessing the convertible debt instruments, management determines if the convertible debt host instrument is conventional convertible debt and further if there is a beneficial conversion feature requiring measurement. If the instrument is not considered conventional convertible debt, the Company will continue its evaluation process of these instruments as derivative financial instruments.\nOnce determined, derivative liabilities are adjusted to reflect fair value at each reporting period end, with any increase or decrease in the fair value being recorded in results of operations as an adjustment to fair value of derivatives. In addition, the fair value of freestanding derivative instruments such as warrants, are also valued using the Black-Scholes option-pricing model.\nImpairment of Long-Lived Assets\nThe Company accounts for its long-lived assets in accordance with ASC Topic 360-10-05, Accounting for the Impairment or Disposal of Long-Lived Assets.\" ASC Topic 360-10-05 requires that long-lived assets, such as technology rights, be reviewed for impairment annually, or whenever events or changes in circumstances indicate that the historical cost carrying value of an asset may no longer be appropriate. The Company assesses recoverability of the carrying value of an asset by estimating the future net cash flows expected to result from the asset, including the eventual disposition. If the future net cash flows are less than the carrying value of an\nasset, an impairment loss is recorded equal to the difference between the asset's carrying value and fair value or disposable value.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements, financings, or other relationships with unconsolidated entities or other persons, also known as “special purpose entities”.",
    "item_7A": "ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nWe are subject to certain market risks, including changes in interest rates and currency exchange rates. We have not undertaken any specific actions to limit those exposures.",
    "item_8": "ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nMAX SOUND CORPORATION\nPAGE F - 2 REPORT OF INDEPENDENT REGISTERED ACCOUNTING FIRM\nPAGE F - 3 BALANCE SHEETS AS OF DECEMBER 31, 2020 and 2019.\nPAGE F - 4 STATEMENTS OF OPERATIONS FOR THE YEARS ENDED DECEMBER 31, 2020 AND 2019\nPAGE\nF - 5\nSTATEMENT OF CHANGES IN STOCKHOLDERS’ DEFICIT FOR THE YEARS ENDED DECEMBER 31, 2020 AND 2019.\nPAGE F - 6 STATEMENTS OF CASH FLOWS FOR THE YEARS ENDED DECEMBER 31, 2020 AND 2019.\nPAGES F - 7 NOTES TO FINANCIAL STATEMENTS.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and\nStockholders of Max Sound Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Max Sound Corporation (the “Company”) as of December 31, 2020 and 2019, and the related statements of operations, changes in stockholders’ equity (deficit), and cash flows for each of the years in the two year period then ended and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of Max Sound Corporation as of December 31, 2020 and 2019, and the results of its operations and its cash flows for each of the years in the two year period then ended in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United Sates) (“PCAOB”) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we were required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. According we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluation of the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nGoing Concern Uncertainty\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As described in Note 2 to the financial statements, the Company has accumulated losses and a working capital deficit of $12,652,995 as of December 31, 2020. These factors, among others, raise substantial doubt about the Company’s ability to continue as a going concern. Management’s plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty. Our opinion is not modified with respect to this matter.\nEmphasis of a Matter-Risks and Uncertainties\nAs describe in Note 1, the COVID-19 virus could ultimately have a significant negative impact on the Company and the Company cannot at this time estimate the long-term effect of this unprecedented situation.\nWe have served as the Company’s auditor since\nDenver, Colorado\nMarch 8, 2021\nMax Sound Corporation\nBalance Sheets\nDecember 31, 2020 December 31, 2019\nASSETS\nCurrent Assets\nCash $ - $ 34\nTotal Assets $ - $ 34\nLIABILITIES AND STOCKHOLDERS' DEFICIT\nCurrent Liabilities\nAccounts payable $ 814,239 $ 735,845\nAccrued expenses 2,307,806 1,725,327\nAccrued expenses - related party 2,148,692 1,329,984\nJudgement payable 819,626 819,626\nLine of credit - related party 402,203 384,000\nConvertible note payable 6,160,429 6,160,429\nTotal Current Liabilities 12,652,995 11,155,211\nCommitments and Contingencies - -\nStockholders' Deficit\nPreferred stock, $0.0001 par value; 10,000,000 shares authorized,\nNo shares issued and outstanding - -\nSeries, A Convertible Preferred stock, $0.00001 par value; 10,000,000 shares authorized,\n10,000, 000 and 10,000,000 shares issued and outstanding, respectively\nCommon stock, $0.00001 par value; 10,000,000,000 shares authorized,\n6,583,852,824 and 6,583,852,824 shares issued and outstanding, respectively 65,967 65,967\nAdditional paid-in capital 70,787,984 70,787,984\nTreasury stock (534,575 ) (534,575 )\nAccumulated deficit (82,972,471 ) (81,474,653 )\nTotal Stockholders' Deficit (12,652,995 ) (11,155,177 )\nTotal Liabilities and Stockholders' Deficit $ 0 $ 34\nMax Sound Corporation\nStatements of Operations\nFor the Years Ended,\nDecember 31, 2020 December 31, 2019\nRevenue $ - $ -\nOperating Expenses\nGeneral and administrative 89,929 110,547\nConsulting - 20,800\nProfessional fees 59,200 32,754\nWebsite development - 8,250\nCompensation 342,000 450,000\nTotal Operating Expenses 491,129 622,351\nLoss from Operations (491,129 ) (622,351 )\nOther Income / (Expense)\nInterest expense (535,701 ) (457,763 )\nInterest expense - related party (497,321 ) (475,555 )\nAmortization of debt offering costs - (3,525 )\nOther income 26,333 -\nAmortization of debt discount - (169,379 )\nChange in fair value of embedded derivative liability - 13,849,590\nTotal Other Income / (Expense) (1,006,689 ) 12,743,368\nProvision for Income Taxes - -\nNet Loss $ (1,497,818 ) $ 12,121,017\nNet Loss Per Share - Basic and Diluted $ (0.00 ) $ 0.00\nWeighted average number of shares outstanding\nduring the year Basic and Diluted 6,583,852,824 6,577,551,453\nMax Sound Corporation\nStatement of Changes in Stockholders' Deficit\nFor the years ended December 31, 2020 and 2019\nSeries A\nPreferred Stock Preferred stock Common stock Additional\nTotal\npaid-in Accumulated Treasury Stockholder's\nShares Amount Shares Amount Shares Amount capital Deficit Stock Deficit\nBalance, December 31, 2018 10,000,000 - - 6,573,852,824 65,867 70,776,084 (93,595,670 ) (534,575 ) (23,288,194 )\nCommon stock issued for services ($0.0002/sh) - - - - 10,000,000 11,900 - - 12,000\nNet Income (Loss) - - - - - - - 12,121,017 - 12,121,017\nBalance, December 31, 2019 10,000,000 $ 100 - $ - 6,583,852,824 $ 65,967 $ 70,787,984 $ (81,474,653 ) $ (534,575 ) $ (11,155,177 )\nNet Income (Loss) - - - - - - - (1,497,818 ) - (1,497,818 )\nBalance, December 31, 2020 10,000,000 $ 100 - $ - 6,583,852,824 $ 65,967 $ 70,787,984 $ (82,972,471 ) $ (534,575 ) $ (12,652,995 )\nMax Sound Corporation\nStatements of Cash Flows\nFor the Years Ended,\nDecember 31, 2020 December 31, 2019\nCash Flows From Operating Activities:\nNet Loss $ (1,497,818 ) $ 12,121,017\nAdjustments to reconcile net loss to net cash used in operations\nStock and stock options issued for services - 12,000\nAmortization of debt offering costs - 3,525\nAmortization of debt discount - 169,379\nChange in fair value of derivative liability - (13,849,590 )\nChanges in operating assets and liabilities:\nIncrease in accounts payable 78,400 60,546\nIncrease in accrued expenses 582,474 479,727\nIncrease in accrued expenses - related party 818,708 925,555\nNet Cash Used In Operating Activities (18,236 ) (77,841 )\nNet Cash Used In Investing Activities - -\nCash Flows From Financing Activities:\nProceeds from stockholder loans / lines of credit 89,655 80,646\nRepayment from stockholder loans / lines of credit (71,453 ) (3,220 )\nNet Cash Provided by Financing Activities 18,202 77,426\nNet Decrease in Cash (34 ) (415 )\nCash at Beginning of Year\nCash at End of Year $ - $ 34\nSupplemental disclosure of cash flow information:\nCash paid for interest $ - $ -\nCash paid for taxes $ 650 $ -\nNOTE 1 SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES AND ORGANIZATION\n(A) Organization and Basis of Presentation\nMax Sound Corporation (the \"Company\") was incorporated in Delaware on December 9, 2005, under the name 43010, Inc. The Company’s business operations are focused primarily on developing and launching audio technology software.\nEffective March 1, 2011, the Company filed with the State of Delaware a Certificate of Amendment of Certificate of Incorporation changing our name from So Act Network, Inc. to Max Sound Corporation.\nOn August 9, 2016, the Company moved a level down from OTCQB to OTC Pink Current Information where it is within the continued standards and pricing requirements as found in Section 2 of the OTCQB Eligibility Standards. The Company’s services may re-apply at any time after a price increase to meet all the OTCQB Eligibility Standards to be moved back to the higher OTCQB marketplace.\nIt is management's opinion, however, that all material adjustments (consisting of normal and recurring adjustments) have been made which are necessary for a fair financial statement presentation. The results for the interim period are not necessarily indicative of the results to be expected for the year.\n(B) Risks and Uncertainties\nIn December 2019, a novel strain of coronavirus (COVID-19) emerged in Wuhan, Hubei Province, China. While initially the outbreak was largely concentrated in China and caused significant disruptions to its economy, it has now spread to several other countries and infections have been reported globally.\nBecause COVID-19 infections have been reported throughout the United States, certain federal, state and local governmental authorities have issued stay-at-home orders, proclamations and/or directives aimed at minimizing the spread of COVID-19. Additional, more restrictive proclamations and/or directives may be issued in the future. As a result, all of our office locations have been closed effective April 1, 2020.\nThe ultimate impact of the COVID-19 pandemic on the Company’s operations is unknown and will depend on future developments, which are highly uncertain and cannot be predicted with confidence, including the duration of the COVID-19 outbreak, new information which may emerge concerning the severity of the COVID-19 pandemic, and any additional preventative and protective actions that governments, or the Company, may direct, which may result in an extended period of continued business disruption, reduced customer traffic and reduced operations.\n(C) Use of Estimates\nIn preparing financial statements in conformity with generally accepted accounting principles, management is required to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the financial statements and revenues and expenses during the reported period. Actual results could differ from those estimates.\n(D) Cash and Cash Equivalents\nFor purposes of the cash flow statements, the Company considers all highly liquid investments with original maturities of three months or less at the time of purchase to be cash equivalents. As of December 31, 2020 and December 31, 2019, the Company had no cash equivalents.\n(E) Property and Equipment\nProperty and equipment are stated at cost, less accumulated depreciation. Expenditures for maintenance and repairs are charged to expense as incurred.\nDepreciation is provided using the straight-line method over the estimated useful life of three to five years.\n(F) Research and Development\nThe Company has adopted the provisions of FASB Accounting Standards Codification No. 350, Intangibles - Goodwill & Other (“ASC Topic 350”). Costs incurred in the planning stage of a website are expensed as research and development while costs incurred in the development stage are capitalized and amortized over the life of the asset, estimated to be three years. Expenses subsequent to the launch have been expensed as website development expenses.\n(G) Concentration of Credit Risk\nThe Company at times has had cash in banks in excess of FDIC insurance limits. The Company had $0 in excess of FDIC insurance limits as of December 31, 2020 and December 31, 2019.\n(H) Revenue Recognition\nEffective January 1, 2018, the Company adopted ASC 606 - Revenue from Contracts with Customers. Under ASC 606, the Company recognizes revenue from the commercial sales of products, licensing agreements and contracts by applying the following steps: (1) identify the contract with a customer; (2) identify the performance obligations in the contract; (3) determine the transaction price; (4) allocate the transaction price to each performance obligation in the contract; and (5) recognize revenue when each performance obligation is satisfied. For the comparative periods, revenue has not been adjusted and continues to be reported under ASC 605 - Revenue Recognition. Under ASC 605, revenue is recognized when the following criteria are met: (1) persuasive evidence of an arrangement exists; (2) the performance of service has been rendered to a customer or delivery has occurred; (3) the amount of fee to be paid by a customer is fixed and determinable; and (4) the collectability of the fee is reasonably assured.\n(I) Loss Per Share\nIn accordance with accounting guidance now codified as FASB ASC Topic 260, “Earnings per Share,” Basic earnings (loss) per share (“EPS”) is computed by dividing net loss available to common stockholders by the weighted average number of common shares outstanding during the period, excluding the effects of any potentially dilutive securities. Diluted EPS gives effect to all dilutive potential of shares of common stock outstanding during the period including stock options or warrants, using the treasury stock method (by using the average stock price for the period to determine the number of shares assumed to be purchased from the exercise of stock options or warrants), and convertible debt or convertible preferred stock, using the if-converted method. Diluted EPS excludes all dilutive potential of shares of common stock if their effect is anti-dilutive. Because of the Company’s net losses, the effects of stock warrants and stock options would be anti-dilutive and, accordingly, is excluded from the computation of earnings per share.\nThe computation of basic and diluted loss per share for the years ended December 31, 2020 and 2019, excludes the common stock equivalents of the following potentially dilutive securities because their inclusion would be anti-dilutive:\nDecember 31, 2020 December 31, 2019\nStock Options (Exercise price - $0.00250/share) - 95,332,500\nConvertible Debt (Exercise price - $0.0001 - $.000061/share) 117,980,324,264 117,980,324,264\nSeries A Convertible Preferred Shares ($0.01/share) 250,000,000 250,000,000\nTotal 118,230,324,264 118,325,656,764\nThe Company’s obligations to issue shares upon conversion of its outstanding convertible notes, the exercise of stock options and warrants and conversion of its preferred stock (the “Convertible Instruments”) at current market prices for its common stock exceeds by the 114,814,177,087 authorized but unissued shares of Common Stock as of the date of this report (the “Potentially Issuable Shares”). While it is uncertain whether the Company would receive requests to issue all of the Potentially Issuable Shares and the number of such shares fluctuates based on the market price of the Company’s common stock, the Company may increase the number of its authorized shares of common stock or effectuate a recapitalization, or a combination of both, in order to make available additional shares of its Common Stock for the Potentially Issuable Shares. Such action would require shareholder approval. Until such time as the Company has a sufficient number of shares of its Common Stock for issuance to cover the Potentially Issuable Shares, the Company could be subject to penalties and damages to the holders of the Convertible Instruments in the event it does not deliver the Potentially Issuable Shares upon request by a holder of the Convertible Instruments. Furthermore, the lack of available shares of common stock may be deemed a default under one or more of the Convertible Instruments.\n(J) Income Taxes\nThe Company accounts for income taxes under FASB Codification Topic 740-10-25 (“ASC 740-10-25”) Income Taxes. Under ASC 740-10-25, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. Under ASC 740-10-25, the effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date.\nDeferred tax liability: $ - $ -\nDeferred tax asset\nTemporary differences\nNet operating loss carryforward 11,899,124 10,401,306\nValuation allowance (11,899,124 ) (10,401,306 )\nNet deferred tax asset - -\nNet deferred tax liability $ - $ -\nThe provision for income taxes has been computed as follows:\nExpected income tax recovery (expense) at the statuary rate of 27.64%\n$ (413,938 ) $ 3,349,764\nTax effect of expenses that are not deductible for income tax purposes (net of other\namounts deductible for tax purposes)\nTax effect of differences in the timing of deductibility of items for income tax\npurposes: - (3,777,347 )\nUtilization of non-capital tax losses to offset current taxable income - -\nChange in valuation allowance 413,533 427,561\nProvision for income taxes $ - $ -\nThe valuation allowance was established to reduce the deferred tax asset to the amount that will more likely than not be realized. This is necessary due to the Company’s continued operating losses and the uncertainty of the Company’s ability to offset future taxable income through 2038.\nThe net change in the valuation allowance for the year ended December 31, 2020 and 2019 was an increase of $413,533 and $427,561, respectively.\nThe components of income tax expense related to continuing operations are as follows:\nFederal\nCurrent $ - $ -\nDeferred - -\n$ - $ -\nState and Local\nCurrent $ - $ -\nDeferred - -\n$ - $ -\nThe company’s federal income tax returns for the years 2017-2017 remain subject to examination by the Internal Revenue Service through 2024.\n(K) Business Segments\nThe Company operates in one segment and therefore no segment information is not presented.\n(L) Recent Accounting Pronouncements\nAll other newly issued accounting pronouncements but not yet effective have been deemed either immaterial or not applicable.\n(M) Fair Value of Financial Instruments\nThe carrying amounts on the Company’s financial instruments including accounts payable, derivative liability, convertible note payable, and note payable, approximate fair value due to the relatively short period to maturity for these instruments.\nWe adopted accounting guidance for financial and non-financial assets and liabilities (ASC 820). The adoption did not have a material impact on our results of operations, financial position or liquidity. This standard defines fair value, provides guidance for measuring fair value and requires certain disclosures.\nThis standard does not require any new fair value measurements, but rather applies to all other accounting pronouncements that require or permit fair value measurements. This guidance does not apply to measurements related to share-based payments. This guidance discusses valuation techniques, such as the\nmarket approach (comparable market prices), the income approach (present value of future income or cash flow), and the cost approach (cost to replace the service capacity of an asset or replacement cost). The guidance utilizes a fair value hierarchy that prioritizes the inputs to valuation techniques used to measure fair value into three broad levels. The following is a brief description of those three levels:\nLevel 1: Observable inputs such as quoted prices (unadjusted) in active markets for identical assets or liabilities.\nLevel 2: Inputs other than quoted prices that are observable, either directly or indirectly. These include quoted prices for similar assets or liabilities in active markets and quoted prices for identical or similar assets or liabilities in markets that are not active.\nLevel 3: Unobservable inputs in which little or no market data exists, therefore developed using estimates and assumptions developed by us, which reflect those that a market participant would use.\nThe following are the major categories of liabilities measured at fair value on a recurring basis: as of December 31, 2020 and December 31, 2019, using quoted prices in active markets for identical liabilities (Level 1); significant other observable inputs (Level 2); and significant unobservable inputs (Level 3):\nDecember 31, 2020 December 31, 2019\nFair Value Measurement Using Fair Value Measurement Using\nLevel 1 Level 2 Level 3 Total Level 1 Level 2 Level 3 Total\nDerivative Liabilities - - - - - - - -\nOn December 20, 2019, the Company removed the variable component and penalties related to its convertible debt and made it a fixed price. Therefore, as of December 31, 2019 there is no longer an existing derivative liability.\n(N) Stock-Based Compensation\nIn December 2004, the FASB issued FASB Accounting Standards Codification No. 718, Compensation - Stock Compensation. Under FASB Accounting Standards Codification No. 718, companies are required to measure the compensation costs of share-based compensation arrangements based on the grant-date fair value and recognize the costs in the financial statements over the period during which employees are required to provide services. Share-based compensation arrangements include stock options, restricted share plans, performance-based awards, share appreciation rights and employee share purchase plans. As such, compensation cost is measured on the date of grant at their fair value. Such compensation amounts, if any, are amortized over the respective vesting periods of the option grant. The Company applies this statement prospectively.\nEquity instruments (“instruments”) issued to other than employees are recorded based on the fair value of the instruments, as required by FASB Accounting Standards Codification No. 718. FASB Accounting Standards Codification No. 505, Equity Based Payments to Non-Employees defines the measurement date and recognition period for such instruments. In general, the measurement date is when either a (a) performance commitment, as defined, is reached or (b) the earlier of (i) the non-employee performance is complete or (ii) the instruments are vested. The measured value related to the instruments is recognized over a period based on the facts and circumstances of each grant as defined in the FASB Accounting Standards Codification.\n(O) Reclassification\nCertain amounts from prior periods have been reclassified to conform to the current period presentation. These reclassifications had no impact on the Company's net loss or cash flows.\n(P) Derivative Financial Instruments\nFair value accounting requires bifurcation of embedded derivative instruments such as conversion features in convertible debt or equity instruments, and measurement of their fair value for accounting purposes. In determining the appropriate fair value, the Company uses the Black-Scholes option-pricing model. In assessing the convertible debt instruments, management determines if the convertible debt host instrument is conventional convertible debt and further if there is a beneficial conversion feature requiring measurement. If the instrument is not considered conventional convertible debt, the Company will continue its evaluation process of these instruments as derivative financial instruments.\nOnce determined, derivative liabilities are adjusted to reflect fair value at each reporting period end, with any increase or decrease in the fair value being recorded in results of operations as an adjustment to fair value of derivatives. In addition, the fair value of freestanding derivative instruments such as warrants, are also valued using the Black-Scholes option-pricing model.\n(Q) Original Issue Discount\nFor certain convertible debt issued, the Company provides the debt holder with an original issue discount. The original issue discount is recorded to debt discount, reducing the face amount of the note and is amortized to interest expense over the life of the debt.\n(R) Debt Issue Costs and Debt Discount\nThe Company may pay debt issue costs, and record debt discounts in connection with raising funds through the issuance of convertible debt. These costs are amortized to interest expense over the life of the debt. If a conversion of the underlying debt occurs, a proportionate share of the unamortized amounts is immediately expensed.\nNOTE 2 GOING CONCERN\nAs reflected in the accompanying financial statements, the Company has an accumulated deficit of $82,972,471, stockholders’ deficit of $12,652,995 and working capital deficit of $12,652,995. These matters raise substantial doubt about the Company’s ability to continue as a going concern. The ability of the Company to continue as a going concern is dependent on the Company’s ability to raise additional capital and implement its business plan.\nAs the Company continues to incur losses, transition to profitability is dependent upon the successful commercialization of its products and achieving a level of revenues adequate to support the Company’s cost structure.\nThe Company may never achieve profitability, and unless and until it does, the Company will continue to need to raise additional cash. Management intends to fund future operations through additional private or public debt or equity offerings. Based on the Company’s operating plan, existing working capital at December 31, 2020 was not sufficient to meet the cash requirements to fund planned operations through December 31, 2021 without additional sources of cash. The Company continues to explore various financing alternatives, including debt and equity financings and strategic partnerships, as well as trying to generate revenue. However, at this time, the Company has no commitments to obtain any additional funds, and there can be no assurance such funds will be available on acceptable terms or at all. If the Company is unable to obtain additional funding and improve its operations, the Company’s financial condition and results of operations may be materially adversely affected, and the Company may not be able to continue operations. This raises substantial doubt about the Company’s ability to continue as a going concern. The accompanying financial statements have been prepared assuming that the Company will continue as a going concern and do not include adjustments that might result from the outcome of this uncertainty.\nNOTE 3 DEBT AND ACCOUNTS PAYABLE\nDebt consists of the following:\nAs of December 31, 2020 As of December 31, 2019\nLine of credit- related party $ 402,203 $ 384,000\nAccrued interest - related party 1,185,747 709,039\nAccrued expenses - related party 962,945 620,945\nConvertible debt $ 6,160,429 $ 6,160,429\nLess: debt discount - -\nLess: debt issue costs - -\nConvertible debt - net 6,160,429 6,160,429\nTotal current debt $ 8,711,324 $ 7,874,413\nLine of credit - related party\nLine of credit with the principal stockholder consisted of the following activity and terms:\nPrincipal Interest Rate\nBalance - December 31, 2019 $ 402,472 -\nBorrowings during the year ended December 31, 2020 89,655 -\nInterest accrual 15,699 -\nRepayments (71,453 ) -\nBalance - December 31, 2020 $ 436,373\nAccounts payable consists of the following:\nAs of December 31, 2020 As of December 31, 2019\nAccounts Payable $814,239 $735,845\nTotal accounts payable $814,239 $735,845\n(A) Convertible Debt\nThe convertible notes issued for year ended December 31, 2020 and year ended December 31, 2019, consist of the following terms:\nYear ended Year ended\nDecember 31, December 31,\n2020 Amount of 2019 Amount of\nPrincipal Raised Principal Raised\nInterest Rate\n0% - 12% 0% - 12%\nDefault interest rate\n14% - 22% 14% - 22%\nMaturity\nNovember 4, 2015 -May 22, 2019 November 4, 2015- December 7, 2018\nConversion terms 1 65% of the “Market Price”, which is the average of the lowest three (3) trading prices for the common stock during the ten (10) trading day period prior to the conversion. 3,691,578 3,691,578\nConversion terms 2 65% of the “Market Price”, which is the one lowest trading prices for the common stock during the ten (10) trading day period prior to the conversion. 1,131,560 1,131,560\nConversion terms 3 70% of the “Market Price”, which is the average of the lowest three (3) trading prices for the common stock during the fifteen (15) trading day period prior to the conversion. paid on conversion paid on conversion\nConversion terms 4 75% of the “Market Price”, which is the average of the lowest three (3) trading prices for the common stock during the ten (10) trading day period prior to the conversion. 765,000 765,000\nConversion terms 5 60% of the “Market Price”, which is the lowest trading prices for the common stock during the fifteen (15) trading day period prior to the conversion. paid on conversion paid on conversion\nConversion terms 6 Conversion at $0.10 per share Paid on conversion Paid on conversion\nConversion terms 7 60% of the “Market Price”, which is the lowest trading prices for the common stock during the ten (10) trading day period prior to the conversion. 50,000 50,000\nConversion terms 8 65% of the “Market Price”, which is the two lowest trading prices for the common stock during the ten (10) trading day period prior to the conversion. 265,050 265,050\nConversion terms 9 65% of the “Market Price”, which is the two lowest trading prices for the common stock during the fifteen (15) trading day period prior to the conversion. 204,579 204,579\nConversion terms 10 65% of the “Market Price”, which is the one lowest trading prices for the common stock during the fifteen (15) trading day period prior to the conversion. paid on conversion paid on conversion\nConversion terms 11 60% of the “Market Price”, which is the two lowest trading prices for the common stock during the twelve (12) trading day period prior to the conversion.paid on conversion paid on conversion\nConversion terms 12 61% of the “Market Price”, which is the average of the three lowest trading prices for the common stock during the ten (10) trading day period prior to the conversion. 52,662 52,662\nConvertible Debt Less: Debt\n6,160,429 6,160,429\nDiscount Less: Debt\n- -\nIssue Costs\n- -\nConvertible Debt - net\n6,160,429 6,160,429\nThe debt holders are entitled, at their option, to convert all or part of the principal and accrued interest into shares of the Company’s common stock at conversion prices and terms discussed above. On December 20, 2019, the Company removed the variable component and penalties related to its convertible debt and made it a fixed price. Therefore, as of December 31, 2019 there is no longer an existing derivative liability.\nConvertible debt consisted of the following activity and terms:\nConvertible Debt Balance as of December 31, 2019 Borrowings 6,160,429 4% - 12%\nConversions -\nConvertible Debt Balance as of December 31, 2020 -\n6,160,429\n(B) Debt Issue Costs\nThe following is a summary of the Company’s debt issue costs:\nYear ended Year Ended\nDecember 31, 2020 December 31, 2019\nDebt issue costs $ 362,423 362,423\nAccumulated amortization of debt issue costs (362,423 ) (362,423 )\nDebt issue costs - net $ - -\nDuring the year ended December 31, 2020 and 2019 the Company amortized $0 and $3,525 of debt issue costs, respectively.\n(C) Debt Discount & Original Issue Discount\nThe debt discount and the original issue discount recorded in 2020 and 2019 pertains to convertible debt that contains embedded conversion options that are required to be bifurcated and reported at fair value and original issue discounts.\nThe Company amortized $0 and $169,379 during the years ended December 31, 2020 and 2019, respectively, to amortization of debt discount expense.\nYear ended Year Ended\nDecember 31, 2020 December 31, 2019\nDebt discount $ 13,221,839 13,221,839\nAccumulated amortization of debt discount (13,221,839 ) (13,221,839 )\nDebt discount - Net $ - -\n(D) Line of Credit - Related Party\nDuring the year ended December 31, 2020, the principal stockholder has advanced $89,655 and accrued $15,698 in interest and was repaid $71,453. During the year ended December 31, 2019, the principal stockholder has advanced $80,647 accrued $14,755 in interest and was repaid $3,220 under the terms of the line of credit. The line of credit balance and accrued interest as of December 31, 2020 is $436,373.\nNOTE 4 STOCKHOLDERS’ DEFICIT\n1. Common Stock\nDuring the year ended December 31, 2019, the Company issued the following common stock:\nTransaction Type Quantity Valuation Range of Value per share\nServices - rendered 10,000,000 $ 12,000 $ 0.0002\nTotal shares issued 10,000,000 $ 12,000\nThe Company maintains on its books and within the above financials, debt to Venture Champion Asia Limited and ICG USA LLC or its designee(s) which is currently in default and has not been converted due to ICG’s settled administrative proceeding with the SEC, where the Company awaits any rightful exemption or regulatory no-action that would render any forward moving action compliant by all the parties.\nThe Company announced that it entered into an Agreement with Vedanti Systems Limited and Vedanti Licensing Limited (VLL) that resolves their dispute over the international Optimized Data Transmission (ODT) patent portfolio previously owned by Vedanti. The Agreement further provides that VLL and the Company will become co-owners of the pioneering portfolio. In consideration of the patent portfolio purchase, the Company issued 80,000,000 shares of its common stock to VLL. This patent portfolio consists of patents in the following countries: The United States, Australia, Austria, Cyprus, Denmark, Spain, Finland, France, Ireland, Italy, Luxembourg, Monaco, Portugal, Sweden, Turkey, Belgium, Switzerland/ Liechtenstein, United Kingdom, Greece, Netherlands and Germany. The Company continues to pursue its litigations against Google.\n(B) Stock Warrants\nThe Company had no outstanding and exercisable warrants as of December 31, 2020 and 2019.\n(C) Stock Options\nThe Company had no outstanding and exercisable stock options as of December 31, 2020.\nThe following tables summarize all option grants as of December 31, 2020, and the related changes during these periods are presented below:\nNumber of Options\nWeighted\nAverage Exercise Price\nWeighted Average Remaining Contractual Life (In Years)\nOutstanding - December 31, 2019 95,332,500 -\nExercised - - -\nForfeited (95,332,500 ) -\nOutstanding - December 31, 2020 - - -\nExercisable - December 31, 2020 -\nNOTE 5 LITIGATION\nOn June 1, 2016, the Company was named as a defendant in an action filed in the Superior Court of the State of California, County of Los Angeles - Central District, captioned Adli Law Group, PC v. Max Sound Corporation (Case No. BC621886). Plaintiff alleges two causes of action for Breach of Contract and a cause of action for Common Counts, all arising out of the Company’s alleged failure to pay for Plaintiff’s legal services. Even though the Company was never served with the Complaint, default was entered against the Company. The Default has been set aside and the Company has responded to the Complaint with an Answer and Cross-Complaint for Breach of Contract, Professional Negligence, Breach of Fiduciary Duty, Conversion, and Fraud, due to the fact, that among other things, Adli Law reassigned the Company's primary patent to itself. The parties had begun the discovery phase of the litigation and the Judge had set a status hearing for January 19, 2018. On June 1, 2018, Adli filed a motion for summary judgment on numerous issues.\nOne issue raised by Adli (at the very end of their motion and in only a single paragraph) was that Max Sound was a forfeited corporation and thus, “is foreclosed from prosecuting any action in California courts.” Adli did not raise this issue before filing its papers. Max Sound’s counsel, SML Avvocati, P.C. had since learned that the California Franchise Tax Board contended that Max Sound owed back taxes, hence the forfeiture. Max Sound hired a CPA tax specialist to assist with paying its outstanding taxes which the state finally agreed were approximately $8,000 instead of the $340,000 the state had arbitrarily wrongly calculated and the Company sought to obtain a revivor to cure its forfeited status and thus be able to regain its ability to both defend itself in this action and prosecute its counterclaims.\nHowever, despite working diligently with the hope of resolving this issue before the summary judgment motion hearing set for September 6, 2018, Max Sound had not resolved its issues with the state of California and had not yet obtained a revivor. As a result of this issue and glaring mistakes by the Company’s Counsel SML Avvocati, Max Sound had to respectfully request that the court grant a stay in the proceedings until Max Sound was able to obtain a revivor or, in the alternative, a continuance of all proceedings. A stay or continuance was necessary because Max Sound’s counsel would not be able to respond to the pending summary judgment motion (or any other substantive proceeding), and Max Sound would be unable to defend itself against this action or prosecute its cross-complaint until Max Sound’s forfeited status was cured. The court provided a summary default judgment in favor of Adli one day before Max Sound obtained a revivor.\nIn response, the Company hired Klapach & Klapach, P.C. who filed an application for an extension to file an opening brief. The extension was granted, and the opening brief was filed April 26, 2019. Adli responded with a Respondent Brief, Appendix and Motion to Augment. Max Sound’s counsel filed a reply brief.\nIn the conclusion of the brief, Max Sound’s counsel Mr. Klapach stated:\n“The trial court committed error in granting summary judgment in the Adli Firm’s favor. Based on the Adli Firm’s own evidence, there were triable issues of fact regarding the Adli Firm’s claims for unpaid fees. With respect to the Steele Litigation, nearly all of the unpaid invoices that the Adli Firm sought to recover were for legal services that were separately billed to Mr. Trammell for Mr. Trammell, Mr. Wolff, and Audio Genesis’s defense. The record also reflects that Dr. Adli orally agreed to look solely to Mr. Trammell and Mr. Wolff for payment of the Adli Firm’s fees. With respect to the patent prosecution representation, triable issues of fact existed as to whether the Adli Firm’s admitted error in identifying itself - instead of Max Sound - as the assignee of the MAXD patent was a material breach that excused Max Sound’s performance and/or entitled Max Sound to set off. With respect to the Cross-Complaint, the trial court erred in concluding that Max Sound lacked the capacity to sue when Max Sound had presented the court with a Certificate of Revivor prior to the summary judgment hearing. The trial court also erred in refusing to grant Max Sound a short continuance so that it could pay its outstanding taxes and obtain a Certificate of Revivor.”\nNo assurance can be given as to the ultimate outcome of these actions or their effect on the Company however the Company is confident it will receive a reversal in of the Summary Judgment and ultimately succeed in its cross complaint against the Adli Firm.\nNOTE 6 SUBSEQUENT EVENT\nOn March 2, 2021, the officer advanced $1,025 under the terms of the line of credit.\nOn March 4, 2021, the Company signed a 10-year exclusive licensing agreement with TIP Solutions (Licensee) to implement the MAXD HD Audio Source Code into their mobile phone app and platforms. The Licensee was granted an exclusive license of MAX-D HD audio technology for an annual payment of $100,000 or $25,000 paid quarterly for up to 10 years.\nThe agreement also calls for a license fee split in the event the following occurs:\n• If Licensor is TIP - 20% of total license revenue received by TIP will be paid to Max Sound within 30 days of such receipts.\n• If the Licensor is Max Sound and combined with TIP Solutions Smart Call Assistant, 20% of total license revenue received by Max Sound will be paid to TIP within 30 days.\nOn March 10, 2021, the Company received a $100,000 payment from the Licensee.\nOn March 8, 2021, the Company entered into a conversion agreement executed by a note holder for 275,000,000 shares based on a conversion price of $0.0008 per share.",
    "item_9": "Item 9. Changes in and disagreements with Accounting and Financial Disclosure\nN/A",
    "item_9A": "Item 9A. Controls and Procedures\n(a) Evaluation of Disclosure Controls and Procedures The company’s management has evaluated, with the participation of the Chief Executive Officer and the Chief Financial Officer, the effectiveness of the company’s disclosure controls and procedures (as defined in Rule 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934 (the “Exchange Act”) as of the end of the period covered by this report. Based on this evaluation, management concluded that the company’s disclosure controls and procedures were effective as of December 31, 2020.\n(b) Management’s Report on Internal Control Over Financial Reporting The company’s management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f) and 15d-15(f). The company’s management, including the Chief Executive Officer and the Chief Financial Officer, conducted an evaluation of the effectiveness of the company’s internal control over financial reporting based on the Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on the results of this evaluation, the Company’s management concluded that internal control over financial reporting was effective as of December 31, 2020.\nThe Company is not required to file an ICFR with an independent registered public accounting firm.\n(c) Changes in Internal Control Over Financial Reporting During the quarter ended December 31, 2020 there were no changes in the company’s internal control over financial reporting that have materially affected, or are reasonably likely to materially affect, the company’s internal control over financial reporting.",
    "item_9B": "Item 9B. Other Information\nNone.",
    "item_10": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nOn March 25, 2020, John Blaisure was terminated. Greg Halpern took on the duties of President and Chief Executive Officer.\nOur executive officers and directors and their respective ages are as follows:\nNAME AGE\nPOSITION\nChairman, President, Chief Executive\nGreg Halpern\nOfficer & Chief Financial Officer\nSet forth below is a brief description of the background and business experience of our executive officers and directors for the past five years.\nGreg Halpern, Chairman, CFO & Founder\nGreg Halpern is the founder and visionary of MAX-D. Over the course of his tenure, Mr. Halpern has made loans, lines of credit and done equity conversions with the Company in excess of $2,500,000.\nGreg Halpern is the founder of Max Sound Corporation From 1997 to 2001 Mr. Halpern was the CEO of Circle Group Internet, Inc. (CRGQ: OTCBB).\nFrom 2002 to 2005, Mr. Halpern was the Chief Executive Officer of Circle Group Holdings Inc. (AMEX: CXN, formerly CRGQ.OB) and continued to be the CEO after it changed its name to Z-Trim Holdings Inc. (AMEX: ZTM) from 2006 - 2007. Circle Group was a venture capital firm for emerging technology companies which provided small business infrastructure, funding and intellectual capital to bring timely life-changing technologies to market through all early phases of the commercialization process. Mr. Halpern’s efforts there were focused on acquiring life improving technologies and bringing these products to the marketplace. In 2003, Mr. Halpern and his wife founded an unincorporated non-profit organization “People for Ultimate Kindness Toward All Living Creatures on Earth” whose purpose is and has been to identify problems on earth and those who are working to solve them. The Ultimate Kindness is a non-profit organization independent from the So Act Network. The Ultimate Kindness and the So Act Network share no financial interest or otherwise. In 2007, Mr. Halpern resigned from his position at Z-Trim Holdings and took a one (1) year sabbatical from business touring the Continental United States in his RV with his family. Currently, Mr. Halpern serves as the Chairman, President, Chief Executive Officer and Chief Financial Officer of Max Sound Corporation and devotes approximately 50 hours each week to the management and operations of Max Sound Corporation.\nTerm of Office\nOur directors are appointed for a one-year term to hold office until the next annual general meeting of our shareholders or until removed from office in accordance with our bylaws. Our officers are appointed by our board of directors and hold office until removed by the board.\nCurrent Issues and Future Management Expectations\nNo board audit committee has been formed as of the filing of this Annual Report.\nCompliance With Section 16(A) Of The Exchange Act.\nSection 16(a) of the Exchange Act requires the Company’s officers and directors, and persons who beneficially own more than 10% of a registered class of the Company’s equity securities, to file reports of ownership and changes in ownership with the Securities and Exchange Commission and are required to furnish copies to the Company. To the best of the Company’s knowledge, any reports required to be filed were timely filed in fiscal year ended December 31, 2020.\nCode of Ethics\nThe Company has adopted a Code of Ethics applicable to its Chief Executive Officer and Chief Financial Officer.",
    "item_11": "ITEM 11. EXECUTIVE COMPENSATION\nThe following summary compensation table sets forth all compensation awarded to, earned by, or paid to the named executive officers during the years ended December 31, 2020, and 2019 in all capacities for the\naccounts of our executive, including the Chief Executive Officer (CEO) and Chief Financial Officer (CFO):\nSUMMARY COMPENSATION TABLE\nName and\nStock Option All Other\nPrincipal\nSalary Bonus Awards Awards Compensation Total\nPosition Year ($) ($) ($) ($) ($) ($)\nGreg Halpern,CFO 288,000 0 288,000\n288,000 0 288,000\n288,000 0 288,000\n192,000 0 192,000\nJohn Blaisure, CEO 162,000 0 162,000\n164,000 44,252 208,252\n144,000 0 144,000\nOutstanding Equity Interests\nThe following table sets forth information concerning outstanding stock options for each named executive officer as of December 31, 2020.\nOutstanding Option Awards at Fiscal Year-End\nNone\nThere were no stock options issued or exercised during the fiscal year ended December 31, 2020 by a named executive officer, and no awards were made to a named executive officer in the last completed fiscal year under any long-term incentive plan.\nCompensation of Directors\nDirectors are permitted to receive fixed fees and other compensation for their services as directors. The Board of Directors has the authority to fix the compensation of directors. No amounts have been paid to, or accrued to, directors in such capacity.\nEmployment Agreements\nMr. Greg Halpern, our President and CFO, entered into an employment agreement with us on October 13, 2008. Pursuant to the Employment Agreement, the term of the employment shall be for a period of ten (10) years commencing on October 13, 2008. The term of this employment agreement shall automatically be extended for additional terms of one (1) year each unless either party gives prior written notice of non-renewal to the other party no later than sixty (60) days prior to the expiration of the end of the 10 years. Subject to the terms of the employment agreement, we shall pay Mr. Halpern $18,000 per month as compensation for his services rendered as provided in the employment agreement. In addition to the base salary, Mr. Halpern shall be entitled to a monthly commission equal to 10% of all of our sales. On May 1, 2013, the Company amended its employment agreement with Greg Halpern to increase his salary to $24,000 per month.\nMr. John Blaisure, our CEO, entered into an employment agreement with us on January 17, 2011. Pursuant to the employment agreement, the term of employment shall be for a period of five (5) years commencing on January 7, 2011. Subject to the terms of the employment agreement, we agreed to pay Mr. Blaisure $8,000 per month as compensation for his services rendered as provided in the employment agreement. On August 25, 2012, the agreement was updated to increase the monthly compensation to $12,000 per month beginning September 1, 2012. On May 1, 2013, the Company further amended the agreement to increase Mr. Blaisure’s salary to $18,000 per month. In addition, to the base salary, Mr. Blaisure is entitled to and shall receive a monthly commission equal to 20% of the gross sales of the Company derived from the efforts of Mr. Blaisure after\ndeducting $8,000 from such amount. Further, as of the date of the employment agreement, the Company issued to Mr. Blaisure, 3,000,000 shares of common stock and, within 10 days of the signing of the employment agreement, 12,000,000 options to buy common stock of the Company at $.12 per share for a period not to exceed three years from the date of the employment agreement. On June 14, 2013, such expiration date was extended for two more years. On January 8, 2016, the company renewed Mr. Blaisure’s employment agreement for 5 years additional at the same terms; Mr. Blaisure agreed to forgo his options and the Company granted 12,000,000 rule 144 common shares to John Blaisure.\nOn December 31, 2012, John Blaisure - CEO and Greg Halpern - CFO amended their employment agreements with the Company to eliminate their previous annual bonus entitlements which was previously 10% each of revenues. In exchange for this consideration, the Company agreed that Executive Blaisure will each be decreased as his new bonuses to 6% of net profits, and Executive Halpern will each be decreased as his new bonus to 7% of net profits. Both Executives may elect at their option to receive such bonuses in cash or Rule 144 stock or any combination of both.\nOn March 25, 2020, John Blaisure was terminated\nWe have not had a promoter at any time during our past five fiscal years.",
    "item_12": "ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table provides the names and addresses of each person known to us to own more than 5% of our outstanding shares of common stock as of March 22, 2018 and by the officers and directors, individually and as a group. Except as otherwise indicated, all shares are owned directly.\nOn March 26, 2018, there were 3,715,287,050 issued and outstanding shares of common stock. Unless otherwise noted, each person identified below possesses sole voting and investment power with respect to the shares listed.\nThe information contained in this table is based upon information received from or on behalf of the named individuals or from publicly available information and filings by or on behalf of those persons with the SEC.\nName and Address of Amount and Nature of\nTitle of Class Beneficial Owner(1) Beneficial Owner Percent of Class (2)\nPreferred Stock Greg Halpern 10,000,000 (2) 66.8%\nCommon Stock Greg Halpern 2,510,933 0.07%\nCommon Stock Greg Halpern 40,300,000 (2018 open market buy)\nTotal Shares owned by\nCommon Stock Directors and officers 40,811,893 67.67%\n(1) Unless otherwise indicated, the address for each stockholder listed in the above table is c/o Max Sound Corporation, 3525 Del Mar Heights Road, #802, San Diego, California, 92130.\n(2) Reference Event of Stock conversion from Common to Preferred Shares.",
    "item_13": "ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTION, AND DIRECTOR INDEPENDENCE\nOn October 2, 2017, the Company, in exchange for Greg Halpern's consideration issuing the Company a line of credit of $100,000 on July 6, 2017 and another line of credit of $200,000 on October 2, 2017 .",
    "item_14": "ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nAudit Fees\nFor the Company’s fiscal years ended December 31, 2020 and 2019, we were billed approximately $51,200, and $28,000, respectively, for professional services rendered for the audit and review of our financial statements.\nAudit Related Fees\nThere were no fees for audit related services for the years ended December 31, 2020 and 2019.\nTax Fees\nFor the Company’s fiscal years ended December 31, 2020 and 2019, we were billed approximately $0, and $4,590, for professional services rendered for tax compliance, tax advice, and tax planning.\nAll Other Fees\nThe Company did not incur any other fees related to services rendered by our principal accountant for the years ended December 31, 2020 and 2019.\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized.\nEffective May 6, 2003, the Securities and Exchange Commission adopted rules that require that before our auditor is engaged by us to render any auditing or permitted non-audit related service, the engagement be:\n• approved by our audit committee; or\n• entered into pursuant to pre-approval policies and procedures established by the audit committee, provided the policies and procedures are detailed as to the particular service, the audit committee is informed of each service, and such policies and procedures do not include delegation of the audit committee's responsibilities to management.\nWe do not have an audit committee. Our entire board of directors pre-approves all services provided by our independent auditors.\nThe pre-approval process has just been implemented in response to the new rules. Therefore, our board of directors does not have records of what percentage of the above fees were pre-approved. However, all of the above services and fees were reviewed and approved by the entire board of directors either before or after the respective services were rendered.\nPART IV",
    "item_15": "ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES.\nAll Exhibits in calendar year 2020 associated with all prior Form 10 filings are incorporated herein by reference.\n3. Exhibits\nExhibit Number Description\n31.1 Certification Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1 Certifications Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized.\nDate: March 26,\nMAX SOUND CORPORATION\n(Registrant)\nBy: /s/ Greg Halpern\nGreg Halpern\nChief Executive Officer and Chief Financial Officer\n(Principal Executive Officer)"
}