{
    "cik": "1362190",
    "company": "AUDIOEYE INC",
    "filing_type": "10-K",
    "filing_date": "2021-03-11",
    "period_of_report": "2020-12-31",
    "sic": "7372",
    "state_of_inc": "DE",
    "state_location": "AZ",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1362190/0001104659-21-035092-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1362190/000110465921035092/tm211111d1_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1362190/0001104659-21-035092.txt",
    "filename": "1362190_10K_2020_0001104659-21-035092.htm",
    "item_1": "Item 1. Business\nOverview\nAudioEye is an industry-leading software solution provider delivering website accessibility compliance at all price points to businesses of all sizes. Our solutions advance accessibility with patented technology that reduces barriers, expands access for individuals with disabilities, and enhances the user experience for a broader audience. We believe that, when implemented, our solution offers businesses and organizations the opportunity to reach more customers, improve brand image, build additional brand loyalty, and, most importantly, provide an accessible and usable web experience to the expansive and ever-growing global population of individuals with disabilities.\nAudioEye primarily generates revenue through the sale of subscriptions for our software-as-a-service (“SaaS”) accessibility solutions. Our solutions are backed by AudioEye’s machine-learning/AI-driven technology that finds and fixes common accessibility errors. Our core and supplemental solutions are designed to help websites and applications achieve and sustain substantial conformance with AudioEye’s interpretation of the Web Content Accessibility Guidelines (“WCAG”) which are web accessibility standards published by the Web Accessibility Initiative of the World Wide Web Consortium, the main international standards organization for the internet. Our solutions help mitigate a customer’s risk of costly digital accessibility-related legal action. AudioEye customers may purchase solutions directly through the AudioEye Marketplace, through a platform partner or an agency, such as Duda, that integrates our solutions into their marketplace, through a vertical Content Management System (“CMS”) partner, or through an authorized reseller, or by working directly with the AudioEye sales team. Our offerings serve businesses and organizations of all sizes and at all price points.\nAudioEye stands out among its competitors because it delivers machine-learning/artificial intelligence (“AI”)-driven accessibility without fundamental changes to the website architecture. As another differentiator, we offer transparency. Our offerings provide automated remediations and a transparent compliance score with additional manually driven enhancements. AudioEye pairs its patented technology solutions with certified accessibility experts, which allows our customers to achieve a higher level of compliance than competitors relying solely on automation. Our technology publishes more than one billion remediations daily, and our solution is trusted by some of the largest and most influential companies in the world, including ADP, Tommy Hilfiger, 360 Media, Samsung, Darden, Landry’s and more. Government agencies, from the federal level down to the local level, have also integrated our software in their digital platforms, including the Federal Communications Commission and the Social Security Administration.\nIndustry Background\nIf not coded properly, a website or application may not offer full access to content or functionality for individuals with disabilities and, in particular, for users of assistive technology (“AT”), such as a screen reader. As a result, those sites may exclude potential users and customers. As discussed in more detail below, these sites also may not comply with U.S. and foreign laws requiring accessibility and digital inclusion, such as Title III of the Americans with Disabilities Act, Section 508 of the Rehabilitation Act, and California’s Unruh Civil Rights Act. Website accessibility lawsuits have continued to increase in recent years. By some estimates, more than 3,000 lawsuits were filed in federal and state courts in 2020.\nTraditional solutions addressing web accessibility may be costly and difficult to implement. Historically, the process for achieving compliance has been driven by costly consulting services and has not fully utilized emerging technologies to reduce the compliance cost burden. At the same time, web accessibility efforts have generally focused on a limited number of disability use cases, leaving many users’ accessibility needs for digital inclusion unaddressed. Businesses may have been reluctant to invest further in web accessibility solutions due to a perceived lack of commercial return on the significant investment required to design and implement a thorough and usable compliance solution.\nOther solutions have been developed to help users access websites, but these often require the installation of a plug-in or software on the user’s computer. Similarly, some are tailored to either single or a limited number of use cases and do not encompass a more holistic approach for addressing compliance and accessibility.\nAudioEye Solutions\nAt its core, AudioEye’s provides an always-on testing, remediation, and monitoring solution that continually improves conformance with WCAG. This in turn helps businesses and organizations comply with WCAG standards as well as applicable U.S. and foreign accessibility laws. Our technology is capable of immediately identifying and fixing common accessibility errors and addresses a wide range of disabilities including dyslexia, color blindness, epilepsy and more. AudioEye also offers additional solutions to provide for enhanced compliance and accessibility including periodic manual auditing, manual remediations and legal support services. Our solutions may be purchased through a subscription service on a month-to-month basis or with one or multi-year terms. We also offer PDF remediation services and Native Mobile App audit reports to help our customers with their digital accessibility needs.\nAudioEye Customers\nOur current and potential customer base includes a very broad range of private and public sector customers, including:\n· Small- and medium-sized businesses;\n· Corporate enterprises;\n· Non-profit organizations;\n· Federal government agencies, whose electronic and information technology must be accessible to people with disabilities, including employees and members of the public, pursuant to Section 508 of the Rehabilitation Act of 1973; and\n· Foreign, state and local governments and agencies, which often have laws and regulations that require accessibility for people with disabilities.\nAudioEye Channels / Go-to-market:\nWe go-to-market through two primary channels: Enterprise and Partner and Marketplace.\nEnterprise channel consists of our larger customers and organizations, including those with non-platform custom websites, who generally engage directly with AudioEye sales personnel for custom pricing and solutions. This channel also includes federal, state and local government agencies.\nPartner and Marketplace channel consists of our CMS partners, platform & agency partners, authorized resellers and the Marketplace. This channel serves small and medium sized businesses that are on a partner or reseller’s web-hosting platform or who purchase an AudioEye solution from our Marketplace.\nThe Company had one major customer (including the customer’s affiliates reflecting multiple contracts and a partnership with the Company) which accounted for approximately 16.7% of the Company’s revenue in the year ended December 31, 2020. The Company had one major customer which generated approximately 10% of its revenue in the year ended December 31, 2019.\nOur typical market sectors include, but are not limited to:\n· Finance and banking institutions;\n· Travel and hospitality companies;\n· Public and private transportation companies;\n· Retail and ecommerce companies;\n· Educational institutions (which occasionally enter into settlement agreements with the Department of Education’s Office of Civil Rights regarding accessibility);\n· Food services companies; and\n· SaaS service or solution providers.\nIntellectual Property\nOur intellectual property is primarily comprised of trade secrets, trademarks, issued, published and pending patent applications, copyrights and technological innovation. We have a patent portfolio comprised of seventeen (17) issued patents in the United States. We also have eight (8) pending patent applications and two (2) international patent applications filed via the Patent Cooperation Treaty (“PCT”). The commercial value of these patents is unknown.\nWe plan to continue to invest in research and development and expand our portfolio of proprietary intellectual property.\nCompetition\nMost of our competition falls within the following categories:\n· There are a small number of web accessibility audit and tracking platform providers that purport to analyze websites for accessibility concerns. While these providers may sometimes identify issues for remediation, they typically do not provide remediation technology or the additional solutions that AudioEye offers.\n· Currently, other technology providers attempt to apply compliance remediation strictly through automation technology and accessibility toolbars. We believe their solutions do not compete with the full breadth of solutions offered by AudioEye including the manual auditing and custom remediation services that are essential for achieving a meaningful level of compliance that mitigates compliance lawsuits and provides customers with negotiation leverage when defending against legal complaints.\n· There are a substantial number of consulting service providers offering website and application accessibility. Each generally provides an analysis of the various compliance issues associated with its clients’ websites. They ultimately provide resources and assistance in applying fixes and changes at the source. We believe our offerings are much more cost effective and comprehensive than these providers. We also provide tools that empower an end-to-end fully managed service, as well as resources that empower self-directed developers to fix issues on their own.\nCompetitive Strengths\nOur management believes the following competitive strengths will enable our success in the accessibility marketplace:\n· Unique patented technology. AudioEye builds all its products with the primary goal of enhancing the user experience regardless of the end-user’s individual disability or physical limitation. AudioEye is a marketplace technology leader providing what we believe to be unparalleled web accessibility solutions for our customers through our suite of offerings.\n· Broad price points and offerings. With a free 30-day trial for our base offering, AudioEye allows website owners to test our solution before choosing their preferred option. They range from low-cost offerings, to standard offerings, to our customized, enterprise-wide solutions.\n· Unique combination of advanced technology and expert-driven services. Our management believes that AudioEye addresses the problem of Web Accessibility holistically and provides a combination of leading-edge technology and high-quality specialized services. Our solutions are designed to provide our customers with reliable website accessibility compliance solutions, and to lead to cost-savings and reduced time-to-market for our customers. Our management believes that the AudioEye solution allows our customers to focus not only on achieving compliance, but also to help maintain compliance throughout the life of the subscription.\n· We offer greater transparency in marketing our offerings. We believe there is no fully automated solution on the market that can provide 100% compliance. Our offerings provide automated remediations and a transparent compliance score with additional manually driven enhancements. We think that as the industry develops, opaque products with unsubstantiated claims will ultimately fail.\n· Highly experienced inventors, technologists and product development team. Our team is comprised of experienced software and SaaS developers and technologists.\nLegal and Regulatory Framework\nCourts and the U.S. Department of Justice (“DOJ”) broadly hold that Titles II and III of the Americans with Disabilities Act (“ADA”), together with Sections 504 and 508 of the Rehabilitation Act of 1973, require public and private websites and mobile applications to be accessible to people with disabilities. In particular, Title III of the ADA governs private businesses and prohibits discrimination on the basis of disability in the provision of services, programs, and activities by public accommodations.\nWhile the law governing website and mobile application accessibility is still developing, most courts have held that websites and mobile applications fall within Title III’s scope. Some courts hold that Title III applies to all customer-facing websites and mobile applications, while others apply a “nexus” approach, which requires websites and mobile applications to comply with Title III if the website or mobile application is heavily integrated with a physical location. The U.S. Supreme Court has yet to articulate a unified approach, so some degree of uncertainty remains. Similarly, the DOJ has not promulgated new regulations laying out compliance standards for websites and mobile applications. In the absence of clear guidance, courts generally measure accessibility using the Web Content Accessibility Guidelines (“WCAG”), which are promulgated by the World Wide Web Consortium.\nAlthough the WCAG does not carry force of law, courts may order defendants to comply with the WCAG as a remedy for accessibility violations. Settlements and consent decrees generally require the same. We therefore design our products and services to help customer websites and mobile applications achieve and sustain substantial conformance with our interpretation of the informative guidance supplied through the WCAG, and we continue to improve and update our products and services as new guidance emerges.\nLawsuits alleging website or mobile application accessibility claims typically follow a similar pattern. Both private commercial businesses and governmental agencies are regularly targeted for alleged violations. With an increasing amount of business taking place remotely, ensuring compliance with the relevant accessibility statutes is becoming increasingly important.\nThis growing focus on website and mobile application accessibility is also reflected by other federal and state laws. In 2010, Congress enacted the 21st Century Communications and Video Accessibility Act in an effort to update telecommunications protections for people with disabilities. Furthermore, the Department of Transportation has issued rules interpreting and implementing the Air Carrier Access Act and setting forth website accessibility standards for air carriers. The California Unruh Civil Right Act also prohibits discrimination on the basis of disability, and California Government code Section 11546.7 requires state agency directors to certify that their websites comply with the WCAG. This focus on website accessibility is growing internationally as well, with over 100 countries having ratified the U.N. Convention on the Rights of Persons with Disabilities.\nEmployees\nAs of December 31, 2020, we had 89 full-time employees. We utilize independent contractors to supplement our staff, as needed. None of our employees is subject to a collective bargaining agreement, and we believe that relations with our employees are very good.\nCorporate Information\nAudioEye, Inc. was formed as a Delaware corporation on May 20, 2005. We file reports with the Securities and Exchange Commission (“SEC”) and make available, free of charge, on or through our website at www.audioeye.com, our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, proxy and information statements and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act, as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. In addition, the SEC maintains a website at www.sec.gov containing reports, proxy and information statements and other information regarding issuers that file electronically with the SEC.",
    "item_1A": "Item 1A. Risk Factors\nInvesting in our securities involves a variety of risks and uncertainties, known and unknown, including, among others, those discussed below. Each of the following risks should be carefully considered, together with all the other information included in this Form 10-K, including Management’s Discussion and Analysis of Financial Condition and Results of Operations, our financial statements and the related notes and in our other filings with the SEC. Furthermore, additional risks and uncertainties not presently known to us or that we currently believe to be immaterial may also adversely affect our business. Our business, financial condition, operating results, cash flow and prospects could be materially and adversely affected by any of these risks or uncertainties.\nRisks Relating to Our Business and Industry\nWe have a history of generating significant losses and may not be able to achieve and sustain profitability.\nTo date, we have not been profitable, and we may never achieve profitability on a full-year or consistent basis. We incurred net losses of $7,158,000 for the year ended December 31, 2020. As of December 31, 2020, we had an accumulated deficit of $57,084,000. If we continue to experience losses, we may not be able to continue our operations, and investors may lose their entire investment.\nOur success is dependent on members of our management team and employees, many of whom are relatively new in their positions with the Company.\nOur success has depended, and continues to depend, on the efforts and talents of our senior management team and employees, including our engineers, product managers, sales and marketing personnel, and professional services personnel. Many members of our executive management team and our employees are relatively new to their positions, including our Interim Chief Executive Officer and Chief Strategy Officer and our President, both of whom were appointed to their respective positions in August 2020. Our senior management team has not worked with other members of management and our employees for a significant period of time. We can provide no assurance that our management team will be able to effectively work together or with our employees. If they are unable to do so, there may be delays in execution of our business and operating strategies.\nWe may not receive forgiveness of all or a portion of our PPP Loan.\nAs discussed in this report, including in Note 6 in the notes to the consolidated financial statements included herein, on April 15, 2020, we entered into a note agreement in the amount of $1,302,000 with Liberty Capital Bank (the “PPP Loan”) pursuant to the Paycheck Protection Program of the CARES Act, which is being administered by the Small Business Administration. All or a portion of the Loan may be forgiven upon application by the Company in accordance with the Small Business Administration requirements. In October 2020, we submitted our application to obtain forgiveness of the PPP Loan in full. No assurance can be provided, however, that we will obtain forgiveness of all or a portion of the PPP Loan. If we are unable to obtain forgiveness of all or a portion of the PPP Loan, our liquidity could be reduced, and our business, financial condition and results of operations may be adversely affected.\nWe intend to pursue business through a variety of new channels. The new channels may result in the use of a significant amount of our management resources and costs, and we cannot guarantee we will fully realize the expected benefits.\nWe intend to pursue business through a variety of new channels. Although we may devote significant resources and costs to the development of the new sales channels, we may struggle to successfully identify the channel partners, or to successfully conclude transactions with the channel partners. Should we be unable to identify or conclude important channel partnerships, or if our partners are unable to meet our expectations, our business prospects and operations could be adversely affected as a result of the devotion of significant managerial effort required. In addition, there can be no assurance that we would fully realize the potential benefit of the relationships. If we cannot do so, we may be unable to meet future revenue expectations.\nOur new technology platform may not function as expected or may not be accepted by our clients.\nWe released a new platform for our digital accessibility product in the first quarter of 2021. We cannot guarantee that our platform will operate as expected or that our new platform will be accepted by our customers. If our new platform does not operate as expected or is not accepted, our ability to pursue and retain business may be damaged and our business and results of operations may be materially and adversely affected.\nOur future development will require additional capital, and we may be unable to obtain needed capital or financing on satisfactory terms, or at all, which would prevent us from fully developing our business and generating revenues.\nAs of December 31, 2020, we had $9.1 million in cash. Our business plan will require additional capital expenditures, and our capital outlays could increase substantially over the next several years as we implement our business plan. As a result, we may need to raise additional capital through future private or public equity offerings, strategic alliances or debt financing. Our future capital requirements will depend on many factors, including, among others: market conditions, sales and marketing costs, mergers and acquisition activity, if any, costs of litigation in enforcing our intellectual property rights, and information technology development and acquisition costs. No assurance can be given that we can successfully raise additional equity or debt capital, or that such financing will be available to us on favorable terms, if at all.\nWeakened global economic conditions including current and ongoing microeconomic uncertainty may adversely affect our industry, business and results of operations.\nOur overall performance depends in part on worldwide economic and geopolitical conditions. The United States and other key international economies have experienced cyclical downturns from time to time in which economic activity was impacted by falling demand for a variety of goods and services, restricted credit, poor liquidity, reduced corporate profitability, volatility in credit, equity and foreign exchange markets, bankruptcies and overall uncertainty with respect to the economy. These economic conditions can arise suddenly, and the full impact of such conditions can remain uncertain. In addition, geopolitical developments, such as existing and potential trade wars and other events beyond our control, such as the coronavirus pandemic, can increase levels of political and economic unpredictability globally and increase the volatility of global financial markets. For example, in response to the coronavirus pandemic, we have shifted certain of our customer events to virtual-only experiences and we may deem it advisable to similarly alter, postpone or cancel entirely additional customer, employee or industry events in the future. Moreover, these conditions can affect the rate of IT spending and could adversely affect our customers’ ability or willingness to attend our events or to purchase our software, delay prospective customers’ purchasing decisions, reduce the value or duration of their subscription contracts, affect attrition rates, or decrease our ability to collect on accounts receivable, all of which could adversely affect our future sales and operating results.\nWe have been subject to litigation and may in the future be subject to additional litigation, which could have a material adverse effect on our financial position or results of operations.\nWe may become involved in disputes and allegations related to our business operations. Because we are in a technology industry, these disputes may involve claims of intellectual property infringement or misappropriation. We have also been involved in securities law litigation in the past. These types of litigation can be very expensive, and we cannot assure you that our insurance policies will cover the costs. Because it is not possible to determine when and whether these disputes and allegations may arise or the ultimate disposition of such matters, the resolution of any such matters, should they arise, could have a material adverse effect on our financial position or results of operations.\nAn increase in market interest rates could increase our interest costs on future debt and could adversely affect our stock price.\nIf interest rates increase, so could our interest costs for any new debt. This increased cost could make financing, including the financing of any acquisition, costlier. We may incur variable interest rate indebtedness in the future. Rising interest rates could limit our ability to refinance debt when it matures or cause us to pay higher interest rates upon refinancing and increased interest expense on refinanced indebtedness.\nWe may pursue new strategic opportunities which may result in the use of a significant amount of our management resources or significant costs, and we may not be able to fully realize the potential benefit of such opportunities.\nWe may seek strategic opportunities to help us pursue our business objectives. Although we may devote significant time and resources in pursuit of such transactions, we may struggle to successfully identify such opportunities, or to successfully conclude transactions. Should we be unable to identify or conclude important strategic transactions, our business prospects and operations could be adversely affected as a result of the devotion of significant managerial effort required, and the challenges of achieving our objectives in the absence of strategic opportunities. In addition, we may incur significant costs in connection with seeking acquisitions or other strategic opportunities regardless of whether the transaction is completed, and in combining its operations with ours if such a transaction is completed. In the event that we consummate an acquisition or strategic relationship in the future, we cannot assure you that we would fully realize the potential benefit of such a transaction or that we would not be subject to unknown liabilities.\nOur business plan may not be realized. If our business plan proves to be unsuccessful, our business may fail, and you may lose your entire investment.\nOur operations are subject to all of the risks inherent in the establishment of a new business enterprise with a limited operating history. The likelihood of our success must be considered in light of the problems, expenses, complications, and delays frequently encountered in connection with the development of a new business. Unanticipated events may occur that could affect the actual results achieved during the forecast periods. Consequently, the actual results of operations during the forecast periods will vary from the forecasts, and such variations may be material. In addition, the degree of uncertainty increases with each successive year presented in our business plan. We cannot assure you that we will succeed in the anticipated operation of our business plan. If our business plan proves to be unsuccessful, our business may fail, and you may lose your entire investment.\nWe have experienced and will continue to experience competition as more companies seek to provide products and services similar to our products and services, and because larger and better-financed competitors may affect our ability to compete in the marketplace and achieve profitability, our business may fail.\nCompetition in our market is intense, and we expect competition for our products and services to become even more intense. We compete directly against other companies offering similar products and services that compete or will compete directly with our proposed products and services. We also compete against established vendors in our markets. These companies may incorporate other competitive technologies into their product offerings, whether developed internally or by third parties. There are also established consultants who offer services to help their customers obtain compliance with accessibility standards. In many cases these consultants compete for the same funding from our prospective customers. For the foreseeable future, many of our competitors may be larger, better-financed companies that may develop products superior to our current and proposed products, which could create significant competitive advantages for those companies. Our future success depends on our ability to compete effectively with our competitors. As a result, we may have difficulty competing with larger, established competitors. Generally, these competitors may have:\n· substantially greater financial, technical, and marketing resources;\n· a larger customer base;\n· better name recognition; and\n· more expansive or different product offerings.\nThese competitors may command a larger market share than we do, which may enable them to establish a stronger competitive position, in part, through greater marketing opportunities. Further, our competitors may be able to respond more quickly than we are to new or emerging technologies and changes in user preferences and to devote greater resources to developing new products and offering new services. These competitors may develop products or services that are comparable or superior to ours. If we fail to address competitive developments quickly and effectively, we may not be able to remain a viable business.\nIf we are not able to adequately protect our patented rights, our operations may be negatively impacted.\nOur ability to compete largely depends on the superiority, uniqueness and value of our technology and intellectual property. To protect our intellectual property rights, we rely on a combination of patent, trademark, copyright, and trade secret laws, confidentiality agreements with our employees and third parties, and protective contractual provisions. We cannot assure you that infringement or invalidity claims (or claims for indemnification resulting from infringement claims) will not be asserted or prosecuted against us or that any such assertions or prosecutions will not materially adversely affect our business.\nRegardless of whether any future claims are valid or can be successfully asserted, defending against such claims could cause us to incur significant costs, could jeopardize or substantially delay a successful outcome in any future litigation, and could divert resources away from our other activities. In addition, assertion of infringement claims could result in injunctions that prevent us from distributing our products. In addition to challenges against our existing patents, any of the following could also reduce the value of our intellectual property now, or in the future:\n· our applications for patents, trademarks, and copyrights relating to our business may not be granted and, if granted, may be challenged or invalidated;\n· issued trademarks, copyrights or patents may not provide us with any competitive advantages;\n· our efforts to protect our intellectual property rights may not be effective in preventing misappropriation of our technology; or\n· our efforts may not prevent the development and design by others of products or technologies similar to, competitive with, or superior to those that we develop.\nAlso, we may not be able to effectively protect our intellectual property rights in certain foreign countries where we may do business in the future or from which competitors may operate. Obtaining patents will not necessarily protect our technology or prevent our international competitors from developing similar products or technologies. Our inability to adequately protect our patented rights may have a negative impact on our operations and revenues.\nIn addition, legal standards relating to the validity, enforceability, and scope of protection of intellectual property rights in Internet-related businesses are uncertain and still evolving. Because of the growth of the Internet and Internet-related businesses, patent applications are continuously and simultaneously being filed in connection with Internet-related technology. There are a significant number of U.S. and foreign patents and patent applications in our areas of interest, and we believe that there has been, and is likely to continue to be, significant litigation in the industry regarding patent and other intellectual property rights.\nWe may commence legal proceedings against third parties who we believe are infringing on our intellectual property rights, and if we are forced to litigate to defend our intellectual property rights, or to defend claims by third parties against us relating to intellectual property rights, legal fees and court injunctions could adversely affect our financial condition and potentially end our business.\nWe have active litigation against a competitor related to the alleged violation of our patents and other unfair trade practices, and we may engage in future litigation. We expect an increase in the number of third parties who could violate our patents as the market develops new uses of similar products and consumers continue to increase their adoption of technology and integrate it into their daily lives. We foresee the potential need to enter into additional active litigation to defend and enforce our patents. We anticipate that these legal proceedings could continue for several years and may require significant expenditures for legal fees and other expenses. In the event we are not successful through appeal and do not subsequently obtain monetary and injunctive relief, these litigation matters may significantly reduce our financial resources and have a material impact on our ability to continue our operations. The time and effort required of our management to effectively pursue or defend these litigation matters may adversely affect our ability to operate our business, since time spent on matters related to the lawsuits would take away from the time spent on managing and operating the business. We cannot assure you any such potential lawsuits will result in an outcome that is favorable to our stockholders or the Company.\nThe current regulatory environment for our products and services remains unclear.\nWe cannot assure you that our existing or planned product and service offerings will be in compliance with local, state, and/or federal U.S. laws or the laws of any foreign jurisdiction where we operate or may operate in the future. Further, we cannot assure you that we will not unintentionally violate such laws or that such laws will not be modified, or that new laws will not be enacted in the future, which would cause us to be in violation of such laws. More aggressive domestic or international regulation of the Internet may materially and adversely affect our business, financial condition, operating results, and future prospects.\nOur business greatly depends on the growth of online services, Internet of Things (“IOT”), kiosks, streaming, and other next-generation Internet-based applications, and there is a risk that such growth may not occur as expected, or at all, which would harm our business.\nThe Internet may ultimately prove not to be a viable commercial marketplace for such applications for several reasons, including:\n· unwillingness of consumers to shift to and use other such next-generation Internet-based audio applications;\n· refusal to purchase our products and services;\n· perception by end-users with respect to product and service quality and performance;\n· limitations on access and ease of use;\n· congestion leading to delayed or extended response times;\n· inadequate development of Internet infrastructure to keep pace with increased levels of use; and\n· increased government regulations.\nBecause of these and other factors, the growth of online services, IOT, kiosks, streaming, and other next-generation Internet-based applications may be impeded or not occur as expected. As a result, our business and operations could be adversely impacted.\nIf the market for our online services does not grow as anticipated, our business would be adversely affected.\nWhile other next-generation Internet-based applications have grown rapidly in personal and professional use, we cannot assure you that the adoption of our products and services will grow at a comparable rate or grow at all.\nOur expansion into new products, services, technologies, and geographic regions subjects us to additional business, legal, financial, and competitive risks.\nWe may have limited or no experience in our newer market segments, and our customers may not adopt our new offerings. These offerings may present new and difficult technology challenges, and we may be subject to claims if customers of these offerings experience service disruptions or failures or other quality issues. In addition, profitability, if any, in our newer activities may be lower than in our older activities, and we may not be successful enough in these newer activities to recoup our investments in them. If any of this were to occur, it could damage our reputation, limit our growth, and negatively affect our operating results.\nWe face risks related to system interruption and lack of redundancy.\nWe experience occasional system interruptions and delays that make our websites and services unavailable or slow to respond and prevent us from efficiently providing services to third parties, which may reduce our net sales and the attractiveness of our products and services. If we are unable to continually add software and hardware, effectively upgrade our systems and network infrastructure, and take other steps to improve the efficiency of our systems, it could cause system interruptions or delays and adversely affect our operating results.\nOur computer and communications systems and operations could be damaged or interrupted by fire, flood, power loss, telecommunications failure, earthquakes, acts of war or terrorism, acts of God, computer viruses, physical or electronic break-ins, and similar events or disruptions. Any of these events could cause system interruption, delays, and loss of critical data, and could prevent us from providing services, which could make our product and service offerings less attractive and subject us to liability. Our systems are not fully redundant, and our disaster recovery planning may not be sufficient. In addition, we may have inadequate insurance coverage to compensate for any related losses. Any of these events could damage our reputation and be expensive to remedy.\nGovernment regulation is evolving, and unfavorable changes could harm our business.\nWe are subject to general business regulations and laws, as well as regulations and laws specifically governing the Internet, e-commerce, electronic devices, and other services. Existing and future laws and regulations may impede our growth. These regulations and laws may cover website accessibility, taxation, privacy, data protection, pricing, content, copyrights, distribution, mobile communications, electronic device certification, electronic waste, energy consumption, environmental regulation, electronic contracts and other communications, competition, consumer protection, web services, the provision of online payment services, information reporting requirements, unencumbered Internet access to our services, the design and operation of websites, the characteristics and quality of products and services, and the commercial operation of unmanned aircraft systems. It is not clear how existing laws governing issues such as property ownership, libel, and personal privacy apply to the Internet, e-commerce, digital content, and web services. Unfavorable regulations and laws could diminish the demand for our products and services and increase our cost of doing business.\nWe could be subject to additional sales tax or other indirect tax liabilities.\nU.S. Supreme Court decisions restrict the imposition of obligations to collect state and local sales taxes with respect to remote sales. However, an increasing number of states have considered or adopted laws or administrative practices that attempt to impose obligations on out-of-state businesses to collect taxes on their behalf. A successful assertion by one or more states or foreign countries requiring us to collect taxes where we do not currently do so could result in substantial tax liabilities, including for past sales, as well as penalties and interest.\nWe may be subject to risks related to government contracts and related procurement regulations.\nOur contracts with U.S., as well as state, local, and foreign, government entities are subject to various procurement regulations and other requirements relating to their formation, administration, and performance. We may be subject to audits and investigations relating to our government contracts, and any violations could result in various civil and criminal penalties and administrative sanctions, including termination of contracts, refunding or suspending of payments, forfeiture of profits, payment of fines, and suspension or debarment from future government business. In addition, such contracts may provide for termination by the government at any time, without cause.\nIf we do not successfully adapt, enhance or develop new products and services in a cost-effective manner to meet customer demand in the rapidly evolving market for next-generation Internet-based applications and services, our business may fail.\nThe market for next-generation Internet-based applications and services is characterized by rapidly changing technology, evolving industry standards, changes in customer needs, and frequent new service and product introductions. Our future success will depend, in part, on our ability to use new technologies effectively, to continue to develop our technical expertise and proprietary technology, to enhance our existing products and services, and to develop new products and services that meet changing customer needs on a timely and cost-effective basis. We may not be able to adapt quickly enough to changing technology, customer requirements, and industry standards. If we fail to use new technologies effectively, to develop our technical expertise and new products and services, or to enhance existing products and services on a timely basis, either internally or through arrangements with third parties, our product and service offerings may fail to meet customer needs, which would adversely affect our revenues and prospects for growth.\nIn addition, if we are unable to, for technological, legal, financial, or other reasons, adapt in a timely manner to changing market conditions or customer requirements, we could lose customers, strategic alliances, and market share. Sudden changes in user and customer requirements and preferences, the frequent introduction of new products and services embodying new technologies, and the emergence of new industry standards and practices could render our existing products, services and systems obsolete. The emerging nature of products and services in the technology and communications industry and their rapid evolution will require that we continually improve the performance, features, and reliability of our products and services. Our survival and success will depend, in part, on our ability to:\n· design, develop, launch and/or license our planned products, services, and technologies that address the increasingly sophisticated and varied needs of our prospective customers; and\n· respond to technological advances and emerging industry standards and practices on a cost-effective and timely basis.\nThe development of products and services and other patented technology involves significant technological and business risks and requires substantial expenditures and lead time. We may be unable to use new technologies effectively. Updating our technology internally and licensing new technology from third parties may also require us to incur significant additional expenditures.\nIf our products and services do not continue to gain market acceptance, we may not be able to fund future operations.\nA number of factors may affect the market acceptance of our products or services or any other products or services we develop or acquire, including, among others:\n· the price of our products or services relative to other competitive products and services;\n· the perception by users of the effectiveness of our products and services;\n· our ability to fund our sales and marketing efforts; and\n· the effectiveness of our sales and marketing efforts.\nIf our products and services do not continue to gain market acceptance, we may not be able to fund future operations, including the development of new products and services and/or our sales and marketing efforts for our current products and services, which inability would have a material adverse effect on our business, financial condition, and operating results.\nWe continually develop new products and product enhancements and actively capitalize software development costs, while making educated assumptions to anticipate the attributed revenue to be derived from each development or enhancement. If our assumptions are incorrect or if we are unable to accurately attribute revenue to each respective product or product enhancement, we may have to account for impairment, thus causing us to reverse the capitalized expenditures.\nOur product developers are consistently programming new products and enhancements to existing products. Under applicable accounting guidance, we make determinations to estimate the useful life of each of these products and enhancements. Based on these determinations, we amortize software expenses over a pre-determined period of time. Should our estimates turn out to be inaccurate or should the business fail to attract new revenue in relation to each respective product or product enhancement, we may have to reverse or write off the related capitalized expenses.\nOur products and services are highly technical and may contain undetected errors, which could cause harm to our reputation and adversely affect our business.\nOur products and services are highly technical and complex and, when deployed, may contain errors or defects. Despite testing, some errors in our products and services may only be discovered after they have been installed and used by customers. Any errors or defects discovered in our products and services after commercial release could result in failure to achieve market acceptance, loss of revenue or delay in revenue recognition, loss of customers, and increased service and warranty cost, any of which could adversely affect our business, operating results and financial condition. In addition, we could face claims for product liability, tort, or breach of warranty. The performance of our products and services could have unforeseen or unknown adverse effects on the networks over which they are delivered as well as on third-party applications and services that utilize our products and services, which could result in legal claims against us, harming our business. Furthermore, we expect to provide implementation, consulting, and other technical services in connection with the implementation and ongoing maintenance of our products and services, which typically involves working with sophisticated software, computing systems, and communications systems. Many of our contracts with customers contain provisions relating to warranty disclaimers and liability limitations, but such provisions may not be upheld. Defending a lawsuit, regardless of its merit, is costly and may divert our management’s attention and adversely affect the market’s perception of us and our products and services. In addition, if our business liability insurance coverage proves inadequate or future coverage is unavailable on acceptable terms or at all, our business, operating results and financial condition could be adversely impacted.\nMalfunctions of third-party communications infrastructure, hardware and software expose us to a variety of risks we cannot control, and those risks could result in harm to our business.\nOur business depends upon the capacity, reliability and security of the infrastructure owned by third parties over which our product offerings are deployed. We have no control over the operation, quality or maintenance of a significant portion of that infrastructure or over whether those third parties will upgrade or improve their equipment. We do depend on these companies to maintain the operational integrity of our integrated connections. If one or more of these companies is unable or unwilling to supply or expand its levels of service in the future, our operations could be adversely impacted. System interruptions or increases in response time could result in a loss of potential or existing users and, if sustained or repeated, could reduce the appeal of the networks to users. In addition, users depend on real-time communications; outages caused by increased traffic could result in delays and system failures. These types of occurrences could cause users to perceive that our products and services do not function properly and could therefore adversely affect our ability to attract and retain strategic partners and customers.\nSecurity breaches, computer viruses, and computer hacking attacks could harm our business, financial condition, results of operations, or reputation.\nSecurity breaches, computer malware and computer hacking attacks have become more prevalent in our industry. Any security breach caused by hacking, which involves efforts to gain unauthorized access to information or systems, or to cause intentional malfunctions or loss or corruption of data, software, hardware or other computer equipment, or the inadvertent transmission of computer viruses could adversely affect our business, financial condition, results of operations or reputation.\nOur corporate systems, third-party systems and security measures may be breached due to the actions of outside parties, employee error, malfeasance, a combination of these, or otherwise, and, as a result, an unauthorized party may obtain access to our data or any third-party data we may possess. Any such security breach could require us to comply with various breach notification laws and may expose us to litigation, remediation and investigation costs, increased costs for security measures, loss of revenue, damage to our reputation, and potential liability.\nSystem failure or interruption or our failure to meet increasing demands on our systems could harm our business.\nThe success of our product and service offerings depends on the uninterrupted operation of various systems, secure data centers, and other computer and communication networks that we use or establish. To the extent the number of users of networks utilizing our future products and services suddenly increases, the technology platform and hosting services which will be required to accommodate a higher volume of traffic may result in slower response times, service interruptions or delays or system failures. The deployment of our products, services, systems and operations will also be vulnerable to damage or interruption from:\n· power loss, transmission cable cuts and other telecommunications failures;\n· damage or interruption caused by fire, earthquake and other natural disasters;\n· computer viruses or software defects; and\n· physical or electronic break-ins, sabotage, intentional acts of vandalism, terrorist attacks and other events beyond our control.\nSystem interruptions or failures and increases or delays in response time could result in a loss of potential or existing users and, if sustained or repeated, could reduce the appeal of our products and services to users. These types of occurrences could cause users to perceive that our products and services do not function properly and could therefore adversely affect our ability to attract and retain strategic partners and customers\nWe do not expect to pay any dividends to holders of our common stock for the foreseeable future, which will affect the extent to which our investors realize any future gains on their investment.\nWe do not anticipate that we will pay any dividends to holders of our common stock in the foreseeable future. Accordingly, investors must rely on sales of their common stock after price appreciation, which may never occur, as the only way to realize any future gains on their investment.\nWe will need to recruit and retain additional qualified personnel to successfully grow our business.\nOur future success will depend in part on our ability to attract and retain qualified operations, marketing and sales personnel as well as technical personnel. Inability to attract and retain such personnel could adversely affect our business. Competition for technical, sales, marketing and executive personnel is intense, particularly in the technology and Internet sectors. We cannot assure you that we will be able to attract or retain such personnel.\nIf we fail to maintain effective internal control over financial reporting and effective disclosure controls and procedures, we may not be able to report financial results accurately or on a timely basis, or to detect fraud, which could have a material adverse effect on our business and stock price.\nIn connection with this annual report, our management carried out an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures and of the effectiveness of our internal control over financial reporting. Based on that evaluation, our Principal Executive Officer and Principal Financial Officer have concluded that, primarily due to material weaknesses in our internal control over financial reporting as described in this annual report, our disclosure controls and procedures and our internal control over financial reporting were not effective as of December 31, 2020.\nOur failure to establish and maintain the required internal control over financial reporting, and to establish and maintain effective disclosure controls and procedures, or any failure of those controls or procedures once established, could adversely impact our public disclosures regarding our business, financial condition or results of operations. Upon review of the required internal control over financial reporting, our management and/or our auditors have in the past and may in the future identify material weaknesses and/or significant deficiencies that need to be addressed. Any actual or perceived weaknesses or conditions that need to be addressed in our internal control over financial reporting and disclosure of management's assessment of the Company’s internal control over financial reporting or disclosure of our independent registered public accounting firm's attestation to or report on management's assessment of our internal control over financial reporting, or our failure to obtain such an attestation or report, could adversely impact the price of and our ability to list our common stock and may lead to stockholder claims and regulatory action against us. Failure to remediate our current material weaknesses or to maintain effective internal controls in the future could also result in a material misstatement of our annual or quarterly financial statements that would not be prevented or detected on a timely basis and that could cause us to restate our financial statements for a prior period, cause investors to lose confidence in our financial statements and/or limit our ability to raise capital.\nAdditionally, any such failure may also negatively impact our operating results and financial condition, impair our ability to timely file our periodic and other reports with the SEC, consume a significant amount of management's time, and cause us to incur substantial additional costs relating to the implementation of remedial measures.\nRisks Related to the Market for Our Common Stock\nAlthough our shares of common stock are listed on the Nasdaq Capital Market, historically we have had a limited trading volume and a higher price volatility. This may result in reduced liquidity of our common stock.\nAlthough our shares of common stock are listed on the Nasdaq Capital Market under the symbol “AEYE,” historically trading volume in our common stock has been limited. In addition, our stock has also historically seen significant price volatility, which may reduce the liquidity of our common stock. The sale of a significant number of shares of common stock at any particular time could be difficult to achieve at the market prices prevailing immediately before such shares are offered, and may limit your liquidity options.\nIf we cannot continue to satisfy the continuing listing criteria of the Nasdaq Capital Market, the exchange may subsequently delist our common stock.\nThe Nasdaq Capital Market requires us to meet certain financial, public float, bid price and liquidity standards on an ongoing basis in order to continue the listing of our common stock. Generally, we must maintain a minimum amount of stockholders’ equity and a minimum number of holders of our securities, as well as meet certain disclosure and corporate governance requirements. If we fail to meet any of the continuing listing requirements, our common stock may be subject to delisting. If our common stock is delisted and we are not able to list our common stock on another national securities exchange, we expect our securities would be quoted on an over-the-counter market. If this were to occur, our stockholders could face significant material adverse consequences, including limited availability of market quotations for our common stock and reduced liquidity for the trading of our securities. In addition, we could experience a decreased ability to issue additional securities and obtain additional financing in the future.\nThe market price for our common stock may fluctuate significantly, which could result in substantial losses by our investors.\nThe market price of our common stock may fluctuate significantly in response to numerous factors, some of which are beyond our control, such as:\n· the outcomes of potential future patent litigation;\n· our ability to monetize our future patents;\n· changes in our industry;\n· announcements of technological innovations, new products or product enhancements by us or others;\n· announcements by us of significant strategic partnerships, out-licensing, in-licensing, joint ventures, acquisitions or capital commitments;\n· changes in earnings estimates or recommendations by security analysts, if our common stock is covered by analysts;\n· investors’ general perception of us;\n·\nfuture issuances of common stock;\n· investors’ future resales of our securities;\n· the addition or departure of key personnel;\n· general market conditions, including the volatility of market prices for shares of technology companies, generally, and other factors, including factors unrelated to our operating performance; and\n· the other factors described in this “Risk Factors” section.\nThese factors and any corresponding price fluctuations may materially and adversely affect the market price of our common stock and result in substantial losses by our investors.\nFurther, the stock market in general, and the market for technology companies in particular, has experienced extreme price and volume fluctuations in the past. Continued market fluctuations could result in extreme volatility in the price of our common stock, which could cause a decline in the value of our common stock.\nPrice volatility of our common stock might be worse if the trading volume of our common stock is low. In the past, following periods of market volatility, stockholders have often instituted securities class action litigation. We have previously been the target of securities litigation and may in the future be subject to additional securities litigation, which could result in substantial costs to us and divert resources and attention of management from our business, even if we are successful in any such litigation. Future sales of our common stock could also reduce the market price of such stock.\nMoreover, the liquidity of our common stock is limited, not only in terms of the number of shares that can be bought and sold at a given price, but by delays in the timing of transactions and reduction in security analysts’ and the media’s coverage of us, if any. These factors may result in lower prices for our common stock than might otherwise be obtained and could also result in a larger spread between the bid and ask prices for our common stock. In addition, without a large float, our common stock is less liquid than the stock of companies with broader public ownership and, as a result, the trading price of our common stock may be more volatile. In the absence of an active public trading market, an investor may be unable to liquidate its investment in our common stock. Trading of a relatively small volume of our common stock may have a greater impact on the trading price of our stock than would be the case if our public float were larger. We cannot predict the prices at which our common stock will trade in the future.\nSales or the availability for sale of a substantial number of shares of our common stock may cause the price of our common stock to decline and adversely affect our ability to raise capital.\nIf our stockholders sell substantial amounts of our common stock in the public market, including pursuant to our currently effective Registration Statement on Form S-3, such sales or the anticipation of such sales could cause the market price of our common stock to fall. Such circumstances, whether or not sales have occurred or are occurring, also could make more difficult our ability to raise additional financing through the sale of equity or equity-related securities in the future at a time and price that we deem reasonable or appropriate.\nWhen we issue additional shares of common stock in the future, including under our at-the-market program, in future financings or upon conversion of our Series A Convertible Preferred Stock, it will result in the dilution of our existing stockholders and may also result in a reduction in the market price of our common stock.\nOur Certificate of Incorporation authorizes the issuance of up to 50,000,000 shares of common stock with a $0.00001 par value per share and 10,000,000 shares of preferred stock with a $0.00001 par value per share, of which, as of December 31, 2020, approximately 10,130,000 shares of common stock and 90,000 shares of Series A Convertible Preferred Stock were issued and outstanding. Such shares of Series A Convertible Preferred Stock, based upon the applicable conversion rate as of December 31, 2020, were at such time convertible into an aggregate of approximately 263,000 shares of common stock. As of December 31, 2020, we also had outstanding warrants and options to purchase an aggregate of approximately 598,000 shares of our common stock and unvested, or vested but not yet settled, restricted stock units covering an aggregate of approximately 958,000 shares of common stock. The exercise of such options and warrants and the vesting or vesting and settlement of such restricted stock units would further increase the number of our outstanding shares of common stock.\nIn addition, in February 2021, we entered into an At Market Issuance Sales Agreement under which the Company may offer and sell, from time to time at its sole discretion, shares of its common stock having an aggregate offering price of up to $30 million.\nFrom time to time, we may adopt new equity compensation plans or increase the number of shares available for issuance in connection with our existing equity compensation plans. Our board of directors may also choose to issue some or all of our available shares to provide additional financing or acquire businesses in the future.\nThe issuance of any shares upon conversion of any preferred stock, including our Series A Convertible Preferred Stock, under our equity compensation plans, for acquisition, licensing or financing efforts, upon exercise of warrants and options, or upon settlement of restricted stock units or in financings will dilute the interests of our holders of common stock and cause a reduction in the proportionate ownership and voting power of all then current stockholders. Any such issuances may also result in a reduction in the market price of our common stock.\nThe interests of our controlling stockholders may not coincide with yours and such controlling stockholders may make decisions with which you may disagree.\nAs of February 3, 2021, five of our stockholders, two of whom are our Executive Chairman and our Interim Chief Executive Officer and Chief Strategy Officer, and another of whom is a director, beneficially owned in the aggregate over 50% of the voting power of our outstanding shares of common stock and Series A Preferred Stock on an as-converted basis. As a result, these stockholders may be able to influence the outcome of matters requiring stockholder approval, including the election of directors and approval of significant corporate transactions. In addition, this concentration of ownership may delay or prevent a change in control of our company and make some future transactions more difficult or impossible without the support of our controlling stockholders. The interests of our controlling stockholders may not coincide with our interests or the interests of other stockholders.\nIf securities or industry analysts do not publish research or publish inaccurate or unfavorable research about our business, our stock price and trading volume could decline.\nThe trading market for our common stock will depend in part on the research and reports that securities or industry analysts publish about us or our business. We currently have new research coverage by securities and industry analysts. If one or more of the analysts who covers us downgrades our stock or publishes inaccurate or unfavorable research about our business, our stock price would likely decline. If one or more of these analysts ceases coverage of us or fails to publish reports on us regularly, demand for our stock could decrease, which could cause our stock price and trading volume to decline.\nWe are subject to financial reporting and other requirements that place significant demands on our resources.\nWe are subject to reporting and other obligations under the Securities Exchange Act of 1934, as amended, including the requirements of Section 404 of the Sarbanes-Oxley Act of 2002. Section 404 requires us to conduct an annual management assessment of the effectiveness of our internal control over financial reporting. These reporting and other obligations place significant demands on our management, administrative, operational, internal audit and accounting resources. Any failure to maintain effective internal controls, such as occurred as of December 31, 2019 and 2020, could have a material adverse effect on our business, operating results and stock price. Moreover, effective internal control is necessary for us to provide reliable financial reports and prevent fraud. If we cannot provide reliable financial reports or prevent fraud, we may not be able to manage our business as effectively as we would if an effective control environment existed, and our business and reputation with investors may be harmed. We may also face claims by our investors, which could harm our business and financial condition.\nRisks Relating to Our Charter Documents and Capital Structure\nWe are close to being controlled by a small number of “insider” stockholders, which could determine corporate and stockholder action on significant matters.\nAs of February 3, 2021, our directors and executive officers beneficially owned an aggregate of 4,114,782 of our outstanding shares of common stock and 60,000 shares of our outstanding shares of Series A Convertible Preferred Stock, which represents approximately 41% of the aggregate voting power of our outstanding shares of common stock and Series A Preferred Stock on an as-converted basis. Through their collective ownership of our outstanding stock, such holders, if they were to act together, would be close to controlling the voting of our shares at all meetings of stockholders and, because the common stock does not have cumulative voting rights, to determining the outcome of the election of all of our directors and determining corporate and stockholder action on other matters.\nProvisions of our Certificate of Incorporation and bylaws could discourage potential acquisition proposals and could deter or prevent a change in control.\nSome provisions in our Certificate of Incorporation and bylaws, as well as statutes, may have the effect of delaying, deterring or preventing a change in control. These provisions, including those providing for the possible issuance of shares of our preferred stock, which may be divided into series and with the preferences, limitations and relative rights to be determined by our board of directors, and the right of the board of directors to amend the bylaws, may make it more difficult for other persons, without the approval of our board of directors, to make a tender offer or otherwise acquire a substantial number of shares of our common stock or to launch other takeover attempts that a stockholder might consider to be in his or her best interest. These provisions could limit the price that some investors might be willing to pay in the future for shares of our common stock.\nDelaware law may delay or prevent takeover attempts by third parties and therefore inhibit our stockholders from realizing a premium on their stock.\nWe are subject to the anti-takeover provisions of Section 203 of the Delaware General Corporation Law. These provisions prevent any stockholder who owns 15% or more of our outstanding shares of common stock from engaging in certain business combinations with us for a period of three years following the time that the stockholder acquired such stock ownership unless certain approvals were or are obtained from our board of directors or from the holders of 66 2/3% of our outstanding shares of common stock (excluding the shares of our common stock owned by the 15% or more stockholder). Our board of directors can use these and other provisions to discourage, delay or prevent a change in the control of our company or a change in our management. Any delay or prevention of a change of control transaction or a change in our board of directors or management could deter potential acquirers or prevent the completion of a transaction in which our stockholders could receive a substantial premium over the then current market price of our shares. These provisions could also limit the price that investors might be willing to pay for shares of our common stock.\nFailure to manage growth effectively could adversely affect our business, results of operations and financial condition.\nThe success of our future operating activities will depend upon our ability to expand our support system to meet the demands of our growing business. Any failure by our management to effectively anticipate, implement, and manage changes required to sustain our growth would have a material adverse effect on our business, financial condition, and results of operations. We cannot assure you that we will be able to successfully operate acquired businesses (if any), become profitable in the future, or effectively manage any other change.\nThe elimination of the monetary liability of our directors under Delaware law and the existence of indemnification rights held by our directors, officers and employees may result in substantial expenditures by us and may discourage lawsuits against our directors, officers and employees.\nOur Certificate of Incorporation contains specific provisions that eliminate the liability of our directors for monetary damages to our company and stockholders and requires indemnification of our directors and officers to the extent provided by Delaware law. Our bylaws also contain provisions that require the indemnification of our directors, officers and employees. We may also have contractual indemnification obligations under our employment agreements with our officers. The foregoing limitation of liability and indemnification obligations could result in our company incurring substantial expenditures to cover the cost of settlement or damage awards against directors and officers, which we may be unable to recoup. These provisions and resultant costs may also discourage our company from bringing a lawsuit against directors and officers for breaches of their fiduciary duties and may similarly discourage the filing of derivative litigation by our stockholders against our directors and officers even though such actions, if successful, might otherwise benefit our company and our stockholders.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNot applicable.",
    "item_2": "Item 2. Properties\nThe Company’s principal offices are located at 5210 E. Williams Circle, Suite 750, Tucson, Arizona 85711, consisting of approximately 5,151 square feet under a lease agreement that expires on October 31, 2022.\nThe Company also leases offices in Scottsdale, Arizona, and Atlanta, Georgia, and occupies shared office space in Portland, Oregon, and New York, New York, under membership agreements which provide for membership fees based on the number of contracted seats.\nThe Company believes that its space is adequate for its current needs and that suitable alternative space is available to accommodate expansion of the Company’s operations.",
    "item_3": "Item 3. Legal Proceedings\nIn the normal course of business, we are subject to proceedings, lawsuits, regulatory agency inquiries, and other claims. All such matters are subject to uncertainties and outcomes that are not predictable with assurance. While these matters could materially affect operating results when resolved in future periods, management believes that, after final disposition, including anticipated insurance recoveries in certain cases, any monetary liability or financial impact to the Company beyond that provided for in the consolidated balance sheet as of December 31, 2020, would not be material to our financial position or annual results of operations.",
    "item_4": "Item 4. Mine Safety Disclosures\nNot applicable.\nPART II",
    "item_5": "Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nCommon Stock Information\nOur common stock has been listed on The Nasdaq Capital Market under the symbol “AEYE” since September 4, 2018.\nOn March 5, 2021, there were 187 holders of record of our common stock, and a greater number of beneficial holders of our common stock for whom shares were held in a “nominee” or “street” name. As of that same date, there were seven holders of record of our preferred stock.\nThe transfer agent of our common stock is Equiniti Trust Company (f//a/ Corporate Stock Transfer). Its address is 3200 Cherry Creek Drive, Suite 430, Denver, Colorado 80209, and its telephone number is (303) 282-4800.\nDividend Policy\nIn April 2015, the Company issued 175,000 shares of Series A Convertible Preferred Stock with cumulative 5% dividend rights payable when declared by the board of directors of the Company.\nDividends to preferred stockholders take precedence over any dividends to common stockholders. Holders of our common stock are entitled to receive ratably such dividends, if any, as may be declared by our board of directors out of funds legally available therefor. We have not declared or paid any dividends on our preferred or common stock since our inception, and we presently anticipate that earnings, if any, will be retained for development of our business. There are no restrictions in our Certificate of Incorporation or By-laws that prevent us from declaring dividends. Any future declaration of dividends will be at the discretion of our board of directors and will depend upon, among other things, our future earnings, operating and financial condition, and capital requirements.\nRecent Sales of Unregistered Securities\nDuring the year ended December 31, 2020, the Company issued an aggregate of 253,974 shares of its common stock upon exercise of previously issued warrants for net proceeds of $905,000 and 43,504 shares of its common stock upon the conversion of previously issued preferred stock. Such issuances were exempt from registration under Section 4(a)(2) of the Securities Act of 1933, as amended.",
    "item_6": "Item 6. Selected Financial Data\nNot applicable.",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion should be read in conjunction with our audited financial statements and the related notes for the years ended December 31, 2020 and 2019 that appear elsewhere in this annual report on Form 10-K. The following discussion contains forward-looking statements that reflect our plans, estimates and beliefs. Our actual results could differ materially from those discussed in the forward-looking statements. Factors that could cause or contribute to such differences include but are not limited to those discussed below and elsewhere in this annual report on Form 10-K, particularly in “Risk Factors.” The forward-looking statements included in this annual report on Form 10-K are made only as of the date hereof.\nBackground\nAudioEye, Inc. was formed as a Delaware corporation on May 20, 2005. On August 1, 2018, the Company amended its Certificate of Incorporation to implement a reverse stock split in the ratio of 1 share for every 25 shares of common stock and to reduce the number of authorized shares of common stock from 250,000,000 to 50,000,000. As a result, 186,994,384 shares of the Company’s common stock were exchanged for 7,479,775 shares of the Company's common stock.\nOverview\nAudioEye is an industry-leading software solution provider delivering website accessibility compliance at all price points to businesses of all sizes. Our solutions advance accessibility with patented technology that reduces barriers, expands access for individuals with disabilities, and enhances the user experience for a broader audience. We believe that, when implemented, our solution offers businesses and organizations the opportunity to reach more customers, improve brand image, build additional brand loyalty, and, most importantly, provide an accessible and usable web experience to the expansive and ever-growing global population of individuals with disabilities.\nAudioEye primarily generates revenue through the sale of subscriptions for our software-as-a-service (“SaaS”) accessibility solutions. Our solutions are backed by AudioEye’s machine-learning/AI-driven technology that finds and fixes the most common accessibility errors. Our core and supplemental solutions are designed to help websites and applications achieve and sustain substantial conformance with the Web Content Accessibility Guidelines (“WCAG”) which are web accessibility standards published by the Web Accessibility Initiative of the World Wide Web Consortium, the main international standards organization for the internet. Our solutions help mitigate a customer’s risk of costly digital accessibility-related legal action and improve their negotiation leverage when defending against claims of non-compliance. AudioEye customers may purchase solutions directly through the AudioEye website, through a platform or an agency partner, such as Duda, that integrates our solutions into their marketplace, through a vertical Content Management System (“CMS”) partner or through an authorized reseller, or by working directly with the AudioEye sales team. We also provide PDF remediation and Mobile App report services. Our offerings serve businesses and organizations of all sizes and at all price points.\nAudioEye stands out among its competitors because it delivers machine-learning/artificial intelligence (“AI”)-driven accessibility without fundamental changes to the website architecture. As another differentiator, we offer greater transparency. Our offerings provide automated remediations and a transparent compliance score with additional manually driven enhancements. AudioEye pairs its patented technology solutions with certified accessibility experts, which allows our customers to achieve a higher level of compliance than competitors relying solely on the reach of automation. Our technology publishes more than one billion remediations daily, and our solution is trusted by some of the largest and most influential companies in the world, including ADP, Tommy Hilfiger, 360 Media, Samsung, Darden, Landry's and more. Government agencies, from the federal level down to the local level, have also integrated our software in their digital platforms, including the Federal Communications Commission and the Social Security Administration.\nWe manage customers through two primary channels, Enterprise and Partner and Marketplace. Enterprise channel consists of our larger customers and organizations, including those with non-platform custom websites, who generally engage directly with AudioEye sales personnel for custom pricing and solutions. This channel also includes federal, state and local government agencies. The Partner and Marketplace channel consists of our CMS partners, platform & agency partners, authorized resellers and the Marketplace. This channel serves small and medium sized businesses that are on a partner or reseller’s web-hosting platform or that purchase an AudioEye solution from our Marketplace. We saw strong growth in both our Enterprise and Partner and Marketplace channels in 2020, with revenue growth in each channel of 48% and 177%, respectively, in 2020 compared to 2019. Our Partner and Marketplace revenue growth was due to a significant number of additional customer implementations that each Partner offers, and represented about 57% of Monthly Recurring Revenue (“MRR”) contribution at the end of 2020. We define MRR as the sum of (i) for our Enterprise channel, the total of the average monthly recurring fee amount under each active paid contract at the date of determination, plus (ii) for our Partner and Marketplace channel, the recognized recurring monthly fee amount for all paying customers at the date of determination, in each case, assuming no changes to the subscription and without taking into account any usage above the subscription or recurring revenue base, if any, that may be applicable to such subscription. This determination includes both annual and monthly contracts for recurring products. Some of our contracts are cancelable, which may impact future MRR. MRR excludes revenue from our PDF remediation services and Mobile App report business. As of December 31, 2020, MRR was approximately $1.9 million, which represented an increase of 54% year-over-year.\nResults of Operations\nOur financial statements are stated in United States Dollars and are prepared in accordance with United States Generally Accepted Accounting Principles (“U.S. GAAP” or “GAAP”). The discussion of the results of our operations compares the year ended December 31, 2020 with the year ended December 31, 2019. Our results of operations in these periods are not necessarily indicative of the results which may be expected for any subsequent period. Due to rounding, numbers presented throughout this document may not add up precisely to the totals provided and percentages may not precisely reflect the absolute figures.\nIn 2020, the Company amended the categorization of certain expenses to conform to changes incurred in its operations, including internal department structure changes, employee movements, intellectual property and technology related expenses, and facility expenses. For the purposes of comparability, the company reclassified prior period results to conform with our current period presentation.\nYear ended\nDecember 31,\nFavorable / (Unfavorable)\nChange\n(in thousands) $ %\nRevenue $ 20,475 $ 10,765 $ 9,710 90 %\nCost of revenue 5,961 4,406 1,555 35 %\nGross profit 14,514 6,359 8,155 128 %\nOperating expenses:\nSelling and marketing 8,472 5,708 (2,764 ) (48 )%\nResearch and development 1,230 (594 ) (93 )%\nGeneral and administrative 11,945 7,833 (4,112 ) (52 )%\nTotal operating expenses 21,647 14,177 (7,470 ) (53 )%\nOperating loss (7,133 ) (7,818 ) 9 %\nOther income (expense):\nChange in fair value of warrant liability 21 %\nInterest expense (145 ) (76 ) (69 ) (91 )%\nOther income (expense) - (12 ) (100 )%\nTotal other income (expense) (25 ) (60 ) (171 )%\nNet loss $ (7,158 ) $ (7,783 ) $ 625 8 %\nRevenue\nThe following table presents our revenues disaggregated by sales channel:\nYear ended December 31,\nFavorable / (Unfavorable) Change\n(in thousands)\n$\n%\nEnterprise\n$ 10,735\n$ 7,252\n$ 3,483\n%\nPartner and Marketplace\n9,740\n3,513\n6,227\n%\nTotal revenues\n$ 20,475\n$ 10,765\n$ 9,710\n%\nEnterprise channel consists of our larger customers and organizations, including those with non-platform custom websites, who generally engage directly with AudioEye sales personnel for custom pricing and solutions. This channel also includes federal, state and local government agencies.\nPartner and Marketplace channel consists of our CMS partners, platform & agency partners, authorized resellers and the Marketplace. This channel serves small & medium sized businesses that are on a partner or reseller’s web-hosting platform or that purchase an AudioEye solution from our Marketplace.\nFor the year ended December 31, 2020, total revenue increased by 90%, over the prior year. We experienced revenue growth in both of our sales channels. The increase in Enterprise channel revenue was driven by growth in our managed solutions and the benefit from increased contribution by our PDF remediation services and Mobile App report business. The increase in Partner and Marketplace channel revenue was a result of our continued focus on highly transactional industry verticals to achieve higher penetration within our existing partnerships.\nCost of Revenue and Gross Profit\nYear ended December 31,\nFavorable / (Unfavorable) Change\n(in thousands)\n$\n%\nRevenue\n$ 20,475\n$ 10,765\n$ 9,710\n%\nCost of sales\n5,961\n4,406\n(1,555 )\n(35 )%\nGross profit\n$ 14,514\n$ 6,359\n$ 8,155\n%\nCost of revenue consists primarily of compensation and related benefits costs for our customer experience team, as well as a portion of our technology operations team that supports the delivery of our services, fees paid to our managed hosting and other third-party service providers, amortization of capitalized software development costs and patent costs, and allocated overhead costs.\nFor the year ended December 31, 2020, cost of sales increased by 35% over the prior year. The increase in cost of sales was primarily due to additions to our employee and contractor headcount to support the increase in revenue and delivery of our services, as well as an increase in amortization of capitalized software development costs.\nFor the year ended December 31, 2020, gross profit increased by 128% over the prior year. The increase in gross profit was a result of increased revenue and continued improvement in technology driven efficiencies as we scale, offset in part by higher costs to support the revenue growth.\nSelling and Marketing Expenses\nYear ended December 31, Favorable / (Unfavorable) Change\n(in thousands) $ %\nSelling and marketing $ 8,472 $ 5,708 $ (2,764 ) (48 )%\nSelling and marketing expenses consist primarily of compensation and benefits related to our sales and marketing staff, as well as third-party advertising and marketing expenses.\nFor the year ended December 31, 2020, selling and marketing expenses increased by 48% over the prior year. The increase in selling and marketing expenses resulted primarily from an increase in personnel costs driven by focused talent acquisition, higher commission costs, higher digital and third-party marketing agency expenses, and higher media spend as we continued to expand our business.\nResearch and Development\nYear ended December 31, Favorable / (Unfavorable) Change\n(in thousands) $ %\nResearch and development expense $ 1,230 $ 636 $ (594 ) (93 )%\nPlus: Capitalized research and development cost 1,157 (850 ) (277 )%\nTotal research and development cost $ 2,387 $ (1,444 ) (153 )%\nResearch and development (“R&D”) expenses consist primarily of compensation and related benefits, independent contractor costs, and an allocated portion of general overhead costs, including occupancy costs related to our employees involved in research and development activities. Total research and development cost includes the amount of research and development expense reported within operating expenses as well as development cost that was capitalized during the fiscal period.\nFor the year ended December 31, 2020, research and development expenses increased by 93% over the prior year. This was driven by increased investment in Machine Learning and non-capitalizable R&D efforts related to our new product and platform development as we test and learn new capabilities. For the year ended December 31, 2020, capitalized research and development cost increased 277% over the prior year, driven by increased investment in our platforms and products as we continue to improve our technology and product delivery to help our customers and gain efficiencies as we scale. Total research and development cost, which includes both R&D expenses and capitalized R&D costs, increased 153% from 2019 to 2020.\nGeneral and Administrative Expenses\nYear ended December 31, Favorable / (Unfavorable)Change\n(in thousands) $ %\nGeneral and administrative $ 11,945 $ 7,833 $ (4,112 ) (52 )%\nGeneral and administrative expenses consist primarily of compensation and benefits related to our executives, corporate support functions and administrative staff, general corporate expenses including legal fees, and occupancy costs.\nFor the year ended December 31, 2020, general and administrative expenses increased by 52% over the prior year. The increase in general and administrative expenses was due primarily to higher compensation costs, including stock-based compensation expense, driven by increased executive headcount to support the Company’s growth, systems infrastructure improvement and legal expenses towards corporate governance, litigation and intellectual property defense. In addition, in the third quarter of 2020, we incurred $360,000 in severance expense associated with our strategic decision to move our technology center from Atlanta, Georgia, to Portland, Oregon.\nChange in Fair Value of Warrant Liability\nYear ended\nDecember 31, Favorable / (Unfavorable)Change\n(in thousands) $ %\nChange in fair value of warrant liability $ 120 $ 99 $ 21 21 %\nChange in fair value of warrant liability consists of fair value adjustments associated with warrants to purchase 146,667 shares of the Company’s common stock, which were issued in consideration for the credit facility extended by Sero Capital in the third quarter of 2019. In the third quarter of 2020, the warrants were fully exercised and the related liability was extinguished, which led to a $120,000 gain being recognized for the year ended December 31, 2020.\nInterest Expense\nYear ended\nDecember 31, Favorable / (Unfavorable) Change\n(in thousands) $ %\nInterest expense $ 145 $ 76 $ (69 ) (91 )%\nInterest expense consists primarily of amortization of debt issuance costs from our line of credit, and interest on our PPP Loan and finance lease liabilities. The increase in interest expense for the year ended December 31, 2020 was attributable to the amortization of deferred issuance costs associated with our line of credit, which was not drawn upon through its one-year term which expired in August 2020.\nOther Key Operating Metrics\nWe consider monthly recurring revenue (“MRR”) as a key operating metric and a key indicator of our overall business. We also use MRR as (i) one of the primary methods for planning and forecasting overall expectations and for evaluating, on at least a quarterly and annual basis, actual results against such expectations; and (ii) as a performance metric for certain executive stock-based compensation awards.\nWe define MRR as the sum of (i) for our Enterprise channel, the total of the average monthly recurring fee amount under each active paid contract at the date of determination, plus (ii) for our Partner and Marketplace channel, the recognized monthly fee amount for all paying customers at the date of determination, in each case, assuming no changes to the subscription and without taking into account any usage above the subscription or recurring revenue base, if any, that may be applicable to such subscription. This determination includes both annual and monthly contracts for recurring products. Some of our contracts are cancelable, which may impact future MRR. MRR excludes revenue from our PDF remediation services business and Mobile App report business. As of December 31, 2020, MRR was about $1.9 million, which represents an increase of 54% year-over-year driven primarily by our Partner and Marketplace channel.\nUse of Non-GAAP Financial Measures\nFrom time to time, we review adjusted financial measures that assist us in comparing our operating performance consistently over time, as such measures remove the impact of certain items, as applicable, such as our capital structure (primarily interest charges), items outside the control of the management team (taxes), and expenses that do not relate to our core operations, including transaction-related expenses and other costs that are expected to be non-recurring, such as severance related to strategic shift. In order to provide investors with greater insight, and allow for a more comprehensive understanding of the information used in our financial and operational decision-making, the Company has supplemented the Financial Statements presented on a GAAP basis in this Annual Report on Form 10-K with the following non-GAAP financial measures: Non-GAAP earnings (loss) and Non-GAAP earnings (loss) per diluted share.\nThese non-GAAP financial measures have limitations as analytical tools and should not be considered in isolation or as a substitute for analysis of Company results as reported under GAAP. The Company compensates for such limitations by relying primarily on our GAAP results and using non-GAAP financial measures only as supplemental data. We also provide a reconciliation of non-GAAP to GAAP measures used. Investors are encouraged to carefully review this reconciliation. In addition, because these non-GAAP measures are not measures of financial performance under GAAP and are susceptible to varying calculations, these measures, as defined by us, may differ from and may not be comparable to similarly titled measures used by other companies.\nNon-GAAP Earnings (Loss) and Non-GAAP Earnings (Loss) per Diluted Share\nWe define: (i) Non-GAAP earnings (loss) as net income (loss), less non-cash valuation adjustments to liabilities, plus interest expense, plus stock-based compensation expense and plus certain severance expense; and (ii) Non-GAAP earnings (loss) per diluted share as net income (loss) per diluted common share, less non-cash valuation adjustments to liabilities, plus interest expense, plus stock-based compensation expense and plus certain severance expense, each on a per share basis. Non-GAAP earnings per diluted share would include incremental shares in the share count that are considered anti-dilutive in a GAAP net loss position. However, no incremental shares apply when there is a Non-GAAP loss per diluted share, as is the case for the periods presented in this Annual Report on Form 10-K.\nNon-GAAP earnings (loss) and Non-GAAP earnings (loss) per diluted share are used to facilitate a comparison of our operating performance on a consistent basis from period to period and provide for a more complete understanding of factors and trends affecting our business than GAAP measures alone. All of the items adjusted in the Non-GAAP earnings (loss) to net loss and the related per share calculations are either recurring non-cash items, or items that management does not consider in assessing our on-going operating performance. In the case of the non-cash items, such as stock-based compensation expense and valuation adjustments to assets and liabilities, management believes that investors may find it useful to assess our comparative operating performance because the measures without such items are expected to be less susceptible to variances in actual performance resulting from expenses that do not relate to our core operations and are more reflective of other factors that affect operating performance. In the case of items that do not relate to our core operations, management believes that investors may find it useful to assess our operating performance if the measures are presented without these items because their financial impact does not reflect ongoing operating performance.\nNon-GAAP earnings (loss) is not a measure of liquidity under GAAP, or otherwise, and is not an alternative to cash flow from continuing operating activities, despite the advantages regarding the use and analysis of these measures as mentioned above. Non-GAAP earnings (loss) and Non-GAAP earnings (loss) per diluted share, as disclosed in this Annual Report on Form 10-K, have limitations as analytical tools, and you should not consider these measures in isolation or as a substitute for analysis of our results as reported under GAAP; nor are these measures intended to be measures of liquidity or free cash flow for our discretionary use.\nTo properly and prudently evaluate our business, we encourage readers to review the GAAP financial statements included elsewhere in this Annual Report on Form 10-K, and not rely on any single financial measure to evaluate our business. The following table sets forth reconciliations of Non-GAAP loss to net loss, the most directly comparable GAAP-based measure, as well as Non-GAAP loss per diluted share to net loss per diluted share, the most directly comparable GAAP-based measure.\nYear ended December 31,\n(in thousands, except per share data)\nNon-GAAP Earnings (Loss) Reconciliation\nNet loss (GAAP) $ (7,158 ) $ (7,783 )\nNon-cash valuation adjustments to liabilities (120 ) (99 )\nInterest expense\nStock-based compensation expense 4,138 1,216\nSeverance expense (1) -\nNon-GAAP loss $ (2,635 ) $ (6,590 )\nNon-GAAP Earnings (Loss) per Diluted Share Reconciliation\nNet loss per common share (GAAP) - diluted $ (0.77 ) $ (0.97 )\nNon-cash valuation adjustments to liabilities (0.01 ) (0.01 )\nInterest expense 0.02 0.01\nStock-based compensation expense 0.44 0.16\nSeverance expense (1) 0.04 -\nNon-GAAP loss per diluted share (2) $ (0.28 ) $ (0.81 )\nDiluted weighted average shares (3) 9,313 8,107\n(1) Represents severance expense associated with the move of our technology center to Portland, Oregon, and is exclusive of accrued vacation paid upon termination of employment.\n(2) Non-GAAP earnings per adjusted diluted share for our common stock is computed using the more dilutive of the two-class method or the if-converted method.\n(3) The number of diluted weighted average shares used for this calculation is the same as the weighted average common shares outstanding share count when the Company reports a GAAP and non-GAAP net loss.\nLiquidity and Capital Resources\nWorking Capital\nAs of December 31, 2020, we had $9.1 million in cash and working capital of $5.6 million. The increase in working capital in 2020 was primarily a result of a public offering whereby the Company raised net proceeds of $7.8 million by issuing 473,239 shares of its common stock, as well as $880,000 received from a cash exercise of warrants by Sero Capital. We intend to use the net proceeds from this offering for working capital and general corporate purposes.\nIn addition, on February 11, 2021, we entered into an At Market Issuance Sales Agreement (the “Sales Agreement”) with B. Riley Securities, Inc. (“Agent”) under which the Company may offer and sell, from time to time at its sole discretion, shares of its common stock to or through the Agent as its sales agent, having an aggregate offering price of up to $30 million. As of March 8, 2021, we had sold a total of 378,108 shares of common stock under this Sales Agreement for total proceeds of approximately $14.1 million, net of estimated transaction costs.\nThese capital raises contributed to the improvement in our cash and working capital positions, and we believe that the Company has sufficient liquidity to continue as a going concern through the next twelve months.\nWhile the Company has been successful in raising capital, there is no assurance that it will be successful at raising additional capital in the future. Additionally, if the Company’s plans are not achieved and/or if significant unanticipated events occur, the Company may have to further modify its business plan, which may require us to raise additional capital or reduce expenses.\nAt December 31,\n(in thousands)\nCurrent assets $ 14,631 $ 5,608\nCurrent liabilities (9,015 ) (6,726 )\nWorking capital (deficit) $ 5,616 $ (1,118 )\nCash Flows\nYear ended December 31,\n(in thousands)\nNet cash used in operating activities $ (1,906 ) $ (5,617 )\nNet cash used in investing activities (1,298 ) (363 )\nNet cash provided by financing activities 10,327 2,210\nNet increase (decrease) in cash $ 7,123 $ (3,770 )\nFor the year ended December 31, 2020, in relation to the prior year, cash used in operating activities decreased primarily due to an increase in our paying customer base leading to our revenue growth. The effect of higher collections from this expanded customer base was partially offset by the increased personnel and sales and marketing costs, primarily driven by the increase in headcount and related expenses and higher consulting and third-party costs to support the Company’s growth. In addition, the Company paid $360,000 in severance, as well as $66,000 in accrued vacation, associated with the relocation of our technology center to Portland, Oregon, as part of our strategic plan to build scalable technology to improve efficiency.\nFor the year ended December 31, 2020, in relation to the prior year, cash used in investing activities increased primarily due to investment in new technologies for enhancements to our legacy solutions, product development, as well as patents costs to protect our intellectual property and solidify our portfolio.\nFor the year ended December 31, 2020, in relation to the prior year, cash provided by financing activities increased primarily due to net proceeds of $7.8 million that we received from a public offering in the third quarter of 2020, whereby we issued 473,239 shares of our common stock. We intend to use the proceeds from this offering for working capital and general corporate purposes, including the implementation of our business plan and growth of current operations. In addition, in the second quarter of 2020, we obtained a $1.3 million PPP Loan. The increase in cash from financing activities due to the capital raise and PPP Loan was partially offset by a $1 million reduction in proceeds from the exercise of options and warrants, which totaled $1.3 million and $2.3 million in the years ended December 31, 2020 and 2019, respectively.\nOff-Balance Sheet Arrangements\nWe have no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to stockholders.\nCritical Accounting Policies\nThe discussion and analysis of our financial condition and results of operations are based upon our financial statements, which have been prepared in accordance with the accounting principles generally accepted in the United States. Preparing financial statements requires our management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue and expenses. These estimates and assumptions are affected by our management’s application of accounting policies.\nThe following is a summary of the Company’s most critical accounting policies. Refer to Note 3 - Significant Accounting Policies to our financial statements included in Part II, Item 8 for a complete discussion of the significant accounting policies and methods used in the preparation of our financial statements.\nRevenue Recognition\nThe Company derives revenue primarily from the sale of internally-developed software by a software as a service (“SaaS”) delivery model, through our direct sales force or through our Partner and Marketplace channel. SaaS fees include support and maintenance. The Company also derives revenue from PDF remediation and Mobile App report services. The Company recognizes revenue when delivery of the promised goods or services is transferred to its customers, in an amount that reflects the consideration that the Company expects to be entitled to in exchange for those goods or services.\nPerformance obligations are the unit of accounting for revenue recognition and generally represent the distinct goods or services that are promised to the customer. If we determine that we have not satisfied a performance obligation, we will defer recognition of the revenue until the performance obligation is deemed to be satisfied. SaaS agreements are generally non-cancelable, although clients typically have the right to terminate their contracts for cause if we fail to perform material obligations.\nOur SaaS (also referred to as “subscription”) revenue is recognized on a ratable basis over the contractual subscription term of the arrangement beginning on the date that our service is made available to the customer. Certain SaaS fees are invoiced in advance on an annual, semi-annual, or quarterly basis. Any funds received for services not provided yet are held in deferred revenue and are recorded as revenue when the related performance obligations have been satisfied.\nNon-subscription revenue consists of PDF remediation and Mobile App report services and is recognized upon delivery. Consideration payable under these arrangements is based on usage.\nRefer to Note 3 - Significant Accounting Policies to our financial statements included in Part II, Item 8 for additional information regarding our revenue recognition policies.\nAllowance for Doubtful Accounts\nAccounts receivables are comprised of amounts owed the Company for solutions and services purchased. Contracts with individual clients and resellers determine when receivables are due and payable. In determining the allowances for doubtful accounts, the unpaid receivables are reviewed periodically to determine the payment status based upon the most currently available information. During these periodic reviews, the Company determines the required allowances for doubtful accounts for estimated losses resulting from the unwillingness or inability of its clients or resellers to make required payments.\nStock-Based Compensation\nThe Company measures the cost of services received in exchange for an award of equity instruments based on the fair value of the award measured on the grant date. The fair value amount is then recognized over the requisite vesting period during which services are required to be provided in exchange for the award.\nThe fair value of options and warrants awards is measured on the grant date using a Black-Scholes option pricing model. We estimate the fair value of restricted stock unit awards with time- or performance-based vesting using the value of our common stock on the date of grant. We estimate the fair value of restricted stock units with market-based conditions using a Monte Carlo simulation model on the date of grant.\nStock-based compensation expense is recorded by the Company in the same expense classifications in the statements of operations as if such amounts were paid in cash. Refer to Note 3 - Significant Accounting Policies to our financial statements included in Part II, Item 8 for additional information regarding our stock-based compensation.\nCapitalization of Software Development Costs\nIn accordance with ASC 350-40, the Company capitalizes certain computer software and software development costs incurred in connection with developing or obtaining computer software for internal use when both the preliminary project stage is completed, and it is probable that the software will be used as intended. Capitalized software costs include only (i) external direct costs of materials and services utilized in developing or obtaining computer software and (ii) compensation and related benefits for employees who are directly associated with the software project. Capitalized software costs are included in intangible assets on our balance sheet and amortized on a straight-line basis when placed into service over the estimated useful lives of the software. Amortization expense is included in cost of revenue on the statements of operations.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nNot applicable.",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nOur Financial Statements begin on page of this Annual Report on Form 10-K and are incorporated herein by reference.",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNot applicable.",
    "item_9A": "Item 9A. Controls and Procedures\nConclusions of Management Regarding Effectiveness of Disclosure Controls and Procedures\nThe Company maintains disclosure controls and procedures that are designed to ensure that there is reasonable assurance that the information required to be disclosed in the Company’s reports under the Securities Exchange Act of 1934, as amended (the “Exchange Act”), is recorded, processed, summarized and reported within the time periods specified in the SEC’s rules and forms, and that such information is accumulated and communicated to the Company’s management, including its Interim Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure based on the definition of “disclosure controls and procedures” in Exchange Act Rules 13a-15(e) and 15d-15(e). In designing and evaluating the disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and management necessarily was required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures. In addition, projections of any evaluation of effectiveness of our disclosure controls and procedures to future periods are subject to the risk that controls or procedures may become inadequate because of changes in conditions, or that the degree of compliance with the controls or procedures may deteriorate.\nAs of the end of the period covered by this report, an evaluation was performed under the supervision and with the participation of the Company’s senior management, including the Interim Chief Executive Officer (principal executive officer) and Chief Financial Officer (principal financial officer), of the effectiveness of the design and operation of the Company’s disclosure controls and procedures to provide reasonable assurance of achieving the desired objectives of the disclosure controls and procedures. In light of the material weaknesses noted below, our Interim Chief Executive Officer and Chief Financial Officer have concluded that, as of the end of the period covered by this report, our disclosure controls and procedures were not effective.\nThe Company assessed the material weaknesses’ impact to the financial statements to ensure they were prepared in accordance with U.S. generally accepted accounting principles and present fairly the financial results of operations as of and for the year ended December 31, 2020. Management concluded that the financial statements included in this Form 10-K present fairly, in all material aspects, the Company’s financial position, results of operations and cash flows for the periods presented.\nManagement’s Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting for the Company and all related information appearing in our Annual Report on Form 10-K. Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America. Internal control over financial reporting includes those policies and procedures that:\n1. pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of our assets;\n2. provide reasonable assurance that the transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with the authorization of management and/or of our Board of Directors; and\n3. provide reasonable assurance regarding the prevention or timely detection of any unauthorized acquisition, use or disposition of our assets that could have a material effect on our financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness in future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. Our management (with the participation of our Interim Chief Executive Officer and our Chief Financial Officer) conducted an evaluation of the effectiveness of our internal control over financial reporting as of December 31, 2020 using the criteria established in Internal Control - 2013 Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nA material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the Company’s annual or interim financial statements will not be prevented or detected on a timely basis.\nIn connection with management’s assessment of our internal control over financial reporting, management has identified the following deficiencies that constituted material weaknesses in our internal control over financial reporting as of December 31, 2020:\n1. A lack of segregation of duties.\n2. A lack of formal policies that provide for multiple levels of supervision and reviews.\nBecause of these material weaknesses, management has concluded that our internal control over financial reporting was not effective as of December 31, 2020. This annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Management’s report is not subject to attestation by our registered, public accounting firm pursuant to the rules of the Securities and Exchange Commission that permit us to provide only management’s report in this annual report.\nManagement’s Internal Control Remediation Initiatives\nAs part of our efforts to continuously improve our finance and accounting function and to remediate the material weaknesses that existed in our internal control over financial reporting and our disclosure controls and procedures, we have developed a remediation plan (the “Remediation Plan”) pursuant to which we have implemented, or plan to implement over the next few quarters, a number of measures. The Remediation Plan, among other things, includes the following:\n· Staffing: We hired a new Controller and an accountant and have introduced new levels of reviews. We intend to add another member to our accounting team to allow for further increased segregation of duties and multiple level of reviews.\n· Systems: We have implemented a cloud-based accounting software and are currently optimizing its usage, and plan on investing in few software solutions to enhance our processes and documentation in critical areas such as stock-based compensation.\n· Policies and procedures: In addition to continue to document and implement formal policies and procedures to further enhance the controls over financial reporting, we plan to engage internal control consultants to assist in improving the design and documentation of our internal controls of financial reporting, as well as testing their operating effectiveness.\nWe believe that actions taken to date have improved our internal control over financial reporting, but we have not completed all corrective processes and procedures discussed above. The Remediation Plan, however, may not be sufficient to remedy the material weaknesses. Further, the material weaknesses will not be considered remediated until the applicable controls operate for a sufficient period of time and management is able to conclude, through testing, that these controls are operating effectively. We will continue to monitor the effectiveness of our internal control over financial reporting and implement any new resources and policies deemed necessary by management to ensure that our financial statements continue to be fairly stated in all material respects.\nChanges in Internal Control over Financial Reporting\nDuring the quarter ended December 31, 2020, there were no changes to our internal control over financial reporting that have materially affected, or that are reasonably likely to materially affect, our internal control over financial reporting, except as disclosed above.",
    "item_9B": "Item 9B. Other Information\nNot applicable.\nPART III",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nThe information required by this item is hereby incorporated by reference to the definitive proxy statement for our 2021 Annual Meeting of Stockholders, which proxy statement is anticipated to be filed with the Securities and Exchange Commission within 120 days after December 31, 2020.\nWe have adopted a Code of Business Conduct and Ethics, including provisions enumerated in Item 406 of Regulation S-K (the “finance code of ethics”). The finance code of ethics is publicly available in the Code of Business Conduct and Ethics on the Governance Documents section of our website, which may be accessed from our homepage at www.audioeye.com. If we make any substantive amendments to the finance code of ethics or grant any waiver, including any implicit waiver, from a provision of the code to our Chief Executive Officer, Chief Financial Officer, or Chief Accounting Officer and Corporate Controller, we will disclose the nature of that amendment or that waiver in the Governance Documents section of our website.",
    "item_11": "Item 11. Executive Compensation\nThe information required by this item is hereby incorporated by reference to the definitive proxy statement for our 2021 Annual Meeting of Stockholders, which proxy statement is anticipated to be filed with the Securities and Exchange Commission within 120 days after December 31, 2020.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners, Management and Related Stockholder Matters\nThe information required by this item is hereby incorporated by reference to the definitive proxy statement for our 2021 Annual Meeting of Stockholders, which proxy statement is anticipated to be filed with the Securities and Exchange Commission within 120 days after December 31, 2020.",
    "item_13": "Item 13. Certain Relationships and Related Transactions and Director Independence\nThe information required by this item is hereby incorporated by reference to the definitive proxy statement for our 2021 Annual Meeting of Stockholders, which proxy statement is anticipated to be filed with the Securities and Exchange Commission within 120 days after December 31, 2020.",
    "item_14": "Item 14.  Principal Accounting Fees and Services\nThe information required by this item is hereby incorporated by reference to the definitive proxy statement for our 2021 Annual Meeting of Stockholders, which proxy statement is anticipated to be filed with the Securities and Exchange Commission within 120 days after December 31, 2020.\nPART IV",
    "item_15": "Item 15. Exhibits, Financial Statement Schedules\na) The following documents are filed as part of this report:\n(1) Financial Statements - See Index to Financial Statements on page below and the financial pages that follow.\n(2) Financial Statements Schedules - Schedule II - Valuation and Qualifying Accounts.\nAdditions\nDescription Balance at Beginning of Period Charged to\nCosts and Expenses Charged\nto Other\nAccounts Deductions Balance at\nEnd of Period\n(in thousands)\nYear ended December 31, 2020:\nAllowance for doubtful accounts $ 63 $ 128 $ - $ (112 ) $ 79\nYear ended December 31, 2019:\nAllowance for doubtful accounts $ - $ 13 $ 50 $ - $ 63\nAll other schedules are omitted, since the required information is not applicable or is not present in amounts sufficient to require submission of the schedule, or because the information required is included in the financial statements and notes thereto.\n(3) Exhibits - The following exhibits are either filed herewith or have previously been filed with the Securities and Exchange Commission and are referred to and incorporated herein by reference to such filings:\nExhibit No.\nDescription\n3.1\nCertificate of Incorporation of AudioEye, Inc., dated as of May 20, 2005 (1)\n3.2\nCertificate of Amendment of the Certificate of Incorporation of AudioEye, Inc., dated as of February 12, 2010 (1)\n3.3\nCertificate of Amendment of the Certificate of Incorporation of AudioEye, Inc., dated as of August 16, 2012 (2)\n3.4\nCertificate of Amendment of the Certificate of Incorporation of AudioEye, Inc., dated as of March 26, 2014 (6)\n3.5\nCertificate of Amendment of the Certificate of Incorporation of AudioEye, Inc., dated as of August 1, 2018 (13)\n3.6\nCertificate of Designations - Series A Convertible Preferred Stock (18)\n3.7\nBy-laws of AudioEye, Inc., as amended (18)\n3.8\nAmendment No. 1 to By-laws of AudioEye, Inc. (20)\n3.9\nAmended and Restated By-laws as of August 13, 2020 (21)\n4.1\nForm of Warrant dated as of April 18, 2016 (10)\n4.2\nForm of Omnibus Amendment to Secured Convertible Promissory Notes dated as of April 18, 2016 (10)\n4.3\nForm of First Amendment to Common Stock Warrant dated as of April 18, 2016 (10)\n4.4\nForm of Registration Rights Agreement between AudioEye, Inc. and each Purchaser dated as of August 6, 2018 (13)\n4.5\nForm of Warrant dated as of December 19, 2016 (11)\n4.6\nDescription of Registered Securities (18)\n10.1**\nAudioEye, Inc. 2012 Incentive Compensation Plan effective December 19, 2012 (3)\n10.2**\nAudioEye, Inc. 2013 Incentive Compensation Plan effective August 20, 2013 (4)\n10.3**\nAudioEye, Inc. 2014 Incentive Compensation Plan effective January 27, 2014 (5)\n10.4**\nAudioEye, Inc. 2015 Incentive Compensation Plan effective September 5, 2014 (7)\n10.5**\nAudioEye, Inc. 2016 Incentive Compensation Plan effective December 17, 2015 (14)\n10.6**\nForm of Restricted Stock Unit Award Agreements for grants under the AudioEye, Inc. 2012, 2013, 2014, 2015 and 2016 Incentive Compensation Plans (14)\n10.7**\nForm of Performance Option Agreement for grants under the AudioEye, Inc. 2012, 2013, 2014, 2015 and 2016 Incentive Compensation Plans (14)\n10.8**\nForm of Stock Option Agreement for grants under the AudioEye, Inc. 2012, 2013, 2014, 2015 and 2016 Incentive Compensation Plans (14)\n10.9**\nAudioEye, Inc. 2019 Equity Incentive Plan (as amended and restated on May 18, 2020) (23)\n10.10**\nAudioEye, Inc. 2019 Equity Incentive Plan - Form of Incentive Stock Option Agreement (15)\n10.11**\nAudioEye, Inc. 2019 Equity Incentive Plan - Form of Nonqualified Stock Option Agreement (15)\n10.12**\nAudioEye, Inc. 2019 Equity Incentive Plan - Form of Restricted Stock Unit Agreement (15)\n10.13**\nAudioEye, Inc. 2020 Equity Incentive Plan (25)\n10.14**\nForm of Restricted Stock Unit Award Agreement (Time-Based) under the AudioEye, Inc. 2020 Equity Incentive Plan (25)\n10.15**\nForm of Restricted Stock Unit Award Agreement (Non-Employee Director Awards) under the AudioEye, Inc. 2020 Equity Incentive Plan (25)\n10.16**\nForm of Performance Stock Unit Award Agreement (Performance-Based) under the AudioEye, Inc. 2020 Equity Incentive Plan (25)\n10.17**\nForm of Incentive Stock Option Award Agreement under the AudioEye, Inc. 2020 Equity Incentive Plan (25)\n10.18**\nForm of Non-Qualified Stock Option Award Agreement under the AudioEye, Inc. 2020 Equity Incentive Plan (25)\n10.19**\nForm of Other Stock-Based Award Agreement under the AudioEye, Inc. 2020 Equity Incentive Plan (25)\n10.20**\nExecutive Employment Agreement dated July 1, 2015 between Dr. Carr Bettis and AudioEye, Inc. (8)\n10.21**\nExecutive Employment Agreement dated May 10, 2019 between Sachin Barot and AudioEye, Inc. (15)\n10.22**\nExecutive Employment Agreement dated February 25, 2020 between Heath Thompson and AudioEye, Inc. (19)\n10.23**\nExecutive Employment Agreement dated August 13, 2020 between Dominic Varacalli and AudioEye, Inc. (24)\n10.24**\nEmployment Agreement dated August 20, 2020 between David Moradi and AudioEye, Inc. (22)\n10.25**\nNotice of Award of Performance Shares to David Moradi dated August 20, 2020 under the AudioEye, Inc. 2019 Equity Incentive Plan (22)\n10.26\nNote and Warrant Purchase Agreement dated October 9, 2015 between investors and AudioEye, Inc. (9)\n10.27\nFirst Amendment to Note and Warrant Purchase Agreement dated April 18, 2016 between investors and AudioEye, Inc. (10)\n10.28\nSecond Amendment to Note and Warrant Purchase Agreement dated October 11, 2017 between investors and AudioEye. Inc (12)\n10.29\nCommon Stock and Warrant Purchase Agreement dated April 18, 2016 between investors and AudioEye, Inc. (10)\n10.30\nForm of Common Stock and Warrant Purchase Agreement dated as of December 19, 2016 (11)\n10.31\nForm of Securities Purchase Agreement by and between AudioEye, Inc. and each Purchaser dated August 6, 2018 (13)\n10.32\nSchedule of Certain Parties to Securities Purchase Agreements and Registration Rights Agreements dated as of August 6, 2018 (14)\n10.33**\nForm of Omnibus Amendment to Common Stock Warrants dated as of August 14, 2019 (16)\n10.34\nLetter Agreement dated as of August 14, 2019 between the Company and Sero Capital LLC (16)\n10.35\nLoan Agreement dated as of August 14, 2019 between the Company and Sero Capital LLC (16)\n10.36**\nForm of AudioEye, Inc. Indemnification Agreement (Directors and Executive Officers) (17)\n10.37\nSeverance Agreement and General Release of Claims dated January 17, 2020 between the Company and Todd Bankofier (18)\n10.38*\nNote Agreement dated April 15, 2020 between Liberty Capital Bank and AudioEye, Inc.\n14.1\nCode of Business Conduct and Ethics (14)\n23.1*\nConsent of MaloneBailey LLP, Independent Registered Public Accounting Firm\n24.1*\nPower of Attorney (included in signature page)\n31.1*\nCertification of the Principal Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2*\nCertification of the Principal Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1#\nCertification of the Principal Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2#\nCertification of the Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n99.1\nResolutions adopted by the Board setting forth the information with respect to the Ratification required under Section 204 of the Delaware General Corporation Law (18)\n101.INS*\nXBRL Instance Document\n101.SCH*\nXBRL Taxonomy Extension Schema Document\n101.CAL*\nXBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF*\nXBRL Taxonomy Extension Definition Linkbase Document\n101.LAB*\nXBRL Taxonomy Extension Label Linkbase Document\n101.PRE*\nXBRL Taxonomy Extension Presentation Linkbase Document\n*\nFiled herewith.\n**\nConstitutes a management contract or compensatory plan or arrangement.\n#\nFurnished herewith.\n(1)\nIncorporated by reference to Form S-1, filed with the U.S. Securities and Exchange Commission (the “SEC”) on October 21, 2011 (File No. 333-177463).\n(2)\nIncorporated by reference to Form S-1/A, filed with the SEC on October 1, 2012 (File No. 333-177463).\n(3)\nIncorporated by reference to Form S-1/A, filed with the SEC on January 11, 2013 (File No. 333-177463).\n(4)\nIncorporated by reference to Form S-8, filed with the SEC on August 28, 2013 (File No. 333-177463).\n(5)\nIncorporated by reference to Form S-1/A, filed with the SEC on February 4, 2014 (File No. 333-177463).\n(6)\nIncorporated by reference to Form 10-K, filed with the SEC on March 31, 2014.\n(7)\nIncorporated by reference to Form 10-Q, filed with the SEC on November 7, 2014.\n(8)\nIncorporated by reference to Form 8-K, filed with the SEC on July 8, 2015.\n(9)\nIncorporated by reference to Form 8-K, filed with the SEC on October 16, 2015.\n(10)\nIncorporated by reference to Form 8-K, filed with the SEC on April 19, 2016.\n(11)\nIncorporated by reference to Form 8-K, filed with the SEC on December 22, 2016.\n(12)\nIncorporated by reference to Form 8-K, filed with the SEC on October 16, 2017.\n(13)\nIncorporated by reference to Form 8-K, filed with the SEC on August 7, 2018.\n(14)\nIncorporated by reference to Form 10-K, filed with the SEC on March 27, 2019.\n(15)\nIncorporated by reference to Form 8-K, filed with the SEC on May 14, 2019.\n(16)\nIncorporated by reference to Form 8-K, filed with the SEC on August 16, 2019.\n(17)\nIncorporated by reference to Form 8-K, filed with the SEC on December 16, 2019.\n(18)\nIncorporated by reference to Form 10-K, filed with the SEC on March 30, 2020.\n(19)\nIncorporated by reference to Form 8-K, filed with the SEC on March 2, 2020.\n(20)\nIncorporated by reference to Form 8-K, filed with the SEC on March 23, 2020.\n(21)\nIncorporated by reference to Form 8-K, filed with the SEC on September 24, 2020.\n(22)\nIncorporated by reference to Form 8-K, filed with the SEC on August 24, 2020.\n(23)\nIncorporated by reference to Form 10-Q, filed with the SEC on August 13, 2020.\n(24)\nIncorporated by reference to Form 10-Q, filed with the SEC on November 13, 2020.\n(25)\nIncorporated by reference to Form 8-K, filed with the SEC on December 10, 2020.\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized on the 11th day of March, 2021.\nAUDIOEYE, INC.\nBy: /s/ David Moradi\nDavid Moradi\nPrincipal Executive Officer\nBy: /s/ Sachin Barot\nSachin Barot\nChief Financial Officer\nPOWER OF ATTORNEY\nKNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Dr. Carr Bettis, David Moradi and Sachin Barot, or either of them, his attorney-in-fact, with the power of substitution, for him in any and all capacities, to sign any amendments to this Annual Report on Form 10-K and to file the same, with exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission, hereby ratifying and confirming all that each of said attorneys-in-fact or his substitute or substitutes, may do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ David Moradi\nInterim Chief Executive Officer, Chief Strategy Officer, Director\nMarch 11, 2021\nDavid Moradi\n(Principal Executive Officer)\n/s/ Sachin Barot\nChief Financial Officer\nMarch 11, 2021\nSachin Barot\n(Principal Financial and Accounting Officer)\n/s/ Dr. Carr Bettis\nExecutive Chairman, Director\nMarch 11, 2021\nDr. Carr Bettis\n/s/ Anthony Coelho\nDirector\nMarch 11, 2021\nAnthony Coelho\n/s/ Jamil Tahir\nDirector\nMarch 11, 2021\nJamil Tahir\n/s/ Marc Lehmann\nDirector\nMarch 11, 2021\nMarc Lehmann\nITEM 8 - FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nAUDIOEYE, INC.\nFINANCIAL STATEMENTS\nReport of Independent Registered Public Accounting Firm\nBalance Sheets as of December 31, 2020 and 2019\nStatements of Operations for the years ended December 31, 2020 and 2019\nStatements of Stockholders’ Equity for the two years ended December 31, 2020\nStatements of Cash Flows for the years ended December 31, 2020 and 2019\nNotes to Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and Board of Directors of\nAudioEye, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of AudioEye, Inc. (the “Company”) as of December 31, 2020 and 2019, and the related statements of operations, stockholders’ equity, and cash flows for the years then ended, and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2020 and 2019 and the results of their operations and their cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company's internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matters or on the account or disclosure to which it relates.\nAssessment of capitalized technology costs incurred on software development projects\nDescription of the Matter As discussed in Notes 3 and 4 to the financial statements, the Company’s capitalized technology includes direct third party costs, and internal payroll and payroll-related costs used in the creation of internal-use software. The Company’s capitalized technology costs, net of accumulated amortization, was $1.4 million as of December 31, 2020. The Company invested $1.0 million in additions to amortizable intangible assets during the year ended December 31, 2020, a portion of which related to internal-use software development projects.\nWe identified the assessment of capitalized technology costs incurred on software development projects as a critical audit matter. Specifically, assessing if the costs incurred on the software development project have met the capitalization criteria required a higher degree of auditor judgment. This included applying procedures to determine that the costs related to a project that had entered the application development stage, resulted in additional functionality, and for which it was probable that the project would be completed and used to perform the function intended. Evaluating these criteria required the assessment of the technical aspects of each individual project to which the capitalized costs are related.\nHow We Addressed the\nMatter in Our Audit\nFor certain software development projects, we inspected the Company’s documentation to evaluate whether the costs were capitalizable under the applicable accounting standards and tested selected capitalized costs. For those projects, we evaluated the Company’s documentation through direct inquiry with Company personnel responsible for overseeing and leading the software development activities.\n/s/ MaloneBailey, LLP\nwww.malonebailey.com\nWe have served as the Company's auditor since 2011.\nHouston, Texas\nMarch 10, 2021\nAUDIOEYE, INC.\nBALANCE SHEETS\nDECEMBER 31, 2020 AND 2019\nDecember 31, December 31,\n(in thousands, except per share data)\nASSETS\nCurrent assets:\nCash $ 9,095 $ 1,972\nAccounts receivable, net of allowance for doubtful accounts of $79 and $63, respectively 5,096 2,958\nUnbilled receivables -\nDeferred costs, short term\nDebt issuance costs, net -\nPrepaid expenses and other current assets\nTotal current assets 14,631 5,608\nProperty and equipment, net of accumulated depreciation of $209 and $124, respectively\nRight of use assets\nDeferred costs, long term\nIntangible assets, net of accumulated amortization of $4,328 and $3,710, respectively 2,137 1,715\nGoodwill\nTotal assets $ 18,254 $ 9,152\nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent liabilities:\nAccounts payable and accrued expenses $ 2,190 $ 973\nFinance lease liabilities\nOperating lease liabilities\nWarrant liability -\nDeferred revenue 6,328 5,372\nTerm loan, short term -\nTotal current liabilities 9,015 6,726\nLong term liabilities:\nFinance lease liabilities\nOperating lease liabilities\nDeferred revenue\nTerm loan, long term 1,083 -\nTotal liabilities 10,620 7,586\nStockholders' equity:\nPreferred stock, $0.00001 par value, 10,000 shares authorized\nSeries A Convertible Preferred stock, $0.00001 par value, 200 shares authorized, 90 and 105 shares issued and outstanding as of December 31, 2020 and 2019, respectively\nCommon stock, $0.00001 par value, 50,000 shares authorized, 10,130 and 8,877 shares issued and outstanding as of December 31, 2020 and 2019, respectively\nAdditional paid-in capital 64,716 51,490\nAccumulated deficit (57,084 ) (49,926 )\nTotal stockholders' equity 7,634 1,566\nTotal liabilities and stockholders' equity $ 18,254 $ 9,152\nSee Notes to Financial Statements\nAUDIOEYE, INC.\nSTATEMENTS OF OPERATIONS\nYear ended December 31,\n(in thousands, except per share data)\nRevenue $ 20,475 $ 10,765\nCost of revenue 5,961 4,406\nGross profit 14,514 6,359\nOperating expenses:\nSelling and marketing 8,472 5,708\nResearch and development 1,230\nGeneral and administrative 11,945 7,833\nTotal operating expenses 21,647 14,177\nOperating loss (7,133 ) (7,818 )\nOther income (expense):\nOther income -\nChange in fair value of warrant liability\nInterest expense (145 ) (76 )\nTotal other income (expense) (25 )\nNet loss (7,158 ) (7,783 )\nDividends on Series A Convertible Preferred Stock (51 ) (52 )\nNet loss available to common stockholders $ (7,209 ) $ (7,835 )\nNet loss per common share-basic and diluted $ (0.77 ) $ (0.97 )\nWeighted average common shares outstanding-basic and diluted 9,313 8,107\nSee Notes to Financial Statements\nAUDIOEYE, INC.\nSTATEMENTS OF STOCKHOLDERS' EQUITY\nTWO YEARS ENDED DECEMBER 31, 2020\nAdditional\nCommon stock Preferred stock Paid-in Accumulated\n(in thousands) Shares Amount Shares Amount Capital Deficit Total\nBalance, December 31, 2018 7,580 $ 1 $ 1 $ 48,017 $ (42,143 ) $ 5,876\nCommon stock issued in exchange for exercise of options and warrants 1,297 - - - 2,257 - 2,257\nStock-based compensation - - - - 1,216 - 1,216\nNet loss - - - - - (7,783 ) (7,783 )\nBalance, December 31, 2019 8,877 $ 1 $ 1 $ 51,490 $ (49,926 ) $ 1,566\nCommon stock issued upon exercise of warrants and options on a cashless basis - - - - - -\nCommon stock issued upon exercise of warrants and options on a cash basis - - - 1,264 - 1,264\nCommon stock issued upon settlement of restricted stock units - - - - - -\nCommon stock issued upon conversion of preferred stock - (15 ) - - - -\nIssuance of common stock for cash, net of transaction expenses - - - 7,824 - 7,824\nStock-based compensation - - - - 4,138 - 4,138\nNet loss - - - - - (7,158 ) (7,158 )\nBalance, December 31, 2020 10,130 $ 1 $ 1 $ 64,716 $ (57,084 ) $ 7,634\nSee Notes to Financial Statements\nAUDIOEYE, INC.\nSTATEMENTS OF CASH FLOWS\nYear ended December 31,\n(in thousands)\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet loss $ (7,158 ) $ (7,783 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nDepreciation and amortization\nStock-based compensation expense 4,138 1,216\nAmortization of deferred commissions\nAmortization of debt issuance costs\nAmortization of right of use assets\nChange in fair value of warrant liability (120 ) (99 )\nProvision for accounts receivable\nAccounts receivable and unbilled receivables (2,106 ) (2,959 )\nPrepaid expenses and other assets (241 ) (447 )\nAccounts payable and accruals 1,215\nOperating lease liability (208 ) (179 )\nRelated party payables - (14 )\nDeferred revenue 2,497\nNet cash used in operating activities (1,906 ) (5,617 )\nCASH FLOWS FROM INVESTING ACTIVITIES:\nPurchase of equipment - (56 )\nSoftware development costs (1,157 ) (307 )\nPatent costs (141 ) -\nNet cash used in investing activities (1,298 ) (363 )\nCASH FLOWS FROM FINANCING ACTIVITIES:\nProceeds from common stock offering, net of transaction costs 7,824 -\nProceeds from term loan 1,302 -\nProceeds from exercise of options and warrants 1,264 2,257\nRepayments of finance leases (63 ) (47 )\nNet cash provided by financing activities 10,327 2,210\nNet increase (decrease) in cash and cash equivalents 7,123 (3,770 )\nCash and cash equivalents-beginning of period 1,972 5,742\nCash and cash equivalents-end of period $ 9,095 $ 1,972\nSUPPLEMENTAL CASH FLOW DISCLOSURES\nInterest paid $ 6 $ 6\nIncome taxes paid - -\nNon-cash investing and financing activities:\nRight-of-use assets and operating lease obligations recognized upon adoption of ASU 2016-02 $ - $ 568\nRight-of-use assets and operating lease obligations recognized during the year -\nDebt issuance costs originated from issuance of warrant in connection with credit facility -\nEquipment acquired from finance leases\nSee Notes to Financial Statements\nAUDIOEYE, INC.\nNOTES TO FINANCIAL STATEMENTS\nDECEMBER 31, 2020 AND 2019\nNOTE 1 - ORGANIZATION AND DESCRIPTION OF BUSINESS\nAudioEye, Inc. (“we”, “us”, “our”, “AudioEye” or the “Company”) operates in one segment as a provider of patented, Internet content publication and distribution software and related services that enables conversion of digital content into accessible formats and allows for real time distribution to end users on any Internet connected device. The Company’s focus is to create more comprehensive access to Internet, print, broadcast and other media to all people regardless of their network connection, device, location, or disabilities.\nOur common stock is listed on The Nasdaq Capital Market under the symbol “AEYE” since September 4, 2018. Prior to September 4, 2018, our common stock was listed on the OTCQB and the OTC Bulletin Board since April 15, 2013 under the same symbol.\nNOTE 2 - CAPITAL RAISE AND LIQUIDITY\nIn the third quarter of 2020, we completed a public offering of common stock, whereby we issued 473,239 shares of our common stock at $17.75 per share, and raised a total of $7,824,000, net of underwriting discounts and commissions and other costs associated with the offering.\nAs of December 31, 2020, cash and working capital totaled $9,095,000 and $5,616,000, respectively. For the year ended December 31, 2020, cash used in operating activities totaled $1,906,000.\nWe have incurred net losses since inception. Our independent registered public accounting firm expressed in its report on our financial statements for the years ended December 31, 2019 and 2018 that there was substantial doubt about our ability to continue as a going concern. Following the capital raise during the third quarter of 2020, which contributed to the improvement in our cash and working capital positions as of December 31, 2020, we believe that the substantial doubt about our ability to continue as a going concern has been alleviated and that we have sufficient liquidity to continue as a going concern through the next twelve months after the date that the financial statements are issued. Refer to Note 12 - Subsequent Events for information regarding additional capital raised from a common stock offering after December 31, 2020.\nNOTE 3 - SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThis summary of significant accounting policies is presented to assist in understanding the Company’s financial statements. These accounting policies conform to accounting principles generally accepted in the United States of America (“U.S. GAAP”), and have been consistently applied in the preparation of the financial statements. The Company has a fiscal year ending on December 31. Certain prior period amounts have been reclassified to conform to current period classification.\nAll amounts in the financial statements, notes and tables have been rounded to the nearest thousand dollars, except share and per share amounts, unless otherwise indicated.\nUse of Estimates\nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues, expenses, and the related disclosures at the date of the financial statements and during the reporting period. On an ongoing basis, management evaluates its estimates and judgments, including those related to stock-based compensation, capitalization of software development costs, allowance for doubtful accounts, and impairment of long-lived assets and goodwill. Actual results may differ from these estimates.\nAUDIOEYE, INC.\nNOTES TO FINANCIAL STATEMENTS\nDECEMBER 31, 2020 AND 2019\nRevenue Recognition\nWe derive our revenue primarily from the sale of internally-developed software by a software-as-a-service (“SaaS”) delivery model, as well as from professional services, through our direct sales force or through third-party resellers. Our SaaS fees include support and maintenance.\nWe recognize revenue in accordance with Accounting Standards Codification (ASC) 606, Revenue from Contracts with Customers (“ASC 606”). The core principle of ASC 606 is that an entity recognizes revenue to depict the transfer of promised goods or services to customers in an amount that reflects the consideration to which the entity expects to be entitled in exchange for those goods or services.\nWe determine revenue recognition through the following five steps:\n· Identify the contract with the customer;\n· Identify the performance obligations in the contract;\n· Determine the transaction price;\n· Allocate the transaction price to the performance obligations in the contract; and\n· Recognize revenue when, or as, the performance obligations are satisfied.\nPerformance obligations are the unit of accounting for revenue recognition and generally represent the distinct goods or services that are promised to the customer. If we determine that we have not satisfied a performance obligation, we will defer recognition of the revenue until the performance obligation is deemed to be satisfied. SaaS agreements are generally non-cancelable, although clients typically have the right to terminate their contracts for cause if we fail to perform material obligations.\nWe may execute more than one contract with a single customer. We evaluate whether the agreements were negotiated as a package with a single objective, whether the amount of consideration to be paid in one agreement depends on the price and/or performance of another agreement, or whether the goods or services promised in the agreements represent a single performance obligation. The conclusions reached can impact the allocation of the transaction price to each performance obligation and the timing of revenue recognition related to those arrangements.\nOur SaaS (also referred to as “subscription”) revenue is comprised of fixed subscription fees from customer accounts on our platform. SaaS revenue is recognized on a ratable basis over the contractual subscription term of the arrangement beginning on the date that our service is made available to the customer. Certain SaaS fees are invoiced in advance on an annual, semi-annual, or quarterly basis. Any funds received for services not provided yet are held in deferred revenue and are recorded as revenue when the related performance obligations have been satisfied.\nNon-subscription revenue consists of PDF remediation and Mobile App report services and is recognized upon delivery. Consideration payable under these arrangements is based on usage.\nThe following table presents our revenues disaggregated by sales channel:\nYear ended December 31,\n(in thousands)\nEnterprise\n$ 10,735\n$ 7,252\nPartner and Marketplace\n9,740\n3,513\nTotal revenues\n$ 20,475\n$ 10,765\nAUDIOEYE, INC.\nNOTES TO FINANCIAL STATEMENTS\nDECEMBER 31, 2020 AND 2019\nThe Company records accounts receivable for amounts invoiced to customers for which the Company has an unconditional right to consideration as provided under the contractual arrangement. Unbilled receivables include amounts related to the Company’s contractual right to consideration for completed performance obligations not yet invoiced. Deferred revenue includes payments received in advance of performance under the contract. Our unbilled receivables and deferred revenue are reported on an individual contract basis at the end of each reporting period. Unbilled receivables are classified as current or noncurrent based on the timing of when we expect to bill the customer. Deferred revenue is classified as current or noncurrent based on the timing of when we expect to recognize revenue.\nThe table below summarizes our deferred revenue as of December 31, 2020 and 2019:\nAs of December 31,\n(in thousands)\nDeferred revenue - current $ 6,328 $ 5,372\nDeferred revenue - noncurrent\nTotal deferred revenue $ 6,411 $ 5,525\nIn the year ended December 31, 2020 we recognized $5,269,000, or 95%, in revenue from deferred revenue outstanding as of December 31, 2019.\nWe had one major customer (including the customer’s affiliates reflecting multiple contracts and a partnership with the Company) which accounted for approximately 16.7% of our revenue in the year ended December 31, 2020, and one major customer which generated approximately 10% of our revenue in the fiscal year ended December 31, 2019.\nThree customers with long standing relationships with the Company represented 25%, 13% and 13%, respectively, of total accounts receivable as of December 31, 2020. At December 31, 2019, one customer represented 40% of the outstanding accounts receivable.\nDeferred Costs (Contract acquisition costs)\nOur sales commission plans may provide for multiple commission payments, including an initial payment in the period a customer contract is obtained, or the first invoice is paid, and deferred payments over the life of the contract as future payments are collected from the customers.\nWe capitalize initial and renewal sales commission payments in the period the commission is earned, which generally occurs when a customer contract is obtained or when the customer is billed, and amortize deferred commission costs on a straight-line basis over the expected period of benefit, which we have deemed to be the contract term, except when the commission payment is expected to provide economic benefit for a period longer than the contract term, such as for new customer or incremental sales where renewals are expected, and renewal commissions are not commensurate with initial commissions. As a practical expedient, we expense sales commissions as incurred when the amortization period of related deferred commission costs would have been one year or less.\nThe table below summarizes the deferred commission costs as of December 31, 2020 and 2019:\nAs of December 31,\n(in thousands)\nDeferred costs - current $ 152 $ 183\nDeferred costs - noncurrent\nTotal deferred costs $ 229 $ 328\nAmortization expense associated with sales commissions was included in selling and marketing expenses on the statements of operations and totaled $250,000 and $240,000 for the years ended December 31, 2020 and 2019, respectively. There were no impairment losses for these capitalized costs for the years ended December 31, 2020 and 2019.\nCost of Revenue\nCost of revenue consists primarily of employee-related costs, including payroll, benefits and stock-based compensation expense for our technology operations and customer experience teams, fees paid to our managed hosting providers and other third-party service providers, amortization of capitalized software development costs and acquired technology, and allocated overhead costs.\nAUDIOEYE, INC.\nNOTES TO FINANCIAL STATEMENTS\nDECEMBER 31, 2020 AND 2019\nCash and Cash Equivalents\nThe Company considers cash in savings accounts to be cash equivalents. The Company considers any short-term, highly liquid investments with maturities of three months or less as cash and cash equivalents.\nAllowance for Doubtful Accounts\nThe Company adjusts accounts receivable down to net realizable value with its allowance methodology. In determining the allowance for doubtful accounts for estimated losses, aged receivables are analyzed periodically by management. Each identified receivable is reviewed based upon historical collection experience, financial condition of the client and the status of any open or unresolved issues with the client preventing the payment thereof. Corrective action, if necessary, is taken by the Company to resolve open issues related to unpaid receivables. The allowance for doubtful accounts was $79,000 and $63,000 at December 31, 2020 and 2019, respectively. The Company believes that its reserve is adequate, however results may differ in future periods. For the years ended December 31, 2020 and 2019, bad debt expense totaled $128,000 and $13,000, respectively.\nProperty and Equipment\nProperty and equipment includes office and computer equipment, as well as furniture and fixtures. Property and equipment are carried at the cost of acquisition, and depreciated using the straight-line method over their estimated useful lives, which typically is 3 years. Costs associated with repairs and maintenance are expensed as incurred. Costs associated with improvements which extend the life, increase the capacity or improve the efficiency of the Company’s property and equipment are capitalized and depreciated over the remaining life of the related asset. Any gain or losses on disposition of property and equipment is included in the results of operations in the year of disposal.\nTotal property and equipment acquired by cash and through finance leases totaled zero and $20,000, respectively, in the year ended December 31, 2020, and $56,000 and $61,000, respectively, in the year ended December 31, 2019. Depreciation expense was $86,000 and $69,000 for the years ended December 31, 2020 and 2019, respectively.\nCapitalized Software Development Costs\nIn accordance with ASC 350-40, the Company capitalizes certain computer software and software development costs incurred in connection with developing or obtaining computer software for internal use when both the preliminary project stage is completed, and it is probable that the software will be used as intended. Capitalized software costs include (i) external direct costs of materials and services utilized in developing or obtaining computer software, and (ii) compensation and related benefits for employees who are directly associated with the software project.\nCapitalized software costs are included in intangible assets on our balance sheet and amortized on a straight-line basis when placed into service over the estimated useful lives of the software, which is typically three years. Amortization expense is included in cost of revenue on the statements of operations and totaled $449,000 and $279,000 for the years ended December 31, 2020 and 2019, respectively. The Company reviews the carrying value for impairment whenever facts and circumstances exist that would suggest that assets might be impaired or that the useful lives should be modified. Refer to Note 4 - Intangible Assets for additional information regarding our Capitalized Software Development Costs.\nPatents\nWe capitalize patent application costs, including registration, documentation, and other legal fees associated with the application, which are incurred through the months the patent application is filed. Costs associated with provisional application filings are expensed as incurred. Costs incurred to renew or extend the term of recognized intangible assets, including patent annuities and fees, and costs incurred in prosecuting alleged infringements of our patents are expensed as incurred. Patents are included in intangible assets on our balance sheet.\nAUDIOEYE, INC.\nNOTES TO FINANCIAL STATEMENTS\nDECEMBER 31, 2020 AND 2019\nWe amortize capitalized patent costs on a straight-line basis over their estimated useful lives, which generally ranges from 5 to 10 years, beginning with the date the patents are issued. We evaluate the capitalized costs for impairment and write off the carrying value of abandoned patents or patent applications. We also write off capitalized costs associated to patents not granted. Refer to Note 4 - Intangible Assets for additional information regarding our patents.\nGoodwill, Intangible Assets and Long-Lived Assets\nGoodwill is tested for impairment at least annually, and more frequently upon the occurrence of certain events that may indicate that the carrying value of goodwill may not be recoverable. Events or circumstances that could trigger an impairment test include, but are not limited to, a significant adverse change in the business climate or in legal factors, an adverse action or assessment by a regulator, a loss of key personnel, significant changes in the strategy for our overall business, significant negative industry or economic trends, significant underperformance relative to operating performance indicators, a significant decline in market capitalization and significant changes in competition. We complete our annual impairment test during the fourth quarter of each year, at the reporting unit level, which is at the company level as a whole, since we operate in one single reporting segment.\nIntangible assets with a finite life are amortized over their estimated useful lives.\nWe evaluate the need for an impairment charge relating to long-lived assets whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. We consider the following to be some examples of indicators that may trigger an impairment review: (i) actual undiscounted cash flows significantly below historical or projected future undiscounted cash flows for the associated assets; (ii) significant changes in the manner or use of the assets or in our overall strategy with respect to the manner or use of the assets or changes in our overall business strategy; (iii) significant negative industry or economic trends; (iv) increased competitive pressures; and (v) a significant decline in our stock price for a sustained period of time.\nOnce we determine that a potential impairment indicator exists, we perform the test for recoverability by comparing the estimated future undiscounted cash flows associated with the intangible assets with the intangible asset’s carrying amount. Where the carrying value of the intangible asset exceeds the future undiscounted cash flows associated with the intangible assets, it is determined that the value of those intangible assets cannot be recovered. For an intangible asset failing the recoverability test, an impairment charge is recorded for the difference between the carrying value and the estimated fair value. No impairment losses were incurred during the years ended December 31, 2020 and 2019.\nFair Value of Financial Instruments\nFair value is an estimate of the exit price, representing the amount that would be received upon the sale of an asset or paid to transfer a liability in an orderly transaction between market participants (i.e., the exit price at the measurement date). Fair value measurements are not adjusted for transaction cost. Fair value measurement under U.S. GAAP provides for use of a fair value hierarchy that prioritizes inputs to valuation techniques used to measure fair value into three levels:\nLevel 1: Unadjusted quoted prices in active markets for identical assets or liabilities.\nLevel 2: Inputs other than quoted market prices that are observable, either directly or indirectly, and reasonably available. Observable inputs reflect the assumptions market participants would use in pricing the asset or liability and are developed based on market data obtained from sources independent of the Company.\nLevel 3: Unobservable inputs reflect the assumptions that the Company develops based on available information about what market participants would use in valuing the asset or liability.\nAn asset or liability’s level within the fair value hierarchy is based on the lowest level of any input that is significant to the fair value measurement. Availability of observable inputs can vary and is affected by a variety of factors. The Company uses judgment in determining the fair value of assets and liabilities and Level 3 assets and liabilities involve greater judgment than Level 1 and Level 2 assets or liabilities.\nAUDIOEYE, INC.\nNOTES TO FINANCIAL STATEMENTS\nDECEMBER 31, 2020 AND 2019\nThe carrying amounts of cash and cash equivalents, accounts receivable, accounts payable and accrued expenses approximate fair value based on the short-term maturity of these instruments. Cash and cash equivalents are classified as Level 1. Long-term debt is classified as Level 2.\nThe Company had no assets measured at fair value on a recurring basis as of December 31, 2020 and 2019.\nThe table below provides information on our liabilities that are measured at fair value on a recurring basis:\nFair Value\n(in thousands) Fair Value Hierarchy\nWarrant liability (1), December 31, 2020 $ - Level 3\nWarrant liability (1), December 31, 2019 $ 120 Level 3\n(1) In the third quarter of 2020, the warrant liability was extinguished upon full exercise of the warrants, which were issued in connection with our credit facility (see Note 6 - Debt for additional information on our credit facility and related warrant liability). The fair value of the warrant liability was determined using the Black-Scholes pricing model. For the years ended December 31, 2020 and 2019, gains on fair value adjustments totaling $120,000 and $99,000, respectively, were included in the statements of operations within change in fair value of warrant liability.\nStock-Based Compensation\nThe Company periodically issues options, warrants and restricted stock units (“RSUs”) as compensation for services received. The fair value of the award is measured on the grant date. The fair value amount is then recognized as expense over the requisite vesting period during which services are required to be provided in exchange for the award. Stock-based compensation expense is recorded by the Company in the same expense classifications in the statements of operations, as if such amounts were paid in cash.\nThe fair value of options and warrants awards is measured on the grant date using a Black-Scholes option pricing model, which includes assumptions that are subjective and are generally derived from external data (such as risk-free rate of interest) and historical data (such as volatility factor, expected term, and forfeiture rates). Future grants of equity awards accounted for as stock-based compensation could have a material impact on reported expenses depending upon the number, value, and vesting period of future awards.\nWe estimate the fair value of restricted stock unit awards with time- or performance-based vesting using the value of our common stock on the date of grant. We estimate the fair value of market-based restricted stock unit awards using a Monte Carlo simulation model on the date of grant.\nWe expense the compensation cost associated with time-based options, warrants and RSUs as the restriction period lapses, which is typically a one- to three-year service period with the Company. Compensation expense related to performance-based options and RSUs is recognized on a straight-line basis over the requisite service period, provided that it is probable that performance conditions will be achieved, with probability assessed on a quarterly basis and any changes in expectations recognized as an adjustment to earnings in the period of the change. Compensation cost is not recognized for service- and performance-based awards that do not vest because service or performance conditions are not satisfied and any previously recognized compensation cost is reversed. Compensation costs related to awards with market conditions are recognized on a straight-line basis over the requisite service period regardless of whether the market condition is satisfied, and is not reversed provided that the requisite service period derived from the Monte-Carlo simulation has been completed. If vesting occurs prior to the end of the requisite service period, expense is accelerated and fully recognized through the vesting date.\nIncome Taxes\nWe use the asset and liability method of accounting for income taxes. Under this method, deferred tax assets and liabilities are recognized for the estimated future tax consequences attributable to temporary differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. These assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which the temporary differences are expected to reverse.\nThe Company has net operating loss carryforwards available to reduce future taxable income. Future tax benefits for these net operating loss carryforwards are recognized to the extent that realization of these benefits is considered more likely than not. To the extent that the Company will not realize a future tax benefit, a valuation allowance is established.\nAUDIOEYE, INC.\nNOTES TO FINANCIAL STATEMENTS\nDECEMBER 31, 2020 AND 2019\nEarnings (Loss) Per Share (“EPS”)\nBasic EPS is calculated by dividing net income (loss) available to common stockholders by the weighted average number of shares of the Company’s common stock outstanding during the period. Diluted EPS is calculated based on the net income (loss) available to common stockholders and the weighted average number of shares of common stock outstanding during the period, adjusted for the effects of all potential dilutive common stock issuances related to options, warrants, restricted stock units and convertible preferred stock. The dilutive effect of our share-based awards and warrants is computed using the treasury stock method, which assumes all share-based awards and warrants are exercised and the hypothetical proceeds from exercise are used to purchase common stock at the average market price during the period. The incremental shares (i.e., the difference between shares assumed to be issued versus purchased), to the extent they would have been dilutive, are included in the denominator of the diluted EPS calculation. The dilutive effect of our convertible preferred stock is computed using the if-converted method, which assumes conversion at the beginning of the year. However, when a net loss exists, no potential common stock equivalents are included in the computation of the diluted per-share amount because the computation would result in an anti-dilutive per-share amount.\nPotentially dilutive securities outstanding as of December 31, 2020 and 2019, which were excluded from the computation of basic and diluted net loss per share for the years then ended, are as follows:\nDecember 31,\n(in thousands)\nPreferred stock\nOptions\nWarrants\nRestricted stock units\nTotal 1,819 2,114\nLoss Contingencies\nWe are subject to the possibility of various loss contingencies arising in the normal course of business. We consider the likelihood of the loss or impairment of an asset or the incurrence of a liability as well as our ability to reasonably estimate the amount of loss in determining loss contingencies. An estimated loss contingency is accrued when it is probable that a liability has been incurred or an asset has been impaired and the amount of loss can be reasonably estimated. We regularly evaluate current information available to us to determine whether to accrue for a loss contingency and adjust any previous accrual.\nRecent Accounting Pronouncements\nIn August 2018, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) 2018-15, “Intangibles - Goodwill and Other - Internal-Use Software (Subtopic 350-40): Customer’s Accounting for Implementation Costs Incurred in a Cloud Computing Arrangement That Is a Service Contract.” This ASU clarifies the accounting treatment for implementation costs for cloud computing arrangements (hosting arrangements) that is a service contract. This guidance is effective for fiscal years beginning after December 15, 2019, including interim periods within that fiscal year. We adopted this guidance effective January 1, 2020. The adoption of this guidance did not have a material impact our financial position, results of operations or disclosures.\nIn August 2018, the FASB issued ASU 2018-13, “Fair Value Measurement (Topic 820): Disclosure Framework - Changes to the Disclosure Requirements for Fair Value Measurement.” This ASU adds, modifies, and removes several disclosure requirements relative to the three levels of inputs used to measure fair value in accordance with Topic 820, “Fair Value Measurement.” This guidance is effective for fiscal years beginning after December 15, 2019, including interim periods within that fiscal year. We adopted this guidance effective January 1, 2020. The adoption of this guidance did not have a material impact our financial position, results of operations or disclosures.\nAUDIOEYE, INC.\nNOTES TO FINANCIAL STATEMENTS\nDECEMBER 31, 2020 AND 2019\nNOTE 4 - INTANGIBLE ASSETS\nIntangible assets as of December 31, 2020 and 2019 consisted of the following:\nDecember 31,\n(in thousands)\nFinite-lived assets:\nPatents\n$ 3,779\n$ 3,698\nCapitalized software development costs\n2,676\n1,717\nAccumulated amortization\n(4,328 )\n(3,710 )\nFinite-lived assets, net\n2,127\n1,705\nIndefinite-lived assets:\nDomain name\nIntangible assets, net\n$ 2,137\n$ 1,715\nAs of December 31, 2020 and 2019, capitalized cost associated with pending patents totaled $141,000 and zero, respectively.\nFor the years ended December 31, 2020 and 2019, software development costs capitalized totaled $1,157,000 and $307,000, respectively.\nRefer to Note 3 - Significant Accounting Policies for additional information regarding our intangible assets, including specific information on our patents and capitalized software development costs.\nThe following table summarizes amortization expense associated with intangible assets for the fiscal years ended December 31, 2020 and 2019:\nYear ended December 31,\n(in thousands)\nPatents\n$\n$\nCapitalized software development costs\nTotal amortization expense\n$\n$\nThe weighted average remaining useful life of our finite-lived intangible assets (in years) as of December 31, 2020 are as follows:\nWeighted average remaining amortization period (in years)\nPatents 2.1\nCapitalized software development costs 2.4\nNo loss on impairment of long-lived assets was recorded for the years ended December 31, 2020 and 2019.\nNOTE 5 - LEASE LIABILITIES AND RIGHT OF USE ASSETS\nWe determine whether an arrangement is a lease at inception. Right-of-use assets represent our right to use an underlying asset for the lease term, and lease liabilities represent our obligation to make lease payments arising from the lease.\nFinance Leases\nThe Company has finance leases to purchase computer equipment. The amortization expense of the leased equipment is included in depreciation expense. As of December 31, 2020 and 2019, the Company’s outstanding finance lease obligations totaled $61,000 and $104,000, respectively. The effective interest rate of the finance leases is estimated at 6.0% based on the implicit rate in the lease agreements.\nThe following summarizes the assets acquired under finance leases, included in property and equipment:\nAs of December 31,\n(in thousands)\nComputer equipment $ 177 $ 157\nLess: accumulated depreciation (116 ) (60 )\nAssets acquired under finance leases, net $ 61 $ 97\nAUDIOEYE, INC.\nNOTES TO FINANCIAL STATEMENTS\nDECEMBER 31, 2020 AND 2019\nOperating Leases\nOperating lease right-of-use assets and liabilities are recognized at commencement date based on the present value of lease payments over the expected lease term. Right-of-use assets represent our right to use an underlying asset for the lease term and lease liabilities represent our obligation to make lease payments arising from the lease. Since our lease arrangements do not provide an implicit rate, we use our estimated incremental borrowing rate for the expected remaining lease term at commencement date in determining the present value of future lease payments. Operating lease expense is recognized on a straight-line basis over the lease term.\nThe Company has operating leases for office space in Tucson, Arizona and Marietta, Georgia. The lease for the principal office located in Tucson consists of approximately 5,200 square feet and ends in October 2022. The lease for the Marietta office, which consists of approximately 6,700 square feet, commenced in June 2019 and expires in August 2024. The company also leases office space in Scottsdale, Arizona from a company controlled by our Executive Chairman, which continues on a month-to-month basis, therefore was not measured under ASC 842.\nIn addition, the Company entered into membership agreements to occupy shared office space in New York and Portland, Oregon. The membership agreements do not qualify as a lease under ASC 842 as the owner has substantive substitution rights, therefore the Company expenses membership fees as they are incurred. See Note 9 - Commitments and Contingencies for further details on our shared office arrangements.\nThe Company made operating lease payments in the amount of $255,000 and $231,000 during the years ended December 31, 2020 and 2019, respectively.\nThe following summarizes the total lease liabilities and remaining future minimum lease payments at December 31, 2020 (in thousands):\nYear ending December 31,\nFinance\nLeases\nOperating\nLeases\nTotal\n$\n$\n$\n-\nTotal minimum lease payments\nLess: present value discount\n(4 )\n(62 )\n(66 )\nTotal lease liabilities\n$\n$\n$\nCurrent portion of lease liabilities\n$\n$\n$\nLong term portion of lease liabilities\n$\n$\n$\nThe following summarizes expenses associated with our finance and operating leases for the year ended December 31, 2020 (in thousands):\nFinance lease expenses:\nDepreciation expense $ 56\nInterest on lease liabilities\nTotal Finance lease expense\nOperating lease expense\nShort-term lease and related expenses\nTotal lease expenses $ 509\nThe following table provides information about the remaining lease terms and discount rates applied as of December 31, 2020:\nWeighted average remaining lease term (years)\nOperating Leases 2.95\nFinance Leases 1.44\nWeighted average discount rate (%)\nOperating Leases 6.00\nFinance Leases 6.00\nAUDIOEYE, INC.\nNOTES TO FINANCIAL STATEMENTS\nDECEMBER 31, 2020 AND 2019\nNOTE 6 - DEBT\nRelated party credit facility\nOn August 14, 2019, the Company entered into a Loan Agreement (the “Loan Agreement”) with Sero Capital LLC (“Sero Capital”), a stockholder who owns more than 10% of the outstanding shares of common stock of the Company. The beneficial owner of Sero Capital is David Moradi, who became a director of the Company on November 8, 2019 and was appointed the Company’s Interim Chief Executive Officer and Chief Strategy Officer on August 13, 2020. The Loan Agreement provided the Company with an unsecured credit facility under which the Company could have borrowed up to the aggregate principal amount of $2,000,000. Any advances under the Loan Agreement would bear interest at a per annum rate of 10% (subject to increase in the event of a default). The term of the Loan Agreement extended through August 14, 2020 and provided for certain customary covenants, representations and events of default. No amounts were drawn under the credit facility through its expiration on August 14, 2020.\nIn consideration of the Loan Agreement, the Company issued to Sero Capital common stock warrants to acquire up to a total of 146,667 shares of the Company’s common stock at an exercise price of $6.00 per share, which were classified as a liability instrument since the holder had the option to require the Company to repurchase the warrants when certain events occurred that were considered outside of the control of the Company. In the third quarter of 2020, the Company received $880,000 in cash in connection with Sero Capital’s full exercise of these warrants. The estimated fair value of the warrants held by Sero Capital was $219,000 at the date of issuance and was included in debt issuance costs on the balance sheets. Debt issuance cost was amortized as interest expense on a straight-line basis over the term of the associated credit facility. As of December 31, 2020 and 2019, the unamortized balance of debt issuance costs was zero and $137,000, respectively.\nTerm loan\nOn April 15, 2020, the Company entered into a loan agreement in the amount of $1,302,000 with Liberty Capital Bank (“Lender”) pursuant to the Paycheck Protection Program (“PPP Loan”) of the CARES Act, which is administered by the Small Business Administration (“SBA”). Pursuant to the terms of the PPP Loan, principal and interest payments are deferred until the date on which the SBA either remits to the Lender the amount of the PPP Loan that will be forgiven by the SBA or notifies the Lender that the PPP Loan or a portion thereof will not be forgiven. The loan has a maturity of two years and bears an interest rate of 1.0% per annum. The PPP Loan is not collateralized and is not personally guaranteed. No fees were charged in connection with the loan. All or a portion of the PPP Loan may be forgiven upon SBA’s approval of the Company’s pending forgiveness application. As of December 31, 2020 the outstanding principal balance of the PPP Loan totaled $1,302,000 and accrued interest thereon totaled $9,000.\nOutstanding principal balances on debt consisted of the following:\n(in thousands) December 31, 2020\nTerm Loan $ 1,302\nLess: Short term portion (219 )\nLong term portion of debt $ 1,083\nNOTE 7 - SERIES A CONVERTIBLE PREFERRED STOCK\nAs of December 31, 2020 and 2019, the Company had 90,000 and 105,000 shares of Series A Convertible Preferred Stock (the “Preferred Stock”) outstanding, respectively. These shares of Preferred Stock were issued at $10 per share (the “stated value”), accrue 5% in cumulative annual dividends, and are convertible into the Company’s common stock at a price of $4.385 per share. For the year ended December 31, 2020, preferred stockholders collectively earned, but were not paid, dividends totaling approximately $51,000, which were equivalent to 11,574 shares of common stock based on a conversion price of $4.385 per share. As of December 31, 2020 and 2019, cumulative and unpaid dividends were approximately $255,000 and $245,000, respectively, which is equivalent to 58,288 and 55,927 shares of common stock, respectively, based on a conversion price of $4.385 per share.\nOn any matter presented to the stockholders of the Company for vote, holders of Preferred Stock are entitled to cast the number of votes equal to the number of shares of common stock into which their shares of Preferred Stock are convertible as of the record date to vote on such matter. As long as any shares of Preferred Stock are outstanding, the Company has certain restrictions on share repurchases and amendments to the Certificate of Incorporation in a manner that adversely affects any rights of the holders of Preferred Stock.\nIn addition, the holders of Preferred Stock have a liquidation preference for purposes of which the Preferred Stock would be valued at $10 per share plus accrued cumulative annual dividends. At December 31, 2020 and 2019, the liquidation preference was valued at $1,155,000 and $1,295,000, respectively. In the event of any liquidity event, holders of Preferred Stock shall be entitled to be paid their liquidation preference out of the assets of the Company legally available before any sums shall be paid to holders of common stock.\nThe Company is entitled to redeem any or all of the outstanding shares of Preferred Stock at a per share price equal to 125% of the stated value, plus accumulated dividends, payable in cash. As of December 31, 2020, the aggregate amount to redeem all outstanding shares of Preferred Stock was $1,380,000.\nAUDIOEYE, INC.\nNOTES TO FINANCIAL STATEMENTS\nDECEMBER 31, 2020 AND 2019\nNOTE 8 - RELATED PARTY TRANSACTIONS\nAs discussed in Note 6 - Debt, we entered into a Loan Agreement with Sero Capital, a stockholder who owns more than 10% of the outstanding shares of common stock of the Company. The beneficial owner of Sero Capital is David Moradi, who became a director of the Company on November 8, 2019 and was appointed the Company’s Interim Chief Executive Officer and Chief Strategy Officer on August 13, 2020. The Loan Agreement extended through August 14, 2020 and provided the Company with an unsecured credit facility under which we could have borrowed up to the aggregate principal amount of $2,000,000. No amounts were drawn under the credit facility though its expiration on August 14, 2020.\nIn consideration for the Loan Agreement, we issued to Sero Capital common stock warrants to acquire up to a total of 146,667 shares of the Company’s common stock at an exercise price of $6.00 per share. The warrants were fully exercised in August 2020 and the warrant liability was extinguished. See Note- 6 - Debt for additional detail on our warrant liability.\nAs discussed in Note 5 - Lease Liabilities and Right of Use Assets, we lease office space from a company controlled by our Executive Chairman. For the year ended December 31, 2020, rent payments for this office space totaled $70,000.\nNOTE 9 - COMMITMENTS AND CONTINGENCIES\nMembership agreement to occupy shared office space\nIn the second quarter of 2020, the Company entered into a membership agreement to occupy shared office space in Portland, Oregon. The membership agreement ends in August 2021 and provides for fees which are based on the number of contracted seats and the use of optional office services. As of December 31, 2020, minimum fees due under this shared office arrangement totaled $31,000.\nThe Company also entered into a membership agreement to occupy shared office space in New York, NY through July 2021. As of December 31, 2020, minimum fees due under this shared office arrangement totaled $59,000.\nLitigation\nWe may become involved in various routine disputes and allegations incidental to our business operations. While it is not possible to determine the ultimate disposition of these matters, management believes that the resolution of any such matters, should they arise, is not likely to have a material adverse effect on our financial position or results of operations.\nAUDIOEYE, INC.\nNOTES TO FINANCIAL STATEMENTS\nDECEMBER 31, 2020 AND 2019\nNOTE 10 -STOCK-BASED COMPENSATION\nOn December 9, 2020, the 2020 Equity Incentive Plan (the “2020 Plan”) was approved, replacing the 2019 Equity Incentive Plan. The 2020 Plan provides for the issuance of up to 1,000,000 shares of the Company’s common stock to the Company’s employees, non-employee directors, consultants and advisors. Awards under the 2020 Plan can be granted in the form of stock options, stock appreciation rights, restricted stock, stock units, other stock-based awards and cash incentive awards. Outstanding awards issued under previous equity incentive plans will continue to be governed by their respective terms until exercised, expired or otherwise terminated or canceled, but no further equity awards will be made under those plans.\nThe following table summarizes the stock-based compensation expense recorded for the years ended December 31, 2020 and 2019:\nYear ended December 31,\n(in thousands)\nStock Options\n$\n$\nRestricted Stock Units\n3,789\nUnrestricted Shares of Common Stock\n-\nTotal\n$ 4,138\n$ 1,216\nAs of December 31, 2020, the outstanding unrecognized stock-based compensation expense related to options and restricted stock units (“RSUs”) was $1,373,000 and $6,413,000, respectively, which may be recognized through August 2025, subject to achievement of service, performance, and market conditions. As of December 31, 2020, there was no remaining unamortized stock-based compensation expense related to warrants.\nStock Options\nOptions granted under our equity incentive plans generally have terms of five years, and typically vest and become fully exercisable ratably over three years of continuous service to the Company from the date of grant.\nThe following table summarizes the stock option activity for the years ended December 31, 2020 and 2019:\nWeighted\nIntrinsic\nWeighted Average\nValue\nNumber of Average Remaining\nof\nOptions Exercise Price Term Exercisable Options\nOutstanding at December 31, 2018 997,989 $ 4.67 2.14 925,545 $ 4,705,000\nGranted 189,599 6.54 9.25\nExercised (37,528 ) 1.75\nForfeited/Expired (185,017 ) 11.83\nOutstanding at December 31, 2019 965,043 $ 3.70 3.01 759,631 $ 1,666,000\nGranted 220,267 12.31 5.00\nExercised (433,180 ) 2.07\nForfeited/Expired (235,219 ) 7.00\nOutstanding at December 31, 2020 516,911 $ 7.24 2.70 294,894 $ 9,610,000\nExercisable as of December 31, 2020 294,894 $ 3.95 1.02\n$ 6,452,000\nThe 2020 and 2019 stock-based compensation was estimated at the date of grant using a Black-Scholes option pricing model with the following weighted average assumptions for each fiscal year:\nExpected life 3.16 years 4.70 years\nRisk-free interest rate 0.19% 1.87%\nWeighted average volatility factor 107.28% 148.41%\nDividend yield - -\nAUDIOEYE, INC.\nNOTES TO FINANCIAL STATEMENTS\nDECEMBER 31, 2020 AND 2019\nRestricted Stock Units\nWe issue RSUs to employees, officers, directors, and consultants of the Company. The restrictions on time-based RSUs generally lapse over a one- to three-year term of continuous service from the date of grant.\nThe following table summarizes the RSU activity for years ended December 31, 2020 and 2019:\nRestricted stock units outstanding as of December 31, 2018 222,514\nGranted 206,405\nForfeited/Canceled -\nRestricted stock units outstanding as of December 31, 2019 428,919\nGranted 800,695\nSettled (116,656 )\nForfeited/Canceled (154,580 )\nTotal restricted stock units outstanding at December 31, 2020 958,378\nVested restricted stock units at December 31, 285,108\nUnvested restricted stock units as of December 31, 2020 673,270\nIn the third quarter of 2020, we granted 260,000 RSUs with performance-based and market-based conditions to our Interim Chief Executive Officer. The performance condition for 105,000 of such RSUs is based on the achievement of Monthly Recurring Revenue (“MRR”) targets. In 2020, we recorded $314,000 in stock-based compensation expense associated with 55,000 RSUs, the performance target for which achievement during the requisite period was deemed probable. The Company will continue to reassess the probability of achieving the performance conditions in future periods and record the appropriate expense if necessary. The market condition for the remaining 155,000 RSUs in the award is based on the Company’s stock price targets. The Company used a Monte Carlo simulation to determine the grant-date fair value for the market-based RSUs. The weighted-average assumptions used in the Monte-Carlo simulation were as follows: 5-year historical volatility of 136.52%, 5-year risk-free rate of 0.26%, and a performance period of 5 years. The Company recorded $1,506,000 in stock-based compensation expense related to these market-based RSUs in 2020.\nWarrants\nThe following table summarizes the warrant activity for the years ended December 31, 2020 and 2019:\nWeighted Intrinsic\nWeighted Average Value\nNumber of Average Remaining of\nWarrants Exercise Price Term Warrants\nOutstanding at December 31, 2018 1,781,715 $ 4.2 2.23 $ 8,930,000\nGranted 146,667 6.00 0.62\nExercised (1,279,550 ) 1.85\nForfeited/Expired (224,124 ) 5.33\nOutstanding at December 31, 2019 424,708 5.31 0.82 189,000\nGranted - -\nExercised (321,467 ) 4.77\nForfeited/Expired (22,188 ) 9.59\nOutstanding at December 31, 2020 81,053 $ 6.25 0.94 $ 1,587,000\nIn August 2019, the Company negotiated with holders of certain warrants to purchase the Company’s common stock with respect to a transaction in which the Company and the holders agreed to amend certain warrant agreements to provide that, from the date of amendment through August 16, 2019, the exercise price was reduced from $2.50 to $1.63 per share for warrants to purchase an aggregate of 1,194,990 shares and from $6.25 to $4.07 per share for warrants to purchase an aggregate of 85,719 shares, provided that any exercise during such period was in full and the exercise price was paid in cash. In August 2019, an aggregate of 1,212,136 warrants to purchase the Company’s common stock were exercised for net proceeds of $2,115,000.\nIn the third quarter of 2020, the Company received $880,000 in cash in connection with the exercise of 146,667 stock warrants by a related party. Refer to Note 6 - Debt and Note 8 - Related Party Transactions for additional information on these warrants.\nAUDIOEYE, INC.\nNOTES TO FINANCIAL STATEMENTS\nDECEMBER 31, 2020 AND 2019\nNOTE 11 - INCOME TAXES\nFor the years ended December 31, 2020 and 2019, federal and state income tax expense totaled zero.\nThe Company has net operating loss carryforwards available to reduce future taxable income. As of December 31, 2020, net operating loss carry forwards totaled $42,636,000 and will expire at various dates through 2040. Future tax benefits for these net operating loss carryforwards are recognized to the extent that realization of these benefits is considered more likely than not. To the extent that the Company will not realize a future tax benefit, a valuation allowance is established.\nAt this time, the Company is unable to determine if it will be able to benefit from its deferred tax asset. There are limitations on the utilization of net operating loss carryforwards, including a requirement that losses be offset against future taxable income, if any. In addition, there are limitations imposed by certain transactions, which are deemed to be ownership changes. Accordingly, our net deferred tax asset was zero as of December 31, 2020 and 2019 as the Company established a full valuation allowance of $ 13,304,000 and $7,758,000, respectively.\nSignificant components of our deferred tax assets and liabilities as of December 31, 2020 and 2019 consist of the following:\nDecember 31,\n(in thousands)\nDeferred tax assets:\nIntangible assets\n$\n$ -\nBad debt expense\n-\nAccrued compensation expense\n-\nDeferred revenue and costs\n-\nStock-based compensation\n1,494\n-\nOperating lease liability\n-\nState NOL carryforwards\n2,516\n1,380\nFederal NOL carryforwards\n8,954\n6,378\nTotal Deferred Tax Assets\n13,532\n7,758\nValuation allowance\n(13,304 )\n(7,758 )\nNet deferred tax assets\n-\nDeferred tax liabilities:\nProperty and equipment\n(62 )\n-\nRight of use assets\n(166 )\n-\nTotal deferred tax liabilities\n(228 )\n-\nNet deferred tax asset (liability)\n$ -\n$ -\nThe Company is subject to U.S. federal income tax as well as income taxes in multiple state and local jurisdictions. The Company has concluded all U.S. federal tax matters for years through December 31, 2016. All material state and local income tax matters have been concluded for years through December 31, 2015. The Company is no longer subject to IRS examination for the tax years ended on or before December 31, 2016; however, carryforward losses that were generated through the tax year ended December 31, 2016 may still be adjusted by the IRS if they are used in a future period. The Company had no reserve for uncertain tax positions as of December 31, 2020 and 2019.\nNOTE 12 - SUBSEQUENT EVENTS\nWe have evaluated subsequent events occurring after December 31, 2020 and based on our evaluation we did not identify any events that would have required recognition or disclosure in these financial statements, except for the following.\nOn February 11, 2021, we entered into an At Market Issuance Sales Agreement (the “Sales Agreement”) with B. Riley Securities, Inc. (“Agent”) under which the Company may offer and sell, from time to time at its sole discretion, shares of its common stock to or through the Agent as its sales agent, having an aggregate offering price of up to $30,000,000. As of March 8, 2021, we had sold a total of 378,108 shares of common stock under this Sales Agreement for total proceeds of approximately $14.1 million, net of estimated transaction costs.\nIn the first quarter of 2021, our Interim Chief Executive Officer vested in 55,000 RSUs with market conditions based on the Company’s stock price targets. In connection with the settlement of these RSUs, the Company paid $373,000 in taxes on behalf of our Interim Chief Executive Officer in exchange for the surrender of 15,651 shares of the Company’s common stock."
}