{
    "cik": "1389067",
    "company": "TAUTACHROME INC.",
    "filing_type": "10-K",
    "filing_date": "2021-03-30",
    "period_of_report": "2020-12-31",
    "sic": "7372",
    "state_of_inc": "DE",
    "state_location": "AZ",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1389067/0001477932-21-001762-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1389067/000147793221001762/ttcm_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1389067/0001477932-21-001762.txt",
    "filename": "1389067_10K_2020_0001477932-21-001762.htm",
    "item_1": "Item 1. Business Factors\nHistory\nThe Company was formed in Delaware on June 5, 2006 as Caddystats, Inc.\nOn March 3, 2009, the Company acquired all of the voting shares of Roadships Holdings, Inc., a Florida Corporation, and Roadships America, Inc., also a Florida Corporation in exchange for an aggregate of 16,025,000 shares of the Company’s common stock. On March 4, 2009, the Company changed its name to Roadships Holdings, Inc.\nOn May 26, 2015, the Company acquired all the voting shares of Click Evidence Inc., an Arizona corporation. Effective November 2, 2015, the Company changed its name to Tautachrome Inc.\nOur Business\nTautachrome operates in the internet applications space, a large business space we believe to be uniquely able to make possible fast growing and novel business. The iPhone, Google, Facebook, Amazon, Uber and numerous other examples are reminders of the ability of the internet applications business space to surprise us with new business universes “out of nowhere.” A recent arrival in the internet applications space is blockchain technology, a technology empowering entities to create ecosystems of trade based on self-introduced and globally useable secure trading currencies. Blockchain technology has added a significant element to Tautachrome’s business plans and activities. In addition, the subsequent development of a new patent pending technology dubbed ARknet technology that exploits augmented reality in a new solution to the purchasing interaction between global consumers and providers has been licensed by the Company for development.\nTautachrome is currently pursuing three main avenues of business activity based on our patented activated imaging technology, our blockchain trading currency, and the ARknet patent pending technology (together banded “KlickZie” technology):\n1.\nKlickZie ARknet technology business: Our licensed activity to develop and monetize a new augmented reality (“AR”) technology called “ARknet technology which permits goods and services providers to establish geolocated augmented reality interfaces, called ARks, allowing consumers to interact with inside info on the provider’s products, specials and discounts with live purchasing provided. A provider’s ARk may be located anywhere on earth, at a store location, or anywhere else the provider may desire. The ARknet is a fintech platform connecting consumers to providers in the global $48 trillion household purchasing market, using augmented reality as the medium of interaction.\n2.\nKlickZie’s blockchain trading currency ecosystem: our recently added activity to create our own KlickZie blockchain and trading currency to incentivize consumer usage of the ARknet paltform, and\n3.\nKlickZie Activated Digital Imagery business: our longstanding flagship activity to develop and monetize downloadable apps based on our patented KlickZie trusted imaging technology and based on our patented trusted image-based social interactions using the pictures and videos that smartphone users generate on the web using their KlickZie imaging app.\n1. ARk Business Activity\nOn October 17, 2018, the Company licensed and is now developing the ARknet technology, a Fintech patent pending technology aimed at the global household goods and services market. ARks are floating interactive pictures (ARk Symbols) only visible around you in the Augmented Reality view provided by the ARknet app using the camera imager in your smartphone. ARks are intended for goods and service providers as a way to draw attention to customers in the vicinity of a provider’s ARk Symbol. Shoppers and buyers seeing a Symbol can interact with the provider’s goods or services via the ARk Symbol. The picture above is a shopping mall scene, where two stores, Claire’s on your right, and rue 21 etc! on your left, are shown displaying interactive ARk symbols. Claire’s ARk is a “standard” ARk symbol, while rue 21 etc! uses a picture of their “etc. Gold” perfume product as their ARk symbol. Either way, using their smartphone imager an ARknet app users can touch the store’s ARk Symbol and on their smartphone access the provider’s Ark page containing interest-grabbing information, including pictures or videos of today’s specials, in-ARk purchase and checkout features, reviews, links, menus, social media profiles or anything else the store wants to advertise.\nArks may be mobile ARks, using the app user’s mobile device to mobilize the ARk location, or stationary ARks, using a set geo location determined by coordinates or determined by fixing the ARk location by moving the ARk owner’s mobile device to a desired location and setting the stationary ARk’s location there.\nProviders may create their ARks, decide on their ARk Symbol, choose their Symbol geolocations and provide for license payment to the Company, using features in the ARk app.\nWe intend the ARk app to be free to consumers and other users wishing to use the app to survey their environ for the presence of ARk symbols.\nWe envision a KlickZie ARknet with billions of users and ARks connecting humanity, commerce, information, crypto currency, and innovation in useful ways. Plus, we want to return the ownership of users’ information and valuable items such as images and video, back to where it rightfully belongs, the individual user.\nFor additional information, visit https://myarknet.io.\n2. KlickZie blockchain trading currency\nIn late 2017 we formed a development team of providers to develop a KlickZie blockchain (branded the “zChain”) to handle transactions using a cryptographically secured trading currency designated the “KLK” currency. The KLK is intended to be the currency of the imagery trading ecosystem allowing KlickZie users to monetize their pictures and videos and thereby enabling the ability to conduct widescale buying, selling and licensing of KlickZie pictures and videos.\nOur development team consists of individuals from the blockchain development company Kelecorix, Inc., and individuals from the image storage company Honeycomb Digital, LLC. The team has developed the software and architecture for the implementation of a simple KlickZie app that seeks to implement the ownership properties of KlickZie imaging.\nLike other blockchains, the zChain is intended to run in a decentralized manner. “Smart contracts” residing on the zChain would implement the buying, selling licensing and other trading features on the zChain. Such smart contracts would implement a commission on zChain transactions that involve participation by the Company to complete (for instance the certification of the validity of KlickZie imagery when requested).\nBecause KlickZie users own the imagery they create, the use of KlickZie imagery by others, including advertisers, could be done through the execution of a smart contract on the zChain transferring KLK currency from the advertiser to the user.\n3. KlickZie technology-based business activity\nTautachrome’s KlickZie technology addresses two features of the internet age that create a new need and a new opportunity. The first is the need for a way to trust the pictures and videos you see on the web. Right now the trillions of pictures and frames of video on the web are so easily and often falsified that trustability of internet imagery is essentially zero. For this reason we believe that a universally available, downloadable system that turns the everyday pictures and videos we take from our smartphones into imagery that can be trustable to others seeing it, will have substantial value . We would like to see only two kinds of imagery come to exist on the web: imagery whose trustworthiness everybody can be certain of, and all the rest of the imagery for which the notion of trust is meaningless. The KlickZie system aims to satisfy the requirement of for universal trustability for the ordinary imagery it produces.\nThe technology required for trustability also opens the door to a new opportunity. This is the opportunity to enable people to use KlickZie pictures and videos on the web to readily and safely interact with each other via the imagery itself. It is frequently the case that when you run across interesting imagery on the web you cannot know anything about it, including who the author is, who else may have seen it, or what others may think or know about it. By allowing people to interact with interesting or important pictures or videos by using the imagery itself as the portal of communication, the KlickZie system can add the viewpoints and the information offerings of interacting people to the richness of pictures and videos. This can be carried by the system into the future along with the imagery, as an evolving information structure of interaction and imagery.\nKlickZie imaging Platform\nUsers will download KlickZie’s free software into their mobile device (iPhone, Android or other smartphone). The software, an upgrade to the smartphone’s camera software, will activate the pictures and videos taken by their device using proprietary KlickZie marking technology. Behind the scenes, KlickZie will capture the imagery and available metadata related to the imaging event, and mark the imagery and its metadata with advanced and invisible KlickZie marking technology.\nKlickZie activation seeks to add a new utility to ordinary pictures and videos. Other KlickZie users who come across an activated picture can communicate with the author of the picture, or with amenable others who have seen the picture or with the data stored in the picture by clicking or touching the picture (“touch-to-comm”). We intend the picture itself by click or touch to make the communication happen no matter where or how you come across an activated picture.\nWhat happens to an activated picture from its creation onward is intended to be added to the picture’s data for tracking into the future. Activated pictures seek to answer many questions. For example, in a group photo you could ask: Have any of the people in my contacts list interacted with this picture? Are any of them engaging it right now? Who else besides my contacts have already engaged this picture in some way? Who took it? Where? When?\nThe upshot is that activation seeks to allow effective touch to comm with the authors and viewers of smartphone pictures and videos, and to ensure that activated pictures and videos can be trusted.\nKlickZie Product Rollout\n·\nPhase 1: Build the minimal testable KlickZie system -including the Arknet app and trusted imaging app and the service cloud.\n·\nPhase 2: Release the KlickZie system into a limited audience to optimize user experience and user interfaces, to set up the KlickZie cloud for global scale up, and to plan global rollout.\n·\nPhase 3: Roll out the KlickZie system of ARks, trusted imaging, and the KLK trading currency, culture by culture and language by language, adding support staff and services as rollout moves forward.\nMonetizing\nAs presently conceived, the KlickZie product aims at revenues from four primary sources:\n·\nARk licensing fees paid by ARk-using providers\n·\nWell behaved advertising.\n·\nUser premium service fees.\n·\nEnterprise revenue paid by entities licensing our technologies for enterprise usages.\nFunding\nWe plan to continue raising funds to finance KlickZie product rollout.\nOngoing financing is currently being accomplished by equity sale, by incurring debt, and by other innovative means. There can be no assurances given that any of our funding efforts will be successful.\nFirst KlickZie revenues\nOur Plan of Operations for KlickZie based revenue looks for first revenues from ARk business app users coming on line within the first year after the receipt of funding sufficient to round out the KlickZie team. Preparations for other KlickZie revenue are geared for the two year and out timeframe.\nShelved business activity\nGeneral app development and digital design activities that were being carried out under our wholly-owned Polybia Studios subsidiary, and our acquisition activities that were being carried out under our Appquisitions Division have been shelved for the time being. Work on our PhotoSweep app has also been shelved in preference to a strict focusing on the KlickZie business activity.\nCompetition\nWith regard to the internet applications in general, competition is intense. According to Statista there are millions of smartphone applications available to users. In spaces that are this crowded the principal matter of competition is about capturing user mind space, which for a given product consists of elements such as degree of product exposure to users, degree of product apparent desirability, pleasure of product usage, and persisting necessity for the product in a user’s life. These elements of competition are well known to our competitors which include the internet giants Google, Apple, Facebook and Amazon, all of whom have financial resources and operating staffs substantially larger than those of the Company, and all of whom can focus on the optimization of their products towards the same consumer and business arenas upon which we intend to focus.\nWith regard to the ARknet augmented reality space, while there is no direct competition in the space at the moment, that could change in a heartbeat with an interest taken by any of the internet giants mentioned above.\nWith regard to KlickZie’s technology for marking, storing and tracking digital imagery, there are many firms who mark, store and track digital imagery. Among these have been Digimarc, BatchPhoto, and Thirdlight who have marketed such processes for purposes of protecting intellectual property. To our knowledge none of these has turned the smartphone into a generally trustable imager or an advanced image-based communicator as envisioned here. This requires substantially more talent and development activity than required for marking, storing and tracking digital imagery. However, there is nothing stopping any firm, particularly the internet giants, from entering into similar activity. Moreover Truepic, which entered the arena of smartphone trusted imagery, also has patents related to trusted imagery. We have reviewed Truepic’s patent claims and believe that our planned applications do not infringe their claims.\nIntangible Properties: issued and pending patents\nThe proprietary nature of, and protection for, our technologies, processes, and know-how are important to our business. Our success could substantially depend upon our ability to protect the proprietary nature of our technologies and know-how, to protect our technology from infringement, misappropriation, discovery and duplication, and to operate without infringing the proprietary rights of others.\nWe seek patent protection for our technologies. Our policy is to patent the technology, inventions and improvements that we consider important to the development of our business. We cannot be sure that any of our pending patent applications will be granted, or that any patents or licenses which we own or obtain in the future will fully protect our position. Our patent rights and the patent rights of technology companies in general, are highly uncertain and include complex legal and factual issues. We believe that our existing technology licensing, and the patents which we hold and for which we have applied, do not infringe anyone else's patent rights. We believe our technology and patent rights will provide meaningful protection against others duplicating our proprietary technologies. We cannot be sure of this, however, because of the complexity of the legal and scientific issues that could arise in litigation over these issues.\nDespite these measures, any of our intellectual property and proprietary rights could be challenged, invalidated, circumvented, infringed or misappropriated, or such intellectual property and proprietary rights may not be sufficient to permit us to take advantage of current market trends or otherwise to provide competitive advantages.\nAs of the date of this annual report, our patent portfolio includes the patents and applications issued by and filed with the USPTO and the purchase technology licensing as described in the following table:\nTitle\nStatus\nPatent or Application Number\nGrant or Application Date\nLicense to commercialize the patent: Exploitation Of Augmented Reality And Cryptotoken Economics In An Information-Centric Network Of Smartphone Users And Other Imaging Cyborgs\nPatent pending owned by Arknet Inc & licensed to Tautachrome\n62/755589\n11/05/18\nAuthentication And Validation Of Smartphone Imagery\nPatent granted to & owned by Tautachrome\n02/28/17\nAuthentication And Validation Of Smartphone Imagery\nPatent granted to & owned by Tautachrome\n07/10/18\nAuthentication And Validation Of Smartphone Imagery\nPatent granted to & owned by Tautachrome\n07/10/18\nSystem And Method For Creating, Processing, And Distributing Images That Serve As Portals Enabling Communication With Persons Who Have Interacted With The Images\nPatent granted to & owned by Tautachrome\n03/27/18\nSystem And Method For Creating, Processing, And Distributing Images That Serve As Portals Enabling Communication With Persons Who Have Interacted With The Images\nPatent granted to & owned by Tautachrome\n15/888381\n02/05/18\nWe rely upon unpatented trade secrets, know-how, and continuing technological innovation to develop and maintain our competitive position. We seek to protect our ownership of know-how and trade secrets through an active program of legal mechanism including assignments, confidentiality agreements, material transfer agreements, research collaborations, and licenses.\nEmployees\nTautachrome, Inc. has no employees. Services are currently provided through independent contractors.",
    "item_1A": "Item 1A. Risk Factors\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), and are not required to provide the information required under this item.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNot applicable.",
    "item_2": "Item 2. Properties\nOur principal business and corporate address is 1846 E Innovation Park Drive, Oro Valley, Arizona 85755 (Telephone: 520 318 5578).\nWe do not currently have any investments or interests in real estate, nor do we have investments or any interest in real estate mortgages or securities of entities engaged in real estate activities.",
    "item_3": "Item 3. Legal Proceedings\nUnited States District Court\nOn October 10, 2017, the Company received a letter from the lawyer of Eric L McRae (“McRae”) a person whose association with the Company was terminated by the Company on June 16, 2017. The letter demanded payment of 850,000,000 unrestricted Tautachrome common shares to forestall his filing a laundry list of complaints in a variety of government agencies including with the US District Court in Kansas with complaints of contract breaches and fraud by silence, with the EEOC with complaints of termination by racial discrimination, with the OSHA with complains of termination for reasons of his being a whistleblower under Sarbanes-Oxley provisions, and with various regulatory agencies with accusations of an unspecified nature.\nOn October 12, 2017, McRae filed a complaint, later amended twice, against the Company in the US District Court in Kansas. The amended complaint alleges 1) that the Company breached a written agreement in an alleged employment by failing to pay him 35,000,000 shares of the Company’s common stock and terminating his association with the Company on June 16, 2017 without proper notice. The complaint goes on to allege 2) that the Company committed fraud by silence for failing to inform him of an intent to receive the benefit of his services while harboring an intent to not compensate him, 3) that the Company breached an unwritten agreement with him to provide him with 185,000,000 shares of the Company’s common stock, and 4) that the Company breached a convertible promissory note by failing and refusing to repay him the principal and accrued interest thereunder. Complaint number 4 is now moot in the belief of the Company since after the lawsuit was filed the Company continued to repay McRae’s convertible promissory note on schedule with interest due until paid in full on October 1, 2018, thus extinguishing the note and making the matter moot. These matters remain before the Court.\nOn December 12, 2017, McRae brought the Company before the Kansas Human Rights Commission and the U.S. Equal Employment Opportunity Commission (EEOC) alleging that on June 16, 2017 he was terminated from an alleged employment by the Company on the basis of race and for retaliation, and that the Company discriminated against him in the terms of this alleged employment because of race. The Kansas Human Rights Commission dismissed this claim.\nOn December 8, 2017, McRae filed a complaint with the Occupational Safety and Health Administration (the “OSHA”), alleging that his “investigation and reporting” to the Company’s CEO was a contributing factor in the termination of his alleged employment by the Company in violation of the Sarbanes-Oxley Act whistleblower’s provisions. On January 2, 2018, the Company delivered its response to the complaint, denying each of McRae’s allegations and providing its own presentation of the facts. McRae dismissed the OSHA claim with prejudice, and the matter cannot be brought again.\nOn May 5, 2020 the Company settled with the McRae estate for 50 million common shares. We valued the shares at the settlement date (May 5, 2020 on which date our closing price was $0.0029) and recorded a Gain on Litigation in the amount of $105,000, a reduction of the amount of the liability to $145,000 as a result of that revaluation. We issued the shares on May 18, 2020.",
    "item_4": "Item 4. Mine Safety Disclosures\nNot applicable.\nPART II - OTHER INFORMATION",
    "item_5": "Item 5. Market for Common Equity and Related Stockholder Matters\nMarket Information\nOur shares trade on the OTC PINK under the symbol “TTCM”. The following table sets forth the high and low closing bid prices of our common stock for the last two calendar years, as reported by OTC Markets Group Inc. and represents inter dealer quotations, without retail mark-up, mark-down or commission and may not be reflective of actual transactions:\nQuarter Ended\nHigh\nLow\nDecember 31, 2020\n$ 0.0080\n$ 0.0050\nSeptember 30, 2020\n0.0065\n0.0022\nJune 30, 2020\n0.0065\n0.0022\nMarch 31, 2020\n0.0134\n0.0026\nDecember 31, 2019\n$ 0.0129\n$ 0.0041\nSeptember 30, 2019\n0.0289\n0.0047\nJune 30, 2019\n0.0088\n0.0004\nMarch 31, 2019\n0.0016\n0.0004\nHolders\nOn December 31, 2020, the Company had approximately 585 stockholders of record, and approximately 7,004 beneficial owners of shares of common stock whose shares are held in the names of various security brokers, dealers, and registered clearing agencies, for a total of approximately 7,589 beneficial owners of shares of common stock.\nDividends\nWe have not declared or paid cash dividends on our common stock since inception and do not anticipate paying such dividends in the foreseeable future. The payment of dividends may be made at the discretion of the Board of Directors and will depend upon, among other factors, our operations, capital requirements, and overall financial condition.\nRecent Sales of Equity Securities\n·\nWe issued 560,931,025 shares in conversion of outstanding convertible promissory notes.\n·\nWe issued 3,333,333 shares for services.\n·\nWe issued 1,750,000 shares for cash.\n·\nWe issued 50,000,000 shares to settle a legal claim.\nSecurities Authorized for Issuance under Equity Compensation Plans\nNone.",
    "item_6": "Item 6. Selected Financial Data\nWe are a smaller reporting company as defined by Rule 12b-2 of the Exchange Act and are not required to provide the information required under this item.",
    "item_7": "Item 7. Management’s Discussion and Analysis or Plan of Operation\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) provides information for the year ended December 31, 2020 and December 31, 2019. This MD&A should be read together with our audited consolidated financial statements and the accompanying notes for the fiscal years ended December 31, 2020 and December 31, 2019.\nThis discussion contains forward-looking statements that involve certain risks and uncertainties. See “Forward-Looking Statements” elsewhere in this report.\nOverall Performance\nWe are an early stage internet applications company, engaged in advanced technology and business development in the internet applications space. We have incurred general and administrative costs, marketing expenses and research and development costs since we commenced our current operations in May 2015, against very little revenue.\nThe Company’s audited consolidated financial statements and the accompanying notes for the years ended December 31, 2020 and December 31, 2019, have been prepared on a going concern basis which assumes that the Company will be able to realize its assets and discharge its liabilities in the normal course of business. We had negative cash flows from operations of $90,344 and $1,014,724 for the years ended December 31, 2020 and 2019, respectively, with recurring losses and negative working capital of $3,867,587 and $4,329,297 as at December 31, 2020 and 2019, respectively. These conditions raise substantial doubt as to our ability to continue as a going concern. The financial statements do not include any adjustments that might be necessary if we are unable to continue as a going concern.\nThe continuing operations of the Company are dependent upon our ability to raise adequate financing and to commence profitable operations in the future. The Company may raise additional capital through the sale of its equity securities, through an offering of debt securities, or through loans from related parties. We believe that actions presently being taken to obtain additional funding may provide the opportunity for the Company to continue as a going concern. There is no guarantee, however, that the Company will be successful in achieving these objectives.\nResults of Operations for the Years ended December 31, 2020, and 2019\nNet Comprehensive Loss\nThe Company realized a net comprehensive loss of $2,874,525 for the year ended December 31, 2020 compared to a net comprehensive loss of $3,388,979 for the year ended December 31, 2019.\nRevenue and Cost of Sales\nThe Company recognized $1,015 in revenue for the year ended December 31, 2020 versus $209 in 2019. The company has two sources of revenues: the online sales platform in which we take a 2% fee for all merchant sales made on the platform and promotional products such a t-shirts. Cost of sales were $371 for the year ended December 31, 2020 versus non in 2019.\nOperating Expenses\nThe Company’s total operating expenses for the year ended December 31, 2020 were $1,625,789 compared to $1,171,816 for the year ended December 31, 2019, an increase of $453,973, or 39%).\nFor the year ended December 31, 2020, the Company incurred general and administrative expenses of $607,274 compared to $617,877 for the year ended December 31, 2019, a decrease of $10,603 (2%) primarily attributable to increased software development activity offset by decreases in consulting costs . The following table sets out the material components of the Company’s general and administrative expenses for the years ended December 31, 2020 and 2019.\nYear Ended December 31,\nCategory of General and Administrative Expense\nLegal and accounting fees\n$ 129,329\n$ 272,447\nConsulting\n85,860\n75,000\nOther professional services\n77,053\n166,842\nOffice and occupancy costs\n27,422\n19,603\nArknet license fees\n200,000\n-\nAdvertising and promotion\n64,764\n49,967\nDepreciation and amortization\n3,621\n-\nOther\n19,225\n34,018\n$ 607,274\n$ 617,877\nResearch and development\nResearch and development costs were $1,014,894 in 2020 versus $553,939 in 2019 owing to increased development activity.\nOther Expenses\nDuring the year ended December 31, 2020, we recorded a gain of $105,000 on our settlement of the McRae affair (See Note 6 to the financial statements). We had no such gains in the previous year.\nDuring the year ended December 31, 2019, we had losses on settlements of debt of $96,993. We had no such losses in the current year.\nThe Company recorded $1,021,100 of interest expense during the year ended December 31, 2020 versus $568,828 during the previous year. About $400,000 was due to an increase in discount amortization due to the introduction of derivative liabilities associated with the issuance of new convertible notes.\nDuring the year ended December 31, 2019, we had $127,031 of losses on conversion of debt. During 2020, we had 37,267 of such losses.\nDuring the year ended December 31, 2020, we recorded loss on changes in the value of our derivative liabilities in the amount of $215,812 compared to a loss of $1,426,354 for the year ended December 31, 2019.\nOther Comprehensive Loss\nAt each balance sheet date, transactions and balances that are denominated in a currency other than U.S. dollars are adjusted to reflect the current exchange rate which may give rise to a foreign currency translation adjustment accounted for as a separate component of stockholders’ equity and included in other comprehensive income. The Company recorded a translation loss of $80,201 for the year ended December 31, 2020, compared to a gain of $1,837 for the year ended December 31, 2019. These amounts are included in the Company’s statement of operations as foreign currency gain (loss) for the respective years.\nLiquidity and Capital Resources\nAs of the date of this report, the Company has generated only $1,221 in revenue and is not profitable. The Company’s operations to date have been funded primarily by private placements of common stock and convertible notes, as well as by loans from its management and controlling stockholders.\nAs at December 31, 2020, the Company had $114,527 in cash and $3,982,114 in current liabilities resulting in a working capital deficit of $3,867,587. The Company is not currently able to maintain its operations through its existing cash balances and internally generated cash flows. Moreover, we have determined that the current capital structure of the Company is not adequate to fund its planned growth.\nWe intend to secure additional capital to fund the Company’s operations through the issuance of common stock, convertible debt instruments and loans from our management. There can be no assurance that we will be successful in obtaining the capital the Company requires to achieve its business objectives, or that such capital will be available on acceptable terms. Future cash flows are subject to a number of variables, including technology development costs, technology product rollout and support expense and the demand for the Company’s products and services.\nOperating Activities\nDuring the year ended December 31, 2020, the Company used net cash of $910,344 in operating activities compared to $1,014,724 for the year ended December 31, 2019. The decrease was primarily attributable to decreased net losses.\nThe Company’s average monthly cash burn rate was $75,862 during the year ended December 31, 2020, compared to $84,560 for the year ended December 31, 2019. Subject to the success of the Company’s financing activities, we expect to increase operating activities in the coming year with a concomitant increase in the Company’s monthly burn rate. We will not be able to predict the increase to our burn rate until we have determined the outcomes of our financing activities.\nInvesting Activities\nThe Company purchased on hend-held self-positioning white light scanner system during the year ended December 31, 2020. The original cost was $43,447.\nFinancing Activities\nThe Company received net cash of $1,125,215 from financing activities during the year ended December 31, 2020, consisting primarily from the issuance of convertible notes. During the year ended December 31, 2019, we received a net of $1,038,010 from financing activities which, again, we primarily from the issue of convertible notes. We expect to continue our financing activities to fund our operations until such time as the Company’s technologies are commercialized and we generate revenue on a profitable basis.\nOff Balance Sheet Arrangements\nWe currently have no off-balance sheet arrangements that have or are reasonably likely to have a current or future material effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources.\nCritical Accounting Policies\nThe discussion and analysis of the Company’s financial condition and results of operations is based upon its financial statements, which have been prepared in accordance with the accounting principles generally accepted in the United States of America. Preparing financial statements requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue, and expenses. These estimates and assumptions are affected by management’s application of accounting policies. We believe that understanding the basis and nature of the estimates and assumptions involved with the following aspects of the Company’s financial statements is critical to an understanding of its financial statements.\nWe adopted ASC 606 effective January 1, 2018 using the modified retrospective method. Under this method, the Company follows the five-step model provided by ASC Topic 606 in order to recognize revenue in the following manner: 1) Identify the contract; 2) Identify the performance obligations of the contract; 3) Determine the transaction price of the contract; 4) Allocate the transaction price to the performance obligations; and 5) Recognize revenue. An entity recognizes revenue for the transfer of promised goods or services to customers in an amount that reflects the consideration for which the entity expects to be entitled in exchange for those goods or services. The Company’s revenue recognition policies remained substantially unchanged as a result of the adoption of ASC 606, and there were no significant changes in business processes or systems.\nIn February 2016, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) No. 2016-02, “Leases (Topic 842)” and subsequent amendments, which replaced existing lease accounting guidance in GAAP and requires lessees to recognize right-of-use assets and corresponding lease liabilities on the balance sheet for all in-scope leases with a term of greater than 12 months and requires disclosure of certain quantitative and qualitative information pertaining to an entity’s leasing arrangements. The Company adopted the standard as of January 1, 2019. The adoption of the standard did not have a material impact on the Company’s consolidated statements of operations or consolidated statements of cash flows.\nUse of Estimates\nThe preparation of these financial statements in conformity with generally accepted accounting principles in the United States requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. We regularly evaluate estimates and assumptions related to the recoverability of long-lived assets, valuation of convertible debentures, assumptions used to determine the fair value of stock-based compensation and derivative liabilities, and deferred income tax asset valuation allowances. We base our estimates and assumptions on current facts, historical experience and various other factors that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities and the accrual of costs and expenses that are not readily apparent from other sources. The actual results experienced by the Company may differ materially and adversely from our estimates. To the extent there are material differences between the estimates and the actual results, future results of operations will be affected.\nFair Value of Financial Instruments\nWe adopted the Financial Accounting Standards Board’s (FASB) Accounting Codification Standard No. 820 (“ASC 820), Fair Value Measurements and Disclosures. ASC 820 defines fair value, establishes a framework for measuring fair value and expands disclosure of fair value measurements. ASC 820 applies under other accounting pronouncements that require or permit fair value measurements and accordingly, does not require any new fair value measurements. ASC 820 clarifies that fair value is an exit price, representing the amount that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants. As such, fair value is a market-based measurement that should be determined based on assumptions that market participants would use in pricing an asset or liability. As a basis for considering such assumptions, ASC 820 established a three-tier fair value hierarchy, which prioritizes the inputs used in measuring fair value as follows:\nLevel 1 - Observable inputs such as quoted prices in active markets;\nLevel 2 - Inputs, other than the quoted prices in active markets, that are observable either directly or indirectly; and\nLevel 3 - Unobservable inputs in which there is little or no market data, which require the reporting entity to develop its own assumptions.\nThe Company’s financial instruments consist principally of cash, amounts receivable, accounts payable, and accrued liabilities, due to related parties and convertible notes. Pursuant to ASC 820, the fair value of the Company’s cash is determined based on “Level 1” inputs, which consist of quoted prices in active markets for identical assets. We believe that the recorded values of all of the Company’s other financial instruments approximate their current fair values because of their nature and respective maturity dates or durations.\nRecent Accounting Pronouncements\nWe have reviewed the FASB issue Accounting Standards Update, (“ASU”) accounting pronouncements and interpretations thereof that have effectiveness dates during the period reported and in future periods. The Company has carefully considered the new pronouncements that alter previous generally accepted accounting principles and does not believe that any new or modified principles will have a material impact on the corporation’s reported financial position or operations in the near term. The applicability of any standard is subject to the formal review of our financial management and certain standards are under consideration.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nA smaller reporting company is not required to provide the information required by this item.",
    "item_8": "Item 8. Financial Statements and Supplemental Data\nPAGE\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets - December 31, 2020 and 2019\nConsolidated Statements of Operations for the years Ended December 31, 2020 and 2019\nConsolidated Statement of Changes in Stockholders’ Deficit from December 31, 2018 to December 31, 2020\nConsolidated Statements of Cash Flows for the years ended December 31, 2020 and 2019\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of Tautachrome, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Tautachrome, Inc. (the Company) as of December 31, 2020 and 2019, and the related consolidated statements of operations, changes in stockholders’ deficit, and cash flows for the two-year period then ended, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2020 and 2019, and the results of its operations and its cash flows for the years then ended in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB .\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and the significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinion on the critical audit matters or on the accounts or disclosures to which they relate.\nConvertible Notes Payable and Derivative Liabilities\nAs discussed in Note 5, the Company borrows funds through the use of convertible notes payable that contain a conversion price that may be fixed or fluctuates with the stock price. Due to the fluctuation of the conversion price, the embedded conversion feature requires bifurcation from the host contract and is recorded as a liability subject to market adjustments as of each reporting period. Significant judgment is exercised by the Company in determining derivative liability values for these convertible note agreements, including the use of a specialist engaged by management.\nWe evaluated management’s conclusions regarding their derivative liability and reviewed support for the significant inputs used in the valuation model, as well as assessing the model for reasonableness.\nGoing Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has suffered net losses from operations and has a net capital deficiency, which raises substantial doubt about its ability to continue as a going concern. Management’s plans regarding those matters are discussed in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\n/s/ M&K CPAS, PLLC\nM&K CPAS, PLLC\nWe have served as the Company’s auditor since 2018\nHouston, TX\nMarch 30, 2021\nTAUTACRHOME, INC. AND CONSOLIDATED SUBSIDIARIES\nConsolidated Balance Sheets\n12/31/2020\n12/31/2019\nASSETS\nCurrent assets:\nCash\n$ 114,527\n$ 31,366\nPrepaid expenses\n-\nTotal current assets\n114,527\n31,769\nNon-current assets:\nProperty, plant and equipment, net\n39,826\n-\nTOTAL ASSETS\n$ 154,353\n$ 31,769\nLIABILITIES\nAccounts payable and accrued expenses\n$ 789,052\n$ 411,236\nAccounts payable - related party\n510,313\n257,282\nLoans from related parties\n104,762\n103,032\nConvertible notes payable - related party, net\n50,094\n111,999\nShort-term convertible notes payable, net\n999,406\n814,685\nConvertible notes payable in default\n32,000\n32,000\nShort-term notes payable\n16,957\n15,465\nDerivative liability\n1,479,530\n2,365,367\nCourt judgment liability\n-\n250,000\nTotal current liabilities\n3,982,114\n4,361,066\nLong-term convertible notes payable, net\n-\n158,156\nLong-term convertible notes payable, related party, net\n10,080\n84,091\nTotal non-current liabilities\n10,080\n242,247\nTOTAL LIABILITIES\n3,992,194\n4,603,313\nSTOCKHOLDERS' DEFICIT\nSeries D Convertible Preferred, par value $0.0001. 13,795,104 shares authorized, 13,795,104 shares issued and outstanding at December 31, 2020 and 2019\n1,380\n1,380\nSeries E Convertible Preferred Stock, par value $0.0001. 40,000,000 shares authorized, 40,000 and zero shares outstanding at December 31, 2020 and 2019, respectively\n-\nSeries F Convertible Preferred Stock, par value $0.00001. 290,400 shares authorized, 290,397 and zero shares issued and outstanding at December 31, 2020 and December 31, 2019, respectively\n-\nCommon stock, $0.00001 par value. 4.5 billion shares authorized. 4,120,475,247 and 3,504,460,889 shares issued and outstanding at December 31, 2020 and December 31, 2019, respectively\n41,205\n35,045\nAdditional paid in capital\n11,427,087\n6,095,053\nCommon stock payable\n336,584\n2,066,584\nAccumulated deficit\n(15,661,969 )\n(12,867,645 )\nEffect of foreign currency exchange\n17,838\n98,039\nTOTAL STOCKHOLDERS' DEFICIT\n(3,837,841 )\n(4,571,544 )\nTOTAL LIABILITIES AND STOCKHOLDERS' DEFICIT\n$ 154,353\n$ 31,769\nThe accompanying notes are an integral part of these financial statements.\nTAUTACHROME, INC. AND CONSOLIDATED SUBSIDIARIES\nConsolidated Statements of Operations\nYear Ended December 31\nREVENUES\nOnline sales platform\n$ 149\n$ -\nProducts\nTotal revenues\n1,015\nCost of sales\n-\nGross profit\nOPERATING EXPENSES\nGeneral and administrative\n$ 607,274\n$ 617,877\nDepreciation expense\n3,621\n-\nResearch and development\n1,014,894\n553,939\nTotal operating expenses\n1,625,789\n1,171,816\nOperating loss\n(1,625,145 )\n(1,171,610 )\nOTHER INCOME / (EXPENSE)\nGain on litigation\n105,000\n-\nLoss on settlement of debt\n-\n(96,993 )\nInterest expense\n(1,021,100 )\n(568,828 )\nChange in value of derivatives\n(215,812 )\n(1,426,354 )\nLoss on conversion of debt\n(37,267 )\n(127,031 )\nTotal other\n(1,169,179 )\n(2,219,206 )\nNet loss\n$ (2,794,324 )\n$ (3,390,816 )\nOTHER COMPREHENSIVE INCOME (LOSS)\nEffect of foreign currency exchange\n(80,201 )\n1,837\nNet comprehensive loss\n$ (2,874,525 )\n$ (3,388,979 )\nNet loss per common share\nBasic and diluted\n$ (0.00 )\n$ (0.00 )\nWeighted average shares outstanding\nBasic and diluted\n3,891,303,488\n3,125,254,373\nThe accompanying notes are an integral part of these financial statements.\nTAUTACHROME, INC. AND CONSOLIDATED SUBSIDIARIES\nConsolidated Statement of Changes in Stockholders’ Deficit\nFrom December 31, 2018 to December 31, 2020\nCommon Stock\nPreferred Stock\nSeries D\nPreferred\nStock Series E\nPreferred\nStock Series F\nAdditional Paid in\nStock\nOther Comprehensive\nIncome\nAccumulated\nTotal Stockholders'\nEquity /\nShares\nAmount\nShares\nAmount\nShares\nAmount\nShares\nAmount\nCapital\nPayable\n(Loss)\nDeficit\n(Deficit)\nBalance, 12/31/18\n1,932,483,910\n$ 19,325\n13,795,104\n$ 1,380\n-\n$ -\n-\n$ -\n$ 4,692,609\n$ 1,919,927\n$ 96,202\n$ (9,476,829 )\n$ (2,747,386 )\nShares issued for conversion of debt\n1,551,562,038\n15,516\n-\n-\n-\n-\n-\n-\n686,054\n-\n-\n-\n701,570\nShares issued to settle claims\n16,123,055\n-\n-\n-\n-\n-\n-\n188,462\n-\n-\n-\n188,623\nShares issued for stock payable\n4,291,886\n-\n-\n-\n-\n-\n-\n26,238\n(26,281 )\n-\n-\n-\nShares earned by consultants\n-\n-\n-\n-\n-\n-\n-\n-\n-\n172,938\n-\n-\n172,938\nCapital contributed\n-\n-\n-\n-\n-\n-\n-\n-\n13,750\n-\n-\n-\n13,750\nDerivative associated with early debt retirement\n-\n-\n-\n-\n-\n-\n-\n-\n471,233\n-\n-\n-\n471,233\nImputed interest\n-\n-\n-\n-\n-\n-\n-\n-\n16,707\n-\n-\n-\n16,707\nEffect of foreign currency exchange\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n1,837\n-\n1,837\nNet loss\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n(3,390,816 )\n(3,390,816 )\nBalance, December 31, 2019\n3,504,460,889\n$ 35,045\n13,795,104\n$ 1,380\n-\n-\n-\n-\n$ 6,095,053\n$ 2,066,584\n$ 98,039\n$ (12,867,645 )\n$ (4,571,544 )\nShares issued for conversion of debt\n560,931,025\n5,609\n-\n-\n-\n-\n-\n-\n843,752\n-\n-\n-\n849,361\nShares issued for services\n3,333,333\n-\n-\n-\n-\n-\n-\n19,967\n-\n-\n-\n20,000\nShares issued for cash\n1,750,000\n-\n-\n-\n-\n-\n-\n3,482\n-\n-\n-\n3,500\nShares issued to settle legal claim\n50,000,000\n-\n-\n-\n-\n-\n-\n144,500\n-\n-\n-\n145,000\nIssue Series E preferred shares\n-\n-\n-\n-\n40,000\n-\n-\n1,836,996\n(1,837,000 )\n-\n-\n-\nIssue Series F preferred shares\n-\n-\n-\n-\n-\n-\n290,397\n625,235\n-\n-\n-\n625,265\nDerivative associated with early debt retirement\n-\n-\n-\n-\n-\n-\n-\n-\n1,844,424\n-\n-\n-\n1,844,424\nBeneficial conversion features of convertible notes\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\nShares earned by consultants\n-\n-\n-\n-\n-\n-\n-\n-\n-\n107,000\n-\n-\n107,000\nImputed interest\n-\n-\n-\n-\n-\n-\n-\n-\n13,678\n-\n-\n-\n13,678\nEffect of foreign currency exchange\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n(80,201 )\n-\n(80,201 )\nNet loss\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n(2,794,324 )\n(2,794,324 )\nBalance, December 31, 2020\n4,120,475,247\n$ 41,205\n13,795,104\n$ 1,380\n40,000\n$ 4\n290,397\n$ 30\n$ 11,427,087\n$ 336,584\n$ 17,838\n$ (15,661,969 )\n$ (3,837,841 )\nThe accompanying notes are an integral part of these financial statements.\nTAUTACHROME, INC. AND CONSOLIDATED SUBSIDIARIES\nConsolidated Statements of Cash Flows\nYear Ended December 31\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet Loss\n$ (2,794,324 )\n$ (3,390,816 )\nStock-based compensation\n127,000\n172,938\nDepreciation, depletion and amortization\n3,621\n-\nLoss on debt conversions\n37,267\n127,031\nGain on litigation\n(105,000 )\n-\nCapital contributed\n-\n13,750\nChange in fair value of derivative\n215,812\n1,426,354\nLoss on debt settlements\n-\n96,993\nAmortization of discounts on notes payable\n902,653\n575,602\nImputed interest\n13,678\n16,707\nChanges in operating assets and liabilities:\nPrepaid expenses\n(403 )\nAccounts payable and accrued expenses\n428,546\n(87,880 )\nAccounts payable - related party\n260,000\n-\nAccrued compensation\n-\n35,000\nNet cash used in operating activities\n(910,344 )\n(1,014,724 )\nCASH FLOWS FROM INVESTING ACTIVITIES\nAcquisitions of property, plant and equipment\n(43,447 )\n-\nNet cash used in investing activities\n(43,447 )\n-\nCASH FLOWS FROM FINANCING ACTIVITIES\nProceeds from the sale of stock\n3,500\n-\nProceeds from convertible notes payable\n660,000\n1,092,700\nProceeds from convertible notes payable, related party\n488,000\n123,476\nPrincipal payments on convertible notes payable\n-\n(176,000 )\nPayment of expenses by related parties\n36,172\n-\nProceeds from related-party loans\n2,417\n26,000\nPrincipal payments on related-party loans\n(64,874 )\n(28,166 )\nNet cash provided by financing activities\n1,125,215\n1,038,010\nEffect of exchange rate changes on cash and cash equivalents\n(88,263 )\n1,837\nNet increase/(decrease) in cash\n83,161\n25,123\nCash and equivalents - beginning of period\n31,366\n6,243\nCash and equivalents - end of period\n$ 114,527\n$ 31,366\nSUPPLEMENTARY INFORMATION\nCash paid for interest\n$ -\n$ 40,781\nCash paid for income taxes\n$ -\n$ -\nSUPPLEMENTAL DISCLOSURES OF NON-CASH FINANCING TRANSACTIONS\nDiscounts on convertible notes\n$ 617,400\n$ 1,044,749\nConversion of debt to common stock\n$ 812,094\n$ 574,539\nSettlement of derivative liability\n$ 1,844,424\n$ 471,233\nShares issued for trade debts\n$ 145,000\n$ 38,623\nShares issued for stock payable\n$ 1,837,000\n$ 26,281\nConversion of debt to preferred stock, related party\n$ 625,265\n$ -\nThe accompanying notes are an integral part of these financial statements.\nTAUTACHROME, INC. AND CONSOLIDATED SUBSIDIARIES\nNotes to Consolidated Financial Statements\nNote 1 - Basis of Presentation and Summary of Significant Accounting Policies\nOrganization and Nature of Business\nHistory\nTautachrome, Inc. was formed in Delaware on June 5, 2006 as Caddystats, Inc. and hereinafter collectively referred to as “Tautachrome”, the “Company”, “we’ or “us”).\nThe Company adopted the accounting acquirer’s year end, December 31.\nOur Business\nTautachrome operates in the internet applications space, uniquely exploiting the technologies of the Augmented Reality (AR) sector and the smartphone trusted imagery sector, with granted and pending patents in both sectors. The Company has completed development of a fully integrated mobile commerce app and platform, the ARknet app and platform, able to host consumers and their social interaction and businesses selling to those consumers, all facilitated by advanced 3D augmented reality interfaces for purchasing and interacting. In addition, we have high-speed blockchain technologies in development in support of frictionless sales, including supporting the creation and sale of blockchain tokens (NFTs) representing unique digital imagery assets owned by the Arknet platform participants. These technologies are being rolled out beginning in the US and aiming for a global operation.\nThe ARknet platform\nThe ARknet mobile platform is designed to provide a fully integrated and untethered mobile experience, where untethering means moving from the physical screen of a PC or mobile device to a virtual screen through our augmented reality technology. Fully integrated means consumers can seamlessly and intuitively reach any provider or any friend for any purpose without leaving the platform. Tautachrome’s MainSt campaign, kicked off in September 2020, was built to integrate the nation’s devasted small retail businesses onto the ARknet platform in such a way that with a single sign-on, a customer can buy from any business on the platform, achieving fast and seamless business integration across any number of businesses (https://mainst.shopping). And in Q1 2021 the ARknet app releases 1.8.2 through 1.8.6 completed the integration onto the platform of essential social features such as sharing, following, posting, meetups and chat, for a gentle marriage of business with social, and in addition added advanced 3D AR features.\nDownload the ARknet app for Android\nhttps://play.google.com/store/apps/details?id=com.honeycombarchive.ARknet\nDownload the ARknet app for iOS\nhttps://apps.apple.com/us/app/ARknet/id1466870072\nNon fungible tokens (“NFTs”), a technology captured in the Company’s long standing patents\nNFTs, tradeable blockchain tokens each representing a unique digital asset, are the new rage in the marketing of digital imagery. But to Tautachrome, blockchain NFTs are nothing new. Our patents teach capturing the uniqueness of digital imagery and certifying its authenticity with an Authentication Centric Entity, an ACE. When the ACE is a blockchain, the certificate of authenticity is a token on the blockchain, namely an NFT. Tautachrome’s ACE is the first fully described imagery certification system that reflects all the attributes of an NFT on a blockchain.\nDr. Jon N Leonard, Tautachrome CEO states “An NFT, being a tradeable asset that represents a real digital entity, is a trustable trading asset only to the extent that the entity it represents is secure and its unique identity is reliably authenticable. Unfortunately, in today’s hot NFT market, NFTs have been sold claiming to represent unique art, without any means for proving the authenticity of the claim. That is a sure way to destabilize the NFT market, and it is the reason that security and authenticity are built into the Company’s processes so as to automatically guarantee these crucial NFT features.” In an opinion provided to the Company, Benjamin Urcia, the Company’s patent attorney for nearly a decade, stated as follows regarding the Company’s three imagery authentication and validation patents: “The three authentication/validation patents each covers the concept of capturing and storing images in a way that enables subsequent verification of their authenticity and uniqueness. Although the term “non fungible token” was not coined at the time the authentication/validation patents were filed [2013], the patents cover method steps that are essential to the creation of any authenticable token that is used to verify a unique captured image, including tokens that are stored in a blockchain, that is, NFTs.”\nBusiness avenues\nTautachrome is currently pursuing three main avenues of business activity based on our patented activated imaging technology, our blockchain cryptocurrency products, and our licensing of the patent pending ARk technology (together banded “KlickZie” technology):\n1.\nKlickZie ARk technology business: The Company has licensed and is developing the augmented reality platform branded ARknet. ARknet enables goods and services providers to establish geolocated augmented reality interfaces, called ARks, allowing consumers to purchase the provider’s products and take advantage of its specials and discounts, using the ARk. A provider’s ARk may be located anywhere in the world, from a store location to anyplace else the provider may desire. The ARknet is a fintech platform using augmented reality as the medium of interaction connecting consumers to providers in the global household goods market now estimated at $52.8 trillion annually.\n2.\nKlickZie’s blockchain cryptocurrency-based ecosystem: The Company has developed its own digital currency (“KLK”), smart contracts using KLKs, high speed blockchain concepts aimed at supporting fast frictionless transactions within the ARknet, and NFTs representing unique digital assets that may be traded on the blockchain.\n3.\nKlickZie Activated Digital Imagery business: The Company is developing processes to exploit our patented KlickZie trusted imaging technology and our patented trusted image-based social interactions using the pictures and videos that smartphone users create. Trusted imagery and user imagery-based interactions are expected to be widely used within the ARknet.\nBasis of Presentation\nThe Company’s financial statements are presented in accordance with accounting principles generally accepted (GAAP) in the United States. In the opinion of management, all adjustments, consisting of normal recurring adjustments, necessary for a fair presentation of financial position and the results of operations for the periods presented have been reflected herein.\nPrinciples of Consolidation\nOur consolidated financial statements include Tautachrome, Inc. and its wholly owned subsidiaries. All significant inter-company accounts and transactions have been eliminated in consolidation.\nUse of Estimates\nThe preparation of these financial statements in conformity with generally accepted accounting principles in the United States requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. We regularly evaluate estimates and assumptions related to the recoverability of long-lived assets, valuation of convertible debentures, assumptions used to determine the fair value of stock-based compensation and derivative liabilities, and deferred income tax asset valuation allowances. We base our estimates and assumptions on current facts, historical experience and various other factors that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities and the accrual of costs and expenses that are not readily apparent from other sources. The actual results experienced by the Company may differ materially and adversely from our estimates. To the extent there are material differences between the estimates and the actual results, future results of operations will be affected.\nCash and Cash Equivalents\nThe Company considers all highly liquid investments with an initial maturity of 3 months or less to be cash equivalents. The Company maintains its deposits with high quality financial institutions and, accordingly, believes its credit risk exposure associated with cash is remote. There were no cash equivalents as of December 31, 2020 and 2019.\nEarnings Per Share\nBasic earnings per common share is computed by dividing net earnings or loss (the numerator) by the weighted average number of common shares outstanding during each period (the denominator). Diluted earnings per common share is similar to the computation for basic earnings per share, except that the denominator is increased by the dilutive effect of stock options outstanding and unvested restricted shares and share units, computed using the treasury stock method. There are currently no common stock equivalents.\nFair Value of Financial Instruments\nWe adopted the Financial Accounting Standards Board’s (FASB) Accounting Codification Standard No. 820 (“ASC 820), Fair Value Measurements and Disclosures. ASC 820 defines fair value, establishes a framework for measuring fair value and expands disclosure of fair value measurements. ASC 820 applies under other accounting pronouncements that require or permit fair value measurements and accordingly, does not require any new fair value measurements. ASC 820 clarifies that fair value is an exit price, representing the amount that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants. As such, fair value is a market-based measurement that should be determined based on assumptions that market participants would use in pricing an asset or liability. As a basis for considering such assumptions, ASC 820 established a three-tier fair value hierarchy, which prioritizes the inputs used in measuring fair value as follows:\nLevel 1 - Observable inputs such as quoted prices in active markets;\nLevel 2 - Inputs, other than the quoted prices in active markets, that are observable either directly or indirectly; and\nLevel 3 - Unobservable inputs in which there is little or no market data, which require the reporting entity to develop its own assumptions.\nAt December 31, 2020 and 2019, we had total liabilities of $2,512,664 and $2,237,946, respectively. Of this amount, only the derivative liabilities of $1,479,530 and 2,365,367, respectively ,were calculated using level 3 inputs. All other liabilities were calculated using level 1 inputs.\nIncome Taxes\nWe recognize deferred tax assets and liabilities based on differences between the financial reporting and tax bases of assets and liabilities using the enacted tax rates that are expected to be in effect when the differences are expected to be recovered. We provide a valuation allowance for deferred tax assets for which we do not consider realization of such assets to be more likely than not.\nSee Note 7 for our reconciliation of income tax expense and deferred income taxes as of and for the years ended December 31, 2020 and 2019.\nRecent Accounting Pronouncements\nIn February 2016, the FASB established Topic 842, Leases, by issuing Accounting Standards Update (ASU) No. 2016-02, which requires lessees to recognize leases on-balance sheet and disclose key information about leasing arrangements. The new standard establishes a right-of-use model (ROU) that requires a lessee to recognize a ROU asset and lease liability on the balance sheet for all leases with a term longer than 12 months. Leases will be classified as finance or operating, with classification affecting the pattern and classification of expense recognition in the income statement.\nThe new standard was effective for us on January 1, 2019 and we have adopted and implemented it. A modified retrospective transition approach is required, applying the new standard to all leases existing at the date of initial application. An entity may choose to use either (1) its effective date or (2) the beginning of the earliest comparative period presented in the financial statements as its date of initial application. If an entity chooses the second option, the transition requirements for existing leases also apply to leases entered into between the date of initial application and the effective date. The entity must also recast its comparative period financial statements and provide the disclosures required by the new standard for the comparative periods. We adopted the new standard on January 1, 2019 and use the effective date as our date of initial application.\nNote 2 - Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As shown in the accompanying financial statements, we had negative cash flows from operations of $910,344 and $1,014,724 for the years ended December 31, 2020 and 2019, respectively, and have experienced recurring losses, and negative working capital at December 31, 2020 and 2019. These conditions raise substantial doubt as to our ability to continue as a going concern. The financial statements do not include any adjustments that might be necessary if we are unable to continue as a going concern.\nThe Company may raise additional capital through the sale of its equity securities, through an offering of debt securities, or through borrowings from financial institutions or related parties. Management believes that actions presently being taken to obtain additional funding may provide the opportunity for the Company to continue as a going concern. There is no guarantee the Company will be successful in achieving these objectives.\nNote 3 - Related Party Transactions\nFor the year ended December 31, 2020, we accrued $4,887 of interest to the 22nd Trust (the “Trust”), the trustee of whom is Sonny Nugent, the son of our former Chief Executive Officer, Micheal Nugent. The outstanding balances of unpaid principal and interest at December 31, 2020 and 2019 were $99,762 and $30,553, respectively.\nAdditionally, we owe the Trust $17,906 in expense advances made in previous fiscal years which are not accruing interest.\nAccording to our agreement with Mr. Nugent, we accrue interest on all unpaid amounts at 5%. Principal and interest are callable at any time. If principal and interest are called and not repaid, the loan is considered in default after which interest is accrued at 10%.\nOn July 11, 2019, our CEO and Board Chairman contributed $13,750 to the company which was accounted for as additional paid in capital.\nOn October 17, 2018, we signed an agreement with Arknet to license certain technologies related to the Klickzie ArK.. The initial license fee is $100,000.\nThe annual maintenance fees are:\n·\n$200,000 for the calendar years 2020 and 2021\n·\n$300,000 for the calendar years 2022 and 2023 and\n·\n$400,000 for the calendar year 2024 and each subsequent calendar year during the term of the agreement.\n·\n7.5% of net sales.\nAs of December 31, 2020, we have accrued the $200,000 initial license and annual maintenance fees.\nDuring the year ended December 31, 2019, the company entered into an arrangement with a ARknet whereby the holder of the Crypto-note was paid in common shares of Arknet. We reclassified the $100,000 Crypto-note to an advance by the Company to ARknet.\nThe Company has an employment agreement with Dr. Jon Leonard, the Company’s Chief Executive Officer at a compensation rate of $60,000 (which increases 5% per year) and six weeks per year of paid vacation. Payment and vacation benefits began to accrue in June, 2019. For the year ended December 31, 2020, we accrued $60,000 pursuant to this employment agreement and owe him $95,000 of unpaid compensation at December 31, 2020.\nBetween October 1, 2019 and July 15,2020, we borrowed $610,500 from Arknet, a related party. On September 1, 2020, we retired all twelve Arknet convertible notes by issuing 290,397 F Series Convertible Preferred shares (see Note 4). We reduced our liability to Arknet in the amount of $610,500 in principal and $14,735 in interest.\nAt December 31, 2020, Accounts Payable - Related Party was comprised of the following:\n·\n$95,000 of accrued salary owed to our Chief Executive Officer\n·\n$400,000 due to Arknet. $300,000 of this amount was due to our technology lease obligations to them and $100,000 was due to the conversion of a crypto-note payable, written in 2018 and converted to Arknet debt in 2019\n·\n$13,998 of unreimbursed expenses paid on behalf of the Company by the 22nd Trust in previous years.\n·\n$1,315 of other accrued related-party expenses.\nAt December 31, 2020, Loans from Related Parties was comprised of the following:\n·\nA $5,000 advance to the Company in 2018 that has not been formalized into a promissory note.\n·\n$80,107 of debts to Michael Nugent, our former Chief Executive Officer for conversion of 39,312 Convertible Preferred Class B shares in 2015.\n·\nCash Loans from the 22nd Trust in the amount of $19,655 made through 2015.\nConvertible note payable, related party\nOn May 5, 2013 (and on August 8, 2013 with an enlargement amendment) the Company entered into a no interest demand-loan agreement with our current Chairman, Jon N. Leonard under which the Company may borrow such money from Dr. Leonard as Dr. Leonard in his sole discretion is willing to loan.\nThe terms of the note provide that at the Company’s option, the Company may make repayments in stock, at a fixed share price of $1.00 per share. Also, because this loan is a no-interest loan, an imputed interest expense of $3,316 was recorded as additional paid-in capital for the year ended December 31, 2020. The Company evaluated Dr. Leonard’s note for the existence of a beneficial conversion feature and determined that none existed.\nDuring the year ended December 31, 2019, we borrowed $2,218 from and repaid $64,874.12 to Dr. Leonard. At December 31, 2020, the balanced owed Dr. Leonard is $16,517.\nWe also owe $33,801, less discounts of $224 to another officer for loans he made to the company. The notes bear interest at 5% and may convert at $0.0025 per share.\nNote 4 - Capital\nCommon Stock\nDuring the year ended December 31, 2019, we issued 1,571,976,979 shares as follows:\n·\nWe issued 1,551,562,038 shares in conversion of outstanding convertible promissory notes. We recorded a reduction of the balance of these notes of $525,621 of principal, $44,418 of interest, and $4,500 of conversion fees and recorded a loss on conversion of $127,031. As part of these conversions, we retired $471,233 of associated derivative liabilities which we included in Additional Paid in Capital.\n·\nWe issued 3,623,055 shares to a certain Australian individual who made baseless claims against the Company other than two existing convertible promissory notes which the Company acknowledged. Rather than engage in a prolonged international legal matter, we issued these shares in complete satisfaction of any and all claims against the Company. We valued the shares at their grant date fair value of $3,623, reduced unpaid principal and interest in the amount of $4,258 and $695, respectively, and recorded a $1,330 gain on this settlement.\n·\nWe issued 12,500,000 shares to a previous supplier to retire trade debts in the amount of $35,000. We valued the shares at the grant date fair value of $185,000 and recorded a reduction of accounts payable of $35,000 and a loss on settlement of $150,000.\n·\nWe issued 4,291,886 shares to a consultant to reduce our stock payable to them. We reduced the stock payable by $26,281 and recorded additional expense of $313. We recorded an additional stock payable to this consultant of $19,888 during the period.\nDuring the year ended December 31, 2020, we issued 616,014,358 shares as follows:\n·\nWe issued 560,931,025 shares in conversion of outstanding convertible promissory notes. We recorded a reduction of the balance of these notes of $770,081 of principal, $42,016 of interest, and recorded a loss on conversion of $37,267. As part of these conversions, we retired $782,972 of associated derivative liabilities which we included in Additional Paid in Capital.\n·\n1,750,000 shares of common stock for $3,500 in cash.\n·\n50,000,000 shares of common stock to settle the McRae lawsuit (see Note 6).\n·\n3,333,333 shares of common stock for services. We valued the shares at their grant date fair values and included $20,000 in general and administrative expenses.\nStocks Payable\n·\nWe maintain a stock payable for an individual who wished to convert to $2,142,857 shares but is delaying receipt for tax reasons. The dollar balance in the Stock Payable account for this individual is $10,586.12.\n·\nWe accrued $3,862.50 to a consultant pursuant to their contract with us. The total amount of shares due to this consultant at December 31, 2020 is 3,655,666 represented as $28,300 in stock payable.\n·\nWe accrued $98,575 to another consultant for development services. As of December 31, 2020, we owe 62,261,472 in stock represented by $247,075 in the Stock Payable account.\n·\nWe reduced our stock payable to Arknet in the amount of $1,837,000 by issuing 40,000 Preferred E shares.\n·\nWe accrued $20,000 to a consultant for services and subsequently traded them for 3,333,333 common shares.\n·\nWe accrued $4,563 for development-related activities. The dollar balances in the Stock Payable account at December 31, 2020 is $4,563. The number of shares convertible in indeterminable at this time.\n·\nWe retired $145,000 of a legal liability relating to the McRae affair (see Note 6) in exchange for 50,000,000 common shares.\nOn July 11, 2019, our CEO and Board Chairman contributed $13,750 to the company which was accounted for as additional paid in capital.\nImputed Interest\nSeveral of our loans were made without any nominal interest. As such, we imputed interest at 8% to these loans, crediting Additional Paid in Capital and charging Interest Expense. For the year ended December 31, 2020 and 2019, these amounted to $13,678 and $16,707, respectively.\nPreferred Stock\nDuring the year ended December 31, 2018, we accrued $1,837,000 in costs related to the 40,000 Series E Preferred shares issued in accordance with our ARknet contract (see Note 4) containing a par value of $0.0001. This series of preferred shares have the following rights, limitations, restrictions and privileges:\n·\nThey are not entitled to dividends,\n·\nThey are entitled to no liquidation rights,\n·\nEach share has the voting rights of all other voting shares combined, multiplied by 0.00001, and\n·\nThey have no conversion or redemption rights.\nIn September, 2020 we issued 290,397 Series F Preferred shares in retirement of twelve convertible promissory notes to Arknet. In so doing, we reduced our liability to them in the amount of $610,500 of principal and $14,735 in interest. Each share of Series F preferred is convertible into 1,000 shares of common stock. This series of preferred shares have the following rights, limitations, restrictions and privileges:\n·\nThey are not entitled to dividends unless all other classes of dividends have been paid,\n·\nThey are entitled to no liquidation rights, and\nNote 5 - Debt\nOur debt in certain categories went from $3,934,795 at December 31, 2019 to $2,692,829 at December 31, 2020 as follows:\n12/31/20\n12/31/19\nLoans from related parties\n$ 104,762\n$ 103,032\nConvertible notes payable, related party\n50,094\n111,999\nShort-term convertible notes payable, net\n999,406\n814,685\nConvertible notes payable in default\n32,000\n32,000\nShort-term notes payable\n16,957\n15,465\nCourt Judgment liability\n-\n250,000\nDerivative liability\n1,479,530\n2,365,367\nLong-term convertible notes payable, net\n-\n158,156\nLong-term convertible notes payable, related party\n10,080\n84,091\nTotals\n$ 2,692,829\n$ 3,934,795\nLoans from related parties\nLoans from related parties consists of a $5,000 advance made by an officer of the Company and $99,762 owed to the Twenty-Second Trust.\nWe also owe $69,973 to another officer for loans he made to the company. The notes bear interest at 5% and may convert at $0.0025 per share.\nConvertible notes payable\nDuring the year ended December 31, 2019 we issued twenty convertible promissory notes in the aggregate amount of $1,283,757, receiving proceeds therefrom of $1,216,176. These convertible notes can convert to common stock at various prices. We evaluated these convertible notes for beneficial conversion features and calculated a collective value of $983,083 which we are accounting for as debt discounts. These convertible notes are discussed below:\n·\nOn January 11, 2019, we issued a convertible note in the amount of $100,000 which accrues interest at 5% (10% for unpaid interest and principal after maturity) and matures on July 8, 2020. On January 23, 2019, we issued a convertible note in the amount of $1,475 which accrues interest at 5% (10% for unpaid interest and principal after maturity) and matures on July 23, 2020. This note can convert to 1,109,023 shares.\n·\nOn January 16, 2019, we issued a convertible note in the amount of $4,000 which accrues interest at 5% (10% for unpaid interest and principal after maturity) and matures on July 16, 2020. This note can convert to 3,007,519 shares.\n·\nDuring the year ended December 31, 2019, we issued four promissory notes to an Australian Superfund in the aggregate amount of $20,331 which accrues interest at 5% (10% for unpaid interest and principal after maturity). These notes mature between October 15, 2020 and November 24, 2020 and can convert to 29,044,286 shares in the aggregate.\n·\nAlso, during the year ended December 31, 2019, we issued three convertible promissory notes to a lending institution in the aggregate amount of $176,000, receiving proceeds of $167,000. These notes accrue interest at 12% (22% for unpaid interest and principal after maturity) and mature between April 17, 2020 and June 20, 2020. After 180 days from the note date, these notes may convert at 58% of the lowest two trading prices for the twenty days prior to conversion. These three notes’ interest and principal were all paid off on July 12, 2019.\n·\nOn May 13, 2019, we issued a convertible note in the amount of $5,725 which accrues interest at 5% (10% for unpaid interest and principal after maturity) and matures on November 13, 2020. This note can convert to 8,178,571 shares.\n·\nOn July 9, 2019, we issued a convertible note in the amount of $320,000, receiving proceeds of $294,500 with an original issue discount of $25,500. The note matures on July 9, 2020 and bears interest at 8% (24% of unpaid interest and principal after maturity). This note may convert to common stock at 63% of the lowest closing bid price for the twenty trading days prior to conversion. On August 2, 2019, we issued 11,392,539 shares in conversion of $35,000 of principal and $169 of interest.\n·\nOn July 22, 2019, we issued a convertible note in the amount of $162,750, receiving proceeds of $150,000 with an original issue discount of $12,50. The note matures on July 22, 2020 and bears interest at 8% (24% of unpaid interest and principal after maturity). This note may convert to common stock at 63% of the lowest closing bid price for the twenty trading days prior to conversion.\n·\nOn August 6, 2019 we issued a convertible promissory note in the amount of $500,000 to be received in various tranches. Each tranche matures 18 months from the date of funding and bears interest at 5%. As of December 31, 2019, we have received $150,000 pursuant to this note, all of which mature in February, 2021 and can convert to 30,844,098 shares in the aggregate.\n·\nOn October 10, 2019, we issued a convertible promissory note in the amount of $62,500 to a related party in exchange for that amount of proceeds. The note bears interest at 5% (10% after maturity), matures 18 months from the date of the note and can covert to common stock at $0.005 per share.\n·\nOn October 18, 2019, we issued a convertible promissory note in the amount of $976 to a related party for paying company expenses. The note bears interest at 5% (10% after maturity), matures 18 months from the date of the note and can covert to common stock at $0.0025 per share.\n·\nOn November 6, 2019, we issued a convertible note in the amount of $220,000, receiving proceeds of $200,000 with an original issue discount of $20,000. The note matures on November 8, 2020 and bears interest at 8% (24% of unpaid interest and principal after maturity). This note may convert to common stock at 63% of the lowest closing bid price for the twenty trading days prior to conversion.\n·\nOn December 19, 2019, we issued a convertible promissory note in the amount of $60,000 to a related party in exchange for that amount of proceeds. The note bears interest at 5% (10% after maturity), matures 18 months from the date of the note and can covert to common stock at $0.004 per share.\nOn January 29, 2019, we issued 3,623,055 to a certain Australian individual who made baseless claims against the Company other than two existing convertible promissory notes which the Company acknowledged. Rather than engage in a prolonged international legal matter, we issued these shares in complete satisfaction of any and all claims against the Company. We valued the shares at their grant date fair values, reduced unpaid principal and interest in the amount of $4,258 and $695, respectively, and recorded a $1,330 gain on this settlement.\nDuring the year ended December 31, 2020 we had the following debt activity:\n·\nWe issued ten convertible promissory notes to a Arknet, a related party, with aggregate proceeds of $488,000. The notes mature at various times during 2021 and bear interest at 5%. In September 2020, we issued 290,397 Series F Preferred Stock (See Note 4) in retirement of all ten of these promissory notes, plus two written in 2019 in the aggregate amount of $122,500.\n·\nWe issued two convertible promissory notes to a related party in the aggregate amount of $36,172 in exchange for expenses paid on behalf of the Company. The notes mature on October 2, 2021 and bear interest at 5% (rate upon default: 10%). These notes have a conversion price of $0.002 per share.\n·\nOn July 21, September 2 and December 10, 2020, we issued three convertible promissory notes in the aggregate amount of $660,000, receiving $600,000 in proceeds. The notes mature on July 27, September 2 and December 10, 2021 and bear interest at 8% (24% default rate). They are convertible at 63% of the lowest closing bid price during the twenty days preceding the conversion.\nAt December 31, 2020, our convertible notes payable had the following balances:\nGross\nDiscount\nNet\nConvertible notes payable - related party\n50,318\n$ (224 )\n$ 50,094\nShort-term convertible notes payable\n1,487,919\n(488,513 )\n999,406\nConvertible notes payable in default\n32,000\n-\n32,000\nLong-term convertible notes payable, related party\n36,172\n(26,092 )\n10,080\nTotals\n$ 1,606,409\n$ (514,829 )\n$ 1,091,580\nAnd was comprised of the following detail:\nDecember 31, 2020\nNote No.\nDescription\nNote Date\nMaturity Date\nUnpaid Principal\nDiscount\nNet\n107 Australian notes\nVarious\nOn demand\n$ 577,889\n$ -\n$ 577,889\nThird party note\n09/17/15\nOn demand\n10,000\n-\n10,000\nThird party note\n09/03/15\nOn demand\n10,000\n-\n10,000\nThird party note\n08/26/15\nOn demand\n5,000\n-\n5,000\nThird party note\n08/27/15\nOn demand\n5,000\n-\n5,000\nThird party note\n03/19/16\nOn demand\n5,000\n-\n5,000\nThird party note\n10/12/16\n04/05/18\n28,000\n-\n28,000\nThird party note\n12/02/16\n05/26/18\n2,000\n-\n2,000\nThird party note\n12/02/16\n05/26/18\n2,000\n-\n2,000\nThird party note\n12/21/16\nOn demand\n3,500\n-\n3,500\nRelated-party note\n10/13/17\nOn demand\n5,000\n-\n5,000\nRelated-party note\n08/02/18\nOn demand\n27,825\n-\n27,825\nThird party note\n10/19/18\nOn demand\n30,000\n-\n30,000\nThird party note\n01/23/19\nOn demand\n1,475\n-\n1,475\nThird party note\n01/16/19\nOn demand\n4,000\n-\n4,000\nThird party note\n04/15/19\nOn demand\n5,000\n-\n5,000\nThird party note\n04/29/19\nOn demand\n5,331\n-\n5,331\nThird party note\n05/10/19\nOn demand\n5,000\n-\n5,000\nThird party note\n05/24/19\nOn demand\n5,000\n-\n5,000\nThird party note\n05/13/19\nOn demand\n5,725\n-\n5,725\n2743-1\nThird party note\n08/06/19\nOn demand\n50,000\n-\n50,000\n2743-2\nThird party note\n08/06/19\nOn demand\n50,000\n-\n50,000\n2743-3\nThird party note\n08/06/19\nOn demand\n50,000\n-\n50,000\nRelated-party note\n10/18/19\nOn demand\n(224 )\nRelated-party note\n04/02/20\nOn demand\n18,848\n(13,517 )\n5,331\nRelated-party note\n04/02/20\nOn demand\n17,324\n(12,575 )\n4,749\nThird party note\n07/27/21\n07/27/21\n220,000\n(178,425 )\n41,575\nThird party note\n09/02/20\n09/02/21\n220,000\n(170,633 )\n49,367\nThird party note\n12/09/20\n12/10/21\n220,000\n(139,455 )\n80,545\nRelated-party note\n16,518\n-\n16,518\n$ 1,606,409\n$ (514,829 )\n$ 1,091,580\nDuring the year ended December 31, 2020 and 2019, we amortized $902,653 and $575,602, respectively of debt discounts to interest expense, accrued $102,659 and 117,035, respectively of interest and paid interest of $0 and $40,781, respectively on existing notes.\nAt December 31, 2020, $58,056 of our convertible notes payable were in default.\nConvertible notes payable (excluding related-party convertible notes which is discussed in Note 3 and above) at December 31, 2020 and 2019 and their classification into long-term, short-term and in-default were as follows:\n12/31/20\n12/31/19\nAll convertible promissory notes\nUnpaid principal\n1,519,919\n1,578,917\nDiscounts\n(488,513 )\n(574,076 )\nConvertible notes payable, net\n$ 1,031,406\n$ 1,004,841\nClassified as short-term\nUnpaid principal balance\n1,487,919\n1,183,685\nDiscounts\n(488,513 )\n(369,000 )\nConvertible notes payable - short-term, net\n$ 999,406\n$ 814,685\nClassified as long-term\nUnpaid principal balance\n-\n363,232\nDiscounts\n-\n(205,076 )\nConvertible notes payable - short-term, net\n$ -\n$ 158,156\nClassified as in default\nUnpaid principal balance\n32,000\n32,000\nDiscounts\n-\n-\nConvertible notes payable - short-term, net\n$ 32,000\n$ 32,000\nOn May 2, 2019, the company entered into an amendment to one of the convertible promissory notes issued during 2018. The company allowed the creditor to own a larger percentage of the company’s total shares outstanding in exchange for a waiver of all default interest. As a result, we recorded a reduction of interest payable to this creditor and interest expense of $140,491. On July 19, 2019, we issued 30,414,329 shares to this creditor extinguishing all principal and interest owed to them.\nCrypto-currency notes payable\nOn August 7, 2018, we issued a Crypto Exchange Promissory Note (“the Crypto Note”) in exchange for $100,000 in cash. The Crypto Note accrues interest at 4% until maturity which is 18 months from issue and 10% after maturity. The holder can convert unpaid principal and accrued interest into KLK20 tokens at any time at the rate of $0.25 per token. The holder may, for up to nine months after issuance, participate in a price guarantee: if the Company offers the tokens at less than $0.25 per token at any point for up to nine months after issuance, then the holder has the option of participating in the offer at the lower price.\nDuring the year ended December 31, 2019, the company entered into an arrangement with a related party whereby the holder of the Crypto-note was paid in common shares of a related party. We reclassified the Crypto-note to an advance by the Company to the related party and recorded a gain of $3,334.\nOn July 31, 2019, we settled an outstanding trade account payable of $83,343 by agreeing to a cash payment of $35,000. We paid the $35,000 on July 31, 2019 and realized a gain of $48,343.\nDerivative liabilities\nThe above-referenced convertible promissory notes issued during the year ended December 31, 2019 were analyzed in accordance with EITF 07-05 and ASC 815. EITF 07-5, which is effective for fiscal years beginning after December 15, 2009, and interim periods within those fiscal years. The objective of EITF 07-5 is to provide guidance for determining whether an equity-linked financial instrument is indexed to an entity’s own stock. This determination is needed for a scope exception under Paragraph 11(a) of ASC 815 which would enable a derivative instrument to be accounted for under the accrual method. The classification of a non-derivative instrument that falls within the scope of EITF 00-19 “Accounting for Derivative Financial Instruments Indexed to, and Potentially Settled in, a Company’s Own Stock” also hinges on whether the instrument is indexed to an entity’s own stock. A non-derivative instrument that is not indexed to an entity’s own stock cannot be classified as equity and must be accounted for as a liability. The EITF reached a consensus that would establish a two-step approach in determining whether an instrument or embedded feature is indexed to an entity’s own stock. First, the instrument's contingent exercise provisions, if any, must be evaluated, followed by an evaluation of the instrument's settlement provisions.\nDerivative financial instruments should be recorded as liabilities in the consolidated balance sheet and measured at fair value. For purposes of this engagement and report, we utilized fair value as the basis for formulating our opinion which has been defined by the Financial Accounting Standards Board (“FASB”) as “the amount for which an asset (or liability) could be exchanged in a current transaction between knowledgeable, unrelated willing parties when neither party is acting under compulsion”. The FASB has provided guidance that its definition of fair value is consistent with the definition of fair market value in IRS Rev. Rule 59-60.\nThe Company issued certain fixed-rate convertible Subscription Notes from 2015 through September 30, 2019 in the United States and Australia These convertible notes have become tainted (“The Tainted Notes”) as a result of the issuance of convertible promissory notes issued in the United States since there is a possibility (however remote) that the Company would not have enough shares in the Treasury to satisfy all possible conversions.\nThe Convertible Note derivatives were valued as of issuance; conversion; redemption/settlement; and each quarterly period from March 31, 2018 through December 31, 2020. The following assumptions were used for the valuation of the derivative liability related to the Notes:\n·\nThe stock price of $0.00830 to $0.00630 in this period would fluctuate with the Company projected volatility.\n·\nThe notes convert with variable conversion prices based on the percentages of the low or average trades or bids over 20 to 25 trading days.\n·\nThe effective discounts rates estimated throughout the periods range from 37% to 42% with potentially an additional discount.\n·\nThe Holder would automatically convert the note before maturity if the registration was effective and the company was not in default.\n·\nThe projected annual volatility for each valuation period was based on the historic volatility of the company are 111.0% - 185% (annualized over the term remaining for each valuation).\n·\nAn event of default would occur 0% of the time, increasing 1.00% per month to a maximum of 20%.\n·\nThe Holders would redeem the notes (with penalties up to 50% depending on the date and full-partial redemption) based on availability of alternative financing of 0% of the time, increasing 1.00% per month to a maximum of 5%.\n·\nThe Holder would automatically convert the note at the maximum of 2 times the conversion price or the stock price on the date of valuation.\n·\nThe Holder would automatically convert the note based on ownership or trading volume limitations.\nWe recorded the initial derivative as both a derivative liability and a debt discount (or initial reduction in carrying value of the debt). We then amortized the debt discounts using the Effective Interest Method which recognizes the cost of borrowing at a constant interest rate throughout the contractual term of the obligation. The effective interest rates on the twenty instruments issued during the year ended December 31, 2019 range from 7% to 564%. The effective interest rates for the fifteen instruments issued during the year ended December 31, 2020 range from 7% to 345%.\nAt each reporting date, we determine the fair market value for each derivative associated with each of the above instruments. At December 31, 2020, we determined the fair value of these derivatives were $1,479,530.\nChanges in outstanding derivative liabilities are as follows:\nBalance, December 31, 2019\n$ 2,365,367\nChanges due to new issuances\n742,775\nChanges due to extinguishments\n(1,844,424 )\nChanges due to adjustment to fair value\n215,812\nBalance, December 31, 2019\n$ 1,479,530\nNote 6 - Litigation Gains and Losses\nMcRae Lawsuit\nOn October 10, 2017, the Company received a letter from the lawyer of Eric L McRae (“McRae”) a person whose association with the Company was terminated by the Company on June 16, 2017. The letter demanded payment of 850,000,000 unrestricted Tautachrome common shares to forestall his filing a laundry list of complaints in a variety of government agencies including with the US District Court in Kansas with complaints of contract breaches and fraud by silence, with the EEOC with complaints of termination by racial discrimination, with the OSHA with complains of termination for reasons of his being a whistleblower under Sarbanes-Oxley provisions, and with various regulatory agencies with accusations of an unspecified nature.\nThis history of the legal proceedings in this case are described in Note 7 to the financial statements filed with Form 10-K on March 30, 2020 and are herewith included by reference.\nOn May 5, 2020 the Company settled with the McRae estate for 50 million common shares. We valued the shares at the settlement date (May 5, 2020 on which date our closing price was $0.0029) and recorded a Gain on Litigation in the amount of $105,000, a reduction of the amount of the liability to $145,000 as a result of that revaluation. We issued the shares on May 18, 2020.\nNote 7 - Income Taxes\nDeferred income taxes reflect the tax consequences on future years of differences between the tax bases:\n12/31/20\n12/31/19\nNet operating loss carry-forward\n$ 6,114,681\n$ 4,579,500\nDeferred tax asset\n$ 1,284,083\n$ 961,695\nValuation allowance\n(1,284,083 )\n(961,695 )\nNet future income taxes\n$ -\n$ -\nDeferred taxes for 2020 and 2019 are calculated using a marginal tax rate of 21%.\nIn assessing the realizability of future tax assets, management considers whether it is more likely than not that some portion or all of the future tax assets will not be realized. The ultimate realization of future tax assets is dependent upon the generation of future taxable income during the periods in which those temporary differences become deductible. Management considers the scheduled reversal of future tax liabilities, projected future taxable income and tax planning strategies in making this assessment. Management has provided for a valuation allowance on all of its losses as there is no assurance that future tax benefits will be realized.\nOur tax loss carry-forwards will begin to expire in 2022.\nNote 8 - Subsequent Events\nIn February, 2021, we issued a convertible promissory note in the amount of $220,000, receiving $200,000 of proceeds.\nAs of March 17, 2021, we issued 123,131,169 common shares in partial retirement of a convertible note.",
    "item_9": "Item 9. Changes In and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nWe carried out an evaluation, under the supervision and with the participation of our management, including our principal executive officer and principal financial officer, of the effectiveness of our disclosure controls and procedures (as defined in Exchange Act Rules 13a-15(e) and 15d-15(e)). Based upon that evaluation, our principal executive officer and principal financial officer concluded that, as of the end of the period covered in this report, our disclosure controls and procedures were not effective to ensure that information required to be disclosed in reports filed under the Securities Exchange Act of 1934 is recorded, processed, summarized and reported within the required time periods and is accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure.\nOur management, including our principal executive officer and principal financial officer, does not expect that our disclosure controls and procedures or our internal controls will prevent all error or fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints and the benefits of controls must be considered relative to their costs. Due to the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected. To address the material weaknesses, we performed additional analysis and other post-closing procedures in an effort to ensure our consolidated financial statements included in this annual report have been prepared in accordance with generally accepted accounting principles. Accordingly, management believes that the financial statements included in this report fairly present in all material respects our financial condition, results of operations and cash flows for the periods presented.\nManagement’s Report on Internal Control over Financial Reporting.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rule 13a-15(f) under the Securities Exchange Act, as amended. Our management assessed the effectiveness of our internal control over financial reporting as of December 31, 2018. In making this assessment, our management used the 2013 criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (“2013 Framework”) in Internal Control-Integrated Framework. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the company's annual or interim financial statements will not be prevented or detected on a timely basis. We have identified the following material weaknesses.\nAs of December 31, 2020, we did not maintain effective controls over the control environment. Specifically we have not developed and effectively communicated to our employees our accounting policies and procedures. This has resulted in inconsistent practices. Further, the Board of Directors does not currently have any independent members and no director qualifies as an audit committee financial expert as defined in Item 407(d)(5)(ii) of Regulation S-K. Since these entity level programs have a pervasive effect across the organization, management has determined that these circumstances constitute a material weakness.\nAs of December 31, 2020, we did not maintain effective controls over financial statement disclosure. Specifically, controls were not designed and in place to ensure that all disclosures required were originally addressed in our financial statements. Accordingly, management has determined that this control deficiency constitutes a material weakness.\nAs of December 31, 2020, the Company did not establish a formal written policy for the approval, identification and authorization of related party transactions.\nBecause of these material weaknesses, management has concluded that the Company did not maintain effective internal control over financial reporting as of December 31, 2020, based on the criteria established in \"Internal Control-Integrated Framework\" issued by the COSO.\nChange in Internal Control Over Financial Reporting\nThere were no changes in our internal control over financial reporting that occurred during quarterly period ended December 31, 2020 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nAttestation Report of the Registered Public Accounting Firm\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Management’s report was not subject to attestation by our registered public accounting firm pursuant to temporary rules of the SEC that permit us to provide only management’s report in this annual report.",
    "item_9B": "Item 9B. Other Information\nNone\nPART III",
    "item_10": "Item 10. Directors, Executive Officers, Promoters and Control Persons and Corporate Governance; Compliance with Section 16(a) of the Exchange Act\nThe following sets forth our directors, executive officers, promoters and control persons, their ages, and all offices and positions held. Directors are elected for a period of one year and thereafter serve until the stockholders duly elect their successor. Officers serve at the will of the Board.\nName\nPosition(s)\nAge\nHeld Position(s) Since\nDr. Jon N. Leonard\nPresident\nMay 21, 2015\nChief Executive Officer Director\nChief Financial Officer\nDirector\nDavid LaMountain\nDirector\nOctober 10, 2019\nChief Operations Operator\nAasim Saied\nDirector\nApril 16, 2018\nDr. Jon N. Leonard, Ph.D., M.S., B.S.\nDr. Jon N. Leonard has been the President, CEO, CFO and a director of the Company since May 21, 2015. From June 2012 until November 2015, he was the President, Chief Executive Officer and a director of Click Evidence Inc., an Arizona corporation that he co-founded, which developed our KlickZie smartphone trustable imaging technology. Prior to that he directed counterterrorism technology development for the Raytheon Missile Company in Tucson, Arizona and before that was the Chief Scientist of the Strategic Systems Division of the Hughes Aircraft Company in El Segundo, California. Dr. Leonard holds a Ph.D. in mathematics from the University of Arizona, an M.S. in engineering from U.C.L.A. and a B.S. in physics from the University of Arizona\nDavid LaMountain\nMr. LaMountain has been a Tautachrome director and the Corporation’s Chief Operating Officer (COO) since his appointment in October 10, 2019. As COO he is responsible for overseeing the overall business operations strategy for achieving the Company’s global growth and success goals. With great people skills he has directed the Company’s social network activities since November 2016, providing strategic Investor Relations functions integrating communication, marketing and securities compliance enabling effective two-way communication between Tautachrome and its constituencies, contributing to achieving fair valuation of Tautachrome’s shares. Mr. LaMountain has been a successful business owner and investor/trader in public and private entities since 1999 and is a uniquely talented and driven individual with outstanding work ethics. He is also an inventor on KlickZie’s pending ARk patent.\nAasim Saied\nMr. Aasim Saied has been a Director of Tautachrome, Inc. since April 16, 2018. He is an inventor, entrepreneur and futurist, who developed the Projector Phone technology and various other products and services. He has a successful history in building fast moving and innovative companies and has engineered powerful new patent-pending mobile device technologies and software applications. He has recruited a global team of developers and industry specialists for a successful launch of his Companies.\nFamily Relationships\nThere are no family relationships between any of our executive officers and director\nInvolvement in Certain Legal Proceedings\nExcept as noted herein or below, during the last ten years none of our directors or officers have:\n1.\nhad any bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n2.\nbeen convicted in a criminal proceeding or subject to a pending criminal proceeding;\n3.\nbeen subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his involvement in any type of business, securities or banking activities;\n4.\nbeen the subject of any order, judgment or decree, not subsequently reversed, suspended or vacated, of any Federal or State authority barring, suspending or otherwise limiting for more than 60 days the right of such person to engage in securities or banking activities, or to be associated with persons engaged in any such activity;\n5.\nbeen found by a court of competent jurisdiction in a civil action or by the Commission to have violated any Federal or State securities law, and the judgment in such civil action or finding by the Commission has not been subsequently reversed, suspended, or vacated;\n6.\nbeen found by a court of competent jurisdiction in a civil action or by the Commodity Futures Trading Commission to have violated any Federal commodities law, and the judgment in such civil action or finding by the Commodity Futures Trading Commission has not been subsequently reversed, suspended or vacated;\n7.\nbeen the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of: (i) Any Federal or State securities or commodities law or regulation; or (ii) Any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or (iii) Any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; o\n8.\nbeen the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization, any registered entity, or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nBoard of Directors and Committees\nAt December 31, 2020, our Board of Directors presently consisted of three members: Dr. Jon Leonard, David LaMountain and Aasim Saied. Our Bylaws generally provide for majority approval of directors in order to adopt resolutions, and provide that the Board of Directors may be expanded by Board action. All executive officer compensation, including payroll expenditures, salaries, stock options, stock incentives, and bonuses, must be approved by the unanimous consent of the Board of Directors. The entire Board of Directors acts as the Audit Committee and the Compensation Committee.\nOn future compensation matters, the Board will consider and recommend payroll expenditures, salaries, stock options, stock incentive and bonus proposals for our employees (if any). Acting in its audit committee function, the Board reviews, with our independent accountants, our annual financial statements prior to publication, and reviews the work of, and approves non-audit services performed by, such independent accountants. The Board appoints the independent public accountants for the ensuing year. The Board also reviews the effectiveness of the financial and accounting functions and the organization, operation and management of our Company.\nDelinquent Section 16(a) Reports\nThe following table identifies each person who, at any time during the fiscal year ended December 31, 2020, was a director, executive officer, or beneficial owner of more than 10% of our common stock that failed to file on a timely basis reports required by Section 16(a) of the Exchange Act during the most recent fiscal year:\nName\nNumber of Late Reports\nNumber of Transactions Not Reported on a Timely Basis\nReports Not Filed\nDr. Jon Leonard\nDavid LaMountain\nCode of Ethics\nWe do not currently have a Code of Ethics, because we have only limited business operations, have a limited number of officers and directors, and believe a Code of Ethics would, at the present time, have limited utility. We intend to adopt such a Code of Ethics as our business operations expand and we have more directors, officers and employees.\nProcedure for Nominating Directors\nWe have not made any material changes to the procedures by which security holders may recommend nominees to our board of directors.\nThe board does not have a written policy or charter regarding how director candidates are evaluated or nominated for the board. Additionally, the board has not created particular qualifications or minimum standards that candidates for the board must meet. Instead, the board considers how a candidate could contribute to the Company's business and meet the needs of the Company and the board.\nIndemnification\nUnder our Articles of Incorporation and Bylaws of the corporation, we may indemnify an officer or director who is made a party to any proceeding, including a law suit, because of his position, if he acted in good faith and in a manner he reasonably believed to be in our best interest. We may advance expenses incurred in defending a proceeding. To the extent that the officer or director is successful on the merits in a proceeding as to which he is to be indemnified, we must indemnify him against all expenses incurred, including attorney's fees. With respect to a derivative action, indemnity may be made only for expenses actually and reasonably incurred in defending the proceeding, and if the officer or director is judged liable, only by a court order. The indemnification is intended to be to the fullest extent permitted by the laws of the State of Delaware.\nRegarding indemnification for liabilities arising under the Securities Act of 1933, which may be permitted to directors or officers under Delaware law, we are informed that, in the opinion of the Securities and Exchange Commission, indemnification is against public policy, as expressed in the Act and is, therefore, unenforceable.",
    "item_11": "Item 11. Executive Compensation\nSummary Compensation\nExcept for the employment agreement for CEO Dr. Jon N Leonard described below, during the years ended December 31, 2020 and 2019, no salary, bonus or other compensation was awarded, earned or paid to the Company’s executive officers for any service rendered in any capacity to the Company.\nWe intend to adopt a compensation plan for executive officers when we have positive and stable cash flows for the purpose of: (a) attracting and retaining talented executive officers who can assist with our business strategy; (b) aligning the interests of those executive officers with those of the Company; and (c) linking individual compensation to the performance of the Company. Any such plan that we may adopt will be designed to provide compensation that is both in line with our fiscal resources and competitive with companies at a similar stage of development.\nThe elements of compensation to be awarded to, earned by, paid to, or payable to our executive officers are currently expected to be composed of: (i) base salary (or consulting fees); (ii) option-based awards; and (iii) cash bonuses or share-based awards for exceptional performance that results in a significant increase in stockholder value.\nBase salary will be a fixed element of compensation payable to executive officers for performing the specific duties of their respective positions. The amount of base salary for each executive officer will be reviewed and set annually by the Board of Directors. While base salary is intended to fit into our overall compensation objectives by serving to attract and retain talented executive officers, the size of the Company and the nature and stage of its business will also impact the level of base salary.\nWe intend to use option-based awards as a variable element of compensation to attract and reward talented executives and professionals. Option-based awards are intended fit into our overall compensation objectives by aligning the interests of executive officers with those of the Company and linking individual compensation to its performance. The Board of Directors will be responsible for setting and amending any equity incentive plan under which an option based award would be granted. Previous grants of stock options will be taken into account when considering new grants.\nWe intend to award bonuses at our sole discretion and do not have any pre-existing performance criteria or objectives.\nAt this time we do not provide medical, dental, pension or other benefits to our executive officers.\nEmployment Agreements\nThe Company has an employment agreement with Dr. Jon Leonard, the Company’s Chief Executive Officer at a compensation rate of $60,000 (which increases 5% per year) and six weeks per year of paid vacation. Payment and vacation benefits began to accrue in June, 2019.\nOther than the agreement in the previous paragraph, there are no employment agreements or arrangements, whether written or unwritten, between the Company and any of its executive officers. We do not contemplate entering into any other employment agreements with our executive officers until the Company has positive and stable cash flows.\nIncentive Plans\nThe Company does not have any plan or arrangement providing compensation to executive officers or directors intended to serve as an incentive for performance to occur over any period.\nEquity Compensation Plans\nThe Company does not have any stock option plans, stock appreciation rights or any other plan, contract, authorization or arrangement pursuant to which the executive officers or directors of the Company may receive equity-based compensation for their services to the Company.\nOutstanding Equity Awards\nNo executive officer or director of the Company had any unexercised option, stock that had not vested or equity incentive plan award as at the end of the Company’s last completed fiscal year.\nPension and Retirement Plans\nThe Company does not have any plan or arrangement by which to provide pension, retirement or similar benefits to its executive officers or directors, and we do not currently intend to offer such any such plan or arrangement until we have positive and stable cash flows\nTermination, Resignation or Change of Control\nThe Company is not a party to any contract or agreement, and has not entered into any plan or arrangement that may provide for payment to an executive officer or a director at, following, or in connection with the resignation, retirement or other termination of an executive officer or director, or a change of control of the Company or a change in the responsibilities of an executive officer following a change of control.\nCompensation of Directors\nThe members of the Board of Directors do not receive compensation for their services as directors, but they are entitled to reimbursement for reasonable travel and other out-of-pocket expenses incurred in connection with attendance at meetings of our board of directors. We may pay cash compensation to an executive officer who is also a director, but only in his or her capacity as an executive officer. We do not currently have an established policy to provide compensation to directors for their services in that capacity.\nDirector Independence\nOur Board of Directors has determined that none of our directors is “independent” as defined under the standards set forth in Section 303A.02 of the NYSE Listed Company Manual. In making this determination, the Board of Directors considered all transactions set forth in the section titled “Certain Relationships and Related Transactions,” elsewhere in this prospectus.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table sets forth, as of the date of this report, information concerning ownership of our voting shares by (i) each director, (ii) each executive officer, (iii) all directors and executive officers as a group, and (iv) each person known to us to be the beneficial owner of more than five percent of each class. The number and percentage of shares beneficially owned includes any shares as to which the named person has sole or shared voting power or investment power and any shares that the named person has the right to acquire within 60 days.\nCommon\nPreferred D 1\nPreferred E 5\nPreferred F 7\n% Total Voting, All\nName of Beneficial Owner\nShares\n%2\nShares\n%3\nShares\n%\nShares\n%6\nClasses\n5% Owners\nTwenty Second Trust\n253,428,790\n6.0 %\n926,139\n6.7 %\n-\n-\n-\n-\n4.5 %\nNugent Bros. Trust\n250,000,000\n5.9 %\n-\n-\n-\n-\n-\n-\n3.2 %\nArknet, Inc. (AZ Corp.)\n-\n-\n-\n-\n40,000\n100.0 %\n290,397\n100.0 %\n28.6 %\nOfficers and Directors\nDr. Jon Leonard\n379,097,992 4\n8.9 %\n10,093,306\n73.2 %\n-\n-\n-\n-\n18.0 %\nDavid LaMountain\n43,280,757\n1.0 %\n-\n-\n-\n-\n-\n-\n0.6 %\nDirectors and Officers as a Group\n422,378,749\n10.0 %\n10,093,306\n73.2 %\n-\n-\n-\n-\n18.6 %\n(1)\nEach outstanding share of Preferred D stock entitles the holder thereof to 100 votes on all matters submitted to a vote of the Company’s stockholders.\n(2)\nBased on an aggregate of 4,243,606,416 shares of common stock outstanding at March 21, 2021.\n(3)\nBased on an aggregate of 13,795,104 shares of preferred D stock outstanding at March 21, 2021.\n(4)\nCommon stock holdings includes 126,166,322 shares of common stock held by California Molecular Electronics Corp., of which Dr. Leonard is the sole officer and director.\n(5)\nEach Preferred E share has the voting rights of all other voting shares combined, multiplied by 0.00001.\n(6)\nBased on an aggregate of 40,000 shares of preferred E stock outstanding at March 21, 2021.\n(7)\nBased on an aggregate of 290,397 shares of preferred F outstanding at March 21, 2021.\nThe mailing address for all directors, executive officers and beneficial owners of more than five percent of our common stock is 1846 E. Innovation Park Drive, Oro Valley, Arizona 85755.\nUnless otherwise stated, we believe that all persons named in the table have sole voting and investment power with respect to all shares of our common and preferred stock beneficially owned by them. For purposes hereof, a person is considered to be the beneficial owner of securities that can be acquired by such person within 60 days from the date hereof, upon the exercise of warrants or options or the conversion of convertible securities. Each beneficial owner's percentage ownership is determined by assuming that any such warrants, options or convertible securities that are held by such person (but not those held by any other person) and which can be exercised within 60 days from the date hereof, have been exercised.\nChanges in Control\nWe are not aware of any arrangement, the operation of which may at a subsequent date result in a change of control of the Company.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nFor the years ended December 31, 2020 and 2019, certain related parties made cash payments to the Company and the Company made cash payments to the related parties (see Note 3 to the financial statements).\nDirector Independence\nAs our common stock is currently traded on the OTC Bulletin Board, we are not subject to the rules of any national securities exchange which require that a majority of a listed company’s directors and specified committees of the board of directors meet independence standards prescribed by such rules.",
    "item_14": "Item 14. Principal Accountant Fees and Services\nAudit and Review Fees. We paid M&K, CPAS, PLLC for audit and review fees of $29,550 for 2020 and $32,500 for 2019.\nTax Fees. We have not paid any money for tax related services.\nAll Other Fees. We have not paid any money for other fees.\nAudit Committee pre-approval policies and procedures. The entire Board of Directors, which acts as our audit committee, approved the engagement of M&K, CPAS, PLLC.\nPART IV",
    "item_15": "Item 15. Exhibits, Financial Statement Schedules, Signatures\nExhibit No.\nDescription of Exhibit\n3.1\nArticles of Incorporation of Roadships Holdings, Inc. filed as exhibit 3.1 with our Form 8-K/A filed April 20, 2009 and incorporated herein by reference\n3.2\nBylaws of Roadships Holdings, Inc. filed as exhibit 3.2 with our Form 8-K/A filed April 20, 2009 and incorporated herein by reference\n3.3\nAmended and Restated Certificate of Incorporation filed with our Form 8-K filed November 5, 2015 and incorporated herin by reference.\n21.1*\nSubsidiaries of the registrant\n31.1*\nCertification pursuant to Section 302 of the Sarbanes-Oxley act of 2002\n32.1*\nCertification of Officers pursuant to Section 906 of the Sarbanes-Oxley act of 2002 (18 U.S.C. section 1350)\nInteractive data files pursuant to Rule 405 of Regulation S-T.\n*Filed herewith\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nTautachrome, Inc.\nDate: March 30, 2021\nBy:\n/s/ Dr. Jon Leonard\nDr. Jon Leonard\nChairman, Chief Executive Officer and Chief Financial Officer\nDate: March 30, 2021\nBy:\n/s/ David LaMountain\nDavid LaMountain\nDirector, Chief Operating Officer\nIn accordance with the Securities Exchange Act of 1934, this report has been duly signed by the following persons on behalf of the Company and in the capacities and on the dates indicated."
}