{
    "cik": "1467761",
    "company": "Zoom Telephonics, Inc.",
    "filing_type": "10-K",
    "filing_date": "2021-04-13",
    "period_of_report": "2020-12-31",
    "sic": "3661",
    "state_of_inc": "DE",
    "state_location": "NH",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1467761/0001654954-21-004133-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1467761/000165495421004133/zmtp_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1467761/0001654954-21-004133.txt",
    "filename": "1467761_10K_2020_0001654954-21-004133.htm",
    "item_1": "ITEM 1 - BUSINESS\nOverview\nAs used in the Annual Report on Form 10-K, the terms “we,” “us,” “our,” \"Zoom” and the “Company” mean Zoom Telephonics, Inc., doing business as Minim, and its wholly owned subsidiaries, Minim, Inc. and MTRLC LLC.\n \nWe deliver innovative Internet access products that reliably and securely connect homes and offices around the world. Now the exclusive global license holder to the Motorola brand for home networking hardware, Zoom Telephonics designs and manufactures products including cable modems, cable modem/routers, mobile broadband modems, wireless routers, Multimedia over Coax (“MoCA”) adapters and mesh home networking devices. Our AI-driven cloud software platform and applications make network management and security simple for home and business users, as well as the service providers that assist them- leading to higher customer satisfaction and decreased support burden.\nOur mission is to make every smart home and office safe and easy to use for life and work. We believe advanced, vertically-integrated hardware and software is vital to delivering on this purpose as consumers increasingly depend on their networks for media streaming, remote working, telemedicine, remote education, mobile data offloading, and powering smart home appliances. Our primary objective is to leverage these trends and build upon our position as a leading producer of home networking devices sold through many of the largest United States (“USA” or “US”) high-volume retailers by launching software-enabled products with the latest connectivity standards and expanding our sales channels globally.\nOn December 4, 2020, Zoom acquired Minim, Inc. (“Minim”). Minim is a Delaware corporation that delivers its WiFi management and security Software as a Service (\"SaaS\") to Internet Service Providers (ISPs) to unlock bottom line growth through increased subscriber acquisition, retention, support cost efficiency. The Minim solution offers a web application for customer service representatives to effectively support subscribers and a mobile app for home users to manage their network settings, security, privacy and parental controls. The Company’s intuitive applications, built on proprietary device fingerprinting technology, also empowers businesses to secure and manage satellite offices and remote employee networks. Offering a full API suite, the Minim platform has been integrated with third-party hardware platforms and has been designed for ultra-extensibility as wireless technology advances. Subsequent to the merger, the Company re-branded itself as Minim.\n Cable modem products, including both cable modems and cable modem/routers (“gateways”), were Zoom’s highest revenue product category in 2015 through 2020. Cable modems provide a high-bandwidth connection to the Internet through a cable service provider’s managed broadband network. Zoom Telephonics began shipping cable modems in 2000 and acquired a geographically-restricted license to sell Motorola-branded cable networking products in 2016. From 2016 through 2020, the Company sold networking products under its ZOOM trademark as well as the Motorola brand. Zoom’s primary means of distribution to end-users in the US, our primary market, is through national retailers, e-commerce platforms, and distributors. In response to demand for faster connection speeds, security by design, and increased functionality, we have invested and continue to invest resources to advance our cable modem product line.\nIn August 2016, we extended our Motorola license to a worldwide exclusive license that includes cable modems and gateways, WiFi routers, WiFi range extenders, powerline communication devices, and related products. In August 2017, we further extended our Motorola license to a worldwide exclusive license for DSL modems and gateways, cellular modems and gateways, and MoCA products, and to a worldwide non-exclusive license for cellular sensors. We introduced under the Motorola brand two WiFi routers, one range extender, and one MoCA adapter in 2017. In 2018, we introduced into the retail market under the Motorola brand two WiFi routers and a DSL modem/router. In March 2020 Zoom entered into an amendment to extend the License Agreement with Motorola Mobility LLC (the “2020 Amendment”) through December 31, 2025. The 2020 Amendment expands Zoom’s exclusive license to use the Motorola trademark to a wide range of authorized channels worldwide, including Direct to Consumer Channels and Service Provider Channels. In March 2020, we entered into a License Agreement with Motorola to sell consumer grade home security and monitoring products and to provide related services. This agreement applies to a wide range of products, including consumer grade cellular modems and gateways, DSL modems and gateways, and MoCA adapters for networking and home security products and services.\nWe are incorporated in Delaware under the name Zoom Telephonics, Inc. and are now doing business as “Minim” while maintaining the ZOOM trademark for products. Zoom Telephonics, Inc. was originally incorporated in New York in 1977 and changed its state of incorporation to Delaware in 1993. Minim, Inc., a wholly owned subsidiary of Zoom Telephonics, Inc., is a corporation organized in Delaware. MTRLC LLC, a wholly owned subsidiary of Zoom Telephonics, Inc., is a limited liability company organized in Delaware that focuses on the sale of our Motorola brand products. Our principal executive offices are located at 848 Elm Street, Manchester, NH 03101, and our telephone number is (617) 423-1072. Our main website is www.minim.com. Information contained on our website does not constitute part of this report. Our common stock is traded on the OTCQB Venture Market under the symbol MINM (formerly traded under the symbol ZMTP until December 8, 2020).\nStrategy Overview\nOur strategy is to address the increasing demands of broadband users with advanced technology and build upon our position as a leading home networking product supplier in many of the largest United States (“USA” or “US”) high-volume retailers to go global. The key pillars to our strategy are as follows:\nDistribute high-margin software - Our cloud-based software is a companion to home networking equipment, making our established hardware sales channels a prime route to software distribution. We believe quality software is a profit margin driver, lending to higher Average Selling Prices (ASPs) and higher gross profit. In addition, we assist third-party hardware vendors and ISPs in their own software development with our API-based platform.\nCustomer-driven design - With continued investment in warranties and customer service, we see our direct and frequent connection to end users as a market advantage that informs our product roadmap. The Company continues to invest in research and development with the latest connectivity standards- such as DOCSIS 3.1, WiFi 6, EasyMesh, and 5G- to design high-speed products while optimizing costs to maintain a healthy, price segmented portfolio.\nExpand sales reach - We maintain strong sales channel relationships by delivering value-driven products in a way that complements, not challenges, our resellers’ profitability. We believe this is a competitive edge that affords us wider access to the Total Addressable Market through both retailers and ISPs. As we invest in marketing and new product introductions to existing channels, we consider new market entrances.\nStrengthen supply chain resiliency - The Company continues to adjust its manufacturing operations and delivery mechanisms to reduce operational costs. We continue to build supply chain diversity to improve our operational resiliency to geopolitical, weather-related, and market-based risks to our product supply.\nAvailable Information\nOur investor website address is ir.minim.com. Through our website, we make available our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to those reports, as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. These SEC reports can be accessed through the investor relations section of our website and at the SEC’s website.\nProducts\nGeneral\nWe are the creator of innovative Internet access products that dependably connect people to the information they need and the people they love. Our hardware portfolio includes: cable modems, cable modem/routers, mobile broadband modems, wireless routers, MoCA adapters, and mesh home networking devices. Our software platform includes: mobile applications, a web application, API suites, and an open-source embedded agent for networking devices.\nWe have sold home networking products under the globally-recognized Motorola brand, as well as under our own ZOOM trademark. Our hardware and software products are purchased by consumers to support and protect their family’s connected devices; ISPs to reduce support costs and increase revenue with digitally transformed support and value-added services; and by businesses to affordably support and secure satellite and remote worker networks.\nIn May 2015, Zoom entered into an agreement to license certain Motorola trademarks from Motorola Trademark Holdings, LLC (“Motorola”) for cable modem products. The agreement includes numerous requirements intended to assure the quality and reputation of Motorola® brand products. In January 2016 Zoom, through its MTRLC LLC subsidiary, which was formed on October 6, 2015, began shipping cable modems under the Motorola® brand. In August 2016, Zoom entered into an amendment to the license agreement with Motorola. The amendment expands Zoom’s exclusive license to use the Motorola trademark to a wide range of authorized channels worldwide and expands the license from cable modems and gateways to also include consumer routers, WiFi range extenders, home powerline network adapters, and related products. In August 2017, we further extended our Motorola license to a worldwide exclusive license for DSL modems and gateways, cellular modems and gateways, and MoCA products, and to a worldwide non-exclusive license for cellular sensors. We introduced under the Motorola® brand three WiFi routers, one range extender, one MoCA adapter, and one DSL modem/router in 2017 and 2018. Zoom plans to extend this product line, adding mesh routers and range extenders, cellular sensors, and new MoCA adapters. In March 2020, Zoom entered into an amendment to extend the License Agreement with Motorola Mobility LLC through December 31, 2025. The 2020 Amendment expands Zoom’s exclusive license to use the Motorola trademark to a wide range of authorized channels worldwide, including Service Provider Channels.\nIn March 2020, Zoom entered into a License Agreement with Motorola Mobility LLC to sell consumer grade home security and monitoring products and to provide related services (the “2020 License Agreement”). The term of the 2020 License Agreement runs through December 31, 2025 and includes minimum licensing payments beginning in 2021 and continuing through the remainder of the agreement term.\nHome Networking Hardware\nOur networking hardware products connect homes and small offices to the Internet, create wireless networks, and extend the wireless signal. These products are now primarily available through retail and e-commerce channels in the US.\n●\nModems and Modem/Routers (“Gateways”), which are devices that convert cable service into Internet connectivity for ethernet-only connection (modems) or ethernet and wireless connections (modem/routers). Zoom’s primary cable modem sales from 2016 through 2020 were of Motorola brand products. We have obtained CableLabs® certification for our currently marketed cable modems, and these cable modems have also received a number of cable service provider certifications. Required by most service providers for interoperability on their networks, all modem and modem/router products must pass this lengthy, expensive, and technically challenging certification process. Zoom plans to extend its DOCSIS 3.1 product line, adding high-performance modem/routers including WiFi 6 and mesh-capable routers.\n●\nRouters and Mesh Systems, which are devices that create WiFi networks. Mesh WiFi systems extend the signal throughout a wider area than a single router can typically cover. In 2020, Zoom launched its first mesh WiFi system and plans to extend its mesh and router portfolio with WiFi 6 and WiFi 6E capabilities.\n●\nOther Local Area Network Products, which are devices that create, extend, or enhance a Local Access Network. Zoom currently offers MoCA adapters, which provides an Ethernet connection over coaxial cable between a MoCA-capable router and connected devices.\nSoftware\nThe Minim software platform offers three core software components:\n●\nMinim mobile application for end users to personalize and monitor their home and office network with features such as speed testing, data usage tracking, security alerts, malware blocking, privacy settings, parental controls.\n●\nMinim web application that enables technical support representatives in ISPs and businesses to offer efficient remote support with network insights.\n●\nMinim API suite and open-source agent for third-party hardware vendors, ISPs, and other partners to integrate with the Minim platform, leverage Minim functionality, and manage their own account data. A foundational component of our software is an open-source embedded agent for integration with any third-party router firmware.\nProducts for Markets outside North America\nThe vast majority of our sales were in North America from 2015 through 2020 because the business predominantly sold cable modem and modem/router products, and the United States is by far the largest market for cable modems sold through retailers. However, we expect to see growth outside North America as we expand our ISP customer base and portfolio of retail routers, mesh systems, and other Local Area Network products under our worldwide Motorola brand license.\nNetworking hardware products for countries outside the United States typically differ from a similar product for the United States because of varied regulatory and certification requirements, country-specific phone jacks and AC power adapters, and language needs. As a result, the introduction of new products into markets outside North America can incur significant costs and time to market. In 1993, we introduced our first dial-up modem approved for selected Western European countries. Since then, we have sold our products into a number of markets outside North America. We have received regulatory certifications for a number of countries, including the United States, the United Kingdom (“UK”), and Canada. We have planned product line enhancements to enable new market expansion. Most importantly for sales outside the United States, we are working toward selling Motorola brand home networking hardware and software products in the UK, Canada, Latin America, India, Mexico and other regions.\nSales Channels\nGeneral\nWe sell our products primarily through high-volume retailers and distributors (“B2C”), Internet service providers, individual businesses (“B2B”), service providers, value-added resellers, PC system integrators, and Original Equipment Manufacturers (\"OEMs\"). We support our major accounts in their efforts to discern strategic directions in the market, to maintain appropriate inventory levels, and to offer a balanced selection of attractive products.\nRelatively few companies account for a substantial portion of the Company’s revenues. In 2020, two companies accounted for 10% or greater individually, and 76% in the aggregate of the Company’s total net sales. At December 31, 2020, three companies with an accounts receivable balance of 10% or greater individually accounted for a combined 85% of the Company’s accounts receivable. In 2019, two companies accounted for 10% or greater individually, and 84% in the aggregate of the Company’s total net sales. At December 31, 2019, three companies with an accounts receivable balance of 10% or greater individually accounted for a combined 84% of the Company’s accounts receivable.\nDistributors and Retailers outside North America\nIn markets outside North America we sell and ship our hardware products primarily to distributors. Our software is globally sold via licenses to ISPs and Resellers globally. We believe that sales growth outside North America will continue to require substantial additional investments of resources for product design and testing, regulatory certifications, native-language instruction manuals and software, packaging, sales support, and technical support. We have made this investment in the past for many countries, and we expect to make this investment for some countries and products in the future. However, we anticipate that the majority of sales in the next two years will come from North America, partly because the US is one of the few countries with a robust retail cable modem market due to Federal regulations in the United States. As we expand our product portfolio beyond cable modems and serve ISPs directly and through Reseller relationships, we envision the proportion of our sales from countries outside the United States will increase.\n.\nNorth American High-volume Retailers and Distributors\nIn North America we reach the retail market primarily through high-volume retailers. Our North American retailers include Best Buy, Micro Center, Target, Wal-Mart, and e-tail and e-commerce platforms including Amazon.\nWe sell significant quantities of our products through distributors, who often sell to corporate accounts, retailers, service providers, value-added resellers, equipment manufacturers, and other customers. Our North American distributors include D&H Distributing and Ingram Micro.\nInternet Service Providers & Businesses\nMinim works with over 140 Internet Service Providers and businesses with its subscription-based WiFi management and security software. Our solution enables challenger ISPs to better compete in the market with a premium WiFi solution while lowering operational costs with support call and onsite visit avoidance. For our business customers, our solution reduces the costs, deployment time, and risks to supporting and securing remote employee and satellite office networks. We are empowering the IT staff of our business customers to secure and support employee home networks and other small workspaces. Our customer base is primarily located in the US; however, we have customers all over the world, including Canada, UK, and South Africa.\nOEM and Router Manufacturers\nOur open-source embedded software agent enables third-party hardware vendors to integrate Minim in their networking devices, potentially to create a recurring revenue stream with our software services. Our system integrator and OEM customers sell our products under their own name or incorporate our products as a component of their systems. We seek to be responsive to the needs of these customers by providing on-time delivery of high-quality, reliable, cost-effective products with strong engineering and sales support.\nSales, Marketing and Support\nIn North America we sell our Zoom®, Motorola®, and Minim® products through a direct sales force and commissioned independent sales representatives to retailers; through channel resellers; and through electronics distributors. Worldwide technical support is primarily handled from our Manchester headquarters.\nWe believe that Motorola® is a widely recognized brand name, and we build upon this brand equity in a variety of ways, including: Amazon advertising, Google AdWords advertising, social media marketing and advertising, retailer cooperative advertising, product packaging, trade shows, and public relations. We promote Zoom® and Minim® brand awareness through similar means, as well as engaging in industry associations, content marketing, outbound sales development, analyst briefings, and open-source project contribution.\nWe develop quality products that are user-friendly and are designed to require minimal support. We typically support our claims of quality with product warranties of one to two years, depending upon the product. To address the needs of end-users and resellers who require assistance, we have our own staff of technical support specialists. They provide telephone support six days per week in English and Spanish and aim to continuously expand of languages, availability, and support channels. Our technical support specialists also maintain a significant Internet support facility that includes email, firmware and software downloads, and a digital knowledgebase.\nResearch and Development\nOur research and development efforts are focused on developing new products, enhancing the capabilities of existing products, and reducing production costs. We have developed close collaborative relationships with certain of our Original Design Manufacturer (“ODM”) suppliers and component suppliers. We work with these partners and other sources to identify and respond to emerging technologies and market trends by developing products that address these trends. We also develop all the hardware and firmware for certain products in-house, including some cellular modems and some future cellular sensors.\nThe Company’s costs on research and development were $3.8 million for 2020 and $2.2 million for 2019. The primary reasons for the increase in research and development costs were salary and related costs, increased product testing, and certification and software development expenses. As of December 31, 2020, we had twenty-two employees engaged primarily in research and development. Our research and development team performs hardware design and layout, mechanical design, prototype construction and testing, component specification, firmware and software development, product testing, foreign and domestic regulatory certification efforts, end-user and internal documentation, and third-party software selection and testing.\nManufacturing & Suppliers\nOur products are currently designed for high-volume automated assembly to help assure reduced costs, rapid market entry, short lead times, and reliability. High-volume assembly mostly occurs in Vietnam or China. Our contract manufacturers and original design manufacturers typically obtain some or all of the material required to assemble the products based upon a Zoom Telephonics Approved Vendor List and Parts List. Our manufacturers typically insert parts onto the printed circuit board, with most parts automatically inserted by machine, solder the circuit board, and test the completed assemblies. The contract manufacturer sometimes performs final packaging. For the US and many other markets, packaging is often performed at our facilities in North America, allowing us to tailor the packaging and its contents for our customers immediately before shipping. This facility also performs warehousing, shipping, quality control, finishing and some software updates from time to time. We also perform circuit design, circuit board layout, and strategic component sourcing at our Boston area office. Wherever the product is built, our quality systems are used to help assure that the product meets our specifications.\nOur North American facility is currently located in Tijuana, Mexico. From time to time, we experience certain challenges associated with the Tijuana facility, specifically relating to bringing products across the border between the US and Mexico. We believe that this facility assists us in cost-effectively providing rapid response to the needs of our US customers.\nHistorically we have used one primary manufacturer for a given design. We sometimes maintain back-up production tooling at a second manufacturer for our highest-volume products. Our manufacturers are normally adequate to meet reasonable and properly planned production needs; but a fire, natural calamity, strike, financial problem, the impacts from the COVID-19 pandemic or another significant event at an assembler's facility could adversely affect our shipments and revenues. In 2020, two suppliers provided 99% of our purchased inventory. The loss of a key supplier, or a material adverse change in a key supplier’s business or in our relationship with a key supplier, could materially and adversely harm our business.\nOur products include a large number of parts, most of which are available from multiple sources with varying lead times. However, most of our products include a sole-sourced chipset as the most critical component of the product. The vast majority of our cable modem chipsets come exclusively from Broadcom. Most of our cellular products include a Gemalto module. Our dial-up modem chipsets come exclusively from Conexant. Serious problems at Broadcom, including long chipset lead-times, would significantly reduce Zoom’s shipments. While many companies that use computer chips in their business experienced during 2020 supply chain issues in sourcing chips due to a chip shortage, we did not experience issues during 2020 resulting from material delays or unavailability of chips. There can be no assurance, however, that we will not experience such issues in the future.\nWe have experienced delays in receiving shipments of essential integrated circuits in the past, and we may experience such delays in the future. Moreover, we cannot assure that a chipset supplier will, in the future, sell chipsets to us in quantities sufficient to meet our needs or that we will purchase the specified dollar amount of products necessary to receive concessions and incentives from a chipset supplier. An interruption in a chipset supplier's ability to deliver chipsets, a failure of our suppliers to produce chipset enhancements or new chipsets on a timely basis and at competitive prices, a material increase in the price of the chipsets, our failure to purchase a specified dollar amount of products or any other adverse change in our relationship with modem component suppliers could have a material adverse effect on our results of operations.\nWe are also subject to price fluctuations in our cost of goods. Our costs may increase if component shortages develop, lead-times stretch out, fuel costs rise, or significant delays develop due to labor-related issues.\nWe are also subject to the Restriction of Hazardous Substances Directive (“RoHS”) and Consumer Electronics Control (“CEC”) rules discussed above, which affect component sourcing, product manufacturing, sales, and marketing.\nSince September 24, 2018 until after we transitioned a substantial portion of our manufacturing to Vietnam during the second quarter of 2020, substantially all of our products were subject to a tariff because they were produced in China and they were in product categories subject to the tariff on our cost of goods at the time of entry into the United States. The tariff started at 10% and increased to 25% in June 2019. These tariffs have a significant impact on our cost of inventory and profitability. Because these tariffs may not be reduced and may even be increased, we actively worked on finding production capability outside China. Our largest supplier established a major production capability in Vietnam, and we transitioned the majority of our production to Vietnam by the end of second quarter of 2020. In addition, we are working with other suppliers outside of China. With the transition of a majority of our manufacturing to Vietnam, we significantly reduced the tariff burden.\nCompetition\nThe Internet access and networking industries are intensely competitive and characterized by aggressive pricing practices, continually changing customer demand patterns, rapid technological advances, and emerging industry standards. These characteristics result in frequent introductions of new products with added capabilities and features, and continuous improvements in the relative functionality and price of modems and other communications products. Our operating results and our ability to compete could be adversely affected if we are unable to:\n●\nsuccessfully and accurately anticipate customer demand;\n●\nmanage our product transitions, inventory levels, and manufacturing processes efficiently;\n●\ndistribute or introduce our products quickly in response to customer demand and technological advances;\n●\ndifferentiate our products from those of our competitors; or\n●\notherwise compete successfully in the markets for our products.\nSome of our primary competitors by product group include the following:\n●\nCable modem and modem/router competitors: Belkin/Linksys, Commscope/Arris, D-Link, Hon Hai Network Systems (formerly Ambit Microsystems), Netgear, Sagemcom, Technicolor, TP-Link and Ubee Interactive.\n●\nRouter and mesh WiFi competitors: Amazon/Eero, Amped, Apple, Asus, Belkin/Linksys, D-Link, Google, Netgear, Securifi, Tenda, TP-Link, Trendnet, and Ubiquiti.\n●\nWiFi Management and Security: AirTies, Cujo AI, Plume Design, SAM Seamless Network.\nMany of our competitors and potential competitors have more extensive financial, engineering, product development, manufacturing, and marketing resources than we do.\nThe principal competitive factors in our industry include the following:\n●\nproduct performance, features, reliability and quality of service;\n●\nprice;\n●\nbrand image;\n●\nproduct availability and lead times;\n●\nsize and stability of operations;\n●\nbreadth of product line;\n●\nsales and distribution capability, including retailer and distributor relationships;\n●\ntechnical support and service;\n●\nproduct documentation and product warranties;\n●\nrelationships with providers of broadband access services; and\n●\ncertifications evidencing compliance with various requirements.\nWe believe we are able to provide a competitive mix of the above factors for our products, particularly when they are sold through retailers, computer product distributors, small to medium sized Internet service providers, and system integrators. We have been less successful in selling directly to large telecommunication providers and other large providers of broadband access services.\nSuccessfully penetrating the broadband modem market presents a number of challenges, including:\n●\nthe current limited retail market for broadband modems, as most consumer broadband users get their modem from their service provider;\n●\nthe relatively small number of cable, telecommunications and Internet service providers that make up the majority of the market for broadband modems in the USA, our largest market;\n●\nthe significant bargaining power and market dominance of these large service providers;\n●\nthe time-consuming, expensive and uncertain certification processes of the various cable, mobile broadband service providers; and\n●\nthe strong relationships with service providers enjoyed by some incumbent equipment providers, including ARRIS for cable modems and Huawei for DSL and mobile broadband modems.\nIntellectual Property Rights\nWe rely primarily on a combination of copyrights, trademarks, trade secrets and patents to protect our proprietary rights. We have trademarks and copyrights for our firmware (software on a chip), printed circuit board artwork, instructions, packaging, and literature. We also have three active patents that expire between years 2021 and 2039. There cannot be any assurance that any patent application will be granted or that any patent obtained will provide protection or be of commercial benefit to us, or that the validity of a patent will not be challenged. Moreover, our means of protecting our proprietary rights may not be adequate and our competitors may independently develop comparable or superior technologies.\nWe license certain technologies used in our products, typically rights to bundled software, on a non-exclusive basis. In addition, we purchase chipsets that incorporate sophisticated technology. We have received, and may receive in the future, infringement claims from third parties relating to our products and technologies. We investigate the validity of these claims and, if we believe the claims have merit, we respond through licensing or other appropriate actions. Certain of these past claims have related to technology included in modem chipsets. We forward these claims to the appropriate vendor. If we or our component manufacturers were unable to license necessary technology on a cost-effective basis, we could be prohibited from marketing products containing that technology, incur substantial costs in redesigning products incorporating that technology, or incur substantial costs defending any legal action taken against it. Where possible we attempt to receive patent indemnification from chipset suppliers and other appropriate suppliers, but the extent of this coverage varies, and enforcement of this indemnification may be difficult and costly.\nIn May 2015, we entered into an agreement to license certain Motorola® brand trademarks for consumer cable modem products in the United States and Canada through certain authorized sales channels using such trademarks beginning January 1, 2016 through December 31, 2020. In August 2016, Zoom entered into an amendment to the License Agreement with Motorola Mobility LLC. The 2016 amendment expanded Zoom’s exclusive license to use the Motorola trademark to a wide range of authorized channels worldwide and expanded the license from cable modems and gateways to also include consumer routers, WiFi range extenders, home powerline network adapters, and access points. In August 2017, Zoom entered into an amendment to the License Agreement with Motorola Mobility LLC. The 2017 amendment expanded Zoom’s exclusive license to use the Motorola trademark to a wide range of authorized channels worldwide, and expanded the license from cable modems, gateways, consumer routers, WiFi range extenders, home powerline network adapters, and access points to also include MoCA adapters, and cellular sensors. In March 2020, Zoom entered into an amendment to extend the License Agreement with Motorola Mobility LLC through December 31, 2025. The 2020 amendment expanded Zoom’s exclusive license to use the Motorola trademark to a wide range of authorized channels worldwide, including Direct to Consumer Channels and Service Provider Channels.\nIn March 2020, we entered into a license with Motorola Mobility LLC to sell consumer grade home security and monitoring products and to provide related services. The term of this Agreement runs through December 31, 2025 and includes minimum licensing payments beginning in 2021 and continuing through the remainder of the agreement term.\nIn February 2021, Zoom Video Communications, Inc. filed a petition with the US Patent and Trademark Office seeking cancellation of the Company’s Zoom® trademark. The Company believes it has meritorious defenses to the petition and intends vigorously to oppose the cancellation petition.\nBacklog\nOur backlog on February 28, 2021 was $1.4 million, and on February 29, 2020 was $287 thousand. Orders included in backlog may be canceled or rescheduled by customers without significant penalty. Backlog as of any particular date should not be relied upon as indicative of our net sales for any future period.\nHuman Capital\nZoom is committed to attracting and retaining the brightest and best talent. Therefore, investing, developing, and maintaining human capital is critical to our success. Our effectiveness in attracting, developing, engaging and retaining talented team members demonstrates our commitment to providing a welcoming and safe workplace, with equitable compensation, benefits and opportunities for our team members to continually grow and develop their careers within Zoom.\nAs of December 31, 2020, Zoom had 61 employees. Twenty-two employees were engaged in research and development and quality control. Ten employees were involved in operations, which manages production, inventory, purchasing, warehousing, freight, invoicing, shipping, collections, and returns. Twenty employees were engaged in sales, marketing, and customer technical support. Nine employees performed executive, accounting, administrative, and management information systems functions. Our dedicated personnel in Tijuana, Mexico are employees of our Mexican service provider and not included in our headcount. On December 31, 2020, Zoom had four consultants, two in research and development and two in operations, who are not included in our headcount.\nOur culture and core values. We believe that by nurturing a strong culture based on our core values we are able to attract, hire, and retain a highly engaged team. Our cultural pillars - respect, transparency, community, accountability, collaboration - reflect the way we lead and work with one another internally as well as externally with our customers, partners, suppliers and other stakeholders. We seek to embed our core values to act responsibly and with integrity, to instill a sense of individual role and purpose at Zoom, and to communicate openly and honestly. Our culture of respect and collaboration is intended to create an inclusive working environment and inclusive engagement with our stakeholders; our culture to create encourages innovation from a diversity of experiences, backgrounds and characteristics; and our culture to communicate encourages open and honest discussion. Everything we do, we do with a deep regard for each other, our customers, and our shareholders. We show our respect for each customer’s decision to welcome Zoom into their home by taking extra care to ensure our products make their connected homes safer and easier to use for life and work.\nOur response to COVID-19. As part of our efforts to keep our employees safe and support efforts to slow the spread of COVID-19, we instituted a mandatory work-from-home policy for all but a small number of onsite essential personnel, and we implemented work and safety protocols at our office facilities that put the health and safety of our team first. With the support and commitment of our employees, we have pivoted to a work-from-home model and continue protecting our customers. We believe open and on-going communications have been critical to maintaining our culture and productivity during the pandemic, and we hosted bi-weekly update calls and weekly virtual social gatherings. Management continues to monitor the conditions and government mandates to ensure safe practices as the pandemic evolves.\nExecutive Officers\nThe names and biographical information of our current executive officers are set forth below:\nName\nAge\nPosition with Zoom\nJeremy Hitchcock\nExecutive Chairman\nGraham Chynoweth\nChief Executive Officer\nSean Doherty\nChief Financial Officer\nNicole Zheng\nChief Marketing Officer\nJohn Lauten\nChief Operating Officer\nJeremy Hitchcock is a technology entrepreneur and executive who joined Zoom’s Board of Directors in May 2019. On January 16, 2020, the Board appointed Mr. Hitchcock as Chairman of the Board, to be effective as of February 1, 2020. On April 14, 2020, the Board appointed Mr. Hitchcock as Executive Chairman of the Board. Mr. Hitchcock served as President and Chief Executive Officer of Minim, Inc. prior to the merger with the Company. Mr. Hitchcock is a Principle at Orbit Group LLC, a New Hampshire based venture capital firm. Previously, Mr. Hitchcock founded Dyn when he was a student at Worcester Polytechnic Institute in 2001. Dyn is an Internet infrastructure company connecting people, content, and commerce. The company grew to 500 employees and raised $100 million of growth capital, and was acquired by Oracle Corporation in 2017. Mr. Hitchcock holds a B.S. degree from Worcester Polytechnic Institute.\nGraham Chynoweth joined Zoom in December 2020 as Chief Executive Officer. He was the Chief Executive Officer of Minim from June 2019 until Minim’s merger with Zoom. Prior to Minim, he served as Chief Membership Officer for Advanced Regenerative Manufacturing Institute from January 2017 to June 2019, and Executive Vice President and Chief Operating Officer of SilverTech, Inc. from January 2015 to December 2016. Mr. Chynoweth was also the Chief Operating Officer of Dyn from November 2005 to December 2014. He is a Founding Board Member, and has been a member of the compensation, governance, and audit committees of Primary Bank (OTCPK: PRMY) from November 2014 to October 2020. He has also served as a director for PT United, LLC since August 2016. Mr. Chynoweth holds a JD degree from Duke University School of Law, an MA degree in Public Policy from Duke University, and a BA degree in political science from the University of California, Berkeley.\nSean Doherty joined Zoom in December 2020 as Chief Financial Officer. Mr. Doherty was the Senior Vice President, Finance of Minim from May 2020 until Minim's merger with Zoom. Prior to joining Minim, he was the Managing Member at Pulpit Rock Consulting from August 2019 to October 2020. From October 2018 to July 2019, Mr. Doherty was a Director, Financial Planning and Analysis at Bottomline Technologies, Inc. (NASDAQ: EPAY). Prior to his time at Bottomline, Mr. Doherty was the Senior Manager of Finance at Dyn and then at Oracle Corporation (NYSE: ORCL) from March 2012 to October 2018. He has also served on the Board of Directors and Finance Committee of The Visiting Nurse Association of Southern New Hampshire since April 2017. Mr. Doherty holds a B.S. degree in Economics and Finance from Southern New Hampshire University as well as an MBA degree in Finance and International Business from Northeastern University.\nNicole Zheng joined Zoom in December 2020 following Minim's merger with Zoom. Ms. Zheng was a co-founder of Minim and had been the Chief Marketing Officer and Chief Product Officer of Minim, since April 2018 until Minim’s merger with Zoom. Ms. Zheng was recognized in Entrepreneur as a Top Female Founder in the United States in July 2020. Prior to Minim, she was the Chief Marketing Officer at Antidote Technologies from April 2017 to April 2018, and at OnSIP from February 2010 to April 2017. She has served as Advising CMO to quantum networking company Aliro Technologies since October 2020 and previously as a board member of Alliance of Channel Women, a nonprofit on a mission to advance careers for women in the telecom and broadband services sector, from January 2013 to November 2016. Ms. Hayward Zheng holds a B.S. degree in Materials Science Engineering and B.S. degree in Engineering and Public Policy from Carnegie Mellon University, as well as business certifications from The Wharton School Online.\nJohn Lauten joined Zoom in 2019 as a high technology senior level executive with extensive experience in consumer electronic and technology manufacturing companies. Prior to joining Zoom, he served as Chief Operating Officer for Skully Technologies from May 2017, where he led a wearable augmented reality technology company turn-around for new investors. He provided operations and strategy consulting to technology companies as a Partner at TechCXO since March 2016, Mr. Lauten served as Vice President of Business Development and Strategy at Fox Factory, a leading automotive suspension manufacturer from October 2013, where he worked on five international acquisitions as part of a CEO and Board led expansion initiative. He previously served as the Director of North American Supply Chain Management at Cisco System, Inc. from 2009, and as Head of Global Customer Operations at Scientific-Atlanta from 2003 through 2009. Prior to that he held various finance and operations positions at Scientific-Atlanta and financial roles at Northern Telecom. Mr. Lauten earned a BA degree in Business Administration/Marketing from Texas Christian University and an MBA degree from the University of Texas at Austin, McCombs School of Business with a concentration in Finance.",
    "item_1A": "ITEM 1A. - RISK FACTORS\nRisks Related to Our Business\nThe outbreak of the novel coronavirus (COVID-19) has had and will likely continue to adversely affect our business.\nThe novel strain of the coronavirus (COVID-19) has spread as a global pandemic throughout the world and has resulted in authorities imposing, and businesses and individuals implementing, numerous unprecedented measures to try to contain the virus. These efforts include travel bans and restrictions, quarantines, shelter-in-place/stay-at home and social distancing orders, and shutdowns. These measures have impacted and may further impact our workforce and operations, the operations of our customers, and those of our vendors, suppliers and manufacturing partners. The extent to which the COVID-19 pandemic will continue to affect our business, results of operations and financial condition is difficult to predict and depends on numerous evolving factors, including the duration and scope of the pandemic and its impact on overall global uncertainty; government, social, business, and other actions and have been and will be taken in response to the pandemic; and the effect of the pandemic on short- and long-term general economic conditions.\nWhile our manufacturing partners and component suppliers mostly have been able to continue to operate to date in compliance with applicable regulations and current limitations, future restrictions on their operations could impact our ability to meet customer demand and could have a material adverse effect on our financial condition and results of operations, particularly if prolonged. Similarly, current and future restrictions or disruptions of transportation, such as reduced availability of air and ground transport, port closures or congestion, and increased border controls or closures, can also impact our ability to meet demand and could materially adversely affect us. We have already observed a significant increase in the cost of air freight as a result of the pandemic, which negatively affects our profitability as we seek to transport an increased number of products from manufacturing locations in Asia to North America and international markets as quickly as possible. We have also experienced an increase in costs for ocean freight and shortages in freight capacity, which can negatively impact our ability to ship volume predictably and on a lower cost basis. In addition, rapidly shifting consumer demand during the pandemic can lead to unexpected adverse impact on our results of operations. Although we have seen a significant increase in demand for our cable modems and gateway products due to consumers responding to work-from-home and shelter-in-place measures, we do not know how long this increase may last. In particular, as vaccines become widely available and consumers return to work or school and the impact of the COVID-19 pandemic lessens, this increase in demand may begin to subside. If this demand subsides at a rapid pace, our net sales, profitability and other financial results could be adversely affected. This increase in demand has also put strain on our manufacturing partners, suppliers and logistics partners to produce and deliver a sufficient number of products to meet this demand. In particular, the limited and delayed availability of certain key components for our products, such as specialized chipsets, significantly constrains our ability to meet the increased consumer demand and over the course of the past year, we have seen lead times for some of these key components increase dramatically from as low as 12 weeks to up to 50 weeks. This in turn puts pressure on our ability to accurately forecast and increases the likelihood that the accuracy of such forecasts will be lower, which could materially adversely affect our financial results. If we were to experience weakened demand in products, our net sales, profitability and other financial results would be materially adversely impacted.\nThe pandemic has significantly increased economic and demand uncertainty and also has led to increased disruption and volatility in capital markets and credit markets. The current severe economic slowdown resulting from the pandemic has already started to lead to a global recession. There is a significant degree of uncertainty and lack of visibility as to the extent and duration of any such slowdown or recession. Risks related to a slowdown or recession include the risk that demand for our products will be significantly harmed over time if consumers choose to delay product upgrades or various projects in order to conserve funds. Given the significant economic uncertainty and volatility created by the pandemic, it is difficult to predict the nature and extent of impacts on demand for our products. These expectations are subject to change without warning.\nThe spread of COVID-19 has caused us to modify our business practices, including employee travel, employee work locations, cancellation of physical participation in meetings, events and conferences, and social distancing measures. We may take further actions as may be required by government authorities or that we determine are in the best interests of our employees, customers, partners, vendors, and suppliers. Work-from-home and other measures introduce additional operational risks, including cybersecurity risks and have affected the way we conduct our product development, testing, customer support, and other activities, which could have an adverse effect on our operations. Furthermore, we rely on third-party laboratories to test and certify our products. If these service providers close or reduce staffing, it could delay our product development efforts. There is no certainty that such measures will be sufficient to mitigate the risks posed by the virus, and illness and workforce disruptions could lead to unavailability of key personnel and harm our ability to perform critical functions. In addition, work-from-home and related business practice modifications present challenges to maintaining our corporate culture, including employee engagement and productivity, both during the immediate pandemic crisis and as we make additional adjustments in the eventual transition from it.\nThe degree to which COVID-19 impacts our results will depend on future developments, which are highly uncertain and cannot be predicted, including how quickly and to what extent normal economic and operating conditions can resume. We are similarly unable to predict the degree to which the pandemic impacts our customers, suppliers, vendors, and other partners, and their financial conditions, but a material effect on these parties could also adversely affect us. The impact of COVID-19 can also exacerbate other risks discussed below, which could in turn have a material adverse effect on us. Developments related to COVID-19 have been rapidly changing, and additional impacts and risks may arise that we are not aware of or able to appropriately respond to currently. Should the COVID-19 situation or global economic slowdown not improve or worsen, or if our attempts to mitigate its impact on our operations and costs are not successful, our business, results of operations, financial condition and prospects may be adversely affected.\nOur license agreements with Motorola have risks, including risks associated with our ability to successfully generate Motorola sales that are large enough to make our Motorola business profitable after we pay the minimum annual royalty payments required by the license agreements. Our failure to successfully increase Motorola sales could have a material effect on our liquidity and financial results.\nA substantial amount of our net sales are generated by sales of products sold under our agreements to exclusively license the Motorola brand trademark for use with such products, which expires December 31, 2025. In connection with this opportunity, Zoom has an aggressive plan to continue to introduce new Motorola brand products. Our product development plan has and will continue to increase our costs and may result in cost overruns and delays. If our sales of Motorola brand products do not meet our forecasts, this may result in excess inventory and a shortage of cash. In addition, each of the license agreements includes significant minimum quarterly royalty payments due by Zoom. If we are unable to sell a sufficient number of Motorola brand products to offset these minimum royalty payments, our net income and cash position will be reduced, and we may continue to experience losses. There are provisions in both license agreements that could cause expiration at an earlier date. If our license agreements with Motorola were to be terminated for any reason, our net sales would be materially adversely affected.\nWe may require additional funding, which may be difficult to obtain on favorable terms, if at all.\nOver the next 12 months we may require additional funding if, for instance, we buy inventory and develop products in anticipation of significant Motorola sales, if our sales are lower than forecast, or if we continue to experience losses. On March 12, 2021, we entered into a new loan and security agreement with Silicon Valley Bank (“SVB Loan Agreement”), which provides for a revolving facility up to a principal amount of $12.0 million. The availability of borrowings under the SVB Loan Agreement is subject to certain conditions and requirements. It is not certain whether all or part of this line of credit will be available to us in the future; and other sources of financing may not be available to us on a timely basis if at all, or on terms acceptable to us. If we fail to obtain acceptable additional financing when needed, we may not have sufficient resources to fund our normal operations; and this could have a material adverse effect on our business.\nOur management has concluded that our disclosure controls and procedures and internal control over financial reporting are ineffective due to the\nexistence of a material weakness in our internal control over financial reporting. If we are unable to establish and maintain effective disclosure controls and internal control over financial reporting, our ability to produce accurate financial statements on a timely basis could be impaired, and the market price of our securities may be negatively affected.\nA material weakness (as defined in Rule 12b-2 under the Exchange Act) is a deficiency, or combination of deficiencies, in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of a company’s annual or interim financial statements will not be prevented or detected on a timely basis. We carried out an evaluation, under the supervision and with the participation of management, of the effectiveness of the design and operation of our disclosure controls and procedures and internal control over financial reporting as of December 31, 2020. Based upon this evaluation, management has identified a deficiency related to the operation of a process level control to address the completeness and accuracy of unrecorded inventory and related liabilities at December 31, 2020.\nSpecifically, the Company identified inventory in-transit was not recorded upon the title transfer of the inventory to the Company, resulting in an understatement of inventory and related current liabilities. This error was corrected and impacted the consolidated balance sheet, other than stockholders’ equity, resulting in equal increases in the Company's inventory and current liabilities, only for the year end December 31, 2020, and did not impact the consolidated statements of operations.\nWe may be unsuccessful in integrating the operations of the business we have acquired or expect to acquire in the future.\nFrom time to time, we may acquire businesses, assets, or securities of companies that we believe will provide a strategic fit with our business. We integrate acquired businesses with our existing operations; our overall internal control over financial reporting processes; and our financial, operations, and information systems. If the financial performance of our business, as supplemented by the assets and businesses acquired, does not meet our expectations, it may make it more difficult for us to service our debt obligations and our results of operations may fail to meet market expectations. We may not effectively assimilate the business or product offerings of acquired companies into our business or within the anticipated costs or timeframes, retain key customers and suppliers or key employees of acquired businesses, or successfully implement our business plan for the combined business. In addition, our final determinations and appraisals of the estimated fair value of assets acquired and liabilities assumed in our acquisitions may vary materially from earlier estimates and we may fail to realize fully anticipated cost savings, growth opportunities or other potential synergies. We cannot assure that the fair value of acquired businesses or investments will remain constant.\nOur business strategy includes significant growth plans, and our financial condition and results of operations could be negatively affected if we fail to grow or fail to manage our growth effectively.\nWe intend to pursue an organic growth strategy for our business; however, we regularly evaluate potential acquisitions and expansion opportunities. If appropriate opportunities present themselves, we expect to engage in selected acquisitions and other business growth initiatives or undertakings. There can be no assurance that we will successfully identify appropriate opportunities, that we will be able to negotiate or finance such activities or that such activities, if undertaken, will be successful. There are risks associated with our growth strategy. To the extent that we grow through acquisitions, we cannot ensure that we will be able to adequately or profitably manage this growth. Our existing operations, personnel, systems and internal control may not be adequate to support our growth and expansion and may require us to make additional unanticipated investments in our infrastructure.\nAcquiring other companies or other assets, as well as other expansion activities, involves various risks including the risks of incorrectly assessing the value of acquired assets, encountering greater than expected costs of integrating, the risk of loss of customers and/or employees of the acquired business, executing cost savings measures, not achieving revenue enhancements and otherwise not realizing the transaction’s anticipated benefits. Our ability to address these matters successfully cannot be assured. In addition, our strategic efforts may divert resources or management’s attention from ongoing business operations, may require investment in integration and in development and enhancement of additional operational and reporting processes and controls.\nOur growth initiatives may also require us to recruit and retain experienced personnel to assist in such initiatives. Accordingly, the failure to identify and retain such personnel would place significant limitations on our ability to successfully execute our growth strategy.\nIf we do not successfully execute our acquisition growth plan, it could adversely affect our business, financial condition, results of operations, reputation and growth prospects. In addition, if we were to conclude that the value of an acquired business had decreased and that the related goodwill had been impaired, that conclusion would result in an impairment of goodwill charge, which would adversely affect our results of operations. While we believe we will have the executive management resources and internal systems in place to successfully manage our future growth, there can be no assurance growth opportunities will be available or that we will successfully manage our growth.\nOur reliance on a small number of customers for a large portion of our revenues could materially harm our business and prospects.\nRelatively few companies account for a substantial portion of the Company’s revenues. In 2020, two companies accounted for 10% or greater individually, and 76% in the aggregate of the Company’s total net sales. At December 31, 2020, three companies with an accounts receivable balance of 10% or greater individually accounted for a combined 85% of the Company’s accounts receivable. In 2019, two companies accounted for 10% or greater individually, and 84% in the aggregate of the Company’s total net sales. At December 31, 2019, three companies with an accounts receivable balance of 10% or greater individually accounted for a combined 84% of the Company’s accounts receivable.\nOur customers generally do not enter into long-term agreements obligating them to purchase our products. Because of our significant customer concentration, our net sales and operating income could fluctuate significantly due to changes in political or economic conditions or the loss of, reduction of business with, or less favorable terms for any of our significant customers. The loss of one or more of our largest customers, the failure of such customers to pay amounts due to us, or a material reduction in the amount of purchases made by such customers could have a material adverse effect on our business, financial position, results of operations and cash flows.\nThe market for Internet access products and services has many competing technologies, and the demand for certain of our products and services is declining.\nIf we are unable to grow demand for our broadband and dial-up modems or other products, we may be unable to sustain or grow our business. The market for high-speed communications products and services has a number of competing technologies. For instance, Internet access can be achieved by using a standard telephone line with an appropriate modem and dial-up or DSL service; using a cable TV line with a cable modem and cable modem service; or using a mobile broadband modem and mobile broadband service. We currently sell products that include all these technologies. The introduction of new products by competitors, market acceptance of competing products based on new or alternative technologies, or the emergence of new industry standards have in the past rendered and could continue to render our products less competitive or even obsolete.\nOur reliance on sole suppliers or limited sources of supply could materially harm our business.\nWe obtain certain key parts, components, and equipment from sole or limited sources of supply. In 2020, the Company had two suppliers that provided 99% of the Company's purchased inventory. In 2019, the Company had one supplier that provided 96% of the Company's purchased inventory. Also, as examples, the vast majority of our broadband modems use Broadcom chipsets and the vast majority of our dial-up modems use Conexant chipsets. The loss of the products or services of any of our significant suppliers or a material change in their business or their relationship with us could harm our business and operating results. While many companies that use computer chips in their business experienced during 2020 supply chain issues in sourcing chips due to a chip shortage, we did not yet experience issues during 2020 resulting from material delays or unavailability of chips. There can be no assurance, however, that we will not experience such issues in the future. We have experienced delays in receiving shipments of essential integrated circuits during other past periods, and we may experience such delays in the future. Moreover, we cannot assure you that a chipset supplier will, in the future, sell chipsets to us in quantities sufficient to meet our needs or that we will purchase the specified dollar amount of products necessary to receive concessions and incentives from a chipset supplier. An interruption in a chipset supplier's ability to deliver chipsets, a failure of our suppliers to produce chipset enhancements or new chipsets on a timely basis and at competitive prices, a material increase in the price of the chipsets, our failure to purchase a specified dollar amount of products or any other adverse change in our relationship with modem component suppliers could have a material adverse effect on our results of operations. In the past we have experienced long lead-times and significant delays in receiving shipments of modem chipsets from our sole source suppliers. We may experience similar delays in the future. In addition, some products may have other components that are available from only one source. If we are unable to obtain a sufficient supply of components from our current sources, we would experience difficulties in obtaining alternative sources or in altering product designs to use alternative components. Resulting delays or reductions in product shipments could damage relationships with our customers, and our customers could decide to purchase products from our competitors. Inability to meet our customers’ demand or a decision by one or more of our customers to purchase products from our competitors could harm our operating results.\nWe believe that our future success will depend in large part on our ability to more successfully penetrate the broadband modem markets, which have been challenging markets, with significant barriers to entry.\nWe believe that our future success depends in large part on our ability to penetrate the broadband modem markets including cable and mobile broadband. These markets have significant barriers to entry. Although some cable, and mobile broadband modems are sold at retail, the high-volume purchasers of these modems are concentrated in a relatively few large cable, telephone and mobile broadband service providers which offer broadband modem services to their customers. These customers, particularly cable and mobile broadband services providers, also have extensive and varied certification processes for modems to be approved for use on their network. Obtaining these certifications is expensive and time consuming, and the certification processes continue to evolve. Successfully penetrating the broadband modem market therefore presents a number of challenges including: the current limited retail market for broadband modems; the relatively small number of cable, telecommunications and Internet service provider customers that make up the bulk of the market for broadband modems in certain countries, including the United States; the significant bargaining power of these large volume purchasers; the time consuming, expensive, uncertain and varied certification process of the various cable service providers; the savings, if any, offered to customers who use their own modem instead of one supplied by the service provider; and the strong relationships with cable service providers enjoyed by incumbent cable equipment providers like Arris.\nIf we fail to meet changing customer requirements and emerging industry standards, there would be an adverse impact on our ability to sell our products and services.\nThe market for Internet access products and services is characterized by aggressive pricing practices, continually changing customer demand patterns, rapid technological advances, emerging industry standards and short product life cycles. Some of our product and service developments and enhancements have taken longer than planned and have delayed the availability of our products and services, which adversely affected our sales and profitability in the past. Any significant delays in the future may adversely impact our ability to sell our products and services, and our results of operations and financial condition may be adversely affected. Our future success will depend in large part upon our ability to: identify and respond to emerging technological trends and industry standards in the market; develop and maintain competitive products that meet changing customer demands; enhance our products by adding innovative features that differentiate our products from those of our competitors; bring products to market on a timely basis; introduce products that have competitive prices; manage our product transitions, inventory levels and manufacturing processes efficiently; respond effectively to new technological changes or new product announcements by others; meet changing industry standards; distribute our products quickly in response to customer demand; and compete successfully in the markets for our new products. These factors could also have an adverse effective on our operating results.\nOur product cycles tend to be short and we may incur significant non-recoverable expenses or devote significant resources to sales that do not occur when anticipated. Therefore, the resources we devote to product development, sales and marketing may not generate material net sales for us. In addition, short product cycles have resulted in and may in the future result in excess and obsolete inventory, which has had and may in the future have an adverse effect on our results of operations. In an effort to develop innovative products and technology, we have incurred and may in the future incur substantial development, sales, marketing, and inventory costs. If we are unable to recover these costs, our financial condition and results could be adversely affected. In addition, if we sell our products at reduced prices in anticipation of cost reductions and we still have higher cost products in inventory, our business would be harmed, and our results of operations and financial condition would be adversely affected.\nOur operations are subject to a number of risks that could harm our business.\nCurrently, our business is significantly dependent on our operations outside the US, particularly the production of substantially all of our products. For the fiscal year ending December 31, 2020, sales outside North America were only 1.8% of our net sales. However, almost all of our manufacturing operations are now located outside of the United States. The inherent risks of international operations could harm our business, results of operation, and liquidity. For instance, our operations in Mexico are subject to the challenges and risks associated with international operations, including those related to integration of operations across different cultures and languages, and economic, legal, political and regulatory risks. In addition, fluctuations in the currency exchange rates have had, and may continue to have, an adverse effect on our financial results. The types of risks faced in connection with international operations include, among others: regulatory and communications requirements and policy changes; currency exchange rate fluctuation, including changes in value of the VND, RMB and Mexican peso relative to the US dollar; cultural differences; reduced control over staff and other difficulties in staffing and managing foreign operations; reduced protection for intellectual property rights in some countries; political and economic changes and disruptions; governmental currency controls; shipping costs; strikes and work slowdowns at ports or other locations in the supply path; and import, export, and tariff regulations. Almost all of our products are built in Vietnam, mainland China or Taiwan, so these products are subject to numerous risks including currency risk and economic, legal, political and regulatory risks. Additionally, the US government has instituted or proposed other changes in trade policies that include the negotiation or termination of trade agreements economic sanctions on individuals, corporations or countries, and other government regulations affecting trade between the United States and other countries where we conduct our business. It may be time-consuming and expensive for us to alter our business operations in order to adapt to or comply with any such changes. If the United States were to withdraw from or materially modify international trade agreements to which it is a party, or if tariffs were imposed or raised on the products sourced from outside the United States that we buy, our costs for such products could increase significantly, which in turn could have a material adverse effect on our business, financial condition and results of operations.\nIf we fail to effectively manage our inventory levels, there could be a material and adverse effect on our liquidity and our business.\nDue to rapid technological change and changing markets, we are required to manage our inventory levels carefully to both meet customer expectations regarding delivery times and to limit our excess inventory exposure. In the event we fail to effectively manage our inventory, our liquidity may be adversely affected and we may face increased risk of inventory obsolescence, a decline in market value of the inventory, or losses from theft, fire, or other casualty.\nWe may be unable to produce sufficient quantities of our products because we depend on third-party manufacturers. If these third-party manufacturers fail to produce quality products in a timely manner, our ability to fulfill our customer orders would be adversely impacted.\nWe use contract manufacturers and original design manufacturers for electronics manufacturing of most of our products. We use these third-party manufacturers to help ensure low costs, rapid market entry and reliability. Any manufacturing disruption could impair our ability to fulfill orders, and a failure to fulfill orders would adversely affect our sales. Although we currently use four electronics manufacturers for the bulk of our purchases, in some cases a given product is only provided by one of these companies. The loss of the services of any of our significant third-party manufacturers or a material adverse change in the business of or our relationships with any of these manufacturers could harm our business. Since third parties manufacture our products and we expect this to continue in the future, our success will depend, in part, on the ability of third parties to manufacture our products cost effectively and in sufficient quantities to meet our customer demand.\nWe are subject to the following risks because of our reliance on third-party manufacturers: reduced management and control of component purchases; reduced control over delivery schedules, quality assurance, manufacturing yields, and labor practices; lack of adequate capacity during periods of excess demand; limited warranties on products supplied to us; potential increases in prices; interruption of supplies from assemblers as a result of a fire, natural calamity, global health pandemic, strike or other significant event; and misappropriation of our intellectual property.\nOur cable modem sales may be significantly reduced due to long lead-times.\nDuring 2020, approximately 93% of net sales were cable and other broadband modems, of which 64% were WiFi-enabled devices. These products have experienced long lead-times due to certain component production lead-times of up to 20 weeks and due to manufacturer-related delays, and these long lead times may significantly reduce our potential sales.\nWe face significant competition, which could result in decreased demand for our products or services.\nWe may be unable to compete successfully. A number of companies have developed, or are expected to develop, products that compete or will compete with our products. Furthermore, many of our current and potential competitors have significantly greater resources than we do. Intense competition, rapid technological change and evolving industry standards could result in less favorable selling terms to our customers, decrease demand for our products or make our products obsolete. Our operating results and our ability to compete could be adversely affected if we are unable to: successfully and accurately anticipate customer demand; manage our product transitions, inventory levels and manufacturing processes efficiently; distribute or introduce our products quickly in response to customer demand and technological advances; differentiate our products from those of our competitors; or otherwise compete successfully in the markets for our products.\nOur future success will depend on the continued services of our key product development personnel.\nThe loss of any of our key product development personnel, the inability to attract or retain qualified personnel in the future, or delays in hiring skilled personnel could harm our business. Competition for skilled personnel is significant. We may be unable to attract and retain all the personnel necessary for the development of our business. In addition, the loss of any member of the senior management team, a key engineer or salesperson, or other key contributors, could harm our relations with our customers, our ability to respond to technological change, and our business.\nRisks Related to International Operations\nFluctuations in the foreign currency exchange rates in relation to the US dollar could have a material adverse effect on our operating results.\nChanges in currency exchange rates that increase the relative value of the US dollar may make it more difficult for us to compete with foreign manufacturers on price, may reduce our foreign currency denominated sales when expressed in dollars, or may otherwise have a material adverse effect on our sales and operating results. A significant increase in our foreign currency denominated sales would increase our risk associated with foreign currency fluctuations. A weakness in the US dollar relative to the Mexican peso and various Asian currencies, especially the Vietnamese dong (“VND”) and the Chinese renminbi (“RMB”), could increase our product costs. Fluctuations in the currency exchange rates have, and may continue to, adversely affect our operating results.\nCapacity constraints in our Mexican operations could reduce our sales and revenues and hurt customer relationships.\nWe rely on our Mexican operations to finish and ship most of the products we sell. Since moving our operations to our Mexican facility we have experienced and may continue to experience constraints on our capacity as we address challenges related to operating our new facility, such as hiring and training workers, creating the facility’s infrastructure, developing new supplier relationships, complying with customs and border regulations, and resolving shipping and logistical issues. Our net sales may be reduced, and our customer relationships may be impaired if we continue to experience constraints on our capacity. We are working to minimize capacity constraints in a cost-effective manner, but there can be no assurance that we will be able to adequately minimize capacity constraints.\nOur reliance on a business processing outsourcing partner to conduct our operations in Mexico could materially harm our business and prospects.\nIn connection with our North American manufacturing operations in Mexico, we rely on a business processing outsourcing partner to hire, subject to our oversight, the team for our Mexican operations, provide the selected facility described above, and coordinate many of the ongoing logistics relating to our operations in Mexico. Our outsourcing partner’s related functions include acquiring the necessary Mexican permits, providing the appropriate Mexican operating entity, assisting in customs clearances, and providing other general assistance and administrative services in connection with the ongoing operation of the Mexican facility. Our outsourcing partner’s performance of these obligations efficiently and effectively is critical to the success of our operations in Mexico. Failure of our outsourcing partner to perform its obligations efficiently and effectively could result in delays, unanticipated costs or interruptions in production, delays in deliveries to our customers or other harm to our business, results of operation, and liquidity. Moreover, if our outsourcing arrangement is not successful, we cannot assure our ability to find an alternative production facility or outsourcing partner to assist in our operations in Mexico or our ability to operate successfully in Mexico without outsourcing or similar assistance.\nTariffs significantly harm our cash flow and profitability, and they may continue to do that in the future.\nSince September 24, 2018, almost all of our products produced in China have been subject to a tariff on our cost of goods at the time of entry into the United States. The tariff started at 10% and increased to 25% in June 2019. These tariffs have a significant impact on our cost of inventory and profitability. These tariffs may not be reduced and may even be increased. Although we have actively worked on finding production capability outside China, it is not possible to predict the impact of tariffs in the future, which could have a material adverse impact on our net income and cash position and we may continue to experience losses.\nRisks Related to Our Products, Technology and Intellectual Property\nWe may be subject to product returns resulting from defects or from overstocking of our products. Product returns could result in the failure to attain market acceptance of our products, which would harm our business.\nIf our products contain undetected defects, errors, or failures, we could face delays in the development of our products, numerous product returns, and other losses to us or to our customers or end users. Any of these occurrences could also result in the loss of or delay in market acceptance of our products, either of which would reduce our sales and harm our business. We are also exposed to the risk of product returns from our customers as a result of contractual stock rotation privileges and our practice of assisting some of our customers in balancing their inventories. Overstocking has led in the past and may lead in the future to higher than normal customer returns.\nSecurity breaches and data loss may expose us to liability, harm our reputation and adversely affect our business.\nAs part of our business operations, we collect, store, process, use and disclose sensitive data relating to our business, including in connection with the provision of our cloud services and in our information systems and data centers (including third-party data centers). We also engage third-party providers to assist in the development of our products and for services that may include the collection, handling, processing and storage of personal data on our behalf. In addition, we host our customers’ subscriber data in third-party data centers in the course of providing our products and cloud-based platform solutions and services to our customers. While we and our third-party providers apply multiple layers of security to control access to data and use encryption and authentication technologies to secure data from unauthorized access, use, alteration and disclosure, these security measures may be compromised. Malicious hackers may attempt to gain access to our network or data centers; steal proprietary information related to our business, products, employees and customers; or interrupt our systems and services or those of our customers or others. In particular, there has been a spike in cybersecurity attacks during the COVID-19 pandemic and work-from-home environment.\nSome of our software products contain “open source” software under terms of open source licenses, which include, but are not limited to, General Public License Version 2 and MIT Licenses.\nThe use of open source software has risks related to open source license compliance and software quality control. The Company mitigates these risks by employing processes such as open source license review prior to technology selection and upgrade version testing prior to deployment. However, it must be noted that the risks described above cannot be eliminated.\nWe may experience costs and senior management distractions due to patent-related matters.\nMany of our products incorporate patented technology. We attempt to license appropriate patents either directly or through our integrated circuit suppliers. However, we are subject to costs and senior management distractions due to patent-related litigation.\nPatent litigation matters are complex and time consuming and expose Zoom to potentially material obligations. It is impossible to assess the potential cost and senior management distraction associated with patent litigation matters that are currently outstanding or may occur in the future.\nWe may have difficulty protecting our intellectual property.\nOur ability to compete is heavily affected by our ability to protect our intellectual property. We rely primarily on trade secret laws, confidentiality procedures, patents, copyrights, trademarks, and licensing arrangements to protect our intellectual property. The steps we take to protect our technology may be inadequate. Existing trade secret, trademark and copyright laws offer only limited protection. Our patents could be invalidated or circumvented. We have more intellectual property assets in some countries than we do in others. In addition, the laws of some foreign countries in which our products are or may be developed, manufactured or sold may not protect our products or intellectual property rights to the same extent as do the laws of the United States. This may make the possibility of piracy of our technology and products more likely. In February 2021, Zoom Video Communications, Inc. filed a petition with the US Patent and Trademark Office seeking cancellation of the Company’s Zoom® trademark. The Company believes it has meritorious defenses to the petition and intends vigorously to oppose the cancellation petition. We cannot ensure that the steps that we have taken to protect our intellectual property will be adequate to prevent misappropriation of our technology.\nWe could infringe the intellectual property rights of others.\nParticular aspects of our technology could be found to infringe on the intellectual property rights or patents of others. Other companies may hold or obtain patents on inventions or may otherwise claim proprietary rights to technology necessary to our business. We cannot predict the extent to which we may be required to seek licenses. We cannot assure you that the terms of any licenses we may be required to seek will be reasonable. We are often indemnified by our suppliers relative to certain intellectual property rights. However, these indemnifications do not cover all possible suits, and there can be no assurance that a relevant indemnification will be honored by the indemnifying party or that the indemnifying party has the financial resources to meet its indemnification obligation.\nFinancial, Regulatory and Tax Compliance Risks\nWe could be subject to additional sales tax or other tax liabilities.\nStates have varying policies regarding when a company has a taxable presence in the state. There are many factors to consider when determining if state nexus exists, including inventory consignment to ordering and fulfillment, physical presence, economic presence, and personnel. We have policies and procedures in place to collect and pay sales tax for Amazon sales in states where we believe we have nexus and are required to charge sales tax. However, it is possible that we could be negatively impacted by a change in state laws and policies, court decisions, Federal law, or our decisions about where sales tax is owed. In addition, we may incur income tax liability in some states where we have nexus.\nEnvironmental regulations may increase our manufacturing costs and harm our business.\nIn the past, environmental regulations have increased our manufacturing costs and caused us to modify products. New state, US, or other regulations may in the future impact our product costs or restrict our ability to ship certain products into certain regions.\nChanges in current or future laws or governmental regulations and industry standards that negatively impact our products, services and technologies could harm our business.\nThe jurisdiction of the Federal Communications Commission (“FCC”), extends to the entire US communications industry including our customers and their products and services that incorporate our products. Our products are also required to meet the regulatory requirements of other countries throughout the world where our products and services are sold. Obtaining government certifications is time-consuming and costly. In the past, we have encountered delays in the introduction of our products, such as our cable modems, as a result of the need to obtain government certifications. We may face further delays if we are unable to comply with governmental regulations. Delays caused by the time it takes to comply with regulatory requirements may result in cancellations or postponements of product orders or purchases by our customers, which would harm our business.\nIn addition to reliability and quality standards, the market acceptance of certain products and services is dependent upon the adoption of industry standards so that products from multiple manufacturers are able to communicate with each other. Standards are continuously being modified and replaced. As standards evolve, we may be required to modify our existing products or develop and support new versions of our products. The failure of our products to comply, or delays in compliance, with various existing and evolving industry standards could delay or interrupt volume production of our products, which could harm our business.\nOur ability to use our net operating losses (“NOLs”) may be negatively affected if there is an “ownership change” as defined under Section 382 of the Internal Revenue Code.\nAt December 31, 2020, we had approximately $61.8 million in federal NOLs. These deferred tax assets are currently fully reserved. Under Internal Revenue Code Section 382 rules, if a change of ownership is triggered, our ability to use our NOLs can be negatively affected if there is an “ownership change” as defined under Internal Revenue Code Section 382. An ownership change at any time is determined by considering each stockholder with 5% or more ownership, summing the highest percentage change for each of those stockholders over the prior three years, and determining that the sum exceeds 50%. The beliefs that a change of ownership limiting the use of our NOLs occurred during 2020. The Company is in the process of determining the impact of any such limitation. Since ownership changes are measured over three-year periods, it is possible that additional changes of ownership may occur in the future.\nRisks Related to the Securities Market and Our Common Stock\nThe market price of our common stock may be volatile and trading volume may be low.\nThe market price of our common stock could fluctuate significantly for many reasons, including, without limitation: as a result of the risk factors listed herein; actual or anticipated fluctuations in our operating results; regulatory changes that could impact our business; and general economic and industry conditions. Shares of our common stock are quoted on the OTCQB Venture Market. The lack of an active market may impair the ability of holders of our common stock to sell their shares of common stock at the time they wish to sell them or at a price that they consider reasonable. The lack of an active market may also reduce the fair market value of the shares of our common stock.\nWe do not expect to pay any dividends in the foreseeable future.\nWe do not expect to declare dividends in the foreseeable future. We currently intend to retain cash to support our operations and to finance the growth and development of our business. There can be no assurance that we will have, at any time, sufficient surplus under Delaware law to be able to pay any dividends. In addition, pursuant to the SVB Loan Agreement, we cannot pay any dividends without Silicon Valley Bank’s prior written consent. If we do not pay dividends, the price of our common stock must appreciate for you to receive a gain on your investment in the Company.\nOur Executive Chairman and his family own a significant percentage of our shares, which will limit your ability to influence corporate matters.\nOur Executive Chairman, and his family owned approximately 50.24% percent of our outstanding shares of Common Stock as of March 26, 2021. Accordingly, he could have a significant influence over the outcome of any corporate transaction or other matter submitted to our stockholders for approval, including the election of directors, mergers, consolidations and the sale of all or substantially all of our assets and also could prevent or cause a change in control. The interests of the Executive Chairman and his family may differ from the interests of our other stockholders. Third parties may be discouraged from making a tender offer or bid to acquire us because of this concentration of ownership.",
    "item_1B": "ITEM 1B. - UNRESOLVED STAFF COMMENTS\nNone.",
    "item_2": "ITEM 2 - PROPERTIES\nOur principal executive offices are located at 848 Elm Street, Manchester, New Hampshire, where we sublease approximately 2,656 square feet of office space pursuant to a lease that expires in 2021, with an automatic renewal clause unless terminated under the lease agreement.\nThe Company signed a twelve-month lease agreement for offices at 225 Franklin Street, Boston, MA and completed the move to this location on June 28, 2019. The lease has an automatic renewal option provision and renews unless cancelled under the terms of the agreement. This lease originally expired on June 30, 2020, after which the Company reduced its footprint of leased space and continued on a short-term basis until October 31, 2020. Beginning November 1, 2020, while reviewing options for long-term lease for headquarters in Boston, the Company signed a month-to-month lease agreement for a single office at 101 Arch Street, Boston, MA. The Company has elected to apply the short-term lease exception under ASC 842 which does not require the recognition of an operating lease liability or right-of-use asset on the condensed consolidated balance sheet in relation to the lease at 101 Arch Street.\nIn May 2020, the Company signed a two-year lease agreement for 3,218 square feet at 275 Turnpike Executive Park, Canton MA. The agreement includes a one-time option to cancel the second year of lease with three-month advance notice. The location is currently being occupied by the research and development group of the Company.\nWe also have two leases in Tijuana, Mexico. We signed a lease for a 11,390 square foot facility in November 2014, and in September 2015, also leased spaced in the adjacent building to double our capacity. Our lease expired in November 2020, and we have been leasing on a month-to-month basis after November 2020 while we negotiate a lease renewal.\nWe believe that our existing facilities are adequate for our near-term needs, though additional space could be required based upon business activities. When our existing leases expire, we may look for alternate space for our operations. We believe that suitable alternative space would be available on commercially reasonable terms if required in the future.",
    "item_3": "ITEM 3 - LEGAL PROCEEDINGS\nIn the ordinary course of their business, the Company and its subsidiaries are subject to lawsuits, arbitrations, claims, and other legal proceedings in connection with their business. Some of the legal actions include claims for substantial or unspecified compensatory and/or punitive damages. A substantial adverse judgment or other unfavorable resolution of these matters could have a material adverse effect on the Company’s financial condition, results of operations, and cash flows. Management believes that the Company has adequate legal defenses with respect to the legal proceedings to which it is a defendant or respondent and that the outcome of these pending proceedings is not likely to have a material adverse effect on the financial condition, results of operations, or cash flows of the Company. However, the Company is unable to predict the outcome of these matters.",
    "item_4": "ITEM 4 - MINE SAFETY DISCLOSURES\nNot applicable.\nPART II",
    "item_5": "ITEM 5 - MARKET FOR REGISTRANT'S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur common stock trades on the OTCQB under the symbol \"MINM\" (formerly traded under the symbol “ZMTP” until December 8, 2020).\nAs of March 26, 2021, there were 35,362,854 shares of our common stock outstanding and 134 holders of record of our common stock.\nDividend Policy\nWe have never declared or paid cash dividends on our capital stock and do not plan to pay any cash dividends in the foreseeable future. Our current policy is to retain all of our earnings to finance future growth. In addition, pursuant to the SVB Loan Agreement, which was executed on March 12, 2021, we cannot pay any dividends without Silicon Valley Bank’s prior written consent.\nRepurchases by the Company\nDuring the fiscal year ended December 31, 2020, we did not repurchase any shares of our common stock.\nEquity Compensation Plan Information\nThe information required by this Item 5 regarding securities authorized for issuance under our equity compensation plans is set forth in Part III, Item 12 of this report.",
    "item_6": "ITEM 6 - SELECTED FINANCIAL DATA\nThis item has been omitted based on Zoom’s status as a smaller reporting company.",
    "item_7": "ITEM 7 - MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following section of this Annual Report on Form 10-K entitled “Management’s Discussion and Analysis of Financial Condition and Results of Operations” contains statements that are not statements of historical fact and are forward-looking statements within the meaning of federal securities laws. These statements involve known and unknown risks, uncertainties and other factors that may cause our actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. These statements reflect our current views with respect to future events and are based on assumptions and subject to risks and uncertainties. Factors that may cause our actual results to differ materially from those in the forward-looking statements include those factors described in “Item 1A. Risk Factors” beginning on page 13 of this Annual Report on Form 10-K. You should carefully review all of these factors, as well as the comprehensive discussion of forward-looking statements on page 22 of this Annual Report on Form 10-K.\nOverview\nWe deliver innovative internet access products that reliably and securely connect homes and offices around the world. We derive our net sales primarily from sales of home networking products including cable modems, cable modem/routers, wireless routers, and mesh WiFi systems to retailers, distributors, and Internet Service Providers under an exclusive global license to the Motorola® brand, as well as our ZOOM® brand. Our AI-driven cloud platform and applications, acquired on December 4, 2020 through a merger with Minim Inc., make network optimization simple for broadband users and their service- leading to higher customer satisfaction and decreased support burden.\nWe sell our products through a direct sales force, independent sales agents, distributors, and reseller partners. Our growth strategy centers on four key pillars: distributing high-margin software on hardware products as a profit driver; employing customer-driven product design and planning; expanding our global sales reach with ISPs and retailers; and mitigating costs and risks through supply chain resiliency. We believe our competitive edge in the market is forged by our software-driven approach to hardware product delivery, radical customer centricity, and commitment to win-win relationships with our reseller and partner base.\nWe are experienced in electronics hardware, firmware, and software design and testing, regulatory certifications, product documentation, and packaging; and we use that experience in developing each product in-house or in partnership with suppliers who are typically based in Asia. Electronic assembly and testing of the Company’s products in accordance with our specifications is typically done in Asia.\nWe continually seek to improve our product designs and manufacturing approach to elevate product performance and reduce our costs. We pursue a strategy of outsourcing rather than internally developing our hardware product chipsets, which are application-specific integrated circuits that form the technology base for our modems. By outsourcing the chipset technology, we are able to concentrate our research and development resources on modem system design, leverage the extensive research and development capabilities of our chipset suppliers, and reduce our development time and associated costs and risks. As a result of this approach, we are able to quickly develop new products while maintaining a relatively low level of research and development expense as a percentage of net sales. We also outsource aspects of our manufacturing to contract manufacturers as a means of reducing our costs of production, and to provide us with greater flexibility in our production capacity.\nGenerally, our gross margin for a given product depends on a number of factors, including the type of customer to whom we are selling. The gross margin products sold to retailers tends to be higher than for some of our other customers; but the sales, support, returns, and overhead costs associated with products sold to retailers also tend to be higher. Zoom’s sales to certain countries are currently handled by a single master distributor for each country that handles the support and marketing costs within the country. Gross margin for sales to these master distributors tends to be low, since lower pricing to these distributors helps them to cover the support and marketing costs for their country.\nThe Company’s cash and cash equivalents balance on December 31, 2020 was $772 thousand compared to $1.2 million on December 31, 2019. On December 31, 2020, the Company had $2.4 million outstanding bank debt on an available asset-based credit line of $4.0 million, and working capital of $5.9 million.\nThe Company closed on a $3.4 million private placement and issued an aggregate of 2,237,103 shares on May 26, 2020 at a purchase price of $1.52 per share, and in connection with the closing of the offering two designees of an investor in the private placement joined Zoom’s Board of Directors. Other major changes of cash and cash equivalents during 2020 were decreases of approximately $5.0 million in accounts receivables, $8.8 million in inventories, and $0.3 million in prepaid expenses and other current assets; and increases of approximately $6.7 million in accounts payable and $4.7 million in accrued expenses. The Company had drawn $2.4 million, net, of its credit line. In 2020, the Company also had a net loss of $3.9 million, which contributed to the decrease in cash and cash equivalents.\nThe Company’s ability to maintain adequate levels of liquidity depends in part on our ability to sell inventory on hand and collect related receivables. Effective September 24, 2018, almost all of our products were subject to a 10% tariff because they were produced in China and they were in product categories subject to a 10% tariff on our cost of goods at the time of entry into the United States. Effective June 15, 2019 almost all of our products were subject to the tariff increase from 10% to 25%. This has a significant impact on our cost of inventory and profitability. Because these tariffs may not be reduced and may even be increased, we moved a substantial portion of our production capability outside China to Vietnam. Although the Company has recently experienced losses, it has continued to experience sales growth. Zoom experienced five consecutive years with double-digit sales growth.\nCOVID-19 Pandemic\nWe are subject to risks and uncertainties as a result of the COVID-19 pandemic. The extent of the impact of the COVID-19 pandemic on our business is highly uncertain and difficult to predict as coronavirus continues to spread around the world. The availability of vaccines has been limited, and there can be no assurance as to when the pandemic will be contained. Since March 2020, we have instituted office closures, travel restrictions and a mandatory work-from-home policy for substantially all of our employees. The spread of COVID-19 has had a prolonged impact on our supply chain operations due to restrictions, reduced capacity and limited availability from suppliers whom we rely on for sourcing components and materials and from third-party partners whom we rely on for manufacturing, warehousing and logistics services. Although demand for our products has been strong in the short-term as consumers seek more bandwidth and better Wi-Fi, customers’ purchasing decisions over the long-term may be impacted by the pandemic and its impact on the economy, which could in turn impact our revenue and results of operations. Furthermore, our supply chain continues to face constraints primarily due to challenges in sourcing components and materials for our products. The prolonged impact of COVID-19 could exacerbate these constraints or cause further supply chain disruptions.\nIn the second quarter of 2020, the Company temporarily shifted from the use of primarily ocean freight during prior quarters to the use of primarily air freight during the second quarter of 2020 and into the third quarter of 2020 to keep up with demand and replenish supply. By the fourth quarter of 2020, the Company had returned to primarily ocean freight. These changes in freight transportation resulted in an additional $1.5 million in freight expense incurred during the year ended December 31, 2020. The Company also implemented cost cutting measures to conserve cash, delaying the planned start dates of all new hiring during 2020, and not renewing the same footprint of its headquarters office lease when it expired in June 2020. The Company retained a small executive office within the City of Boston on a short-term, month-to-month basis at a cost of $682 per month starting November 1, 2020. The Company negotiated extended and improved payment terms with its primary outsourced manufacturing partner. The Company applied for and received approval for a Small Business Administration (“SBA”) Paycheck Protection Plan Loan with Primary Bank under the Coronavirus Aid, Relief and Economic Security Act (the “CARES Act”). The loan in the amount of $583.3 thousand was approved and funded in April 2020. The Company used the proceeds from the loan for qualifying expenses as defined in the CARES Act.\nRecent Accounting Standards\nPlease refer to Note 2 of the Notes to the Consolidated Financial Statements, which is incorporated herein by reference.\nCritical Accounting Policies and Estimates\nFollowing is a discussion of what we view as our more significant accounting policies and estimates. As described below, management judgments and estimates must be made and used in connection with the preparation of our consolidated financial statements. We have identified areas where material differences could result in the amount and timing of our net sales, costs, and expenses for any period if we had made different judgments or used different estimates.\nRevenue Recognition. The Company primarily sells hardware products to its customers. The hardware products include cable modems and gateways, mobile broadband modems, wireless routers, MoCA adapters and mesh home networking devices. The Company also sells software, including the Minim subscription service that enables and secures a better connected home.\nThe Company derives its net sales primarily from the sales of hardware products to computer peripherals retailers, computer product distributors, OEMs, and direct to consumers and other channel partners via the Internet. The Company accounts for point-of-sale taxes on a net basis. In addition, the Company earns revenues from its software subscription services of the Minim AI-driven smart home WiFi management and security platform.\nThe Company applies Accounting Standards Codification (“ASC”) Topic 606, which requires that an entity recognize revenue when it transfers promised goods or services to customers in an amount that reflects the consideration to which a company expects to be entitled in exchange for those goods or services.\nProduct Returns. Products are returned by retail stores and distributors for inventory balancing, contractual stock rotation privileges, and warranty repair or replacements. Analyses of actual returned product are compared to analyses of the product return estimates and historically have resulted in no material difference between the two. The Company has concluded that the current process of estimating the return reserve represents a fair measure with which to adjust revenue. Returned goods are variable and under Topic 606, are estimated and recognized as a reduction of revenue as performance obligations are satisfied (e.g. upon shipment of goods). Under Topic 606, the Company monitors pending authorized returns of goods and, if deemed appropriate, record the right of return asset accordingly.\nPrice Protection Refunds. We have a policy of offering price protection to certain of our retailer and distributor customers for some or all their inventory. Price protection provides that if the Company reduces the price on any products sold to the customer, the Company will guarantee an account credit for the price difference for all quantities of that product that the customer still holds. Price protection is variable and under Topic 606, are estimated and recognized as a reduction of revenue as performance obligations are satisfied (e.g. upon shipment of goods). The estimates are due to price protection are historically not material.\nVolume Rebates and Promotion Programs. Many of our retailer customers require sales and marketing support funding, usually set as a percentage of our sales in their stores. Volume rebates are variable dependent upon the volume of goods sold-through the Company’s customers to end users variable and under Topic 606, are estimated and recognized as a reduction of revenue as performance obligations are satisfied (e.g. upon shipment of goods). The estimates due to rebates and promotions are historically not material.\nWarranties. The Company does not offer customers to purchase a warranty separately. Therefore, there is not a separate performance obligation. The Company does account for warranties as a cost accrual and the warranties do not include any additional distinct services other than the assurance that the goods comply with agreed-upon specifications. The estimates due to warranties are historically not material.\nInventory Valuation and Cost of Goods Sold. Inventory is valued at the lower of cost, determined by the first-in, first-out method, or its net realizable value. We review inventories for obsolete and slow-moving products each quarter and make provisions based on our estimate of the probability that the material will not be consumed or that it will be sold below cost. Additionally, material product certification costs on new products are capitalized and amortized over the expected period of value of the respective products.\nValuation and Impairment of Deferred Tax Assets. As part of the process of preparing our financial statements we estimate our income tax expense and deferred income tax position. This process involves the estimation of our actual current tax exposure together with assessing temporary differences resulting from differing treatment of items for tax and accounting purposes. These differences result in deferred tax assets and liabilities, which are included in our balance sheet. We then assess the likelihood that our deferred tax assets will be recovered from future taxable income. To the extent we believe that recovery is not likely, we establish a valuation allowance. Changes in the valuation allowance are reflected in the statement of operations.\nSignificant management judgment is required in determining our provision for income taxes and any valuation allowances. We have recorded a 100% valuation allowance against our deferred income tax assets. It is management's estimate that, after considering all available objective evidence, historical and prospective, with greater weight given to historical evidence, it is more likely than not that these assets will not be realized. If we establish a record of continuing profitability, at some point we will be required to reduce the valuation allowance and recognize an equal income tax benefit which will increase net income in that period(s).\nIn December 2017, the U.S. government enacted comprehensive tax legislation commonly referred to as the Tax Cuts and Jobs Act (the “Tax Act”) that significantly revised the U.S. tax code effective January 1, 2018 by, among other things, lowering the corporate income tax rate from a top marginal rate of 35% to a flat 21%.\nAs of December 31, 2020, the Company had federal net operating loss carry forwards of approximately $61,779,000 which are available to offset future taxable income. They are due to expire in varying amounts from 2021 to 2039. Federal net operating losses occurring after December 31, 2017, of approximately $13,617,000 may be carried forward indefinitely. As of December 31, 2020, the Company had state net operating loss carry forwards of approximately $19,151,000 which are available to offset future taxable income. They are due to expire in varying amounts from 2032 through 2039. The Company’s merger with Minim in 2020 triggered a change of ownership that may limit the use of our net operating losses. The Company is in the process of determining the impact of any such limitation. A valuation allowance has been established for the full amount of deferred income tax assets as management has concluded that it is more-likely than-not that the benefits from such assets will not be realized.\nSales Tax. The Company recorded a sales tax accrual in 2017 after the Company became aware that a state sales tax liability was both probable and estimable as of December 31, 2017. The state sales tax liability stems from the Company’s ‘Fulfilled By Amazon’ sales agreement which allows Amazon to warehouse the Company’s inventory throughout a number of states. As a result, the Company recorded an expense of approximately $831 thousand during the year ended December 31, 2017. During the year 2018, the Company settled its obligations with most of the states and re-assessed its liability on the last couple of states which resulted in a reduction of approximately $203 thousand in the sales tax liability. As of December 31, 2020, approximately $86 thousand of the original state sales tax liability remains and $133 thousand relates to sales tax that has been collected and not yet remitted to the respective states. As of December 31, 2019, approximately $51 thousand of the original state sales tax liability remains and $98 thousand relates to sales tax that has been collected and not yet remitted to the respective states. As of December 31, 2020, approximately $50 thousand of the original state sales tax liability remains and $46 thousand relates to sales tax that has been collected and not yet remitted to the respective states.\nResults of Operations\nZoom’s net sales of $48.0 million for the fiscal year ended December 31, 2020 (“FY 2020”) were up 27.6% from $37.6 million for the fiscal year ended December 31, 2019 (“FY 2019”). Zoom reported a net loss of $3.9 million or $0.15 per share for FY 2020 compared to a net loss of $3.3 million or $0.18 per share for FY 2019. Gross profit was $13.6 million for FY 2020, up $2.7 million from $10.9 million for FY 2019. Gross margin decreased to 28.4% in FY 2020 from 29.0% in FY 2019.\nThe following table sets forth certain financial data as a percentage of net sales for the periods indicated.\nYears Ended\nDecember 31,\nNet sales\n100.0%\n100.0%\nCost of goods sold\n71.6\n71.0\nGross profit\n28.4\n29.0\nOperating expense:\nSelling and marketing\n19.1\n24.5\nGeneral and administration\n11.3\n7.1\nResearch and development\n8.0\n5.9\nTotal operating expenses\n38.4\n37.6\nOperating loss\n(10.0)\n(8.6)\nTotal other income (expense)\n2.1\n(0.1)\nLoss before income taxes\n(8.0)\n(8.6)\nIncome taxes\n0.1\n0.1\nNet loss\n(8.0)%\n(8.7)%\nYear Ended December 31, 2020 Compared to Year Ended December 31,\nThe following is a discussion of the major categories of our consolidated statement of operations, comparing the consolidated financial results for the year ended December 31, 2020 with the year ended December 31, 2019.\nNet Sales. Our total net sales increased year-over-year by $10.4 million or 27.6%. The growth in net sales is directly attributable to increased sales of Motorola branded cable modems and gateways. In both 2020 and 2019, we primarily generated our sales by selling cable modems and gateways. The decrease in other category of $0.3 million over 2019 is primarily due to a reduction in DSL products and a refocus on new products with growth potential outside North America as well as within new product introductions.\nFY\nFY\nChange $\nChange %\nCable Modems & Gateways\n$44,473,601\n$33,810,410\n$10,663,191\n31.5%\nOther\n3,514,948\n3,804,046\n(289,098)\n(7.6%)\nTotal\n$47,988,549\n$37,614,456\n$10,374,093\n27.6%\nAs shown in the table below, our net sales in North America increased $10.4 million to $47.1 million in FY 2020 from $36.7 million in FY 2019. Net sales outside North America remained relatively flat from 2019 at $871.9 thousand for FY 2020. Generally, Zoom’s lower sales outside North America reflect the fact that cable modems are sold successfully through retailers in the United States but not in most countries outside the United States, due primarily to variations in government regulations.\nFY\nFY\nChange $\nChange %\nNorth America\n$47,116,632\n$36,741,262\n$10,375,370\n28.2%\nOutside North America\n871,917\n873,194\n(1,277)\n(0.2%)\nTotal\n$47,988,549\n$37,614,456\n$10,374,093\n27.6%\nRelatively few companies account for a substantial portion of the Company’s revenues. In 2020, two companies accounted for 10% or greater individually, and 76% in the aggregate of the Company’s total net sales. At December 31, 2020, three companies with an accounts receivable balance of 10% or greater individually accounted for a combined 85% of the Company’s accounts receivable. In 2019, two companies accounted for 10% or greater individually, and 84% in the aggregate of the Company’s total net sales. At December 31, 2019, three companies with an accounts receivable balance of 10% or greater individually accounted for a combined 84% of the Company’s accounts receivable.\nOur customers generally do not enter into long-term agreements obligating them to purchase our products. Because of our significant customer concentration, our net sales and operating income could fluctuate significantly due to changes in political or economic conditions or the loss of, reduction of business with, or less favorable terms for any of our significant customers. A reduction or delay in orders from any of our significant customers, or a delay or default in payment by any significant customer could materially harm our business, results of operation and liquidity.\nGross Profit. Gross profit was $13.6 million for FY 2020, up $2.7 million from $10.9 million for FY 2019. Gross margin decreased to 28.4% in FY 2020 from 29.0% in FY 2019. The increase in gross profit was attributable to sales growth of Motorola branded cable modems and gateways. The decrease in profit margin was primarily due to tariff costs and air freight costs of $2.8 million and $1.5 million, respectively, in 2020 compared to $3.2 million and $0, respectively, in 2019.\nOperating Expense. Total operating expense increased by $4.3 million from $14.1 million in FY 2020 to $18.4 million in FY 2019. Total operating expense as a percentage of net sales increased from 37.6% in 2019 to 38.4% in 2020. The table below illustrates the change in operating expense.\nOperating Expense\nYear 2020\n% Net\nSales\nYear 2019\n% Net\nSales\nChange $\nChange %\nSelling and marketing expense\n$9,154,685\n19.1%\n$9,222,737\n24.5%\n$(68,052)\n(0.7)%\nGeneral and administrative expense\n5,443,529\n11.3%\n2,666,876\n7.1%\n2,776,653\n104.1%\nResearch and development expense\n3,828,223\n8.0%\n2,237,416\n5.9%\n1,590,807\n71.1%\nTotal operating expense\n$18,426,437\n38.4%\n$14,127,029\n37.6%\n$4,299,408\n30.4%\nSelling and Marketing Expense. Selling and marketing expense decreased $68 thousand to $9.1 million in FY 2020 from $9.2 million in FY 2019. Selling and marketing expense as a percentage of net sales was 19.1% in FY 2020 and 24.5% in FY 2019. The decrease of $68 thousand was primarily due to reduction in advertising expenses of $1.0 million, partially offset by increased Motorola trademark royalty costs of $600 thousand, and salary and related costs of $290 thousand.\nGeneral and Administrative Expense. General and administrative expense increased to $5.4 million in FY 2020 from $2.7 million in FY 2019. General and administrative expense as a percentage of net sales was 11.3% in FY 2020 and 7.1% in FY 2019. General and administrative expenses increased approximately $2.8 million primarily due to $1.6 million in one-time transactions costs of legal and professional services related to the merger with Minim, $0.6 million related to one-time legal and professional services expenses related to evaluation of agreements consummated for the purchase of company stock, and $0.8 million of salary and related costs. These costs were offset by reductions in bad debt provision of $0.4 million.\nResearch and Development Expense. Research and development expense increased to $3.8 million in FY 2020 from $2.2 million in FY 2019. Research and development expense as a percentage of net sales increased to 8.0% in FY 2020 from 5.9% in FY 2019. The increase of approximately $1.6 million was primarily due to salary and related costs of $1.0 million and increased product testing, certification and software development costs of $0.4 million.\nOther Income (Expense). Other income (expense), net was $1.0 million in FY 2020 and $(30) thousand in FY 2019, primarily due to $1.1 million forgiveness on loans received under the Paycheck Protection Plan of the Coronavirus Aid, Relief and Economic Security Act (the “CARES Act”). Refer to Note 17 of the Consolidated Financial Statements.\nIncome Tax Expense (Benefit). We recorded minimum state income tax for a few states and tax related to our operations in Mexico, which was $27 thousand and $25 thousand in FY 2020 and FY 2019, respectively.\nUnaudited Pro Forma Information\nThe following unaudited pro forma financial information summarizes the combined results of operations for the Company and Minim, Inc. as if the merger of Minim, Inc. had been completed on January 1, 2019. The pro forma results have been prepared for comparative purposes only, and do not necessarily represent what the net sales or results of operations would have been had the merger been completed on January 1, 2019. In addition, these results are not intended to be a projection of future operating results. The unaudited pro forma information includes adjustments to eliminate intercompany transactions and align accounting policies. The pro forma results for the year ended December 31, 2020 also includes the non-recurring transaction costs totaling $1.6 million.\nYear Ended\nDecember 31,\nPro forma net sales\n$48,426,339\n$37,866,087\nPro forma net loss\n$(6,582,873)\n$(8,180,298)\nPro forma net loss per share, basic and diluted\n$(0.20)\n$(0.28)\nLiquidity and Capital Resources\nThe Company’s cash and cash equivalents balance on December 31, 2020 was $771.7 thousand compared to $1.2 million on December 31, 2019. On December 31, 2020, the Company had $2.4 million bank debt outstanding on an available asset-based credit line of $4.0 million, and working capital of $5.9 million. We have funded our operations and investing activities primarily through cash generated from operations, borrowings on our line of credit, and sales of our common stock.\nOn April 13, 2020, the Company amended its Financing Agreement with Rosenthal & Rosenthal, Inc. The amendment increased the size of the revolving credit line from $3.0 million to $4.0 million effective the date of the amendment. On February 4, 2021, the Company amended the Financing Agreement to increase the revolving credit line from $4.0 million to $5.0 million effective the date of the amendment. The Company is required to calculate its covenant compliance on a quarterly basis under the Financing Agreement. As of December 31, 2020, the Company was in compliance with both the minimum working capital covenant of $1.75 million and minimum tangible net worth covenant of $2.0 million. At December 31, 2020, the Company’s tangible net worth, as calculated pursuant to the Financing Agreement, was approximately $6.3 million, while the Company’s working capital, as calculated pursuant to the Financing Agreement, was approximately $5.9 million. Loan availability is based on certain eligible receivables. Loan availability was approximately $1.6 million as of December 31, 2020.\nOn April 15 2020, the Company received approval for a SBA Paycheck Protection Plan Loan with Primary Bank under the CARES Act. The loan in the amount of $583.3 thousand was used for qualifying expenses as defined in the CARES Act. The loan and related interest was subsequently partially forgiven in November 2020.\nOn May 26, 2020, the Company closed on a $3.4 million private placement and issued an aggregate of 2,237,103 shares at a purchase price of $1.52 per share, and in connection with the closing of the offering two designees of an investor in the private placement joined Zoom’s Board of Directors.\nOn March 12, 2021, the Company terminated its Financing Agreement with Rosenthal & Rosenthal, Inc. and entered into a new loan and security agreement with Silicon Valley Bank (“SVB Loan Agreement”). The SVB Loan Agreement provides for a revolving facility up to a principal amount of $12.0 million. The SVB Loan Agreement matures, and all outstanding amounts become due and payable, on March 12, 2023. The SVB Loan Agreement is secured by substantially all of the Company’s assets but excludes the Company’s intellectual property. The availability of borrowings under the SVB Loan Agreement is subject to certain conditions and requirements.\nBased on the Company’s present business plan, funding available under the SVB Loan Agreement and additional financing that the Company believes is obtainable under acceptable terms if needed, the Company expects to maintain acceptable levels of liquidity to meet its obligations as they become due during the next 12months.\nOff-Balance Sheet Arrangements\nIn 2006, the Company entered into a maquiladora agreement with North American Production Sharing, Inc. (“NAPS”). This agreement provides that NAPS provide certain personnel and other services for a production facility in Mexico on our behalf. Although the maquiladora agreement expired on September 25, 2019, the agreement automatically renews annually unless otherwise cancelled per provisions in the agreement. Any related assets, liabilities, or expenses are reported in the accompanying financial statements. Additionally, the Company is obligated to pay future minimum required royalty payments associated with certain licensing agreements which are not included in our consolidated balance sheet.",
    "item_7A": "ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot required.",
    "item_8": "ITEM 8 - CONSOLIDATED FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nZOOM TELEPHONICS, INC.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS AND SCHEDULES\nPage\nIndex to Consolidated Financial Statements and Schedules\nReport of Independent Registered Public Accounting Firm (Marcum LLP)\nConsolidated Balance Sheets as of December 31, 2020 and\nConsolidated Statements of Operations for the years ended December 31, 2020 and 2019\nConsolidated Statements of Stockholders' Equity for the years ended December 31, 2020 and 2019\nConsolidated Statements of Cash Flows for the years ended December 31, 2020 and 2019\nNotes to Consolidated Financial Statements\n-",
    "item_9": "ITEM 9 - CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone",
    "item_9A": "ITEM 9A - CONTROLS AND PROCEDURES\nManagement’s Report on Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures that are designed to ensure that information required to be disclosed in our Securities Exchange Act of 1934 reports is recorded, processed, summarized and reported within the time periods specified in the SEC's rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and our Acting Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure. In designing and evaluating the disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, as ours are designed to do, and management necessarily was required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures.\nAs of December 31, 2020, we carried out an evaluation, under the supervision and with the participation of our management including our Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934. Based upon that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that due to the existence of a material weakness in our internal control over financial reporting, described below, our disclosure controls and procedures were not effective as of the end of the period covered by this report in enabling us to record, process, summarize and report information required to be included in our periodic SEC filings within the required time period.\nManagement’s Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Judgments by management are also required in evaluating the expected benefits and related costs of control procedures. The objectives of internal control include providing management with reasonable, but not absolute, assurance that assets are safeguarded against loss from unauthorized use or disposition, and that transactions are executed in accordance with management’s authorization and recorded properly to permit the preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States. Our management assessed the effectiveness of our internal control over financial reporting as of December 31, 2020. In making this assessment, our management used the criteria set forth in 2013 by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”) in Internal Control-Integrated Framework. Our management has concluded that as of December 31, 2020, our internal control over financial reporting was not effective in providing reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with US generally accepted accounting principles due to the existence of a material weakness. Our management reviewed the results of their assessment with our Board of Directors.\nA material weakness is a deficiency, or combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of our annual or interim financial statements will not be prevented or detected on a timely basis. We identified a material weakness with tracking and timely recording of in-transit inventory where title had been transferred to the Company. This material weakness could result in the Company under reporting its inventory and current liabilities. The Company's logistics firm had not provided title transfer dates to the Company for in-transit inventory. The material weakness only impacted the consolidated balance sheet, other than stockholders’ equity, as of December 31, 2020, resulting in equal increases in the Company's inventory and current liabilities, and did not impact the consolidated statements of operations.\nTo remediate the material weakness described above, the Company instituted a process, which includes requiring the Company's logistics firm to provide title transfer dates to the Company for in-transit inventory. The Company will timely record inventory and related liabilities based on the title transfer date, and a member of the finance department will review the Company records for completeness and accuracy. The material weakness will not be considered remediated until the applicable remedial controls operate for a sufficient period of time and management has concluded, through testing, that these controls are operating effectively. We expect that the remediation of this material weakness will be completed before the end of 2021.\nThis annual report does not include an attestation report of the Company’s registered public accounting firm regarding internal control over financial reporting. Management’s report was not subject to attestation by the Company’s registered public accounting firm pursuant to a permanent exemption from the internal control audit requirements of Section 404(b) of the Sarbanes-Oxley Act of 2002.\nInherent limitations on effectiveness of controls\nInternal control over financial reporting has inherent limitations which include but are not limited to the use of independent professionals for advice and guidance, interpretation of existing and changing rules and principles, segregation of management duties, scale of organization, and personnel factors. Internal control over financial reporting is a process that involves human diligence and compliance and is subject to lapses in judgment and breakdowns resulting from human failures. Internal control over financial reporting also can be circumvented by collusion or improper management override. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements on a timely basis, however these inherent limitations are known features of the financial reporting process and it is possible to design into the process safeguards to reduce, though not eliminate, this risk. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nChanges in Internal Control over Financial Reporting\nThe Company reported a material weakness in its internal control over financial reporting as set forth in the Company’s Quarterly Report on Form 10-Q/A for the nine-months ended September 30, 2020, filed with the Securities and Exchange Commission on November 16, 2020. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the Company’s annual or interim financial statements will not be prevented or detected on a timely basis.\nThe material weakness related to insufficient documentation and processes for confirming final approvals for the release of reviewed and approved financial statements prior to filing documents with the Securities and Exchange Commission (the “SEC”). The SEC requires a registrant to engage an independent accountant to review the registrant’s interim financial information before the registrant files its quarterly report on Form 10-Q. Prior to final sign-off by the independent accountant, the Company filed the September 30, 2020 Form 10-Q. As a result, the Company determined there was a material weakness that should be disclosed. The material weakness did not result in any financial statement modifications and there were no changes to the Company’s previously disclosed financial results pertaining to nine-months ended September 30, 2020.\nUpon identifying the individual control deficiencies, the Company’s management has taken actions to remediate the deficiencies that in combination resulted in the material weakness and to improve the design and effectiveness of the Company’s financial reporting. The remediation activities include expanding the management and governance over financial reporting controls and implementing enhanced process controls on financial statement approvals.\nOther than the above, there have been no significant changes in our internal controls over financial reporting that occurred during the fiscal year ended December 31, 2020 that have materially or are reasonably likely to materially affect, our internal control over financial reporting.\nPART III",
    "item_9B": "",
    "item_10": "ITEM 10 - DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nInformation required by this item appears under the caption \"Our Executive Officers\" in Part 1, Item 1 -- Business, and under the captions \"Election of Directors\", \"Board of Directors”, \"Code of Ethics\" and \"Section 16(a) Beneficial Ownership Compliance \" in our definitive proxy statement for our 2021 annual meeting of stockholders which will be filed with the SEC within 120 days after the close of our fiscal year, and is incorporated herein by reference.",
    "item_11": "ITEM 11 - EXECUTIVE COMPENSATION\nInformation required by this item appears under the captions \"Executive Compensation,\" and \"Directors' Compensation\", in our definitive proxy statement for our 2021 annual meeting of stockholders that will be filed with the SEC within 120 days after the close of our fiscal year and is incorporated herein by reference.",
    "item_12": "ITEM 12 - SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nWe maintain a number of equity compensation plans for employees, officers, directors and others whose efforts contribute to our success. The table below sets forth certain information as of our fiscal year ended December 31, 2020 regarding the shares of our common stock available for grant or granted under stock option plans that were approved by our stockholders.\nEquity Compensation Plan Information.\nPlan Category\nNumber Of Securities\nTo Be Issued Upon Exercise Of\nOutstanding Options\nWeighted-Average Exercise Price Of Outstanding Options\nNumber Of Securities\nRemaining Available For\nFuture Issuance Under Equity\nCompensation Plans (excluding securities reflected in column (a))\n(a)\n(b)\n(c)\nEquity compensation plans approved by security holders(1) (2) (3)\n3,098,165\n$1.17\n2,122,089\nTotal:\n3,098,165\n$1.17\n2,122,089\n(1)\nIncludes the 2009 Stock Option Plan and the 2009 Directors Stock Option Plan. These plans were approved by the stockholders at the 2010 annual meeting. At the 2013 annual meeting, shareholders approved an increase to the total number of shares available for issuance for the 2009 Stock Option Plan. The new number of shares is 5,500,000. At the 2013 annual meeting, stockholders approved an increase to the total number of shares available for issuance for the 2009 Directors Stock Option Plan. The new number of shares is 700,000. The purposes of the 2009 Stock Option Plan are to attract and retain employees and provide an incentive for them to assist us in achieving our long-range performance goals, and to enable such employees to participate in our long-term growth. The purpose of the 2009 Directors Stock Option Plan is to attract and retain non-employee directors and to enable such directors to participate in our long-term growth. The 2009 Stock Option Plan and the 2009 Directors Stock Option Plan are administered by the Compensation Committee of the Board of Directors. All stock options granted under the 2009 Stock Option Plan and the 2009 Directors Stock Option Plan have been granted with an exercise price equal to at least the fair market value of the common stock on the date of grant.\n(2)\nIncludes the 2019 Stock Option Plan with a total number of shares available for issuance of 4,000,000 and the 2019 Directors Stock Option Plan with a total number of shares available for issuance of 1,000,000. These plans were approved by the stockholders at the 2019 annual meeting. The purpose of the 2019 Stock Option Plan is to attract and retain employees and provide an incentive for them to assist us in achieving our long-range performance goals, and to enable such employees to participate in our long-term growth. The purpose of the 2019 Directors Stock Option Plan is to attract and retain non-employee directors and to enable such directors to participate in our long-term growth. The 2019 Stock Option Plan and the 2019 Directors Stock Option Plan are administered by the Compensation Committee of the Board of Directors. All stock options granted under the 2019 Stock Option Plan and the 2019 Directors Stock Option Plan have been granted with an exercise price equal to at least the fair market value of the common stock on the date of grant.\n(3)\nIncluded in the 2019 Stock Option Plan and the 2019 Director Stock Option Plan are 1,657,909 options issued to Minim option holders as part of Agreement and Plan of Merger with Minim, Inc.\nThe additional information required by this Item 12 of Form 10-K is hereby incorporated by reference to the information in our Definitive Proxy Statement for our 2021 annual meeting of Stockholders to be filed with the SEC within 120 days after the close of our fiscal year and is incorporated herein by reference.",
    "item_13": "ITEM 13 - CERTAIN RELATIONSHIPS, RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nAny information required by this item may appear under the caption \"Certain Relationships and Related Transactions\" and “Board of Directors” in our Definitive Proxy Statement for our 2021 annual meeting of Stockholders to be filed with the SEC within 120 days after the close of our fiscal year and is incorporated herein by reference.",
    "item_14": "ITEM 14 - PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe firm of Marcum LLP served as our independent registered public accounting firm for fiscal years 2020 and 2019. The table below shows the aggregate fees that the Company paid or accrued for the audit and other services provided by Marcum LLP for the fiscal years ended December 31, 2020 and December 31, 2019:\nFEE CATEGORY\nAudit fees (1)\n$267,995\n$187,200\nAudit-related fees (2)\n22,800\n10,000\nTotal fees\n$290,795\n$197,200\n-------\n(1)\nAudit Fees. Consists of fees billed for professional services rendered for the audit of Zoom’s consolidated financial statements and review of the interim consolidated financial statements included in quarterly reports and services that are normally provided in connection with statutory filings and engagements.\n(2)\nAudit-Related Fees. Consists of fees billed for assurance and related services that are reasonably related to the performance of the audit or review of Zoom’s consolidated financial statements and are not reported under \"Audit Fees.\" For 2020, fees are related to registering securities for Zoom's stock option plans and a private placement. For 2019, fees are related to a private placement.\nAll services rendered by Marcum LLP for fiscal years 2020 and 2019 were permissible under applicable laws and regulations and were pre-approved by the Audit Committee.\nPART IV",
    "item_15": "ITEM 15 - EXHIBITS AND CONSOLIDATED FINANCIAL STATEMENT SCHEDULES *\n(a)\nConsolidated Financial Statements, Schedules and Exhibits:\n(1),(2)\nThe consolidated financial statements and required schedules are indexed on page.\n(3)\nExhibits required by the Exhibit Table of Item 601 of SEC Regulation S-K. (Exhibit numbers refer to numbers in the Exhibit Table of Item 601.)\n2.1\nSeparation and Distribution Agreement by and between Zoom Technologies, Inc. and Zoom Telephonics, Inc. (incorporated by reference to annex B of the preliminary proxy statement filed by Zoom Technologies, Inc. on May 13, 2009).*1\n2.2\nAgreement and Plan of Merger, dated as of November 12, 2020, by and among Zoom Telephonics, Inc., Elm Acquisition Sub, Inc., Minim Inc. and the Representative (incorporated by the reference to Exhibit 10.1 to the Form 8-K filed by the Company on November 13, 2020)*\n3.1\nForm of Amended and Restated Certificate of Incorporation of Zoom Telephonics, Inc. (incorporated by reference to Exhibit 3.1 to Zoom Telephonics, Inc. Registration Statement on Form 10, filed on September 4, 2009). *\n3.2\nCertificate of Amendment to Amended and Restated Certificate of Incorporation of Zoom Telephonics, Inc. (incorporated by the reference to Exhibit 3.1 to the Form 8-K filed by the Company on November 18, 2015)*\n3.3\nCertificate of Amendment to Amended and Restated Certificate of Incorporation of Zoom Telephonics, Inc. (incorporated by the reference to Exhibit 3.1 to the Form 8-K filed by the Company on July 30, 2019)*\n3.4\nCertificate of Designation of Series A Junior Participating Preferred Stock (incorporated by reference to Exhibit 3.2 to the Form 8-K filed by the Company on November 18, 2015)*\n3.5\nAmended and Restated By-Laws of Zoom Telephonics, Inc. (incorporated by reference to Exhibit 3.1 to Zoom Telephonics, Inc. Current Report on Form 8-K filed by the Company on May 13, 2020).*\n4.1\nDescription of Securities (incorporated by reference to Exhibit 4.1 to the Form 10-K filed by the Company on April 14, 2020)*\n10.1**\nZoom Telephonics, Inc. 2009 Stock Option Plan (incorporated by reference to Appendix B to the Definitive Proxy Statement filed by the Company on April 30, 2013)*\n10.2**\nZoom Telephonics, Inc. 2009 Directors Stock Option Plan (incorporated by reference to Appendix C to the Definitive Proxy Statement filed by the Company on April 30, 2013)*\n10.3**\nZoom Telephonics, Inc. 2019 Stock Option Plan (incorporated by reference to Appendix D to the Definitive Proxy Statement filed by the Company on May 28, 2019)*\n10.4**\nZoom Telephonics, Inc. 2019 Directors Stock Option Plan (incorporated by reference to Appendix C to the Definitive Proxy Statement filed by the Company on May 28, 2019)*\n10.5\nFinancing Agreement, dated December 18, 2012, between Zoom Telephonics, Inc. and Rosenthal & Rosenthal, Inc. (incorporated by reference to Exhibit 10.1 to the Form 8-K filed by the Company on December 21, 2012)*\n10.6\nIntellectual Property Security Agreement, dated December 18, 2012, between Zoom Telephonics, Inc. and Rosenthal & Rosenthal, Inc. (incorporated by reference to Exhibit 10.2 to the Form 8-K filed by the Company on December 21, 2012)*\n10.7\nAmendment dated March 25, 2014, effective January 1, 2013 to Financing Agreement, dated December 18, 2012, between Zoom Telephonics, Inc. and Rosehthal & Rosenthal, Inc. (incorporated by reference to Exhibit 10.1 to the Form 8-K filed by the Company on November 3, 2015)*\n10.8\nAmendment dated October 29, 2015, effective January 1, 2013, to Financing Agreement, dated December 18, 2012, between Zoom Telephonics, Inc. and Rosenthal & Rosenthal, Inc. (incorporated by reference to Exhibit 10.1 to the Form 8-K filed by the Company on November 3, 2015)*\n10.9\nAmendment dated July 19, 2016 to Financing Agreement, dated December 18, 2012, between Zoom Telephonics, Inc. and Rosenthal & Rosenthal, Inc. (incorporated by reference to Exhibit 10.1 to the Form 8-K filed by the Company on July 25, 2016)*\n10.10\nAmendment dated September 1, 2016 to Financing Agreement, dated December 18, 2012, between Zoom Telephonics, Inc. and Rosenthal & Rosenthal, Inc. (incorporated by reference to Exhibit 10.1 to the Form 8-K filed by the Company on September 8, 2016)*\n10.11\nAmendment dated November 2, 2018 to Financing Agreement, dated December 18, 2012, between Zoom Telephonics, Inc. and Rosenthal & Rosenthal, Inc. (incorporated by reference to Exhibit 10.19 to the Registration Statement on Form S-1 filed by the Company on June 7, 2019)\n10.12\nAmendment dated April 13, 2020 to Financing Agreement, dated December 18, 2012, between Zoom Telephonics, Inc. and Rosenthal & Rosenthal, Inc. (incorporated by reference to Exhibit 10.2 to the Form 10-Q filed by the Company on May 15, 2020)*\n10.13\nAmendment dated February 4, 2021 to Financing Agreement, dated December 18, 2012, between Zoom Telephonics, Inc. and Rosenthal & Rosenthal, Inc. (incorporated by reference to Exhibit 10.1 to the Form 8-K filed by the Company on February 8, 2021)*\n10.14†\nLicense Agreement, dated May 13, 2015, between Zoom Telephonics, Inc. and Motorola Mobility LLC (incorporated by reference to Exhibit 10.3 to the Form 10-Q/A filed by the Company on December 6, 2016)*\n10.15†\nAmendment to License Agreement, dated August 16, 2016, between Zoom Telephonics, Inc. and Motorola Mobility LLC (incorporated by reference to Exhibit 10.4 to the Form 10-Q/A filed by the Company on December 6, 2016)*\n10.16†\nAmendment to License Agreement, dated August 21, 2017, between Zoom Telephonics, Inc. and Motorola Mobility LLC (incorporated by reference to Exhibit 10.1 to the Form 10-Q filed by the Company on November 9, 2017)*\n10.17**\nEmployment Agreement between Zoom Telephonics, Inc. and Joseph Wytanis (incorporated by reference to Exhibit 10.1 to the Form 8-K filed by the Company on October 18, 2018)*\n10.18**\nSeparation Agreement, dated as of May 15, 2020, by and between Zoom Telephonics, Inc. and Joseph L. Wytanis (incorporated by reference to Exhibit 10.1 to the Form 8-K filed by the Company on May 21, 2020)*\n10.19\nStock Purchase Agreement, dated as of May 3, 2019, between Zoom Telephonics, Inc. and the Investors listed therein (incorporated by reference to Exhibit 10.1 to the Form 8-K filed by the Company on May 6, 2019)*\n10.20\nStock Purchase Agreement, dated as of May 26, 2020, between Zoom Telephonics, Inc. and the Investors listed therein (incorporated by reference to Exhibit 10.1 to the Form 8-K filed by the Company on May 27, 2020)*\n10.21**\nEmployment Agreement between Zoom Telephonics, Inc. and Jacquelyn Barry Hamilton (incorporated by reference to Exhibit 10.1 to the Form 8-K filed by the Company on March 9, 2020)*\n10.22\nTransition and Separation Agreement, dated as of December 31, 2020, by and between Zoom Telephonics, Inc. and Jacquelyn Barry Hamilton (incorporated by reference to Exhibit 10.1 to the Form 8-K filed by the Company on December 31, 2020)*\n10.23†††\nLicense Agreement, dated March 27, 2020, between Zoom Telephonics, Inc., MTRLC LLC and Motorola Mobility LLC (incorporated by reference to Exhibit 10.19 to the Form 10-K/A filed by the Company on April 29, 2020)*\n10.24†††\nAmendment to License Agreement, dated March 27, 2020, between Zoom Telephonics, Inc. and Motorola Mobility LLC (incorporated by reference to Exhibit 10.19 to the Form 10-K/A filed by the Company on April 29, 2020)*\n10.25\nStandstill and Voting Agreement, dated as of October 9, 2020, by and among Zoom Telephonics, Inc., Zulu Holdings LLC and Jeremy P. Hitchcock (incorporated by reference to Exhibit 99.1 to the Form 8-K filed by the Company on October 13, 2020)*\n10.26\nLoan and Security Agreement, dated March 12, 2021, by and among Silicon Valley Bank, Zoom Telephonics, Inc. and Minim Inc. (incorporated by reference to Exhibit 10.1 to the Form 8-K filed by the Company on March 15, 2021)*\n21.1***\nSubsidiaries\n23.1***\nIndependent Registered Public Accounting Firm’s Consent\n31.1***\nCEO and CFO Certification, Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1††\nCEO and CFO Certification, Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS***\nXBRL Instance Document\n101.SCH***\nXBRL Taxonomy Extension Schema Document\n101.CAL***\nXBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF***\nXBRL Taxonomy Extension Definition Linkbase Document\n101.LAB***\nXBRL Taxonomy Extension Label Linkbase Document\n101.PRE***\nXBRL Taxonomy Extension Presentation Linkbase Document\n*\nIn accordance with Rule 12b-32 under the Securities Exchange Act of 1934, as amended, reference is made to the documents previously filed with the Securities and Exchange Commission, which documents are hereby incorporated by reference.\n**\nCompensation Plan or Arrangement.\n***\nFiled herewith.\n†\nConfidential portions of this exhibit have been redacted and filed separately with the SEC pursuant to a confidential treatment request in accordance with Rule 24b-2 of the Securities Exchange Act of 1934, as amended.\n††\nThis certification shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, or otherwise subject to the liability of that section, nor shall it be deemed to be incorporated by reference into any filing under the Securities Act of 1933 or the Securities Exchange Act of 1934.\n†††\nCertain confidential portions of this exhibit were omitted because the identified confidential portions (i) are not material and (ii) would be competitively harmful if publicly disclosed.\n(b)\nExhibits - See Item 15 (a) (3) above for a list of Exhibits incorporated herein by reference or filed with this Report.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nZOOM TELEPHONICS, INC.\n(Registrant)\nDate: April 13, 2021\nBy:\n/s/ GRAHAM CHYNOWETH\nGraham Chynoweth,\nChief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Graham Chynoweth\nChief Executive Officer\nApril 13, 2021\nGraham Chynoweth\n(principal executive officer)\n/s/ Sean Doherty\nChief Financial Officer\nSean Doherty\n(principal financial and accounting officer)\nApril 13, 2021\n/s/ Jeremy Hitchcock\nExecutive Chairman of the Board\nApril 13, 2021\nJeremy Hitchcock\n/s/ David Aronoff\nDirector\nApril 13, 2021\nDavid Aronoff\n/s/ Dan Artusi\nDirector\nApril 13, 2021\nDan Artusi\n/s/ Philip Frank\nDirector\nApril 13,\nPhilip Frank\n/s/ Elizabeth Hitchcock\nDirector\nApril 13,\nElizabeth Hitchcock\n/s/ Josh Horowitz\nDirector\nApril 13,\nJosh Horowitz\n/s/ Sandra Howe\nDirector\nApril 13,\nSandra Howe\nZOOM TELEPHONICS, INC.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS AND SCHEDULES\nPage\nReport of Independent Registered Public Accounting Firm (Marcum LLP)\nConsolidated Balance Sheets as of December 31, 2020 and\nConsolidated Statements of Operations for the years ended December 31, 2020 and 2019\nConsolidated Statements of Stockholders' Equity for the years ended December 31, 2020 and 2019\nConsolidated Statements of Cash Flows for the years ended December 31, 2020 and 2019\nNotes to Consolidated Financial Statements\n-\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and Board of Directors of\nZoom Telephonics, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Zoom Telephonics, Inc. (the “Company”) as of December 31, 2020 and 2019, the related consolidated statements of operations, stockholders’ equity and cash flows for each of the two years in the period ended December 31, 2020, and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2020 and 2019, and the results of its operations and its cash flows for each of the two years in the period ended December 31, 2020, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company's internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provides a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nEvaluation of the Merger Transaction between Zoom Telephonics, Inc. and Minim Inc.\nCritical Audit Matter Description\nAs discussed in Notes 1 and 3 to the consolidated financial statements, the Company entered into an Agreement and Plan of Merger (the “Merger Agreement”) with Minim Inc. (“Minim”) on November 12, 2020, which was consummated on December 4, 2020. Upon consummation of the transactions contemplated by the terms of the Merger Agreement, Minim became a wholly owned subsidiary of the Company. Immediately prior to closing of the Merger Agreement, the majority stockholder of the Company was also the majority stockholder of Minim. As a result of the common ownership upon closing of the transaction, the acquisition was considered a common-control transaction and was outside the scope of the business combination guidance in ASC 805-50. The entities are deemed to be under common control as of October 9, 2020, which was the date that the majority stockholder acquired control of the Company and, therefore, held control over both companies. The consolidated financial statements incorporate Minim’s financial results and financial information for the period from October 9, 2020 through December 31, 2020. Assets acquired and liabilities assumed are reported at their historical carrying amounts and any difference between the proceeds transferred is recognized in additional paid-in capital. These consolidated financial statements include the historical accounts of the Company since inception and the accounts of Minim since the date common control commenced on October 9, 2020.\nWe identified the accounting for the acquisition of Minim Inc. as a critical audit matter because of the significant audit effort necessary to evaluate the Company’s conclusions, including the Company’s assessment if the transaction qualified as a common control merger, of which entity represented the receiving entity, if the receiving entity was also the predecessor, if “push down” accounting was required and the resulting characterization and overall basis of presentation of the Company’s consolidated financial statements and disclosures.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the Company’s accounting for the Business Combination included, among others:\n●\nObtained and reviewed the Agreement and Plan of Merger documents to gain an understanding of the underlying terms of the transaction.\n●\nEvaluated the Company’s analysis of the merger and the accuracy of the information used in the analysis and the judgements made by management.\n●\nTested management’s assessment of common control, including calculating the share ownership in each entity by the controlling shareholder, as well as entities the shareholder controlled, to determine when control of the entities occurred.\n●\nWith the assistance of professionals in our firm having expertise in accounting for business combinations, we evaluated management’s conclusion regarding which entity was the receiving entity and predecessor and the resulting characterization and overall basis of presentation which reflects the merger as a common control merger.\n●\nReviewed and evaluated the financial statement presentation and disclosure regarding the merger with the accounting reached and the disclosure requirements for a common control merger.\n/s/ Marcum llp\nMarcum llp\nWe have served as the Company’s auditor since 2009; such date takes into account the acquisition of a portion of UHY LLP by Marcum LLP in April 2010.\nPortland, ME\nApril 13, 2021\nZOOM TELEPHONICS, INC.\nCONSOLIDATED BALANCE SHEETS\nAs of December 31, 2020 and 2019\nDecember 31,\nASSETS\nCurrent assets\nCash and cash equivalents\n$771,757\n$1,216,893\nRestricted cash\n800,000\n150,000\nAccounts receivable, net\n9,203,334\n4,070,576\nInventories\n16,504,840\n7,440,350\nDeposits on inventory purchases\n--\n1,830\nPrepaid expenses and other current assets\n399,119\n267,908\nTotal current assets\n27,679,050\n13,147,557\nEquipment, net\n455,066\n303,099\nOperating lease right-of-use assets, net\n86,948\n102,716\nGoodwill\n58,872\n--\nIntangible assets, net\n388,629\n--\nOther assets\n942,404\n349,335\nTotal assets\n$29,610,969\n$13,902,707\nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent liabilities\nAccounts payable\n$11,744,834\n$5,024,529\nCurrent maturities of long-term debt\n2,507,471\n--\nCurrent maturities of operating lease liabilities\n65,651\n102,716\nAccrued other expenses\n7,465,063\n2,666,471\nTotal current liabilities\n21,783,019\n7,793,716\nLong term debt, less current maturities\n15,245\n--\nOperating lease liabilities, less current maturities\n22,235\n--\nTotal liabilities\n21,820,499\n7,793,716\nCommitments and contingencies (Note 10)\nStockholders' equity\nCommon stock: Authorized: 40,000,000 shares at $0.01 par value\nIssued and outstanding: 35,074,922 shares and 20,929,928 shares at December 31, 2020 and 2019, respectively\n350,749\n209,299\nAdditional paid-in capital\n64,526,664\n46,496,330\nAccumulated deficit\n(57,086,943)\n(40,596,638)\nTotal stockholders' equity\n7,790,470\n6,108,991\nTotal liabilities and stockholders' equity\n$29,610,969\n$13,902,707\nThe accompanying notes are an integral part of these consolidated financial statements.\nZOOM TELEPHONICS, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYears Ended December 31, 2020 and 2019\nNet sales\n$47,988,549\n$37,614,456\nCost of goods sold\n34,382,314\n26,708,653\nGross profit\n13,606,235\n10,905,803\nOperating expenses:\nSelling and marketing\n9,154,685\n9,222,737\nGeneral and administrative\n5,443,529\n2,666,876\nResearch and development\n3,828,223\n2,237,416\nTotal operating expenses\n18,426,437\n14,127,029\nOperating loss\n(4,820,202)\n(3,221,226)\nOther:\nInterest income\n1,081\n13,975\nInterest expense\n(48,552)\n(48,404)\nOther income (expense)\n(21,356)\n4,720\nGain on forgiveness of debt (Note 17)\n1,057,330\n-\nTotal other income (expense), net\n988,503\n(29,709)\nLoss before income taxes\n(3,831,699)\n(3,250,935)\nIncome taxes\n26,716\n24,865\nNet loss\n$(3,858,415)\n$(3,275,800)\nBasic and diluted net loss per share\n$(0.15)\n$(0.18)\nWeighted average common and common equivalent shares:\nBasic and Diluted\n25,300,976\n18,051,070\nThe accompanying notes are an integral part of these consolidated financial statements.\nZOOM TELEPHONICS, INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS' EQUITY\nYears Ended December 31, 2020 and 2019\nCommon Stock\nShares\nAmount\nAdditional\nPaid In Capital\nAccumulated Deficit\nTotal\nBalance at January 1, 2019\n16,124,681\n$161,247\n$41,035,936\n$(37,320,838)\n$3,876,345\nNet loss\n--\n--\n--\n(3,275,800)\n(3,275,800)\nPrivate investment offering, net of expenses of $57,391\n4,545,455\n45,454\n4,897,156\n--\n4,942,610\nStock option exercises\n259,792\n2,598\n58,050\n--\n60,648\nStock based compensation\n--\n--\n505,188\n--\n505,188\nBalance at December 31, 2019\n20,929,928\n$209,299\n$46,496,330\n$(40,596,638)\n$6,108,991\nNet loss\n--\n--\n--\n(3,858,415)\n(3,858,415)\nPrivate investment offering, net of expenses of $237,030\n2,237,103\n22,371\n3,140,999\n--\n3,163,370\nShares issued in Minim Merger\n10,784,534\n107,845\n12,786,662\n(12,631,890)\n262,617\nRepayment of non-recourse promissory notes from Minim option holders (Note 3)\n--\n--\n320,290\n--\n320,290\nRepurchase of Minim common stock (Note 3)\n--\n--\n(14,860)\n--\n(14,860)\nStock option exercises\n1,123,357\n11,234\n1,160,387\n--\n1,171,621\nStock based compensation\n--\n--\n440,856\n--\n440,856\nProfit disgorgement\n--\n--\n196,000\n--\n196,000\nBalance at December 31, 2020\n35,074,922\n$350,749\n$64,526,664\n$(57,086,943)\n$7,790,470\nThe accompanying notes are an integral part of these consolidated financial statements.\nZOOM TELEPHONICS, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYears Ended December 31, 2020 and 2019\nOperating activities:\nNet loss\n$(3,858,415)\n$(3,275,800)\nAdjustments to reconcile net loss to net cash used in operating activities:\nStock based compensation\n440,856\n505,188\nDepreciation and amortization\n235,771\n315,456\nAmortization of right-of-use assets\n136,404\n292,849\nProvision for (recovery of) for accounts receivable allowances\n(102,631)\n264,808\nProvision for inventory reserves\n-\n18,988\nNon-cash loan forgiveness\n(1,057,330)\n--\nChanges in operating assets and liabilities:\nAccounts receivable\n(4,969,826)\n(1,574,778)\nInventories\n(8,871,803)\n468,340\nPrepaid expense and other current assets\n(129,381)\n648,847\nOther assets\n(142,017)\n--\nAccounts payable\n6,673,914\n655,220\nAccrued expenses\n4,686,050\n462,244\nOperating lease liabilities\n(135,466)\n(318,183)\nNet cash used in operating activities\n(7,093,874)\n(1,536,821)\nInvesting activities:\nCash acquired from merger (Note 3)\n501,845\n--\nPurchases of equipment\n(302,519)\n(174,254)\nCertification costs incurred and capitalized\n(460,577)\n(310,000)\nCapitalized software costs\n(316,838)\n--\nNet cash used in investing activities\n(578,089)\n(484,254)\nFinancing activities:\nNet proceeds from (payments to) bank credit lines\n2,442,246\n(1,741,272)\nProceeds from debt\n583,300\n--\nNet proceeds from private placement offering\n3,163,370\n4,942,610\nProceeds from stock option exercises\n1,171,621\n60,648\nProceeds from profit disgorgement\n196,000\n--\nProceeds from non-recourse promissory notes issued by Minim option holders (Note 3)\n320,290\n--\nNet cash provided by financing activities\n7,876,827\n3,261,986\nNet change in cash and cash equivalents\n204,864\n1,240,911\nCash, cash equivalents, and restricted cash- Beginning\n1,366,893\n125,982\nCash, cash equivalents, and restricted cash- Ending\n$1,571,757\n$1,366,893\nSupplemental disclosures of cash flow information:\nCash paid during the period for:\nInterest\n$48,473\n$48,404\nIncome taxes\n$26,716\n$31,769\nNon-cash financing activities:\nNet share settlement from non-recourse promissory notes issued by Minim option holders (Note 3)\n$230,332\n-\nRepurchase of Minim common stock (Note 3)\n$(14,860)\n-\nCash is reported on the consolidated statements of cash flows as follows:\nCash and cash equivalents\n$771,757\n$1,216,893\nRestricted cash\n800,000\n150,000\nTotal cash and cash equivalents\n$1,571,757\n$1,366,893\nThe accompanying notes are an integral part of these consolidated financial statements.\nZOOM TELEPHONICS, INC.\nNotes to Consolidated Financial Statements\nYears Ended December 31, 2020 and 2019\n(1) NATURE OF OPERATIONS\nZoom Telephonics, Inc. (“Zoom”) and its wholly owned subsidiaries MTRLC LLC and Minim, Inc. (“Minim\"), is a leading creator, designer, marketer, and seller of cable modems and other Internet access products under the Motorola® brand and has a proprietary AI-driven WiFi management and IoT security platform for businesses, homes, and Internet service providers.\nMinim Merger\nOn November 12, 2020, the Company entered into an Agreement and Plan of Merger (the “Merger Agreement”) with Minim, Inc. (“Minim”), a Delaware corporation, that designs, develops, sells and supports an IoT security platform that enables and secures a better connected home. Under the Merger Agreement, an acquisition subsidiary of the Company was merged into Minim in exchange for 10,784,534 shares of common stock of the Company and as a result of the merger, Minim became a wholly-owned subsidiary of Zoom Telephonics, Inc.\nImmediately prior to closing of the Merger Agreement, the majority stockholder of the Company was also the majority stockholder of Minim. As a result of the common ownership upon closing of the transaction, the acquisition was considered a common-control transaction and was outside the scope of the business combination guidance in ASC 805-50. The entities are deemed to be under common control as of October 9, 2020, which was the date that the majority stockholder acquired control of the Company and, therefore, held control over both companies. The consolidated financial statements incorporate Minim’s financial results and financial information for the period from October 9, 2020 through December 31, 2020. Assets acquired and liabilities assumed are reported at their historical carrying amounts and any difference between the proceeds transferred is recognized in additional paid-in capital. These consolidated financial statements include the historical accounts of the Company since inception and the accounts of Minim since the date of common control commenced on October 9, 2020 (Note 3). On December 4, 2020, the merger contemplated by the Merger Agreement was effected.\nZoom and its subsidiaries MTRLC LLC and Minim are herein collectively referred to as the “Company” and the merger of the Company with Minim is referred to as the “Minim Merger” within these financial statements.\n(2) SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\n(a) Basis of Presentation and Use of Estimates\nThe consolidated financial statements are prepared in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP). All significant intercompany balances and transactions have been eliminated in the consolidation. Certain prior year amounts have been reclassified to conform to the current year presentation. None of the reclassifications impacted the consolidated statement of operations for the year ended December 31, 2019.\nThe preparation of consolidated financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenue and expense during the reporting period. Actual results may differ from those estimates. Significant estimates made by the Company include: 1) allowance for doubtful accounts for accounts receivable (collectability); 2) contract liabilities (sales returns, and other variable considerations); 3) asset valuation allowance for deferred income tax assets; 4) write-downs of inventory for slow-moving and obsolete items, and market valuations; 5) stock based compensation; and 6) estimated life of intangible assets and certification costs.\n(b) Cash and Cash Equivalents\nAll highly liquid investments with original maturities of less than 90 days from the date of purchase are classified as cash equivalents. Cash equivalents consist exclusively of money market funds. The Company has deposits at a limited number of high quality financial institutions with federally insured limits. Balances of cash and cash equivalents at these institutions can be in excess of the insured limits. The Company has not experienced losses on these accounts.\n(c) Restricted Cash\nAll cash held by the Company that is not immediately available for working capital purposes or has restrictions on use is reported as Restricted cash in the accompanying consolidated balance sheets. Restricted cash balance at December 31, 2020 and 2019 was $800,000 and $150,000, respectively, and consists of a letter of credit to support a bond on tariffs.\n(d) Allowance for Doubtful Accounts\nThe Company maintains an allowance for doubtful accounts for probable credit losses resulting from the inability of its customers to make required payments. The Company records a specific allowance and revises the expected loss based on an analysis of individual past-due balances. Additionally, based on historical write-offs and the Company’s collection experience, the Company records an additional allowance based on a percentage of outstanding receivables. The Company performs credit evaluations of its customers’ financial condition. These evaluations require judgment and are based on a variety of factors including, but not limited to, current economic trends, payment history and a financial review of the customer. Actual collection losses may differ from management’s estimates, and such differences could be material to the Company's financial position and results of operations.\n(e) Inventories\nInventories are stated at the lower of cost, determined using the first-in, first-out method, or net realizable value. The Company regularly monitors inventory quantities on hand and records write-downs for excess and obsolete inventories based on the Company’s estimate of demand for its products, potential obsolescence of technology, product life cycles and whether pricing trends or forecasts indicate that the carrying value of inventory exceeds its estimated selling price. These factors are impacted by market and economic conditions, technology changes and new product introductions and require significant estimates that may include elements that are uncertain. Actual demand may differ from forecasted demand and may have a material effect on gross profit. If inventory is written down, a new cost basis is established that cannot be increased in future periods. Shipments from suppliers before the Company receives them are recorded as in-transit inventory when title and the significant risks and rewards of ownership have passed to the Company.\nAt December 31, 2020 and 2019, the Company had approximately $6,243,000 and $1,930,000 of in-transit inventory. Consigned inventory is held at third-party locations. The Company retains title to the inventory until purchased by the third-party. Consigned inventory, consisting of finished goods, was approximately $2,293,000 and $1,841,400 at December 31, 2020 and 2019, respectively.\n(f) Equipment\nEquipment is stated at cost, less accumulated depreciation. Depreciation of equipment is provided using the straight-line method over the estimated useful lives of the assets.\n(g) Goodwill, Intangible Assets, and Impairment of Long-Lived Assets\nGoodwill represents the excess of the purchase price in a business combination over the fair value of net tangible and intangible assets acquired. Intangible assets that are not considered to have a definite useful life are amortized over their useful lives, which are generally nine years or less. Each period, the Company evaluates the carrying amounts of goodwill and intangible assets for recoverability and reviews the estimated remaining useful lives of purchased intangible assets and whether events or changes in circumstances warrant a revision to the remaining periods of amortization. If the Company determines in the qualitative assessment that it is more likely than not that the fair value of the asset is less than its carrying value, a quantitative test is then performed. Otherwise, no further testing is required. Using the qualitative method, the Company did not identify any impairment for the year ended December 31, 2020.\nLong-lived assets are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount may not be recoverable. There were no events or changes in circumstances that indicate the carrying amount of long-lived assets may not be recoverable from their undiscounted cash flows. Consequently, the Company did not record any impairment to its long-lived assets during the year ended December 31, 2020.\nRecoverability of assets to be held and used is measured by a comparison of the carrying amount of an asset or asset group to undiscounted future net cash flows expected to be generated by the asset or asset group. If such assets are considered to be impaired, the impairment to be recognized is measured by the amount by which the carrying amount of the assets exceeds their fair value. Assets to be disposed of are reported at the lower of the carrying amount or fair value less cost to sell.\nThe Company capitalizes certain implementation costs related to its cloud-based enterprise resourcing planning (“ERP”) system. Costs incurred during the application development stage are capitalized. Costs incurred in the preliminary stages of development are expensed as incurred. The Company also capitalizes costs related to specific upgrades and enhancements when it is probable that the expenditures will result in additional functionality. Capitalized implementation costs are amortized on a straight-line basis over its estimated useful life, which is approximately 30 months, representing the remaining contractual term. Management evaluates the useful lives of these assets on an annual basis and tests for impairment whenever events or changes in circumstances occur that could impact the recoverability of these assets. The Company capitalized approximately $230 thousand of costs related to the ERP implementation for the period ended December 31, 2020. In 2020, the Company acquired a web domain for approximately $86 thousand and is amortizing this cost over 5 years. These capitalized costs are included in intangible assets within the consolidated balance sheet.\n(h) Other Assets\nOther assets are stated at cost, less accumulated amortization, and primarily include certain certification costs. Certain certification costs incurred that are necessary to market and sell products are capitalized and reported as “other assets” in the accompanying consolidated balance sheets when the costs are measurable, significant, and relating to products that are projected to generate revenue beyond twelve months. These costs are amortized over an 18-month period, beginning when the related products are available to be sold. Total certification costs capitalized during the year ended December 31, 2020 were $460,577, with related amortization expense of $53,333 in 2020. Total certification costs capitalized during the year ended December 31, 2019 were $310,000, with related amortization expense of $128,385 in 2019. As of December 31, 2020 and 2019, the Company had ending balances of $754,577 and $347,333, respectively.\n(i) Income Taxes\nDeferred income taxes are provided on the differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases and on net operating loss and tax credit carry forwards. Deferred income tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred income tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. A valuation allowance is provided for that portion of deferred tax assets not expected to be realized.\n(j) Sales Tax\nThe Company recorded a sales tax accrual in 2017 after the Company became aware that a state sales tax liability was both probable and estimable as of December 31, 2017. The state sales tax liability stems from the Company’s ‘Fulfilled By Amazon’ sales agreement which allows Amazon to warehouse the Company’s inventory throughout a number of states. As a result, the Company recorded an expense of approximately $831 thousand in during the year ended December 31, 2017. During the year 2018, the Company settled its obligations with most of the states and re-assessed its liability which resulted in a reduction of approximately $203 thousand in the sales tax liability. As of December 31, 2019, approximately $51 thousand of the original state sales tax liability remains and $98 thousand relates to sales tax that has been collected and not yet remitted to the respective states. As of December 31, 2020, approximately $50 thousand of the original state sales tax liability remains and $46 thousand relates to sales tax that has been collected and not yet remitted to the respective states.\n(k) Earnings (Loss) Per Common Share\nBasic earnings (loss) per share is calculated by dividing net income (loss) attributable to common stockholders by the weighted-average number of shares of common stock, except for periods with a loss from operations. Diluted earnings (loss) per share reflects additional shares of common stock that would have been outstanding if dilutive potential shares of common stock had been issued. Potential shares of common stock that may be issued by the Company include shares of common stock that may be issued upon exercise of outstanding stock options. Under the treasury stock method, the unexercised options are assumed to be exercised at the beginning of the period or at issuance, if later. The assumed proceeds are then used to purchase shares of common stock at the average market price during the period.\nDiluted earnings (loss) per common share for the years ended December 31, 2020 and 2019 exclude the effects of 1,436,061 and 467,641 common share equivalents, respectively, since such inclusion would be anti-dilutive. The common share equivalents consist of shares of common stock issuable upon exercise of outstanding stock options.\n(l) Revenue Recognition\nThe Company primarily sells hardware products to its customers. The hardware products include cable modems and gateways, mobile broadband modems, wireless routers, MoCA adapters and mesh home networking devices. The Company also sells software, including the Minim subscription service that enables and secures a better connected home.\nThe Company derives its net sales primarily from the sales of hardware products to computer peripherals retailers, computer product distributors, OEMs, and direct to consumers and other channel partners via the Internet. The Company accounts for point-of-sale taxes on a net basis. In addition, the Company earns revenues from its software subscription services of the Minim AI-driven smart home WiFi management and security platform.\nRevenue recognition is evaluated through the following five steps: (i) identification of the contract, or contracts, with a customer; (ii) identification of the performance obligations in the contract; (iii) determination of the transaction price; (iv) allocation of the transaction price to the performance obligations in the contract; and (v) recognition of revenue when or as a performance obligation is satisfied.\n●\nIdentification of the contract, or contracts, with a customer - a contract with a customer exists when the Company enters into an enforceable contract with a customer, typically a purchase order initiated by the customer, that defines each party’s rights regarding the goods to be transferred, identifies the payment terms related to these goods, and that the customer has both the ability and intent to pay.\n●\nIdentification of the performance obligations in the contract - performance obligations promised in a contract are identified based on the goods that will be transferred to the customer that are distinct, whereby the customer can benefit from the goods on their own or together with other resources that are readily available from third parties or from the Company.\n●\nDetermination of the transaction price - the transaction price is determined based on the consideration to which the Company will be entitled in exchange for transferring goods to the customer. This would be the agreed upon quantity and price per product type in accordance with the customer purchase order, which is aligned with the Company’s internally approved pricing guidelines.\n●\nAllocation of the transaction price to the performance obligations in the contract - if the contract contains a single performance obligation, the entire transaction price is allocated to the single performance obligation. This applies to the Company as there generally is only one performance obligation, which is to provide the goods.\n●\nRecognition of revenue when, or as, the Company satisfies a performance obligation - the Company satisfies performance obligations at a point in time when control of the goods transfers to the customer. Determining the point in time when control transfers requires judgment. Indicators considered in determining whether the customer has obtained control of a good include:\n●\nThe Company has a present right to payment\n●\nThe customer has legal title to the goods\n●\nThe Company has transferred physical possession of the goods\n●\nThe customer has the significant risks and rewards of ownership of the goods\n●\nThe customer has accepted the goods\nThe Company has concluded that transfer of control on hardware products substantively transfers to the customer upon shipment or delivery, depending on the delivery terms of the purchase agreement.\nThe Company sells software as a subscription. The subscription software agreements are offered over a defined contract period, generally one year, and are sold to Internet service providers, who then promote the services to their subscribers. These services are available as an on-demand application over the defined term. The agreements include service offerings, which deliver applications and technologies via cloud-based deployment models that the Company develops functionality for, provides unspecified updates and enhancements for, host, manage, upgrade and support and that the customers access by entering into solution agreements for a stated period, generally a one-year term. The monthly fees charged to the customer are based on the number of subscribers utilizing the services each month, and the revenue recognized generally corresponds to the monthly billing amounts as the services are delivered.\nOther considerations of Topic 606 include the following:\n●\nWarranties - the Company does not\nprovide separate warranty for purchase to customers. Therefore, there is not a separate performance obligation. The Company does account for assurance-type warranties as a cost accrual and the warranties do not include any additional distinct services other than the assurance that the goods comply with agreed-upon specifications.\n●\nReturned Goods - analyses of actual returned product are compared to that of the product return estimates and historically have resulted in no material difference between the two. The Company has concluded that the current process of estimating the return reserve represents a fair measure with which to adjust revenue. Returned goods are variable and under Topic 606 are estimated and recognized as a reduction of revenue as performance obligations are satisfied (e.g. upon shipment of goods). Under implementation of Topic 606, the Company monitors pending authorized returns of goods and, if deemed appropriate, record the right of return asset accordingly.\n●\nPrice Protection - price protection provides that if the Company reduces the price on any products sold to the customer, the Company will guarantee an account credit for the price difference for all quantities of that product that the customer still holds. Price protection is variable and under Topic 606 are estimated and recognized as a reduction of revenue as performance obligations are satisfied (e.g. upon shipment of goods). The estimates due to price protection are historically not material.\n●\nVolume Rebates and Promotion Programs - volume rebates are variable dependent upon the volume of goods sold-through the Company’s customers to end users variable and under Topic 606 are estimated and recognized as a reduction of revenue as performance obligations are satisfied (e.g. upon shipment of goods). The estimates due to rebates and promotions are historically not material.\nAccounts receivable, net:\nDecember 31,\nDecember 31,\nGross accounts receivable\n$9,376,937\n$4,346,810\nAllowance for doubtful accounts\n(173,603)\n(276,234)\nTotal accounts receivable, net\n$9,203,334\n$4,070,576\nCompany revenues are primarily from the selling of products that are shipped and billed. Consistent with the revenue recognition accounting standard, revenues are recognized when control is transferred to customers, in an amount that reflects the consideration the Company expects to be entitled to in exchange for those goods and services. Sales are earned at a point in time through ship-and-bill performance obligations.\nRegarding disaggregated revenue disclosures, as previously noted, the Company’s business is controlled as a single operating segment that consists of the manufacture and sale of Internet access and other communications-related products. Most of the Company’s transactions are very similar in nature, contract, terms, timing, and transfer of control of goods.\nDisaggregated revenue by distribution channel for the years ended December 31:\nRetailers\n$41,553,479\n$35,164,563\nDistributors\n4,404,936\n1,309,875\nOther\n2,030,134\n1,140,018\nTotal\n$47,988,549\n$37,614,456\nDisaggregated revenue by product for the years ended December 31:\nCable Modems & Gateways\n$44,473,601\n$33,810,410\nOther\n3,514,948\n3,804,046\nTotal\n$47,988,549\n$37,614,456\nRevenue is recognized when obligations under the terms of a contract with customers are satisfied. Revenue is measured as the amount of consideration the Company expects to receive in exchange for transferring the products. Based on the nature of the Company’s products and customer contracts, the Company has not recorded any deferred revenue. Any agreements with customers that could impact revenue such as rebates or promotions are recognized in the period of agreement.\nThe Company recorded $120,949 of revenue related to software as a subscription for the year ended December 31, 2020. This software-related revenue is attributable to the Minim Merger, whose financial results are presented from October 9, 2020 to December 31, 2020 (Note 3), and is represented in the above disaggregated revenue by distribution channel and by product segment presentations under \"other.\"\n(m) Fair Value of Financial Instruments\nThe fair value hierarchy prioritizes the inputs to valuation techniques used to measure fair value into three broad levels:\n●\nLevel 1 - Inputs are unadjusted quoted prices in active markets for identical assets or liabilities that the Company has the ability to access.\n●\nLevel 2 - Inputs are inputs (other than quoted prices included within Level 1) that are observable for the asset or liability, either directly or indirectly.\n●\nLevel 3 - Inputs include unobservable inputs for the asset or liability and rely on management's own assumptions about the assumptions that market participants would use in pricing the asset or liability. (The unobservable inputs should be developed based on the best information available in the circumstances and may include the Company’s own data.)\nFinancial instruments consist of cash and cash equivalents, accounts receivable, bank debt, and accounts payable. Due to the short-term nature and payment terms associated with these instruments, their carrying amounts approximate fair value.\n(n) Stock-Based Compensation\nCompensation cost for awards is generally recognized over the required service period based on the estimated fair value of the awards on their grant date. Fair value is determined using the Black-Scholes option-pricing model wherein the discount rate is based on published daily treasury interest rates for zero-coupon bonds available from the US Treasury. Volatility is based on the historical volatility over a period that is commensurate with the expected life of the option granted.\n(o) Advertising Costs\nAdvertising costs are expensed as incurred and reported in selling expense in the accompanying consolidated statements of operations, and include costs of advertising, production, trade shows, and other activities designed to enhance demand for the Company's products. The Company reported advertising costs of approximately $1.72 million in 2020 and $2.73 million in 2019.\n(p) Foreign Currencies\nThe Company generates a portion of its revenues in markets outside North America principally in transactions denominated in foreign currencies, which exposes the Company to risks of foreign currency fluctuations. Foreign currency transaction gains and losses are reflected in operations and were not material for any period presented. The Company does not use derivative financial instruments for hedging purposes.\n(q) Warranty Costs\nThe Company provides for the estimated costs that may be incurred under its standard warranty obligations, based on actual historical repair costs. The reserve for the provision for warranty costs was $47,569 and $37,718 at December 31, 2020 and 2019, respectively.\n(r) Shipping and Freight Costs\nThe Company records the expense associated with customer-delivery shipping and freight costs in selling expense. The Company reported shipping and freight costs of $426.1 thousand in 2020 and $301.3 thousand in 2019.\n(s) Recently Adopted Accounting Standards\nThe Company did not adopt any new accounting standard in 2020 that were significant to the Company.\n(t) Recently Issued Accounting Standards\nIn June 2016, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) No. 2016-13, \"Financial Instruments Credit Losses -Measurement of Credit Losses on Financial Instruments.\" ASU 2016-13 requires a financial asset (or group of financial assets) measured at amortized cost basis to be presented at the net amount expected to be collected, which includes the Company’s accounts receivable. This ASU is effective for the Company for reporting periods beginning after December 15, 2022. The Company is currently assessing the potential impact that the adoption of this ASU will have on our consolidated financial statements.\nWith the exception of the new standard discussed above, there have been no other new accounting pronouncements that have significance, or potential significance, to the Company's financial position, results of operations and cash flows.\n(3) ACQUISITION OF MINIM, INC.\nOn November 12, 2020, Zoom executed an Agreement and Plan of Merger (the “Merger Agreement”) with Minim, Inc. (“Minim”), a privately held company based in Manchester, New Hampshire that designs, develops, sells and supports an IoT security platform that enables and secures a better-connected home. Upon closing of the Merger Agreement on December 4, 2020, an acquisition subsidiary of Zoom merged into Minim with Minim being the surviving entity of the merger. Upon completion of the merger, all property, assets, other legal rights, debts, obligations, and all other liabilities of Minim transferred. The Agreement was structured as a non-cash, stock transaction. The stockholders of Minim received 10,784,534 shares of Zoom in exchange for the cancelation of 100% of the issued and outstanding shares of common stock of Minim. In addition, the holders of Minim stock options received 1,657,909 of Zoom stock options in exchange for 2,069,644 Minim stock options. The vesting terms of the Minim stock options agreements were transferred to stock option agreements under the Zoom stock options issued.\nImmediately prior to execution of the Agreement, the majority stockholder of the Company was also the majority stockholder of Minim. As a result of the common ownership upon closing of the transaction, the acquisition was considered a common-control transaction and was outside the scope of the business combination guidance in ASC 805-50. The entities are deemed to be under common control as of October 9, 2020, which was the date that the majority stockholder acquired control of the Company and, therefore, held control over both companies.\nPursuant to ASC 250-10 and ASC 805-50, the transaction did not result in a change in the reporting entity and was recognized retrospectively for all periods during which the entities were under common control. For common-control transactions where both receiving entity and the transferring entity were not under common control during the entire reporting period, it is necessary to determine which entity is the predecessor. The predecessor is the reporting entity deemed to be the receiving entity for accounting purposes in a common-control transaction. The predecessor is not always the entity that legally receives the net assets or equity interests transferred. Comparative financial information shall only be adjusted for periods during which the entities were under common control. Since common control between the Company and Minim occurred in the current period, the comparative information of the prior period does not include the financial results of Minim prior to October 9, 2020. Accordingly, for periods in which the combining entities were not under common control, the comparative financial statements presented are those of the entity that is determined to be the predecessor up to the date at which the entities became under common control. Zoom was determined to be the predecessor entity and, therefore, was deemed to be the receiving entity for accounting purposes. Additionally, the consolidated financial statements and financial information presented for prior periods are not required to be restated to reflect the financial position and results of operations of Minim.\nAssets acquired and liabilities assumed are reported at their historical carrying amounts and any difference between the proceeds transferred is recognized in additional paid-in capital. These consolidated financial statements include the historical accounts of the Company since inception and the accounts of Minim since the date common control commenced.\nThe following table summarizes the historical balances of the assets acquired and liabilities assumed as of October 9, 2020:\nAssets acquired\nCash and cash equivalents\n$501,845\nAccounts receivable, net\n60,301\nInventories\n192,688\nTotal current assets acquired\n754,834\nEquipment, net\n4,550\nOperating lease right-of-use asset, net\n24,437\nGoodwill\n58,872\nIntangible assets, net\n97,122\nOther assets\n45,810\nTotal assets acquired\n$985,625\nLiabilities assumed\nAccounts Payables\n$46,392\nCurrent maturities of long-term debt\n554,500\nCurrent maturities of operating lease liabilities\n24,437\nAccrued other expenses\n97,679\nTotal current liabilities\n$723,008\nNet Assets\n$262,617\nMinim held $550,662 aggregate principal amount of promissory notes issued by employees during 2019 and 2018 in connection with the exercise of Minim stock options. In connection with the transactions contemplated by the Merger Agreement, the $550,622 aggregate principal amount of the promissory notes was repaid in full. Of the $550,622, the Company received $320,290 in cash. The remaining balance of $230,332 was net settled with 103,842 shares of Minim common stock shares. These shares of common stock are incorporated in the issuance of 10,784,534 shares of Zoom common stock that were issued to Minim stockholders. This repayment occurred before the merger effective date of December 4, 2020 but after the October 9, 2020 commencement of common control. The $320,290 repayment is represented in the consolidated statement of stockholders’ equity and consolidated statement of cash flows for the year end December 31, 2020.\nMinim repurchased 33,809 shares of Minim common stock for $14,860 from a stockholder who is an immediate family member to the Company’s Executive Chairman of the Board. This repurchase remains unpaid as of December 31, 2020 and is recorded in accrued other expenses in the consolidated balance sheet as of December 31, 2020. This repurchase occurred before the merger effective date of December 4, 2020 but after the October 9, 2020 commence of common control. The $14,860 repurchase is represented in the consolidated statement of stockholders’ equity and consolidated statement of cash flows under accrued other expenses as the amount was not paid as of December 31, 2020.\nThe Company incurred transaction costs of approximately $1,594,042 related to this acquisition which were expensed as incurred and are included in general and administrative expenses in the Company’s consolidated statements of operations for the year ended December 31, 2020.\n(4) LIQUIDITY\nThe Company’s cash and cash equivalent balance on December 31, 2020 was $771.7 thousand compared to $1.2 million on December 31, 2019. On December 31, 2020, the Company had $2.4 million bank debt outstanding on an available asset-based credit line of $4.0 million, and working capital of $5.9 million.\nThe addition of US tariffs and the Coronavirus (“COVID-19”) pandemic has created potential disruptions to the Company’s operations. The 25% US tariffs assessed on products imported from China had a significant impact on cash and net loss for 2019 and for first two quarters of 2020. For the years ended December 31, 2020 and 2019, tariffs were $2.8 million and $3.2 million, respectively. These tariffs had an unfavorable impact on the Company’s financial performance until July 2020, the first full month after which the Company fully transitioned all of its core production supply out of China. In late 2019, the Company made the decision to move its outsourced manufacturing operations from China to Vietnam, primarily to end the exposure to the trade-war imposed tariffs with China. While the COVID-19 pandemic caused delays in the original transition plan, the Company worked actively with its primary outsourced development partner to establish manufacturing operations in Haiphong, Vietnam. The transition to Vietnam was completed in June 2020. All manufacturing of existing models as of July 2020 takes place in Vietnam. For the second half of the year, only the initial manufacturing runs of new models took place in China. This transition lessened the Company’s tariff burdens and allows for the eventual release of an additional $800,000 in restricted cash over the next year related to performance bonds required to be posted related to the tariffs. The Company is also further diversifying its relationships with outsourced manufacturers. The Company signed a three-year agreement with Foxconn, one of the leading global outsourced manufacturers to the high-tech industry, to manufacture several of the new models the company plans to introduce to the market during 2021.\nThe Company implemented cost cutting measures to conserve cash including postponing new hires in 2020 and not renewing the same footprint of its headquarters office lease when it expired in June 2020. The Company downsized its executive offices by retaining a small office within the City of Boston for research and testing purposes on a short-term, month-to-month basis at a cost of $682 per month starting November 1, 2020. Our work force continues to work remotely, and we are continuing operations. We have negotiated improved payment terms with our primary outsourced manufacturing partner. The Company expanded its revolving working capital line of credit with Rosenthal & Rosenthal from $4 million to $5 million in February 2021 and subsequently replaced the Rosenthal credit line with a $12 million credit facility and a $1 million credit card line provided by Silicon Valley Bank in March 2021. The Company continues to develop new products and anticipates that it will introduce several new models to the market during 2021. While the COVID-19 outbreak disrupted sales and production for a short period of time during mid-March 2020, the Company worked through the disruption. In mid-March, sales initially decreased in response to a key distributor focusing its distribution logistics on essential healthcare products. The Company’s products, which are instrumental to businesses and consumers establishing remote and home-based offices, have since been designated as essential and are once again being offered and are selling at normal levels and certain models are currently selling above their average run rates before COVID-19 had a global impact on business and the economy. The Company continues to work closely with its manufacturing partners and distributors to ensure that the Company’s products remain consistently available for sale to end-users.\nThe Company applied for and received approval for a Small Business Administration (“SBA”) Paycheck Protection Plan Loan with Primary Bank under the Coronavirus Aid, Relief and Economic Security Act (the “CARES Act”). The loan from the US government in the amount of $583.3 thousand was approved and funded in April 2020. The Company used the proceeds from the loan for qualifying expenses as defined in the CARES Act. The loan and related accrued interest was partially forgiven in 2020.\n(5) INVENTORIES\nInventories consist of the following at December 31:\nMaterials\n$1,238,332\n$911,054\nWork in process\n84,203\n10,284\nFinished goods\n15,182,305\n6,519,012\nTotal\n$16,504,840\n$7,440,350\nFinished goods includes consigned inventory held by our customers of $2,293,017 and $1,841,400 at December 31, 2020 and 2019, respectively and includes in-transit inventory of $6,243,165 and $1,930,358 at December 31, 2020 and 2019, respectively. The Company reviews inventory for obsolete and slow-moving products each quarter and makes provisions based on its estimate of the probability that the material will not be consumed or that it will be sold below cost. The provision for inventory reserves was negligible for both years ended December 31, 2020 and year ended December 31, 2019.\n(6) EQUIPMENT\nEquipment consists of the following at December 31:\nEstimated\nUseful lives\nin years\nComputer hardware and software\n$398,520\n$308,767\nMachinery and equipment\n426,885\n316,945\nMolds, tools and dies\n760,563\n651,063\nOffice furniture and fixtures\n64,128\n50,948\n1,650,096\n1,327,722\nAccumulated depreciation\n(1,195,030)\n(1,024,623)\nEquipment, net\n$455,066\n$303,099\nDepreciation expense for the year ended\n$157,107\n$132,632\n(7) GOODWILL\nIn December 2018, Minim acquired the net assets of MCP Networks Inc., a provider of a cloud-based home network management platform. The acquisition expanded Minim’s subscriber base and thereby offered sales opportunities of Minim’s software services to these subscribers. Minim recorded $58,872 of goodwill related to this acquisition in its historical accounts of December 2018. In accordance with the accounting of a common control transaction (Note 3), the Company recorded $58,872 of goodwill balance at Minim’s historical carrying amount as of October 9, 2020. As of December 31, 2020, the goodwill balance remains unchanged.\n(8) INTANGIBLE ASSETS\nIntangible assets are recorded at the estimated fair value of acquired technology and customer relationships and are amortized over the respective estimated useful life using a method that is based on estimated future cash flows, as the Company believes this will approximate the pattern in which the economic benefits of the asset will be utilized.\nIn December 2018, Minim acquired the net assets of MCP Networks Inc., a provider of a cloud-based home network management platform. The acquisition expanded Minim’s subscriber base and thereby offered sales opportunities of Minim’s software services to these subscribers. Minim recorded $122,435 of customer relationships related to this acquisition in its historical accounts of December 2018. In accordance the accounting of a common control transaction (Note 3), the Company recorded Minim’s historical carrying amounts, as of October 9, 2020, $122,435 of customer relationships and $25,313 of related accumulated amortization.\nIntangible assets consisted of the following at December 31, 2020:\nEst. Useful Life (yrs)\nGross Carrying Amount\nAccumulated Amortization\nNet\nCapitalized internal use software\n2.5\n$230,106\n$(20,431)\n$209,675\nCustomer relationships\n122,435\n(28,768)\n93,667\nAcquired web domain\n86,732\n(1,445)\n85,287\nTotals\n$439,273\n$(50,644)\n$388,629\nAmortization expense was $25,331 for the year ended December 31, 2020. The Company did not have any intangible assets for the year ended December 31, 2019.\nThe estimated annual amortization expense for each of the five succeeding years and thereafter is as follows:\nYears Ended December 31,\n$125,931\n123,147\n53,762\n31,092\n29,609\nThereafter\n25,088\nTotal\n$388,629\n(9) ACCRUED OTHER EXPENSES\nAccrued other expenses for the years ended December 31, 2020 and 2019 consisted of the following:\nDecember 31,\nDecember 31,\nInventory purchases\n$1,458,850\n$-\nPayroll and related benefit costs\n853,402\n151,473\nProfessional fees\n618,308\n105,493\nRoyalty costs\n1,906,439\n1,125,000\nContract liabilities*\n1,559,847\n901,196\nSales and use tax\n183,264\n148,836\nOther\n884,953\n234,473\nTotal accrued other expenses\n$7,465,063\n$2,666,471\n*\nContract liabilities include sales allowances given to customers. A related inventory contract asset stemming from the sales return reserve of $366 thousand and $376 thousand is included within inventories on the accompanying consolidated balance sheets as of December 31, 2020 and 2019, respectively.\n(10) COMMITMENTS AND CONTINGENCIES\n(a) Lease Obligations\nIn May 2020, the Company signed a two-year lease agreement for 3,218 square feet at 275 Turnpike Executive Park, Canton MA. The agreement includes a one-time option to cancel the second year of lease with three-month advance notice. The location is currently being occupied by the research and development group of the Company. Rent expense for the year ended December 31, 2020 was $31.0 thousand.\nUpon the Minim Merger, the Company assumed Minim’s office facility lease located at the 848 Elm Street, Manchester, NH. The two-year facility lease agreement is effective from August 1, 2019 to July 31, 2021 and provides for 2,656 square feet. For the period from October 9, 2020 to December 31, 2020, the rent expense was $6.8 thousand.\nIn June 2016, the Company signed a three-year sub-lease agreement for 11,480 square feet on the 28th floor of 99 High Street, Boston, MA 02110. The lease for this facility expired on June 30, 2019. The Company signed a twelve-month lease agreement for offices at 225 Franklin Street, Boston, MA and completed the move to this location on June 28, 2019. The lease has an automatic renewal option provision and renews unless cancelled under the terms of the agreement. This lease originally expired on June 30, 2020, after which the Company reduced its footprint of leased space and continued on a short-term basis until October 31, 2020. At that time, the Company signed a month-to-month lease agreement for a single office at 101 Arch Street, Boston, MA beginning November 1, 2020, while reviewing options for long-term lease for headquarters in Boston. The Company has elected to apply the short-term lease exception under ASC 842 which does not require the recognition of an operating lease liability or right-of-use asset on the condensed consolidated balance sheet in relation to the leases at 225 Franklin Street or at 101 Arch Street. Rent expense was $265.9 thousand and $558.2 thousands for the years ended December 31, 2020 and 2019, respectively.\nThe Company performs most of the final assembly, testing, packaging, warehousing and distribution at a production and warehouse facility in Tijuana, Mexico. In November 2014, we signed a one-year lease with five one-year renewal options thereafter for an 11,390 square foot facility in Tijuana, Mexico. In September 2015, Zoom extended the term of the lease from December 1, 2015 through November 30, 2018. In September 2015, Zoom also signed a new lease for additional space in the adjacent building, which doubled our capacity. The term of this lease was from March 1, 2016 through November 30, 2018. The Company has signed a lease extension to stay in the existing facilities through at least November 30, 2020. Currently, the Company is renting the facilities month-to-month while it negotiates a new lease agreement. Rent expense was $106.2 thousand in 2020 and $106.2 thousand in 2019.\nThe Company also has a lease for approximately 1,550 square feet in Boston, MA that expired on October 31, 2019 and has been renewed for an additional 12 month starting November 1, 2019. The Company has negotiated to terminate this lease effective June 30, 2020. The Company has another one-year lease signed in December 2019 for approximately 1,500 square feet in Boston. The Company also negotiated the termination of this lease effective July 31, 2020. The Company has elected to apply the short-term lease exception for both of these leases under ASC 842 which does not require the recognition of an operating lease liability or right-of-use asset on the condensed consolidated balance sheet in relation to this lease. Rent expense for these leases was approximately $76.8 thousand in 2020 and approximately $74.9 thousand in 2019.\nAt inception of a lease the Company determines whether that lease meets the classification criteria of a finance or operating lease. Some of the Company’s lease arrangements contain lease components (e.g. minimum rent payments) and non-lease components (e.g. maintenance, labor charges, etc.). The Company generally accounts for each component separately based on the estimated standalone price of each component.\nAs of December 31, 2020, the Company's estimated future minimum committed rental payments, excluding executory costs, under the operating leases described above to their expiration or the earliest possible termination date, whichever is sooner, are $70.9 thousand for 2021 and $22.8 thousand for 2022. There are no future minimum committed rental payments that extend beyond 2022.\nOperating Leases\nOperating leases are included in operating lease right-of-use assets, operating lease liabilities, and long-term operating lease liabilities on the condensed consolidated balance sheets. These assets and liabilities are recognized at the commencement date based on the present value of remaining lease payments over the lease term using the Company’s secured incremental borrowing rates or implicit rates, when readily determinable. Based on the Company's financial position and ability to obtain financing at the time ASC 842 was adopted, 10% was considered by management to be a reasonable incremental borrowing rate when calculating the present value of remaining lease payments over the lease term. Short-term operating leases, which have an initial term of 12 months or less, are not recorded on the balance sheet.\nLease expense for operating leases is recognized on a straight-line basis over the lease term. Lease expense is included in general and administrative expenses on the condensed consolidated statements of operations.\nThe following table presents information about the amount and timing of the Company’s operating leases as of December 31, 2020.\nDecember 31,\nMaturity of Lease Liabilities\nLease Payments\n$70,865\n22,794\nLess: Imputed interest\n(5,773)\nPresent value of operating lease liabilities\n$87,886\nBalance Sheet Classification\nCurrent maturities of operating lease liabilities\n$65,651\nOperating lease liabilities, less current maturities\n22,235\nTotal operating lease liabilities\n$87,886\nOther Information\nWeighted-average remaining lease term for operating leases\n1.3\nWeighted-average discount rate for operating leases\n9.0%\nCash Flows\nUpon adoption of the new lease standard in 2019, the Company recorded a lease liability in the amount of $420,899, right-of-use assets of $395,565, and reclassified deferred rent of $25,334 as a reduction of the right-of-use assets. During the year ended December 31, 2020, the Company recorded an additional lease liability and corresponding right-of-use asset of $96,199 related to the Company’s Canton, MA lease. Upon the Minim Merger, the Company recorded Minim’s historical carrying amounts, as of October 9, 2020 (Note 3), right-of-use asset and lease liability of $24,437 and $24,437, respectively. During the years ended December 31, 2020 and 2019, the operating lease liability was reduced by $135,465 and $318,183, respectively. We recorded amortization of our right-of-use assets of $136,404 and $292,849 for the years ended December 31, 2020 and 2019, respectively.\nSupplemental cash flow information and non-cash activity related to our operating leases are as follows:\nYear Ended\nDecember 31,\nOperating cash flow information:\nAmounts included in measurement of lease liabilities\n$143,761\n$324,346\nNon-cash activities:\nRight-of-use assets obtained in exchange for lease obligations\n$120,635\n$395,565\n(b) Contingencies\nThe Company is a party to various lawsuits and administrative proceedings arising in the ordinary course of business. The Company evaluates such lawsuits and proceedings on a case-by-case basis, and its policy is to vigorously contest any such claims which it believes are without merit.\nThe Company reviews the status of its legal proceedings and records a provision for a liability when it is considered probable that both a liability has been incurred and the amount of the loss can be reasonably estimated. This review is updated periodically as additional information becomes available. If either or both of the criteria are not met, the Company reassesses whether there is at least a reasonable possibility that a loss, or additional losses, may be incurred. If there is a reasonable possibility that a loss may be incurred, the Company discloses the estimate of the amount of the loss or range of losses, that the amount is not material, or that an estimate of the loss cannot be made. The Company expenses its legal fees as incurred.\nOn January 23, 2020, William Schulze filed a complaint, and subsequently filed an amended complaint on April 3, 2020 (collectively the “Schulze Complaint”) as lead plaintiff on behalf of purchasers of Zoom modems in a putative class action lawsuit against Zoom in the U.S. District Court for the District of Massachusetts. The Schulze Complaint alleged that Zoom modems were sold as new despite containing refurbished parts. On July 28, 2020, the lead plaintiff filed a Stipulation of Dismissal that dismissed the Schulze Complaint with prejudice.\nIn the ordinary course of their business, the Company and its subsidiaries are subject to lawsuits, arbitrations, claims, and other legal proceedings in connection with their business. Some of the legal actions include claims for substantial or unspecified compensatory and/or punitive damages. A substantial adverse judgment or other unfavorable resolution of these matters could have a material adverse effect on the Company’s financial condition, results of operations, and cash flows. Management believes that the Company has adequate legal defenses with respect to the legal proceedings to which it is a defendant or respondent and that the outcome of these pending proceedings is not likely to have a material adverse effect on the financial condition, results of operations, or cash flows of the Company. However, the Company is unable to predict the outcome of these matters.\n(c) Commitments\nIn May 2015, Zoom entered into a License Agreement with Motorola Mobility LLC (the “License Agreement”). The License Agreement provides Zoom with an exclusive license to use certain trademarks owned by Motorola Trademark Holdings, LLC. for the manufacture, sale and marketing of consumer cable modem products in the United States and Canada through certain authorized sales channels.\nIn August 2016, Zoom entered into an amendment to the License Agreement with Motorola Mobility LLC (the “2016 Amendment”). The 2016 Amendment expands Zoom’s exclusive license to use the Motorola trademark to a wide range of authorized channels worldwide and expands the license from cable modems and gateways to also include consumer routers, WiFi range extenders, home powerline network adapters, and access points.\nIn August 2017, Zoom entered into an amendment to the License Agreement with Motorola Mobility LLC (the “2017 Amendment”). The 2017 Amendment expands Zoom’s exclusive license to use the Motorola trademark to a wide range of authorized channels worldwide, and expands the license from cable modems, gateways, consumer routers, WiFi range extenders, home powerline network adapters, and access points to also include MoCa adapters, and cellular sensors. The License Agreement, as amended, has a five-year term beginning January 1, 2016 through December 31, 2020 and increased the minimum royalty payments as outlined below.\nIn March 2020, Zoom entered into an amendment to the License Agreement with Motorola Mobility LLC. The 2020 Amendment the (“2020 Amendment”) expands Zoom’s exclusive license to use the Motorola trademark to a wide range of authorized channels worldwide, including Service Provider Channels. The License Agreement, as amended, has a 10-year term beginning January 1, 2016 through December 31, 2025 and modified the minimum royalty payments as outlined below.\nIn connection with the License Agreement, the Company has committed to reserve a certain percentage of wholesale prices for use in advertising, merchandising and promotion of the related products. Additionally, the Company is required to make quarterly royalty payments equal to a certain percentage of the preceding quarter’s net sales with minimum annual royalty payments as follows:\nYears ending December 31,\n$6,350,000\n6,600,000\n6,850,000\n7,100,000\n7,100,000\nTotal\n$34,000,000\nRoyalty expense under the License Agreement amounted to $5,100,000 for 2020 and $4,500,000 for 2019 and is reported in selling expense on the accompanying consolidated statements of operations.\n(11) STOCK OPTION PLANS\n2019 Stock Option Plan\nOn July 9, 2019, the Company established the 2019 Stock Option Plan (the “2019 Option Plan”) for officers and certain full-time and part-time employees of the Company. Non-employee directors of the Company are not entitled to participate under this plan. The 2019 Option Plan provides for 4,000,000 shares of common stock for issuance upon the exercise of stock options granted under the plan. Under this plan, stock options are granted at the discretion of the Compensation Committee of the Board of Directors at an option price not less than the fair market value of the stock on the date of grant. The options are exercisable in accordance with terms specified by the Compensation Committee not to exceed 10 years from the date of grant. Option activity under this plan follows.\nNumber of shares\nWeighted average exercise price\nWeighted Average Remaining Contractual Life\nOutstanding as of January 1, 2019\n--\n$--\n--\nGranted\n820,000\n0.83\nExercised\n--\n--\nOutstanding as of December 31, 2019\n820,000\n$0.83\n2.68\nGranted\n277,037\n2.02\nAssumed with Minim Merger\n1,432,018\n0.61\nExercised\n(276,856)\n0.82\nExpired/Forfeited\n(205,000)\n0.84\nOutstanding as of December 31, 2020\n2,047,199\n$0.84\n3.51\nOptions exercisable at December 31, 2020\n682,770\n$0.67\n2.79\nThe weighted average grant date fair value of options granted was $2.65 and $0.40 in 2020 and 2019, respectively. The aggregate intrinsic value of options outstanding was approximately $5.7 million and $0.3 million at December 31, 2020 and 2019, respectively. The aggregate intrinsic value of exercisable options was approximately $2.0 million and $0 at December 31, 2020 and 2019, respectively. As of December 31, 2020, there remained 1,675,945 options available to be issued under the 2019 Option Plan. Upon the Minim Merger, the Company converted 1,432,018 options to Minim option holders in exchange for approximately 1,787,654 Minim stock options.\n2019 Director Stock Option Plan\nOn July 9, 2019, the Company established the 2019 Director Stock Option Plan (the \"2019 Directors Plan\"). The Directors Plan was established for all members of the Board of Directors of the Company except for any director who is a full-time employee or full-time officer of the Company. The option price is the fair market value of the common stock on the date the option is granted. There are 1,000,000 shares authorized for issuance under the 2019 Directors Plan. Option activity under this plan follows.\nNumber of shares\nWeighted average exercise price\nWeighted Average Remaining Contractual Life\nOutstanding as of January 1, 2019\n--\n$--\n--\nGranted\n45,000\n0.97\nExercised\n--\n--\nOutstanding as of December 31, 2019\n45,000\n$0.97\n2.50\nGranted\n297,963\n2.26\nAssumed with Minim Merger\n225,891\n0.62\nExercised\n(56,500)\n1.51\nExpired/Forfeited\n(15,000)\n1.06\nOutstanding as of December 31, 2020\n497,354\n$1.52\n3.27\nOptions exercisable at December 31, 2020\n282,124\n$0.95\n2.32\nThe weighted average grant date fair value of options granted was $1.30 and $0.53 in 2020 and 2019, respectively. The aggregate intrinsic value of options outstanding was approximately $964.3 thousand and $9.5 thousand at December 31, 2020 and 2019, respectively. The aggregate intrinsic value of exercisable options was approximately $696.3 thousand and $9.5 thousand at December 31, 2020 and 2019, respectively. As of December 31, 2020, there remained 446,146 options available to be issued under the 2019 Directors Plan. Upon the Minim Merger, the Company converted 225,891 options to Minim option holders in exchange for approximately 281,990 Minim stock options.\n2009 Stock Option Plan\nOn December 10, 2009, the Company established the 2009 Stock Option Plan (the “2009 Option Plan”) for officers and certain full-time and part-time employees of the Company. Non-employee directors of the Company are not entitled to participate under this plan. The 2009 Option Plan provides for 5,500,000 shares of common stock for issuance upon the exercise of stock options granted under the plan. Under this plan, stock options are granted at the discretion of the Compensation Committee of the Board of Directors at an option price not less than the fair market value of the stock on the date of grant. The options are exercisable in accordance with terms specified by the Compensation Committee not to exceed 10 years from the date of grant. Option activity under this plan follows.\nNumber of shares\nWeighted average exercise price\nWeighted Average Remaining Contractual Life\nOutstanding as of January 1, 2019\n1,569,603\n1.41\n2.13\nGranted\n90,000\n0.95\nExercised\n(199,792)\n0.24\nExpired/Forfeited\n(150,000)\n---\nOutstanding as of December 31, 2019\n1,309,811\n1.45\n1.28\nGranted\n--\n--\nExercised\n(655,001)\n1.01\nExpired/Forfeited\n(236,200)\n1.50\nOutstanding as of December 31, 2020\n418,610\n$2.06\n0.58\nOptions exercisable at December 31, 2020\n418,610\n$2.06\n0.58\nThe weighted average grant date fair value of options granted was $0.46 in 2019. No grants were issued under this plan in 2020. The aggregate intrinsic value of options outstanding was approximately $654 thousand at December 31, 2020 and approximately $369 thousand at December 31, 2019. The aggregate intrinsic value of exercisable options was approximately $654 thousand at December 31, 2020 and $353 thousand at December 31, 2019. As of December 31, 2020, there remained no options available to be issued under the 2009 Option Plan. The 2009 Option Plan terminated on December 1, 2019. The 2019 Stock Option Plan was approved on July 9, 2019 and replaced the 2009 Option Plan.\n2009 Directors Option Plan\nOn December 10, 2009, the Company established the 2009 Directors Option Plan (the \"2009 Directors Plan\"). The 2009 Directors Plan was established for all Directors of the Company except for any director who is a full-time employee or full-time officer of the Company. The option price is the fair market value of the common stock on the date the option is granted. There are 700,000 shares authorized for issuance under the 2009 Directors Plan. Each option expires five years from the grant date. Option activity under this plan follows.\nNumber of shares\nWeighted average exercise price\nWeighted Average Remaining Contractual Life\nOutstanding as of January 1, 2019\n342,500\n1.71\n2.52\nGranted\n97,500\n1.09\nExercised\n(60,000)\n0.23\nExpired/Forfeited\n(80,000)\nOutstanding as of December 31, 2019\n300,000\n1.63\n2.00\nGranted\n--\n--\nExercised\n(135,000)\n1.44\nExpired/Forfeited\n(30,000)\n0.88\nOutstanding as of December 31, 2020\n135,000\n$1.98\n0.82\nOptions exercisable at December 31, 2020\n135,000\n$1.98\n0.82\nThe weighted average grant date fair value of options granted was $0.57 in 2019. No grants were issued under this plan in 2020. The aggregate intrinsic value of options outstanding was approximately $222 thousand at December 31, 2020 and $41 thousand at December 31, 2019. The aggregate intrinsic value of exercisable options was approximately $222 thousand at December 31, 2020 and $41 thousand at December 31, 2019. As of December 31, 2019, there remained no options available to be issued under the 2009 Directors Option Plan. The 2009 Directors Option Plan terminated on December 1, 2019. The 2019 Directors Option Plan was approved on July 9, 2019 and replaced the 2009 Directors Option Plan.\nThe Black-Scholes range of assumptions for all stock option plans is shown below:\nAssumptions:\nExpected life\n3.24 to 6.25 (yrs)\n2.75 (yrs) - 3.5 (yrs)\nExpected volatility\n37% to 114.41%\n77.74% - 87.40%\nRisk-free interest rate\n0.19% - 1.67%\n1.34% - 2.69%\nExpected dividend yield\n0.00%\n0.00%\nThe unrecognized stock-based compensation expense related to non-vested stock awards was approximately $705.0 thousand as of December 31, 2020. This amount will be recognized through the fourth quarter of 2021.\n(12) INCOME TAXES\nIncome tax expense consists of:\nCurrent\nDeferred\nTotal\nYear Ended December 31, 2019:\nU.S. federal\n$--\n$--\n$--\nState and local\n10,792\n--\n10,792\nForeign\n14,073\n--\n14,073\n$24,865\n$--\n$24,865\nYear Ended December 31, 2020:\nU.S. federal\n$--\n$--\n$--\nState and local\n11,752\n--\n11,752\nForeign\n14,964\n--\n14,964\n$26,716\n$--\n$26,716\nA reconciliation of the expected income tax expense or benefit to actual follows:\nComputed \"expected\" US benefit at Federal statutory rate\n$(685,652)\n$(807,799)\nChange resulting from:\nState and local income taxes, net of federal income tax benefit\n(102,770)\n(145,891)\nValuation allowance\n411,810\n(121,000)\nNon--deductible items\n87,998\n394,236\nExpired Federal net operating loss\n218,376\n1,043,171\nFederal and state rate changes\n95,103\n(113,340)\nNon-taxable PPP loan forgiveness\n--\n(222,661)\nIncome tax expense\n$24,865\n$26,716\nTemporary differences at December 31 follow:\nDeferred income tax assets:\nInventories\n$145,884\n$241,874\nAccounts receivable\n253,559\n445,392\nAccrued expenses\n80,068\n116,254\nNet operating loss and tax credit carry forwards\n13,276,081\n15,243,998\nPlant and equipment\n6,014\n39,521\nStock compensation\n123,841\n448,375\nLease accounting\n26,515\nOther - interest expense\n12,385\n24,009\nTotal deferred income tax assets\n13,924,347\n16,559,671\nValuation allowance\n(13,924,347)\n(16,559,671)\nNet deferred tax assets\n$--\n$--\nOn December 22, 2017, the U.S. government enacted comprehensive tax legislation commonly referred to as the Tax Cuts and Jobs Act (the “Tax Act”) that significantly revised the U.S. tax code effective January 1, 2018 by, among other things, lowering the corporate income tax rate from a top marginal rate of 35% to a flat 21%. Other than the reduction in statutory rate, the Company does not anticipate the regulations will have a material impact on income taxes in future years.\nAs of December 31, 2020, the Company had federal net operating loss carry forwards of approximately $61,779,000 which are available to offset future taxable income. They are due to expire in varying amounts from 2021 to 2039. Federal net operating losses occurring after December 31, 2017, of approximated $13,617,000 may be carried forward indefinitely. As of December 31, 2020, the Company had state net operating loss carry forwards of approximately $19,151,000 which are available to offset future taxable income. They are due to expire in varying amounts from 2032 through 2039. The Company’s merger with Minim in 2020 triggered a change of ownership that may limit the use of our net operating losses. The Company is in the process of determining the impact of any such limitation. A valuation allowance has been established for the full amount of deferred income tax assets as management has concluded that it is more-likely than-not that the benefits from such assets will not be realized.\nThe Company reviews annually the guidance for the financial statement recognition, measurement and disclosure of uncertain tax positions recognized in the financial statements. Tax positions must meet a \"more-likely-than-not\" recognition threshold. At December 31, 2020 and 2019, the Company did not have any uncertain tax positions. No interest and penalties related to uncertain tax positions were accrued at December 31, 2020 and 2019.\nThe Company files income tax returns in the United States and Mexico. Tax years subsequent to 2016 remain subject to examination for both US federal and state tax reporting purposes. Tax years subsequent to 2014 remain subject to examination for Mexico tax reporting purposes. The foreign income tax reported represents tax on operations for the Company that is located in a special economic zone in Mexico. Other than the Mexico facility, the Company has no operations in a foreign location.\n(13) SIGNIFICANT CUSTOMERS\nThe Company sells its products primarily through high-volume distributors and retailers, Internet service providers, telephone service providers, value-added resellers, PC system integrators, and OEMs. The Company supports its major accounts in their efforts to discern strategic directions in the market, to maintain appropriate inventory levels, and to offer a balanced selection of attractive products.\nRelatively few companies account for a substantial portion of the Company’s revenues. In 2020, two companies accounted for 10% or greater individually, and 76% in the aggregate of the Company’s total net sales. At December 31, 2020 three companies with an accounts receivable balance of 10% or greater individually accounted for a combined 85% of the Company’s accounts receivable. In 2019, two companies accounted for 10% or greater individually, and 84% in the aggregate of the Company’s total net sales. At December 31, 2019, three companies with an accounts receivable balance of 10% or greater individually accounted for a combined 84% of the Company’s accounts receivable.\n(14) SEGMENT AND GEOGRAPHIC INFORMATION\nThe Company's operations are classified as one reportable segment. Substantially all of the Company's operations and long-lived assets reside primarily in the North America. Net sales information is as follows:\nFY 2020\nPercent\nFY 2019\nPercent\nNorth America\n$47,116,632\n98.2%\n$36,741,262\n97.7%\nOutside North America\n871,917\n1.8%\n873,194\n2.3%\nTotal\n$47,988,549\n100.0%\n$37,614,456\n100.0%\n(15) DEPENDENCE ON KEY SUPPLIERS\nThe Company participates in the home connectivity industry, which is characterized by aggressive pricing practices, continually changing customer demand patterns and rapid technological developments. The Company's operating results could be adversely affected should the Company be unable to successfully anticipate customer demand accurately; manage its product transitions, inventory levels and manufacturing process efficiently; distribute its products quickly in response to customer demand; differentiate its products from those of its competitors or compete successfully in the markets for its new products.\nThe Company depends on many third-party suppliers for key components contained in its product offerings. For some of these components, the Company may only use a single source supplier, in part due to the lack of alternative sources of supply. In 2020, the Company had two suppliers that provided 99% of the Company's purchased inventory. In 2019, the Company had one supplier that provided 96.3% of the Company's purchased inventory.\n(16) RETIREMENT PLAN\nThe Company has a 401(k) retirement savings plan for employees. Under the plan, the Company matches 25% of an employee's contribution, up to a maximum of $350 per employee per year. Company matching contributions charged to expense is $10,575 and $5,405 in 2020 and 2019, respectively.\n(17) BANK CREDIT LINE AND GOVERNMENT LOANS\nBank Credit Line\nOn December 18, 2012, the Company entered into a Financing Agreement with Rosenthal & Rosenthal, Inc. (the “Financing Agreement”). The Financing Agreement provided for up to $1.75 million of revolving credit, subject to a borrowing base formula and other terms and conditions as specified in the Financing Agreement. The Financing Agreement continued until November 30, 2014 and automatically renews from year to year thereafter, unless sooner terminated by either party as specified in the Financing Agreement. The Lender shall have the right to terminate the Financing Agreement at any time by giving the Company sixty days’ prior written notice. Borrowings are secured by all of the Company assets including intellectual property. The Loan Agreement contained several covenants, including a requirement that the Company maintain tangible net worth of not less than $2.5 million and working capital of not less than $2.5 million.\nOn March 25, 2014, the Company entered into an amendment to the Financing Agreement (the “Amendment”) with an effective date of January 1, 2013. The Amendment clarified the definition of current assets in the Financing Agreement, reduced the size of the revolving credit line to $1.25 million, and revised the financial covenants so that Zoom is required to maintain tangible net worth of not less than $2.0 million and working capital of not less than $1.75 million.\nOn October 29, 2015, the Company entered into a second amendment to the Financing Agreement (the “Second Amendment”). Retroactive to October 1, 2015, the Second Amendment eliminated $2,500 in monthly charges for the Financing Agreement. Effective December 1, 2015, the Second Amendment reduces the effective rate of interest to 2.25% plus an amount equal to the higher of prime rate or 3.25%.\nOn July 19, 2016, the Company entered into a third amendment to the Financing Agreement. The Amendment increased the size of the revolving credit line to $2.5 million effective as of date of the amendment.\nOn September 1, 2016, the Company entered into a fourth amendment to the Financing Agreement. The Amendment increased the size of the revolving credit line to $3.0 million effective with the date of this amendment.\nOn November 2, 2018, the Company entered into a fifth amendment to the Financing Agreement. The Amendment reduced the effective interest rate by 1 percentage point and reduced the annual facility fee by 0.25 percent.\nOn April 13, 2020, the Company entered into a sixth amendment to the Financing Agreement. The Amendment increased the size of the revolving credit line to $4.0 million effective with the date of this amendment.\nThe Company is required to calculate its covenant compliance on a quarterly basis and as of December 31, 2020, the Company was in compliance with both its working capital and tangible net worth covenants. At December 31, 2020, the Company’s tangible net worth was approximately $6.3 million, while the Company’s working capital was approximately $5.9 million. Loan availability is based on certain eligible receivables. Loan availability was approximately $1.6 million as of December 31, 2020.\nGovernment Loans\nOn March 27, 2020, the Coronavirus Aid, Relief, and Economic Security Act (the “CARES Act”) was enacted to provide financial aid to family and businesses impacted by the COVID-19 pandemic. The Company participated in the CARES Act, and on April 15, 2020, the Company entered into a note payable with Primary Bank, a bank under the Small Business Administration (“SBA”), Paycheck Protection Program (“PPP”) in the amount of $583.3 thousand. This note payable matures on March 15, 2022 with a fixed interest rate of 1% per annum with interest deferred for six months. The PPP loan has an initial term of two years, is unsecured and guaranteed by the SBA. Under the terms of the PPP note, the Company was able to apply for forgiveness of the amount due on the PPP loan. The Company submitted an application for forgiveness of this loan and received partial forgiveness of $512.8 thousand in principal and $3 thousand in accrued interest from the SBA in November 2020. The Company used the proceeds from the PPP loan for qualifying expenses as defined in the PPP.\nOn March 11, 2020, Minim entered into a note payable with Primary Bank and received $544.5 thousand under the PPP. This note payable matures on March 11, 2022 with a fixed interest rate of 1% per annum with interest deferred for six months. The PPP loan has an initial term of two years, is unsecured and guaranteed by the SBA. Under the terms of the PPP note, the Company was able to apply for forgiveness of the amount due on the PPP loan. The Company submitted an application for forgiveness of this loan and received forgiveness of $544.5 thousand in principal and $3 thousand in accrued interest from the SBA in November 2020. The Company used the proceeds from the PPP loan for qualifying expenses as defined in the PPP.\nMinim recorded the loan liability related to this US government grant in its historical accounts as of October 9, 2020. In accordance with the accounting of a common control transaction (Note 3), the Company recorded a loan liability of $544.5 thousand, which was Minim’s historical carrying amount as of October 9, 2020.\nFor the year end December 31, 2020, the Company has recorded $65,225 of the PPP loans in current maturities of long-term debt and $15,245 in long-term debt in the consolidated balance sheet.\n(18) PRIVATE PLACEMENTS\nOn May 26, 2020, the Company entered into a Stock Purchase Agreement (the “2020 Stock Purchase Agreement”) with certain accredited investors, including certain independent investment funds, members of the Company’s management and its Board of Directors, and certain co-founders of the Company, in a private placement pursuant to which the Company sold an aggregate of 2,237,103 shares of common stock, par value $0.01 per share, at a purchase price of $1.52 per share. In connection with the Stock Purchase Agreement, the Company incurred $237,030 of expenses which has been recorded as a reduction of additional paid in capital as presented in the condensed consolidated statements of stockholders’ equity. The net proceeds to the Company at the closing of the private placement were $3.16 million.\nOn October 9, 2020, one of the accredited investors under the 2020 Stock Purchase Agreement sold his shares originally purchased under the Stock Purchase Agreement in a private sale transaction. The private sale of the investor’s shares constituted a short swing transaction, whereby, and as defined by Section 16(b) of the Securities Exchange Act of 1934 (the “Exchange Act”), the investor was deemed a corporate insider who sold the shares within six months after the purchase of those shares. As required by the Exchange Act, the investor was required to disgorge $196,000 in profits from the private sale. The Company received and recorded the funds from disgorgement to additional paid in capital.\nOn May 3, 2019, the Company entered into a Stock Purchase Agreement (the “2019 Stock Purchase Agreement”) with certain accredited investors, including certain independent investment funds, members of the Company’s management and its Board of Directors, and certain co-founders of the Company, in a private placement pursuant to which the Company sold an aggregate of 4,545,455 shares of common stock, par value $0.01 per share, at a purchase price of $1.10 per share. In connection with the 2019 Stock Purchase Agreement, the Company incurred $57,391 of expenses which has been recorded as a reduction of additional paid in capital as presented in the condensed consolidated statements of stockholders’ equity. The net proceeds to the Company at the closing of the private placement were $4.94 million.\n(19) RELATED PARTY TRANSACTIONS\nOn July 25, 2019, the Company entered into a Master Partnership Agreement with Minim Inc. (“Minim”), together with a related Statement of Work, License, Collaborative Agreement, Software/Service Availability Agreement and Software/Service Support Level Agreement (collectively, the “Partnership Agreement”). Under the Partnership Agreement, the Company will integrate Minim software and services into certain hardware products distributed by the Company, and Minim will be entitled to certain fees and a portion of revenue received from the end users of such services and software. The Company and Minim entered into an additional Statement of Work on December 31, 2019 providing for further integration of Minim services, with a monthly minimum payment of $5,000 payable by the Company to Minim starting in January 2020 for a period of thirty-six months and a requirement for Minim to purchase at least $90,000 of the Company’s hardware by December 2022. Minimum monthly payments under this agreement increased to $15,000 in July 2020.\nJeremy Hitchcock, who serves as Executive Chairman of the Company’s Board of Directors, is the co-founder, Chief Executive Officer and, prior to the Minim Merger, was a stockholder of Minim. During the fiscal years ended December 31, 2020 and 2019, $90 thousand and $0 payments were made by the Company to Minim under the Partnership Agreement. The Company recorded $105 thousand and $0 in expenses for the years ended December 31, 2020 and 2019, respectively. The Company sold $15 thousand of product to Minim for the year ended December 31, 2020. No services were provided in 2019. As of December 31, 2020, and 2019, no amounts were due from or to the Company under the Partnership Agreement.\nAs of the Minim Merger on December 4, 2020, the Partnership Agreement is not considered a related party transaction, and any transactions between the Company and Minim are considered intercompany transactions, which are eliminated in the consolidation of these financial statements.\nThe Company’s operating lease for its Manchester, NH office as described in Note 10 is leased from an affiliate entity that is owned by the Company’s Executive Chairman of the Board of Directors. The Company made payments of $2,770 from October 9, 2020 to December 31, 2020 under this operating lease.\nOn November 30, 2020, the Chief Executive Officer of the Company fully paid $264,000 to Minim for a promissory note related to the exercise of Minim stock options in December 2019 (Note 3).\nOn November 20, 2020, Minim agreed to repurchase 33,809 shares of Minim common stock for $14,860 from a stockholder who is an immediate family member to the Company’s executive chairman of the Board and subsequent to the Minim Merger became a member of the Company’s Board of Directors. The $14,860 remains unpaid as of December 31, 2020 (Note 3).\n(20) SUBSEQUENT EVENTS\nOn February 4, 2021, the Financing Agreement with Rosenthal & Rosenthal, Inc. was amended to increase the credit facility from $4.0 million to $5.0 million.\nOn March 12, 2021, the Company terminated its Financing Agreement with Rosenthal & Rosenthal, Inc. and entered into a new loan and security agreement with Silicon Valley Bank (“SVB Loan Agreement”). The SVB Loan Agreement provides for a revolving facility up to a principal amount of $12.0 million. The SVB Loan Agreement matures, and all outstanding amounts become due and payable on March 12, 2023. The SVB Loan Agreement is secured by substantially all of the Company’s assets but excludes the Company’s intellectual property. Loans under the credit facility bear interest at a rate per annum equal to (i) at all times when a streamline period is in effect, the greater of (a) one-half of one percent (0.50%) above the Prime Rate or (b) three and three-quarters of one percent (3.75%) and (ii) at all times when a streamline period is not effect, the greater of (a) one percent (1.0%) above the Prime Rate and (b) four and one-quarter of one percent (4.25%). Interest is payable monthly. The availability of borrowings under the SVB Loan Agreement is subject to certain conditions and requirements, and the borrowing base amount is up to (a) 85% of eligible accounts receivable balances plus (b) the least of (i) 60% of eligible inventory, (ii) 85% of net orderly liquidation value, and (iii) $4.8 million. In conjunction with the SVB Loan Agreement, the Company secured a $1.0 million commercial credit card line.\nOther than above, management of the Company has reviewed subsequent events from December 31, 2020 through the date of filing and has concluded that there were no other subsequent events requiring adjustment to or disclosure in these consolidated financial statements."
}