{
    "cik": "1506439",
    "company": "SharpSpring, Inc.",
    "filing_type": "10-K",
    "filing_date": "2021-03-30",
    "period_of_report": "2020-12-31",
    "sic": "7372",
    "state_of_inc": "DE",
    "state_location": "FL",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1506439/0001654954-21-003521-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1506439/000165495421003521/shsp_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1506439/0001654954-21-003521.txt",
    "filename": "1506439_10K_2020_0001654954-21-003521.htm",
    "item_1": "ITEM 1. BUSINESS\nOverview\nSharpSpring, Inc. (the “Company”) is a cloud-based marketing technology company. The SharpSpring platform is designed to improve the way that businesses communicate with their prospects and customers to increase sales. The Company’s flagship Marketing Automation platform uses advanced features such as web tracking, lead scoring and automated workflow to help businesses deliver the right message to the right customer at the right time. The SharpSpring platform is designed and built as a Software as Service (or SaaS) offering. We provide our products on a subscription basis, with additional fees charged if specified volume limits are exceeded by our customers.\nThe Company’s Perfect Audience platform expands our product and service offering into advertisement retargeting for small businesses. The Perfect Audience platform employs a usage-based revenue model. Revenue from this platform is dependent on the number of ads placed through the platform and the effectiveness of that ad space.\nWe operate globally through SharpSpring, Inc., a Delaware corporation, and our wholly owned subsidiaries that consist of (i) SharpSpring Technologies, Inc., a Delaware corporation; (ii) SharpSpring Reach, Inc., a Delaware corporation; (iii) InterInbox SA, a Swiss corporation; (iv) ERNEPH 2012A (Pty) Ltd., a South African limited company; (v) ERNEPH 2012B (Pty) Ltd., a South African limited company; and (vi) SMTP Holdings S.a.r.l., a Luxembourg S.a.r.l. Unless the context otherwise requires, all references to the “Company,” “we,” “our” or “us” and other similar terms means SharpSpring, Inc., and its subsidiaries.\nProducts and Services\nSharpSpring\nWe provide SaaS-based marketing technologies to customers around the world. Our focus is on marketing automation tools that enable customers to interact with a lead from an early stage and nurture that potential customer using advanced features until it becomes a qualified sales lead or customer. Our platform also includes customer relationship management (CRM) technology that enables a business to store, manage, and optimize customer and prospect data in a cloud-based environment.\nSharpSpring Mail+\nOur SharpSpring Mail+ product is a subset of the full suite solution that is focused on more traditional email marketing while also including some of the advanced functionality available in our premium offering. A small portion of our customers utilize our SharpSpring Mail+ product.\nPerfect Audience\nOur Perfect Audience platform is a product and service offering to small businesses for display retargeting. Perfect Audience is designed for rapid deployment and offers customers an easy-to-use interface to implement and optimize campaigns across all major networks and devices.\nMarkets & Competition\nOur SharpSpring products compete primarily in the marketing automation, revenue growth, and advertisement retargeting markets. The market for marketing automation software and related solutions is evolving and highly competitive with expected competition to increase as barriers decrease as does complexity of the technology decreases. SharpSpring entered the market in 2014 with a highly competitive offering that achieved meaningful customer adoption in its first few years after launch. As of December 31, 2020, the SharpSpring platforms collectively had over 3,500 paying customers and over 10,000 businesses using the platform, including agencies, agency clients, and direct end-user customers.\nSharpSpring\nWe face competition from cloud-based software and SaaS companies, including HubSpot, Act-On, Pardot (part of Salesforce.com), and ActiveCampaign for our flagship Marketing Automation platform. We differentiate ourselves from the competition with the integration of specific tools designed for digital marketing agencies, and with SharpSpring’s advanced features, ease of use, platform flexibility, and value compared to other competitive offerings. SharpSpring is designed as a solution for small or mid-sized businesses but focuses on selling to marketing agencies, who serve as partners providing a distribution channel to their clients.\nThe majority of SharpSpring customers are digital marketing agencies. A digital marketing agency is a firm that specializes in helping clients, usually small or mid-sized businesses, with their digital marketing initiatives like websites, email marketing, search engine optimization, social campaigns, pay-per-click advertising and other digital lead generation activities. We have built special tools in the SharpSpring application to allow agencies to manage their clients on the platform and optimize their efforts across their portfolio. We also have special pricing to agency customers to allow them the flexibility to resell the platform at a profit and manage their client relationships. In general, when we sell SharpSpring to an agency customer, we provide the agency with a SharpSpring license for the agency to use, plus a 3-pack of client licenses for the agency to deploy to their client base. This agency license and the pack of licenses are generally sold for a monthly recurring fee, plus an up-front onboarding fee. The agency has complete discretion over the pricing of the platform to their clients for the use, implementation, and services related to SharpSpring. If an agency utilizes its pack of licenses and adds additional clients on to the platform, there is a monthly per-client fee charged to the agency based on the number of additional licenses the agency has deployed to their clients. Additionally, we charge customers for certain items if the volume or transactional limits are exceeded, such as emails sent, or contacts stored in the platform. In most cases, we provide support to the agency and the agency provides support to their clients on the platform. However, for additional fees, we can provide product support to the agency’s client directly. Our objective is to partner with the agencies to grow and expand our businesses together using the SharpSpring platform.\nApproximately one-fifth of our Marketing Automation customers are individual businesses that have licensed SharpSpring directly without working through an agency. We refer to these customers as “Direct Customers.” Similar to agency customers, Direct Customers pay a monthly subscription fee for the use of the platform, plus an up-front onboarding fee. Additionally, we charge Direct Customers additional transactional charges based on usage over certain limits.\nSharpSpring Mail+\nSharpSpring Mail+ provides customers with an advanced email marketing and marketing automation tool. It includes traditional email campaign management solutions like design capabilities, reporting tools and list management functionality, but also includes additional features like dynamic email content and SharpSpring’s visitor ID tool that are more typically found in a marketing automation solution. SharpSpring Mail+ competes with companies such as Constant Contact, iContact Corporation, The Rocket Science Group, LLC (MailChimp®), and VerticalResponse, Inc., a subsidiary of Deluxe Corporation, as well as other email and marketing automation companies. SharpSpring Mail+, and most other vendors, typically charge a monthly fee or a fee per number of emails sent and, in some cases, they have a free offering for low-volume or non-profit customers. SharpSpring Mail+’s rich feature set is the primary key market differentiator.\nPerfect Audience\nThe Perfect Audience platform was acquired in November of 2019 to enhance the Company’s product and service offering. The Perfect Audience cloud-based platform enables multi-channel retargeting to known leads, plus targeted advertising to new prospects via lookalike audience functionality. It empowers marketers to create, manage, and optimize their ad campaigns across thousands of sites all within one, simple-to-use interface. Perfect Audience adds powerful lead functionality that fuels top-of-the-funnel lead generation efforts, plus additional lead nurturing capabilities to maximize middle-of-the-funnel conversion. These features complement SharpSpring’s core feature set designed to track, nurture, and convert those leads into sales.\nWe are part of a continually evolving and highly competitive marketplace. Most of our competitors have more extensive customer bases, broader customer relationships, longer operating histories, and greater name recognition than we have. Additionally, some of our current and potential competitors have significantly more financial, technical, marketing and other resources than we have, and are able to devote greater resources to the development, promotion, sale and support of their products and services. We face competition from AdRoll, Criteo, Facebook, Google, and The Trade Desk, as well as other online advertising companies. Barriers to entry exist in the advertising retargeting market due to complexity of systems but are decreasing as technology complexity decreases.\nSales and Marketing\nWe sell our products globally, through our internal sales teams, and to a lesser extent, third party resellers. We use and rely on our own SharpSpring Marketing Automation platform to help our business generate leads, convert more leads to sales and monitor the effectiveness of all our marketing campaigns. Our website www.sharpspring.com serves as a lead generation source and we use a variety of other digital marketing tools and marketing campaigns to attract new customers.\nOur SharpSpring product sales process involves targeting customers, completing product demos, and advancing customers through our marketing and sales pipeline to conversion using our SharpSpring Marketing Automation product. Since SharpSpring was launched fairly recently in 2014, brand recognition today is growing, but still fairly limited. Therefore, we are more reliant on our marketing campaigns and search engine traffic to attract potential leads. Nearly all of our marketing efforts to date have been focused on digital marketing agencies, and as of December 31, 2020 we have approximately 2,000 marketing agency partners. These agencies become customers and are able to resell SharpSpring to their clients, while paying increased fees to us as their client count expands beyond the base license pack. This allows the agency to provide services and first-level support for their clients, which increases their own revenues from the end client and creates a longer-lasting relationship overall between the agency and client. We also sell SharpSpring directly to end-users and have over 500 direct end user customers on the platform. The Company’s sales are done primarily through internal resources, but a small number of third-party resellers were also used during 2020.\nThe SharpSpring Mail+ product was created in 2016 to migrate GraphicMail customers to the SharpSpring platform. Since that time, we spent limited resources marketing and selling SharpSpring Mail+ as a standalone product and we discontinued its sale to new customers during early 2018. We currently intend to continue supporting SharpSpring Mail+, but may decide to discontinue the SharpSpring Mail+ product altogether in the future.\nCustomers\nAs of December 31, 2020, we had approximately 2,500 customers for our SharpSpring product, the majority of which were marketing agencies who resell SharpSpring to their clients.\nAs of December 31, 2020, we had approximately 600 customers using our SharpSpring Mail+ product.\nAs of December 31, 2020, we had approximately 600 customers using our Perfect Audience platform.\nThe vast majority of our SharpSpring Marketing Automation customers are on month-to-month agreements and are generally charged in arrears. We have a small number of customers that prepay for longer periods, such as quarterly or annually. Perfect Audience customers generally are on month-to-month agreements and pay a deposit in advance of the service being provided. They are subsequently charged for usage of the platform at the time of use.\nTechnology & Technology Suppliers\nSharpSpring operates as a multi-tenant Software-as-a-service (or “SaaS”) application. SharpSpring’s key features include web tracking, customer relationship management, lead scoring and nurturing, landing pages, email technology, rule-based triggers and notifications and deep analytics to measure marketing program return on investment (ROI). In addition to our technology platform, we offer value to our customers by providing integrations with other technology platforms. SharpSpring Mail+ is a subset of the SharpSpring technology.\nPerfect Audience is separate standalone platform that provides multi-channel retargeting to known leads, plus targeted advertising to new prospects via lookalike audience functionality. It empowers marketers to create, manage, and optimize their ad campaigns across thousands of sites using Google, Facebook, Instagram, leading ad exchanges and partner networks. Ads placed via the platform can be seamlessly dispersed and measured across every major advertising network, including Google, Facebook, Yahoo!, AppNexus, Rubicon, Xandr, and Smaato, providing the tools marketers need to drive incremental leads and sales, while tracking the ROI of their ad spend. With multiple ad networks at their disposal, users can select the best channels for their business’ needs.\nOur platforms are hosted in third party data centers on virtual cloud-based infrastructure. During 2020, these providers included Google Compute and Amazon Web Services. These data centers use a mixture of biometric access controls, redundant power, environmental controls and secure internet connection points to ensure uptime and data security. Email sending technology is a key part of the application, and we rely on a third party to deliver our platform’s email. We monitor our services for availability, performance and security. We rely on our data center and service providers to maintain peak operating conditions in their businesses and to quickly address issues related to their service as they arise.\nKey Performance Indicators\nIn addition to financial performance, we measure the performance of several key performance indicators, including:\n·\nCustomer acquisition costs (CAC)\n·\nNet revenue dollar retention\n·\nAverage revenue per user (ARPU)\n·\nExpected lifetime value (LTV)\nIntellectual Property\nThe Company has one patent for developed technology related to the Perfect Audience platform. This patent has a remaining life of approximately 15 years as of December 31, 2020.\nOur trade secrets include our competencies in marketing automation, web tracking, integrations, workflow, email editing and display retargeting.\nWe registered “SharpSpring” and the related logo and certain other marks as trademarks in the United States and several other jurisdictions.\nWe are the registered holder of a variety of domestic and international domain names that include “sharpspring”, “sharpspringmailplus”, “graphicmail”, “perfectaudience”, and similar variations.\nHuman Capital Management\nOur people are what makes SharpSpring not only a successful company, but also a great place to work. We are motivated by doing great things with great people to achieve a common goal of providing value to our customers through the power of marketing automation. Helping our thousands of customers grow their business is made possible by our employees continually improving each and every part of what we do.\nAs of December 31, 2020, we have approximately 250 full-time employees located in the United States supporting our operations. None of our employees are covered by collective bargaining agreements. We have not experienced any work stoppages, and we consider our relations with our employees to be good.\nWe provide competitive compensation and benefits for our employees across the United States. Our compensation packages may include base salary, commission or quarterly bonuses, and stock-based compensation. We also offer a generous benefits package which includes medical, vision, and dental plans, four weeks of paid time off, life and disability insurance, and a 401(k) matching contributions program designed to provide employee benefits competitive with those offered by our peers and other companies with which we compete for talent. We regularly evaluate our compensation and benefit offerings to ensure competitiveness and make adjustments as needed.\nSharpSpring is a diverse and inclusive work environment that promotes partnership in and outside of the office. We believe our Company culture fosters a sense of family that allows us to attract and retain the best talent, which is critical to our continued success. We embrace teamwork and investing in each other’s success, rewarding employees for their hard work and dedication. We take pride in our employees communicating openly, providing the highest level of customer support, developing a product that creates value for our customers, being a leading-edge workplace with a small-town feel, and giving back to our community. SharpSpring has launched various initiatives to ensure our entire staff feels respected and included regardless of their background. Every quarter we ask our employees to complete an employee engagement survey, which covers overall employee morale, team dynamics, work from home, and other topics to ensure our employees are staying engaged and are supported to the best of our abilities. Our most recent survey results showed that the vast majority of our employees feel supported, valued, and have the resources they need to be successful in their career.\nIn an effort to protect the safety and well-being of our employees, during the outset of the COVID-19 pandemic, we transitioned to a fully remote workforce in March of 2020, and we continue to successfully operate in a remote environment today until we can safely return to our office. Even once it is safe to return to the office, SharpSpring will allow employees to work remotely, from our corporate headquarters, or a hybrid of the two options. At the onset of COVID we were unsure what lay ahead for not only our Company, but the global economy. As such we asked staff to take temporary take a pay cut, with executives taking deeper cuts, as well as temporarily pausing our Company bonus and 401(k) Company match program. Full salaries and bonuses for all employees were restored in November of 2020. The 401(k) Company match program was restored in March of 2021.\nProperties\nOur corporate headquarters is a leased office facility located in Gainesville, FL. Presently, we lease approximately 45,000 rentable square feet of office space.\nFinancial Information About Segments\nThe Company operates as one reportable segment with two operating segments. Our operating segments consist of our SharpSpring Marketing Automation segment and Perfect Audience Ad Retargeting segment in accordance with ASC 280. Operating segments are defined as components of an enterprise for which separate financial information is regularly evaluated by the chief operating decision maker (“CODM”), which is the Company’s chief executive officer, in deciding how to allocate resources and assess performance. The Company’s CODM evaluates the Company’s financial information and resources and assess the performance of these resources between our two operating segments. We do not separately allocate operating expenses, nor do we fully allocate assets to these operating segments. In accordance with ASC 280, we aggregate our two operating segments as one operating segment for financial reporting purposes. The Company does not present geographical information about revenues because it is impractical to do so.\nThe SharpSpring Marketing Automation segment consists of all revenue related to our flagship Marketing Automation product as well as our Mail+ and CRM products.\nOur Perfect Audience Ad Retargeting segment consists of all revenues associated with our Perfect Audience ad retargeting platform.\nAvailable Information\nOur website address is www.sharpspring.com. Our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13 or 15(d) of the Exchange Act are available free of charge through our website as soon as reasonably practicable after they are electronically filed with, or furnished to, the Securities and Exchange Commission (the “SEC”). Our website and the information contained or incorporated therein are not intended to be incorporated into this Annual Report on Form 10-K.\nAlso, this report includes the trade names of other companies. Unless specifically stated otherwise, the use or display by us of such other parties' names and trade names in this report is not intended to and does not imply a relationship with, or endorsement or sponsorship of us by, any of these other parties.",
    "item_1A": "ITEM 1A. RISK FACTORS\nAn investment in our common stock involves a high degree of risk. You should carefully consider the risks described below and the other information in this Annual Report on Form 10-K and in our other public filings before making an investment decision. Our business, prospects, financial condition, or operating results could be harmed by any of these risks, as well as other risks not currently known to us or that we currently consider immaterial. If any such risks and uncertainties actually occurs, our business, financial condition or operating results could differ materially from the plans, projections and other forward-looking statements included in the section titled “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and elsewhere in this report and in our other public filings. The trading price of our common stock could decline due to any of these risks, and, as a result, you may lose all or part of your investment.\nSummary of Risk Factors\nThe risk factors detailed in Item 1A entitled “Risk Factors” in this Annual Report on Form 10-K are the risks that we believe are material to our investors and a reader should carefully consider them. Those risks are not all of the risks we face, and other factors not presently known to us or that we currently believe are immaterial may also affect our business if they occur. The following is a summary of the risk factors detailed in Item 1A:\n·\nWe have a history of losses and may not achieve profitability in the future.\n·\nThe extent to which the COVID-19 pandemic will adversely impact our business, financial condition and results of operations is highly uncertain and cannot be predicted.\n·\nThe majority of our products and services are sold pursuant to short-term subscription agreements, and if our customers elect not to renew these agreements, our revenues may decrease.\n·\nIf we fail to enhance our existing products and services or develop new products and services, our products and services may become obsolete or less competitive and we could lose customers.\n·\nInterruptions or delays in service from our third-party data center providers could impair our ability to deliver our platform to our customers, resulting in customer dissatisfaction, damage to our reputation, loss of customers, limited growth and reduction in revenue.\n·\nExisting and future federal, state and foreign laws which regulate Internet tracking software, the senders of commercial emails and text messages, website owners and other activities, and could impact the use of our marketing tools which may negatively affect our business.\n·\nWe may need additional capital in the future, which may not be available to us on favorable terms, or at all, and may dilute your ownership of our common stock.\n·\nOur quarterly results may fluctuate and if we fail to meet the expectations of analysts or investors, our stock price could decline substantially.\nRisks Related To Our Business\nThe majority of our products and services are sold pursuant to short-term subscription agreements, and if our customers elect not to renew these agreements, our revenues may decrease.\nTypically, our products and services are sold pursuant to short-term subscription agreements, which are generally one month to one year in length, with no obligation to renew these agreements. Our renewal rates may decline due to a variety of factors, including the products and services and prices offered by our competitors, new technologies offered by others, consolidation in our customer base or if some of our customers cease their operations. If our renewal rates are low or decline for any reason, or if customers renew on less favorable terms, our revenues may decrease, which could adversely affect our results of operations.\nWe may not be able to scale our business quickly enough to meet our customers' growing needs, and if we are not able to grow efficiently, our operating results could be harmed.\nAs usage of our marketing software grows and as customers use our solutions for more advanced relationship marketing programs, we will need to devote additional resources to improving our application architecture, integrating with third-party systems, and maintaining infrastructure performance. In addition, we will need to appropriately scale our internal business systems and our services organization, including customer support and professional services, to serve our growing customer base, particularly as our customer demographics expand over time. Any failure of or delay in these efforts could cause impaired system performance and reduced customer satisfaction. These issues could reduce the attractiveness of our marketing software to customers, resulting in decreased sales to new customers, lower renewal rates by existing customers, the issuance of service credits, or requested refunds, which could adversely affect our revenue growth and harm our reputation. Even if we are able to upgrade our systems and expand our staff, any such expansion will be expensive and complex, requiring management time and attention. We could also face inefficiencies or operational failures as a result of our efforts to scale our infrastructure. Moreover, there are inherent risks associated with upgrading, improving and expanding our information technology systems. We cannot be sure that the expansion and improvements to our infrastructure and systems will be fully or effectively implemented on a timely basis, if at all. These efforts may reduce revenue and our margins and adversely affect our financial results.\nWe rely, in large part, on our agency partners’ ability to resell the SharpSpring solution to their clients and service and support their clients that are using the SharpSpring platform.\nWe sell primarily to digital marketing agencies, who purchase a pack of SharpSpring licenses and resell SharpSpring to their end clients. Our agency partners typically perform various services for their clients, including website services, lead generation activities, social media services and other digital marketing services. If our agency partners are not successful in reselling SharpSpring to their clients or are not successful in supporting or servicing their active clients on the SharpSpring platform, the value of our agency partner relationships will not grow, and those agency partners will have a higher risk of attrition. If we cannot retain these agency partners as SharpSpring customers, our revenue and operating performance will be adversely impacted.\nThe extent to which the COVID-19 pandemic will adversely impact our business, financial condition and results of operations is highly uncertain and cannot be predicted.\nThe COVID-19 pandemic has created significant worldwide uncertainty, volatility and economic disruption. The extent to which COVID-19 will adversely impact our business, financial condition and results of operations is dependent upon numerous factors, many of which are highly uncertain, rapidly changing and uncontrollable. These factors include, but are not limited to: (i) the duration and scope of the pandemic; (ii) governmental, business and individual actions that have been and continue to be taken in response to the pandemic, including travel restrictions, quarantines, social distancing, work-from-home and shelter-in-place orders and shut-downs; (iii) the impact on U.S. and global economies and the timing and rate of economic recovery; (iv) potential adverse effects on the financial markets and access to capital; (v) potential goodwill or other impairment charges; (vi) increased cybersecurity risks as a result of pervasive remote working conditions; (vii) our ability to effectively carry out our operations due to any adverse impacts on the health and safety of our employees and their families; (viii) the ability of our agency partners to resell the SharpSpring Marketing Automation platform to their clients. Furthermore, as a result of the COVID-19 pandemic, our employees have been predominantly working from home. The significant increase in remote working, particularly for an extended period of time, could exacerbate certain risks to our business, including an increased risk of cybersecurity events and improper dissemination of personal or confidential information. We do not believe these circumstances have, or will, materially adversely impact our internal controls or financial reporting systems.\nIf we fail to enhance our existing products and services or develop new products and services, our products and services may become obsolete or less competitive and we could lose customers.\nIf we are unable to enhance our existing products and services or develop new products and services that keep pace with rapid technological developments and meet our customers’ needs, our business will be harmed. Creating and designing such enhancements and new products entail significant technical and business risks and require substantial expenditures and lead-time, and there is no guarantee that such enhancements and new products will be completed in a timely fashion. Nor is there any guarantee that any new service offerings will gain acceptance among our customers or by the broader market. For example, our existing customers may not view any new service as complementary to our service offerings and therefore decide not to purchase such service. If we cannot enhance our existing products and services or develop new products or if we are not successful in selling such enhancements and new products to our customers, we could lose customers, which would adversely impact our financial performance.\nIf we are unable to attract new customers and retain existing customers on a cost-effective basis, our business and results of operations will be adversely affected.\nTo succeed, we must continue to attract and retain a large number of customers on a cost-effective basis, many of whom have not previously used the types of products and services that we offer. Our sales process involves targeting customers, completing product demos and advancing customers through our marketing and sales pipeline to conversion using our SharpSpring Marketing Automation product, in addition to relying on outbound marketing and search engine traffic to attract potential leads. We rely on a variety of methods to attract new customers, such as outbound emails, hosting events, paying providers of online services, search engines, directories and other websites to provide content, advertising banners and other links that direct customers to our website. If we are unable to use any of our current marketing initiatives or the cost of such initiatives were to significantly increase or such initiatives or our efforts to satisfy our existing customers are not successful, we may not be able to attract new customers or retain existing customers on a cost-effective basis and, as a result, our revenue and results of operations would be adversely affected.\nIf we fail to develop our brands cost-effectively, our business may be adversely affected.\nSuccessful promotion of our brands will depend largely on the effectiveness of our marketing efforts and on our ability to provide reliable and useful services at competitive prices. Brand promotion activities may not yield increased revenue, and even if they do, any increased revenue may not offset the expenses we incur in building our brands. If we fail to successfully promote and maintain our brands, or incur substantial expenses in an unsuccessful attempt to promote and maintain our brands, we may fail to attract enough new customers or retain our existing customers to the extent necessary to realize a sufficient return on our brand-building efforts, and our business and results of operations could suffer.\nEmail communications is a key component of our product. At times, delivery of our emails has been impaired by third party monitoring agencies and internet service providers. If the delivery of our customers’ emails is limited or blocked, our product’s capabilities would be severely limited, and customers may cancel their accounts.\nMany SharpSpring users aim to communicate using email with a broad range of customers and prospects. Our policies limit the use of email to recipients who have agreed to receive email from that business. However, it is often difficult to enforce the use of opt-in email lists and in some cases, our customers disregard our policies and send emails to purchased lists, which may include spam traps put in place by monitoring agencies. Those same monitoring agencies can block emails from reaching individuals that use their spam email protection services. Additionally, internet service providers (ISPs) also filter email based on email characteristics and spam complaint rates. Although we work with one of the premier email delivery providers, recent aggressive actions by monitoring agencies and ISPs make it more difficult to protect our email sending reputation and deliver our customers’ emails to the recipient. We continually monitor and improve our own technology and work closely with ISPs to maintain our high deliverability rates. If third party agencies or ISPs materially limit or halt the delivery of our customers’ emails, or if we fail to deliver our customers’ emails in an acceptable manner, our customers may cancel their accounts.\nWe rely on third-party vendors to provide services to crucial parts of our business. If the relationship with these vendors deteriorates or is terminated it may harm our ability to provide our software or services to our customers.\nSharpSpring depends on the services of third-party vendors to deliver data and provide our software and services. In the future if any of these third-party services are interrupted or terminated our ability to continue provide service to our customers will deteriorate. Any such deterioration could adversely affect our business and our ability to generate revenue. Presently, the strain of coronavirus known as COVID-19 has the potential to interrupt many, if not all, of the third-party vendors upon which we rely.\nOur inability to successfully integrate our Perfect Audience business or other acquired businesses, assets, products or technologies which could harm our operating results.\nWe acquired from Marin Software Incorporated the assets and certain liabilities that comprise our Perfect Audience platform in November 2019. As part of this acquisition, we negotiated certain services to facilitate the smooth transition of the Perfect Audience business. We have limited experience in successfully acquiring and integrating businesses, products and technologies, and we may not achieve the synergies or other benefits we expected to achieve, and we may incur write-downs, impairment charges or unforeseen liabilities that could negatively affect our operating results or financial position or could otherwise harm our business.\nWe may in the future evaluate and pursue other acquisitions and strategic investments in businesses, products or technologies that we believe could complement or expand our existing solutions, expand our customer base and operations worldwide, enhance our technical capabilities or otherwise offer growth or cost-saving opportunities. From time to time, we may enter into letters of intent with companies with which we are negotiating potential acquisitions or investments or as to which we are conducting due diligence. Although we are currently not a party to any binding definitive agreement with respect to potential investments in, or acquisitions of, complementary businesses, products or technologies, we may enter into these types of arrangements in the future, which could materially decrease the amount of our available cash or require us to seek additional equity or debt financing. We have limited experience in successfully acquiring and integrating businesses, products and technologies. We may not be successful in negotiating the terms of any potential acquisition, conducting thorough due diligence, financing the acquisition or effectively integrating the acquired business, product or technology into our existing business and operations. Our due diligence may fail to identify all of the problems, liabilities or other shortcomings or challenges of an acquired business, product or technology, including issues related to intellectual property, product quality or product architecture, regulatory compliance practices, revenue recognition or other accounting practices, or employee or customer issues.\nIf we finance acquisitions using existing cash, the reduction of our available cash could cause us to face liquidity issues or cause other unanticipated problems in the future. If we finance acquisitions by issuing convertible debt or equity securities, the ownership interest of our existing stockholders may be diluted, which could adversely affect the market price of our stock. Further, contemplating or completing an acquisition and integrating an acquired business, product or technology could divert management and employee time and resources from other matters.\nOur international operations subject us to additional risks and uncertainties.\nWe have customers in various international jurisdictions. Our international operations present unique challenges and risks to our Company. Compliance with complex foreign and U.S. laws and regulations that apply to our international operations increases our cost of doing business in international jurisdictions and could interfere with our ability to offer our products and services to one or more countries or expose us or our employees to fines and penalties. These laws and regulations include, but are not limited to, tax laws, data privacy and filtering requirements, U.S. laws such as the Foreign Corrupt Practices Act, and local laws prohibiting corrupt payments to governmental officials. Violations of these laws and regulations could result in monetary damages, criminal sanctions against us, our officers, or our employees, and prohibitions on the conduct of our business. Our international operations also subject us to additional foreign currency exchange rate risks and will require additional management attention and resources. Our international operations subject us to other inherent risks, including, but not limited to:\n·\nthe impact of recessions in economies outside of the United States\n·\nchanges in and differences between regulatory requirements between countries\n·\nThe extent of the impact of the novel strain of coronavirus known as COVID-19 on global commerce\n·\nU.S. and foreign export restrictions, including export controls relating to encryption technologies\n·\nanti-SPAM laws and other laws that may differ materially from U.S. laws\n·\nreduced protection for and enforcement of intellectual property rights in some countries\n·\npotentially adverse tax consequences\n·\ndifficulties and costs of staffing and managing foreign operations\n·\npolitical and economic instability\n·\ninternational conflicts, wars or terrorism\n·\ntariffs and other trade barriers\n·\nseasonal reductions in business activity\nOur failure to address these risks adequately could materially and adversely affect our business, revenue, results of operations, cash flows and financial condition.\nWe could be materially affected by the fluctuations of the U.S. Dollar against the Euro, Swiss Franc, South African Rand or British Pound.\nIn 2020, approximately 85% of our revenues are currently generated in U.S. Dollars, while approximately 15% of our revenues are denominated in other currencies, including, but not limited to the Euro, Swiss Franc, South African Rand and British Pound. Our costs are generally incurred in similar currencies. Currency exchange rates can fluctuate dramatically, which will impact the amount of revenue we will record when translated to U.S. Dollars and will impact the amount of costs that we incur when translated to U.S. Dollars. Although our cost currencies are generally aligned to our revenue currencies, variances exist between the rate we incur costs in each currency compared to the revenue. Therefore, changes to currency rates may dramatically impact profitability.\nThe United Kingdom's withdrawal from the European Union could have an adverse impact on our business, financial condition, operating results and cash flows.\nOn January 31, 2020, the United Kingdom (\"U.K.\") withdrew from the European Union (\"E.U.\"), commonly referred to as Brexit. The U.K. and E.U. agreed to participate in a transition period, which expired on December 31, 2020, to negotiate a trade agreement and other aspects of their future relationship. The U.K. is now no longer a part of the single market and customs union of the E.U.\nAlthough post Brexit, a trade agreement between the U.K. and E.U. is in effect, the economic path forward is uncertain. This may cause fluctuations in the value of the U.K. pound sterling and E.U. euro. Fluctuations in exchange rates between the U.S. dollar and foreign currencies may adversely affect our expenses, earnings, cash flows, results of operations, and revenues. We do not engage in foreign currency hedging arrangements.\nIf we do not or cannot maintain the compatibility of our marketing software with third-party applications that our customers use in their businesses, our revenue will decline.\nThe functionality and popularity of our marketing software depends, in part, on our ability to integrate our solutions with third-party applications and platforms, including CRM, event management, e-commerce, call center, and social media sites that our customers use and from which they obtain data. Third-party providers of applications and APIs may change the features of their applications and platforms, restrict our access to their applications and platforms or alter the terms governing use of their applications and APIs and access to those applications and platforms in an adverse manner. Such changes could functionally limit or terminate our ability to use these third-party applications and platforms in conjunction with our solution, which could negatively impact our offerings and harm our business. If we fail to integrate our software with new third-party applications and platforms that our customers use for marketing purposes, we may not be able to offer the functionality that our customers need, which would negatively impact our ability to generate revenue and adversely impact our business.\nIf we are unable to maintain our relationships with, and access to, publishers, advertising exchange platforms and other platforms that aggregate the supply of advertising inventory, our business will suffer.\nWe currently depend on relationships with various publishers, including Facebook, Google, Xandr, OpenX, AppNexus, and Magnite (among others) Our display retargeting platform interfaces with these publishers’ platforms through Application Programming Interfaces (“APIs”). We are subject to the respective platforms’ standard API terms and conditions, which govern the use and distribution of data from these platforms. Our business significantly depends on having access to these APIs on commercially reasonable terms and our business would be harmed if any of these publishers, advertising exchanges or aggregators of advertising inventory discontinues or limits access to their platforms, modifies their terms of use or other policies or place additional restrictions on us as API users, or charges API license fees for API access. Moreover, some of these publishers, such as Google, market competitive solutions for their platforms. Because the advertising inventory suppliers control their APIs, they may develop competitive offerings that are not subject to the limits imposed on us through the API terms and conditions. Publishers, advertising exchanges and advertising inventory aggregators update their API terms of use from time to time and new versions of these terms could impose additional restrictions on us. In addition, publishers, advertising exchanges and advertising inventory aggregators continually update their APIs and may update or modify functionality, which requires us to modify our software to accommodate these changes and to devote technical resources and personnel to these efforts which could otherwise be used to focus on other priorities. Any of these outcomes could cause demand for our products to decrease, our research and development costs to increase, and our results of operations and financial condition to be harmed.\nIf the market for digital advertising slows or declines, our business, growth prospects, and financial condition would be adversely affected.\nThe Perfect Audience platform is dependent on the market for digital advertising. The future growth of our business could be constrained by the level of acceptance and expansion of emerging cloud-based advertising channels, as well as the continued use and growth of existing channels, such as search and display advertising. Even if these channels become widely adopted, advertisers and agencies may not make significant investments in solutions such as ours that help them manage their digital advertising spend across publisher platforms and advertising channels. It is difficult to predict customer adoption rates, customer demand for our platform, the future growth rate and size of the advertising cloud solutions market or the entry of competitive solutions. The continued expansion of the market for advertising cloud solutions depends on a number of factors, including the continued growth of the cloud-based advertising market, the growth of social and mobile as advertising channels and the cost, performance and perceived value associated with advertising cloud solutions, as well as the ability of cloud computing companies to address security and privacy concerns. Further, the cloud computing market is less developed in many jurisdictions outside the United States. If we or other cloud computing providers experience security incidents, loss of customer data, disruptions in delivery or other problems, the market for cloud computing as a whole, including our applications, may be negatively affected.\nThe market in which we participate is competitive and, if we do not compete effectively, our operating results could be harmed.\nOur principal competitors include marketing automation companies like HubSpot, Pardot (part of Salesforce.com), Act-On, and ActiveCampaign. Companies can also utilize various point solutions to provide individual marketing capabilities for things like email campaigns, landing pages, forms and analytics, which are all features in a marketing automation solution. Competition could result in reduced sales, reduced margins or the failure of our products to achieve or maintain more widespread market acceptance, any of which could harm our business.\nOur current and potential competitors may have significantly more financial, technical, marketing and other resources than we do and may be able to devote greater resources to the development, promotion, sale and support of their products. Our current and potential competitors may have more extensive customer bases and broader customer relationships than we have. In addition, these companies may have longer operating histories and greater name recognition than we have and may be able to bundle products with other products that have gained widespread market acceptance. These competitors may be better able to respond quickly to new technologies and to undertake more extensive marketing campaigns. If we are unable to compete with such companies, the demand for our products could substantially decline.\nOur business is substantially dependent on continued demand for marketing and email technology and any decrease in demand could cause us to suffer a decline in revenues and profitability.\nWe derive, and expect to continue to derive, substantially all of our revenue from organizations, including marketing agencies and small and medium size businesses, associations and non-profits. As a result, widespread acceptance of marketing technology among small and medium size organizations is critical to our future growth and success. The overall market for marketing automation technology is relatively new and still evolving, and small organizations have generally been slower than larger organizations to adopt email marketing as part of their marketing mix. There is no certainty regarding how or whether this market will develop, or whether it will experience any significant contractions. Our ability to attract and retain customers will depend in part on our ability to make marketing communications convenient, effective, and affordable. If small and medium size organizations determine that marketing technology and communication does not sufficiently benefit them, existing customers may cancel their accounts and potential customers may decide not to utilize our services.\nWe are a small public company and the requirements of being a public company are a strain on our systems and resources, are a diversion to management’s attention, and are costly.\nAs a public company, we are subject to the reporting requirements of the Securities Exchange Act of 1934 (Exchange Act) the Sarbanes-Oxley Act of 2002 (Sarbanes-Oxley Act), the Dodd-Frank Wall Street Reform and Consumer Protection Act (Dodd-Frank Act), and the rules and regulations of The NASDAQ Stock Market. The requirements of these rules and regulations increase our legal, accounting and financial compliance costs, make some activities more difficult, time-consuming and costly and may also place strain on our personnel, systems and resources.\nThe Exchange Act requires, among other things, that we file annual, quarterly and current reports with respect to our business and operating results. The Sarbanes-Oxley Act requires, among other things, that we maintain effective disclosure controls and procedures and internal control over financial reporting. We are continuing the costly process of implementing and testing our systems to report our results as a public company, to continue to manage our growth and to implement internal controls. We are and will continue to be required to implement and maintain various other control and business systems related to our equity, finance, treasury, information technology, other recordkeeping systems and other operations. As a result of this implementation and maintenance, management's attention may be diverted from other business concerns, which could adversely affect our business.\nIn addition, changing laws, regulations and standards relating to corporate governance and public disclosure are creating uncertainty for public companies, increasing legal and financial compliance costs and making some activities more time consuming. These laws, regulations and standards are subject to varying interpretations, in many cases due to their lack of specificity, and, as a result, their application in practice may evolve over time as new guidance is provided by regulatory and governing bodies. This could result in continuing uncertainty regarding compliance matters and higher costs necessitated by ongoing revisions to disclosure and governance practices. We intend to invest resources to comply with evolving laws, regulations and standards, and this investment may result in increased general and administrative expenses and a diversion of management's time and attention from revenue-generating activities to compliance activities. If our efforts to comply with new laws, regulations and standards differ from the activities intended by regulatory or governing bodies due to ambiguities related to their application and practice, regulatory authorities may initiate legal proceedings against us and our business may be adversely affected.\nWe expect these laws, rules and regulations to make it more difficult and more expensive for us to continue to obtain director and officer liability insurance, and we may be required to incur substantial costs to maintain appropriate levels of coverage. These factors could also make it more difficult for us to attract and retain qualified members of our board of directors, particularly to serve on our audit committee, and qualified executive officers.\nAs a result of being a public company, our business and financial condition is more visible, which we believe may result in threatened or actual litigation, including by competitors and other third parties. If such claims are successful, our business and operating results could be adversely affected, and even if the claims do not result in litigation or are resolved in our favor, these claims, and the time and resources necessary to resolve them, could divert the time and resources of our management and adversely affect our business and operating results.\nAs a smaller reporting company that is not an accelerated filer, we are subject to scaled disclosure requirements that may make it more challenging for investors to analyze our results of operations and financial prospects.\nAs a smaller reporting company that is not an accelerated filer we (i) are able to provide simplified executive compensation disclosures in our filings, (ii) are exempt from the provisions of Section 404(b) of the Sarbanes-Oxley Act requiring that independent registered public accounting firms provide an attestation report on the effectiveness of internal control over financial reporting and (iii) have certain other decreased disclosure obligations in our filings with the SEC, including being required to provide only two years of audited financial statements in annual reports. Consequently, it may be more challenging for investors to analyze our results of operations and financial prospects.\nWe will remain a smaller reporting company until the beginning of a fiscal year in which we had a public float of $250 million held by non-affiliates as of the last business day of the second quarter of the prior fiscal year, assuming our common stock is registered under Section 12 of the Exchange Act on the applicable evaluation date or our Company has annual revenues of less than $100 million and a public float of less than $700 million. However, even if we remain a smaller reporting company, if our public float exceeds $75 million and our annual revenues are greater than $100 million, we will become an accelerated filer and subject to the provisions of Section 404(b) of the Sarbanes-Oxley Act.\nWe may be subject to additional obligations to collect and remit sales tax and other taxes, and we may be subject to tax liability for past sales, which could harm our business.\nState, local and foreign jurisdictions have differing rules and regulations governing sales, use, value added and other taxes, and these rules and regulations are subject to varying interpretations that may change over time. In particular, the applicability of such taxes to SaaS products in various jurisdictions is unclear. Further, these jurisdictions’ rules regarding tax nexus vary significantly and are complex. As such, we could face possible tax assessments and audits. A successful assertion that we should be collecting additional sales, use, value added or other taxes in jurisdictions where we have not historically done so and do not accrue for such taxes could result in tax liabilities and related penalties for past sales, discourage customers from purchasing our products or otherwise harm our business and operating results.\nRisks Related To Our Management\nIf we fail to attract and retain key and other personnel, we may not be able to achieve our anticipated level of growth and our business could suffer.\nOur future depends, in part, on our ability to attract and retain key personnel. Our future also depends on the continued efforts and abilities of our executive officers, including our Chief Executive Officer and other key personnel, each of whom would be difficult to replace. In particular, Richard Carlson, our Chief Executive Officer and President and Travis Whitton, our Chief Technology Officer, are critical to the Company’s strategic direction and product development process. The loss of the services of Carlson, Whitton, or other key personnel, and the process to replace any of our key personnel, would involve significant time and expense and may significantly delay or prevent the achievement of our business objectives. We currently do not maintain key person life insurance on any of our executives. Accordingly, the loss of the services of any of these persons would adversely affect our business.\nWe believe that our future success will also depend in part on our continued ability to attract, hire or acquire and retain qualified employees and contractors. There can be no assurance that we will be able to attract and retain such resources. If we are unsuccessful in managing the timely delivery of these services, our business could be adversely affected.\nOur anticipated growth in our operations could place a significant strain on our management team and our administrative, operational and financial reporting infrastructure.\nOur success will depend in part on the ability of our management team to effectively manage our growth in our operations. To do so, we believe we will need to continue to hire, train and manage new employees as needed. If our new hires perform poorly, or if we are unsuccessful in hiring, training, managing and integrating these new employees, or if we are not successful in retaining our existing employees, our business may be harmed. To manage the expected growth of our operations and personnel, we will need to continue to improve our operational and financial controls and update our reporting procedures and systems. The expected addition of new employees and the capital investments that we anticipate will be necessary to manage our anticipated growth will increase our cost base, which will make it more difficult for us to offset any future revenue shortfalls by reducing expenses in the short term. If we fail to successfully manage our anticipated growth, our business operations could be adversely affected.\nRisks Related To Our Systems\nOur customers’ use of our products to transmit negative messages or website links to harmful applications could damage our reputation, and we may face liability for unauthorized, inaccurate or fraudulent information distributed via our services.\nAlthough it is against our terms and conditions, our customers could use our email servers to transmit negative messages or website links to harmful applications, reproduce and distribute copyrighted material without permission, or report inaccurate or fraudulent data or information. Any such use of our products could damage our reputation and we could face claims for damages, copyright or trademark infringement, defamation, negligence or fraud. Moreover, our customers’ promotion of their products and services through our email marketing product may not comply with federal, state and foreign laws. We cannot predict whether our role in facilitating these activities would expose us to liability under these laws.\nEven if claims asserted against us do not result in liability, we may incur substantial costs in investigating and defending such claims. If we are found liable for our customers’ activities, we could be required to pay fines or penalties, redesign business methods or otherwise expend resources to remedy any damages caused by such actions and to avoid future liability.\nVarious private spam blacklists have in the past interfered with, and may in the future interfere with, the effectiveness of our products and our ability to conduct business.\nOur customers rely on email to communicate with their constituents and we depend on email to market to and communicate with our customers. Various private entities attempt to regulate the use of email for commercial solicitation. These entities often advocate standards of conduct or practice that significantly exceed current legal requirements and classify certain email solicitations that comply with current legal requirements as spam. Some of these entities maintain “blacklists” of companies and individuals, and the websites, ISPs and internet protocol addresses associated with those entities or individuals that do not adhere to those standards of conduct or practices for commercial email solicitations that the blacklisting entity believes are appropriate. If a company’s internet protocol addresses are listed by a blacklisting entity, emails sent from those addresses may be blocked if they are sent to any Internet domain or Internet address that subscribes to the blacklisting entity’s service or purchases its blacklist. Although we do not own the internet protocol addresses that we use, blacklisting of the internet protocol addresses that the Company uses could materially impact our sending ability.\nOur facilities and systems are vulnerable to natural disasters and other unexpected events and any of these events could result in an interruption of our ability to execute customers’ email campaigns.\nWhile we have established contingency plans for certain potential disasters, it is possible that an unexpected disaster may occur, which could interrupt our ability to provide services. We also depend on the efficient and uninterrupted operations of our third-party data centers and hardware systems. The data centers and hardware systems are vulnerable to damage from earthquakes, tornados, hurricanes, fire, floods, power loss, telecommunications failures, public health emergencies, and similar events. If any of these events results in damage to our facilities or third-party data centers or systems, we may be unable to operate our services until the damage is repaired or the disruption is remedied and may accordingly lose customers and revenues. In addition, subject to applicable insurance coverage, we may incur substantial costs in repairing any damage.\nSystem failures could reduce the attractiveness of our service offerings, which could cause us to suffer a decline in revenues and profitability.\nThe satisfactory performance, reliability and availability of the technology and the underlying network infrastructure are critical to our operations, level of customer service, reputation and ability to attract and retain customers. We have experienced periodic interruptions, affecting all or a portion of our systems, which we believe will continue to occur from time to time. We are not aware of any loss of customers due to material service interruptions. However, any systems damage or interruption that impairs our ability to accept and fill customer orders could result in an immediate loss of revenue to us and could cause some customers to purchase services offered by our competitors. In addition, frequent systems failures could harm our reputation. Some factors that could lead to interruptions in customer service include: operator negligence; improper operation by, or supervision of, employees; physical and electronic break-ins; misappropriation; computer viruses and similar events; power loss; computer systems failures; Internet and telecommunications failures; and public health emergencies. Our business interruption insurance may not be sufficient to fully compensate us for losses that may occur.\nAny significant disruption in service on our websites or in our computer systems, or in our customer support services, could reduce the attractiveness of our products and result in a loss of customers.\nThe satisfactory performance, reliability and availability of our technology and our underlying network infrastructure are critical to our operations, level of customer service, reputation and ability to attract new customers and retain existing customers. Our production system hardware and the disaster recovery operations for our production system hardware are co-located in third-party hosting facilities. None of the companies who host our systems guarantee that our customers’ access to our products will be uninterrupted, error-free or secure. Our operations depend on their ability to protect their and our systems in their facilities against damage or interruption from natural disasters, power or telecommunications failures, air quality, temperature, humidity and other environmental concerns, computer viruses or other attempts to harm our systems, criminal acts and similar events. In the event that our arrangements with third-party data centers are terminated, or there is a lapse of service or damage to their facilities, we could experience interruptions in our service as well as delays and additional expense in arranging new facilities. Any interruptions or delays in access to our services, whether as a result of a third-party error, our own error, natural disasters or security breaches, whether accidental or willful, could harm our relationships with customers and our reputation. Also, in the event of damage or interruption, our insurance policies may not adequately compensate us for any losses that we may incur. These factors could damage our brand and reputation, divert our employees’ attention, reduce our revenue, subject us to liability and cause customers to cancel their accounts, any of which could adversely affect our business, financial condition and results of operations.\nRelied upon third-party cloud computing services, could cause errors or failures of our service, which could cause us to suffer a decline in revenues and profitability.\nWe rely on cloud computing services from third parties that we do not control in order to offer our products, including Google Compute, Amazon Web Services, and others. If we lose the right to use these services or the service malfunctions, our customers could experience delays or be unable to access our services until we can obtain and integrate equivalent technology, or a repair is made. Any delays or failures associated with our services could upset our customers and harm our business.\nIf we are unable to protect the confidentiality of our unpatented proprietary information, processes and know-how and our trade secrets, the value of our technology and services could be adversely affected.\nWith one limited exception related to our retargeting platform, we rely upon unpatented proprietary technology, processes and know-how and trade secrets for our Marketing Automation solution and retargeting platform and we do not have plans to file for additional patent protection. Further, even if we file for additional patent protection, there is no assurance that it will be approved by the US Patent and Trademark Office. Although we try to protect this information in part by executing confidentiality agreements with our employees, consultants and third parties, such agreements may offer only limited protection and may be breached. Any unauthorized disclosure or dissemination of our proprietary technology, processes and know-how or our trade secrets, whether by breach of a confidentiality agreement or otherwise, may cause irreparable harm to our business, and we may not have adequate remedies for any such breach. In addition, our trade secrets may otherwise be independently developed by our competitors or other third parties. If we are unable to protect the confidentiality of our proprietary information, processes and know-how or our trade secrets are disclosed, the value of our technology and services could be adversely affected, which could negatively impact our business, financial condition and results of operations.\nOur use of open source software could impose limitations on our ability to commercialize our products, which could cause us to suffer a decline in revenues and profitability.\nCustomizations to open source software code generally require developers to make their work available at no cost. Since we have created our software by developing extensions which plug into open source software without modifying the open source code, we do not believe there is a risk we could be required to offer our products or make our source code available. Although we monitor our use of open source software closely, the terms of many open source licenses to which we are subject have not been interpreted by United States or foreign courts, and there is a risk that such licenses could be construed in a manner that imposes unanticipated conditions or restrictions on our ability to commercialize our products. In such event, we could be required to seek licenses from third parties in order to continue offering our products, to re-engineer our products or to discontinue sales of our products, or to release our software code under the terms of an open source license, any of which could materially adversely affect our business.\nGiven the nature of open source software, there is also a risk that third parties may assert copyright and other intellectual property infringement claims against us based on our use of certain open source software programs. The risks associated with intellectual property infringement claims are discussed immediately below.\nIf a third party asserts that we are infringing its intellectual property, whether successful or not, it could subject us to costly and time-consuming litigation or require us to obtain expensive licenses, and our business may be adversely affected.\nThe software and Internet industries are characterized by the existence of a large number of patents, trademarks and copyrights and by frequent litigation based on allegations of infringement or other violations of intellectual property rights. Third parties may assert patent and other intellectual property infringement claims against us in the form of lawsuits, letters or other forms of communication. These claims, whether or not successful, could:\n·\ndivert management’s attention;\n·\nresult in costly and time-consuming litigation;\n·\nrequire us to enter into royalty or licensing agreements, which may not be available on acceptable terms, or at all;\n·\nin the case of open source software-related claims, require us to release our software code under the terms of an open source license; or\n·\nrequire us to redesign our software and services to avoid infringement.\nAs a result, any third-party intellectual property claims against us could increase our expenses and adversely affect our business. In addition, many of our agreements with our agency partners require us to indemnify them for third-party intellectual property infringement claims, which would increase the cost to us resulting from an adverse ruling on any such claim. Even if we have not infringed any third parties’ intellectual property rights, we cannot be sure our legal defenses will be successful, and even if we are successful in defending against such claims, our legal defense could require significant financial resources and management time. Finally, if a third party successfully asserts a claim that our products infringe its proprietary rights, royalty or licensing agreements might not be available on terms we find acceptable or at all and we may be required to pay significant monetary damages to such third party.\nIf the security of our customers’ confidential information stored in our systems is breached or otherwise subjected to unauthorized access, our reputation may be severely harmed, we may be exposed to liability and we may lose the ability to offer our customers a credit card payment option.\nOur system stores our customers’ proprietary email distribution lists, credit card information and other critical data. Any accidental or willful security breaches or other unauthorized access could expose us to liability for the loss of such information, adverse regulatory action by federal and state governments, time-consuming and expensive litigation and other possible liabilities as well as negative publicity, which could severely damage our reputation. If security measures are breached because of third-party action, employee error, malfeasance or otherwise, or if design flaws in our software are exposed and exploited, and, as a result, a third party obtains unauthorized access to any of our customers’ data, our relationships with our customers will be severely damaged, and we could incur significant liability. Because techniques used to obtain unauthorized access or to sabotage systems change frequently and generally are not recognized until they are launched against a target, we and our third-party hosting facilities may be unable to anticipate these techniques or to implement adequate preventative measures. In addition, many states have enacted laws requiring companies to notify individuals of data security breaches involving their personal data. These mandatory disclosures regarding a security breach often lead to widespread negative publicity, which may cause our customers to lose confidence in the effectiveness of our data security measures. Any security breach, whether actual or perceived, would harm our reputation, and we could lose customers and fail to acquire new customers.\nIf we fail to maintain our compliance with the data protection policy documentation standards adopted by the major credit card issuers, we could lose our ability to offer our customers a credit card payment option. Any loss of our ability to offer our customers a credit card payment option would make our products less attractive to many small organizations by negatively impacting our customer experience and significantly increasing our administrative costs related to customer payment processing.\nWe may be the subject of intentional cyber disruptions and attacks.\nWe expect to be an ongoing target of attacks specifically designed to impede the performance of our products. Experienced computer programmers, or hackers, may attempt to penetrate our network security or the security of our data centers and IT environments. These hackers, or others, which may include our employees or vendors, may cause interruptions of our services. Although we continually seek to improve our countermeasures to prevent and detect such incidents, if these efforts are not successful, our business operations, and those of our customers, could be adversely affected, losses or theft of data could occur, our reputation and future sales could be harmed, governmental regulatory action or litigation could be commenced against us and our business, financial condition, operating results and cash flow could be materially adversely affected.\nRisks Related To Our Industry\nExisting federal, state and foreign laws regulate Internet tracking software, the senders of commercial emails and text messages, website owners and other activities, and could impact the use of our marketing tools and potentially subject us to regulatory enforcement or private litigation.\nCertain aspects of how our customers utilize our platform are subject to regulations in the United States, European Union and elsewhere. U.S. and European lawmakers and regulators have expressed concern over the use of third-party cookies or web beacons for online behavioral advertising. Legislation adopted in the European Union requires informed consent for the placement of a cookie on a user’s device. Regulation of cookies and web beacons may lead to restrictions on our activities, such as efforts to understand users’ Internet usage. New and expanding “Do Not Track” regulations have recently been enacted or proposed that protect users’ right to choose whether or not to be tracked online. These regulations seek, among other things, to allow end users to have greater control over the use of private information collected online, to forbid the collection or use of online information, to demand a business to comply with their choice to opt out of such collection or use, and to place limits upon the disclosure of information to third party websites. These policies could have a significant impact on the operation of our Marketing Automation platform and could impair our attractiveness to customers, which would harm our business.\nCustomers and potential customers in the healthcare, financial services and other industries are subject to substantial regulation regarding their collection, use and protection of data and may be the subject of further regulation in the future. Accordingly, these laws or significant new laws or regulations or changes in, or repeals of, existing laws, regulations or governmental policy may change the way these customers do business and may require us to implement additional features or offer additional contractual terms to satisfy customer and regulatory requirements, or could cause the demand for and sales of our marketing software to decrease and adversely impact our financial results.\nIn addition, U.S., state and foreign jurisdictions are considering and may in the future enact legislation or laws restricting the ability to conduct marketing activities in mobile, social and web channels. Any of the foregoing existing or future restrictions could require us to change one or more aspects of the way we operate our business, which could impair our ability to attract and retain customers, or increase our operating costs or otherwise harm our business. We may be unable to pass along those costs to our customers in the form of increased subscription fees.\nWhile these laws and regulations generally govern our customers’ use of our marketing tools, we may be subject to certain laws as a data processor on behalf of, or as a business associate of, our customers. For example, these laws and regulations governing the collection, use and disclosure of personal information include, in the United States, rules and regulations promulgated under the authority of the Federal Trade Commission, the Health Insurance Portability and Accountability Act of 1996, the Gramm-Leach-Bliley Act of 1999 and state breach notification laws, and internationally, the General Data Protection Regulation in the European Union and the Federal Data Protection Act in Germany. If we were found to be in violation of any of these laws or regulations as a result of government enforcement or private litigation, we could be subjected to civil and criminal sanctions, including both monetary fines and injunctive action that could force us to change our business practices, all of which could adversely affect our financial performance and significantly harm our reputation and our business.\nPrivacy concerns and consumers' acceptance of Internet behavior tracking may limit the applicability, use and adoption of our marketing software.\nPrivacy concerns may cause consumers to resist providing the personal data necessary to allow our customers to use our services effectively. We have implemented various features intended to enable our customers to better protect consumer privacy, but these measures may not alleviate all potential privacy concerns and threats. Even the perception of privacy concerns, whether or not valid, may inhibit market adoption of our services in certain industries. In addition to government activity, privacy advocacy groups and the technology and other industries are considering various new, additional or different self-regulatory standards that may place additional burdens on us. There are numerous lawsuits in process against various technology companies that collect and use personal information. If those lawsuits are successful, it could impact the way we conduct our business and adversely affect our financial results. The costs of compliance with, and other burdens imposed by, the foregoing laws, regulations, policies and actions may limit the use and adoption of our cloud-based marketing software and reduce overall demand for it, or lead to significant fines, penalties or liabilities for any noncompliance or loss of any such action.\nEvolving regulations concerning data privacy may restrict our customers’ ability to solicit, collect, process and use data necessary to conduct email campaigns or to analyze the results or may increase their costs, which could harm our business.\nFederal, state and foreign governments have enacted, and may in the future enact, laws and regulations concerning the solicitation, collection, processing or use of consumers’ personal information. Such laws and regulations may require companies to implement privacy and security policies, permit users to access, correct and delete personal information stored or maintained by such companies, inform individuals of security breaches that affect their personal information, and, in some cases, obtain individuals’ consent to use personal information for certain purposes. Other proposed legislation could, if enacted, prohibit the use of certain technologies that track individuals’ activities on web pages or that record when individuals click through to an Internet address contained in an email message. Such laws and regulations could restrict our customers’ ability to collect and use email addresses, page viewing data, and personal information, which may reduce demand for our products. They may also negatively impact our ability to effectively market our products.\nThe European Union’s General Data Protection Regulation (GDPR) went into effect in May 2018 and created a data protection law framework across the EU, aiming to give citizens back the control of their personal data, while imposing strict rules on those hosting and 'processing' this data, anywhere in the world. The Regulation also introduces rules relating to the free movement of personal data within and outside the EU. SharpSpring, as a data processor, must clearly disclose any data collection, declare the lawful basis and purpose for data processing, and state how long data is being retained and if it is being shared with any third parties or outside of the European Economic Area. Data subjects have the right to request a portable copy of the data collected by a processor in a common format, and the right to have their data erased under certain circumstances. Public authorities, and businesses whose core activities center around regular or systematic processing of personal data, are required to employ a data protection officer (DPO), who is responsible for managing compliance with the GDPR. Businesses must report any data breaches within 72 hours if they have an adverse effect on user privacy. In some cases, violators of the GDPR may be fined up to €20 million or up to 4% of the annual worldwide turnover of the preceding financial year in case of an enterprise, whichever is greater.\nIn addition to GDPR, California enacted a similar law to GDPR, the California Consumer Privacy Act (CCPA), which took effect in January 2021. The CCPA similarly imposes new obligations with regards to customer data collection and protection. We continue to monitor GDPR, CCPA, and any new or upcoming regulations to ensure compliance and their impact on our ability to provide our Marketing Automation services display retargeting to our customers.\nThe growth of the marketing automation market depends partially on the continued growth and effectiveness of anti-spam products, which may be insufficient to enable us to offer our services at a profit.\nAdoption and retention of email as a communications medium depends on the ability to prevent junk mail, or “spam,” from overwhelming a subscriber’s electronic mailbox. In recent years, many companies have evolved to address this issue and filter unwanted messages before they reach customers’ mailboxes. In response, spammers have become more sophisticated and have also begun using junk messages as a means for fraud. Email protection companies in turn have evolved to address this new threat. However, if their products fail to be effective against spam, adoption of email as a communications tool will decline, which would adversely affect the market for our services.\nA continuing economic downturn could negatively affect the business sector, which may cause our customers to terminate existing accounts with us or cause potential customers to fail to purchase our products, resulting in a decrease in our revenue and impairing our ability to operate profitably.\nOur platforms and services are designed specifically for small and medium size organizations, including small and medium size businesses, associations and non-profits that frequently have limited budgets and may be more likely to be significantly affected by economic downturns than their larger, more established counterparts. Small organizations may choose to spend their limited funds on items other than our products. Moreover, if small organizations experience economic hardship, they may be unwilling or unable to expend resources on marketing, including email marketing, which would negatively affect the overall demand for our products, increase customer attrition and could cause our revenue to decline. In addition, we have limited experience operating our business during an economic downturn. Accordingly, we do not know if our current business model will continue to operate effectively during a continuing economic downturn. Furthermore, we are unable to predict the likely duration and severity of the adverse economic conditions in the U.S. and other countries, but the longer the duration the greater risks we face in operating our business. There can be no assurance, therefore, that worsening economic conditions, or a prolonged or recurring recession, will not have a significant adverse impact on our operating and financial results.\nU.S. federal legislation entitled Controlling the Assault of Non-Solicited Pornography and Marketing Act of 2003 imposes certain obligations on the senders of commercial emails, which could minimize the effectiveness of our email marketing product, and establishes financial penalties for non-compliance, which could increase the costs of our business.\nThe Controlling the Assault of Non-Solicited Pornography and Marketing Act of 2003, or CAN-SPAM Act, establishes certain requirements for commercial email messages and specifies penalties for the transmission of commercial email messages that are intended to deceive the recipient as to source or content. The CAN-SPAM Act, among other things, obligates the sender of commercial emails to provide recipients with the ability to opt out of receiving future emails from the sender. In addition, some states have passed laws regulating commercial email practices that are significantly more punitive and difficult to comply with than the CAN-SPAM Act, particularly Utah and Michigan, which have enacted do-not-email registries listing minors who do not wish to receive unsolicited commercial email that markets certain covered content, such as adult or other harmful products. Some portions of these state laws may not be preempted by the CAN-SPAM Act. The ability of our customers’ constituents to opt out of receiving commercial emails may minimize the effectiveness of our email marketing product. Moreover, non-compliance with the CAN-SPAM Act carries significant financial penalties. If we were found to be in violation of the CAN-SPAM Act, applicable state laws not preempted by the CAN-SPAM Act, or foreign laws regulating the distribution of commercial email, whether as a result of violations by our customers or if we were deemed to be directly subject to and in violation of these requirements, we could be required to pay penalties, which would adversely affect our financial performance and significantly harm our business. We also may be required to change one or more aspects of the way we operate our business, which could impair our ability to attract and retain customers or increase our operating costs.\nAs Internet commerce continues to evolve, federal, state and foreign governments may adopt new laws to regulate Internet commerce, which may negatively affect our business.\nAs Internet commerce continues to evolve, increasing regulation by federal, state or foreign governments becomes more likely. Our business could be negatively impacted by the application of existing laws and regulations or the enactment of new laws applicable to email communications. The cost to comply with such laws or regulations could be significant and would increase our operating expenses, and we may be unable to pass along those costs to our customers in the form of increased subscription fees. In addition, federal, state and foreign governmental or regulatory agencies may decide to impose taxes on services provided over the Internet or via email. Such taxes could discourage the use of the Internet and email as a means of commercial marketing and communications, which would adversely affect the viability of our services.\nWe rely on the collection of data from various sources, which may be restricted by consumer choice, clients, publishers and browsers or other software, changes in technology, and new developments in laws, regulations, and industry standards.\nOur ability to optimize the delivery of internet advertisements for our clients depends on our ability to successfully leverage data, including data that we collect from our clients, data we receive from our publisher partners and third parties, and data from our own operating history. We collect information about the interactions of users with our customers’ and publishers’ digital properties (including, for example, information about the placement of advertisements and users’ shopping or other interactions with our clients’ websites or advertisements). Our ability to successfully leverage such data depends on our continued ability to access and use such data, which could be restricted by a number of factors, including consumer choice, restrictions imposed by counterparties (such as clients, supply sources and publishers, who may also compete with us for advertising spend and inventory) and web browser developers or other software developers, changes in technology, including changes in web browser technology, increased visibility of consent or “do not track” mechanisms or “ad-blocking” software, and new developments in, or new interpretations of, laws, regulations and industry standards. These types of restrictions could materially impair the results of our operations.\nWeb browser developers, such as Apple, Mozilla Foundation, Microsoft, and Google, have implemented or may implement changes in browser or device functionality that impair our ability to understand the preferences of consumers, including by limiting the use of third-party cookies or other tracking technologies or data indicating or predicting consumer preferences. Today, three major web browsers - Apple’s Safari, Mozilla’s Firefox and Microsoft’s Edge - block third party cookies by default. Internet users can also delete cookies from their computers at any time. In January 2020, Google announced that it plans to phase out support for third-party cookies in Chrome by early 2022. Google controls more than 60% of the browser market and has an even more dominant position in the digital advertising market. These web browser developers have significant resources at their disposal and command substantial market share, and any restrictions they impose could foreclose our ability to understand the preferences of a substantial number of consumers. Although we are actively in the process of moving our business away from third-party cookies, if we are blocked from serving advertisements to a significant portion of internet users, our business could suffer and our results of operations could be harmed.\nSimilarly, Internet users are increasingly able to download “ad-blocking” software, including on mobile devices, which prevent third-party cookies from being stored on a user’s computer and block advertisements from being displayed to such user. In addition, Google has introduced ad blocking software in its Chrome browser that blocks certain ads based on quality standards established under a multi-stakeholder coalition. If such a feature inadvertently or mistakenly blocks ads that are not within the established blocking standards, or if such capabilities become widely adopted and the advertising technology industry does not collaboratively develop alternative technologies, our business could be harmed. The Interactive Advertising Bureau and Digital Advertising Alliance have also developed frameworks that allow users to opt out of the “sale” of their personal information under the CCPA, in ways that stop or severely limit the ability to show targeted ads.\nIn addition, search engines and other service providers that explicitly do not allow the tracking of data, such as DuckDuckGo, Inc., may be growing in popularity. If a significant number of web browser users switch to advertising-free services or platforms, our business could be materially impacted. Further, mobile devices allow users to opt out of the use of mobile device IDs for targeted advertising. For in-app advertising, data regarding interactions between users and devices are tracked mostly through stable, pseudonymous mobile device identifiers that are built into the device operating system with privacy controls that allow users to express a preference with respect to data collection for advertising, including to disable the identifier. These identifiers and privacy controls are defined by the developers of the mobile platforms and could be changed by the mobile platforms in a way that may negatively impact our business. For example, Apple announced in June 2020 that it will require user opt-in before permitting access to Apple’s unique identifier, or IDFA. Apple initially targeted September 2020 for implementing these changes but has pushed that date out until early Spring 2021. This shift from enabling user opt-out to an opt-in requirement is likely to have a substantial impact on the mobile advertising ecosystem and could harm our growth in this channel.\nThe data we gather is important to the continued development and success of our Perfect Audience platform. If too few of our clients provide us with the permission to share their data or if our clients choose to stop sharing their data, or if regulatory or other factors inhibit or restrict us from maintaining the data collectives underlying Perfect Audience, the value of Perfect Audience could be materially diminished, which could impact the performance of our products and materially impact our business.\nThe third parties upon which we rely for access to data may implement technical restrictions that impede our access to such data and revenue opportunities, which could materially impact our business and results of operations.\nA substantial portion of the data we rely on comes from our publisher partners and other third parties, including advertising exchange platforms. Similarly, we rely on our publisher partners, advertising exchange platforms and other third parties for opportunities to serve advertisements through which we generate our revenue. Our ability to successfully leverage such data and successfully generate revenue from such opportunities could be impacted by restrictions imposed by or on our publisher partners or other third parties, including restrictions on our ability to use or read cookies or other tracking features or our ability to use real-time bidding networks or other bidding networks.\nFor example, in light of the GDPR, some platforms have imposed restrictions on our ability to bid on opportunities to serve ads. Third-party publishers are responsible under GDPR for gathering necessary user consents and indicating to platforms that Perfect Audience has been approved by the applicable users. As part of their efforts to comply with their understanding of the requirements of the GDPR, which are subject to interpretation, certain platforms that run advertising exchanges have required actions from such third party publishers with respect to such consents that appear to be stricter than what the regulations require. Similarly, some platforms and other relevant third parties may take similar actions in response to any new legislation or regulatory developments or interpretations in the future, in response to perceived user preferences, or for other reasons.\nIf third parties on which we rely for data or opportunities to serve advertisements impose similar restrictions or are not able to comply with restrictions imposed by other ecosystem participants, we may lose the ability to access data, bid on opportunities, or purchase digital ad space, which could have a substantial impact on our revenue.\nRisks Related To Owning Our Securities\nWe have a history of losses and may not achieve profitability in the future.\nWe generated a net loss from operations of approximately $7.32 million in 2020. We will need to generate and sustain increased revenue levels in future periods to become profitable, and, even if we do, we may not be able to maintain or increase our level of profitability. We intend to continue to expend significant funds to expand and grow our Marketing Automation and display retargeting platforms and obtain new customers. Our efforts to grow our business may be more costly than we expect, and we may not be able to increase our revenue enough to offset higher operating expenses. We may incur significant losses in the future for a number of reasons, including the other risks described in this Annual Report on Form 10-K, unforeseen expenses, difficulties, complications and delays and other unknown events. If we are unable to achieve and sustain profitability, the market price of our common stock may significantly decrease.\nWe may need additional capital in the future, which may not be available to us on favorable terms, or at all, and may dilute your ownership of our common stock.\nWe have historically relied on outside financing and cash from operations to fund our operations, capital expenditures and expansion. We may require additional capital from equity or debt financing in the future to:\n·\nfund our operations;\n·\nrespond to competitive pressures;\n·\ntake advantage of strategic opportunities, including more rapid expansion of our business or the acquisition of complementary products, technologies or businesses; and\n·\ndevelop new products or enhancements to existing products.\nWe may not be able to secure timely additional financing on favorable terms, or at all. The terms of any additional financing may place limits on our financial and operating flexibility. If we raise additional funds through issuances of equity, convertible debt securities or other securities convertible into equity, our existing stockholders could suffer significant dilution in their percentage ownership of our Company, and any new securities we issue could have rights, preferences and privileges senior to those of our common stock. If we are unable to obtain adequate financing or financing on terms satisfactory to us, if and when we require it, our ability to grow or support our business and to respond to business challenges could be significantly limited.\nWe may expand through acquisitions of, or investments in, other companies or through business relationships, all of which may result in additional dilution to our stockholders and consumption of resources that are necessary to sustain our business.\nOne of the strategies available to us to grow our business would be to acquire competing or complementary services, technologies or businesses. We also may enter into relationships with other businesses in order to expand our service offerings, which could involve preferred or exclusive licenses, additional channels of distribution or discount pricing or investments in other companies.\nIn connection with one or more of those transactions, we may:\n·\nissue additional equity securities that would dilute our stockholders;\n·\nuse cash that we may need in the future to operate our business;\n·\nincur debt on terms unfavorable to us or that we are unable to repay;\n·\nincur large charges or substantial liabilities;\n·\nencounter difficulties retaining key employees of the acquired company or integrating diverse business cultures;\n·\nbecome subject to adverse tax consequences, substantial depreciation, or deferred compensation charges; and\n·\nencounter unfavorable reactions from investment banking market analysts who disapprove of our completed acquisitions.\nOur board of directors has the authority, without stockholder approval, to issue preferred stock with terms that may not be beneficial to existing common stockholders and with the ability to affect adversely stockholder voting power and perpetuate their control over us.\nOur certificate of incorporation, as amended, allows the Board of Directors to issue shares of preferred stock without any vote or further action by our stockholders. Our board of directors has the authority to fix and determine the relative rights and preferences of preferred stock. Our board of directors also has the authority to issue preferred stock without further stockholder approval, including large blocks of preferred stock. As a result, our board of directors could authorize the issuance of a series of preferred stock that would grant to holders thereof the preferred right to our assets upon liquidation, the right to receive dividend payments before dividends are distributed to the holders of common stock or other preferred stockholders and the right to the redemption of the shares, together with a premium, prior to the redemption of our common stock or existing preferred stock, if any.\nPreferred stock could be used to dilute a potential hostile acquirer. Accordingly, any future issuance of preferred stock or any rights to purchase preferred stock may have the effect of making it more difficult for a third party to acquire control of us. This may delay, defer or prevent a change of control or an unsolicited acquisition proposal. The issuance of preferred stock also could decrease the amount of earnings attributable to, and assets available for distribution to, the holders of our common stock and could adversely affect the rights and powers, including voting rights, of the holders of our common stock and preferred stock.\nA sale of a substantial number of shares of our common stock may cause the price of our common stock to decline and may impair our ability to raise capital in the future.\nOur common stock is traded on The NASDAQ Capital Market and, despite certain increases of trading volume from time to time, our common stock is considered “thinly-traded,” meaning that the number of persons interested in trading our common stock at any given time may be relatively small or non-existent. Finance transactions resulting in a large amount of newly issued shares that become readily tradable, or other events that cause current stockholders to sell shares, could place downward pressure on the trading price of our stock. The lack of a robust resale market may require a stockholder who desires to sell a large number of shares of common stock to sell the shares in increments over time to mitigate any adverse impact of the sales on the market price of our stock.\nIf our stockholders sell, or the market perceives that our stockholders intend to sell for various reasons, including the ending of restriction on resale, substantial amounts of our common stock in the public market, including shares issued upon the exercise of outstanding options or warrants, the market price of our common stock could fall. Sales of a substantial number of shares of our common stock may make it more difficult for us to sell equity or equity-related securities in the future at a time and price that we deem reasonable or appropriate. We may become involved in securities class action litigation that could divert management’s attention and harm our business.\nOur amended certificate of incorporation and bylaws, and certain provisions of Delaware corporate law, as well as certain of our contracts, contain provisions that could delay or prevent a change in control even if the change in control would be beneficial to our stockholders.\nDelaware law, as well as our certificate of incorporation, as amended, and bylaws, contains anti-takeover provisions that could delay or prevent a change in control of our Company, even if the change in control would be beneficial to our stockholders.\nThese provisions could lower the price that future investors might be willing to pay for shares of our common stock. These anti-takeover provisions:\n·\nauthorize our board of directors to create and issue, without stockholder approval, preferred stock, thereby increasing the number of outstanding shares, which can deter or prevent a takeover attempt;\n·\nprohibit cumulative voting in the election of directors, which would otherwise allow less than a majority of stockholders to elect director candidates;\n·\nempower our board of directors to fill any vacancy on our board of directors, whether such vacancy occurs as a result of an increase in the number of directors or otherwise;\n·\nprovide that our board of directors is expressly authorized to adopt, amend or repeal our bylaws; and\n·\nprovide that our directors will be elected by a plurality of the votes cast in the election of directors.\nSection 203 of the Delaware General Corporation Law, the terms of our employee stock option agreements and other contractual provisions may also discourage, delay or prevent a change in control of our Company. Section 203 generally prohibits a Delaware corporation from engaging in a business combination with an interested stockholder for three years after the date the stockholder became an interested stockholder. Our employee stock option agreements include change-in-control provisions that allow us to grant options or stock purchase rights that may become vested immediately upon a change in control. The terms of change of control provisions contained in certain of our senior executive employee agreements may also discourage a change in control of our Company. Our board of directors also has the power to adopt a stockholder rights plan that could delay or prevent a change in control of our Company even if the change in control is generally beneficial to our stockholders. These plans, sometimes called “poison pills,” are oftentimes criticized by institutional investors or their advisors and could affect our rating by such investors or advisors. If our board of directors adopts such a plan, it might have the effect of reducing the price that new investors are willing to pay for shares of our common stock.\nTogether, these charter, statutory and contractual provisions could make the removal of our management and directors more difficult and may discourage transactions that otherwise could involve payment of a premium over prevailing market prices for our common stock. Furthermore, the existence of the foregoing provisions, as well as the significant common stock beneficially owned by our founder, executive officers, and members of our board of directors, could limit the price that investors might be willing to pay in the future for shares of our common stock. They could also deter potential acquirers of our Company, thereby reducing the likelihood that you could receive a premium for your common stock in an acquisition.\nOur quarterly results may fluctuate and if we fail to meet the expectations of analysts or investors, our stock price could decline substantially.\nOur quarterly operating results may fluctuate, and if we fail to meet or exceed the expectations of securities analysts or investors, the trading price of our common stock could decline. Some of the important factors that could cause our revenue and operating results to fluctuate from quarter to quarter include:\n·\nour ability to retain existing customers, attract new customers and satisfy our customers’ requirements;\n·\ngeneral economic conditions;\n·\nchanges in our pricing policies;\n·\nour ability to expand our business;\n·\nour ability to successfully integrate our acquired businesses;\n·\nnew product and service introductions;\n·\ntechnical difficulties or interruptions in our services;\n·\nthe timing of additional investments in our hardware and software systems;\n·\nregulatory compliance costs;\n·\ncosts associated with future acquisitions of technologies and businesses; and\n·\nextraordinary expenses such as litigation or other dispute-related settlement payments.\nSome of these factors are not within our control, and the occurrence of one or more of them may cause our operating results to vary widely. As such, we believe that quarter-to-quarter comparisons of our revenue and operating results may not be meaningful and should not be relied upon as an indication of future performance.\nOur common stock is subject to volatility.\nWe cannot assure you that the market price for our common stock will remain at its current level, and a decrease in the market price could result in substantial losses for investors. The market price of our common stock may be significantly affected by one or more of the following factors:\n·\nannouncements or press releases relating to our industry or to our own business or prospects;\n·\nregulatory, legislative, or other developments affecting us or our industry generally;\n·\nsales by holders of restricted securities pursuant to effective registration statements or exemptions from registration; and\n·\nmarket conditions specific to our Company, our industry and the stock market generally.\nIf securities or industry analysts do not publish research or reports about our business, or if they change their recommendations regarding our stock adversely, our stock price and trading volume could decline.\nThe trading market for our common stock will depend in part on the research and reports that securities or industry analysts publish about us or our business. We currently have five independent research analysts covering our stock and may not obtain additional research coverage by securities and industry analysts. If no additional securities or industry analysts commence coverage of us, the trading price for our common stock could be negatively affected. In the event any analyst who covers us downgrades our securities, the price of our securities would likely decline. If one or more of these analysts ceases to cover us or fails to publish regular reports on us, interest in the purchase of our securities could decrease, which could cause the price of our common stock and its trading volume to decline.\nIf we fail to maintain an effective system of disclosure controls and internal control over financial reporting, our ability to produce timely and accurate financial statements or comply with applicable regulations could be impaired.\nAs a public company, we are subject to the reporting requirements of the Securities Exchange Act of 1934 (Exchange Act) the Sarbanes-Oxley Act of 2002 (Sarbanes-Oxley Act), the Dodd-Frank Wall Street Reform and Consumer Protection Act (Dodd-Frank Act), and the rules and regulations of The NASDAQ Stock Market. We expect that compliance with these rules and regulations will continue to increase our legal, accounting and financial compliance costs, make some activities more difficult, time consuming and costly, and place significant strain on our personnel, systems and resources.\nThe Sarbanes-Oxley Act requires, among other things, that we assess the effectiveness of our internal control over financial reporting annually and the effectiveness of our disclosure controls and procedures quarterly. In particular, Section 404 of the Sarbanes-Oxley Act, (Section 404), requires us to perform system and process evaluation and testing of our internal control over financial reporting to allow management to report on, the effectiveness of our internal control over financial reporting. Our compliance with applicable provisions of Section 404 requires that we incur substantial accounting expense and expend significant management time on compliance-related issues as we implement additional corporate governance practices and comply with reporting requirements. Moreover, if we are not able to comply with the requirements of Section 404 applicable to us in a timely manner, or if we or our independent registered public accounting firm identifies deficiencies in our internal control over financial reporting that are deemed to be material weaknesses, the market price of our stock could decline and we could be subject to sanctions or investigations by the SEC or other regulatory authorities, which would require additional financial and management resources.\nFurthermore, investor perceptions of our Company may suffer if deficiencies are found, and this could cause a decline in the market price of our stock. Irrespective of compliance with Section 404, any failure of our internal control over financial reporting could have a material adverse effect on our stated operating results and harm our reputation. If we are unable to implement these requirements effectively or efficiently, it could harm our operations, financial reporting, or financial results.",
    "item_1B": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item_2": "ITEM 2. PROPERTIES\nOur corporate headquarters is a leased office facility located at 5001 Celebration Pointe Avenue, Suite 410, Gainesville, FL 32608.",
    "item_3": "ITEM 3. LEGAL PROCEEDINGS\nWe are not a party to any litigation of a material nature.",
    "item_4": "ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II",
    "item_5": "ITEM 5. MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nOur common stock trades on The NASDAQ Capital Market under the symbol “SHSP”.\nStockholders\nAs of March 22, 2021, there were approximately 48 holders of record of our common stock including The Depository Trust Company, which holds shares of our common stock on behalf of an indeterminate number of beneficial owners.\nDividends\nOur Company does not pay any cash dividends on its commons stock. Our Loan and Security Agreement with Western Alliance Bank restricts our ability to pay cash dividends on our common stock and it will continue to do so for the foreseeable future.\nSecurities Authorized for Issuance under Equity Compensation Plans\nSee Item 12, “Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters,” for information regarding securities authorized for issuance.\nRecent Sales of Unregistered Securities\nNone.",
    "item_6": "ITEM 6. SELECTED FINANCIAL DATA\nNot Applicable.",
    "item_7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe information in this report contains forward-looking statements. All statements other than statements of historical fact made in this report are forward looking. In particular, the statements herein regarding industry prospects and future results of operations or financial position are forward-looking statements. These forward-looking statements can be identified by the use of words such as “believes,” “estimates,” “could,” “possibly,” “probably,” anticipates,” “projects,” “expects,” “may,” “will,” or “should” or other variations or similar words. No assurances can be given that the future results anticipated by the forward-looking statements will be achieved. Forward-looking statements reflect management’s current expectations and are inherently uncertain. Our actual results may differ significantly from management’s expectations.\nThe following discussion and analysis should be read in conjunction with our financial statements, included herewith. This discussion should not be construed to imply that the results discussed herein will necessarily continue into the future, or that any conclusion reached herein will necessarily be indicative of actual operating results in the future. Such discussion represents only the best present assessment of our management.\nBackground Overview\nWe provide SaaS-based marketing technologies to customers around the world. Our focus is on marketing automation tools that enable customers to interact with a lead from an early stage and nurture that potential customer using advanced features until it becomes a qualified sales lead or customer. We primarily offer our premium SharpSpring Marketing Automation solution, but also have customers on the SharpSpring Mail+ product, which is a subset of the full suite solution. In 2019, the Company acquired the Perfect Audience platform, which allowed us to expand into the display retargeting space.\nWe believe our recent growth has been driven by the strong demand for marketing automation technology solutions, particularly in the small and mid-size business market. Our products are offered at competitive prices with unlimited multi-lingual customer support. Our SharpSpring Marketing Automation platform employs a subscription-based revenue model. We also earn revenues from additional usage charges that may come into effect when a customer exceeds a transactional quota, as well as fees earned for additional products and services. The Perfect Audience platform employs a usage-based revenue model. Revenue from this platform is dependent on the number of ads placed through the platform and the effectiveness of that ad space.\nUnless the context otherwise requires, in this section titled Management’s Discussion and Analysis of Financial Condition and Results of Operations references to “SharpSpring Marketing Automation” relate to the SharpSpring Marketing Automation product and references to “Perfect Audience” relate to the Perfect Audience product, while all references to “Company,” “we,” “our” or “us” and other similar terms means SharpSpring, Inc., a Delaware corporation, and all subsidiaries.\nEffects of COVID-19\nThe COVID-19 pandemic has affected our businesses, as well as those of our customers, suppliers, and third-party sellers. We have not experienced any drop off in the services provided by our various vendors. To serve our customers while also providing for the safety of our employees and service providers, we have adapted various steps to protect our employees and customers. We have enacted a work-from-home policy to allow our employees to maintain social distancing while still maintaining our level of productivity and effectiveness prior to the work-from-home policy. In addition to our work-from-home policy, we have made several strategic business decisions to help navigate these uncertain times.\nWe implemented a 10% reduction to salaries across most of the Company and paused quarterly bonuses in the second quarter of 2020. The Company reinstated full salaries and quarterly bonuses in November 1, 2020. The Company also paused its 401k matching programs. The Company also cut various other non-employee related costs across the board to ensure future flexibility. This included an approximate 40% reduction in the marketing program spend and putting a greater reliance on internal lead generation through the majority of 2020. The Company delayed any non-essential capital expenditures, which allowed us to maintain cash flow flexibility during the COVID pandemic.\nThe Company increased its cash position by $1.90 million by drawing down on our line of credit as described in Note 5, Credit Facility. As stated in Note 7, SBA Paycheck Protection Loans, the Company received $3.40 million from the Small Business Association (“SBA”) loan program in April 2020, which may be forgiven if the criteria defined by the SBA is met. The Company has filed the application for forgiveness with SBA but has not yet received a decision from the SBA as to whether full or part of the loans will be forgiven, as of December 31, 2020. We have also received an approximately $1.60 million tax refund in June 2020 as a result of historical net operating losses described in Note 10, Income Taxes. The SBA loan program and tax refund are both results of the CARES Act enacted by Congress in March. This cash infusion continues to allow for increased flexibility in these uncertain times. In addition, the Company received approximately $13.94 million from a stock offering, net of issuance costs, in December 2020.\nWhile, the COVID-19 pandemic has made significant impact on the entire global economy, the SharpSpring sales and marketing platforms continue to generate demand in these uncertain times and as a SaaS product we can continue to provide our product to our customers while still practicing social distancing which is more difficult in other industries. During the year ended December 31, 2020, we activated 1053 new customers compared to 998 in the same period in 2019. We continue to bring in new leads, host demos, and drive sales at promising levels despite the downturns in the overall economy. We believe our tools offer our customers a chance to thrive in these uncertain times where others are diminishing. For customers that use the various features our platform provides, we are deeply embedded in their sales and marketing processes. Our Perfect Audience business has faced downward pressures beyond that of our Marketing Automation platform as the retargeting industry continues to experience difficulties as customers spend less on advertisements during this unprecedented time. We continue to invest in our product as we still expect long term growth from this business and believe the current economic climate for advertisement retargeting is temporary only due to COVID.\nDespite COVID-19, the Company was able to continue to grow revenue in the year ended 2020 compared to the same period in 2019. Although revenue has increased, we believe the COVID-19 pandemic had an adverse effect on our revenue growth this period. It is possible that we could be further impacted from COVID-19 in subsequent quarters in ways that we presently do not anticipate; however, at this time, our business continues to grow. In addition, we have been able to maintain the size of our workforce while other companies are seeing layoffs in large numbers. The full extent of the impact to the Company due to the impact of the COVID-19 pandemic for the next year and beyond cannot be currently determined, but the Company has taken measures to best position itself to continue to be successful in these uncertain times. The extent to which the COVID-19 pandemic will impact the Company will depend on future developments, which are still uncertain and cannot be reasonably predicted, including the duration of the outbreak, the increase or reduction in governmental restrictions to businesses and individuals, the potential for a resurgence of the virus and other factors. The longer the COVID-19 pandemic continues, the greater the potential negative financial effect on the Company. We continue to evaluate the impact of global economic and health conditions to ensure our responses to these uncertain times are both timely and appropriate.\nResults of Operations\nYear Ended December 31, 2020 Compared to the Year Ended December 31, 2019\nPercent\nYear Ended\nChange\nChange\nDecember 31,\nfrom\nfrom\nPrior Year\nPrior Year\nRevenues and Cost of Sales:\nRevenues\n$ 29,287,882\n$ 22,699,386\n$ 6,588,496\n29 %\nCost of Sales\n8,062,564\n7,142,416\n920,148\n13 %\nGross Profit\n$ 21,225,318\n$ 15,556,970\n$ 5,668,348\n36 %\nRevenues from continuing operations increased approximately $6.59 million for the year ended December 31, 2020 as compared to the year ended December 31, 2019, primarily due to growth in revenues from our SharpSpring Marketing Automation customer base, a price increase put in place in 2020, and the addition of the Perfect Audience platform which allowed for further cross-sale revenue from our existing customer base as well as adding a standalone customer base. Revenues for our SharpSpring Marketing Automation increased to approximately $26.6 million in 2020 from $22.2 million in 2019. During 2020, we continued to attract and acquire new customers on the SharpSpring platform, which contributed to our revenue growth. The Perfect Audience platform acquired in November of 2019 generated approximately $2.52 million of revenue for the year ended December 31, 2020 compared to $0.27 million for the year ended December 31, 2019. This growth in revenues was partially offset by reduced revenue from our SharpSpring Mail+ product, which declined from approximately $0.22 million for the year ended December 31, 2019 compared to approximately $0.18 million for the year ended December 31, 2020. We expect revenue to continue to increase in 2021 from the realization of the full year value of the net new SharpSpring customers acquired throughout 2020.\nCost of services increased for year ended December 31, 2020, as compared to the year ended December 31, 2019, primarily due to additional cost from Perfect Audience associated with supporting the new product line. Employee related costs increased approximately $0.04 million. Hosting costs increased approximately $0.7 million associated with the addition of the Perfect Audience product and the growth of the SharpSpring platform and customer base. Cost of Sales increased in dollar terms for the year ended December 31, 2020 compared to the year ended December 31, 2019, however, as a percentage of revenue the Cost of Sales decreased significantly from 31.5% to 27.5% for the year ended December 31, 2019 compared to the year ended December 31, 2020. This improvement in gross margin is the result of continued improvement in efficiencies and improved operating leverage. Additionally, 2020 saw a temporary salary cut from April through October of 2020 as part of a cost cutting measure during the initial phases of COVID-19. We expect costs of sales to increase in 2021 in dollar terms, but remain relatively consistent as a percent of revenue, as we add more costs to support customers and promote growth in agency partner relationships while growing revenues.\nPercent\nYear Ended\nChange\nChange\nDecember 31,\nfrom\nfrom\nPrior Year\nPrior Year\nOperating expenses:\nSales and marketing\n$ 10,888,944\n$ 11,785,227\n$ (896,283 )\n-8 %\nResearch and development\n6,072,103\n5,036,613\n1,035,490\n21 %\nGeneral and administrative\n10,227,128\n8,617,073\n1,610,055\n19 %\nIntangible asset amortization\n642,149\n381,000\n261,149\n69 %\nImpairment of goodwill\n710,000\n-\n710,000\nn/a\n$ 28,540,324\n$ 25,819,913\n$ 2,720,411\n11 %\nSales and marketing expenses decreased approximately $0.90 million for the year ended December 31, 2020, as compared to the same period in 2019. The decrease was primarily due to reducing marketing program spend and putting a greater reliance on internal lead generation through the majority of 2020, which increased our employee related costs. Program spend decreased by approximately $2.44 million compared to same period last year. Employee-related costs increased by approximately $1.62 million. The shift in costs from a program spend to employee related costs was due to a shift to an outbound lead generation strategy, which allowed for us to have better control over costs to acquire customers during the uncertainty of COVID-19. Other non-employee and non-program costs increased by approximately $0.06 million compared to the same period in 2019. During 2019, employee related costs included severance related to the Company’s former CRO in the amount of approximately $0.13 million. We expect sales and marketing expenses to increase in 2021 as we devote more resources to acquiring new customers and expect sales and marketing, as a percentage of revenue, to return to similar levels seen in 2019.\nResearch and development expenses increased for the year ended December 31, 2020, as compared to the year ended December 31, 2019, primarily due to additional hiring of development and quality assurance staff since last year. Employee-related costs for this group increased by approximately $0.85 million in the year ended December 31, 2020, compared to the same period in 2019. Non-employee-related costs, including outsourced development, for this group increased by approximately $0.96 million in the year ended December 31, 2020, compared to the same period in 2019. These costs were partially offset by capitalized software development work which decreased by approximately $0.09 million to $0.74 million. We expect research and development spend to increase in 2021 as we increase our team to support future product development commensurate with the growth of our business but remain relatively consistent as a percentage of revenue.\nGeneral and administrative expenses increased for the year ended December 31, 2020, as compared to the year ended December 31, 2019, primarily due to higher employee related costs associated with business growth of approximately $0.78 million, a contingent loss of $0.28 million accrued during 2020 for sales tax exposure in the United States discussed in Note 15, Commitments and Contingencies, and increased facilities costs of approximately $0.3 million primarily associated with the Company adding additional office space in the second quarter of 2020 to support the growth of the Company. Depreciation expense increased by approximately $0.32 million primarily due to the Company’s continued investment in software development. The Company made $0.10 million in donations to various charities in the year ended December 31, 2020 compared to approximately $0.03 million in the same period in 2019. The increase was partially offset by the decrease of $0.16 million of legal costs associated with the purchase of Perfect Audience incurred in the year end December 31, 2019 that was not incurred in year ended December 31, 2020. We expect general and administrative expenses to increase incrementally in dollar terms but decrease as a percent of revenue in 2021, as we add costs to support general business growth.\nAmortization of intangible assets increased for the year ended December 31, 2020, as compared to the year ended December 31, 2019. The increase in intangible amortization is principally due to the additions of intangibles as part of the acquisition of the Perfect Audience business in November 2019.\nThe Company incurred an impairment of goodwill related to its Perfect Audience reporting unit of approximately $0.71 million in the year ended December 31, 2020 as described in Note 4 in the Notes to the Consolidated Financial Statements.\nPercent\nYear Ended\nChange\nChange\nDecember 31,\nfrom\nfrom\nPrior Year\nPrior Year\nOther\nOther expense, net\n$ (19,988 )\n$ (147,338 )\n$ 127,350\n-86 %\nLoss on induced conversion\n-\n(2,162,696 )\n2,162,696\n-100 %\nGain on embedded derivative\n-\n214,350\n(214,350 )\n-100 %\nProvision (benefit) for income taxes\n(1,505,965 )\n29,349\n(1,535,314 )\n-5231 %\nOther expense is generally related to foreign exchange gains and losses derived from owing amounts or having amounts owed in currencies other than the entity’s functional currency, as well as interest expense related to our convertible notes, line of credit, and SBA loans. During the year ended December 31, 2020, the Company incurred foreign currency losses of approximately $0.02 million compared to approximately $0.04 million to the same period in 2019. The Company incurred approximately $0.1 million of interest expense in the year ended December 31, 2020 compared to approximately $0.14 million in the same period in 2019. The Company received interest related to a tax refund received in June 2020 of approximately $0.05 million.\nOn May 9, 2019, the Company entered into an agreement to convert the Convertible Notes. As a result of the conversion, the Company realized a gain on the embedded derivative of $0.21 million, and a loss on conversion of debt of $2.16 million during the year ended December 31, 2019. The Company incurred a loss on the embedded derivative of $0.40 million during the year ended December 31, 2018.\nDuring the year ended December 31, 2020, our income tax benefit was primarily related to a carryback of net operating loss for our consolidated U.S. entities for the years prior to 2019 as result of changes to the tax law from the CARES Act. Prior to March 31, 2020, we had recorded a full valuation allowance against all of our U.S. net operating loss deferred tax assets, so there is no tax benefit recorded on the income statement for those losses. During the year ended December 31, 2020, our $1.50 million net income tax benefit is comprised of a federal benefit of approximately $1.56 million related to our NOL carrybacks, U.S. States’ income tax benefit of approximately $8,000, and income tax derived from foreign jurisdictions of approximately $59,000. During the year ended December 31, 2019, our income tax provision of approximately $29,000 was U.S. States’ income taxes of approximately $25,000 as well as approximately $4,000 of income tax related to foreign jurisdictions.\nLiquidity and Capital Resources\nSources and Uses of Cash\nOur primary source of operating cash inflows are payments from customers for use of our SharpSpring Marketing Automation and Perfect Audience platforms. Such payments are primarily received monthly from customers but can sometimes be received annually in advance of providing the services, yielding a deferred revenue liability on our consolidated balance sheets. In addition to the operating cash flows the Company utilized several other sources of cash flows in 2020. In June 2020 we received a tax refund of approximately $1.60 million as net operating losses in prior years that could be realized as part of the tax law changes in the CARES Act. In addition to the tax refund the Company received approximately $3.40 million from the SBA Loans in April 2020. In March 2020, the Company drew down on its available $1.90 million line of credit. In December of 2020, the Company issued 1,000,000 shares of common stock and raised $13.9 million in cash, net of issuance costs. In 2019 the Company raised approximately $15.6 million, net of issuance costs, from two separate secondary stock offerings in March and November 2019.\nOur primary sources of cash outflows from operations include payroll and payments to vendors and third-party service providers.\nAnalysis of Cash Flows\nNet cash used in operating activities decreased by approximately $5.18 million to approximately $2.85 million used in operations for the year ended December 31, 2020, compared to approximately $8.03 million used in operations for the year ended December 31, 2019. The decrease in cash used in operating activities was attributable primarily to the Company reducing our net loss from approximately $12.39 million during the year ended December 31, 2019 to a loss of approximately $5.83 million for the year ended December 31, 2020. Included in the improvement of the net loss is a $1.60 million benefit from the refund of income tax related to prior years’ net operating losses.\nNet cash used in investing activities was approximately $1.15 million during the year ended December 31, 2020, compared to approximately $5.93 million used during the year ended December 31, 2019. The change in cash used for investing activities is primarily related the purchase of the Perfect Audience assets for $4.6 million in November 2019. In addition, net cash used in investing activities decreased approximately $0.22 million in investment in property and equipment and capitalized software development in the year ended December 31, 2020 as compared to the same period in 2019. The Company delayed any non-essential capital expenditures, which will allow us to continue to maintain flexibility during the COVID pandemic.\nNet cash provided by financing activities was $20.47 million during the year ended December 31, 2020, compared to $16.56 million net cash received from financing activities during the year ended December 31, 2019. The primary sources of the cash provided by financing activities is related to the Company’s $1.90 million line of credit, $3.40 million of loans from the SBA Loans, and $13.9 million, net of issuance cost, from the issuance of 1,000,000 shares of common stock in December 2020. In 2019, the Company raised approximately $15.6 million, net of issuance costs, from two separate issuances of common stock in March and November 2019. The Company also received approximately $1.27 million from the exercise of employee stock options during the year ended December 31, 2020 compared to approximately $0.97 million from the exercise of employee stock options during the year ended December 31, 2019.\nWe had net working capital of approximately $22.81 million and $10.38 million as of December 31, 2020 and December 31, 2019, respectively. Our cash balance was $28.27 million at December 31, 2020 reflecting the $1.90 million received from the draw on our line of credit in March 2020, the proceeds of the SBA Loans of $3.40 million, tax refund of approximately $1.60 million received in June 2020, and received $13.9 million in cash received from the stock offering, net of issuance costs, in December 2020. Our cash balance was $11.88 million on December 31, 2019, reflecting approximately $15.6 million cash received from two separate common stock issuances, net of issuance costs, in March and November 2019.\nContractual Obligations\nSharpSpring favors short term agreements in order to maintain flexibility in future operations. From time-to-time SharpSpring will engage in contracts that are greater than 12 months. We typically rent our office facilities with leases involving multi-year commitments. Although some of our service contracts are on a month-to-month basis, we sometimes enter into non-cancelable service contracts for longer periods of time, some of which may last several years. SharpSpring may also enter into debt agreements that are greater than one year. Future minimum lease payments, payments due under non-cancelable service contracts, and debt obligations from contracts greater than 1 year are as follows as of December 31, 2020:\nOperating\nLeases\nDebt\nObligation\n1,321,598\n2,630,962\n1,329,525\n768,538\n1,369,159\n-\n1,377,086\n-\n1,416,720\nThereafter\n4,109,161\n-\nTotal Commitments\n$ 10,923,249\n$ 3,399,500\nSignificant Accounting Policies\nOur significant accounting policies, including the assumptions and judgments underlying them, are disclosed in the Notes to the Financial Statements. We have consistently applied these policies in all material respects. We do not believe that our operations to date have involved uncertainty of accounting treatment, subjective judgment, or estimates, to any significant degree.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that is material to investors.\nNew Accounting Pronouncements\nFor information on recent accounting pronouncements, see Recently Issued Accounting Pronouncements in Note 2 to the consolidated financial statements appearing elsewhere in this Annual Report on Form 10-K.",
    "item_7A": "ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot Applicable.",
    "item_8": "ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe financial statements included in this annual report under this item are set forth beginning on Page of this Annual Report, immediately following the signature pages.",
    "item_9": "ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNot Applicable.",
    "item_9A": "ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nWe have established disclosure controls and procedures to ensure that material information relating to our company, including our consolidated subsidiaries, is made known to the officers who certify our financial reports and to other members of senior management and the Board of Directors.\nAs of the end of the period covered by this report, we carried out an evaluation, under the supervision and with the participation of our management, including the Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operations of our disclosure controls and procedures (as defined in Rule 13a-15(e) and 15d-15(e) under the Exchange Act). Based on this evaluation, our Company made the determination that its disclosure controls and procedures were effective.\nManagement’s Annual Report on Internal Control Over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act). Management, including our Chief Executive Officer and Chief Financial Officer, assessed the effectiveness of our internal control over financial reporting as of December 31, 2020. In making this assessment, our management used the criteria for effective internal control over financial reporting described in “Internal Control-Integrated Framework (2013),” issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on this evaluation, management has concluded that our internal control over financial reporting was effective as of December 31, 2020.\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that:\n·\nPertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; `\n·\nProvide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and\n·\nProvide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. Accordingly, even effective internal control over financial reporting can only provide reasonable assurance of achieving its control objectives.\nWe have confidence in our internal controls and procedures. Nevertheless, our management, including our Chief Executive Officer and Chief Financial Officer, does not expect that our disclosure procedures and controls or our internal controls will prevent all errors or intentional fraud. An internal control system, no matter how well-conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of such internal controls are met. Further, the design of an internal control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. As a result of the inherent limitations in all internal control systems, no evaluation of controls can provide absolute assurance that all our control issues and instances of fraud, if any, have been detected.\nThis annual report does not include an attestation report of the Company’s independent registered public accounting firm regarding internal control over financial reporting. Management’s report was not subject to attestation by the Company’s registered public accounting firm pursuant to rules of the Securities and Exchange Commission that permit the Company to provide only management’s attestation in this annual report.\nChanges in Internal Control Over Financial Reporting\nOther than described below, there have been no other changes in our internal control over financial reporting (as defined in Rules 13a-15(f) or 15d-15(f) of the Exchange Act) that occurred during fiscal year 2020 that have materially affected, or are reasonably likely to materially affect, the Company’s internal control over financial reporting.\nRemediation of Material Weaknesses in Internal Control Over IT and Financial Reporting\nDuring the fiscal year ended December 31, 2019, in connection with our evaluation of the internal controls of the Company, we noted the following deficiencies that we consider to be material weaknesses:\n·\nIneffective internal control over financial reporting and dependent business process control (automated and manual) related to information technology general controls (ITGCs) around (i) the design and implementation of program change-management over certain information technology (IT) systems that support the Company’s financial reporting processes and related to ineffective ITGCs around design and (ii) implementation of effective user access controls over SaaS and internally hosted applications that support the Company’s financial reporting processes to ensure appropriate segregation of duties and to adequately restrict user and privileged access to appropriate SharpSpring personnel.\n·\nDue to the extensive effort required in the implementation of section 404b, and as in common many growth companies with limited staff, we identified control deficiencies in financial reporting during our implementation related to: (i) certain entity level controls; (ii) inadequate segregation of duties; and (iii) compliance and review related to certain policies and procedures. As a result, these deficiencies aggregate into an additional material weakness.\nThe material weaknesses did not result in any identified misstatements to the consolidated financial statements, and there were no changes to previously released financial results. Based on these material weaknesses, the Company’s management concluded that at December 31, 2019, the Company’s internal control over financial reporting was not effective.\nDuring the year ended December 31, 2020, made changes to the Company’s internal control over financial reporting to remediate the above material weaknesses. In response to these material weaknesses the Company (i) established an IT Compliance Oversight function to provide stronger preventative and review controls around change-management over certain IT systems that support the Company’s financial reporting processes; (ii) established additional policies, protocols, and training related to change-management and user access review of key SaaS and internally hosted applications that support the Company’s financial reporting processes to ensure appropriate segregation of duties and to adequately restrict user and privileged access to appropriate SharpSpring personnel; (iii) implemented controls to address and maintain documentation of completeness and accuracy of system generated information used to support the operation of the controls; (iv) added additional accounting and finance personnel and implemented certain process level and management review controls to increase the Company’s segregation of duties and allow adequate time for proper documentation of observable evidence of review and approvals; (v) established an internal-audit function to provide further review of certain entity level controls, proper segregation of duties, and compliance of certain policies and procedures;\nUpon review and testing of these remediation actions, the Company has remediated the material weaknesses identified above as of December 31, 2020. Based on this evaluation, management has concluded that our disclosure controls and procedures and internal control over financial reporting were effective as of December 31, 2020.",
    "item_9B": "ITEM 9B. OTHER INFORMATION\nNot Applicable.\nPART III",
    "item_10": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by this Item is incorporated by reference from the information contained within our Company’s definitive proxy statement for the 2021 Annual Meeting of Stockholders.",
    "item_11": "ITEM 11. EXECUTIVE COMPENSATION\nThe information required by this Item is incorporated by reference from the information contained within our Company’s definitive proxy statement for the 2021 Annual Meeting of Stockholders.",
    "item_12": "ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this Item is incorporated by reference from the information contained within our Company’s definitive proxy statement for the 2021 Annual Meeting of Stockholders.",
    "item_13": "ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this Item is incorporated by reference from the information contained within our Company’s definitive proxy statement for the 2021 Annual Meeting of Stockholders.",
    "item_14": "ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe information required by this Item is incorporated by reference from the information contained within our Company’s definitive proxy statement for the 2021 Annual Meeting of Stockholders.\nPART IV",
    "item_15": "ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) Documents filed as part of this report:\n1. Financial Statements and Reports\nThe financial statements included in Part II, Item 8 of this Annual Report on Form 10-K are filed as part of this Report.\n2. Financial Statements Schedule\nOther financial statement schedules have been omitted because either the required information (i) is not present, (ii) is not present in amounts sufficient to require submission of the schedule or (iii) is included in the Financial Statements and Notes thereto under Part II, Item 8 of this Annual Report on Form 10-K.\n3. Exhibits\nThe exhibit list in the Index to Exhibits is incorporated herein by reference as the list of exhibits required as part of this Report.\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized on March 30, 2021.\nSharpSpring, Inc.\nBy:\n/s/ Richard A. Carlson\nRichard A. Carlson\nChief Executive Officer and President\n(Principal Executive Officer)\nPursuant to the requirements of the Securities Act of 1933, this registration statement has been signed by the following persons in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Richard A. Carlson\nChief Executive Officer and President (Principal Executive Officer), Director\nMarch 30, 2021\nRichard A. Carlson\n/s/ Aaron Jackson\nChief Financial Officer (Principal Financial Officer)\nMarch 30, 2021\nAaron Jackson\n/s/ Steven A. Huey\nChair of the Board of Directors\nMarch 30, 2021\nSteven A. Huey\n/s/ Savneet Singh\nDirector\nMarch 30, 2021\nSavneet Singh\n/s/ David A. Buckel\nDirector\nMarch 30, 2021\nDavid A. Buckel\n/s/ Scott Miller\nDirector\nMarch 30, 2021\nScott Miller\nPage\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets\nConsolidated Statements of Comprehensive Loss\nConsolidated Statements of Changes in Shareholders’ Equity\nConsolidated Statements of Cash Flows\nNotes to the Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders\nSharpSpring, Inc.\nGainesville, Florida\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of SharpSpring, Inc. and subsidiaries (the “Company”) as of December 31, 2020 and 2019, and the related consolidated statements of comprehensive loss, changes in shareholders’ equity, and cash flows for each of the years in the two-year period ended December 31, 2020, and the related notes (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2020 and 2019, and the results of its operations and its cash flows for each of the years in the two-year period ended December 31, 2020, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (“PCAOB”), the Company’s internal control over financial reporting as of December 31, 2019, based on criteria established in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission, and our report dated March 16, 2020, expressed an adverse opinion.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting as of December 31, 2020. As part of our audit, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nGoodwill Impairment Assessment and Impairment of Goodwill\nDescription of Matter\nAs disclosed in Note 4 to the consolidated financial statements, the Company’s consolidated goodwill balance was $10,250,088 at December 31, 2020. The Company’s evaluation of goodwill for impairment involves the comparison of the fair value of each reporting unit to its carrying value. The fair value of each reporting unit is estimated using a weighting of income and market approaches which require the use of estimates and assumptions related to cash flow forecasts, comparable public companies, discount rates, and terminal values. Management’s cash flow forecasts included significant judgments and assumptions relating to revenue growth rates and overall future profitability.\nThe fair values of the Perfect Audience reporting unit did not exceed its carrying value as of the annual evaluation date; therefore, impairment expense of $710,000 was recognized during the year ended December 31, 2020 related to its goodwill. The impairment charge was recognized for the amount by which the carrying amount exceeded the reporting unit’s estimated fair value.\nManagement made significant judgments when developing the fair value estimate of the reporting unit. As a result, a high degree of auditor judgment and effort was required, including involving the use of our valuation specialists, in performing audit procedures to evaluate the reasonableness of management’s cash flow forecasts and the significant assumptions identified above. Significant uncertainty exists with these assumptions because they are sensitive to future market or economic conditions.\nHow We Addressed the Matter in Our Audit\nOur audit procedures included the following:\n·\nObtained an understanding of the internal controls and processes in place over the Company’s annual goodwill impairment review process, including management’s review of the significant assumptions described above.\n·\nEvaluated the reasonableness of management’s current revenue and EBITDA forecasts by comparing the forecasts to actual historical results and forecasted information provided by the Company along with information included in analyst and industry reports and certain peer companies’ disclosures.\n·\nEvaluated management’s determination of reporting units and segments.\n·\nEvaluation of market capitalization reconciliation for reporting units.\n·\nWith the assistance of our valuation specialists, evaluated the valuation methodologies and significant assumptions, including discount rates, and developed a range of independent estimates and compared those to the significant assumptions used by management.\nRevenue from Contracts with Customers\nDescription of Matter\nThe Company had $29,287,882 in revenues for the year ended December 31, 2020. As disclosed in Note 1 to the consolidated financial statements, the Company generates revenue primarily though charging customers subscription fees, professional services for onboarding and training. The Company also generates revenue through the Perfect Audience platform which is generally recognized after transferring control of the promised goods or services to customers, which occurs when a user clicks on an ad contracted on a cost per click basis, views an ad contracted on a cost per thousand impressions basis or views a video ad contracted on a cost per view basis.\nThe Company‘s revenue recognition process involves several applications responsible for the initiation, processing, and recording of transactions from the Company’s various sales channels, and the calculation of revenue in accordance with the Company’s accounting policy.\nAuditing the Company's accounting for revenue from contracts with customers was challenging and complex due to the high volume of individually-low-monetary-value transactions, dependency on the effective design and operation of multiple applications, some of which are specifically designed for the Company’s business, and the use of multiple data sources in the revenue recognition process.\nThis matter required especially subjective auditor judgment and effort because of the number of information technology (IT) applications involved in the revenue recognition processes. This matter also included the need to involve IT professionals to assist with the performance of certain procedures.\nHow We Addressed the Matter in Our Audit\nBased on our knowledge of the Company, we determined the nature and extent of procedures to be performed over revenue, including the determination of the revenue streams over which those procedures were performed. Our audit procedures included the following for each revenue stream where procedures were performed:\n·\nObtained an understanding of the internal controls and processes in place over the Company’s revenue recognition processes.\n·\nAssessed the recorded revenue by selecting a sample of transactions, analyzing the related contract, testing management’s identification of distinct performance obligations, and comparing the amounts recognized for consistency with underlying documentation.\n·\nTested on a sample basis the completeness and accuracy of the underlying data within the Company’s billing system, tested data from the system to evaluate the completeness and accuracy of recorded revenue and deferred revenue amounts, traced a sample of sales transactions to source data, and tested a sample of cash to billings reconciliations.\n·\nTested reconciliations of revenue per the accounting system to the billing system, revenue per the accounting system to the merchant system reports, and reconciled merchant reports to cash receipts received into the Company’s bank accounts.\n·\nInvolved IT professionals with specialized skills and knowledge, who assisted in reviewing certain IT general controls over applications that are used by the Company in its revenue recognition process.\n/s/ Cherry Bekaert LLP\nWe have served as the Company’s auditor since 2016.\nAtlanta, Georgia\nMarch 30, 2021\nSHARPSPRING, INC.\nCONSOLIDATED BALANCE SHEETS\nDecember 31,\nDecember 31,\nAssets\nCash and cash equivalents\n$ 28,267,792\n$ 11,881,949\nAccounts receivable, net of allowance for doubtful accounts of $56,135 and $12,455 at December 31, 2020 and December 31, 2019, respectively\n323,130\n340,344\nUnbilled receivables\n1,248,060\n998,048\nIncome taxes receivable\n54,449\n15,010\nOther current assets\n1,433,543\n1,363,366\nTotal current assets\n31,326,974\n14,598,717\nProperty and equipment, net\n2,188,948\n1,996,722\nGoodwill\n10,250,088\n10,922,814\nIntangibles, net\n4,015,851\n4,658,000\nRight-of-use assets\n8,352,028\n5,281,530\nOther long-term assets\n611,857\n549,022\nTotal assets\n$ 56,745,746\n$ 38,006,805\nLiabilities and Shareholders' Equity\nAccounts payable\n$ 1,074,594\n$ 2,052,538\nAccrued expenses and other current liabilities\n1,259,836\n919,089\nLine of credit\n1,900,000\n-\nDeferred revenue\n845,265\n860,820\nIncome taxes payable\n81,221\n13,944\nLease liability, current portion\n724,627\n370,340\nNotes payable, current portion\n2,630,962\n-\nTotal current liabilities\n8,516,505\n4,216,731\nLease liability, net of current portion\n7,771,898\n4,976,727\nNotes payable, net of current portion\n768,538\n-\nTotal liabilities\n17,056,941\n9,193,458\nCommitments and contingencies (Note 15)\nShareholders' equity:\nPreferred stock, $0.001 par value, 5,000,000 shares authorized, no shares issued or outstanding at December 31, 2020 and December 31, 2019\n-\n-\nCommon stock, $0.001 par value, Authorized shares- 50,000,000; issued shares- 12,818,797 at December 31, 2020 and 11,537,163 at December 31, 2019; outstanding shares- 12,798,797 at December 31, 2020 and 11,517,163 at December 31, 2019\n12,819\n11,537\nAdditional paid in capital\n75,544,966\n58,851,285\nAccumulated other comprehensive loss\n(215,269 )\n(224,793 )\nAccumulated deficit\n(35,569,711 )\n(29,740,682 )\nTreasury stock\n(84,000 )\n(84,000 )\nTotal shareholders' equity\n39,688,805\n28,813,347\nTotal liabilities and shareholders' equity\n$ 56,745,746\n$ 38,006,805\nSee accompanying notes to the consolidated financial statements.\nSHARPSPRING, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE LOSS\nYear Ended\nDecember 31,\nRevenue\n$ 29,287,882\n$ 22,699,386\nCost of services\n8,062,564\n7,142,416\nGross profit\n21,225,318\n15,556,970\nOperating expenses:\nSales and marketing\n10,888,944\n11,785,227\nResearch and development\n6,072,103\n5,036,613\nGeneral and administrative\n10,227,128\n8,617,073\nIntangible asset amortization\n642,149\n381,000\nImpairment of goodwill\n710,000\n-\nTotal operating expenses\n28,540,324\n25,819,913\nOperating loss\n(7,315,006 )\n(10,262,943 )\nOther expense, net\n(19,988 )\n(147,338 )\nLoss on induced conversion\n-\n(2,162,696 )\nGain on embedded derivative\n-\n214,350\nLoss before income taxes\n(7,334,994 )\n(12,358,627 )\n(Benefit) provision for income taxes\n(1,505,965 )\n29,349\nNet loss\n$ (5,829,029 )\n$ (12,387,976 )\nNet loss per share, basic and diluted\n$ (0.50 )\n$ (1.20 )\nShares used in computing net loss per share, basic and diluted\n11,611,020\n10,323,889\nOther comprehensive income (loss):\nForeign currency translation adjustment, net\n9,524\n6,260\nComprehensive loss\n$ (5,819,505 )\n$ (12,381,716 )\nSee accompanying notes to the consolidated financial statements.\nSHARPSPRING, INC.\nCONSOLIDATED STATEMENTS OF CHANGES IN SHAREHOLDERS’ EQUITY\nAccumulated\nAdditional\nOther\nCommon Stock\nPaid in\nComprehensive\nTreasury Stock\nAccumulated\nShares\nAmount\nCapital\nLoss\nShares\nAmount\nDeficit\nTotal\nBalance, December 31, 2018\n8,639,139\n$ 8,639\n$ 30,446,838\n$ (231,053 )\n20,000\n$ (84,000 )\n$ (17,352,706 )\n$ 12,787,718\nStock based compensation - stock options\n-\n-\n1,076,324\n-\n-\n-\n-\n1,076,324\nIssuance of common stock for cash\n1,631,331\n1,631\n16,578,784\n-\n-\n-\n-\n16,580,415\nIssuance of common stock for director services\n10,286\n127,878\n-\n-\n-\n-\n127,888\nIssuance of common stock for warrant conversions\n14,772\n(15 )\n-\n-\n-\n-\n-\nIssuance of commons stock for settlement of notes\n1,241,635\n1,242\n10,621,474\n-\n-\n-\n-\n10,622,716\nForeign currency translation adjustment, net\n-\n-\n-\n6,260\n-\n-\n-\n6,260\nNet Loss\n-\n-\n-\n-\n-\n-\n(12,387,976 )\n(12,387,976 )\nBalance, December 31, 2019\n11,537,163\n$ 11,537\n$ 58,851,285\n$ (224,793 )\n20,000\n$ (84,000 )\n$ (29,740,682 )\n$ 28,813,347\nBalance, December 31, 2019\n11,537,163\n11,537\n58,851,285\n(224,793 )\n20,000\n(84,000 )\n(29,740,682 )\n28,813,347\nStock based compensation\n-\n-\n1,378,907\n-\n-\n-\n-\n1,378,907\nIssuance of common stock for cash\n1,242,718\n1,243\n15,207,899\n-\n-\n-\n-\n15,209,142\nIssuance of common stock for services\n14,624\n147,772\n-\n-\n-\n-\n147,787\nIssuance of common stock under stock plans, net of shares withheld for employee taxes\n24,292\n(40,897 )\n-\n-\n-\n-\n(40,873 )\nForeign currency translation adjustment\n-\n-\n-\n9,524\n-\n-\n-\n9,524\nNet Loss\n-\n-\n-\n-\n-\n-\n(5,829,029 )\n(5,829,029 )\nBalance, December 31, 2020\n12,818,797\n$ 12,819\n$ 75,544,966\n$ (215,269 )\n20,000\n$ (84,000 )\n(35,569,711 )\n$ 39,688,805\nSee accompanying notes to the consolidated financial statements.\nSHARPSPRING, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYear Ended\nDecember 31,\nCash flows from operating activities:\nNet loss\n$ (5,829,029 )\n$ (12,387,976 )\nAdjustments to reconcile loss from operations:\nDepreciation and amortization\n1,596,146\n1,010,123\nImpairment of goodwill\n710,000\n-\nAmortization of costs to acquire contracts\n816,100\n804,780\nNon-cash stock compensation\n1,526,693\n1,204,213\nDeferred income taxes\n-\nLoss (gain) on disposal of property and equipment\n(617 )\nNon-cash interest\n-\n139,372\nAmortization of debt issuance costs and embedded derivative\n-\n2,903\nGain on embedded derivative\n-\n(214,350 )\nLoss on induced conversion\n-\n2,162,696\nUnrealized foreign currency loss\n48,069\n25,425\nChanges in assets and liabilities:\nAccounts receivable\n21,989\n(204,217 )\nUnbilled receivables\n(230,895 )\n(254,987 )\nRight-of-use assets\n(3,070,498 )\n433,980\nOther assets\n(949,881 )\n(837,082 )\nIncome taxes, net\n22,941\n(2,094 )\nAccounts payable\n(978,825 )\n439,028\nLease liabilities\n3,149,459\n(377,264 )\nOther liabilities\n340,808\n(392,480 )\nDeferred revenue\n(21,048 )\n421,405\nNet cash used in operating activities\n(2,847,350 )\n(8,027,142 )\nCash flows from investing activities\nAcquisition of business\n-\n(4,566,402 )\nPurchases of property and equipment\n(401,831 )\n(529,001 )\nProceeds from the sale of property and equipment\n-\nCapitalization of software development costs\n(744,654 )\n(836,047 )\nNet cash used in investing activities\n(1,146,485 )\n(5,930,833 )\nCash flows used in financing activities:\nProceeds from line of credit\n1,900,000\n-\nProceeds from note payable\n3,399,500\n-\nProceeds from exercise of stock options, net\n1,266,695\n968,986\nProceeds from issuance of common stock, net\n13,942,446\n15,587,990\nPayments for taxes related to net share settlement of equity awards\n(40,872 )\n-\nNet cash provided by financing activities\n20,467,769\n16,556,976\nEffect of exchange rate on cash\n(88,091 )\n(37,918 )\nChange in cash and cash equivalents\n16,385,843\n2,561,083\nCash and cash equivalents, beginning of period\n11,881,949\n9,320,866\nCash and cash equivalents, end of period\n$ 28,267,792\n$ 11,881,949\nSupplemental information on consolidated statements of cash flows:\nCash paid (received) during the period for\nInterest, net\n$ 26,850\n$ -\nIncome taxes, net\n$ (1,529,266 )\n$ 11,013\nNon-cash activities\nRight-of-use asset obtained for lease liability\n$ 3,758,014\n$ 5,715,510\nConvertible notes liability relieved upon conversion\n$ -\n$\n8,484,701\nEmbedded derivative liability relieved upon conversion\n$ -\n$\n189,776\nSee accompanying notes to the consolidated financial statements.\nSHARPSPRING, INC.\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nNote 1: Organization\nSharpSpring, Inc. (the “Company”) provides a cloud-based marketing automation solution and a display retargeting platform through our SharpSpring and Perfect Audience products. SharpSpring is designed to increase the rates at which businesses generate leads and convert leads to sales opportunities by improving the way businesses communicate with customers and prospects. Perfect Audience empowers marketers to create, manage, and optimize their ad campaigns across thousands of websites. Our products are marketed directly by us and through a small group of reseller partners to customers around the world.\nNote 2: Summary of Significant Accounting Policies\nBasis of Presentation and Consolidation\nThe accompanying consolidated financial statements have been prepared in conformity with accounting principles generally accepted in the United States of America (U.S. GAAP). The Company’s consolidated financial statements include the accounts of SharpSpring, Inc. and our subsidiaries (the “Company”). The Company’s consolidated financial statements reflect the elimination of all significant inter-company accounts and transactions.\nUse of Estimates\nThe preparation of the consolidated financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nOperating Segments\nThe Company operates as one reportable segment with two operating segments. Our operating segments consist of our SharpSpring Marketing Automation segment and Perfect Audience Ad Retargeting segment in accordance with ASC 280. Operating segments are defined as components of an enterprise for which separate financial information is regularly evaluated by the chief operating decision maker (“CODM”), which is the Company’s chief executive officer, in deciding how to allocate resources and assess performance. The Company’s CODM evaluates the Company’s financial information and resources and assess the performance of these resources between our two operating segments. We do not separately allocate operating expenses, nor do we fully allocate assets to these operating segments. In accordance with ASC 280, we aggregate our two operating segments as one operating segment for financial reporting purposes. The Company does not present geographical information about revenues because it is impractical to do so. See Note 16 of the Notes to the Consolidated Financial Statements for information on our disaggregated revenues.\nForeign Currencies\nThe functional currency of the Company’s foreign subsidiaries is the local currency. Assets and liabilities denominated in a foreign currency are translated into U.S. dollars at the exchange rates in effect at the balance sheet dates, with the resulting translation adjustments directly recorded to a separate component of accumulated other comprehensive loss. Income and expense accounts are translated at the average exchange rates during the period. Foreign currency translation gains and losses are recorded in other comprehensive income (loss).\nCash and Cash Equivalents\nCash equivalents are short-term, liquid investments with remaining maturities of three months or less when acquired. Cash and cash equivalents are deposited or managed by major financial institutions and at most times are in excess of Federal Deposit Insurance Corporation (FDIC) insurance limits.\nFair Value of Financial Instruments\nU.S. GAAP establishes a fair value hierarchy which has three levels based on the reliability of the inputs to determine the fair value. These levels include: Level 1, defined as inputs such as unadjusted quoted prices in active markets for identical assets or liabilities; Level 2, defined as inputs other than quoted prices in active markets that are either directly or indirectly observable; and Level 3, defined as unobservable inputs for use when little or no market data exists, therefore requiring an entity to develop its own assumptions.\nThe Company’s financial instruments consist of cash and cash equivalents, accounts receivable, deposits, embedded derivatives (associated with our convertible notes) and accounts payable. The carrying amount of cash and cash equivalents, accounts receivable and accounts payable approximate fair value because of the short-term nature of these items. The fair value of the embedded derivatives associated with our convertible notes are calculated using Level 3 unobservable inputs, utilizing a probability-weighted expected value model to determine the liability. The fair value of the embedded derivatives was a liability balance of zero at December 31, 2019. The change in fair value for the year ended December 31, 2019 was a gain of $0.21 million. There was no embedded derivative liability during 2020.\nAccounts Receivable\nAccounts receivable are carried at the original invoiced amount less an allowance for doubtful accounts based on the probability of future collection. Management reviews accounts receivable on a periodic basis to determine if any receivables will potentially be uncollectible. The Company reserves for receivables that are determined to be uncollectible, if any, in its allowance for doubtful accounts. After the Company has exhausted all collection efforts, the outstanding receivable is written off against the allowance. In cases where our customers pay for services in arrears, we accrue for revenue in advance of billings as long as the criteria for revenue recognition are met, thus creating a contract asset. A portion of our accounts receivable balance is therefore unbilled at each balance sheet date and is reflected as such on the consolidated balance sheet.\nBusiness Combinations\nAccounting for business combinations requires us to make significant estimates and assumptions, especially at the acquisition date with respect to tangible and intangible assets acquired and liabilities assumed and pre-acquisition contingencies. We use our best estimates and assumptions to accurately assign fair value to the tangible and intangible assets acquired and liabilities assumed at the acquisition date as well as the useful lives of those acquired intangible assets.\nExamples of critical estimates in valuing certain of the intangible assets and goodwill we have acquired include but are not limited to:\n·\nfuture expected cash flows from customer contracts and acquired developed technologies and patents;\n·\nthe acquired company’s trade name, vendor relationships, and customer relationships, as well as assumptions about the period of time the acquired trade name will continue to be used in our offerings; and\n·\ndiscount rates.\nUnanticipated events and circumstances may occur that may affect the accuracy or validity of such assumptions, estimates or actual results.\nIntangibles\nFinite-lived intangible assets include trade names, developed technologies, customer relationships, and vendor relationships, and are amortized based on the estimated economic benefit over their estimated useful lives, with original periods ranging from 5 to 11 years. We regularly evaluate the reasonableness of the useful lives of these assets. Finite-lived intangibles are tested for recoverability whenever events or changes in circumstances indicate the carrying amounts may not be recoverable. Impairment losses are measured as the amount by which the carrying value of an asset group exceeds its fair value and are recognized in operating results. Judgment is used when applying these impairment rules to determine the timing, undiscounted cash flows, and the fair value of an asset group. The dynamic economic environment in which the Company operates, and the resulting assumptions used to estimate future cash flows impact the outcome of these impairment tests.\nGoodwill and Indefinite-Lived Intangible Assets\nAs of December 31, 2020 and 2019, we had recorded goodwill $10.25 million and $10.92 million, respectively. Goodwill consists of the excess of the purchase price over the fair value of tangible and identifiable intangible net assets acquired in the SharpSpring, GraphicMail, and Perfect Audience acquisitions. Under Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) 350, “Intangibles - Goodwill and Other” deemed to have indefinite lives are no longer amortized but are subject to annual impairment tests, and tests between annual tests in certain circumstances, based on estimated fair value in accordance with FASB ASC 350-10, and written down when impaired.\nThe Company also has indefinite-lived intangible assets. As of December 31, 2020 and 2019, we had recorded indefinite-lived intangible assets of $0.38 million at each period (see Note 4). These assets are not amortized but are subject to annual impairment tests, and tests between annual tests in certain circumstances, based on estimated fair value in accordance with FASB ASC 350-30, and written down when impaired.\nDebt Issuance Costs\nThird-party costs associated with the issuance of debt are included as a direct reduction to the carrying value of the debt and are amortized to interest expense ratably over the life of the debt.\nIncome Taxes\nProvision for income taxes is based on taxes payable or refundable for the current year and deferred taxes on temporary differences between the amount of taxable income and pretax financial income and between the tax bases of assets and liabilities and their reported amounts in the financial statements. Deferred tax assets and liabilities are included in the consolidated financial statements at currently enacted income tax rates applicable to the period in which the deferred tax assets and liabilities are expected to be realized or settled as prescribed in FASB ASC 740, Accounting for Income Taxes. As changes in tax laws or rates are enacted, deferred tax assets and liabilities are adjusted through the provision for income taxes. A valuation allowance is established to reduce deferred tax assets if it is more likely than not that a deferred tax asset will not be realized.\nThe Company applies the authoritative guidance in accounting for uncertainty in income taxes recognized in the consolidated financial statements. This guidance prescribes a two-step process to determine the amount of tax benefit to be recognized. First, the tax position must be evaluated to determine the likelihood that it will be sustained upon external examination. If the tax position is deemed “more-likely-than-not” to be sustained, the tax position is then assessed to determine the amount of benefit to recognize in the financial statements. The amount of the benefit that may be recognized is the largest amount that has a greater than 50% likelihood of being realized upon ultimate settlement. There are no material uncertain tax positions taken by the Company on its tax returns. Tax years subsequent to 2017 remain open to examination by U.S. federal and state tax jurisdictions.\nIn determining the provision for income taxes, the Company uses statutory tax rates and tax planning opportunities available to the Company in the jurisdictions in which it operates. This includes recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the consolidated financial statements or tax returns to the extent pervasive evidence exists that they will be realized in future periods. The deferred tax balances are adjusted to reflect tax rates by tax jurisdiction, based on currently enacted tax laws, which are expected to be in effect in the years in which the temporary differences are expected to reverse. In accordance with the Company’s income tax policy, significant or unusual items are separately recognized in the period in which they occur. The Company is subject to routine examination by domestic and foreign tax authorities and frequently faces challenges regarding the amount of taxes due. These challenges include positions taken by the Company related to the timing, nature and amount of deductions and the allocation of income among various tax jurisdictions. The Company received notification January 14, 2020 that its Swiss subsidiary, InterInbox SA is under examination from the Switzerland Federal Tax Administration for the years 2015 through 2018. The Company does not expect any material adjustments as a result of the audit.\nProperty and Equipment\nProperty and equipment are recorded at cost and depreciated using the straight-line method over the estimated useful life of the assets. Upon retirement or sale, the cost of assets disposed of and the related accumulated depreciation are eliminated from the accounts, and any resulting gain or loss is record in the other expense section of our Consolidated Statements of Comprehensive Loss. Repairs and maintenance costs are expensed as incurred. Depreciation expense related to property and equipment was $0.95 million and $0.63 million for the years ended December 31, 2020 and 2019, respectively.\nProperty and equipment as of December 31 is as follows:\nDecember 31,\nDecember 31,\nProperty and equipment, gross:\nLeasehold improvements\n$ 313,119\n$ 290,977\nFurniture and fixtures\n913,370\n678,774\nComputer equipment and software\n3,231,366\n2,350,758\nTotal\n4,457,855\n3,320,509\nLess: Accumulated depreciation\n(2,268,907 )\n(1,323,787 )\n$ 2,188,948\n$ 1,996,722\nUseful lives are as follows:\nLeasehold improvements\n5 years\nFurniture and fixtures\n3-5 years\nComputing equipment\n3 years\nSoftware\n3-5 years\nRevenue Recognition\nThe Company generates revenue from contracts with multiple performance obligations, which typically include subscriptions to its cloud-based marketing automation software, professional services which include onboarding and training services, and access to our advertising retargeting platform. The Company’s customers do not have the right to take possession of any of the software. Substantially all of SharpSpring’s revenue is from contracts with customers. The Company recognizes revenue from contracts with customers using a five-step model as prescribed under ASC 606, which is described below:\n·\nIdentify the customer contract;\n·\nIdentify performance obligations that are distinct;\n·\nDetermine the transaction price;\n·\nAllocate the transaction price to the distinct performance obligations; and\n·\nRecognize revenue as the performance obligations are satisfied.\n1) Identify the customer contract\nA customer contract is generally identified when the Company and a customer have an executed arrangement that calls for the Company to provide access to its software or provide professional services in exchange for consideration from the customer.\n2) Identify performance obligations that are distinct\nA performance obligation is a promise to provide a distinct good or service or a series of distinct goods or services. A good or service that is promised to a customer is distinct if the customer can benefit from the good or service either on its own or together with other resources that are readily available to the customer, and a company’s promise to transfer the good or service to the customer is separately identifiable from other promises in the contract. The Company has determined that subscriptions for its software is distinct because, once a customer has access to the software it purchased, the software is fully functional and does not require any additional development, modification, or customization. Professional services sold are distinct because the customer benefits from the on-boarding and training to make better use of the online software products it purchased.\n3) Determine the transaction price\nThe transaction price is the amount of consideration to which the Company expects to be entitled in exchange for transferring goods or services to a customer, excluding sales taxes that are collected on behalf of government agencies. The Company estimates any variable consideration to which it will be entitled at contract inception, when determining the transaction price. The Company does not include variable consideration to the extent that it is probable that a significant reversal in the amount of cumulative revenue recognized will occur when any uncertainty associated with the variable consideration is resolved.\n4) Allocate the transaction price to the distinct performance obligations\nThe transaction price is allocated to each performance obligation based on the relative standalone selling prices of the goods or services being provided to the customer.\n5) Recognize revenue as the performance obligations are satisfied\nRevenues are recognized when or as control of the promised goods or services is transferred to customers. Revenue from the SharpSpring Marketing Automation and Mail+ software is recognized ratably over the subscription period, which typically ranges from one to twelve months. The Company recognizes revenue from on-boarding and training services as the services are provided, which is generally over 60 days. Revenue related to our other professional services is recognized as the services are provided. The Perfect Audience platform is utilized on an as needed basis, and the related revenue recognized as the service is provided. Cash payments received in advance of providing subscription or services are recorded to deferred revenue until the performance obligation is satisfied.\nOur products are billed in arrears or upfront, depending on the product, which creates contract assets (unbilled receivables) and contract liabilities (deferred revenue), respectively. Unbilled receivables occur due to unbilled charges for which the Company has satisfied performance obligations. Deferred revenues occur due to billing up front for charges that the Company has not yet fully satisfied all performance obligations. Both contract assets and liabilities are recognized as the performance obligations are satisfied.\nFrom time to time, the Company offers refunds to customers and experiences credit card chargebacks relating to cardholder disputes that are commonly experienced by businesses that accept credit cards. The Company makes estimates for refunds and credit card chargebacks based on historical experience.\nGross Versus Net Revenue\nASC 606 provides guidance on proper recognition of principal versus agent considerations which is used to determine gross versus net revenue recognition. Under ASC 606, the core objective of the guidance on gross versus net revenue recognition is to help determine whether an entity is a principal or an agent in a transaction. In general, the primary difference between these two is the performance obligation being satisfied. The principal has a performance obligation to provide the desired goods or services to the end customer, whereas the agent arranges for the principal to provide the desired goods or services. Additionally, a fundamental characteristic of a principal in a transaction is control. A principal substantively controls the goods and services before they are transferred to the customer as well as controls the price of the good or service being provided. An agent normally receives a commission or fee for these activities. In addition to control, the level at which an entity controls the price of the good or service being transferred determines principal versus agent status. The more discretion over setting price a company has in providing the good or service, the more likely they are considered a principal rather than an agent.\nUnder the guidance when another party is involved in providing a good or service to a customer, an entity is a principal if the entity obtains control of the asset or right to a service performed by the other party. SharpSpring never takes possession or control of the advertising space and acts an agent facilitating the customer with the desired advertisement inventory from the principal provider through our Perfect Audience retargeting platform. In addition to the lack of control of the advertising inventory, SharpSpring does not have control over the cost of the advertising inventory, but rather only receives a fee for services for providing the advertising inventory to the customer, further demonstrating SharpSpring’s role as the agent in the transaction. Therefore, as an agent in the retargeting transaction SharpSpring records revenue net of the cost of advertising inventory cost incurred for placing advertisements on websites.\nDeferred Revenue\nDeferred revenue consists of payments received in advance of the Company providing the services. Most of our deferred revenue balances (contract liabilities) arise from payments from customers in advance of service on a periodic basis (such as monthly, quarterly, annually, or bi-annually), while the portion of our deferred revenue balances associated with Perfect Audience arises from prepaid deposits for future usage of the platform. Deferred revenue from our SharpSpring Marketing Automation customers is earned over the service period identified in each contract. Deferred revenue from our Perfect Audience retargeting customers is earned as the service is used. Additionally, the Company has deferred revenue related to implementation fees for its SharpSpring Marketing Automation solution that are paid in advance, which is recognized over the service period. These implementation services are typically performed over a 60-day period. As of December 31, 2019, and 2018, the Company had deferred revenue balances of $0.86 million and $0.25 million, respectively. Deferred revenue decreased by $0.01 million and increased by $0.61 million during the years ended December 31, 2020 and 2019, respectively. Deferred revenue balances were $0.85 million and $0.86 million as of December 31, 2020 and 2019, respectively.\nUnbilled Receivables\nIn cases where our customers pay for services in arrears, we accrue for revenue in advance of billings as long as the criteria for revenue recognition is met, thus creating a contract asset. The accrued revenue contract asset balances were $1.0 million and $0.74 million as of December 31, 2019 and 2018, respectively. Revenue billed that was included in accrued revenue at the beginning of the year ended December 31, 2020 and 2019 was $1.0 million and $0.74million, respectively. The accrued revenue not billed and ending balance in years ended December 31, 2020 and 2019 was $1.25 million and $1.0 million respectively.\nNotes Payable - SBA Paycheck Protection Program Loans\nWe account for loans obtained under the Paycheck Protection Program in Section 1102 of the CARES Act (Note 7) as debt pursuant to FASB ASC 470 - Debt, which requires the loans to be recognized as liabilities. The loans accrue interest in accordance with FASB ASC 835-30 - Interest - Imputation of Interest, which states that since the loans are prescribed by a government agency, it does not impute interest at the market rate even though it is higher than the stated rate.\nConcentration of Credit Risk and Significant Customers\nFinancial instruments that potentially expose the Company to concentrations of credit risk consist primarily of cash and cash equivalents. At December 31, 2020 and 2019, the Company had cash balances at financial institutions that exceed federally insured limits. The Company maintains its cash balances with accredited financial institutions. The Company does not believe it is subject to unusual credit risk beyond the normal credit risk associated with commercial banking relationships.\nFor the years ended December 31, 2020, and 2019, there were no customers that accounted for more than 10% of consolidated revenue.\nFor the year ended December 31, 2020, one customer had an open accounts receivable balance in excess of 10% of net accounts receivable. The customer balance accounted for 12.4% of net accounts receivable and did not have a balance older than 30 days as of December 31, 2020. For the year ended December 31, 2019, two customers had open accounts receivable balances which were above 10% of net accounts receivable, accounting for approximately 43% of net accounts receivable.\nCost of Services\nCost of services consists primarily of direct labor costs associated with support and customer onboarding and technology hosting costs and license costs associated with the cloud-based platform.\nCredit Card Processing Fees\nCredit card processing fees are included as a component of general and administrative expenses and are expensed as incurred.\nAdvertising Costs\nThe Company expenses advertising costs as incurred. Advertising and marketing expenses, excluding marketing team costs, were $3.06 million and $5.77 million for the years ended December 31, 2020 and 2019, respectively.\nCapitalized Cost of Obtaining a Contract\nThe Company capitalizes sales commission costs which are incremental to obtaining a contract. We expense costs that are related to obtaining a contract but are not incremental such as other sales and marketing costs and other costs that would be incurred regardless of if the contract was obtained. Capitalized costs are amortized using straight-line amortization over the estimated weighted average life of the customer, which we have estimated to be 3 years. At December 31, 2020, the net carrying value of the capitalized cost of obtaining a contract was $1.27 million, of which $0.69 million is included in other current assets and $0.58 million is included in other long-term assets. At December 31, 2019, the net carrying value of the capitalized cost of obtaining a contract was $1.20 million, of which $0.68 million is included in other current assets and $0.52 million is included in other long-term assets. The Company amortized costs directly attributable to obtaining contracts of $0.82 million and $0.80 million during the years ended December 31, 2020 and 2019, respectively.\nStock Compensation\nWe account for stock-based compensation in accordance with FASB ASC 718 Compensation - Stock Compensation, which requires companies to measure the cost of employee services received in exchange for an award of an equity instrument based on the grant-date fair value of the award. The Company also provides stock-based compensation to non-employee directors which are treated as employees for the purpose of stock-based compensation in accordance with ASC 718. Stock-based compensation expense is recognized on a straight-line basis over the requisite service period for stock options. Stock-based compensation expense for restricted stock units and restricted stock awards with service based graded vesting schedules are recorded on a straight-line basis over the requisite vesting period as if the award were, in substance, a single award.\nNet Loss Per Share\nBasic net loss per share is computed by dividing net loss by the weighted average number of common shares outstanding for the period. Diluted net loss per share is computed by giving effect to all potentially dilutive common stock equivalents for the period. For purposes of this calculation, options to purchase common stock, warrants, and the conversion option of the Convertible Notes (Note 6) are considered to be potential common shares outstanding. Since the Company incurred net losses for each of the periods presented, diluted net loss per share is the same as basic net loss per share. The Company’s potential common shares outstanding were not included in the calculation of diluted net loss per share as the effect would be anti-dilutive.\nComprehensive Income or Loss\nComprehensive income or loss includes all changes in equity during a period from non-owner sources, such as net income or loss and foreign currency translation adjustments.\nRecently Issued Accounting Standards\nRecent accounting standards not included below are not expected to have a material impact on our consolidated financial position and results of operations.\nIn January 2017, the FASB issued ASU 2017- 04 simplifying the accounting for goodwill impairment by removing Step 2 of the goodwill impairment test. Under current guidance, Step 2 of the goodwill impairment test requires entities to calculate the implied fair value of goodwill in the same manner as the amount of goodwill recognized in a business combination by assigning the fair value of a reporting unit to all of the assets and liabilities of the reporting unit. The carrying value in excess of the implied fair value is recognized as goodwill impairment. Under the new standard, goodwill impairment is recognized based on Step 1 of the current guidance, which calculates the carrying value in excess of the reporting unit’s fair value. The new standard is effective beginning in January 2021, with early adoption permitted. The Company adopted this ASU on January 1, 2020 and has applied the provisions to quantitative goodwill impairment assessments performed in 2020. (See Note 4).\nIn December 2019, the FASB issued ASU No. 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes. This new accounting guidance removes:\n1.\nthe exception to the incremental approach for intraperiod tax allocations when there is a loss from continuing operations and income or gain from other items such as discontinued operation or other comprehensive income,\n2.\nthe exception to the requirement to recognize a deferred tax liability for equity method investments when a foreign subsidiary becomes an equity method investment,\n3.\nthe exception to the ability not to recognize a deferred tax liability for a foreign subsidiary when a foreign equity method investment becomes a subsidiary, and\n4.\nthe exception to the general methodology for calculating income taxes in an interim period when a year-to-date loss exceeds the anticipated loss for the year.\nThe new accounting guidance also simplifies the accounting for income taxes by:\n1.\nrequiring an entity to recognize franchise tax that is partially based on income as an income-based tax and account for any incremental amount incurred as a non-income-based tax,\n2.\nrequiring that an entity evaluate when a step up in the tax basis of goodwill should be considered part of the business combination in which the book goodwill was originally recognized and when it should be considered a separate transaction,\n3.\nspecifying that an entity is not required to allocate the consolidated amount of current and deferred tax expense to a legal entity that is not subject to tax in its separate financial statements,\n4.\nrequiring that an entity reflect the effect of an enacted change in tax laws or rates in the annual effective tax rate computation in the interim period that includes the enactment date, and\n5.\nmaking minor Codification improvements for income taxes related to employee stock ownership plans and investments in qualified affordable housing projects accounted for using the equity method.\nThis standard is effective for fiscal and interim periods beginning after December 15, 2020. The Company anticipates that the adoption of this standard will not have a material impact on its financial statements.\nNote 3: Acquisitions\nOn November 21, 2019, the Company acquired substantially all the assets and assumed certain liabilities of the Perfect Audience business unit from Marin Software Incorporated, a Delaware corporation for cash consideration of $4.6 million. The acquired assets and liabilities were assigned to SharpSpring’s wholly owned subsidiary, SharpSpring Reach, Inc. Perfect Audience is a cloud-based platform that provides display retargeting software services. The transaction was structured as an asset purchase, whereby SharpSpring acquired all of Perfect Audience’s assets used in connection with the business (excluding certain pre-acquisition receivables, cash, and cash equivalents) and only liabilities pertaining to the business such as deferred revenue, accrued publisher costs, accrued bonuses for to the acquired workforce, and any liabilities accruing on or after November 21, 2019.\nThe allocation of the purchase price is based on management estimates and assumptions, and other information compiled by management, which utilized established valuation techniques appropriate for the industry. The valuation included a combination of the income approach and cost approach, depending upon which was the most appropriate based on the nature and reliability of the data available. The income approach is predicated upon the value of the future cash flows that an asset is expected to generate over its economic life. The cost approach considers the cost to replace (or reproduce) the asset and the effects on the assets value of physical, functional, and/or economic obsolescence that has occurred with respect to the asset.\nThe following represents the final allocation of the purchase price to the acquired net tangible and intangible assets acquired and liabilities assumed by SharpSpring:\nCash Consideration\n$ 4,566,402\nAdd:\nNet tangible liabilities acquired\nDeferred Revenue\n$ 186,500\nAccrued expenses and other current liabilities\n$ 545,473\nTotal liabilities\n$ 731,973\nLess:\nNet tangible assets acquired\nAccounts receivable\n$ (55,236 )\nOther current assets\n$ (20,719 )\nTotal tangible assets\n$ (75,955 )\nIntangible assets acquired:\nTrade names\n$ (381,000 )\nTechnology\n$ (979,000 )\nVendor relationships\n$ (1,813,000 )\nTotal intangible assets\n$ (3,173,000 )\nGoodwill\n$ 2,049,420\nAcquired intangible assets include developed technology and vendor relationships which are amortized over ten years. The acquired trade name assets have an indefinite life and will be tested for impairment at least annually.\nThe excess of purchase consideration over the fair value of net tangible and identifiable intangible assets acquired was recorded as goodwill of $2.05 million. Goodwill will not be amortized but instead tested for impairment at least annually (more frequently if certain indicators are present). Goodwill arose primarily as a result of the expected future growth of the Perfect Audience product and the assembled workforce. For additional information regarding goodwill and intangibles see Note 4. The transaction costs associated with the acquisition were approximately $0.18 million and were recorded in general and administrative expense during 2019.\nThe Company uses its best estimates and assumptions to assign fair value to the tangible and intangible assets acquired and liabilities assumed at the acquisition date. The Company’s estimates are inherently uncertain and subject to refinement.\nPro Forma Results of Operations (Unaudited)\nThe following table summarizes selected unaudited pro forma consolidated statements of operations data for the years ended December 31, 2020 and 2019 as if the acquisition of Perfect Audience had been completed at the beginning of 2019.\nYear Ended\nDecember 31,\nNet revenues\n$ 29,287,882\n$ 25,408,526\nGross profit\n21,225,318\n17,201,321\nNet loss\n(5,829,029 )\n(12,043,201 )\nNet (loss) per share, basic and diluted\n$ (0.50 )\n$ (1.17 )\nThis selected unaudited pro forma consolidated financial data is included only for the purpose of illustration and does not necessarily indicate what the operating results would have been if the acquisitions had been completed on that date. Moreover, this information does not indicate what the Company's future operating results will be. The information for 2019 prior to the acquisitions is included based on prior accounting records maintained by Marin Software Incorporated prior to the acquisition from SharpSpring. For 2020 and 2019, this information includes actual data recorded in our consolidated financial statements for the period subsequent to the date of the acquisition. The Company’s consolidated statement of operations for the years ended December 31, 2019 include net revenue and net loss of $0.27 million and $0.1 million, respectively, attributable to the acquisition.\nNote 4: Goodwill and Other Intangible Assets\nGoodwill and acquired intangible assets are initially recorded at fair value and measured periodically for impairment. The Company also evaluates its reporting units at least annually. During our annual review of reporting units, we determined Perfect Audience met the requirements of a separate reporting unit under ASC 280. The Company’s evaluation of goodwill for impairment involves the comparison of the fair value of each reporting unit to its carrying value. The fair value of each reporting unit is estimated using a weighting of income and market approaches which require the use of estimates and assumptions related to cash flow forecasts, comparable public companies, discount rates, and terminal values.\nIn performing the Company’s annual impairment analysis during the fourth quarters of 2020 and 2019, the Company determined that the carrying amount of the Company’s goodwill was recoverable for the Company’s SharpSpring Marketing Automation reporting unit. However, during the Company’s annual impairment analysis during the fourth quarter of 2020, it was determined that carrying value of the Perfect Audience reporting unit exceeded its fair value by approximately $0.71 million. The goodwill acquired in the acquisition of the Perfect Audience Retargeting reporting unit of approximately $2.05 million was therefore impaired by $0.71 million, reducing its goodwill to approximately $1.34 million.\nGoodwill decreased from $10.92 million as of December 31, 2019 to $10.25 million as of December 31, 2020. The decrease in goodwill is largely attributable to the impairment of goodwill of Perfect Audience recorded in the fourth quarter of 2020. This decrease in the carrying value of goodwill was slightly offset by an increase in the carrying value due to changes in foreign currency exchange rates. During the year ended December 31, 2020 and 2019, changes in foreign currency exchange rates increased goodwill by approximately $40,000 and approximately $7,000, respectively.\nIn addition to our annual goodwill impairment review, the Company also performs periodic reviews of the carrying value and amortization periods of other acquired intangible assets. If indicators of impairment are present, an estimate of the undiscounted cash flows that the specific asset is expected to generate must be made to ensure that the carrying value of the asset can be recovered. These estimates involve significant subjectivity.\nDuring the years ended December 31, 2020 and 2019, the Company determined that no indicators of impairment were present for other acquired intangible assets. The Company performed an annual fair value impairment analysis for our indefinite lived trade name asset. The fair value was determined to exceed the carrying value and therefore no impairment was recorded for this asset.\nThe following tables set forth the information for intangible assets subject to amortization and for intangible assets not subject to amortization.\nAs of December 31, 2020\nGross\nNet\nCarrying\nAccumulated\nCarrying\nAmount\nAmortization\nValue\nAmortized intangible assets:\nTrade names\n$ 501,000\n(120,000 )\n$ 381,000\nTechnology\n3,109,000\n(1,513,751 )\n1,595,249\nCustomer relationships\n1,320,000\n(892,004 )\n427,996\nVendor relationships\n1,813,000\n(201,394 )\n1,611,606\nUnamortized intangible assets:\n6,743,000\n(2,727,149 )\n4,015,851\nGoodwill\n10,250,088\nTotal goodwill and intangible assets\n$ 14,265,939\nAs of December 31, 2019\nGross\nNet\nCarrying\nAccumulated\nCarrying\nAmount\nAmortization\nValue\nAmortized intangible assets:\nTrade names\n$ 501,000\n(120,000 )\n$ 381,000\nTechnology\n3,109,000\n(1,192,000 )\n1,917,000\nCustomer relationships\n1,320,000\n(773,000 )\n547,000\nVendor relationships\n1,813,000\n-\n1,813,000\nUnamortized intangible assets:\n6,743,000\n(2,085,000 )\n4,658,000\nGoodwill\n10,922,814\nTotal goodwill and intangible assets\n$ 15,580,814\nEstimated amortization expense for 2020 and subsequent years is as follows:\n559,200\n507,200\n459,200\n420,200\n390,200\nThereafter\n1,298,851\nIndefinite Lived\n381,000\nTotal\n$ 4,015,851\nAmortization expense for the years ended December 31, 2020 and 2019, was $0.64 million and $0.38 million, respectively. The increase in amortization expense relates to the intangible assets acquired in the acquisition of Perfect Audience in November 2019.\nNote 5: Credit Facility\nIn March 2016, the Company entered into a $2.5 million revolving loan agreement (the “Credit Facility”) with Western Alliance Bank. The agreement originally matured on March 21, 2018 and was amended to mature on June 19, 2022. There are no mandatory amortization provisions, and the Credit Facility is payable in full at maturity. As of December 31, 2020, the Credit Facility is collateralized by a lien on substantially all of the existing and future assets of the Company and secured by a pledge of 100% of the capital stock of SharpSpring Technologies, Inc. and a 65% pledge of the Company’s foreign subsidiaries’ stock. The Credit Facility subjects the Company to a number of restrictive covenants, including financial and non-financial covenants customarily found in loan agreements for similar transactions. The Credit Facility also restricts our ability to pay cash dividends on our common stock. As of December 31, 2020, the Credit Facility carried an interest rate of 5.0% and there was $1.90 million outstanding on the Line of Credit. As of December 31, 2019, there was no amount outstanding on the Line of Credit. The Company has a $0.60 million available credit limit on its corporate credit cards which reduces the balance available on the Credit Facility. The interest expense relating to the Credit of Facility for the years ended December 31, 2020 and 2019 was $0.08 million and $0, respectively. No events of default have occurred.\nNote 6: Convertible Notes\nIn March 2018, the Company issued $8.0 million five-year convertible notes (the “Notes”) with an interest rate of 5% “payable in kind”. SharpSpring received net proceeds from the offering of approximately $7.9 million after adjusting for debt issue costs, including financial advisory and legal fees. The Notes were unsecured obligations and were subordinate in right of payment to the Credit Facility (Note 5). The balance was zero as of December 31, 2020.\nThe Notes were recorded upon issuance at amortized cost in accordance with applicable accounting guidance. As there was no difference in the amount recorded at inception and the face value of the Notes, interest expense was accreted at the stated interest rate under the terms of the Notes. Total interest expense related to the Notes was impacted by the amortization of the debt issuance cost using the effective interest method.\nIn accordance with generally accepted accounting principles for convertible debt certain features were determined to be “embedded derivatives” and were bifurcated from the Notes and separately accounted for on a combined basis at fair value as a single derivative. The fair value of the derivatives was $0 at December 31, 2019. There was no embedded derivative liability during 2020. The derivative was accounted for at fair value, with subsequent changes in the fair value to be reported as part of other income (expense), net in the Consolidated Statement of Comprehensive Loss.\nWe incurred certain third-party costs in connection with our issuance of the Notes, principally related to financial advisory and legal fees, which were amortized to interest expense ratably over the five-year term of the Notes. The following table sets forth total interest expense related to the Notes for the years ended December 31, 2020 and 2019:\nYear Ended\nDecember 31,\nContractual interest paid-in-kind expense (non-cash)\n$ -\n$ 139,372\nAmortization of debt issuance costs (non-cash)\n-\n15,108\nAmortization of embedded derivative (non-cash)\n-\n(12,205 )\nTotal interest expense\n$\n-\n$ 142,275\nEffective interest rate\n0.0 %\n4.9 %\nNote 7: SBA Paycheck Protection Program Loans\nIn April 2020 SharpSpring entered into two loan agreements with United States Small Business Administration under the Paycheck Protection Program for a total loan amount of $3.40 million, (“SBA Loans”). The SBA Loans have a maturity date of 2 years from the initial disbursement and carries an interest rate of 1% per year. The SBA Loans are eligible for forgiveness as part of the CARES Act approved by US Congress on March 19, 2020 if certain requirements are met. The Company continues to evaluate and monitor the requirements of the CARES Act that allow for forgiveness. As of December 31, 2020, the Company has filed the application for forgiveness with SBA but has not yet received a decision from the SBA as to whether the full or a part of the loans will be forgiven. The Company has not paid principal or interest relating to the SBA loans as of December 31, 2020. The accrued interest expense relating to these loans for years ended December 31, 2020 and 2019 was approximately $0.02 million and $0, respectively. As of December 31, 2020, the SBA loans had an outstanding principal balance of $3.40 million included in notes payable on the Consolidated Balance Sheet.\nDebt\nObligation\n2,630,962\n768,538\n-\n-\n-\nThereafter\n-\nTotal Commitments\n$ 3,399,500\nNote 8: Leases\nThe Company currently rents its primary office facility under a ten-year lease which started in November 2018 (the “2018 Lease”). The term of the lease may be extended for an additional 5 years in incremental one-year periods, subject to certain conditions described in the 2018 Lease. In September 2019, the Company entered into an addendum agreement to the 2018 Lease (the “2019 Addendum”) to lease an additional square feet of office space located on the same premises as the 2018 Lease. In May 2020, the Company took possession of the full space included in the 2019 addendum, accounting for approximately an additional 18,000 square feet. The rent expense and future payments associated with the additional square feet are included in the future minimum lease payments table below. The additional space resulted in an increased lease liability and right-of-use asset of approximately $3.8 million. The term of the addendum extends through the same period as the 2018 Lease. We do not assume renewals in our determination of lease term unless the renewals are deemed to be reasonably assured at lease commencement. The Company continues to evaluate the likelihood of renewal of the 2018 Lease and 2019 Addendum. At the commencement of the 2018 Lease nor subsequently thereafter, renewal has not been reasonably assured.\nDetermination of whether a contract contains a lease is determined at execution of the contract based on the facts of each contract. The Company elected the package of practical expedients permitted under ASC 842 which allows us to carryforward historical lease classification, assessment on whether a contract was or contains a lease, and initial direct costs for any leases that existed prior to adoption of the standard. The Company has lease agreements with lease and non-lease components, which it has elected to combine for all leases. In addition, the Company does not recognize right-of-use assets or lease liabilities for leases with a term of 12 months or less (“Short-term” leases). Short-term lease payments are recognized in the consolidated statements of comprehensive loss on a straight-line basis over the lease term. The Company is not party to any financing leases.\nThe weighted average remaining lease term as of December 31, 2020 is 7.9 years. The weighted average discount rate for our operating leases as of December 31, 2020 is 6.5%. The discount rate of each lease is determined by the Company’s incremental borrowing rate at the time of a lease contract. The lease cost associated with short-term leases for the years ended December 31, 2020 and 2019, were $0 for both periods. Total operating lease costs for the years ended December 31, 2020 and 2019 was $1.21 million and $0.80 million, respectively.\nOperating\nLeases\n1,321,598\n1,329,525\n1,369,159\n1,377,086\n1,416,720\nThereafter\n4,109,161\nTotal undiscounted cash flows\n$ 10,923,249\nLess imputed interest remaining\n(2,426,724 )\nPresent value of lease liability\n$ 8,496,525\nNote 9: Net Loss Per Share\nBasic net loss per share is computed by dividing net loss by the weighted average number of common shares outstanding for the period. Diluted net loss per share is computed by giving effect to all potential dilutive common stock equivalents for the period. For purposes of this calculation, options to purchase common stock, warrants, restricted stock units (“RSUs”) and the conversion option of the Convertible Notes (Note 6) are considered to be potential common shares outstanding.\nComputation of net loss per share is as follows:\nYear Ended\nDecember 31,\nNet loss\n$ (5,829,029 )\n$ (12,387,976 )\nBasic weighted average common shares outstanding\n11,611,020\n10,323,889\nAdd incremental shares for:\nStock options\n-\n-\nRestricted stock units (RSUs)\n-\n-\nDiluted weighted average common shares outstanding\n11,611,020\n10,323,889\nNet loss per share:\nBasic and Diluted\n$ (0.50 )\n$ (1.20 )\nAdditionally, since the Company incurred net losses for each of the periods presented, diluted net loss per share is the same as basic net loss per share. The Company’s outstanding, stock options and unvested RSUs were not included in the calculation of diluted net loss per share as the effect would be anti-dilutive. The following table contains all potentially dilutive common stock equivalents:\nYear Ended\nDecember 31,\nStock options\n1,383,057\n1,470,406\nRestricted stock units (RSUs)\n61,120\n50,494\nTotal\n1,444,177\n1,520,900\nNote 10: Income Taxes\nIncome taxes for years ended December 31, is summarized as follows:\nYear Ended\nDecember 31,\nCurrent Provision\nFederal\n$ (1,557,344 )\n$ -\nState\n(8,068 )\n25,236\nForeign\n59,447\n4,113\nCurrent Income Tax Provision\n$ (1,505,965 )\n$ 29,349\nDeferred Provision\nFederal\n$ -\n$ -\nState\n-\n-\nForeign\n-\n-\nDeferred Income Tax Provision\n-\n-\nTotal Income Tax Provision\n$ (1,505,965 )\n$ 29,349\nA reconciliation of income tax for continuing operations computed at the U.S. statutory rate to the effective income tax rate is as follows:\nYear Ended\nYear Ended\nDecember 31,\nDecember 31,\nAmount\nPercent\nAmount\nPercent\nFederal statutory rates\n$ (1,533,631 )\n21 %\n$ (2,594,415 )\n21 %\nState income taxes, net of federal benefit\n(556,596 )\n8 %\n(68,162 )\n1 %\nPermanent differences\n16,977\n0 %\n(46,592 )\n0 %\nPerm Differences - Debt Conversion\n-\n0 %\n454,166\n-4 %\nPerm Differences - Stock Compensation\n(359,109 )\n5 %\n-\n0 %\nNOL Carryback - CARES Act\n(406,530 )\n6 %\n-\n0 %\nOther\n62,222\n-1 %\n(85,997 )\n1 %\nCredits\n(685,389 )\n9 %\n(227,213 )\n2 %\nForeign\n(23,754 )\n0 %\n(22,820 )\n0 %\nValuation Allowance\n1,979,845\n-27 %\n2,620,382\n-21 %\nEffective rate\n$ (1,505,965 )\n21 %\n$ 29,349\n0 %\nThe following is a summary of the components of the Company’s deferred tax assets:\nAs of December 31,\nDeferred tax assets:\nStock-based compensation\n347,865\n274,364\nDepreciation\n(36,470 )\n(63,980 )\nIntangibles\n723,031\n590,427\nNOL\n7,628,443\n5,893,260\nAccruals & Reserves\n259,893\n267,980\nNet deferred tax Valuation allowance\n(8,922,762 )\n(6,962,051 )\nNet deferred tax assets (liabilities)\n-\n-\nOn March 27, 2020, the Coronavirus Aid, Relief, and Economic Security Act (the “CARES Act”) was enacted into the law. The CARES Act contained many income tax relief provisions including allowing for a 5-year carryback of Federal net operating losses generated in tax years beginning in 2018, 2019, and 2020. As required under U.S. GAAP, the effects of tax law changes are recognized in the period of enactment. As a result of the CARES Act, we recorded an income tax benefit in the amount of approximately $1.56 million associated with the CARES Act related to the carryback of the Company’s 2018 federal net operating loss. The Company received a tax refund of approximately $1.6 million during 2020.\nThe Company has federal operating loss carryforwards of $20.69 million and $18.39 million as of December 31, 2020 and 2019. The Company has foreign operating loss carryforwards of $3.74 million and $3.44 million as of December 31, 2020 and 2019, respectively. The Company has state operating loss carryforwards of $26.48 million and $19.25 million as of December 31, 2020 and 2019, respectively. Depending on the jurisdiction, some of these operating loss carryovers will begin to expire within 7 years, while other net operating losses can be carried forward indefinitely as long as the Company is operating.\nValuation Allowance\nWe record a deferred tax asset if we believe that it is more likely than not that we will realize a future tax benefit. Ultimate realization of any deferred tax asset is dependent on our ability to generate sufficient future taxable income in the appropriate tax jurisdiction before the expiration of carryforward periods, if any. Our assessment of deferred tax asset recoverability considers many different factors including historical and projected operating results, the reversal of existing deferred tax liabilities that provide a source of future taxable income, the impact of current tax planning strategies and the availability of future tax planning strategies. We establish a valuation allowance against any deferred tax asset for which we are unable to conclude that recoverability is more likely than not. This is inherently judgmental, since we are required to assess many different factors and evaluate as much objective evidence as we can in reaching an overall conclusion. The particularly sensitive component of our evaluation is our projection of future operating results since this relies heavily on our estimates of future revenue and expense levels by tax jurisdiction.\nWe have established valuation allowances of $8.9 million and $7.0 million as of December 31, 2020 and December 31, 2019, respectively, against certain deferred tax assets given the uncertainty of recoverability of these amounts.\nIn making our assessment of deferred tax asset recoverability, we considered our historical financial results, our projected future financial results, the planned reversal of existing deferred tax liabilities and the impact of any tax planning actions. Based on our analysis we noted both positive and negative factors relative to our ability to support realization of certain deferred tax assets. However, based on the weighting of all the evidence, including the near-term effect on our income projections of investments we are making in our team, product and systems infrastructure, we concluded that it was more likely than not that the majority of our deferred tax assets related to temporary differences and net operating losses may not be recovered. The establishment of a valuation allowance has no effect on our ability to use the underlying deferred tax assets prior to expiration to reduce cash tax payments in the future to the extent that we generate taxable income.\nThe Company accrued $60,639 and $0 as of December 31, 2020 and December 31, 2019, respectively, for the liability for unrecognized tax benefits. The Company anticipates the unrecognized tax benefits will be recognized in the next twelve months.\nThe following table summarizes the Company’s unrecognized tax benefits at December 31, 2020 and December 31, 2019, respectively:\nAs of December 31,\nBeginning of year\n$ -\n$ -\nIncrease due to current year tax positions\n-\n-\nIncrease due to prior year tax positions\n60,639\n-\nSettlements\n-\n-\nDecrease due to lapses\n-\n-\nEnd of year\n$ 60,639\n$ -\nThe Company files federal, state and local income tax returns globally. The Company’s major tax jurisdictions are the U.S., Switzerland and Luxembourg. As of December 31, 2020, the open tax years for the Company’s major tax jurisdictions are 2017 through 2020. The Company received notification January 14, 2020 that its Swiss subsidiary, InterInbox SA is under examination from the Switzerland Federal Tax Administration for the years 2015 through 2018. The Company does not expect any material adjustments as a result of the audit.\nNote 11: Defined Contribution Retirement Plan\nWe offer our U.S. employees the ability to participate in a 401(k) plan. Eligible U.S. employees can contribute up to 100% of their eligible compensation, subject to limitations established by the Internal Revenue Code. Through April 30, 2020, the Company contributed a matching contribution equal to 100% of each such participant’s contribution up to the first 3% of their annual eligible compensation. We charged approximately $0.12 million and $0.3 million, to expense in the years ended December 31, 2020 and 2019, respectively, associated with our matching contribution in those periods.\nNote 12: Related Party Transactions\nIntercompany transactions have been eliminated in our consolidated financial statements. The convertible notes issued in March 2018 were held directly by SHSP Holdings, LLC (“SHSP Holdings”). Daniel C. Allen, a now former director of SharpSpring Inc., is the founder and manager of Corona Park Investment Partners, LLC (“CPIP”). CPIP is a member of Evercel Holdings, LLC and is a member and sole manager of SHSP Holdings. Evercel, Inc. is a member and the manager of Evercel Holdings, LLC and is a member of SHSP Holdings. In May 2019, the Company and SHSP Holdings entered into and made effective a Note Conversion Agreement as outlined in Note 6 above. There were no other material related party transactions for the periods presented.\nNote 13: Stock-Based Compensation\nFrom time to time, the Company grants stock option and restricted stock units awards to officers and employees and grants stock awards to directors as compensation for their service to the Company.\nIn November 2010, the Company adopted the 2010 Stock Incentive Plan (the “2010 Plan”) which was restated in its entirety in August 2018. As amended, up to 2,600,000 shares of common stock are available for issuance under the Plan. The Plan provides for the issuance of stock options and other stock-based awards. The 2010 Plan expired on September 14, 2020 (except as to options outstanding as of this date).\nIn April 2019, the Company adopted the 2019 Equity Incentive Plan (the “2019 Plan”). Upon adoption of the 2019 Plan no additional awards were granted under the 2010 Plan. No more than 697,039 shares of common stock, plus the number of shares of common stock underlying any award granted under the 2010 Plan that expires, terminates, is canceled, or is forfeited shall be available for grant under the 2019 Plan. The Plan was amended in July 2020 to include up to 1,025,000 shares of commons stock, plus the number of shares of common stock underlying any award granted under the 2010 Plan that expires, terminates, is canceled, or is forfeited to be available for issuance under the 2019 Plan. The Plan provides for the issuance of stock options and other stock-based awards. The 2019 Plan provides for the issuance of stock options and other stock-based awards. During the terms of the Awards, the Company shall keep available at all times the number of shares of Common Stock required to satisfy such Awards.\nStock Options\nStock option awards under the 2010 Plan and 2019 Plan (the “Plans”) have a 10-year maximum contractual term and, subject to the provisions regarding Ten Percent Shareholders, must be issued at an exercise price of not less than 100% of the fair market value of the common stock at the date of grant. The Plans are administered by the Board of Directors, which has the authority to determine to whom options may be granted, the period of exercise, and what other restrictions, if any, should apply. Vesting for awards granted to date under the Plans is principally over four years from the date of the grant, with 25% of the award vesting after one year and monthly vesting thereafter.\nOption awards are valued based on the grant date fair value of the instruments, net of estimated forfeitures, using a Black-Scholes option pricing model with the following assumptions:\nYear Ended\nDecember 31,\nVolatility\n52%-58%\n49% - 52%\nRisk free interest rate\n0.37% - 1.66%\n1.45% - 2.59%\nExpected term\n6.25 years\n6.25 years\nThe weighted average grant date fair value of stock options granted during the years ended December 31, 2020 and 2019 was $5.11 and $6.24, respectively.\nFor grants prior to January 1, 2015, the volatility assumption was based on historical volatility of similar sized companies due to lack of historical data of the Company’s stock price. For all grants subsequent to January 1, 2015, the volatility assumption reflects the Company’s historic stock volatility for the period of February 1, 2014 forward, which is the date the Company’s stock began actively trading. The risk-free interest rate was determined based on treasury securities with maturities equal to the expected term of the underlying award. The expected term was determined based on the simplified method outlined in Staff Accounting Bulletin No. 110.\nStock option awards are expensed on a straight-line basis over the requisite service period. During the years ended December 31, 2020 and 2019, the Company recognized expense of approximately $1.12 million and $1.08 million, respectively, associated with stock option awards. At December 31, 2020, future stock compensation expense associated with stock options (net of estimated forfeitures) not yet recognized was approximately $2.17 million and will be recognized over a weighted average remaining vesting period of 2.45 years. The following summarizes stock option activity for the year ended December 31, 2020:\nWeighted\nWeighted\nAggregate\nNumber of\nAverage\nAverage Remaining\nIntrinsic\nOptions\nExercise Price\nContractual Life\nValue\nOutstanding at December 31, 2019\n1,470,406\n$ 7.30\n7.5\n$ 6,604,461\nGranted\n475,605\n9.90\nExercised\n(241,843 )\n5.21\nExpired\n(45,042 )\n9.60\nForfeited\n(276,069 )\n11.73\nOutstanding at December 31, 2020\n1,383,057\n$\n7.60\n7.13\n$ 12,000,790\nExercisable at December 31, 2020\n771,240\n$\n6.20\n5.94\n$ 7,773,258\nThe total intrinsic value of stock options exercised during the years ended December 31, 2020 and 2019 was $2.42 million and $1.93 million, respectively.\nRestricted Stock Units\nThe 2019 Plan allows for the granting of Restricted Stock Units (“RSUs”). Under the 2019 Plan the Board of Directors has the authority to determine whom RSUs may be granted, the period of exercise, and what other restrictions, if any, should apply. RSUs have a value equal to the fair market value of an identical number of shares of Common Stock, which may, but need not, provide that such restricted award may not be sold, assigned, transferred or otherwise disposed of, pledged or hypothecated as collateral for a loan or as security for the performance of any obligation or for any other purpose for a period determined by the Board of Directors. Vesting for awards granted to date under the 2019 Plan is generally over three years from the date of the grant, with 33% of the award vesting after one year and monthly vesting thereafter.\nRSUs are expensed using a graded vested schedule which are recorded on a straight-line basis over the requisite vesting period as if the award were, in substance, a single award. During the years ended December 31, 2020 and 2019, the Company recognized expense associated with RSUs of approximately $0.2 million and $9,000, respectively. At December 31, 2020, future stock compensation expense associated with stock awards (net of estimated forfeitures) not yet recognized was approximately $0.66 million and will be recognized over a weighted average remaining vesting period of 3.3 years. The following summarizes RSU activity for the year ended December 31, 2020:\nWeighted\nAverage\nGrant Date\nNumber of\nFair Value\nUnits\nPer Share\nUnvested at December 31, 2019\n50,494\n$ 11.82\nGranted\n73,775\n14.60\nVested\n(12,655 )\n12.39\nForfeited\n(50,494 )\n11.82\nUnvested at December 31, 2020\n61,120\n$ 15.06\nStock Awards\nThe 2019 Plan allows for the granting of Restricted Stock Awards (“RSAs”). Under the 2019 Plan the Board of Directors has the authority to determine whom RSAs may be granted and what other restrictions, if any, should apply. Non-employee Stock awards shares are generally immediately vested. Employee Stock award shares are vested principally over two years from the date of the grant, with 50% of the award vesting after one year and monthly vesting thereafter.\nStock awards are valued based on the closing price of our common stock on the date of grant, and compensation cost is recorded immediately if there is no vesting period. For awards granted that contain a graded vesting schedule, and the only condition for vesting is a service condition, compensation cost is recognized on a straight-line basis over the requisite vesting period as if the award were, in substance, a single award. During the years ended December 31, 2020, and 2019, the Company recognized expense of approximately $0.21 million and $0.13 million, respectively, associated with Stock Awards. At December 31, 2020, future stock compensation expense associated with stock awards (net of estimated forfeitures) not yet recognized was approximately $0.07 million and will be recognized over a weighted average remaining vesting period of 1.25 years. The following summarizes Stock Award activity for the year ended December 31, 2020:\nWeighted\nAverage\nGrant Date\nNumber of\nFair Value\nUnits\nPer Share\nUnvested at December 31, 2019\n-\n$ -\nGranted\n30,959\n9.82\nVested\n(18,159 )\n10.00\nForfeited\n(1,222 )\n9.57\nUnvested at December 31, 2020\n11,578\n$ 9.57\nDuring the years ended December 31, 2020 and 2019, the Company issued 14,624 and 10,286 shares, respectively, to non-employee directors as compensation for their service on the board.\nNote 14: Warrants\nOn January 30, 2014, in connection with an $11.5 million financing transaction, the Company issued 80,000 warrants to purchase common stock at an exercise price of $7.81 per share with a term of 5 years. The fair value of the warrants was determined using the Black-Scholes option valuation model. These warrants became exercisable on January 30, 2015. The remaining 30,000 of the outstanding warrants were exercised in May and August 2019. No other warrants have been issued since January 30, 2014. As of December 31, 2020, and 2019 there were no warrants outstanding.\nNote 15: Commitments and Contingencies\nWe record a liability for contingencies if an unfavorable outcome is probable and the amount of loss can be reasonably estimated, including expected insurance coverage. For contingencies where the reasonable estimate of loss is a range, we record a best estimate of loss within the range.\nLitigation\nFrom time to time the Company may become involved in legal proceedings or be subject to claims arising in the ordinary course of its business. Although the results of litigation and claims cannot be predicted with certainty, the Company currently believes that the final outcome of these ordinary course matters will not have a material adverse effect on its business, operating results, financial condition or cash flows. Regardless of the outcome, litigation can have an adverse impact on the Company because of defense and settlement costs, diversion of management resources and other factors. The Company is not currently a party to any litigation of a material nature.\nCommitments\nThe Company is not party to any non-cancellable contracts that create a material future commitment other than its leases as described in Note 8 and SBA Loans as described in Note 7.\nSales and Franchise Taxes\nState, local and foreign jurisdictions have differing rules and regulations governing sales, franchise, use, value added and other taxes. These rules and regulations are subject to varying interpretations that may change over time. In particular, the applicability of such taxes to SaaS products in various jurisdictions is unclear. Further, these jurisdictions’ rules regarding tax nexus vary significantly and are complex. As such, we could face possible tax assessments and audits. A successful assertion, by any of these taxing authorities, that we should be collecting additional sales, use, value added or other taxes in jurisdictions where we have not historically done so and do not accrue for such taxes could result in tax liabilities and related penalties for past sales, discourage customers from purchasing our products or otherwise harm our business and operating results. We continue to evaluate the impact of various tax types which may require future sales, franchise, or other tax payments. During the year ended December 31, 2020, the Company recorded an accrual of $0.28 million to general and administrative expenses in the consolidated statements of comprehensive loss related to a contingent sales tax liability. The $0.28 million accrued is the amount SharpSpring was able to reasonably estimate and is probable in accordance with ASC 450 “Contingencies”. The Company estimates that the total range of exposure related to sales tax contingent liability is approximately $0.20 million to $0.55 million. SharpSpring is unable to estimate the exact amount of the liability due to the complex and varying nature of state by state nexus laws.\nEmployment Agreements\nThe Company has employment agreements with several members of its leadership team and executive officers.\nNote 16: Disaggregation of Revenue\nThe Company operates as one reportable segment with two operating segments. Our operating segments consist of our SharpSpring Marketing Automation segment and Perfect Audience Ad Retargeting segment in accordance with ASC 280. Operating segments are defined as components of an enterprise for which separate financial information is regularly evaluated by the chief operating decision maker (“CODM”), which is the Company’s chief executive officer, in deciding how to allocate resources and assess performance. The Company’s CODM evaluates the Company’s financial information and resources and assess the performance of these resources between our two operating segments. We do not separately allocate operating expenses, nor do we fully allocate assets to these operating segments. In accordance with ASC 280, we aggregate our two operating segments as one operating segment for financial reporting purposes. The Company does not present geographical information about revenues because it is impractical to do so. Disaggregated revenue for the years ended December 31, 2020 and 2019 are as follows:\nYear Ended\nDecember 31,\nRevenue by Product:\nMarketing Automation Revenue\n$ 26,593,304\n$ 22,204,479\nRetargeting Revenue\n2,517,149\n271,008\nMail + Product Revenue\n177,429\n223,899\nTotal Revenue\n$ 29,287,882\n$ 22,699,386\nRevenue by Type:\nRecurring Revenue\n$ 25,506,170\n$ 20,911,854\nRetargeting Revenue\n2,517,149\n271,008\nUpfront Fees\n1,264,563\n1,516,524\nTotal Revenue\n$ 29,287,882\n$ 22,699,386\nNote 17: Subsequent Events\nOn January 19, 2021, SharpSpring entered into an agreement with Marietta Davis to issue 8,479 shares of common stock in recognition of Ms. Davis’s previous service to the Company as a member of the Board of Directors. Ms. Davis served as a member of the Board of Directors of the Company from 2017 until her resignation as of August 17, 2020.\nIn April 2020, SharpSpring entered into two loan agreements with United States Small Business Administration under the Paycheck Protection Program for a total loan principal amount of $3.40 million, (“SBA Loans”) (Note 7). On March 11, 2021, one of the loans was forgiven for $166,975. The forgiveness amount includes the $165,500 principal and accrued interest of $1,475.71 as of March 11, 2021, $1,149 of which was accrued as of December 31, 2020. The other SBA Loan of $3.2 million remains outstanding and under review for forgiveness by the SBA as of March 22, 2021.\nINDEX TO EXHIBITS\nExhibit Number\nTitle of Document\nLocation\n3.1\nCertificate of Incorporation\nIncorporated by reference to our Form S-1 filed on December 2, 2010\n3.2\nAmendment to Certificate of Incorporation\nIncorporated by reference to our Form 8-K filed on December 17, 2013\n3.3\nAmendment to Certificate of Incorporation\nIncorporated by reference to our Form 8-K filed December 1, 2015\n3.4\nBylaws\nIncorporated by reference to our Form S-1 filed on December 2, 2010\n4.1\nForm of Convertible Promissory Note, Attached as Exhibit A to Convertible Note Purchase Agreement among SharpSpring, Inc. and SHSP Holdings, LLC dated March 28, 2018\nIncorporated by reference to our Form 8-K filed March 28, 2018\n4.2\nForm of Investors Rights Agreement by and among SharpSpring, Inc., SHSP Holdings, LLC et al. dated March 28, 2018\nIncorporated by reference to our Form 8-K filed March 28, 2018\n4.3\nForm of Subordination Agreement by and between SHSP Holdings, LLC and Western Alliance Bank dated March 28, 2018\nIncorporated by reference to our Form 8-K filed March 28, 2018\n4.4\nPromissory Note dated April 20, 2020 made by SharpSpring Reach, Inc. to Western Alliance Bank\nIncorporated by reference to the Company’s Form 8-K filed April 28, 2020\n4.5\nPromissory Note dated April 21, 2020 made by SharpSpring Technologies, Inc. to Western Alliance Bank\nIncorporated by reference to the Company’s Form 8-K filed April 28, 2020\n4.6\nSecurities registered under Section 12 of the Exchange Act\nIncorporated by reference to our Form 10-K filed March 16, 2020\n10.1\nConvertible Note Purchase Agreement among SharpSpring, Inc. and SHSP Holdings, LLC dated March 28, 2018\nIncorporated by reference to our Form 8-K filed March 28, 2018\n10.2\nNote Conversion Agreement, dated May 9, 2019, by and among SharpSpring, Inc., SHSP Holdings, LLC, and Evercel Holdings, LLC.\nIncorporated by reference to our Form 8-K filed May 9, 2019\n10.3\nShare Purchase Agreement among SharpSpring, Inc., Special Situations Private Equity Fund, L.P., Special Situations Technology Fund, L.P., Special Situations Technology Fund II, L.P., Greenhaven Road Capital Fund 1, L.P., and Greenhaven Road Capital Fund 2, L.P.\nIncorporated by reference to our Form 8-K filed November 22, 2019\n10.4\nRegistration Rights Agreement among SharpSpring, Inc., Special Situations Private Equity Fund, L.P., Special Situations Technology Fund, L.P., Special Situations Technology Fund II, L.P., Greenhaven Road Capital Fund 1, L.P., and Greenhaven Road Capital Fund 2, L.P.\nIncorporated by reference to our Form 8-K filed November 22, 2019\n10.5\nLoan Agreement dated March 21, 2016, by and among SharpSpring, Inc., Quattro Hosting LLC, SharpSpring Technologies, Inc. and Western Alliance Bank\nIncorporated by reference to our Form 8-K filed on March 22, 2016\n10.6\nIntellectual Property Security Agreement dated March 21, 2016, by and among SharpSpring, Inc., Quattro Hosting LLC, SharpSpring Technologies, Inc. and Western Alliance Bank\nIncorporated by reference to our Form 8-K filed on March 22, 2016\n10.7\nLoan and Security Modification Agreement dated June 24, 2016, by and among SharpSpring, Inc., Quattro Hosting LLC, SharpSpring Technologies, Inc. and Western Alliance Bank\nIncorporated by reference to our Form 8-K filed on June 28, 2016\n10.8\nLoan and Security Modification Agreement dated October 25, 2017, by and among SharpSpring, Inc., Quattro Hosting LLC, SharpSpring Technologies, Inc. and Western Alliance Bank\nIncorporated by reference to our Form 8-K filed on October 30, 2017\n10.9\nLoan and Security Modification Agreement dated April 30, 2018, by and among SharpSpring, Inc., Quattro Hosting LLC, SharpSpring Technologies, Inc. and Western Alliance Bank\nIncorporated by reference to the Company’s Form 8-K filed on May 1, 2018\n10.10\nLoan and Security Modification Agreement dated March 21, 2019, by and among SharpSpring, Inc., SharpSpring Technologies, Inc. and Western Alliance Bank\nIncorporated by reference to the Company’s Form 8-K filed on March 26, 2019\n10.11\nLoan Modification Agreement dated February 14, 2020, by and among SharpSpring, Inc., SharpSpring Technologies, Inc., SharpSpring Reach, Inc., and Western Alliance Bank\nIncorporated by reference to the Company’s Form 10-Q filed on May 15, 2020\n10.12\nSharpSpring, Inc. 2010 Restated Employee Stock Plan\nIncorporated by reference to the Company’s Form 10-Q filed on August 13, 2018\n10.13\nSharpSpring, Inc. 2019 Equity Incentive Plan\nIncorporated by reference to the Company’s Definitive Schedule 14A filed on April 30, 2019\n10.14\nAmendment to SharpSpring, Inc. 2019 Equity Incentive Plan\nIncorporated by reference to the Company’s Definitive Schedule 14A filed on 6/17/2020\n10.15\n2019 Executive Bonus Plan\nIncorporated by reference to the Company’s Form 8-K filed on February 27, 2019\n10.16\n2021 Executive Bonus Plan\nIncorporated by reference to the Company’s Form 8-K filed on February 18, 2021\n10.17\nRichard Carlson Employee Agreement Amendment dated February 16, 2021\nIncorporated by reference to the Company’s Form 8-K filed on February 18, 2021\n10.18\nRichard Carlson Employee Agreement Amendment dated January 29, 2020\nIncorporated by reference to the Company’s Form 8-K/A filed on April 16, 2020\n10.19\nRichard Carlson Employee Agreement Amendment dated February 21, 2019\nIncorporated by reference to the Company’s Form 8-K filed on February 27, 2019\n10.20\nRichard Carlson Employee Agreement Amendment dated February 8, 2018\nIncorporated by reference to the Company’s Form 8-K filed on February 12, 2018\n10.21\nRichard Carlson Employee Agreement Amendment dated March 30, 2017\nIncorporated by reference to the Company’s Form 8-K filed on April 5, 2017\n10.22\nRichard Carlson Employee Agreement dated September 13, 2015\nIncorporated by reference to our Form 8-K filed on September 14, 2015\n10.23\nTravis Whitton Employee Agreement Amendment dated February 16, 2021\nIncorporated by reference to the Company’s Form 8-K filed on February 18, 2021\n10.24\nTravis Whitton Employee Agreement Amendment dated January 29, 2020\nIncorporated by reference to the Company’s Form 8-K/A filed on April 16, 2020\n10.25\nTravis Whitton Employee Agreement Amendment dated February 15, 2019\nIncorporated by reference to the Company’s Form 8-K filed on February 27, 2019\n10.26\nTravis Whitton Employee Agreement Amendment dated February 8, 2018\nIncorporated by reference to the Company’s Form 8-K filed on February 12, 2018\n10.27\nTravis Whitton Employee Agreement Amendment dated July 28, 2017\nIncorporated by reference to the Company’s Form 8-K filed on February 12, 2018\n10.28\nTravis Whitton Employee Agreement dated June 19, 2015\nIncorporated by reference to our Form 8-K filed on July 8, 2016\n10.29\nMichael Power Employment Agreement dated December 2, 2019\nIncorporated by reference to our Form 8-K filed November 22, 2019\n10.30\nAaron Jackson Employment Agreement dated December 10, 2021\nIncorporated by reference to our Form 8-K filed December 10, 2021\n10.31\nAaron Jackson Employee Agreement dated July 20, 2020\nIncorporated by reference to the Company’s Form 8-K/A filed on July 23, 2020\n10.32\nOffice Lease Agreement with Celebration Pointe Office Partners II, LLC dated April 18, 2018\nIncorporated by reference to our Form 8-K filed on April 19, 2018\n10.33\nOffice Lease Agreement Addendum with Celebration Pointe Office Partners II, LLC dated June 20, 2019.\nIncorporated by reference to our Form 8-K filed on June 26, 2019\n14.1\nCode of Ethics and Business Standards\nIncorporated by reference to our Form 10-K filed March 16, 2020\n21.1\nSubsidiaries of the registrant\nIncorporated by reference to Part I - Item 1. Business - Overview of this Form 10-K\n23.1\nConsent of Independent Registered Public Accounting Firm - Cherry Bekaert LLP\nFiled herewith\n31.1\nCertification of Principal Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nFiled herewith\n31.2\nCertification of Principal Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nFiled herewith\n32.1\nCertification of Principal Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nFurnished herewith\n32.2\nCertification of Principal Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nFurnished herewith\n101.1\nXBRL"
}