{
    "cik": "1567771",
    "company": "BRIDGEWAY NATIONAL CORP.",
    "filing_type": "10-K",
    "filing_date": "2021-06-01",
    "period_of_report": "2020-12-31",
    "sic": "2860",
    "state_of_inc": "DE",
    "state_location": "DC",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1567771/0001493152-21-013331-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1567771/000149315221013331/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1567771/0001493152-21-013331.txt",
    "filename": "1567771_10K_2020_0001493152-21-013331.htm",
    "item_1": "ITEM 1. BUSINESS\nGeneral\nThe Company is structured as a holding company with a business strategy focused on owning subsidiaries engaged in a number of diverse business activities. We are not a “blank check company” as defined in Rule 419 under the Securities Act of 1933, as amended (the “Securities Act”). We conduct and plan to continue to conduct our activities in such a manner as not to be deemed an investment company under the Investment Company Act of 1940, as amended (the “Investment Company Act”). Therefore, no more than 40% of our total assets can be invested in investment securities, as such term is defined in the Investment Company Act. In addition, we do not invest or intend to invest in securities as our primary business. Your rights as a holder of shares, and the fiduciary duties of the Company’s Board of Directors and executive officers, and any limitations relating thereto are set forth in the documents governing the Company and may differ from those applying to a Delaware corporation. However, the documents governing the Company specify that the duties of its directors and officers will be generally consistent with the duties of a director of a Delaware corporation.\nThe Company’s Board of Directors will oversee the management of the Company and our businesses. Initially, the Company’s Board of Directors will be comprised of seven (7) directors, with five (5) of those directors appointed by holders of the Company’s Class A common stock and two (2) of those directors appointed by holders of the Company’s Class B common stock, and at least five (5) of whom will be the Company’s independent directors.\nWe have accumulated a deficit of $11,030,550 as of December 31, 2020 and will likely require significant additional capital to implement our business plan.\nBusiness Strategy and Core Strengths\nWe anticipate that the operating businesses we acquire will be managed on a decentralized basis with essentially no centralized or integrated business functions (such as sales, marketing, purchasing, legal or human resources) and minimal involvement by the Company’s corporate senior management teams in the day-to-day business activities of the operating businesses. The Company’s corporate senior management team anticipates that it will participate in and have ultimate responsibility for significant decisions, such as capital allocation, investment activities and the selection of a chief executive officer for each of the operating businesses. We will also be responsible for establishing, implementing and monitoring corporate governance policies and practices, including those at the operating businesses, and participating in the resolution of governance-related issues as needed.\nWe expect that our business activities at the holding company level will be are managed by a small senior corporate management team, who will research and identify attractive investment opportunities; delegate responsibilities to competent and motivated managers; set operating subsidiary goals; assist managers in the achievement of those goals; define risk parameters; develop appropriate incentive programs; and monitor progress against long-term objectives.\nWe believe that our outlook on length of ownership and active management on our part may alleviate the concern that many stakeholders in potential control transactions may have with regard to their businesses going through multiple sale processes in a short period of time. We believe this outlook reduces both the risk that securities or whole businesses may be sold at unfavorable points in the overall market cycle and enhances our ability to develop a comprehensive strategy to grow the earnings and cash flows of each of our businesses, which we expect will better enable us to meet our long-term corporate objectives of increasing shareholder value.\nOur objective is to grow intrinsic value per share at an attractive rate by retaining capital to reinvest in the productive capabilities of our current subsidiaries, make opportunistic investments, and/or invest in new, anticipated durable earnings streams. Each of these options for capital will be compared to one another on a regular basis, and capital will be deployed according to our management’s judgment as to where it believes allocated capital has the potential to achieve the best long-term return.\nInvestment Strategy\nWe will seek to focus on acquiring operating businesses and securities that (a) can be purchased at what we believe to be a fair price relative to intrinsic value, (b) are managed by competent and incentivized management teams, (c) offer reasonable downside protection and (d) directly contribute to the Company’s strategic goals. Over time, we believe that a focus on these objectives should allow us to consistently deliver targeted investment returns that outperforms the broader market. We plan to target investments into businesses that we believe (i) operate in industries with stable long-term operating profiles, (ii) present a stable unlevered free cash flow profile, (iii) have the ability to quickly adapt to changing economic cycles and (iv) face minimal threats of technological or competitive obsolescence.\nWe believe that an investment strategy focused on investments with these character traits coupled with a value investing orientation should continue to present attractive investment opportunities that allow us to build a less correlated portfolio of operating assets that provide shareholders with exposure to a mix of growth and acyclical operating assets that allow us to maximize shareholder value.\nManagement Strategy\nOur management strategy involves the financial and operational management of the businesses that we anticipate acquiring in a manner that seeks to grow earnings and cash flow and, in turn increasing stockholder value. In general, we plan to oversee and support the management team of each of our businesses by, among other things:\n● recruiting and retaining talented managers to operate our businesses by using structured incentive compensation programs, including minority equity ownership, tailored to each business;\n● regularly monitoring financial and operational performance, instilling consistent financial discipline, and supporting management in the development and implementation of information systems to effectively achieve these goals:\n● assisting management in their analysis and pursuit of prudent organic growth strategies:\n● identifying and working with management to execute on attractive external growth and acquisition opportunities; and\n● forming strong subsidiary level boards of directors to supplement management in their development and implementation of strategic goals and objectives\nOur investment strategy centers around our ability to consistently seek to acquire securities and/or companies at a discount to intrinsic value as determined by various metrics, including without limitation, replacement cost, break-up value, cash flow and earnings power and liquidation value.\nWe utilize a process-oriented, research-intensive, value-based investing approach. This approach generally involves three (3) critical steps: (i) fundamental credit, valuation, capital structure and security analysis; (ii) intense analysis of fulcrum issues, such as litigation, taxes and regulation, that often affect valuation; and (iii) a deep understanding and analysis of contextual factors that often affect the risk-adjusted attractiveness of an investment position. This approach focuses on exploiting market price dislocations that create attractive buying opportunities. These dislocations may be caused by such factors as broad-based market drawdowns; busted auction processes; out of favor, short term industry perceptions; market euphoria; litigation; complex contingent liabilities; corporate malfeasance and weak corporate governance; general bearish economic conditions; and / or complex and inappropriate capital structures.\nWhile we plan to principally focus on deploying a material portion of our investable capital into acquiring controlling interests in privately held and/or thinly traded middle market operating businesses, we may employ a number of acquisition strategies and are permitted to invest across a variety of industries and types of securities including: (i) publicly traded equities; (ii) publicly traded bonds and privately issued, non-investment grade debt, bank debt and other corporate obligations; and (iii) privately issued and publicly traded structured equity and other preferred equity securities.\nKey Elements of Our Strategy:\nThe key elements of our business strategy include the following:\n● Seek to Acquire Undervalued Assets. We intend to make investments in businesses that we believe are undervalued and have potential for growth. We will also seek to capitalize on investment opportunities arising from market inefficiencies, economic or market trends that have not been identified and reflected in market value, or complex or special situations. Certain opportunities may arise from companies/assets that experience busted sell-side auction processes, disappointing financial results, liquidity or capital needs, lowered credit ratings, revised industry forecasts or legal complications. We may acquire businesses or assets directly or we may establish an ownership position through the purchase of debt or equity securities in the open market or in privately negotiated transactions.\n● Utilize a Low-Cost Model. We believe our low overhead model will allow us to more effectively utilize excess cash flows from our portfolio of operating businesses and securities to enhance stockholder through efficient capital allocation activities.\n● Internal Resources and External Network Sufficient to Drive Accretive Opportunities. We believe our internal management team and their strong relationships with industry executives, accountants, attorneys, business brokers, commercial and investment bankers, and other potential sources of acquisition opportunities offer us a strong pipeline of opportunities. Additionally, the flexibility, creativity, experience and expertise of our management team in structuring transactions allows us to consider non-traditional and complex transactions tailored to fit a specific acquisition target.\n● Drive Accountability and Financial Discipline in the Management of our Business. Our management team is accountable directly to our board of directors and has day-to-day responsibility for general oversight of our business and for capital allocation decisions of our operating businesses. We continually evaluate our operating subsidiaries with a view towards maximizing value and cost efficiencies, bringing an owner’s perspective to our operating businesses. In each of these businesses, we will look for senior management teams with the expertise to run their businesses and boards of directors to oversee the management of those businesses. Each management team will be responsible for the day-to-day operations of its businesses and directly accountable to its board of directors.\nCompetition\nIn our core business, which is the acquisition of operating businesses and securities, we face intense competition, including competition from companies with significantly greater resources than us, and if we are unable to compete effectively with these companies, our market share may decline, and our business could be harmed.\nEmployees\nAs of the date of this report, we had six (6) employees. We believe that our relationship with our employees is good.\nPotential Effects of the COVID-19 Pandemic on our Business\nThe adverse public health developments and economic effects of the COVID-19 pandemic in the United States could adversely affect the Company’s business. Particularly, the COVID-19 pandemic could potentially lead to an extended economic downturn, which would likely make it more difficult to identify and acquire potential candidates, as well as limit the availability of acquisition financing. The Company cannot accurately predict the effect the COVID-19 pandemic will have on the Company.\nCorporate Information\nThe Company was originally incorporated in the State of Nevada on June 4, 2012 under the name Snap Online Marketing, Inc. We changed our name on January 31, 2014 to LifeLogger Technologies Corp. and on April 10, 2019, we reincorporated in Delaware under the name Capital Park Holdings Corp. On December 19, 2019, we changed our name to Bridgeway National Corp. Our executive offices are located at 1015 15th Street NW, Suite 1030, Washington DC 20005 and our telephone number is (202) 846-7689.\nChange in Control Transaction\nOn January 9, 2019, the Company entered into a Note Conversion Agreement (the “Conversion Agreement”) with SBI Investments LLC, 2014-1, a statutory series of Delaware limited liability corporation (“SBI”), and Old Main Capital, LLC, a Florida series limited liability corporation (“Old Main”). Pursuant to the Conversion Agreement, SBI converted $549,042 of principal and $641,565 accrued interest owed to SBI by the Company pursuant to a promissory Note into 42,429 shares of the Company’s Series B Preferred Stock, par value $0.001 per share (the “Series B Preferred Stock”), in full satisfaction of such obligation. Pursuant to the Conversion Agreement, Old Main converted $556,547 of principal and $650,094 accrued interest owed to Old Main by the Company pursuant to a promissory Note into 54,000 shares of the Company’s Series B Preferred Stock in full satisfaction of such obligation. Concurrently with and the closing of the transactions for the Old Main Conversion Shares, with an effective date of January 9, 2019, the Company acquired from Old Main and SBI 83,796 shares of Class A Common Stock and from a prior executive of the Company, 1,000 shares of Series A Preferred Stock. The purchase price for the Class A Common Stock was $335.18 in the aggregate and the purchase price for the Series A Preferred Stock was $1 in the aggregate. During the year ended December 31, 2019, the Company declared $39,391 in dividends on the Series B Preferred Stock, of which $28,073 was paid in cash by a related party and $11,318 accrued. During the year ended December 31,2020, the Company declared $43,048 in dividends on the Series B Preferred Stock of which $0 was paid in cash, $43,048 was accrued.\nContemporaneously with the share sale and purchase transaction, Stewart Garner resigned as the Company’s Chief Executive Officer, Chief Financial Officer and director and Eric C .Blue, a principal of the Fund was appointed as the Company’s Chairman of the Board, Chief Executive Officer, Chief Investment Officer and a director. Moreover, we changed our business focus from the development of proprietary cloud-based software programs to our current business of acquiring majority or minority interests in operating businesses.\nAs a result of the foregoing transaction, a “change in control” of the Company was deemed to have taken place (the “Change in Control Transaction”).\nRecent Developments\nEquity Purchase Agreement\nOn October 24, 2019, the Company entered into an equity purchase agreement (the “Purchase Agreement”) with SBI Investments LLC, 2014-1, a statutory series of Delaware limited liability company (“SBI”) and Oasis Capital, LLC, a Puerto Rico limited liability company (“Oasis” and together with SBI, the “Equity Purchasers”), pursuant to which the Equity Purchasers agreed to, in the aggregate between them, purchase from the Company, up to $10,000,000 (the “Maximum Commitment Amount”) of our share of common stock.\nUnder the terms of the Purchase Agreement, the Company has the right, but not the obligation, to direct an Equity Purchaser, by its delivery of a put notice (the “Put Notice”) from time to time beginning on the execution date of the Purchase Agreement and ending on the earlier to occur of (a) the date on which the Equity Purchasers shall have purchased Put Shares equal to the Maximum Commitment Amount, (b) October 24, 2021 or (c) written notice of termination by the Company to the Equity Purchasers (together, the “Commitment Period”), to purchase Put Shares (as defined below).\nNotwithstanding any other terms of the Purchase Agreement, in each instance (a) the amount that is the subject of a Put Notice (the “Investment Amount”) is not more than the Maximum Put Amount (as defined below), (b) the aggregate Investment Amount of all Put Notices shall not exceed the Maximum Commitment Amount and (b) the Company cannot deliver consecutive Put Notices and/or consummate closings to the same Equity Purchaser and must alternate between Oasis and SBI. “Maximum Put Amount” means the lesser of (a) such amount that equals 250% of the average daily trading volume of our shares and (b) $1,000,000. The price paid for each share (the “Purchase Price”) subject to a Put Notice (the “Put Shares”) shall be 85% of the Market Price (as defined below) on the date upon which the Purchase Price is calculated in accordance with the terms and conditions of the Purchase Agreement. “Market Price” means the one lowest traded price of the shares on the principal market for any trading day during the Valuation Period (as defined below), as reported by Bloomberg Finance L.P. or other reputable source. “Valuation Period” means the period of five consecutive trading days immediately following the Clearing Date (as defined below) associated with the applicable Put Notice during which the Purchase Price of the shares is valued, provided, however, that the Valuation Period shall instead begin on the Clearing Date if the respective Put Shares are received via DWAC in the applicable selling stockholder’s brokerage account prior to 11:00 a.m. Eastern Time on the respective Clearing Date. “Clearing Date” means the date on which an Equity Purchaser receives the Put Shares via DWAC in its brokerage account.\nAs compensation for the commitments made under the Purchase Agreement, the Company paid to the Equity Purchasers a commitment fee equal to 4% of the Maximum Commitment Amount (the “Commitment Fee”). The Commitment Fee was paid by the Company by issuing to the Equity Purchasers 28,572 shares of its Series B Preferred Stock, which shares were authorized for issuance on February 25, 2020 (“Series B Preferred Shares”).\nConcurrently with the execution of the Purchase Agreement, the Company and the Equity Purchasers entered into a Registration Rights Agreement, dated as of October 24, 2019 (the “Registration Rights Agreement”). Pursuant to the Registration Rights Agreement, the Company has filed a registration statement covering the resale by the Equity Purchasers of any Put Shares which may be issued pursuant to the Purchase Agreement and any and Shares which may be issued upon conversion of the Series B Preferred Shares. The effectiveness of this registration statement is a condition to the ability of the Company to issue a Put Notice to an Equity Purchaser and consummate the sale of the applicable number of Put Shares to such Equity Purchaser.\nOn April 15, 2021 the Company notified the Equity Purchasers of its intent to terminate the Purchase Agreement effective immediately. The Series B Preferred Shares issued to the equity purchased which represented the Commitment fee will remain outstanding and the commitment fee which was previously recorded as deferred financing costs was immediately expensed during the year ended December 31, 2020.\nPromissory Note Purchase Agreement\nOn March 2, 2020 (the “Issue Date”), Bridgeway entered into an unsecured promissory note purchase agreement with SBI, on behalf of itself and the other note purchasers (the “Note Purchasers”), pursuant to which the Note Purchasers purchased from the Company (a) 12% convertible promissory notes of the Company in an aggregate principal amount of $845,000 (the “12% Notes”) convertible into Shares (the “Conversion Shares”) of and (b) warrants (the “Warrants”) to acquire up to 1,111,842 Shares subject to a beneficial ownership cap of no greater than 4.99% in the case of each Purchaser (the “Warrant Shares”).\nThe maturity date of the 12% Notes shall be on that day that is nine (9) months after the Issue Date (the “Maturity Date”) and is the date upon which the principal amount of the 12% Notes, as well as all accrued and unpaid interest and other fees, shall be due and payable. As of the date of filing, the 12% Notes are in default. As at December 31, 2020 the Company owed $845,000 (December 31, 2019 - $nil) in principal and the accrued interest was $88,349.\nUnder the terms of the 12% Notes, the Note Purchasers shall have the right at any time on or after the Issue Date, to convert (a “Conversion”) all or any part of the outstanding and unpaid principal amount and accrued and unpaid interest of the 12% Notes, and any other amounts owed under the 12% Notes, into shares at the Conversion Price (as defined below); provided, however, that in no event shall any Note Purchaser be entitled to convert any portion of any of the 12% Notes in excess of that portion of any 12% Note upon conversion of which the sum of (a) the number of owned by the Note Purchaser and its affiliates (other than Shares issuable upon conversion of the 12% Notes or exercise of the Warrants held by such Note Purchaser) and (b) the number of shares issuable upon the conversion of the portion of any 12% Note with respect to which the determination of this provision is being made, would result in beneficial ownership by any Note Purchaser and its affiliates of more than 4.99% of the Company’s outstanding shares (the “Maximum Share Amount”). The “Conversion Price” per share shall be the lower of (i) $0.38 or (ii) the Variable Conversion Price (as defined below) (subject to adjustment). The “Variable Conversion Price” shall mean 70% multiplied by the Market Price (as defined below). “Market Price” means the lowest Trading Price (as defined below) for our common stock during the fifteen (15) Trading Day period ending on the last complete Trading Day prior to the Conversion Date. “Trading Price” means, as of any date, the lowest VWAP price for our shares on the applicable trading market trading market (the “Trading Market”) as reported by a reliable reporting service.\nThe exercise price of the Warrants is $0.38 per share, subject to adjustment. Each Warrant also contains a cashless exercise option and has a term of five (5) years from the Issue Date.\nOn September 30, 2020 (the “Issue Date”), the Company entered into an unsecured promissory note purchase agreement with Oasis Capital, LLC (the “Note Purchaser”), pursuant to which the Note Purchaser purchased from the Company (a) the 6% convertible promissory note of the Company in an aggregate principal amount of $155,000 ($5,000 OID) (the “6% Note”) convertible into Shares (the “Conversion Shares”) subject to a beneficial ownership cap of no greater than 4.99% in the case of the Purchaser, and a default rate of 18%. The maturity date of the 6% Note shall be on June 30, 2021 (the “Maturity Date”) and is the date upon which the principal amount of the 6% Note, as well as all accrued and unpaid interest and other fees, shall be due and payable. The note carries an 18% default interest rate.\nUnder the terms of the 6% Note, the Note Purchaser shall have the right at any time during the period beginning on the date which is one hundred eighty (180) days following the date of the 6% Note and ending on the later of: (i) the Maturity Date and (ii) the date of payment of the default amount, to convert (a “Conversion”) all or any part of the outstanding and unpaid principal amount and accrued and unpaid interest of the 6% Note, and any other amounts owed under the 6% Note, into shares at the Conversion Price (as defined below); provided, however, that in no event shall the Note Purchaser be entitled to convert any portion of any of the 6% Note in excess of that portion of the 6% Note upon conversion of which the sum of (a) the number of shares owned by the Note Purchaser and its affiliates and (b) the number of shares issuable upon the conversion of the portion of the 6% Note with respect to which the determination of this provision is being made, would result in beneficial ownership by the Note Purchaser and its affiliates of more than the Maximum Share Amount of 4.99% of the outstanding shares. The “Conversion Price” shall be equal to the Variable Conversion Price (as defined below) (subject to equitable adjustments for stock splits, stock dividends or rights offerings by the Company relating to the Company’s securities or the securities of any subsidiary of the Company, combinations, recapitalization, reclassifications, extraordinary distributions and similar events). The “Variable Conversion Price” shall mean 80% multiplied by the Market Price (as defined below) (representing a discount rate of 20%). “Market Price” means the average of the three (3) lowest trading prices) for the shares during the fifteen (15) trading day period ending on the latest complete trading day prior to the Conversion Date.\nAs at December 31, 2020 the Company owed $155,000 (December 31, 2019 - $nil) in principal and the accrued interest was $2,344.\nOn October 03, 2020 (the “Issue Date”), the Company entered into an unsecured promissory note purchase agreement with Oasis Capital, LLC (the “Note Purchaser”), pursuant to which the Note Purchaser purchased from the Company (a) the 6% convertible promissory note of the Company in an aggregate principal amount of $155,000($5,000 OID) (the “6% Note”) convertible into Shares (the “Conversion Shares”) subject to a beneficial ownership cap of no greater than 4.99% in the case of the Purchaser, and a default rate of 18%. The maturity date of the 6% Note shall be on June 30, 2021 (the “Maturity Date”) and is the date upon which the principal amount of the 6% Note, as well as all accrued and unpaid interest and other fees, shall be due and payable. The note carries a 18% default interest rate.\nUnder the terms of the 6% Note, the Note Purchaser shall have the right at any time during the period beginning on the date which is one hundred eighty (180) days following the date of the 6% Note and ending on the later of: (i) the Maturity Date and (ii) the date of payment of the default amount, to convert (a “Conversion”) all or any part of the outstanding and unpaid principal amount and accrued and unpaid interest of the 6% Note, and any other amounts owed under the 6% Note, into shares at the Conversion Price (as defined below); provided, however, that in no event shall the Note Purchaser be entitled to convert any portion of any of the 6% Note in excess of that portion of the 6% Note upon conversion of which the sum of (a) the number of shares owned by the Note Purchaser and its affiliates and (b) the number of shares issuable upon the conversion of the portion of the 6% Note with respect to which the determination of this provision is being made, would result in beneficial ownership by the Note Purchaser and its affiliates of more than the Maximum Share Amount of 4.99% of the outstanding shares. The “Conversion Price” shall be equal to the Variable Conversion Price (as defined below) (subject to equitable adjustments for stock splits, stock dividends or rights offerings by the Company relating to the Company’s securities or the securities of any subsidiary of the Company, combinations, recapitalization, reclassifications, extraordinary distributions and similar events). The “Variable Conversion Price” shall mean 80% multiplied by the Market Price (as defined below) (representing a discount rate of 20%). “Market Price” means the average of the three (3) lowest trading prices) for the shares during the fifteen (15) trading day period ending on the latest complete trading day prior to the Conversion Date.\nAs at December 31, 2020 the Company owed $155,000 (December 31, 2019 - $nil) in principal and the accrued interest was $2,344.\nOn October 23, 2020 (the “Issue Date”), the Company entered into an unsecured promissory note purchase agreement with Geneva Roth Remark Holdings, Inc. (the “Note Purchaser”), pursuant to which the Note Purchaser purchased from the Company (a) the 9% convertible promissory note of the Company in an aggregate principal amount of $68,000 ($3,000 OID) (the “9% Note”) convertible into Shares (the “Conversion Shares”) subject to a beneficial ownership cap of no greater than 4.99% in the case of the Purchaser, and a default rate of 22%. The maturity date of the 9% Note shall be on October 23, 2021 (the “Maturity Date”) and is the date upon which the principal amount of the 9% Note, as well as all accrued and unpaid interest and other fees, shall be due and payable. The note carries a 22% default interest rate.\nUnder the terms of the 9% Note, the Note Purchaser shall have the right at any time during the period beginning on the date which is one hundred eighty (180) days following the date of the 9% Note and ending on the later of: (i) the Maturity Date and (ii) the date of payment of the default amount, to convert (a “Conversion”) all or any part of the outstanding and unpaid principal amount and accrued and unpaid interest of the 9% Note, and any other amounts owed under the 9% Note, into shares at the Conversion Price (as defined below); provided, however, that in no event shall the Note Purchaser be entitled to convert any portion of any of the 9% Note in excess of that portion of the 9% Note upon conversion of which the sum of (a) the number of shares owned by the Note Purchaser and its affiliates and (b) the number of shares issuable upon the conversion of the portion of the 9% Note with respect to which the determination of this provision is being made, would result in beneficial ownership by the Note Purchaser and its affiliates of more than the Maximum Share Amount of 4.99% of the outstanding shares. The “Conversion Price” shall be equal to the Variable Conversion Price (as defined below) (subject to equitable adjustments for stock splits, stock dividends or rights offerings by the Company relating to the Company’s securities or the securities of any subsidiary of the Company, combinations, recapitalization, reclassifications, extraordinary distributions and similar events). The “Variable Conversion Price” shall mean 65% multiplied by the Market Price (as defined below) (representing a discount rate of 35%). “Market Price” means the average of the three (3) lowest trading prices) for the shares during the fifteen (15) trading day period ending on the latest complete trading day prior to the Conversion Date.\nAs at December 31, 2020 the Company owed $68,000 (December 31, 2019 - $nil) in principal and the accrued interest was $1,157.\nOn November 16, 2020 (the “Issue Date”), the Company entered into an unsecured promissory note purchase agreement with Geneva Roth Remark Holdings, Inc. (the “Note Purchaser”), pursuant to which the Note Purchaser purchased from the Company (a) the 9% convertible promissory note of the Company in an aggregate principal amount of $48,000 ($3,000 OID) (the “9% Note II”) convertible into Shares (the “Conversion Shares”) subject to a beneficial ownership cap of no greater than 4.99% in the case of the Purchaser, and a Default rate of 22%. The maturity date of the 9% Note II shall be on November 16, 2021 (the “Maturity Date”) and is the date upon which the principal amount of the 9% Note, as well as all accrued and unpaid interest and other fees, shall be due and payable. The note carries a 22% default interest rate.\nUnder the terms of the 9% Note II, the Note Purchaser shall have the right at any time during the period beginning on the date which is one hundred eighty (180) days following the date of the 9% Note II and ending on the later of: (i) the Maturity Date and (ii) the date of payment of the default amount, to convert (a “Conversion”) all or any part of the outstanding and unpaid principal amount and accrued and unpaid interest of the 9% Note II, and any other amounts owed under the 9% Note II, into shares at the Conversion Price (as defined below); provided, however, that in no event shall the Note Purchaser be entitled to convert any portion of any of the 9% Note II in excess of that portion of the 9% Note II upon conversion of which the sum of (a) the number of shares owned by the Note Purchaser and its affiliates and (b) the number of shares issuable upon the conversion of the portion of the 9% Note II with respect to which the determination of this provision is being made, would result in beneficial ownership by the Note Purchaser and its affiliates of more than the Maximum Share Amount of 4.99% of the outstanding shares. The “Conversion Price” shall be equal to the Variable Conversion Price (as defined below) (subject to equitable adjustments for stock splits, stock dividends or rights offerings by the Company relating to the Company’s securities or the securities of any subsidiary of the Company, combinations, recapitalization, reclassifications, extraordinary distributions and similar events). The “Variable Conversion Price” shall mean 65% multiplied by the Market Price (as defined below) (representing a discount rate of 35%). “Market Price” means the average of the three (3) lowest trading prices for the shares during the fifteen (15) trading day period ending on the latest complete trading day prior to the Conversion Date.\nAs at December 31, 2020 the Company owed $48,000 (December 31, 2019 - $nil) in principal and the accrued interest was $533.\nAcquisition and Discontinued Operations\nThe Company entered into an agreement (the “Transaction Agreement”) on May 3, 2019 with C-PAK, P&G, and Capital Park Holdings Corp., solely in its capacity as guarantor, for an acquisition of certain assets pertaining to the “Joy” and “Cream Suds” trademarks for $30,000,000. As at October 1, 2019, the Transaction Agreement was terminated between the parties. The terms of the termination are undergoing further negotiations. Results of operations, financial position and cash flows for these businesses are separately reported as discontinued operations for the year ended December 31, 2019. In connection with the closing of the transaction contemplated by the transaction agreement, the Company received a transaction fee in the amount of $400,000 (the “Transaction Fee”) where the Company recorded the transaction fee as an accrual with its Deferred Financing Fee balance sheet account. In conjunction with termination of the Transaction Agreement, the Company has immediately reversed the accrual for the Transaction Fee and immediately expensed the Transaction Fee in this period.\nSmall Business Administration Loans\nOn March 31, 2021, Bridgeway was approved for a SBA Loan-1in the amount of $723,743 and on March 24, 2021 was approved for an SBA Loan-2 in the original principal amount of $150,000. SBA Loan-1 shall be eligible for forgiveness if during the 8-to-24-week covered period following disbursement: (i) employee and compensation levels are maintained; (ii) the loan proceeds are spent on payroll costs and other eligible expenses and (iii) at least 60% of the proceeds are spent on payroll costs. For any portion of the SBA Loan-1 that is not forgiven, it will bear interest at a 1% fixed APR for the life of the loan with payments deferred for ten (10) months. With respect to the SBA Loan-2, interest will accrue at the rate of 3.75% per annum with installment payments, including principal and interest, of $731.00 per month beginning on the twelve (12) month anniversary of the funding date. The balance of principal and interest will be payable on the thirty (30) year anniversary of the funding date.\nClass A Common Stock Reverse Stock Split\nOn October 16, 2020, the board of directors (the “Board”) of the Company and a stockholder holding a majority of the voting power of the Company’s voting stock (the “Majority Stockholder”) took action by joint written consent in lieu of a meeting to: (i) ratify the approval of an amendment to the Company’s certificate of incorporation, which amendment was filed with the Delaware Secretary of State on December 19, 2019 and was declared effective on January 20, 2020 (the “December 2019 Amendment”), which (i) changed the Company’s name from “Capital Park Holdings Corp.” to “Bridgeway National Corp.” and (ii) increased our authorized capital stock from 30,000,000 shares to 250,000,000 shares, of which 187,500,000 shares were designated as Class A Common Stock (the “Class A Common Stock”), 18,750,000 shares were designated as Class B Common Stock (the “Class B Common Stock”) and 62,500,000 shares were designated as preferred stock, of which 1,000 shares were previously designated as Series A Preferred Stock (the “Series A Preferred Stock”) and 125,181 shares were previously designated as Series B Preferred Stock (the “Series B Preferred Stock”); (ii) approve a further amendment to the Company’s certificate of incorporation (the “Recapitalization Amendment”) to increase the Common Stock from 187,500,000 shares to 400,000,000 shares, of which 360,000,000 shares will be designated as the Class A Common Stock and 40,000,000 shares will be designated as the Class B Common Stock and (iii) approve an additional amendment to the certificate of incorporation to effect a reverse stock split of our outstanding shares of our Class A Common Stock and Class B Common Stock at the at the ratio of one-for-4 (the “Reverse Stock Split Amendment,” and together with the December 2019 Amendment and the Recapitalization Amendment, collectively, the “Amendments”).\nThe December 2019 Amendment will not be deemed ratified, and the Recapitalization Amendment and Reverse Stock Split Amendment will not be made effective until at least twenty (20) calendar days after the mailing of the Information Statement accompanying this Notice. In addition, the Reverse Stock Split Amendment will not be made effective until the Recapitalization Amendment is made effective, and we receive FINRA approval for the Reverse Stock Split from the Financial Industry Regulatory Authority (“FINRA”). We received written notification that FINRA had approved the Reverse Stock Split on February 17, 2021.",
    "item_1A": "ITEM 1A. RISK FACTORS\nAs a “smaller reporting company,” as defined in Rule 12b-2 under the Securities Exchange Act of 1934, as amended (the “Exchange Act”), we are not required to provide the information required by this Item.",
    "item_1B": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot applicable.",
    "item_2": "ITEM 2. PROPERTIES\nOur executive offices are located at, 1015 15th Street NW, Suite 1030, Washington, D.C. 20005. The commencement date of the lease was January 29, 2020 and the term concludes on August 31, 2025. During the initial year of the lease, the per annum fixed rent obligation is $205,965 which increases pursuant to an in-lease escalation clause with the last year of the term having a per annum fixed rent obligation of $233,030.",
    "item_3": "ITEM 3. LEGAL PROCEEDINGS\nWe are not presently a party to any material litigation, nor to the knowledge of management is any litigation threatened against us that may materially affect us.",
    "item_4": "ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II",
    "item_5": "ITEM 5. MARKET FOR COMMON EQUITY AND RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASE OF EQUITY SECURITIES\nMarket Information\nOur common stock has been quoted on the OTC Pink tier of the over-the-counter market under the symbol “LOGG” from February 2014 to April 2020 under the symbol “BDGY” since April 2020. Trading of our common stock is limited and sporadic. There can be no assurance that a liquid market for our common stock will ever develop.\nHolders of our Common Stock\nAs of the date of this report, we had 2,476,067 shares of common stock issued and outstanding and approximately eleven holders of record of our common stock. One of these holders is CEDE and Company which is the mechanism used for brokerage firms to hold securities in book entry form on behalf of their clients and as of the date of this report, they held 2,223,056 shares of common stock for these shareholders. Accordingly, we believe that the Company has significantly in excess of 7,200 beneficial stockholders as of the date of this report.\nDividends\nWe have never declared or paid cash dividends on our capital stock. We currently intend to retain all available funds and any future earnings for use in the operation and expansion of our business and do not anticipate paying any cash dividends in the foreseeable future. However, during the year ended December 31, 2020, the Company declared $43,048 in dividends on the Series B Preferred Stock, of which $0 was paid in cash and $43,048 accrued.\nSecurities Authorized for Issuance under Equity Compensation Plans\nNone.\nRecent Sales of Unregistered Securities\nNone.",
    "item_6": "ITEM 6. SELECTED FINANCIAL DATA\nNot applicable to a “smaller reporting company”.",
    "item_7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nIntroduction\nPrior to the Change in Control Transaction that took place on January 9, 2019, we were a lifelogging software company that developed and hosted a proprietary cloud-based software solution ‎accessible on iOS and Android devices that offers an enhanced media experience for consumers by augmenting ‎videos, livestreams and photos with additional context information and provided platform that makes it easy to ‎find and use that data when viewing or sharing media. Subsequent to the Change in Control Transaction, we changed the business plan wherein we intend to be structured as a holding company ‎with a business strategy focused on owning subsidiaries engaged in a number of diverse business activities.‎\nResults of Operations\nThe following comparative analysis on results of operations was based primarily on the comparative audited consolidated financial statements, footnotes and related information for the periods identified below and should be read in conjunction with the consolidated financial statements and the notes to those statements that are included elsewhere in this report.\nRevenue\nThe Company had no revenues in 2020 nor 2019. The Company currently cannot predict when the Company will become revenue producing.\nOperating Expenses\nTotal operating expenses for 2020 increased by $1,722,609, compared to 2019, mainly as a result of an increase in general and administrative, expenses incurred in connection with the Company’s decision to broaden its business strategy.\nOther Expenses\nOther expenses for 2020 increased by $2,002,455 compared to 2019 as a result of the valuation of certain derivative warrants and notes, together with a material increase in the interest expense.\nNet Profit (Loss)\nThe net loss for 2020 was ($4,124,783), a decrease of $4,347,622 compared to a net profit in 2019 of $222,839, as a result of an increase in other expenses and total operating expenses as a result of an increase in general administrative expenses.\nLiquidity and Capital Resources\nLiquidity is the ability of an enterprise to generate adequate amounts of cash to meet its needs for cash requirements. As of December 31, 2020, our working capital deficit amounted to $3,783,009 a decrease of $778,181 as compared to $14,067 as of December 31, 2019. This decrease is primarily a result of a increase in accounts payable, partially offset by an increase in related party liabilities, notes payable and derivative liabilities and current assets.\nNet cash used in operating activities was ($1,116,865) during 2020 compared to ($3,865,334) in 2019. The increase in cash used in operating activities is primarily attributable to our operating performance going from a net profit of $222,839 in fiscal 2019 to ($4,124,783) in fiscal 2020 coupled with the Company entering into certain derivative warrant and note transactions.\nNet cash provided by financing activities during 2020 was $1,203,686 compared to $33,870,020 in 2019. This change was due to notes disclosed in previous sections.\nNet cash used in investing activities was ($84,906) during 2020 compared to ($30,004,686) in 2019. This change was due to thirty-million used in investing activities from discontinued operations during the year ended December 31, 2019.\nCapital Resources\nWe believe that our balance sheet cash will afford us with sufficient financing to cover immediate our projected operating expenses and working capital needs. However, in order to execute our business plan, we potentially will have to issue additional debt or equity or enter into a strategic arrangement with a third party to carry out some aspects of our business plan. There can be no assurance that additional capital will be available to us on commercially reasonable terms when needed.\nGoing Concern Consideration\nWe had an accumulated deficit of $11,030,550 as of December 31, 2020. Our ability to continue as a going concern is dependent on our ability to raise additional capital and generate additional revenues and profits from our business plan.\nIn the opinion of our independent registered public accounting firm for our fiscal year end December 31, 2020, our auditor included a statement that as a result of our deficit accumulated on December 31, 2020, our net loss and net cash used in operating activities for the reporting period then ended, there is a substantial doubt as our ability to continue as a going concern without rising additional capital and generating additional revenues and profits from our business plan. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nOff-Balance Sheet Arrangements\nAs of December 31, 2020, we have no off-balance sheet arrangements.\nCritical Accounting Policies\nOur significant accounting policies are disclosed in Note 2 of our Financial Statements included elsewhere in this Annual Report on Form 10-K.",
    "item_7A": "ITEM 7A. QUALITATIVE AND QUANTITATIVE DISCLOSURES ABOUT MARKET RISK\nNot applicable.",
    "item_8": "ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nSee Financial Statements and Financial Statement Schedules appearing on pages through of this annual report on Form 10-K.",
    "item_9": "ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.",
    "item_9A": "ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures (as defined in Rule 13a-15(e) under the Exchange Act that are designed to ensure that information required to be disclosed by us in reports that we file under the Exchange Act is recorded, processed, summarized and reported as specified in the SEC’s rules and forms and that such information required to be disclosed by us in reports that we file under the Exchange Act is accumulated and communicated to our management, including our Chief Executive Officer, to allow timely decisions regarding required disclosure. Management, with the participation of our Chief Executive Officer, performed an evaluation of the effectiveness of our disclosure controls and procedures as of December 31, 2020. Based on that evaluation, our management, including our Chief Executive Officer, concluded that our disclosure controls and procedures were not effective as of December 31, 2020 for the reasons discussed below.\nManagement’s Annual Report on Internal Control over Financial Reporting\nManagement is responsible for the preparation of our financial statements and related information. Management uses its best judgment to ensure that the financial statements present fairly, in material respects, our financial position and results of operations in conformity with generally accepted accounting principles.\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting as defined in the Exchange Act. These internal controls are designed to provide reasonable assurance that the reported financial information is presented fairly, that disclosures are adequate and that the judgments inherent in the preparation of financial statements are reasonable. There are inherent limitations in the effectiveness of any system of internal controls including the possibility of human error and overriding of controls. Consequently, an ineffective internal control system can only provide reasonable, not absolute, assurance with respect to reporting financial information.\nOur internal control over financial reporting includes policies and procedures that: (i) pertain to maintaining records that, in reasonable detail, accurately and fairly reflect our transactions; (ii) provide reasonable assurance that transactions are recorded as necessary for preparation of our financial statements in accordance with generally accepted accounting principles and that the receipts and expenditures of Company assets are made in accordance with our management and directors authorization; and (iii) provide reasonable assurance regarding the prevention of or timely detection of unauthorized acquisition, use or disposition of assets that could have a material effect on our financial statements.\nUnder the supervision of management, including our Chief Executive Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and subsequent guidance prepared by the Commission specifically for smaller public companies. Based on that evaluation, our management concluded that our internal control over financial reporting was not effective as of December 31, 2020 because it identified the following material weakness and significant deficiencies:\n● Material Weakness - The Company did not maintain effective controls over certain aspects of the financial reporting process because we (i) lacked a sufficient complement of personnel with a level of accounting expertise and an adequate supervisory review structure that is commensurate with our financial reporting requirements and (ii) did not maintain an adequate segregation of duties.\nA material weakness is a deficiency or a combination of deficiencies in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of the annual or interim consolidated financial statements will not be prevented or detected on a timely basis. A significant deficiency is a deficiency, or a combination of deficiencies, in internal control over financial reporting that is less severe than a material weakness, yet important enough to merit attention by those responsible for oversight of the Company’s financial reporting.\nWe expect to be materially dependent upon third parties to provide us with accounting consulting services related to derivative liability treatment and for other accounting services for the foreseeable future. We believe this will be sufficient to remediate the material weaknesses related to our accounting for derivative liability treatment discussed above. Until such time as we have a chief financial officer with the requisite expertise in U.S. GAAP, there are no assurances that the material weaknesses and significant deficiencies in our disclosure controls and procedures will not result in errors in our financial statements which could lead to a restatement of those financial statements.\nOur management, including our Chief Executive Officer, does not expect that our disclosure controls and procedures or our internal controls will prevent all error and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints and the benefits of controls must be considered relative to their costs. Due to the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within our Company have been detected.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Management’s report was not subject to attestation by the Company’s registered public accounting firm pursuant to SEC rules that permit us to provide only management’s report on internal control over financial reporting in this annual report.\nChanges in Internal Controls over Financial Reporting\nThere have been no changes in our internal control over financial reporting during the quarter ended December 31, 2020 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.",
    "item_9B": "ITEM 9B. OTHER INFORMATION\nNone.\nPART III",
    "item_10": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe following person listed below have been retained to provide services as our director until the qualification and election of his successor. All holders of our common stock have the right to vote for directors.\nThe board of directors has primary responsibility for adopting and reviewing implementation of the business plan of the registrant, supervising the development business plan, review of the officers’ performance of specific business functions. The board is responsible for monitoring management, and from time to time, to revise the strategic and operational plans of the registrant. A director shall be elected by the shareholders to serve until the next annual meeting of shareholders, or until his or her death, or resignation and his or her successor is elected.\nCurrently, our executive officers and sole director are:\nName\nPosition\nTerm(s) of Office\nEric Blue\nChief Executive Officer and Director\nJanuary 9, 2019 to present\nEon Washington\nChief Operating Officer - Director of Operations\nJuly 13, 2020 to present\nEric Blue, age 41, has been the CEO and a director of the Company since January 9, 2019. Mr. Blue brings to the Company over 15 years of private equity, advisory and legal experience and will be responsible for driving the Company’s overall strategy. Prior to joining the Company, Mr. Blue was the founder and managing partner of a middle market focused private investing platform that focused on control and non-control transactions. In addition to his direct investing experience and prior to founding Capital Park Management Company, Mr. Blue served as an M&A and capital markets attorney as well as an industrials’ focused corporate finance and M&A investment banker. Mr. Blue graduated summa cum laude from Xavier University of Louisiana with a B.S. in finance and graduated with honors from The University of Texas School of Law.\nEon Washington, age 41, has been the COO of the Company since August 1, 2020. Mr. Washington brings to the Company over 19 years of Finance, Accounting, and Business Strategy experience and is responsible for general operations of the overall platform. Prior to joining the Company, My Washington was the Sr. VP of Business Development of a SaaS developer. In addition to his business strategy, Mr. Washington spent 10 years as ERP consultant to SMEs and Non-Profits. Mr. Washington Graduated from Hampton University with a B.S. in Finance/Accounting. .\nCompliance with Section 16(a) of the Securities Exchange Act\nSection 16(a) of the Exchange Act requires our executive officers and directors, and persons who beneficially own more than 10% of our common stock, to file initial reports of ownership and reports of changes in ownership with the SEC. Executive officers, directors and greater than 10% beneficial shareholders are required by SEC regulations to furnish us with copies of all Section 16(a) forms they file.\nBased solely upon our review of copies of such forms received by us, we believe that, during the year ended December 31, 2020, we are not aware that any officer, director or 10% or greater shareholder failed to file on a timely basis, as disclosed in the aforementioned Forms, reports required by Section 16(a) of the Exchange Act during the l year ended December 31, 2020.\nCode of Ethics\nThe Company adopted a written code of ethics that applies to the Company’s principal executive officer, principal financial officer, principal accounting officer and controller and any persons performing similar functions.\nCommittees of the Board of Directors\nWe do not have standing audit, nominating or compensation committees, or committees performing similar functions. Our board of directors believes that it is not necessary to have standing audit, nominating or compensation committees at this time because the functions of such committees are adequately performed by our board of directors.\nBoard Oversight in Risk Management\nOur Chief Executive Officer, who is our principal executive officer, is our sole director. In the context of risk oversight, we believe that our selection of one person to serve in both positions provides the board of directors with additional perspective which combines the operational experience of a member of management with the oversight focus of a member of the board of directors. The business and operations of our Company are managed by our board of directors as a whole, including oversight of various risks, such as operational and liquidity risks, that our Company faces. Because our board of directors includes a member of our management, this individual is responsible for both the day-to-day management of the risks we face as well as the responsibility for the oversight of risk management.",
    "item_11": "ITEM 11. EXECUTIVE COMPENSATION\nSummary Compensation Table\nThe following table sets forth the compensation paid to our executive officers during the year ended December 31, 2020,\nSUMMARY COMPENSATION TABLE\nName and Principal Position (a) Year (b) Salary ($)\n(c)\nBonus ($)\n(d)\nStock Awards ($)\n(e)\nOption Awards ($)\n(f)\nNon-Equity Incentive Plan Compensation ($)\n(g)\nNonqualified Deferred Compensation Earnings\n($)\n(h)\nAll Other Compensation ($)\n(i)\nTotal ($)\n(j)\nEric Blue 500,000 0 500,000\nCEO 500,000 0 500,000\nEon Washington 185,000 0 185,000\nMr. Blue became our CEO on January 9, 2019 and entered into an employment agreement as of September 28, 2020. Mr. Washington became our COO on July 13, 2020 and entered into an employment agreement with the Company as of that date.\nOutstanding Equity Awards at Fiscal Year-End Table\nThe table below summarizes all unexercised options, stock that has not vested, and equity incentive plan awards for our President and Chief Executive Officer, our sole executive officer, outstanding as of December 31, 2020.\nOUTSTANDING EQUITY AWARDS AT FISCAL YEAR-END\nOPTION AWARDS STOCK AWARDS\nName Number of Securities Underlying Unexercised Options\n(#) Exercisable Number of Securities Underlying Unexercised Options\n(#) Unexercisable Equity Incentive Plan Awards: Number of Securities Underlying Unexercised Unearned Options\n(#) Option Exercise Price ($) Option Expiration Date Number of Shares or Shares of Stock That Have Not Vested (#) Market Value of Shares or Shares of Stock That Have Not Vested ($) Equity Incentive Plan Awards: Number of Unearned Shares, Shares or Other Rights That Have Not Vested (#) Equity Incentive Plan Awards: Market or Payout Value of Unearned Shares, Shares or Other Rights That Have Not Vested (#)\nEric Blue - - 0\nEon Washington - - 0\nCompensation of Directors Table\nThe table below summarizes all compensation paid to our directors for our last completed fiscal year.\nDIRECTOR COMPENSATION\nName Fees Earned or Paid in Cash\n($)\nStock Awards\n($)\nOption Awards\n($)\nNon-Equity Incentive Plan Compensation\n($)\nNon-Qualified Deferred Compensation Earnings\n($)\nAll Other Compensation\n($)\nTotal\n($)\nEric Blue 0\nWhen we expand our board of directors to include “independent” directors, we intend to compensate them with a combination of cash and stock option awards, depending on our financial resources at that time.",
    "item_12": "ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following tables set forth certain information, as of the date of this report with respect to the beneficial ownership of our outstanding common stock and preferred stock by (i) any holder of more than 5%, (ii) each of our named executive officers and directors, and (iii) our directors and executive officers as a group.\nUnless otherwise indicated, the business address of each person listed is in care of Bridgeway National Corp., 1015 15th Street NW, Suite 1030, Washington, D.C. 20005. The information provided herein is based upon a list of our shareholders and our records with respect to the ownership of common stock. The percentages in the table have been calculated on the basis of treating as outstanding for a particular person, all shares of our common stock outstanding on that date and all shares of our common stock issuable to that holder in the event of exercise of outstanding options, warrants, rights or conversion privileges owned by that person at that date which are exercisable within 60 days of that date. Except as otherwise indicated, the persons listed below have sole voting and investment power with respect to all shares of our common stock owned by them, except to the extent that power may be shared with a spouse.\nName and Address Amount Percentage\nEric Blue\n1015 15th Street, Suite 1030\nWashington DC 20005\n335,183(indirect ) 1.07 %\nAll executive officers and directors as a group (1 person) 335,183(indirect ) 1.07 %\nOn January 9, 2019, the Capital Park Opportunities Fund LP, a Delaware limited partnership (the “Fund”) acquired 83,796 Shares and 1,000 shares of the Company’s Series A Preferred Stock (the “Series A Preferred Shares”) from certain existing securityholders of the Company for an aggregate purchase price of $336.18. The Shares, together with the Series A Preferred Shares, represent 84.4% of the voting power of the Company’s voting stock as of the date of the transaction. Each share of Series A Preferred Stock is entitled to 50,000 votes on all matters submitted to a vote of the Company’s stockholders. In the event that such votes do not total at least 51% of all votes, then the votes cast by the holders of the Series A Preferred Stock shall be equal to 51% of all votes cast at any meeting of the Company’s stockholders or any issue put to the stockholders for voting. The Fund is controlled by Eric Blue.",
    "item_13": "ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nNone.",
    "item_14": "ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe following table shows the fees that were billed for the audit and other services provided by MaloneBailey, LLP and SRCO Professional Corporation for the fiscal year ended December 31, 2019 and December 31, 2020.\nMaloneBailey SRCO\nAudit Fees $ 54,639 $ 30,000 12,000\nAudit-Related Fees $ 7,021\n$ -\nTax Fees $ - $ - 1,300\nAll Other Fees $ - $ -\nTotal $ 61,660 $ 30,000 13,300\nAudit Fees - This category includes the audit of our annual financial statements, review of financial statements included in our Quarterly Reports on Form 10-Q and services that are normally provided by the independent registered public accounting firm in connection with engagements for those fiscal years. This category also includes advice on audit and accounting matters that arose during, or as a result of, the audit or the review of interim financial statements.\nAudit-Related Fees - This category consists of assurance and related services by the independent registered public accounting firm that are reasonably related to the performance of the audit or review of our financial statements and are not reported above under “Audit Fees.” The services for the fees disclosed under this category include consultation regarding our correspondence with the Securities and Exchange Commission and other accounting consulting.\nTax Fees - This category consists of professional services rendered by our independent registered public accounting firm for tax compliance and tax advice. The services for the fees disclosed under this category include tax returns preparation and technical tax advice.\nAll Other Fees - This category consists of fees for other miscellaneous items.\nOur board of directors has adopted a procedure for pre-approval of all fees charged by our independent registered public accounting firm. Under the procedure, the board of directors approves the engagement letter with respect to audit, tax, and review services. Other fees are subject to pre-approval by the board of directors, or, in the period between meetings, by a designated member of the board of directors. Any such approval by the designated member is disclosed to the entire board of directors at the next meeting.\nPART IV",
    "item_15": "ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(a) 1. Financial Statements\nThe financial statements and Reports of Independent Registered Public Accounting Firm are listed in the “Index to Financial Statements and Schedules” on page and included on pages through\n2. Financial Statement Schedules\nAll schedules for which provision is made in the applicable accounting regulations of the\n3. Exhibits (including those incorporated by reference).\nExhibit No.\nDescription\n3.1(a)\nArticles of Incorporation filed with the Nevada Secretary of State on June 13, 2012 (incorporated by reference to Exhibit 3.1 to the Company’s Registration Statement on Form S-1 filed with the SEC on February 4, 2013).\n3.1(b)\nAmended and Restated Articles of Incorporation filed with the Nevada Secretary of State on January 6, 2014 (incorporated by reference to Exhibit 3.3 to the Company’s Current Report on Form 8-K filed on February 4, 2014).\n3.1(c)\nCertificate of Designation of Series A Preferred Stock filed with the Nevada Secretary of State on December 28, 2016 (incorporated by reference to Exhibit 3.1 to the Company’s Current Report on Form 8-K filed on February 22, 2017).\n3.1(d)\nCertificate of Amendment to the Amended and Restated Articles of Incorporation filed with the Nevada Secretary of State on February 23, 2017 (incorporated by reference to Exhibit A to the Company’s Definitive Information Statement on Schedule 14C filed on March 16, 2017).\n3.1(e)\nCertificate of Designation of Series B Preferred Stock filed with the Nevada Secretary of State on January 9, 2019 (incorporated by reference to Exhibit 3.1 to the Company’s Current Report on Form 8-K filed on January 15, 2019).\n3.1(f)\nPlan of Conversion, dated April 10, 2019 (incorporated by reference to Exhibit 2.1 to the Company’s Current Report on Form 8-K filed on April 11, 2019).\n3.1(g)\nArticles of Conversion filed with the Nevada Secretary of State on April 10, 2019 (incorporated by reference to Exhibit 3.1 to the Company’s Current Report on Form 8-K filed on April 11, 2019).\n3.1(h)\nCertificate of Conversion and Certificate of Incorporation filed with the Delaware Secretary of State on April 10, 2019 (incorporated by reference to Exhibit 3.2 and Exhibit 3.3 to the Company’s Current Report on Form 8-K filed on April 11, 2019).\n3.1(i)\nCertificate of Designation, Preferences and Rights of Series A Preferred Stock filed with the Delaware Secretary of State on April 10, 2019 (incorporated by reference to Exhibit 3.4 to the Company’s Current Report on Form 8-K filed on April 11, 2019).\n3.1(j)\nCertificate of Designation, Preferences and Rights of Series B Preferred Stock filed with the Delaware Secretary of State on April 10, 2019 (incorporated by reference to Exhibit 3.5 to the Company’s Current Report on Form 8-K filed on April 11, 2019).\n3.2(a)\nBylaws (incorporated by reference to Exhibit 3.2 to the Company’s Registration Statement on Form S-1 filed on February 4, 2013).\n3.2(b)\nAmended and Restated Bylaws (incorporated by reference to Exhibit 3.6 to the Company’s Current Report on Form 8-K filed on April 11, 2019).\n4.1\nSubscription Agreement (incorporated by reference to Exhibit 4.2 to the Company’s Registration Statement on Form S-1 filed with the SEC on February 4, 2013).\n4.2\nPromissory Note dated as of July 20, 2015, between LifeLogger Technologies Corp. and Glamis Capital SA (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K filed with the SEC on July 27, 2015).\n4.3\nPromissory Note dated as of September 8, 2015 between LifeLogger Technologies Corp. and Old Main Capital, LLC (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K filed with the SEC on September 18, 2015).\n4.4\nCommon Stock Purchase Warrant dated as of September 8, 2015 between LifeLogger Technologies Corp. and Old Main Capital, LLC (incorporated by reference to Exhibit 4.2 to the Company’s Current Report on Form 8-K filed with the SEC on September 18, 2015).\n4.5\n10% Convertible Promissory Note in the original principal amount of $296,153 dated March 9, 2016 between LifeLogger Technologies Corp. and Old Main Capital, LLC (incorporated by reference to Exhibit 4.5 to the Company’s Amendment No. 1 to Quarterly Report on Form 10-Q/A filed with the SEC on March 16, 2016).\n4.6\nAmendment No. 1 dated March 9, 2016 to Convertible Promissory Note dated September 8, 2015 between LifeLogger Technologies Corp. and Old Main Capital, LLC (incorporated by reference to Exhibit 4.6 to the Company’s Amendment No. 1 to Quarterly Report on Form 10-Q/A filed with the SEC on March 16, 2016).\n4.7\n8% Convertible Promissory Note in the principal amount of $250,000 dated March 9, 2016 between LifeLogger Technologies Corp. and Old Main Capital, LLC (incorporated by reference to Exhibit 4.7 to the Company’s Amendment No. 1 to Quarterly Report on Form 10-Q/A filed with the SEC on March 16, 2016).\n4.8\n10% Convertible Promissory Note in the principal amount of $87,912 dated June 9, 2016 between LifeLogger Technologies Corp. and Old Main Capital, LLC (incorporated by reference to Exhibit 4.7 to the Company’s Quarterly Report on Form 10-Q filed with the SEC on August 15, 2016).\n4.9\nAmendment dated June 9, 2016 to $296,153 Principal Amount Convertible Promissory Note dated March 9, 2016 issued by LifeLogger Technologies Corp. to Old Main Capital, LLC (incorporated by reference to Exhibit 4.8 to the Company’s Quarterly Report on Form 10-Q filed with the SEC on August 15, 2016).\n4.10\nAmendment dated June 9, 2016 to $250,000 Principal Amount Convertible Promissory Note dated March 9, 2016 issued by LifeLogger Technologies Corp. to Old Main Capital, LLC (incorporated by reference to Exhibit 4.9 to the Company’s Quarterly Report on Form 10-Q filed with the SEC on August 15, 2016).\n4.11\nPromissory Note dated June 30, 2016, by and between LifeLogger Technologies Corp. and SBI Investments LLC, 2014-1 (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K filed with the SEC on July 7, 2016).\n4.12\nSeries A Common Stock Purchase Warrant dated June 30, 2016, by and between LifeLogger Technologies Corp. and SBI Investments LLC, 2014-1 (incorporated by reference to Exhibit 4.2 to the Company’s Current Report on Form 8-K filed with the SEC on July 7, 2016).\n4.13\nSeries B Common Stock Purchase Warrant dated June 30, 2016, by and between LifeLogger Technologies Corp. and SBI Investments LLC, 2014-1 (incorporated by reference to Exhibit 4.3 to the Company’s Current Report on Form 8-K filed with the SEC on July 7, 2016).\n4.14\n10% Convertible Promissory Note dated April 7, 2017 issued by LifeLogger Technologies Corp. to Old Main Capital, LLC (incorporated by reference to Exhibit 4.14 to the Company’s Annual Report on Form 10-K filed with the SEC on April 17, 2017).\n4.15\n10% Convertible Promissory Note dated April 7, 2017 issued by LifeLogger Technologies Corp. to SBI Investments LLC, 2014-1(incorporated by reference to Exhibit 4.15 to the Company’s Annual Report on Form 10-K filed with the SEC on April 17, 2017).\n10.1\nProduct Development Agreement dated as of January 7, 2014 between Matrico Holdings, Ltd., and LifeLogger Technologies Corp. (incorporated by reference to Exhibit 10.3 to the Company’s Quarterly Report on Form 10-Q filed with the SEC on August 12, 2014).\n10.2\nAddendum to Product Development Agreement effective as of June 1, 2014 between Matrico Holdings, Ltd. and LifeLogger Technologies Corp. (incorporated by reference to Exhibit 10.4 to the Company’s Quarterly Report on Form 10-Q filed with the SEC on August 12, 2014).\n10.3\nSecurities Purchase Agreement dated as of September 24, 2014 between LifeLogger Technologies Corp. and Glamis Capital S.A. (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the SEC on September 26, 2014).\n10.4\nSecurities Purchase Agreement dated as of December 8, 2014 between LifeLogger Technologies Corp. and Glamis Capital S.A. (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the SEC on December 9, 2014).\n10.5\nSecurities Purchase Agreement dated as of May 7, 2015 between LifeLogger Technologies Corp. and SSID Limited (incorporated by reference to Exhibit 10.7 to the Company’s Quarterly Report on Form 10-Q filed with the SEC on May 14, 2015).\n10.6\nSecurities Purchase Agreement dated as of July 20, 2015 between LifeLogger Technologies Corp. and Glamis Capital SA (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the SEC on July 27, 2015).\n10.7\nSecurities Purchase Agreement dated as of September 8, 2015 between LifeLogger Technologies Corp. and Old Main Capital, LLC (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the SEC on September 18, 2015).\n10.8\nAsset Purchase Agreement dated November 10, 2015 entered into among LifeLogger Technologies Corp., Pixorial, Inc. and Andres Espineira (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the SEC on November 16, 2015).\n10.9+\nConsulting Agreement dated as of November 10, 2015 between LifeLogger Technologies Corp. and Andres Espineira (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K filed with the SEC on November 16, 2015).\n10.10+\nStock Option Agreement dated as of November 10, 2015 between LifeLogger Technologies Corp. and Andres Espineira (incorporated by reference to Exhibit 10.3 to the Company’s Current Report on Form 8-K filed with the SEC on November 16, 2015).\n10.11\nAmendment dated November 12, 2015 to Promissory Note and Securities Purchase Agreement dated as of July 20, 2015, between LifeLogger Technologies Corp. and Glamis Capital SA (incorporated by reference to Exhibit 10.4 to the Company’s Current Report on Form 8-K filed with the SEC on November 16, 2015).\n10.12\nSecurities Purchase Agreement dated March 9, 2016 between LifeLogger Technologies Corp. and Old Main Capital, LLC (incorporated by reference to Exhibit 10.14 to the Company’s Amendment No. 1 to Quarterly Report on Form 10-Q/A filed with the SEC on March 16, 2016).\n10.13\nFirst Amendment to Asset Purchase Agreement entered into on March 30, 2016 between LifeLogger Technologies Corp. and Pixorial, Inc. (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the SEC on April 5, 2016).\n10.14\nDebt Settlement Agreement dated March 1, 2016 entered into between LifeLogger Technologies Corp. and Glamis Capital SA (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the SEC on March 7, 2016).\n10.15\nAmendment No. 2 to Asset Purchase Agreement entered into as of May 3, 2016 by LifeLogger Technologies Corp. and Pixorial, Inc. (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the SEC on May 5, 2016).\n10.16\nStock Redemption Agreement between LifeLogger Technologies Corp. and Consumer Electronics Ventures Corp. dated May 5, 2016 (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the SEC on May 18, 2016).\n10.17\nAmended and Restated Asset Purchase Agreement dated as of June 20, 2016 between LifeLogger Technologies Corp., Pixorial, Inc. and Andres Espiniera (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K/A (Amendment No. 1) filed with the SEC on June 21, 2016).\n10.18\nSecurities Purchase Agreement dated June 30, 2016, by and between LifeLogger Technologies Corp. and SBI Investments LLC, 2014-1 (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the SEC on July 7, 2016).\n10.19\nInvestment Agreement dated as of February 21, 2017 between LifeLogger Technologies Corp. and Stewart Garner (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the SEC on February 22, 2017).\n10.20\nSecurities Purchase Agreement between LifeLogger Technologies Corp. and Old Main Capital, LLC dated as of April 7, 2017 (incorporated by reference to Exhibit 10.20 to the Company’s Annual Report on Form 10-K filed with the SEC on April 17, 2017).\n10.21\nSecurities Purchase Agreement between LifeLogger Technologies Corp. and SBI Investments LLC, 2014-1 dated as of April 7, 2017 (incorporated by reference to Exhibit 10.21 to the Company’s Annual Report on Form 10-K filed with the SEC on April 17, 2017).\n10.22\nNote Conversion Agreement, dated January 9, 2019, among LifeLogger Technologies Corp., Capital Park Opportunities Fund LP, SBI Investments LLC, 2014-1 and Old Main Capital, LLC (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the SEC on January 15, 2019).\n10.23\nVoting and First Refusal Agreement, dated January 9, 2019, among LifeLogger Technologies Corp., Capital Park Opportunities Fund LP, SBI Investments LLC, 2014-1 and Old Main Capital, LLC (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K filed with the SEC on January 15, 2019).\n31.1*\nSection 302 Certificate of Principal Executive Officer\n31.2*\nSection 302 Certificate of Principal Financial Officer\n32.1*\nSection 906 Certificate of Principal Executive Officer\n32.2*\nSection 906 Certificate of Principal Financial Officer\n101.INS*\nXBRL Instance Document\n101.SCH*\nXBRL Taxonomy Extension Schema Document\n101.CAL*\nXBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF*\nXBRL Taxonomy Extension Definition Linkbase Document\n101.LAB*\nXBRL Taxonomy Extension Label Linkbase Document\n101.PRE*\nXBRL Taxonomy Extension Presentation Linkbase Document\n* Filed herewith.\n+ Management contract or compensatory plan or arrangement.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nBRIDGEWAY NATIONAL CORP.\nDate: June 1, 2021 By: /s/ Eric C. Blue\nEric C. Blue\nChief Executive Officer and Chief Investment Officer\n(Principal executive, financial and accounting officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Eric C. Blue\nChief Executive Officer, Chief Investment Officer and Director\nJune 1, 2021\nEric C. Blue\n(Principal executive, financial and accounting officer)\nBRIDGEWAY NATIONAL CORP.\nPage\nConsolidated Financial Statements for the years ended December 31, 2020 and December 31, 2019:\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of December 31, 2020 and December 31, 2019\nConsolidated Statements of Operations for the years ended December 31, 2020 and December 31, 2019\nConsolidated Statements of Changes in Stockholders’ Deficiency for the years ended December 31, 2020 and December 31, 2019\nConsolidated Statements of Cash Flows for the years ended December 31, 2020 and December 31, 2019\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and Board of Directors of\nBridgeway National Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Bridgeway National Corp. and its subsidiaries (collectively, the “Company”) as of December 31, 2020 and 2019, and the related consolidated statements of operations, stockholders’ deficiency, and cash flows for the years then ended, and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2020 and 2019, and the results of their operations and their cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern Matter\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has suffered recurring losses from operations and has a net capital deficiency that raises substantial doubt about its ability to continue as a going concern. Management’s plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (“PCAOB”) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ MaloneBailey, LLP\nwww.malonebailey.com\nWe have served as the Company’s auditor since 2019.\nHouston, Texas\nJune 1, 2021\nBRIDGEWAY NATIONAL CORP.\nCONSOLIDATED BALANCE SHEETS\nAs at\nDecember 31, 2020 December 31, 2019\nASSETS\nCurrent assets:\nCash 1,915 -\nDue from related party - 84,997\nTotal current assets 1,915 84,997\nProperty and equipment, Net 79,273 3,983\nRights of use assets 722,088 -\nTotal assets $ 803,276 $ 88,980\nLIABILITIES AND STOCKHOLDERS’ DEFICIENCY\nCurrent liabilities:\nAccounts payable 217,098 87,746\nAccrued Expense 417,960 -\nDividend payable 54,366 11,318\nAccrued interest on convertible notes payable 94,727 -\nConvertible notes payable, net of unamortized discount of $184,388 (2019 - $nil) (Note 3) 1,086,612\nDerivative liability - notes and warrants (Note 4) 1,717,337 -\nDue to related party 81,277 -\nRight of use liabilities - operating leases, current 115,547 -\nTotal current liabilities 3,784,924\n99,064\nRight of use liabilities - operating leases, long term 657,457 -\nTotal liabilities 4,442,381 99,064\nStockholders’ deficiency:\nSeries A preferred stock, $0.001 par value, 62,374,819 shares authorized, 1,000 shares issued and outstanding (December 31, 2019 - 1,000), respectively (Note 8)\nSeries B preferred stock, $0.001 par value, 125,181 authorized, 125,001 shares issued and outstanding (December 31, 2019 - 96,429), respectively (Note 8)\nClass B common stock, $0.001 par value, 18,750,000 shares authorized, nil shares issued and outstanding (Note 8) - -\nClass A common stock, $0.001 par value, 168,750,000 shares authorized, 2,410,229 and 2,410,229 issued and outstanding (December 31, 2019 - 2,410,229 and 2,410,229 issued and outstanding), respectively (Note 8) 2,410 2,410\nAdditional paid-in capital 7,388,909 6,893,176\nAccumulated deficit (11,030,550 ) (6,905,767 )\nTotal stockholders’ deficiency (3,639,105 ) (10,084 )\nTotal liabilities and stockholders’ deficiency 803,276 $ 88,980\nSubsequent events (Note 12)\nSee accompanying notes to the consolidated financial statements.\nBRIDGEWAY NATIONAL CORP.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the Year Ended\nDecember 31, 2020 December 31, 2019\nRevenue $ - $ -\nCost of revenue - -\nGross margin - -\nOperating expenses:\nProfessional fees 293,787 300,838\nGeneral and administrative 1,766,932 85,572\nDepreciation expense 49,003\nTotal operating expenses 2,109,722 387,113\nLoss from operations (2,109,722 ) (387,113 )\nOther expenses\nChange in fair value of derivative liabilities (Note 4) 721,661 -\nLoss on derivative liabilities (1,739,698 ) -\nInterest expense (997,024 ) (12,606 )\nTotal other expenses (2,015,061 ) (12,606 )\nLoss from continuing operations before income tax provision (4,124,783 ) (399,719 )\nIncome tax provision (Note 10) - -\nLoss from continuing operations (4,124,783 ) (399,719 )\nEarnings from discontinued operations net of taxes (Note 9) - 622,558\nNet profit (loss) (4,124,783 ) 222,839\nSeries B preferred stock dividend (43,048 ) (39,391 )\nDeemed dividend on convertible preferred stock - (2,397,248 )\nNet loss attributable to common shareholders (4,167,831 ) (2,213,800 )\nNet loss attributable to common shareholders of continuing operations (4,167,837 ) (2,836,358 )\nNet profit attributable to common shareholders of discontinuing operations - 622,558\nNet profit (loss) per common share: Basic and Diluted\n- Continuing operations (1.73 ) (1,18 )\n- Discontinuing operations 0.00 0.26\n- Net loss per common share (1.73 ) (0.92 )\nWeighted average commons shares Outstanding:\n- Basic and diluted 2,410,229 2,410,229\nSee accompanying notes to the consolidated financial statements.\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS’ DEFICIENCY\nFOR THE YEARS ENDED DECEMBER 31, 2020 AND DECEMBER 31, 2019\nPreferred stock\nPar value $0.001\nCommon stock\nPar value $0.001\nAdditional\nPaid-In Accumulated Total\nStockholders’\nNumber of Shares Amount $ Number Amount Capital Deficit Deficiency\nSeries A Series B Series A Series B of Shares $ $ $ $\nBalance, December 31, 2018 1,000 - $ 1 - 2,410,229 $ 2,410 $ 4,073,876 $ (7,128,606 ) $ (3,052,319 )\nPreferred stock issued on conversion of convertible notes payable (Note 8) - 96,429 - - - 2,397,152 - 2,397,248\nElimination of derivative liability due to debt settlement (Note 4) - - - - - - 461,539 - 461,539\nSeries B preferred stock dividend - - - - - - (39,391 ) - (39,391 )\nBeneficial conversion feature on convertible preferred stock - - - - - - 2,397,248 - 2,397,248\nDeemed dividend on convertible preferred stock - - - - - - (2,397,248 ) - (2,397,248 )\nNet profit - - - - - - - $ 222,839 $ 222,839\nBalance, December 31, 2019 1,000 96,429 $ 1 $ 96 2,410,229 $ 2,410 $ 6,893,176 $ (6,905,767 ) $ (10,084 )\nContributions from related party - - - - - - $ 43,686 - $ 43,686\nSeries B Preferred stock dividend - - - - - - (43,048 ) - (43,048 )\nBeneficial conversion feature on convertible notes payable - - - - - - 258,750 $ - $ 258,750\nDeemed Distribution to CEO - - - - - - (163,626 )\n(163,626 )\nPreferred stock issued as compensation for financing - 28,752 - - - 399,971\n- 400,000\nNet loss\n(4,124,783 ) (4124,783 )\nBalance, December 31, 2020 1,000 125,001 $ 1 $ 125 2,410,229 $ 2,410 $ 7,388,909 $ (11,030,550 ) $ (3,639,105 )\nSee accompanying notes to the consolidated financial statements.\nBRIDGEWAY NATIONAL CORP.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the year ended\nDecember 31, 2020 December 31, 2019\nOperating Activities:\nNet profit (loss) $ (4,124,783 ) $ 222,839\nEarnings from discontinued operations - (622,558 )\nAdjustments to reconcile net profit (loss) to net cash from operating activities:\nNon cash operating lease expense 157,547 -\nDepreciation expense 9,616\nInitial recognition of loss of derivative liabilities 1,739,698 -\nChange in fair value of derivative liabilities (721,661 ) -\nInterest expense accretion of convertible notes discount 935,362 -\nIssuance of Series B Preferred Stock as compensation for financing 400,000 -\nChanges in operating assets and liabilities:\nDue to related party 2,648 (113,070 )\nAccounts payable and accrued expenses 591,339 (105,786 )\nRight of use liabilities (106,631 ) -\nNet cash used in operating activities - continued operations (1,116,865 ) (617,872 )\nNet cash used in operating activities - discontinued operations - (3,247,462 )\nNet cash used in operating activities (1,116,865 ) (3,865,334 )\nCash flows from investing activities:\nPurchases of property and equipment (84,906 ) (4,686 )\nNet cash used in investing activities - continued operations (84,906 ) (4,686 )\nNet cash used in investing activities - discontinued operations - (30,000,000 )\nNet cash used in investing activities (84,906 ) (30,004,686 )\nCash flows from financing activities:\nContribution from CEO\n43,686\n-\nProceeds from convertible notes 1,160,000 -\nNet cash provided by financing activities - continued operations 1,203,686 -\nNet cash provided by financing activities - discontinued operations - 33,870,020\nNet cash provided by financing activities 1,203,686 33,870,020\nNet change in cash 1,915 -\nCash - beginning of year - -\nCash - end of year $ 1,915 $ -\nSupplemental Cash Flow Information\nInterest paid - -\nIncome tax paid - -\nDividends declared on Series B preferred stock 43,048 39,391\nInitial recognition of beneficial conversion feature 258,750 -\nDividends on Series B Preferred Stock paid by related party on behalf of the Company - 28,073\nRight of use assets and right of use liabilities recognized 879,635 -\nIssuance of Series B preferred stock on conversion of convertible notes payable - 2,397,248\nInitial recognition of debt discount 750,000 -\nDeemed distribution to CEO 163,626 -\nElimination of derivative liability due to debt settlement - 461,539\nSee accompanying notes to the consolidated financial statements.\nBRIDGEWAY NATIONAL CORP.\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2020 and 2019\nNote 1 - Organization and Operations\nBridgeway National Corp., which we refer to as “the Company,” “our Company,” “we,” “us” or “our,”‎ was originally incorporated under the laws of the State of Nevada as Snap Online Marketing Inc. on June 4, 2012 and subsequently changed its name to LifeLogger Technologies Corp., which we were referred to as “LifeLogger.” On April 10, 2019, we reincorporated as a Delaware corporation and changed our name to Capital Park Holdings Corp. On December 19, 2019, we changed our name to Bridgeway National Corp. Our principal business address is 1015 15th Street NW Suite 1030, Washington, DC 20005, 202-846-7869. We registered as a reporting company under the Securities Exchange Act of 1934, as amended (the “Exchange Act”) on April 26, 2013. We are currently listed for trading on the OTC Pink under the trading symbol “BDGY.” See Note 12 “Subsequent Events” for organizational and operational changes that occurred after December 31, 2020.\nOn January 9, 2019, Capital Park Opportunities Fund LP, which we refer to as “Capital Park Opportunities Fund,” acquired (i) from SBI Investments LLC, 2014-1, a statutory series of Delaware limited liability corporation (“SBI”) and Old Main Capital, LLC, a Florida series limited liability corporation (“Old Main,” together with SBI, the “Selling Shareholders”) 83,796 shares of the Company’s common stock (the “Common Stock”) owned by the Selling Shareholders and (ii) from Stewart Garner (the “Series A Preferred Stock Holder”) 1,000 shares of the Company’s Series A Preferred Stock (the “Preferred Stock”), collectively representing 84.4% of the voting power of the Company’s voting stock. Capital Park Opportunities Fund is managed by Eric Blue, our Chairman, Chief Executive Officer (“CEO”) and Chief Investment Officer (“CIO”).\nOn January 9, 2019, Eric C. Blue was elected as our sole director, CEO and CIO. On July 13, 2020, Eon Washington commenced an employment relationship with the Company as its Chief Operating Officer - Director of Operations.\nOn April 10, 2019, we converted from a Nevada corporation to a Delaware corporation and adopted new bylaws and a new certificate of incorporation, which amended and restated the Company’s Articles of Incorporation in Nevada. Under the new certificate of incorporation, we created an additional series of our stock now named Class B common stock, par value $0.001 per share. Each share of Class B common stock is identical to the Class A common stock in liquidation, dividend and similar rights. The only difference between our Class B common stock and our Class A common stock is that each share of Class B common stock has 10 votes for each share held, while the Class A common stock has a single vote per share, and certain actions cannot be taken without the approval of the holders of the Class B common stock.\nPrior to the transactions that took place on January 9, 2019, we were a lifelogging software company that developed and hosted a proprietary cloud-based software solution ‎accessible on iOS and Android devices that offers an enhanced media experience for consumers by augmenting ‎videos, livestreams and photos with additional context information and providing a platform that makes it easy to ‎find and use that data when viewing or sharing media. Subsequent to transactions that took place on January 9, 2019, in addition to its lifelogging software business, the Company has been structured as a holding company ‎with a business strategy focused on owning subsidiaries engaged in a number of diverse business activities.‎\nNote 2 - Summary of Significant Accounting Policies\nBasis of Presentation\nThe consolidated financial statements have been prepared by the Company in accordance with accounting principles generally accepted in the Unites States of America (“US GAAP”), applied on a consistent basis, and are expressed in United States dollars (“USD”).\nGoing Concern\nThe consolidated financial statements have been prepared on a going concern basis, which contemplates continuity of operations, realization of assets, and liquidation of liabilities in the normal course of business.\nAs reflected in the consolidated financial statements, the Company had an accumulated deficit of $11,030,550 at December 31, 2020, and a net loss of ($4,124,783) for the year ended December 31, 2020. These factors raise substantial doubt about the Company’s ability to continue as a going concern.\nAlthough the Company has recently broadened its business and operating model in an effort to generate more sufficient and stable sources of revenues and cash flows, its cash position is not sufficient to support its daily operations. While the Company believes that its new business and operating model presents a viable strategy to generate sufficient revenue and believes in its ability to raise additional funds by way of a public or private offering, there can be no assurances to that effect.\nThe consolidated financial statements do not include any adjustments related to the recoverability and classification of recorded asset amounts or the amounts and classification of liabilities that might be necessary if the Company is unable to continue as a going concern.\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. The Company regularly evaluates estimates and assumptions. The Company bases its estimates and assumptions on current facts, historical experience and various other factors that it believes to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities and the accrual of costs and expenses that are not readily apparent from other sources. The actual results experienced by the Company may differ materially and adversely from the Company’s estimates. To the extent there are material differences between the estimates and the actual results, future results of operations will be affected.\nCash Equivalents\nFor the purpose of the statement of cash flows, cash equivalents include time deposits, certificate of deposits, and all highly liquid debt instruments with original maturities of three months or less.\nProperty and Equipment\nProperty and equipment are stated at cost. Expenditures for maintenance and repairs are charged to earnings as incurred; additions, renewals and betterments are capitalized. When property and equipment are retired or otherwise disposed of, the related cost and accumulated depreciation are removed from the respective accounts, and any gain or loss is included in operations. Depreciation of property and equipment is provided using the declining balance method for substantially all assets with estimated lives and rates as follows:\nComputer Equipment 30%\nOffice Equipment 20%\nDepreciation methods, useful lives and residual values are reviewed periodically and adjusted prospectively if appropriate.\nProperty and equipment as at December 31, 2020 consisted of the following:\nDecember 31,\n$\nDecember 31,\n$\nComputer and equipment 23,214 4,686\nOffice equipment 66,378 -\n89,592 4,686\nAccumulated depreciation (10,319 ) (703 )\nTotal 79,273 3,983\nNote 2 - Summary of Significant Accounting Policies (continued)\nGoodwill\nGoodwill represents the excess of the purchase price paid, over the net fair value of assets acquired and liabilities assumed, to purchase an enterprise or asset. The Company tests goodwill for impairment at least annually, during the fourth quarter of each fiscal year, or more frequently if events or changes in circumstances indicate that the asset may be impaired.\nThe accounting guidance provides the Company with the option to perform a qualitative assessment to determine whether further impairment testing is necessary. At December 31, 2019, the Company recorded an impairment for the goodwill relating to the discontinued operations. Refer to Note 9.\nIntangible assets\nIntellectual property, customer contracts and tradenames that were acquired by the Company from a third party are capitalized and subsequently measured at cost less accumulated amortization and accumulated impairment losses, if they have finite useful lives, they are for approved products or if there are alternative future uses. Amortization is calculated over the cost of the intangible asset less its residual value. Amortization is recognized in profit or loss on a straight-line basis over the estimated useful lives of intangible assets from the date that they are available for use, since this most closely reflects the expected pattern of consumption of the future economic benefits embodied in the asset. At December 31, 2019, the Company recorded an impairment for the intangible assets relating to the discontinued operations. Refer to Note 9.\nLong-Lived Assets\nThe Company applies the provisions of ASC Topic 360, Property, Plant, and Equipment, which addresses financial accounting and reporting for the impairment or disposal of long-lived assets. ASC 360 requires impairment losses to be recorded on long-lived assets used in operations when indicators of impairment are present and the undiscounted cash flows estimated to be generated by those assets are less than the assets’ carrying amounts. In that event, a loss is recognized based on the amount by which the carrying amount exceeds the fair value of the long-lived assets. Loss on long-lived assets to be disposed of is determined in a similar manner, except that fair values are reduced for the cost of disposal. At December 31, 2019, the Company recorded an impairment for the long-lived assets relating to the discontinued operations.\nRevenue Recognition\nASU No. 2014-09, Revenue from Contracts with Customers (“Topic 606”), became effective for the Company on January 1, 2018. The Company’s revenue recognition disclosure reflects its updated accounting policies that are affected by this new standard. The Company applied the “modified retrospective” transition method for open contracts for the implementation of Topic 606. This new standard did not result in a material recognition of revenue on the Company’s accompanying consolidated financial statements for the cumulative impact of applying this new standard.\nRevenue recognized under Topic 606 in a manner that reasonably reflects the delivery of its goods and services to customers in return for expected consideration and includes the following elements:\n● executed contracts with the Company’s customers that it believes are legally enforceable;\n● identification of performance obligations in the respective contract;\n● determination of the transaction price for each performance obligation in the respective contract;\n● allocation the transaction price to each performance obligation; and\n● recognition of revenue only when the Company satisfies each performance obligation.\nFair Value of Financial Instruments\nFor certain of the Company’s consolidated financial instruments, including accounts payable, the carrying amounts approximate their fair values due to their short maturities.\nFASB ASC Topic 820, Fair Value Measurements and Disclosures, requires disclosure of the fair value of financial instruments held by the Company. FASB ASC Topic 825, Financial Instruments, defines fair value, and establishes a three-level valuation hierarchy for disclosures of fair value measurement that enhances disclosure requirements for fair value measures. The carrying amounts reported in the condensed consolidated balance sheets for receivables and current liabilities each qualify as financial instruments and are a reasonable estimate of their fair values because of the short period of time between the origination of such instruments and their expected realization and their current market rate of interest. The three levels of valuation hierarchy are defined as follows:\n● Level 1 inputs to the valuation methodology are quoted prices for identical assets or liabilities in active markets.\nNote 2 - Summary of Significant Accounting Policies (continued)\n● Level 2 inputs to the valuation methodology include quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets in inactive markets, and inputs that are observable for the asset or liability, either directly or indirectly, for substantially the full term of the financial instrument.\n● Level 3 inputs to the valuation methodology use one or more unobservable inputs which are significant to the fair value measurement.\nThe Company analyzes all financial instruments with features of both liabilities and equity under FASB ASC Topic 480, Distinguishing Liabilities from Equity, and FASB ASC Topic 815, Derivatives and Hedging.\nThe fair value hierarchy gives the highest priority to quoted prices (unadjusted) in active markets for identical assets or liabilities and the lowest priority to unobservable inputs. If the inputs used to measure the financial assets and liabilities fall within more than one level described above, the categorization is based on the lowest level input that is significant to the fair value measurement of the instrument. The Company’s assessment of the significance of a particular input to the fair value measurement in its entirety requires judgment, and considers factors specific to the asset or liability including certain market assumptions and pertinent information available to management.\nThe carrying amount of the Company’s financial assets and liabilities, such as cash, accounts payable and accrued liabilities approximate their fair value because of the short maturity of those instruments. The derivative liabilities are fair valued as described below.\nValuation of Derivatives\nThe Company evaluates its convertible instruments, options, warrants or other contracts to determine if those contracts or embedded components of those contracts qualify as derivatives to be separately accounted for under ASC Topic 815, “Derivatives and Hedging.” The result of this accounting treatment is that the fair value of the derivative is marked-to-market each balance sheet date. The change in fair value is recorded in the statement of operations as other income (expense). Upon conversion or exercise of a derivative instrument, the instrument is marked to fair value at the conversion date and then that fair value is reclassified to equity. Equity instruments that are initially classified as equity that become subject to reclassification under ASC Topic 815 are reclassified to liabilities at the fair value of the instrument on the reclassification date. The Company analyzed the derivative financial instruments in accordance with ASC 815. The objective is to provide guidance for determining whether an equity-linked financial instrument is indexed to an entity’s own stock. This determination is needed for a scope exception which would enable a derivative instrument to be accounted for under the accrual method. The classification of a non-derivative instrument that falls within the scope of ASC 815-40-05 “Accounting for Derivative Financial Instruments Indexed to, and Potentially Settled in, a Company’s Own Stock” also hinges on whether the instrument is indexed to an entity’s own stock. A non-derivative instrument that is not indexed to an entity’s own stock cannot be classified as equity and must be accounted for as a liability. There is a two-step approach in determining whether an instrument or embedded feature is indexed to an entity’s own stock. First, the instrument’s contingent exercise provisions, if any, must be evaluated, followed by an evaluation of the instrument’s settlement provisions. The Company utilized multinomial lattice models that value the derivative liability based on a probability weighted discounted cash flow model. The Company utilized the fair value standard set forth by the Financial Accounting Standards Board, defined as the amount at which the assets (or liability) could be bought (or incurred) or sold (or settled) in a current transaction between willing parties, that is, other than in a forced or liquidation sale.\nThe derivative liabilities result in a reduction of the initial carrying amount (as unamortized discount) of the Convertible Notes. This derivative liability is marked-to-market each quarter with the change in fair value recorded in the statement of operations. Unamortized discount is amortized to interest expense using the effective interest method over the life of the Convertible Note.\nRelated Parties\nThe Company follows subtopic 850-10 of the FASB Accounting Standards Codification for the identification of related parties and disclosure of related party transactions.\nIncome Taxes\nThe Company accounts for income taxes in accordance with ASC Topic 740, Income Taxes. ASC 740 requires a company to use the asset and liability method of accounting for income taxes, whereby deferred tax assets are recognized for deductible temporary differences, and deferred tax liabilities are recognized for taxable temporary differences. Temporary differences are the differences between the reported amounts of assets and liabilities and their tax bases. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion, or all of the deferred tax assets will not be realized. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment.\nNote 2 - Summary of Significant Accounting Policies (continued)\nUnder ASC 740, a tax position is recognized as a benefit only if it is “more likely than not” that the tax position would be sustained in a tax examination, with a tax examination being presumed to occur. The amount recognized is the largest amount of tax benefit that is greater than 50% likely of being realized on examination. For tax positions not meeting the “more likely than not” test, no tax benefit is recorded. The Company has no material uncertain tax positions for any of the reporting periods presented.\nStock-Based Compensation\nThe Company records stock-based compensation in accordance with FASB ASC Topic 718, Compensation - Stock Compensation. FASB ASC Topic 718 requires companies to measure compensation cost for stock-based employee compensation at fair value at the grant date and recognize the expense over the requisite service period. The Company recognizes in the statement of operations the grant-date fair value of stock options and other equity-based compensation issued to employees and non-employees.\nThere were no options outstanding as of December 31, 2020 (December 31, 2019 - Nil).\nBasic and Diluted Earnings Per Share\nEarnings per share is calculated in accordance with ASC Topic 260, Earnings Per Share. Basic earnings per share (“EPS”) is based on the weighted average number of common shares outstanding. Diluted EPS assumes that all dilutive securities are converted. Dilution is computed by applying the treasury stock method. Under this method, options and warrants are assumed to be exercised at the beginning of the period (or at the time of issuance, if later), and as if funds obtained thereby were used to purchase common stock at the average market price during the period. There were 2,640,625 (post reverse split number for 10,562,499) warrants and nil options outstanding as of December 31, 2020 (December 31, 2019 - nil), which could have been exercised for 2,640,625 common shares (assuming no cashless exercise), 125,001 shares of preferred convertible stock that were convertible into 120,270 common shares and $845,000 in convertible notes that were convertible into 120,270 common shares. Due to the net loss incurred potentially dilutive instruments would be anti-dilutive. Accordingly, diluted loss per share is the same as basic loss for all periods presented.\nRecent Accounting Pronouncements\nThe Company has implemented all new accounting pronouncements that are in effect. These pronouncements did not have any material impact on the consolidated financial statements unless otherwise disclosed, and the Company does not believe that there are any other new accounting pronouncements that have been issued that might have a material impact on its consolidated financial position or results of operations.\nReverse Stock Split\nAll references to common shares and common share data in these consolidated financial statements and elsewhere in this Form 10-K as of December 31, 2020 and 2019, and for the years then ended, reflect the Reverse Stock Split approved by FINRA on February 17, 2021.\nAs at\nNote 3 - Convertible Notes Payable\nNote Issue\nDate Interest\nRate December 31, 2020 Principal\nBalance\nMarch 2, 2020 12 % $ 845,000\nSeptember 30, 2020 6 % $ 155,000\nOctober 3, 2020 6 % $ 155,000\nOctober 23, 2020 9 % $ 68,000\nNovember 16, 2020 9 % $ 48,000\nTotal\n$ 1,271,000\nThe weighted average interest rate and remaining term of the fixed rate debt is 10% and 7.17 months as of December 31, 2020.\nThe movement in convertible notes payable is as follows:\nOriginal\nAmount\nUnamortized\nDiscount\nGuaranteed\nInterest\nAccrued\nNet\nSettlement\nTotal\nOpening as of January 1, 2016\n$ - $ - $ - $ - $ -\nEnding as of December 31, 2018\n$ 1,339,066 $ (11,809 ) $ 58,954 $ (280,621 ) $ 1,105,590\nNote Conversion: January 9, 2019\n$ (1,339,066 ) $ 11,809 $ (58,954 ) $ 280,621 $ (1,105,590 )\nEnding as of December 31, 2019\n- - - - -\nIssued: March 2, 2020 (ii) 845,000 - 88,349 - $ 933,349\nIssued: September 30, 2020 (ii) 155,000 (75,417 ) 2,344 - $ 81,927\nIssued October 3, 2020 (ii) 155,000 (103,908 ) 2,344 - $ 53,436\nIssued: October 23, 2020 (iii) 68,000 (2,433 ) 1,157 - $ 66,724\nIssued: November 16, 2020 (iii) 48,000 (2,630 ) - $ 45,903\nEnding as of\nDecember 31,2020\n$ 1,271,000 (184,388 ) 94,727 - $ 1,181,339\nNote 3 - Convertible Notes Payable (continued)\nAll convertible notes issued by the Company prior to January 9, 2019 (together with all interest owed on such notes, whether default or ordinary in nature) were converted into Series B Preferred Shares (the “Equity Shares”) as of January 9, 2019.\n(i) Securities Purchase Agreement and Convertible Notes Issued to Calvary Fund I, LP; Oasis Capital, LLC and SBI Investments LLC\nOn March 2, 2020 (the “Issue Date”), the Company entered into an unsecured promissory note purchase agreement with SBI, on behalf of itself and the other note purchasers (the “Note Purchasers”), pursuant to which the Note Purchasers purchased from the Company (a) 12% convertible promissory notes of the Company in an aggregate principal amount of $845,000 (the “12% Notes”) of which $75,000 were related to original issuance discount and $20,000 were related to deferred finance costs (with the understanding that the initial six months of such interest shall be guaranteed) (together with any note(s) issued in replacement thereof or as a dividend thereon or otherwise with respect thereto in accordance with the terms thereof, the “Notes”, and each, a “Note”), convertible into shares (the “Conversion Shares”) of common stock of the Company (the “Common Stock”) and (b) warrants (the “Warrants”) to acquire up to 1,111,842 Shares subject to a beneficial ownership cap of no greater than 4.99% in the case of each Purchaser (the “Warrant Shares”).\nThe maturity date of the 12% Notes shall be on that day that is nine (9) months after the Issue Date (the “Maturity Date”) and is the date upon which the principal amount of the 12% Notes, as well as all accrued and unpaid interest and other fees, shall be due and payable. The notes are currently in Default status at a rate of 24% which has been accrued.\nUnder the terms of the 12% Notes, the Note Purchasers shall have the right at any time on or after the Issue Date, to convert (a “Conversion”) all or any part of the outstanding and unpaid principal amount and accrued and unpaid interest of the 12% Notes, and any other amounts owed under the 12% Notes, into shares at the Conversion Price (as defined below); provided, however, that in no event shall any Note Purchaser be entitled to convert any portion of any of the 12% Notes in excess of that portion of any 12% Note upon conversion of which the sum of (a) the number of shares owned by the Note Purchaser and its affiliates (other than Shares issuable upon conversion of the 12% Notes or exercise of the Warrants held by such Note Purchaser) and (b) the number of shares issuable upon the conversion of the portion of any 12% Note with respect to which the determination of this provision is being made, would result in beneficial ownership by any Note Purchaser and its affiliates of more than 4.99% of the Company’s outstanding shares (the “Maximum Share Amount”). The “Conversion Price” per share shall be the lower of (i) $0.38 or (ii) the Variable Conversion Price (as defined below) (subject to adjustment). The “Variable Conversion Price” shall mean 70% multiplied by the Market Price (as defined below). “Market Price” means the lowest Trading Price (as defined below) for our common stock during the fifteen (15) Trading Day period ending on the last complete Trading Day prior to the Conversion Date. “Trading Price” means, as of any date, the lowest VWAP price for our shares on the applicable trading market trading market (the “Trading Market”) as reported by a reliable reporting service.\nThe exercise price of the Warrants is $0.38 per share, subject to adjustment. Each Warrant also contains a cashless exercise option and has a term of five (5) years from the Issue Date. The Notes and Warrants included embedded derivative features that were accounted for as derivative liabilities due to the variable conversion prices upon default and forced conversion; full reset provisions; and redemption features based on FASB. The Warrants were treated as derivative liabilities due to the tainted equity environment based on the notes that are convertible into an indeterminate number of shares. On March 2, 2020, the Company recorded an initial recognition loss of derivative liabilities of $1,739,698, $750,000 discount on the notes payable of which $50,700 is 6-months guaranteed interest and $95,000 original issuance discount amortized over the term of the convertible notes. The amount of amortization recognized on the discount for the year ended was $845,000.\nAs at December 31, 2020 the Company owed $845,000 (December 31, 2019 - $nil) in principal and the accrued interest was $88,349, which consisted of accrued interest and default interest.\n(ii) On September 30, 2020 (the “Issue Date”), the Company entered into an unsecured promissory note purchase agreement with SBI, on behalf of itself and the other note purchasers (the “Note Purchasers”), pursuant to which the Note Purchasers purchased from the Company (a) two 6% convertible promissory notes ($155,000 each) of the Company in an aggregate principal amount of $310,000 (the “6% Notes”) convertible into Shares (the “Conversion Shares”) subject to a beneficial ownership cap of no greater than 4.99% in the case of each Purchaser. Pursuant to the agreement, each note was issued with an original issue discount of $5,000 and as such the purchase price was $150,000. The proceeds of one note was received on October 3, 2020.\nThe maturity date of the 6% Notes shall be on that day that is nine (9) months after the Issue Date (the “Maturity Date”) and is the date upon which the principal amount of the 6% Notes, as well as all accrued and unpaid interest and other fees, shall be due and payable. The notes also carry a default rate of 18%.\nUnder the terms of the 6% Notes, the Note Purchasers shall have the right at any time on or after the Issue Date, to convert (a “Conversion”) all or any part of the outstanding and unpaid principal amount and accrued and unpaid interest of the 6% Notes, and any other amounts owed under the 6% Notes, into shares at the Conversion Price of $0.16; provided, however, that in no event shall any Note Purchaser be entitled to convert any portion of any of the 6% Notes in excess of that portion of any 6% Note upon conversion of which the sum of (a) the number of owned by the Note Purchaser and its affiliates (other than Shares issuable upon conversion of the 6% Notes or exercise of the Warrants held by such Note Purchaser) and (b) the number of shares issuable upon the conversion of the portion of any 6% Note with respect to which the determination of this provision is being made, would result in beneficial ownership by any Note Purchaser and its affiliates of more than the Maximum Share Amount up to 4.99% of outstanding shares. The “Conversion Price” per share shall be $0.16.\nAs at December 31, 2020 the Company owed $310,000 (December 31, 2019 - $nil) in principal and the accrued interest was $4,688. The debenture is convertible into common shares of the Company at a conversion price $0.04. The convertible debt was not considered tainted due to 5,812,500 shares of common stock held on reserve for issuance upon full conversion of this debenture. The Company evaluated the convertible notes for a beneficial conversion feature in accordance with ASC 470-20 “Debt with Conversion and Other Options.” The Company determined that the conversion price was below the closing stock price on the commitment date, and the convertible notes contained a beneficial conversion feature. The Company recognized the intrinsic value of the embedded beneficial conversion feature of $258,750 as additional paid-in capital and reduced the carrying value of the convertible notes to $41,250. The carrying value will be accreted over the term of the convertible notes up to their face value of $310,000.\nAs at December 31, 2020, the carrying value of the 6% Note was $130,675 and had an unamortized discount of $179,325 ($172,658 beneficial conversion feature and $6,667 OID). During the year ended December 31, 2020, the Company recorded accretion expense of $89,425.\n(iii) Securities Purchase Agreement and Convertible Notes Issued to Geneva Roth Remark Holdings, Inc.\nOn October 23, 2020 (the “Issue Date”), the Company entered into an unsecured promissory note purchase agreement with Geneva Roth Remark Holdings, Inc. (the “Note Purchaser”), pursuant to which the Note Purchaser purchased from the Company (a) the 9% convertible promissory note of the Company in an aggregate principal amount of $68,000 ($3,000 OID) (the “9% Note”) convertible into Shares (the “Conversion Shares”) subject to a beneficial ownership cap of no greater than 4.99% in the case of the Purchaser (the “Maximum Share Amount”). The maturity date of the 9% Note shall be on October 23, 2021 (the “Maturity Date”) and is the date upon which the principal amount of the 9% Note, as well as all accrued and unpaid interest and other fees, shall be due and payable. The Note also has a 22% default interest rate.\nUnder the terms of the 9% Note, the Note Purchaser shall have the right at any time during the period beginning on the date which is one hundred eighty (180) days following the date of the 9% Note and ending on the later of: (i) the Maturity Date and (ii) the date of payment of the default amount, to convert (a “Conversion”) all or any part of the outstanding and unpaid principal amount and accrued and unpaid interest of the 9% Note, and any other amounts owed under the 9% Note, into shares at the Conversion Price (as defined below); provided, however, that in no event shall the Note Purchaser be entitled to convert any portion of any of the 9% Note in excess of that portion of the 9% Note upon conversion of which the sum of (a) the number of shares owned by the Note Purchaser and its affiliates and (b) the number of shares issuable upon the conversion of the portion of the 9% Note with respect to which the determination of this provision is being made, would result in beneficial ownership by the Note Purchaser and its affiliates of more than the Maximum Share Amount . The “Conversion Price” shall be equal to the Variable Conversion Price (as defined below) (subject to equitable adjustments for stock splits, stock dividends or rights offerings by the Company relating to the Company’s securities or the securities of any subsidiary of the Company, combinations, recapitalization, reclassifications, extraordinary distributions and similar events). The “Variable Conversion Price” shall mean 65% multiplied by the Market Price (representing a discount rate of 35%). “Market Price” means the average of the three (3) lowest trading prices for the shares during the fifteen (15) trading day period ending on the latest complete trading day prior to the Conversion Date.\nAs at December 31, 2020 the Company owed $68,000 (December 31, 2019 - $nil) in principal and the accrued interest was $1,157 with unamortized debt discount of $2,433. During the year ended December 31, 2020, the Company recorded discount amortization expense of $567.\nOn November 16, 2020 (the “Issue Date”), the Company entered into an unsecured promissory note purchase agreement with Geneva Roth Remark Holdings, Inc. (the “Note Purchaser”), pursuant to which the Note Purchaser purchased from the Company (a) the 9% convertible promissory note of the Company in an aggregate principal amount of $48,000 ($3,000 OID) (the “9% Note II”) convertible into Shares (the “Conversion Shares”) subject to a beneficial ownership cap of no greater than 4.99% in the case of the Purchaser (the “Maximum share Amount”). The maturity date of the 9% Note II shall be on November 16, 2021 (the “Maturity Date”) and is the date upon which the principal amount of the 9% Note, as well as all accrued and unpaid interest and other fees, shall be due and payable. The Note also has a 22% default interest rate.\nUnder the terms of the 9% Note II, the Note Purchaser shall have the right at any time during the period beginning on the date which is one hundred eighty (180) days following the date of the 9% Note II and ending on the later of: (i) the Maturity Date and (ii) the date of payment of the default amount, to convert (a “Conversion”) all or any part of the outstanding and unpaid principal amount and accrued and unpaid interest of the 9% Note II, and any other amounts owed under the 9% Note II, into shares at the Conversion Price (as defined below); provided, however, that in no event shall the Note Purchaser be entitled to convert any portion of any of the 9% Note II in excess of that portion of the 9% Note II upon conversion of which the sum of (a) the number of shares owned by the Note Purchaser and its affiliates and (b) the number of shares issuable upon the conversion of the portion of the 9% Note II with respect to which the determination of this provision is being made, would result in beneficial ownership by the Note Purchaser and its affiliates of more than the Maximum Share Amount . The “Conversion Price” shall be equal to the Variable Conversion Price (as defined below) (subject to equitable adjustments for stock splits, stock dividends or rights offerings by the Company relating to the Company’s securities or the securities of any subsidiary of the Company, combinations, recapitalization, reclassifications, extraordinary distributions and similar events). The “Variable Conversion Price” shall mean 65% multiplied by the Market Price (as defined below) (representing a discount rate of 35%). “Market Price” means the average of the three (3) lowest trading prices for the shares during the fifteen (15) trading day period ending on the latest complete trading day prior to the Conversion Date.\nAs at December 31, 2020 the Company owed $48,000 (December 31, 2019 - $nil) in principal and the accrued interest was $533 with unamortized debt discount of $2,630. During the year ended December 31, 2020, the Company recorded discount amortization expense of $370.\nNote 4 - Derivative Liability\nIn connection with the sale of debt or equity instruments, the Company may sell options or warrants to purchase the Company’s common stock. In certain circumstances, these options or warrants may be classified as derivative liabilities, rather than as equity. Additionally, the debt or equity instruments may contain embedded derivative instruments, such as embedded derivative features which in certain circumstances may be required to be bifurcated from the associated host instrument and accounted for separately as a derivative instrument liability.\nThe Company’s derivative instrument liabilities are re-valued at the end of each reporting period, with changes in the fair value of the derivative liability recorded as charges or credits to income in the period in which the changes occur. For options, warrants and bifurcated embedded derivative features that are accounted for as derivative instrument liabilities, the Company estimates fair value using either quoted market prices of financial instruments with similar characteristics or other valuation techniques. The valuation techniques require assumptions related to the remaining term of the instruments and risk-free rates of return, the Company’s current common stock price and expected dividend yield, and the expected volatility of the Company’s common stock price over the life of the instrument.\nThe following table summarizes the warrant derivative liabilities and convertible notes activity for the twelve months ended December 31, 2020 and December 31, 2019:\nDerivative Liabilities\nFair value at December 31, 2018 461,539\nElimination of derivative liability due to debt settlement (461,539\n)\nDerivative liabilities as at December 31, 2019 -\nInitial recognition of loss of derivative liabilities $ 1,739,698\nConvertible notes discount 699,300\nChange in fair value of warrants and notes (721,661 )\nDerivative liabilities as at December 31, 2020 $ 1,717,337\nThe Monte Carlo methodology was used to value the derivative components as of December 31, 2020, using the following assumptions:\nWarrants Notes\nDividend yield - 12 %\nRisk-free rate for term 0.28% to 0.88 % 0.08% - 0.95 %\nVolatility 288.6% to 325.3 % 286.5% to 348.1 %\nRemaining term (Years) 4.17\n0.5\nStock Price $0.090 to $0.440 $0.090 to $0.440\nNote 5 - Fair Value of Financial Instruments\nThe Company’s financial instruments consist of cash and cash equivalents, accounts payable and accrued expenses, derivative liabilities and convertible debt. The estimated fair value of cash and cash equivalents, accounts payable and accrued liabilities approximate their carrying amounts due to the short-term nature of these instruments.\nThe Company utilizes various types of financing to fund its business needs, including convertible debt with warrants attached. The Company reviews its warrants and conversion features of securities issued as to whether they are freestanding or contain an embedded derivative and, if so, whether they are classified as a liability at each reporting period until the amount is settled and reclassified into equity with changes in fair value recognized in current earnings. The fair value of the warrants and the embedded conversion feature of the convertible debt is classified as a liability. Some of these units have embedded conversion features that are treated as a discount on the Notes. Such financial instruments are initially recorded at fair value and amortized to interest expense over the life of the debt using the effective interest method.\nInputs used in the valuation to derive fair value are classified based on a fair value hierarchy which distinguishes between assumptions based on market data (observable inputs) and an entity’s own assumptions (unobservable inputs). The hierarchy consists of three levels:\nLevel one - Quoted market prices in active markets for identical assets or liabilities;\nLevel two - Inputs other than level one inputs that are either directly or indirectly observable; and\nLevel three - Unobservable inputs developed using estimates and assumptions, which are developed by the reporting entity and reflect those assumptions that a market participant would use.\nDetermining which category an asset or liability falls within the hierarchy requires significant judgment. The Company evaluates its hierarchy disclosures each quarter. The Company’s derivative liability is measured at fair value on a recurring basis. The Company classifies the fair value of these convertible notes and warrants derivative liability under level three. The Company’s settlement payable is measured at fair value on a recurring basis based on the most recent settlement offer. The Company classifies the fair value of the settlement payable under level three. The Company’s rescission liability is measured at fair value on a recurring basis based on the most recent stock price. The Company classifies the fair value of the rescission liability under level one.\nBased on ASC Topic 815 and related guidance, the Company concluded the common stock purchase warrants are required to be accounted for as derivatives as of the issue date due to a reset feature on the exercise price. At the date of issuance warrant derivative liabilities were measured at fair value using either quoted market prices of financial instruments with similar characteristics or other valuation techniques. The Company records the fair value of these derivatives on its balance sheet at fair value with changes in the values of these derivatives reflected in the statements of operations as “Gain (loss) on derivative liabilities.” These derivative instruments are not designated as hedging instruments under ASC 815-10 and are disclosed on the balance sheet under Derivative Liabilities.\nNote 5 - Fair Value of Financial Instruments (continued)\nThe following table presents liabilities that are measured and recognized at fair value on a recurring and non-recurring basis:\nDescription Level 1 Level 2 Level 3 Gains (Losses)\nDerivatives $ - $ - $ 1,717,337 $ (1,018,037 )\nFair Value at December 31, 2020 $ - $ - $ 1,717,337 $ (1,018,037 )\nDerivatives $ - $ - $ - $ -\nFair Value at December 31, 2019 $ - $ - $ - $ -\nNote 6 - Stock Options and Warrants:\nThe following is a summary of stock option activity:\nOptions\nOutstanding\nWeighted\nAverage Exercise\nPrice\nWeighted Average\nRemaining Contractual\nLife\nAggregate Intrinsic\nValue\nOutstanding, December 31, 2018 50,000 $ 12.00 1.42 -\nGranted - - - -\nForfeited - - - -\nCancelled (50,000 ) $ 12.00\nExercised - - - -\nOutstanding, December 31, 2019 - - - -\nExercisable, December 31, 2019 - - - -\nGranted - - - -\nForfeited - - - -\nCancelled - - - -\nExercised - - - -\nOutstanding, December 31, 2020 - $ - - $ -\nExercisable, December 31, 2020 - $ - - $ -\nThe fair value of the stock options was amortized to stock option expense over the vesting period. The Company recorded stock option expense of $nil, included in operating expenses, during the year ended December 31, 2020, and $nil during the year ended December 31, 2019. At December 31, 2020, the unamortized stock option expense was $nil (December 31, 2019 - $nil).\nAs at December 31, 2020, the Company had the following warrant securities outstanding:\nCommon Stock\nWarrants\nDecember 31, 2018 36,667\nLess: Exercised\n-\nLess: Cancelled (36,667\n)\nAdd: Issued -\nDecember 31, 2019 -\nLess: Exercised -\nLess: Cancelled -\nAdd: Issued 2,640,625 *\nDecember 31, 2020 2,640,625\nWarrants (Note 4) 1,111,842\nExercise Price $ 0.380\nExpiration Date March 2, 2025\n* As at December 31, 2020, the number of warrants outstanding included a full reset adjustment due to the issuance of additional convertible notes.\nThe fair value of the warrants at issuance was $577,868, with an expiration of March 2, 2025 and exercise price of $0.380. During the year ended December 31, 2020, the exercise price was reset to $0.16. The fair value of the warrants as at December 31, 2020 was $473,759.\nNote 7 - Related Party Transactions\nRelated Parties\nRelated parties with whom the Company had transactions are:\nRelated Parties\nRelationship\nStew Garner\nChairman, CEO, CFO and director (resigned effective January 9, 2019)\nEric Blue\nChairman, CEO, CFO and director (effective January 9, 2019)\nDue from related company\nDuring the year ended December 31, 2019, an amount of $113,070 of payments were made on behalf of a related company by virtue of same management. The amount of $84,997 due to related party as of December 31,2019 were unsecured, bore no interest and were due on demand. Included in the amount were $28,073 in dividends paid by the related party on behalf of the Company as of December 31, 2019.\nDuring the year ended December 31, 2020, an amount of $163,626 were characterized as a deemed distribution to the CEO; an amount of $82,642 of advances and $85,290 of payments were made to the CEO. Included in the due to related party balance sheet account was a balance of $81,277 owed to the current CEO of the Company as of December 31, 2020, which were unsecured, bore no interest and were due on demand. During the year ended December 31, 2020, the CEO also made $43,686 cash contribution to the Company.\nNote 8 - Stockholders’ Deficiency\nShares Authorized\nThe Company’s authorized capital stock consists of 168,750,000 shares of Class A common stock, par value $0.001 per share, 18,750,000 Class B common stock, par value $0.001per share and 62,500,000 shares of preferred stock, par value $0.001 per share of which 1000 shares are designated “Series A Preferred Stock” and of which one hundred twenty-five thousand one hundred eighty-one (125,181) shares are designated “Series B Preferred Stock”.\nOn January 9, 2019, the Company entered into a Note Conversion Agreement (the “Conversion Agreement”) with SBI Investments LLC, 2014-1, a statutory series of Delaware limited liability corporation (“SBI”), and Old Main Capital, LLC, a Florida series limited liability corporation (“Old Main”). Pursuant to the Conversion Agreement, SBI converted $549,042 of principal and $641,565 accrued interest owed to SBI by the Company pursuant to a promissory Note into 42,429 shares of the Company’s Series B Preferred Stock, par value $0.001 per share (the “Series B Preferred Stock”), in full satisfaction of such obligation. Pursuant to the Conversion Agreement, Old Main converted $556,547 of principal and $650,094 accrued interest owed to Old Main by the Company pursuant to a promissory Note into 54,000 shares of the Company’s Series B Preferred Stock in full satisfaction of such obligation.\n‎Effective as of April 10, 2019, the Company reincorporated to the State of Delaware from the State of Nevada and amended its Articles of Incorporation to decrease its authorized capital stock from 500,000,000 to 30,000,000 shares, of which 25,000,000 will be common stock and 5,000,000 will be preferred stock, of which, 1000 ‎shares have been previously designated as Series A Preferred Stock (the “Series A Preferred Stock”) and 96,429 shares have been designated as Series B Preferred Stock (the “Series B Preferred Stock”). In connection with the Company reincorporating to the State of Delaware, the Company also filed certificates of designation, preferences and rights for the Series A Preferred Stock and Series B Preferred Stock with the Secretary of State of the State of Delaware.\nEffective as of December 19, 2019, the authorized share capital of the Company was increased from 30,000,000 shares to 250,000,000 shares, of which 187,500,000 shares will be Common Stock (the “Common Stock”), 168,750,000 shares of the Common Stock will be designated Class A Common Stock (the “Class A Common Stock”), 18,750,000 shares of the Common Stock will be designated Class B Common Stock (the “Class B Common Stock”) and 62,500,000 shares will be designated preferred stock, of which, 62,374,819 shares have been designated as Series A Preferred Stock (the “Series A Preferred Stock”) and 125,181 shares have been designated as Series B Preferred Stock.\nNote 8 - Stockholders’ Deficiency (continued)\nPreferred Stock\nDuring the twelve-month period ended December 31, 2020, the Company declared $43,048 in dividends on the Series B Preferred Stock. A total of $54,366 was accrued as a dividend payable as of December 31, 2020.\nOn January 9, 2019, the Company entered into a Note Conversion Agreement (the “Conversion Agreement”) with SBI Investments LLC, 2014-1, a statutory series of Delaware limited liability corporation (“SBI”), and Old Main Capital, LLC, a Florida series limited liability corporation (“Old Main”). Pursuant to the Conversion Agreement, SBI converted $549,042 of principal and $641,565 accrued interest owed to SBI by the Company pursuant to a promissory Note into 42,429 shares of the Company’s Series B Preferred Stock, par value $0.001 per share (the “Series B Preferred Stock”), in full satisfaction of such obligation. Pursuant to the Conversion Agreement, Old Main converted $556,547 of principal and $650,094 accrued interest owed to Old Main by the Company pursuant to a promissory Note into 54,000 shares of the Company’s Series B Preferred Stock in full satisfaction of such obligation. Concurrently with and the closing of the transactions for the Old Main Conversion Shares, with an effective date of January 9, 2019, the Company acquired from Old Main and SBI 83,796 shares of Class A Common Stock and from a prior executive of the Company, 1000 shares of Series A Preferred Stock. The purchase price for the Class A Common Stock was $335.18 in the aggregate and the purchase price for the Series A Preferred Stock was $1 in the aggregate. Each share of Series A Preferred Stock is entitled to 50,000 votes on all matters submitted to a vote of the Company’s stockholders. In the event that such votes do not total at least 51% of all votes, then the votes cast by the holders of the Series A Preferred Stock shall be equal to 51% of all votes cast at any meeting of the Company’s stockholders or any issue put to the stockholders for voting.\nThe shares of the Series B preferred stock are convertible into shares of the Company’s common stock equal to a forty percent (40%) discount to the lowest volume weighted average price of the Company’s Common Stock during the fifteen (15) days immediately preceding the day of exercise of the conversion right. The preferred stock shall have such other rights, preferences and privileges to be set forth in a certificate of designation to be filed with the Secretary of State including Series B preferred stock are entitled to dividend preference to receive cash dividends at the rate of three percent (3.00%) of the Original Series B Issue Price per annum and no voting rights. The Company evaluated the convertible preferred stock under FASB ASC 470-20-30 and determined it contained a beneficial conversion feature. The intrinsic value of the beneficial conversion feature was determined to be $2,397,248. The beneficial conversion feature was fully amortized and recorded as a deemed dividend. During the year ended December 31, 2019, the Company declared $39,391 in dividends on the Series B Preferred Stock, of which $28,073 was paid by a related company and $11,318 accrued.\nOn October 24, 2019, the Company entered into an equity purchase agreement (the “Purchase Agreement”) with SBI and Oasis Capital, LLC, a Puerto Rico limited liability company (“Oasis” and together with SBI, the “Investors”, and each, an “Investor”), pursuant to which the Investors agreed to, in the aggregate between the Investors, purchase from the Company up to Ten Million Dollars ($10,000,000) (the “Maximum Commitment Amount”) of the Common Stock.\nUnder the terms of the Purchase Agreement, the Company shall have the right, but not the obligation, to direct an Investor, by its delivery to the Investor of a put notice (the “Put Notice”) from time to time beginning on the execution date of the Purchase Agreement and ending on the earlier to occur of: (i) the date on which the Investors shall have purchased Put Shares equal to the Maximum Commitment Amount, (ii) October 24, 2021, or (iii) written notice of termination by the Company to the Investors (together, the “Commitment Period”), to purchase Put Shares.\nNote 8- Stockholders’ Deficiency (continued)\nNotwithstanding any other terms of the Purchase Agreement, in each instance, (i) the amount that is the subject of a Put Notice (the “Investment Amount”) is not more than the Maximum Put Amount (as defined below), (ii) the aggregate Investment Amount of all Put Notices shall not exceed the Maximum Commitment Amount and (iii) the Company cannot deliver consecutive Put Notices and/or consummate closings to the same Investor, meaning for the avoidance of doubt, that Put Notices delivered by the Company must alternate between Oasis and SBI. “Maximum Put Amount” means the lesser of (i) such amount that equals two hundred fifty percent (250%) of the average daily trading volume of the Common Stock and (ii) One Million Dollars ($1,000,000.00). The price paid for each share of Common Stock (the “Purchase Price”) subject to a Put Notice (each, a “Put Share”) shall be 85% of the Market Price (as defined below) on the date upon which the Purchase Price is calculated in accordance with the terms and conditions of the Purchase Agreement. “Market Price” means the one (1) lowest traded price of the Common Stock on the principal market for any trading day during the Valuation Period (as defined below), as reported by Bloomberg Finance L.P. or other reputable source. “Valuation Period” means the period of five (5) consecutive trading days immediately following the Clearing Date (as defined below) associated with the applicable Put Notice during which the Purchase Price of the Common Stock is valued, provided, however, that the Valuation Period shall instead begin on the Clearing Date if the respective Put Shares are received as DWAC Shares in the applicable Investor’s brokerage account prior to 11:00 a.m. EST on the respective Clearing Date. “Clearing Date” means the date on which an Investor receives the Put Shares as DWAC Shares in its brokerage account.\nConcurrently with the execution of the Purchase Agreement, the Company, SBI and Oasis entered into a Registration Rights Agreement, dated as of October 24, 2019 (the “Registration Rights Agreement”).\nPursuant to the Registration Rights Agreement, the Company shall by December 8, 2019, file with the SEC an initial registration statement on Form S-1 covering the maximum number of Registrable Securities (as defined below) as shall be permitted to be included in accordance with applicable SEC rules, regulations and interpretations so as to permit the resale of such Registrable Securities by the Investors, including but not limited to under Rule 415 under the Securities Act at then prevailing market prices (and not fixed prices), as mutually determined by both the Company and the Investors in consultation with their respective legal counsel. “Registrable Securities” means all of the Put Shares which have been, or which may, from time to time be issued, including without limitation all of the shares of Common Stock which have been issued or will be issued to an Investor under the Purchase Agreement (without regard to any limitation or restriction on purchases), and any and all shares of capital stock issued or issuable with respect to Put Shares (as such terms are defined in the Purchase Agreement) issued or issuable to an Investor, and shares of Common Stock issued to an Investor with respect to the Put Shares and the Purchase Agreement as a result of any stock split, stock dividend, recapitalization, exchange or similar event or otherwise, without regard to any limitation on purchases under the Purchase Agreement.\nAs compensation for the commitments made under the Purchase Agreement, the Company paid to the Investors a commitment fee equal to four percent (4%) of the Maximum Commitment Amount (the “Commitment Fee”). The Commitment Fee was paid by the Company by issuing to the Investors 28,572 shares of the Company’s Series B Preferred Stock, authorized on February 25, 2020 and issued as on February 25, 2020 with the amount of $400,000 recorded to deferred financing costs. The fair value was determined based on the issuance price mutually agreed upon between the parties as at the date of issuance.\nAs at December 31, 2020, there were 125,181 shares of Series B Preferred Stock authorized. The Series B Preferred Stock are redeemable at the option of the holders and have an aggregate redemption value of $1,752,534 at the holders’ request based on the Company’s approval and the Company had declared $43,048 in dividends of which $0 were paid in cash and $43,048 were accrued.\nOn April 15, 2021, the Company notified SBI and Old Main of its intent to terminate the Purchase Agreement effective immediately. The Series B preferred shares issued to the equity purchasers as a Commitment Fee will remain on record and the deferred financing costs was immediately expensed during the year ended December 31, 2020.\nNote 9- Acquisition and discontinued operations\nThe Company entered into an agreement (the “Transaction Agreement”) on May 3, 2019 with C-PAK, P&G, and Capital Park Holdings Corp., solely in its capacity as guarantor, for an acquisition of certain assets pertaining to the “Joy” and “Cream Suds” trademarks for $30,000,000.\nThe acquisition meets the definition of a business and has been accounted for in accordance with the authoritative guidance on business combinations; therefore, the tangible and intangible assets acquired and liabilities assumed were recorded at fair value on the acquisition date. The purchase price of $30,000,000 was allocated as follows:\nTangible assets\nMolds 17,500\nPrepaid expenses 70,000\nTotal $ 87,500\nIntangible asset\nIntellectual Property/Technology 1,028,000\nCustomer Base 6,806,000\nTradenames - trademarks 4,775,000\nTotal $ 12,609,000\nGoodwill 17,303,500\nTotal net assets acquired $ 30,000,000\nTotal cash consideration paid $ 30,000,000\nAs at October 1, 2019, the Transaction Agreement was terminated between the parties. The terms of the termination are undergoing further negotiations. Results of operations, financial position and cash flows for these businesses are separately reported as discontinued operations.\nFinancial information for discontinued operations for the year ended December 31, 2019\nExpenses (2,409,309 )\nOther income (expenses)\nOther income 1,556,376\nInterest expense (1,388,576 )\nImpairment of intangible assets (12,005,872 )\nImpairment of goodwill (17,303,500 )\nWrite-off of tangible assets (17,500 )\nSettlement of debt 32,190,939\nIncome before income tax provision 622,558\nBenefit (provision) for income taxes -\nIncome from discontinued operations, net of taxes 622,558\nThere were no assets or liabilities of discontinued operations held as at December 31, 2019 and December 31, 2020.\nNote 9- Acquisition and discontinued operations (continued)\nP&G Secured Promissory Note\nIn connection with the entering into of the Transaction Agreement, C-PAK (together with certain affiliates, the “Note Borrowers”) entered into a Senior Secured Promissory Note (the “Secured Note”) in the original principal amount of $9,950,000 with P&G, in its respective capacity as the “Note Lender.”\nThe interest rate applicable to the borrowing under the Secured Note is equal to 6.00% which is deferred and payable on the maturity date of the Secured Note. Under the Secured Note, the Borrowers must repay the unpaid principal amount of the Secured Note on September 13, 2019. The Note was not repaid as at maturity date.\nThe Secured Note contains customary affirmative and negative covenants, which, among other things, limit the Borrower’s ability to (i) incur additional indebtedness, (ii) pay dividends or make certain distributions or (iii) dispose of its assets, grant liens or encumber its assets. These covenants are subject to a number of exceptions and qualifications. During the year ended December 31, 2019, the Company had recorded an interest expense of $150,477 on the Secured Note.\nDue to the cancellation of the Transaction Agreement, the Secured Note and interest expense has been deemed as settled. Therefore, $nil balance was outstanding as of December 31, 2019.\nSenior Secured Credit Facility\nOn May 3, 2019, C-PAK Consumer Product Holdings LLC, a Delaware limited liability company (“C-PAK”) and C-‎PAK Consumer Product IP SPV LLC, a Delaware limited liability company (“C-PAK IP”, together with C-PAK, the ‎‎”Borrowers”) entered into a loan agreement with Piney Lake Opportunities ECI Master Fund LP, a Cayman Islands ‎exempted limited partnership (“PLC ECI-Master Fund”), in its respective capacities as the “Administrative Agent”, ‎‎”Collateral Agent” and “Lender”, pursuant to which the Borrowers obtained a $22 million term loan (the “Loan ‎Agreement”). The proceeds of the loan were used to acquire certain assets from The Procter & Gamble Company, ‎an Ohio corporation (“P&G”) and to pay fees and expenses related thereto. The Borrowers are subsidiaries of a majority-owned subsidiary of the Company‎, C-PAK Consumer Product Holdings SPV I LLC, a Delaware limited liability company (“C-PAK Holdings”). C-PAK Holdings is a guarantor under the Loan Agreement. An additional balance of $3,000,000 was obtained from PLC ECI-Master Fund by related company, C-PAK. The terms are aligned with the Senior Secured Credit Facility below.\nAs security for its obligations under the Loan Agreement, C-PAK Holdings and the Borrowers granted a lien on substantially all of its assets to the Lender pursuant to a Guaranty and Security Agreement dated May 3, 2019, by and among the Borrowers, C-PAK Holdings and the Collateral Agent (the “Guaranty and Security Agreement”) and a Trademark Security Agreement dated May 3, 2019 by and between C-PAK IP and the Collateral Agent (the “Trademark Security Agreement”).\nThe Loan Agreement contains customary affirmative and negative covenants, which, among other things, limit the Borrower’s ability to (i) incur additional indebtedness, (ii) pay dividends or make certain distributions or (iii) dispose of its assets, grant liens or encumber its assets. These covenants are subject to a number of exceptions and qualifications.\nThe interest rate applicable to the borrowing under the Loan Agreement is equal to LIBOR plus a margin of 12.00% which is payable monthly beginning on June 30, 2019. Under the Loan Agreement, the Borrowers must repay the unpaid principal amount of the loans quarterly in an amount equal to $440,000 which was to begin on September 30, 2019. The Loan Agreement will mature on May 3, 2024. As at December 31, 2019, the monthly instalments were not yet repaid. During the year ended December 31, 2019, the Company had recorded an interest expense of $825,407 on the loan payable.\nDue to the cancellation of the Transaction Agreement, the loan and interest expense has been deemed as settled. Therefore, $nil balance was outstanding for the year ended December 31, 2019. In connection with the closing of the transaction contemplated by the transaction agreement, the Company received a transaction fee in the amount of $400,000 (the “Transaction Fee”) where the Company recorded the transaction fee as an accrual with its Deferred Financing Fee balance sheet account. In conjunction with termination of the Transaction Agreement, the Company has immediately reversed the accrual for the Transaction Fee and immediately expensed the Transaction Fee in this period.\nNote 10 - Income Tax Provision\nDeferred Tax Assets\nAt December 31, 2020, the Company had net operating loss (“NOL”) carryforwards for Federal income tax purposes of $4,170,283 that may be offset against future taxable income through 2036. No tax benefit has been reported with respect to these net operating loss carry-forwards in the accompanying consolidated financial statements because the Company believes that the realization of the Company’s net deferred tax assets of approximately $875,760 was not considered more likely than not and accordingly, the potential tax benefits of the net loss carry-forwards are offset by a full valuation allowance.\nDeferred tax assets consist primarily of the tax effect of NOL carry-forwards. The Company has provided a full valuation allowance on the deferred tax assets because of the uncertainty regarding its realizability.\nThe statutory rate and the effective tax rate for and as of December 31, 2020 was 21% (2019 - 21%).\nComponents of the unrealized deferred tax assets:\nDecember 31, 2020 December 31, 2019\nNet deferred tax assets - Non-current:\nExpected income tax benefit from NOL carry-forwards 875,760 636,814\nLess valuation allowance (875,760 ) (636,814 )\nDeferred tax assets, net of valuation allowance $ - -\nIncome Tax Provision in the Statements of Operations\nA reconciliation of the federal statutory income tax rate and the effective income tax rate as a percentage of income before income taxes is as follows:\nDecember 31, 2020 December 31, 2019\n$ $\nLoss from continuing operations (4,124,783 ) (399,719 )\nExpected income tax recovery from net loss (866,204 ) (83,941 )\nNon-deductible expenses 496,375\nChange in valuation allowance 369,829 83,793\n- -\nThe Company is neither under examination by any taxing authority, nor has it been notified of any impending examination. The Company’s tax years for its Federal and State jurisdictions which are currently open for examination are the years of 2016 - 2020.\nNote 11- Lease\nThe Company entered into an operating lease agreement with a scheduled commencement date on January 15, 2020 for a sixty-seven-month term, with an option to renew for a five-year term.\nThe Company adopted ASC 842 - Leases using the modified retrospective cumulative catch-up approach beginning on January 1, 2019. Under this approach, the Company did not restate its comparative amounts and recognized a right-of-use asset equal to the present value of the future lease payments. The Company elected to apply the practical expedient to only transition contracts which were previously identified as leases and elected to not recognize right-of-use assets and lease obligations for leases of low value assets.\nWhen measuring the right of use liabilities, the Company discounted lease payments using its incremental borrowing rate at January 15, 2020. The weighted-average-rate applied is 12%.\n$\nOperating lease right-of-use asset - initial recognition 879,635\nAmortization (157,547 )\nBalance at December 31, 2020 722,088\nRight of use liabilities - operating leases - initial recognition 879,635\nPrincipal repayment (106,631 )\nBalance at December 31, 2020 773,004\nCurrent portion of right of use liabilities - operating leases 115,547\nNoncurrent portion of right of use liabilities - operating leases 657,457\nThe operating lease expense was $217,919 for the twelve months ended December 31, 2020 and included in the general and administrative expenses.\nThe following table represents the contractual undiscounted cash flows for right of use liabilities - operating leases due within twelve months of December 31,\n$\n211,114\n216,392\n221,802\n227,347\n135,934\nTotal minimum lease payments 1,012,589\nLess: effect of discounting (239,585 )\nPresent value of future minimum lease payments 773,004\nLess: current portion of right of use liabilities - operating leases 115,547\nNoncurrent portion of right of use liabilities - operating leases 657,457\nNote 12 - Subsequent Events\nSmall Business Administration Loans\nOn March 31, 2021, Bridgeway was approved for a SBA Loan-1in the amount of $723,743 and on March 24, 2021 was approved for an SBA Loan-2 in the original principal amount of $150,000. SBA Loan-1 shall be eligible for forgiveness if during the 8-to-24-week covered period following disbursement: (i) employee and compensation levels are maintained; (ii) the loan proceeds are spent on payroll costs and other eligible expenses and (iii) at least 60% of the proceeds are spent on payroll costs. For any portion of the SBA Loan-1 that is not forgiven, it will bear interest at a 1% fixed APR for the life of the loan with payments deferred for ten (10) months. With respect to the SBA Loan-2, interest will accrue at the rate of 3.75% per annum with installment payments, including principal and interest, of $731.00 per month beginning on the twelve (12) month anniversary of the funding date. The balance of principal and interest will be payable on the thirty (30) year anniversary of the funding date.\nSubsequent Financing Transaction\nOn January 20, 2021 (the “Issue Date”), the Company entered into an unsecured promissory note purchase agreement with Geneva Roth Remark Holdings, Inc. (the “Note Purchaser”), pursuant to which the Note Purchaser purchased from the Company (a) the 9% convertible promissory note of the Company in an aggregate principal amount of $48,000 ($3,000 OID) (the “9% Note III”) convertible into Shares (the “Conversion Shares”) subject to a beneficial ownership cap of no greater than 4.99% in the case of the Purchaser (the “Maximum share Amount”). The maturity date of the 9% Note III shall be on January 20, 2022 (the “Maturity Date”) and is the date upon which the principal amount of the 9% Note, as well as all accrued and unpaid interest and other fees, shall be due and payable. The Note also has a 22% default interest rate.\nUnder the terms of the 9% Note III, the Note Purchaser shall have the right at any time during the period beginning on the date which is one hundred eighty (180) days following the date of the 9% Note III and ending on the later of: (i) the Maturity Date and (ii) the date of payment of the default amount, to convert (a “Conversion”) all or any part of the outstanding and unpaid principal amount and accrued and unpaid interest of the 9% Note III, and any other amounts owed under the 9% Note III, into shares at the Conversion Price; provided, however, that in no event shall the Note Purchaser be entitled to convert any portion of any of the 9% Note III in excess of that portion of the 9% Note III upon conversion of which the sum of (a) the number of shares owned by the Note Purchaser and its affiliates and (b) the number of shares issuable upon the conversion of the portion of the 9% Note III with respect to which the determination of this provision is being made, would result in beneficial ownership by the Note Purchaser and its affiliates of more than the Maximum Share Amount. The “Conversion Price” shall be equal to the Variable Conversion Price (as defined below) (subject to equitable adjustments for stock splits, stock dividends or rights offerings by the Company relating to the Company’s securities or the securities of any subsidiary of the Company, combinations, recapitalization, reclassifications, extraordinary distributions and similar events). The “Variable Conversion Price” shall mean 65% multiplied by the Market Price (representing a discount rate of 35%). “Market Price” means the average of the three (3) lowest trading prices for the shares during the fifteen (15) trading day period ending on the latest complete trading day prior to the Conversion Date.\nClass A and Class B Common Stock Reverse Stock Split\nOn October 16, 2020, the board of directors (the “Board”) of the Company and a stockholder holding a majority of the voting power of the Company’s voting stock (the “Majority Stockholder”) took action by joint written consent in lieu of a meeting to: (i) ratify the approval of an amendment to the Company’s certificate of incorporation, which amendment was filed with the Delaware Secretary of State on December 19, 2019 and was declared effective on January 20, 2020 (the “December 2019 Amendment”), which (i) changed the Company’s name from “Capital Park Holdings Corp.” to “Bridgeway National Corp.” and (ii) increased our authorized capital stock from 30,000,000 shares to 250,000,000 shares, of which 168,750,000 shares were designated as Class A Common Stock (the “Class A Common Stock”), 18,750,000 shares were designated as Class B Common Stock (the “Class B Common Stock”) and 62,500,000 shares were designated as preferred stock, of which 62,374,819 shares were previously designated as Series A Preferred Stock (the “Series A Preferred Stock”) and 125,181 shares were previously designated as Series B Preferred Stock (the “Series B Preferred Stock”); (ii) approve a further amendment to the Company’s certificate of incorporation (the “Recapitalization Amendment”) to increase the Common Stock from 187,500,000 shares to 400,000,000 shares, of which 360,000,000 shares will be designated as the Class A Common Stock and 40,000,000 shares will be designated as the Class B Common Stock and (iii) approve an additional amendment to the certificate of incorporation to effect a reverse stock split of our outstanding shares of our Class A Common Stock and Class B Common Stock at the at the ratio of one-for-4 (the “Reverse Stock Split Amendment,” and together with the December 2019 Amendment and the Recapitalization Amendment, collectively, the “Amendments”).\nThe December 2019 Amendment will not be deemed ratified, and the Recapitalization Amendment and Reverse Stock Split Amendment will not be made effective until at least twenty (20) calendar days after the mailing of the Information Statement accompanying this Notice. In addition, the Reverse Stock Split Amendment will not be made effective until the Recapitalization Amendment is made effective and we receive FINRA approval for the Reverse Stock Split from the Financial Industry Regulatory Authority (“FINRA”). We received written notification that FINRA had approved the Reverse Stock Split on February 17, 2021."
}