{
    "cik": "1567900",
    "company": "BLACKBOXSTOCKS INC.",
    "filing_type": "10-K",
    "filing_date": "2021-03-31",
    "period_of_report": "2020-12-31",
    "sic": "7371",
    "state_of_inc": "NV",
    "state_location": "TX",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1567900/0001437749-21-007800-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1567900/000143774921007800/blkbx20201231_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1567900/0001437749-21-007800.txt",
    "filename": "1567900_10K_2020_0001437749-21-007800.htm",
    "item_1": "ITEM 1. BUSINESS\nOverview of Business\nBlackboxstocks, Inc. is a financial technology and social media hybrid platform offering real-time proprietary analytics and news for stock and options traders of all levels. Our web-based software (the “Blackbox System”) employs “predictive technology” enhanced by artificial intelligence to find volatility and unusual market activity that may result in the rapid change in the price of a stock or option. We continuously scan the New York Stock Exchange (“NYSE”), NASDAQ, Chicago Board Options Exchange (the “CBOE”), and other options markets, analyzing over 8,000 stocks and over 1,000,000 options contracts multiple times per second. We provide our users with a fully interactive social media platform that is integrated into our dashboard, enabling our users to exchange information and ideas quickly and efficiently through a common network. We recently introduced a live audio/video feature that allows our members to broadcast on their own channels to share trading strategies and market insight within the Blackbox community. We employ a subscription based Software as a Service (“SaaS”) business model and maintain a growing base of users that spans 42 countries.\nThe Blackbox System is a unique and disruptive financial technology platform combining proprietary analytics and broadcast enabled social media to connect traders of all types worldwide on an intuitive, user-friendly system. The complexity of our backend analytics is neatly hidden from the end user by our simple and easy to navigate dashboard which includes real-time alerts, scanners, financial news, institutional grade charting and proprietary analytics.\nDevelopment of the Blackbox System\nThe Blackbox System was made available for use to subscribing customers worldwide in September 2016. In December 2017, we launched our first Options Flow Scanner as a new feature on our platform. Our Options Flow Scanner is designed to monitor and alert our users to unusual activity on the options exchange. We have created many proprietary options alerts and a proprietary options “heatmap” to allow our users to follow large options purchases in real-time. This has proven to be a very popular feature for our users. We also added a Dark Pool Scanner in 2020. The Dark Pool Scanner feature monitors, tracks and displays large blocks of stock that are often purchased in dark pools and not on the regular exchanges. In October of 2020 we completed a system integration with the online brokerage platform TradeStation. This integration allows Blackbox users that have an account with TradeStation to trade directly through the Blackbox platform without leaving our dashboard.\nWe also provide our users with a full set of internal social media functions within our dashboard. These features include chat rooms, direct messaging, follow/block capability, custom user profiles, and most importantly broadcast enabled audio channels. We believe that combining these social media features with our analytics, within a single dashboard provides a unique user experience allowing for the rapid exchange of information and consensus throughout our community. The resulting dynamic is what we describe as “the best of man and machine”.\nWe are in the process of developing and anticipate adding many new features and functions to the Blackbox System, including but not limited to, native iOS and Android mobile applications, a crypto currency analytics and trading platform, as well as a comprehensive watchlist and portfolio management system. In January of 2021 we deployed an intermediate native application for iOS an Android phones to send push notifications to our users which allowed us to cease using a third-party solution that was inefficient and cumbersome. We are also in the process of upgrading our current chat and audio broadcast feature. Development of planned features and functions are expected to cost approximately $250,000.\nMarketing of the Blackbox System\nThe Company launched its Blackbox System web application for domestic use and made it available to subscribers in September 2016. Use of the Blackbox System is sold on a monthly or annual subscription basis to individual consumers through our website at http://www.blackboxstocks.com. We believe our Blackbox System subscriptions are priced competitively with similar web-based trading tools. We primarily use a combination of digital marketing campaigns and customer referral compensation plans in our advertising program. Our digital advertising efforts utilize banner and similar marketing on social media platforms as well as targeted email. We believe that this form of advertising has been and will continue to be effective in attracting subscribers. We continuously monitor and evaluate the effectiveness of specific social media platforms and allocate marketing funds accordingly. We also promote our subscriptions through an established compensated customer referral program. We offer certain subscribers the right to promote the Blackbox System and receive referral fees for subscribers generated from such subscribers’ effort. Generally, we pay referring subscribers $25 for each subscription generated and $25 for each month the subscriber continues their subscription. We incurred $272,908 and $121,227 in customer referral expenditures in each of the years ended December 31, 2020 and 2019, respectively. We expect to continue utilizing the customer referral sales program as it has proven to be an extremely efficient form of advertising. Our advertising and marketing expense was $705,706 and $261,470 for the years ended December 31, 2020 and 2019, respectively. We intend to continue to deploy a significant amount of marketing funds on both digital campaigns and customer referral programs in the future. In addition, we may also utilize television and radio advertising.\nIntellectual Property\nWe rely on a combination of trademark and copyright laws, trade secrets, confidentiality provisions and other contractual provisions to protect our proprietary rights, which are primarily our brand names, product coding and marks. As of the date of this report, the Company has not yet registered any trademarks, copyrights or other intellectual property associated with our business.\nGovernment Regulation and Approvals\nThe Company offers its subscribing customers a trading tool and not a trading platform, broker dealer or exchange, and therefore does not expect to be subject to regulatory oversight by the SEC, FINRA or other financial regulatory agencies. We are not aware of any governmental regulations or approvals required for the marketing or use of our Blackbox System or the services provided.\nCompetition\nWe operate in a highly competitive environment. The principal resources necessary for the development of investment software tools and services and knowledgeable personnel to conduct all phases of development and marketing operations are limited. We must compete for such resources with startups, major financial services companies and midsize competitors. Many of these competitors have financial and other resources substantially greater than ours.\nWe consider our platform unique and do not consider any trading tools or trading analytics software direct competitors of our Company. There are many trading tools on the current market often referred to as “scanners”, that provide features, functions and analytics similar to those of the Blackbox System. There are also many social media platforms that cater to stock traders that serve as real-time informational sources. However, we believe that our Blackbox System is the only platform that has successfully merged a comprehensive analytics system or “scanner” and a social media platform within the same “dashboard” allowing users to view the same real-time data in parallel. Our Blackbox System creates a unique community for traders that can all share the same information and analyze this information on an identical analytics in real-time. We also consider our system unique because our predictive algorithms automatically populate alerts for active stocks with high probability of short-term gains. In spite of these factors that differentiate us, we believe the following companies that could be considered competitors due to some like features and retail price point: Trade Ideas, Flow Algo, Trade Alert and Wall Street Jesus.\nEmployees\nAs of March 30, 2021, the Company has 7 full-time employees and one part-time employee. We consider our relationship with our employees to be good.\nAdditional Information\nWe file annual reports on Form 10-K and quarterly reports on Form 10-Q with the Securities and Exchange Commission (the “SEC”) on a regular basis, and disclose certain material events in current reports on Form 8-K. The public may read and copy any materials that we file with the SEC at the Public Reference Room at the SEC located at 100 F Street NE, Washington, DC 20549, on official business days during the hours of 10 a.m. to 3 p.m. The public may also obtain information on the operation of the Public Reference Room by calling the SEC at 1-800-SEC-0330. The SEC maintains an Internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC at http://www.sec.gov.\nWe make available, free of charge on our website (http://www.blackboxstocks.com), our annual reports on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K (and any amendments to such reports) as soon as reasonably practical after such reports are filed. Information contained on or connected to our website is not incorporated by reference into this report and should not be considered part of this report or any other filing that we make with the SEC.",
    "item_1A": "ITEM 1A. RISK FACTORS\nThe Company is a “smaller reporting company” as defined by Rule 12b-2 of the Exchange Act, and as such, is not required to provide the information required under this Item.",
    "item_1B": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item_2": "ITEM 2. PROPERTIES\nWe do not own any real estate or other physical properties. Our principal office is located at 5430 LBJ Freeway, Suite 1485, Dallas, Texas 75240 in office space leased from Teachers Insurance and Annuity Association of America. During the years ended December 31, 2020 and 2019 we incurred $59,597 and $54,631, respectively, in office rental expense. Future minimum rental payments under the extended lease are $61,800 in 2021 and $46,863 in 2022.",
    "item_3": "ITEM 3. LEGAL PROCEEDINGS\nThere are currently no material pending legal or governmental proceedings, other than ordinary routine litigation incidental to the business, to which the Company or any of its subsidiaries is a party or of which any of their property is the subject.",
    "item_4": "ITEM 4. MINE SAFETY DISCLOSURES.\nNot applicable.\nPART II",
    "item_5": "ITEM 5.\nMARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nOur Common Stock is quoted on the OTC Pink tier of the OTC Markets Group, Inc. (the “OTC Pink”) under the symbol “BLBX.” The following table shows the reported high and low closing bid prices per share for our Common Stock based on information provided by the OTC Pink. The over-the-counter market quotations set forth for our Common Stock reflect inter-dealer prices, without retail mark-up, mark-down or commission and may not necessarily represent actual transactions.\nCommon Stock\nBid Price\nFinancial Quarter Ended\nHigh ($)\nLow ($)\nDecember 31, 2020\n2.15\n3.35\nSeptember 30, 2020\n3.10\n2.00\nJune 30, 2020\n2.55\n2.21\nMarch 31, 2020\n2.75\n1.99\nDecember 31, 2019\n4.95\n4.74\nSeptember 30, 2019\n6.60\n2.50\nJune 30, 2019\n9.00\n6.60\nMarch 31, 2019\n14.97\n3.00\nOn March 17, 2021, the last closing bid price per share for our Common Stock reported by the OTC Pink was $2.55.\nHolders\nRecords of Securities Transfer Corporation, our transfer agent, indicate that as of March 17, 2021, we had 696 record holders of our Common Stock. The number of registered stockholders excludes any estimate by us of the number of beneficial owners of shares of Common Stock held in “street name.” As of March 17, 2021, we had 8,579,877 shares of our Common Stock issued and outstanding.\nDividends\nWe have not declared any dividends on our Common Stock and do not anticipate that we will declare or pay any dividends on our Common Stock in the foreseeable future. Any future determination to pay cash dividends will be at the discretion of our Board of Directors and will be dependent upon our financial condition, operating results, capital requirements, applicable contractual restrictions, restrictions in our organizational documents, and any other factors that our Board of Directors deems relevant.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe Company has no equity compensation plans.\nRecent Sales of Unregistered Securities\nDuring the quarter ended December 31, 2020 the Company sold 6,411 shares of Common Stock and Warrants, exercisable for a period of 5 years, to purchase 3,206 shares of Common Stock at an exercise price of $1.95 per share, to third parties for aggregate consideration of $12,501.\nDuring the quarter ended December 31, 2020 the Company sold 155,505 shares of Common Stock to third parties for $303,235.\nDuring the quarter ended December 31, 2020 the Company issued 51,283 shares of its Common Stock at a value of $1.95 to third parties in settlement of convertible promissory notes.\nOn December 7, 2020 the Company issued 23,000 shares of its Common Stock at a value of $1.95 to a third party in conjunction with a consulting services agreement.\nOn November 4, 2020 the Company issued 3,000 shares of its Common Stock at a value of $1.95 to a third party as forbearance previously granted on notes payable settled in 2019.\nThe securities described above were privately offered and sold in reliance upon exemptions from registration pursuant to Section 4(a)(2) under the Securities Act. The Company reasonably believed that each of the purchasers of such securities had access to information concerning its operations and financial condition, were acquiring the securities for their own account and not with a view to the distribution thereof, and each investor qualified as an \"accredited investor\" as such term is defined in Rule 501(a) of Regulation D promulgated under the Securities Act. Furthermore, no \"general solicitation\" was made by the Company with respect to sale of any of the securities. At the time of their issuance, the securities described above were deemed to be restricted securities for purposes of the Securities Act and the documentation representing the securities bear legends and/or non-transfer provisions to that effect.\nAll of the Company’s other sales of unregistered securities during the period covered by the Report have been previously reported as required in Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q and/or current reports on Form 8-K.\nPurchases of Equity Securities by the Issuer and Affiliated Purchasers\nNone.",
    "item_6": "ITEM 6.\nSELECTED FINANCIAL DATA\nNot required.",
    "item_7": "ITEM 7.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of the results of financial condition and results of operations for the fiscal years ended December 31, 2020 and 2019 should be read in conjunction with our financial statements, and the notes to those financial statements that are included elsewhere in this Form 10-K.\nOur discussion includes forward-looking statements based upon current expectations that involve risks and uncertainties, such as our plans, objectives, expectations and intentions. Actual results and the timing of events could differ materially from those anticipated in these forward-looking statements as a result of a number of factors. We use words such as “anticipate,” “estimate,” “plan,” “project,” “continuing,” “ongoing,” “expect,” “believe,” “intend,” “may,” “will,” “should,” “could,” and similar expressions to identify forward-looking statements.\nOverview\nWe are a financial technology and social media hybrid platform offering real-time proprietary analytics and news for stock and options traders of all levels. Our web-based software employs “predictive technology” enhanced by artificial intelligence to find volatility and unusual market activity that may result in the rapid change in the trading price of a stock or option. Our Blackbox System continuously scans the NASDAQ, NYSE, CBOE, and other options markets, analyzing over 8,000 stocks and up to 1,000,000 options contracts multiple times per second. We also provide our users with a fully interactive social media platform that is integrated into our dashboard, enabling our users to exchange information and ideas quickly and efficiently through a common network. We recently introduced a live audio/video feature that allows our members to broadcast on their own channels to share trade strategies and market insight within the Blackbox community.\nWe launched our platform for domestic use and made it available to subscribers in September 2016. Subscriptions for the use of the platform are sold on a monthly and/or annual subscription basis to individual consumers through our website at http://www.blackboxstocks.com.\nOur principal office is located at 5430 LBJ Freeway, Suite 1485, Dallas, Texas 75240 and our telephone number is (972) 726-9203. Our Common Stock is quoted on the OTC Pink under the symbol “BLBX.” Our corporate website is located at http://www.blackboxstocks.com.\nBasis of Presentation of Financial Information\nThe accompanying financial statements have been prepared in conformity with generally accepted accounting principles in the United States of America (“GAAP”), which contemplate continuation of the Company as a going concern, which is dependent upon the Company's ability to obtain sufficient financing or establish itself as a profitable business. At December 31, 2020 and 2019, the Company had an accumulated deficit of $7,184,818 and $6,829,907, respectively, and for the years ended December 31, 2020 and 2019 the Company incurred net losses of $354,911 and $2,983,438, respectively. In November 2020, the Company executed a Loan Agreement with certain lenders (the “Lenders”) and FVP Servicing LLC, (“FVP”), as agent for the Lenders in connection with the issuance of a Note in the amount of $1,000,000 bearing interest at 12% per annum with an initial maturity of November 12, 2022. Simultaneously, with the execution of the Loan Agreement, the Company repaid an existing secured note payable in the amount of $100,000 along with accrued interest, and certain outstanding trade payables in the amount of $133,880. In addition, the Company granted the Lender a security interest in substantially all of its assets. As a result of this financing and the cash flows from operations, the Company had a cash balance of $972,825 at December 31, 2020. Management believes that this will be sufficient to fund its operations and service its debt for the next twelve months. In addition, management may continue to raise additional debt or equity capital in order to improve liquidity or finance more aggressive growth or development. There can be no assurance that the Company will be able to raise additional capital or on what terms.\nThe financial statements do not include adjustments relating to the recoverability and realization of assets and classification of liabilities that might be necessary should the Company be unable to continue in operation.\nRecently Issued Accounting Pronouncements\nDuring the year ended December 31, 2020 and through March 31, 2021, there were several new accounting pronouncements issued by the Financial Accounting Standards Board (“FASB”). Each of these pronouncements, as applicable, has been or will be adopted by the Company. Management does not believe the adoption of any of these accounting pronouncements has had or will have a material impact on the Company’s financial statements.\nAll other new accounting pronouncements issued but not yet effective or adopted have been deemed not to be relevant to us, hence are not expected to have any impact once adopted.\nSummary of Significant Accounting Policies\nUse of Estimates\nThe Company’s financial statement preparation requires that management make estimates and assumptions which affect the reporting of assets and liabilities and the related disclosure of contingent assets and liabilities in order to report these financial statements in conformity with GAAP. Actual results could differ from those estimates.\nCash\nCash includes all highly liquid investments that are readily convertible to known amounts of cash and have original maturities at the date of purchase of three months or less.\nFair Value of Financial Instruments\nThe Financial Accounting Standards Board’s (“FASB”) Accounting Standards Codification (“ASC”) Topic 820, Fair Value Measurement, defines fair value, establishes a framework for measuring fair value in accordance with U.S. generally accepted accounting principles, and requires certain disclosures about fair value measurements. In general, fair values of financial instruments are based upon quoted market prices, where available. If such quoted market prices are not available, fair value is based upon internally developed models that primarily use, as inputs, observable market-based parameters. Valuation adjustments may be made to ensure that financial instruments are recorded at fair value. These adjustments may include amounts to reflect counterparty credit quality and the customer’s creditworthiness, among other things, as well as unobservable parameters. Any such valuation adjustments are applied consistently over time.\nDerivative Financial Instruments\nFASB ASC Topic 820, Fair Value Measurement requires bifurcation of certain embedded derivative instruments, and measurement at their fair value for accounting purposes. A holder redemption feature embedded in the Company’s notes payable requires bifurcation from its host instrument and is accounted for as a freestanding derivative.\nRecently Issued Accounting Pronouncements.\nDuring the years ended December 31, 2020 and 2019, there were several new accounting pronouncements issued by the Financial Accounting Standards Board (“FASB”). Each of these pronouncements, as applicable, has been or will be adopted by the Company. Management does not believe the adoption of any of these accounting pronouncements has had or will have a material impact on the Company’s financial statements.\nProperty and Equipment\nThe Company’s property and equipment is being depreciated on the straight-line basis over an estimated useful life of three years.\nIncome Taxes\nThe Company will recognize deferred tax assets and liabilities based on differences between the financial reporting and tax basis of assets and liabilities using the enacted tax rates and laws that are expected to be in effect when the differences are expected to be recovered. The Company provides a valuation allowance for deferred tax assets for which it does not consider realization of such assets to be more likely than not.\nManagement evaluates the probability of the realization of its deferred income tax assets. Management determined that because the Company has not yet generated taxable income, it is unlikely that a tax benefit will be realized from these operating loss carry forwards. Accordingly, the deferred income tax asset is offset by a full valuation allowance.\nIn accordance with ASC Topic 740, Income Taxes, the Company recognizes the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be capable of withstanding examination by the taxing authorities based on the technical merits of the position. These standards prescribe a recognition threshold and measurement attribute for the financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return.\nEarnings or (Loss) Per Share\nBasic earnings per share (or loss per share), is computed by dividing the earnings (loss) for the period by the weighted average number of common stock shares outstanding for the period. Diluted earnings per share reflects the potential dilution of securities by including other potentially issuable shares of common stock, including shares issuable upon conversion of convertible securities or exercise of outstanding stock options and warrants, in the weighted average number of common shares outstanding for the period. Therefore, because including shares issuable upon conversion of convertible securities and/or exercise of outstanding options and warrants would have an anti-dilutive effect on the loss per share, only the basic earnings (loss) per share is reported in the accompanying financial statements for period of loss.\nShare-Based Payment\nUnder ASC Topic 718, Compensation - Stock Compensation, all share based payments to employees, including share option grants, are to be recognized in the statement of operations based on their fair values. No share based payments were issued for the years ended December 31, 2020 and 2019.\nRevenue Recognition\nRevenue is recognized from the sale of subscriptions for the use of the Blackbox System web application, on a monthly or annual basis. Revenue generally is recognized net of allowances for returns and any taxes collected from customers and subsequently remitted to governmental authorities. The performance obligation by the Company is in exchange for the monthly subscription fee, the subscriber is allowed access to the Blackbox System on the website for the calendar month. Revenue related to annual subscriptions is recognized each month with unearned subscriptions reflected as a current liability.\nOther Liabilities\nThe Company planned the development of a future product, a complimentary platform to share its IP protocol with the current Blackbox System on a subscription basis. The future product was not developed and launched. The Company received advance payments from a new subscriber group in anticipation of the development of this future product and the amounts were deferred and in the first quarter 2021 the subscribers agreed to terminate those agreements. As of December 31, 2020, the Company has received $180,000 from this future subscriber group.\nPrepaid Expenses\nPrepaid expenses are current assets created when the Company makes payments or incurs an obligation for expenses identified for a future period. These amounts are charged to expense as the services are provided.\nContingencies\nCertain conditions may exist as of the date the financial statements are issued, which may result in a loss to the Company but which will only be resolved when one or more future events occur or fail to occur. The Company’s management and legal counsel assess such contingent liabilities, and such assessment inherently involves judgment. In assessing loss contingencies related to legal proceedings that are pending against the Company or unasserted claims that may result in such proceedings, the Company’s legal counsel evaluates the perceived merits of any legal proceedings or unasserted claims as well as the perceived merits of the amount of relief sought or expected to be sought.\nIf the assessment of a contingency indicates it is probable that a material loss has been incurred and the amount of the liability can be estimated, then the estimated liability would be accrued in the Company’s financial statements. If the assessment indicates that a potential material loss contingency is not probable but is reasonably possible, or is probable but cannot be estimated, then the nature of the contingent liability, together with an estimate of the range of possible loss if determinable and material would be disclosed. Loss contingencies considered to be remote by management are generally not disclosed unless they involve guarantees, in which case the guarantee would be disclosed.\nReclassification\nAffiliate referral expenses totaling $121,227 for the year ended December 31, 2019 have been reclassed from cost of revenues to advertising and marketing expense on the statement of operations. Also data feed expenses in the aggregate of $79,691 have been reclassed from software development costs as of December 31, 2019 to cost of revenue.\nLiquidity and Capital Resources\nAt December 31, 2020, the Company had a cash balance of $972,825 and a working capital deficit of $990,738 as compared to a cash balance of $21,172 and a working capital deficit of $3,525,306 at December 31, 2019. In addition, the Company incurred a net loss of $354,911 for the year ended December 31, 2020. The Company generated cash flow from operations of $143,580 for the year ended December 31, 2020 as compared to cash used by operations of $710,992 in the prior year.\nThe Company believes that it has sufficient capital resources to fund its current operations and debt service requirements.\nLoan Agreement\nOn November 12, 2020, the Company executed a Loan Agreement with certain lenders (the “Lenders”) and FVP Servicing LLC, (“FVP”), as agent for the Lenders in connection with the issuance of a Note (the “FPV Note”) in the amount of $1,000,000 bearing interest at 12% per annum with an initial maturity of November 12, 2022. Simultaneously, with the execution of the Loan Agreement, the Company repaid an existing secured note payable in the amount of $100,000 along with accrued interest and certain outstanding trade payables in the amount of $133,880.\nSale of Common Stock and Warrants\nDuring the year ended December 31, 2020, the Company received subscriptions for the purchase of 346,533 shares of Common Stock at a cash price of $1.95 per share for aggregate cash consideration of $407,982 In connection with certain of the sales, warrants to purchase up to 35,259 shares of the Company’s Common Stock at a cash price of $1.95 per share were issued to certain of the subscribers.\nDuring the year ended December 31, 2020, the Company also issued an aggregate of 104,339 shares of Common Stock, for settlement of debt obligations and services rendered valued at $205,950.\nAdditional funding is expected to be generated as necessary through equity financing from the sale of our Common Stock and/or debt. If we are successful in completing equity financing, existing stockholders will experience dilution of their interest in our Company. We do not currently have any financing arranged and we cannot provide investors with any assurance that we will be able to raise sufficient funding from the sale of our Common Stock or debt to fund our plans of operation and ongoing operational expenses.\nResults of Operations\nComparison of Years Ended December 31, 2020 and 2019\nFor the years ending December 31, 2020 and 2019, the Company’s revenue totaled $3,367,563 and $1,062,573, respectively, for which its respective costs of revenues totaled $1,201,320 and $695,076. Revenues increased as a result of an expanded subscription base for monthly revenues. The Company’s revenue from subscriptions grew from $1,037,778 in the year ended December 31, 2019 to $3,340,983 in the year ended December 31, 2020, an increase of $2,303,205. Gross margin increased to $2,166,243 or 64.3% of revenues for the year ended December 31, 2020 as compared to gross margin of $367,497 or 34.6% of revenues for the prior year.\nFor the year ending December 31, 2020, the Company had operating expenses totaling $2,578,941 compared to $1,372,530 for the same period in 2019, an increase of $1,206,411. Operating expenses were 76.6% of revenues for the year ended December 31, 2020 as compared to 129.2% of revenues for the year ended December 31, 2019. Selling general and administrative expenses increased by $724, 361 but decreased as a percentage of sales from 98.0% to 52.4% for the year ended December 31, 2020. The increase was primarily due to higher consulting, salary and selling expenses. Advertising and marketing expenses increased by $444,236 to $705,706 for the year ended December 31, 2020 but declined as a percentage of sales to 21.0% as compared to 24.6% for the prior year. In addition, software development costs increased approximately $43,072.\nOperating loss for the year ended December 31, 2020 declined by $592,335 to $412,698 as compared to the year ended December 31, 2019 due to substantially higher revenues and gross margin being partially offset by higher operating expenses.\nOff Balance Sheet Arrangements\nWe do not have any off balance sheet arrangements.",
    "item_7A": "ITEM 7A.\nQUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nOur Company is a “smaller reporting company” as defined by Rule 12b-2 of the Exchange Act, and as such, is not required to provide the information required under this Item.",
    "item_8": "ITEM 8.\nFINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nAll financial statements required by this Item are presented beginning on Page, and are incorporated herein by this reference.",
    "item_9": "ITEM 9.\nCHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.",
    "item_9A": "ITEM 9A.\nCONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nGust Kepler, our principal executive officer and principal financial officer, conducted an evaluation of the effectiveness of the design and operation of the Company's disclosure controls and procedures (as such term is defined in Rules 13a-15(e) and 15d-15(e) promulgated under the Exchange Act) as of December 31, 2020, pursuant to Exchange Act Rule 13a-15. Such disclosure controls and procedures are designed to ensure that information required to be disclosed by the Company is accumulated and communicated to the appropriate management on a basis that permits timely decisions regarding disclosure. Based upon that evaluation, the Company's principal executive officer and principal financial officer concluded that the Company's disclosure controls and procedures as of December 31, 2020 were not effective to provide reasonable assurance that information required to be disclosed in the Company’s periodic filings under the Exchange Act is accumulated and communicated to our management to allow timely decisions regarding required disclosure.\nManagement's Annual Report on Internal Control Over Financial Reporting\nManagement of the Company is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. The Company's internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP. The Company's internal control over financial reporting includes those policies and procedures that:\n●\npertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company;\n●\nprovide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and\n●\nprovide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nIn connection with the preparation of our annual financial statements, Gust Kepler, our principal executive officer and principal financial officer, has assessed the effectiveness of internal control over financial reporting as of December 31, 2020, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission, or the COSO Framework, and SEC guidance on conducting such assessments. Management’s assessment included an evaluation of the design of our internal control over financial reporting and testing of the operational effectiveness of those controls. Based on this evaluation and qualified by the “Limitations on Effectiveness of Controls” set forth in this Item 9A below, management has determined that as of December 31, 2020, our internal controls over financial reporting were not effective and there are material weaknesses in our internal control over financial reporting.\nThe Company’s management has identified a material weakness in the effectiveness of internal control over financial reporting related to a shortage of resources in the accounting department required to assure appropriate segregation of duties with employees having appropriate accounting qualifications.\nAttestation Report of the Registered Public Accounting Firm\nThis Annual Report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Management's report was not subject to attestation by the Company’s registered public accounting firm pursuant to the Dodd-Frank Wall Street Reform and Consumer Protection Act, wherein non-accelerated filers are exempt from Sarbanes-Oxley internal control audit requirements.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal controls over financial reporting during the fourth quarter of the year ended December 31, 2020 that have materially affected or are reasonably likely to materially affect our internal controls over financial reporting.\nLimitations on the Effectiveness of Controls\nOur disclosure controls and procedures provide our principal executive officer and principal financial officer with reasonable assurances that our disclosure controls and procedures will achieve their objectives. However, our management does not expect that our disclosure controls and procedures or our internal control over financial reporting can or will prevent all human error. A control system, no matter how well designed and implemented, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Furthermore, the design of a control system must reflect the fact that there are internal resource constraints, and the benefit of controls must be weighed relative to their corresponding costs. Because of the limitations in all control systems, no evaluation of controls can provide complete assurance that all control issues and instances of error, if any, within our company are detected. These inherent limitations include the realities that judgments in decision-making can be faulty, and that breakdowns can occur due to human error or mistake. Additionally, controls, no matter how well designed, could be circumvented by the individual acts of specific persons within the organization. The design of any system of controls is also based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated objectives under all potential future conditions.\nManagement is aware that there is a lack of segregation of duties at the Company due to the fact that the Company only has one director and executive officer dealing with general administrative and financial matters. This constitutes a significant deficiency in the internal controls. Management has decided that considering the officer/director involved, the control procedures in place, and the outsourcing of certain financial functions, the risks associated with such lack of segregation were low and the potential benefits of adding additional employees to clearly segregate duties did not justify the expenses associated with such increases. Management periodically reevaluates this situation. In light of the Company’s current cash flow situation, the Company does not intend to increase staffing to mitigate the current lack of segregation of duties within the general administrative and financial functions.",
    "item_9B": "ITEM 9B. OTHER INFORMATION\nNone.\nPART III",
    "item_10": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\nDirectors and Executive Officers\nThe following individuals currently serve as the sole director and executive officers of our Company. All directors of our Company hold office until the next annual meeting of shareholders or until their successors have been elected and qualified. The executive officers of our Company are appointed by our Board of Directors and hold office until their death, resignation or removal from office.\nSole Director and Executive\nOfficers\nAge\nDate of\nAppointment\nPosition(s) Held\nGust Kepler\nDecember 1, 2015\nDirector, President, Chief Executive Officer, Chief Financial Officer and Secretary\nJeff Sharrock\nJanuary 1, 2016\nVice President of Operations\nGust Kepler was appointed to serve as a director and our President, Chief Executive Officer, Chief Financial Officer and Secretary on December 1, 2015. Mr. Kepler also serves as the President of G2 International, Inc. (“G2”). G2 is a consulting firm with expertise in investment banking founded by Mr. Kepler in 2002. G2’s primary focus is taking private companies public and providing advice regarding capitalization, strategic planning and investor relations. Prior to founding G2, Mr. Kepler founded Parallax Entertainment, Inc. (“Parallax”) in 1996. Parallax was an independent record label, online promotional vehicle and e-commerce solution for musicians on the Internet. Mr. Kepler managed all aspects of the label including A&R, production, marketing and distribution. In 2000, Mr. Kepler successfully completed a direct public offering for the company and Parallax subsequently became a publicly traded company on the OTC Bulletin Board. Mr. Kepler was also the cofounder of Glance Toys, Ltd. (“Glance Toys”) which was formed in 1990. Glance Toys designed, manufactured and marketed products classified in junior sporting goods category. Products included foam balls, flying discs and beach products, some of which received patents. Glance Toy’s products were sold nationally in prominent chains such as Wal-Mart, Target, Toys R Us, 7-Eleven, and numerous other well-known retailers.\nJeff Sharrock was appointed to serve as our Vice President of Operations on January 1, 2016. Mr. Sharrock oversees accounting, communications and IT solutions for the Company. He is also in charge of financial analysis, budgeting, compliance and corporate governance for Blackboxstocks.com. Prior to joining Blackboxstocks, Mr. Sharrock served as the Director of Operations for G2 International, Inc. G2 is an investment banking consulting firm specializing in taking private companies public and providing those companies with advice regarding capitalization, strategic planning and investor relations. Mr. Sharrock oversaw all aspects of daily operations and was heavily involved in the accounting and regulatory aspects of the company. He also served as the main point of contact for large G2 clients.\nInvolvement in Certain Legal Proceedings\nNeither our sole director nor any executive officer has not been convicted in a criminal proceeding, excluding traffic violations or similar misdemeanors, nor has he been a party to any judicial or administrative proceeding during the past ten years that resulted in a judgment, decree or final order enjoining the person from future violations of, or prohibiting activities subject to, federal or state securities laws, or a finding of any violation of federal or state securities laws, except for matters that were dismissed without sanction or settlement.\nCode of Ethics for Financial Executives\nThe Company has not yet adopted a Financial Code of Ethics applicable to our directors, officers and employees due to the fact that the Company only has one person (Gust Kepler) currently serving as a director and two persons (Gust Kepler and Jeff Sharrock) serving as executive officers. The Board of Directors plans to adopt a Code of Ethics as it deems appropriate, when and if it adds additional directors, officers and employees.\nBoard Committees and Financial Expert\nThe Company does not currently maintain separate audit, nominating or compensation committees. When necessary, the entire Board of Directors performs the tasks that would be required of those committees. Furthermore, we do not have a qualified financial expert serving on the Board of Directors at this time, because we have not been able to hire a qualified candidate and we have inadequate financial resources at this time to hire such an expert.",
    "item_11": "ITEM 11. EXECUTIVE COMPENSATION\nThe following table sets forth all compensation for the last two fiscal years awarded to, earned by or paid our chief executive officer and our only other compensated executive officer serving during the last completed fiscal year (collectively, the \"Named Executives\"):\nSummary Compensation Table\nName and Principal Position\nYear\nSalary\nAll other Compensation (1)($)\nTotal ($)\nGust Kepler, Director, President, Chief Executive Officer,\n$ 12,000\n$ 11,120 (2)\n$ 23,120\nChief Financial Officer and Secretary\n$ 12,000\n$ --\n$ 12,000\nJeff Sharrock, Vice President of Operations\n$ 73,000\n$ 6,352 (2)\n$ 79,352\n$ 73,008\n$ (2)\n$ 73,508\n(1)\nOther than the remuneration discussed above, we have no retirement, pension, profit sharing, stock option or similar program for the benefit of the officers, directors or employees of the Company.\n(2)\nReflects cash bonus payment.\nNarrative Disclosure to Summary Compensation Table\nWe paid salaries to both of Named Executives in 2020 and 2019. Mr. Kepler is paid an annual salary of $12,000 and Mr. Sharrock is paid an annual salary of $73,000. Mr. Kepler was paid a discretionary cash bonus of $11,120 in 2020. Mr. Sharrock was also paid discretionary bonuses of $6,352 in 2020 and $500 in 2019. All compensation was paid in cash pursuant to standard Company payroll practices. We do not have arrangements with any of our employees, including the Named Executives, to pay or provide any non-cash compensation.\nThe Company has not entered into any other employment agreement or consulting agreement with any officer or director of the Company providing for compensation and all serve at the discretion of our Board of Directors.\nOutstanding Equity Awards\nThe Company has no equity compensation plans.\nCompensation of Directors\nThe Company does not pay compensation to its directors for their service at this time. Furthermore, the Company has no present formal plan for compensating our directors for their service in their capacity as such.",
    "item_12": "ITEM 12.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth certain information as of the date hereof with respect to the holdings of: (1) each person known to us to be the beneficial owner of more than 5% of our Common Stock; (2) each of our directors, nominees for director and named executive officers; and (3) all directors and executive officers as a group. To the best of our knowledge, each of the persons named in the table below as beneficially owning the shares set forth therein has sole voting power and sole investment power with respect to such shares, unless otherwise indicated. Applicable percentages are based upon 8,579,877 shares of Common Stock and 5,000,000 shares of Preferred Stock outstanding as of March 17, 2021. Unless otherwise specified, the address of each of the persons set forth below is in care of the Company, at the address of 5430 LBJ Freeway, Suite 1485, Dallas, Texas 75240.\nTitle of Class\nName and Address of\nBeneficial Owner\nAmount and Nature of Beneficial Owner\nPercent of\nClass\nCommon Stock\nAs a Group\nOfficers and Directors (1 person)\n2,331,668\n%\nAs Individuals\nGust Kepler\n2,331,668\n%\nDavid Kyle\n833,334\n%\nEric Pharis\n2 Lake Forest Court\nTrophy Club, Texas 76262\n791,615\n%\nStephen Chiang\n8 Kitchener Link\nCity Square Residences #21-14\nSingapore 207226\n1,000,000\n%\nSeries A Preferred Stock\nAs a Group\nOfficers and Directors (1 person)\n5,000,000\n%\nAs Individuals\nGust Kepler\n5,000,000\n%\nThere are no arrangements, known to the Company, the operation of which would result in a change in control of the Company.",
    "item_13": "ITEM 13.\nCERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nTransactions with Related Persons\nAs of January 1, 2020, the Company was owed $9,823 from Gust C. Kepler, a Director, President, Chief Executive Officer, Chief Financial Officer and Secretary of the Company. During the year ended December 31, 2020 Mr. Kepler repaid $9,823.\nDuring the year ended December 31, 2019 the Company advanced $1,500 to its VP/Director of Operations and the balance remains outstanding, is unsecured and bears no interest.\nDuring the years ended December 31, 2020 and 2019, the Company engaged the services of EDM Operators (“EDM”), which is owned by Company stockholders Eric Pharis and David Kyle, for application development services of the Company’s Blackbox System technology. During the years ended December 31, 2020 and 2019, EDM was paid $40,200 and $13,500 for services, respectively.\nG2 International, Inc. (“G2”), which does business as IPA Tech Group (“IPA”), is a company wholly owned by Gust C. Kepler, a Director, President, Chief Executive Officer, Chief Financial Officer and Secretary of the Company, and the Company’s controlling stockholder. As of December 31, 2020, the Company has a prepaid balance of $36,700 for public relations and marketing services with G2/IPA. These funds are reserved in anticipation of a future campaign to move the Company’s stock to listing on a national exchange.\nDirector Independence\nOur Board of Directors is currently composed of one member who does not qualify as an independent director in accordance with the published listing requirements of the NASDAQ Global Market.",
    "item_14": "ITEM 14.\nPRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe Company does not currently maintain a separate audit committee. When necessary, the entire Board of Directors performs the tasks that would be required of an audit committee. Our Board of Director’s policy is to pre-approve all audit, audit related and permissible non-audit fees and services provided by our independent registered public accounting firm. Our Board of Directors pre-approved all of the fees described below. Our Board of Directors also reviews any factors that could impact the independence of our independent registered public accounting firm in conducting the audit and receives certain representations from our independent registered public accounting firm towards that end.\nOn December 18, 2015, the Company executed a letter agreement engaging Turner, Stone & Company, L.L.P. (“Turner Stone”) as our independent registered accounting firm and Turner Stone rendered professional services for the audit of our annual financial statements for the years ended December 31, 2020 and 2019 contained in this Report.\nAudit Fees\nThe aggregate fees billed by Turner Stone for professional services rendered for the audit of our annual financial statements for 2019 and 2020 and the reviews of the financial statements included in our Forms 10-Q and 8-K, or services normally provided by the accountant in connection with statutory and regulatory filings for those fiscal years were $37,095 and $41,500, respectively.\nAudit-Related Fees\nNo fees or expenses were billed by Turner Stone in fiscal years 2019 or 2020 for professional services rendered, other than the fees disclosed above under the caption “Audit Fees” for assurance and related services relating to performance of the audit or review of our financial statements.\nTax Fees\nThe aggregate fees billed by Turner Stone in fiscal years 2019 or 2020 for professional services rendered for tax compliance, tax advice or tax planning were $2,325 and $3,000, respectively\nAll Other Fees\nWe incurred no other fees or expenses for the 2019 or 2020 fiscal years for any other products or professional services rendered by Turner Stone other than as described above.\nPART IV",
    "item_15": "ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(a)\nFinancial Statements\nThe following documents are filed as part of this Annual Report on Form 10-K beginning on the pages referenced below:\nPage\nReport of Independent Registered Public Accounting Firm\nBalance Sheets as of December 31, 2020 and 2019\nStatements of Operations for the years ended December 31, 2020 and 2019\nStatements of Stockholders’ Deficit for years ended December 31, 2020 and 2019\nStatements of Cash Flows for the years ended December 31, 2020 and 2019\nNotes to Financial Statements\n-\n(b)\nExhibits\nThe following exhibits are filed with this Annual Report on Form 10-K or are incorporated by reference as described below.\nExhibit\nDescription\n2.1\nForm of Share Exchange Agreement dated December 1, 2015, by and among SMSA Ballinger Acquisition Corp., Tiger Trade Technologies, Inc. and the stockholders of Tiger Trade (incorporated by reference to Exhibit 2.1 of the Company’s Information Statement on Form 8-K filed with the Commission on December 7, 2015).\n3.1\nArticles of Incorporation of SMSA Ballinger Acquisition Corp. (incorporated by reference to Exhibit 3.4 of the Company's Registration Statement on Form 10-12G filed with the Commission on August 5, 2014).\n3.2\nCertificate of Designation of Series A Preferred Stock dated December 1, 2015 (incorporated by reference to Exhibit 3.1 of the Company’s Information Statement on Form 8-K filed with the Commission on December 7, 2015).\n3.3\nCertificate of Amendment to Articles of Incorporation dated effective March 9, 2016. (incorporated by reference to Exhibit 3.9 of the Company’s Annual Report on Form 10-K filed with the Commission on April 14, 2016).\n3.4\nCertificate of Amendment to Articles of Incorporation dated effective as of July 15, 2019 (incorporated by reference to Exhibit 3.1 of the Company’s Current Report on Form 8-K filed with the Commission on July 15, 2019)\n3.5\nBylaws of SMSA Ballinger Acquisition Corp. (incorporated by reference to Exhibit 3.5 of the Company's Registration Statement on Form 10-12G filed with the Commission on November 27, 2013).\n4.1\nDescription of Securities (incorporated by reference to Exhibit 4.1 of the Company’s Annual Report on Form 10-K filed with the Commission on April 16, 2020)\n4.2\nForm of 8% Fixed Convertible Promissory Note of Blackboxstocks, Inc. dated May 21, 2019 (incorporated by reference to Exhibit 4.1 of the Company’s Current Report on Form 8-K filed with the Commission on May 28, 2019)\n4.3\nForm of Warrant for the Purchase Of Common Stock (incorporated by reference to Exhibit 4.2 of the Company’s Current Report on Form 8-K filed with the Commission on May 28, 2019)\n4.4\nForm of 8% Fixed Convertible Promissory Note of Blackboxstocks, Inc. dated July 17, 2019 (incorporated by reference to Exhibit 4.1 of the Company’s Current Report on Form 8-K filed with the Commission on July 30, 2019)\n4.5\nForm of First Amendment to 8% Fixed Convertible Promissory Note of Blackboxstocks, Inc. (incorporated by reference to Exhibit 4.2 of the Company’s Current Report on Form 8-K filed with the Commission on July 30, 2019)\n10.1\nSecond Amendment to Office Lease dated September 19, 2017 between Teachers Insurance and Annuity Association of America and Blackboxstocks, Inc. (incorporated by reference to Exhibit 10.14 of the Company’s Annual Report on Form 10-K filed with the Commission on April 17, 2018).\n10.2\nLoan Agreement dated November 12, 2020 between FPV Servicing LLC and Blackboxstocks, Inc. (incorporated by reference to Exhibit 10.1 of the Company’s Quarterly Report on Form 10-Q filed with the Commission on November 16, 2020)\n10.3\nSecurities Purchase Agreement dated April 10, 2019 (incorporated by reference to Exhibit 10.1 of the Company’s Current Report on Form 8-K filed with the Commission on May 28, 2019)\n10.4\nSecurities Purchase Agreement dated May 3, 2019 (incorporated by reference to Exhibit 10.2 of the Company’s Current Report on Form 8-K filed with the Commission on May 28, 2019)\n10.5\nSecurities Purchase Agreement dated May 22, 2019 (incorporated by reference to Exhibit 10.3 of the Company’s Current Report on Form 8-K filed with the Commission on May 28, 2019)\n10.6\nNote dated November 12, 2020 payable to Feenix Venture Partners Opportunity Fund II LP (incorporated by reference to Exhibit 10.2 of the Company’s Quarterly Report on Form 10-Q filed with the Commission on November 16, 2020)\n10.7\nSecurity Agreement dated November 12, 2020 between FPV Servicing LLC and Blackboxstocks, Inc. (incorporated by reference to Exhibit 10.3 of the Company’s Quarterly Report on Form 10-Q filed with the Commission on November 16, 2020)\n31.1\nCertification of Principal Executive Officer pursuant to Rule 13a-14a/Rule 14d-14(a)*\n31.2\nCertification of Principal Financial Officer pursuant to Rule 13a-14a/Rule 14d-14(a)*\n32.1\nCertification of Principal Executive Officer pursuant to 18 U.S.C. Section 1350.*\n32.2\nCertification of Principal Financial Officer pursuant to 18 U.S.C. Section 1350.*\n101.1\nInteractive data files pursuant to Rule 405 of Regulation S-T*\n* Filed herewith.\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDate: March 31, 2021\nBLACKBOXSTOCKS INC.\nBy:\n/s/ Gust Kepler\nGust Kepler\nPresident, Chief Executive Officer and Secretary (Principal Executive Officer and Principal Financial and Accounting Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSIGNATURE\nTITLE\nDATE\n/s/ Gust Kepler\nGust Kepler\nPresident, Chief Executive Officer, Secretary and Director (Principal Executive Officer and Principal Financial and Accounting Officer)\nMarch 31, 2021\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders’ and Sole Director of Blackboxstocks Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Blackboxstocks Inc. (the “Company”) as of December 31, 2020 and 2019 and the related statements of operations, stockholders’ deficit and cash flows for the years then ended, and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2020 and 2019, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (“PCAOB”) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures include examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\n/s/ Turner, Stone & Company, L.L.P.\nDallas, Texas\nMarch 31, 2021\nWe have served as the Company’s auditor since 2015.\nBlackboxstocks Inc.\nBalance Sheets\nDecember 31, 2020 and 2019\nDecember 31,\nAssets\nCurrent assets:\nCash\n$ 972,825\n$ 21,172\nAccounts receivable, net of allowance for doubtful accounts of $68,589 at December 31, 2020 and 2019, respectively\n17,990\n5,745\nInventory\n17,661\n-\nTotal current assets\n1,008,476\n26,917\nProperty and equipment:\nOffice, computer and related equipment, net of depreciation of $46,679 and $39,526 at December 31, 2020 and 2019, respectively\n3,772\n9,626\nDomain name, net of amortization of $15,282 and $9,551 at December 31, 2020 and 2019, respectively\n1,910\n7,641\nRight of use lease, net of amortization of $97,725 and $51,009 at December 31, 2020 and 2019, respectively\n62,348\n109,064\nTotal property and equipment\n68,030\n126,331\nLong term assets:\nAdvances receivable, related parties (Note 5)\n-\n9,823\nPrepaid expenses\n44,643\n80,868\nPrepaid expenses, related party (Note 5)\n36,700\n36,700\nTotal long term assets\n81,343\n127,391\nTotal Assets\n$ 1,157,849\n$ 280,639\nLiabilities and Stockholders' Deficit\nCurrent liabilities:\nAccounts payable\n$ 352,545\n$ 632,287\nAccrued interest\n10,425\n42,566\nAccrued interest, related party\n-\n16,680\nUnearned subscriptions\n1,016,157\n189,007\nLease liability right of use, current\n40,473\n46,124\nOther liabilities\n180,000\n180,000\nSenior secured note payable, current\n10,000\n-\nConvertible notes payable, net of discount of $194,267 and $13,859 at December 31, 2020 and 2019, respectively (Note 6)\n257,150\n593,891\nNotes payable, net of note discount of $0 and $38,294 at December 31, 2020 and 2019, respectively (Note 6)\n131,605\n218,138\nNotes payable, related party (Note 6)\n228,000\nDerivative liability\n-\n1,405,530\nTotal current liabilities\n1,999,214\n3,552,223\nLong term liabilities:\nSenior secured note payable, long term, net of debt issuance costs of $99,852 at December 31, 2020\n890,148\n-\nLease liability right of use, long term\n26,241\n66,715\nTotal long term liabilities\n916,389\n66,715\nCommitments and contingencies (Note 8)\nStockholders' Deficit:\nPreferred stock, $0.001 par value, 5,000,000 shares authorized; no shares issued and outstanding at December 31, 2020 and 2019, respectively\n-\n-\nSeries A Convertible Preferred Stock, $0.001 par value, 5,000,000 shares authorized; 5,000,000 issued and outstanding at December 31, 2020 and 2019, respectively\n5,000\n5,000\nCommon stock, $0.001 par value, 100,000,000 shares authorized: 8,410,386 and 7,908,231 issued and outstanding at December 31, 2020 and 2019, respectively\n8,410\n7,908\nCommon stock, subscribed\n12,500\n35,060\nAdditional paid in capital\n5,401,154\n3,443,640\nAccumulated deficit\n(7,184,818 )\n(6,829,907 )\nTotal Stockholders' Deficit\n(1,757,754 )\n(3,338,299 )\nTotal Liabilities and Stockholders' Deficit\n$ 1,157,849\n$ 280,639\nThe accompanying footnotes are an integral part of these financial statements.\nBlackboxstocks Inc.\nStatements of Operations\nFor the years ended December 31, 2020 and 2019\nDecember 31,\nRevenue:\nSubscriptions\n$ 3,340,983\n$ 1,037,778\nOther revenues\n23,850\n24,795\nMerchandise sales\n2,730\n-\nTotal revenues\n3,367,563\n1,062,573\nCost of revenues\n1,201,320\n695,076\nGross margin\n2,166,243\n367,497\nOperating expenses:\nSoftware development costs\n94,221\n51,149\nSelling, general and administrative\n1,766,130\n1,041,769\nAdvertising and marketing\n705,706\n261,470\nDepreciation and amortization\n12,884\n18,142\nTotal operating expenses\n2,578,941\n1,372,530\nOperating loss\n(412,698 )\n(1,005,033 )\nInterest expense\n174,083\n65,090\nConvertible note financing\n500,469\n1,240,347\nLoss (gain) on derivative liability\n(1,155,718 )\n83,766\nDefault expense\n24,750\n57,750\nAmortization of debt discount\n398,629\n531,452\nLoss before income taxes\n(354,911 )\n(2,983,438 )\nIncome taxes\n-\n-\nNet loss\n$ (354,911 )\n$ (2,983,438 )\nWeighted average number of common shares outstanding - basic\n8,074,164\n7,749,695\nNet loss per share - basic\n$ (0.04 )\n$ (0.38 )\nThe accompanying footnotes are an integral part of these financial statements.\nBlackboxstocks Inc.\nStatement of Stockholders' Deficit\nFor the years ended December 31, 2020 and 2019\nSeries A Preferred Stock\nPreferred Stock\nCommon Stock\nCommon\nStock\nAdditional\nPaid-in\nAccumulated\nShares\nAmount\nShares\nAmount\nShares\nAmount\nSubscribed\nCapital\nDeficit\nTotal\nBalance at December 31, 2018\n5,000,000\n$ 5,000\n-\n$ -\n7,678,047\n$ 7,678\n$ 144,060\n$ 2,543,264\n$ (3,846,469 )\n$ (1,146,467 )\nIssuance of shares for cash\n-\n-\n-\n-\n216,354\n(109,000 )\n430,081\n-\n321,297\nIssuance of shares in settlement of accrued expenses\n-\n-\n-\n-\n13,830\n-\n127,986\n-\n128,000\nImputed discount on convertible notes payable (Note 6)\n-\n-\n-\n-\n-\n-\n-\n342,309\n-\n342,309\nNet loss\n-\n-\n-\n-\n-\n-\n-\n-\n(2,983,438 )\n(2,983,438 )\nBalance at December 31, 2019\n5,000,000\n$ 5,000\n-\n-\n7,908,231\n$ 7,908\n$ 35,060\n$ 3,443,640\n$ (6,829,907 )\n$ (3,338,299 )\nIssuance of shares for cash, net of fees\n-\n-\n-\n-\n346,533\n-\n430,195\n-\n430,542\nSubscription of shares cancelled\n-\n-\n-\n-\n-\n-\n(22,560 )\n-\n-\n(22,560 )\nIssuance of shares pursuant to convertible note payables\n-\n-\n-\n-\n51,283\n-\n145,472\n-\n145,523\nIssuance of shares in settlement of expenses\n-\n-\n-\n-\n56,339\n-\n112,294\n-\n112,350\nIssuance of shares in exchange for services\n-\n-\n-\n-\n48,000\n-\n93,552\n-\n93,600\nConvertible note forbearance extinguishment of derivative liability\n-\n-\n-\n-\n-\n-\n-\n522,065\n-\n522,065\nWarrants issued for amendment of convertible notes payable\n-\n-\n-\n-\n-\n-\n-\n653,936\n-\n653,936\nNet loss\n-\n-\n-\n-\n-\n-\n-\n-\n(354,911 )\n(354,911 )\nBalance at December 31, 2020\n5,000,000\n$ 5,000\n-\n-\n8,410,386\n$ 8,410\n$ 12,500\n$ 5,401,154\n$ (7,184,818 )\n$ (1,757,754 )\nThe accompanying footnotes are an integral part of these financial statements.\nBlackboxstocks Inc.\nStatements of Cash Flows\nFor the years ended December 31, 2020 and 2019\nDecember 31,\nCash flows from operating activities\nNet loss\n$ (354,911 )\n$ (2,983,438 )\nAdjustments to reconcile net loss to net cash provided by (used in) operating activities:\nDepreciation and amortization expense\n12,884\n18,142\nAmortization of note discount\n398,629\n531,452\nShares issued in settlement of financing costs\n105,850\n-\nShares issued in settlement of services\n100,100\n-\nExpenses paid by lender\n6,030\n27,385\nConvertible note financing\n500,469\n1,240,347\nChange in fair value of derivative liability\n(1,155,718 )\n83,766\nConvertible note default expense\n24,750\n57,750\nFinancing cost\n-\n26,396\nRight of use lease expense\n-\nChanges in operating assets and liabilities:\nAccounts receivable\n(12,245 )\n(2,026 )\nInventory\n(17,661 )\n-\nPrepaid expenses\n36,225\n26,778\nAccounts payable\n(279,742 )\n107,151\nAccrued interest\n(32,141 )\n41,732\nAccrued interest, related party\n(16,680 )\n14,600\nUnearned subscriptions\n827,150\n98,973\nNet cash provided by (used in) operating activities\n143,580\n(710,992 )\nCash flows from investing activities\nCash repayments from related parties\n9,823\n-\nPurchases of property and equipment\n(1,299 )\n(1,587 )\nNet cash provided by (used in) investing activities\n8,524\n(1,587 )\nCash flows from financing activities\nCommon stock issued for cash\n430,542\n321,297\nCommon stock subscribed\n(22,560 )\n-\nProceeds from issuance of notes payable\n1,127,100\n251,455\nDebt issuance costs\n(99,852 )\n-\nProceeds from issuance of convertible notes payable\n100,000\n473,725\nProceeds from Payroll Protection Program Loan\n130,200\n-\nPrincipal payments on notes payable\n(457,657 )\n(294,522 )\nPrincipal payments on convertible notes payable\n(181,083 )\n-\nPrincipal payments on notes payable, related parties\n(227,141 )\n-\nCash advances from related parties\n-\n109,342\nCash repayments to related parties\n-\n(155,547 )\nNet cash provided by financing activities\n799,549\n705,750\nNet increase (decrease) in cash\n951,653\n(6,829 )\nCash - beginning of year\n21,172\n28,001\nCash - end of year\n$ 972,825\n$ 21,172\nSupplemental disclosures\nInterest paid\n$ 186,516\n$ 2,000\nIncome taxes paid\n$ -\n$ -\nNon-cash investing and financing activities:\nRepayment of note in exchange for note payable\n$ (39,370 )\n$ -\nCommon stock issued in settlement of accrued expenses\n$ -\n$ 128,000\nCommon stock issued in settlement of convertible notes payable\n$ 100,000\n$ -\nLease, right of use and liability\n$ -\n$ 160,073\nDiscount on notes payable\n$ 69,500\n$ -\nDiscount on convertible notes payable\n$ -\n$ 342,309\nDebt discount on convertible notes payable\n$ -\n$ 131,417\nFinancing costs on funding agreements\n$ -\n$ 84,445\nRepayment of note payable, related party in exchange for advances\n$ 2,933\n$ -\nIssuance of warrants for forbearance agreements\n$ 371,243\n$ -\nThe accompanying footnotes are an integral part of these financial statements.\nBLACKBOXSTOCKS INC.\nNOTES TO FINANCIAL STATEMENTS\nFor the Years Ended December 31, 2020 and 2019\n1. ORGANIZATION\nBlackboxstocks Inc. (the “Company”) was incorporated on October 4, 2011 under the laws of the State of Nevada under the name SMSA Ballinger Acquisition Corp. to effect the reincorporation of Senior Management Services of Heritage Oaks at Ballinger, Inc., a Texas corporation, mandated by a Plan of Reorganization confirmed by the United States Bankruptcy Court for the Northern District of Texas for reorganization under Chapter 11 of the United States Bankruptcy Code.\nThe Company changed its name to Blackboxstocks, Inc. and began operating as a financial technology and social media platform in March 2016. The platform offers real-time proprietary analytics and news for stock and options traders of all levels. The Company believes its web-based software employs “predictive technology” enhanced by artificial intelligence to find volatility and unusual market activity that may result in the rapid change in the price of a stock or option. The software continuously scans the NASDAQ, New York Stock Exchange, CBOE, and other options markets, analyzing over 8,000 stocks and up to 1,000,000 options contracts multiple times per second. The Company also provides users with a fully interactive social media platform that is integrated into our dashboard, enabling users to exchange information and ideas quickly and efficiently through a common network. Recently, the Company also introduced a live audio/video feature that allows members to broadcast on their own channels to share trade strategies and market insight within the community. The platform was initially made available to subscribers in September 2016. Subscriptions for the use of the platform are sold on a monthly and/or annual subscription basis to individual consumers through the Company website at http://www.blackboxstocks.com.\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation. The accompanying financial statements have been prepared in conformity with generally accepted accounting principles in the United States of America (“GAAP”).\nThe accompanying financial statements have been prepared in assumption of the continuation of the Company as a going concern, which is dependent upon the Company's ability to obtain sufficient financing or establish itself as a profitable business. At December 31, 2020 and 2019, the Company had an accumulated deficit of $7,184,818 and $6,829,907, respectively, and for the years ended December 31, 2020 and 2019 the Company incurred net losses of $354,911and $2,983,438, respectively. These conditions raise substantial doubt about the Company’s ability to continue as a going concern. As discussed in Note 6, the Company executed a Loan Agreement with certain lenders (the “Lenders”) and FVP Servicing LLC, (“FVP”), as agent for the Lenders in connection with the issuance of a Note in the amount of $1,000,000 bearing interest at 12% per annum with an initial maturity of November 12, 2022. Simultaneously, with the execution of the Loan Agreement, the Company repaid an existing secured note payable in the amount of $100,000 along with accrued interest, and certain outstanding trade payables in the amount of $133,880. In addition, the Company granted the Lender a security interest in substantially all of its assets. As a result of this financing and the cash flows from operations, the Company had a cash balance of $972,825 at December 31, 2020. Management believes that this will be sufficient to fund its operations and service its debt for the next twelve months. In addition, management may continue to raise additional debt or equity capital in order to improve liquidity or finance more aggressive growth or development. There can be no assurance that the Company will be able to raise additional capital or on what terms.\nThe financial statements do not include adjustments relating to the recoverability and realization of assets and classification of liabilities that might be necessary should the Company be unable to continue in operation.\nUse of Estimates. The Company’s financial statement preparation requires that management make estimates and assumptions which affect the reporting of assets and liabilities and the related disclosure of contingent assets and liabilities in order to report these financial statements in conformity with GAAP. Actual results could differ from those estimates.\nCash. Cash includes all highly liquid investments that are readily convertible to known amounts of cash and have original maturities at the date of purchase of three months or less.\nFair Value of Financial Instruments. The Financial Accounting Standards Board’s (“FASB”) Accounting Standards Codification (“ASC”) Topic 820, Fair Value Measurement, defines fair value, establishes a framework for measuring fair value in accordance with GAAP, and requires certain disclosures about fair value measurements. In general, fair values of financial instruments are based upon quoted market prices, where available. If such quoted market prices are not available, fair value is based upon internally developed models that primarily use, as inputs, observable market-based parameters. Valuation adjustments may be made to ensure that financial instruments are recorded at fair value. These adjustments may include amounts to reflect counterparty credit quality and the customer’s creditworthiness, among other things, as well as unobservable parameters. Any such valuation adjustments are applied consistently over time.\nDerivative Financial Instruments. FASB ASC Topic 820, Fair Value Measurement requires bifurcation of certain embedded derivative instruments, and measurement at their fair value for accounting purposes. A holder redemption feature embedded in the Company’s notes payable requires bifurcation from its host instrument and is accounted for as a freestanding derivative.\nRecently Issued Accounting Pronouncements. During the years ended December 31, 2020 and 2019 there were several new accounting pronouncements issued by the FASB. Each of the other pronouncements, as applicable, has been or will be adopted by the Company. Management does not believe the adoption of any of these accounting pronouncements has had or will have a material impact on the Company’s financial statements.\nProperty and Equipment. The Company’s property and equipment is being depreciated on the straight-line basis over an estimated useful life of three years.\nIncome Taxes. The Company will recognize deferred tax assets and liabilities based on differences between the financial reporting and tax basis of assets and liabilities using the enacted tax rates and laws that are expected to be in effect when the differences are expected to be recovered. The Company provides a valuation allowance for deferred tax assets for which it does not consider realization of such assets to be more likely than not.\nManagement evaluates the probability of the realization of its deferred income tax assets. Management determined that because the Company has not yet generated taxable income, it is unlikely that a tax benefit will be realized from these operating loss carry forwards. Accordingly, the deferred income tax asset is offset by a full valuation allowance.\nIn accordance with ASC Topic 740, Income Taxes, the Company recognizes the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be capable of withstanding examination by the taxing authorities based on the technical merits of the position. These standards prescribe a recognition threshold and measurement attribute for the financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return.\nEarnings or (Loss) Per Share. Basic earnings per share (or loss per share), is computed by dividing the earnings (loss) for the period by the weighted average number of common stock shares outstanding for the period. Diluted earnings per share reflects the potential dilution of securities by including other potentially issuable shares of common stock, including shares issuable upon conversion of convertible securities or exercise of outstanding stock options and warrants, in the weighted average number of common shares outstanding for the period. Therefore, because including shares issuable upon conversion of convertible securities and/or exercise of outstanding options and warrants would have an anti-dilutive effect on the loss per share, only the basic earnings (loss) per share is reported in the accompanying financial statements for period of loss.\nShare-Based Payment. Under ASC Topic 718, Compensation - Stock Compensation, all share based payments to employees, including share option grants, are to be recognized in the statement of operations based on their fair values. No share-based payments were issued for the years ended December 31, 2020 and 2019.\nRevenue Recognition. Revenue is recognized from the sale of subscriptions for the use of the Blackbox System web application, on a monthly or annual basis. Revenue generally is recognized net of allowances for returns and any taxes collected from customers and subsequently remitted to governmental authorities. The performance obligation by the Company is in exchange for the monthly subscription fee, the subscriber is allowed access to the Blackbox System on the website for the calendar month. Revenue related to annual subscriptions is recognized each month with unearned subscriptions reflected as a current liability.\nOther Liabilities. The Company planned the development of a future product, a complimentary platform to share its IP protocol with the current Blackbox System on a subscription basis. The future product was not developed and launched. The Company received advance payments from a new subscriber group in anticipation of the development of this future product and the amounts were deferred and in the first quarter 2021 the subscribers agreed to terminate those agreements. As of December 31, 2020, the Company has received $180,000 from this future subscriber group.\nSoftware Development Costs. Blackboxstocks is engaged in the development of its proprietary Blackbox System technology, a proprietary algorithm driven system, through a combination of in-house system analysts and outside contractors. Under the guidelines of ASC Topic 985, Software, the cost of the Company’s Blackbox System was expensed during development and the Blackbox System software for use in the United States, reached technical feasibility in August 2016, became marketable and was made available to subscribers beginning September 1, 2016. Subsequent to that time, in accordance with ASC Topic 985 these costs are expensed.\nPrepaid Expenses. Prepaid expenses are current assets created when the Company makes payments or incurs an obligation for expenses identified for a future period. These amounts are charged to expense as the services are provided.\nContingencies. Certain conditions may exist as of the date the financial statements are issued, which may result in a loss to the Company but which will only be resolved when one or more future events occur or fail to occur. The Company’s management and legal counsel assess such contingent liabilities, and such assessment inherently involves judgment. In assessing loss contingencies related to legal proceedings that are pending against the Company or unasserted claims that may result in such proceedings, the Company’s legal counsel evaluates the perceived merits of any legal proceedings or unasserted claims as well as the perceived merits of the amount of relief sought or expected to be sought.\nIf the assessment of a contingency indicates it is probable that a material loss has been incurred and the amount of the liability can be estimated, then the estimated liability would be accrued in the Company’s financial statements.\nIf the assessment indicates that a potential material loss contingency is not probable but is reasonably possible, or is probable but cannot be estimated, then the nature of the contingent liability, together with an estimate of the range of possible loss if determinable and material would be disclosed. Loss contingencies considered to be remote by management are generally not disclosed unless they involve guarantees, in which case the guarantee would be disclosed.\nReclassification. Affiliate referral expenses totaling $121,227 for the year ended December 31, 2019 have been reclassed from cost of revenues to advertising and marketing expense on the statement of operations. Also data feed expenses in the aggregate of $79,691 have been reclassed from software development costs as of December 31, 2019 to cost of revenue.\n3. STOCKHOLDERS’ DEFICIT\nThe Company has authorized 10,000,000 shares of preferred stock at $0.001 par value, 5,000,000 of which are designated as “Series A Convertible Preferred Stock” at $0.001 par value and 100,000,000 authorized shares of common stock at $0.001 par value (“Common Stock”).\nShares of Series A Convertible Preferred Stock do not accumulate dividends, have no liquidation preferences and are convertible into shares of Common Stock on a one-for-one basis. Additionally, each share entitles the holder to 100 votes and, with respect to dividend and liquidation rights, the shares rank pari passu with the Company’s Common Stock. All shares are held by Gust C. Kepler, Director, Chief Executive Officer, President and Chief Financial Officer (“Mr. Kepler”).\nOn January 28, 2020 the Company issued 50,000 shares of its Common Stock at a value of $2.00 to a third party in conjunction with the financing arrangement executed on January 27, 2020 (Note 6).\nOn July 6, 2020, warrants to purchase 115,385 shares of Common Stock, issued in conjunction with Amended Convertible Promissory Notes, as described in Note 6, were exercised at $0.01 per share for aggregate cash consideration of $1,154.\nOn August 28, 2020 the Company issued 3,334 shares of its Common Stock at a value of $1.95 per share to a third party in settlement of services provided for marketing and advertising.\nDuring the year ended December 31, 2020 the Company issued 48,000 shares of its Common Stock at a value of $1.95 per share to a third party in conjunction with a consulting services agreement (Note 8).\nDuring the year ended December 31, 2020 the Company sold 70,514 shares of Common Stock and Warrants, exercisable for a period of 5 years, to purchase 35,259 shares of Common Stock at an exercise price of $1.95 per share, to third parties for aggregate consideration of $137,501.\nDuring the year ended December 31, 2020 the Company sold 160,634 shares of Common Stock to third parties for $313,236 less equity placement fees of $21,349.\nDuring the year ended December 31, 2020 holders of convertible promissory notes with an aggregate face value of $100,000 and a related derivative liability of $45,523, elected to convert the notes into 51,283 shares of the Company’s Common Stock.\nOn October 7, 2020 the Company repaid $35,060 to a third party to cancel a previous unexecuted subscription for 35,200 shares of Common Stock dated May 24, 2018, which shares were not issued.\n4. WARRANTS TO PURCHASE COMMON STOCK\nCosts attributable to the issuance of stock options and share purchase warrants are measured at fair value at the date of issuance and offset with a corresponding increase in ‘Additional Paid in Capital’ at the time of issuance. The fair value cost is computed utilizing the Black-Scholes model and assuming volatility based on U.S. Treasury yield rates for a similar period. The cost of these warrants was not recognized in the financial statements because they were granted in connection with raising capital for the Company. When the options or warrants are exercised, the receipt of consideration will be reported as an increase in stockholders’ equity.\nConcurrently with the execution of certain securities purchase agreements, the Company issued warrants to purchase Common Stock. Each warrant is exercisable for a period of five years from the date of the securities purchase agreement at an exercise price of $1.95 per share (Note 3). The fair value cost at the date of issuance of these warrants was $639,194.\nIn conjunction with the issuance of convertible notes payable as described in Note 6, a warrant for the purchase of up to 115,385 shares of common Stock exercisable for a one-year period was issued at an exercise price of $0.01 per share and another warrant for the purchase of up to 360,000 shares of Common Stock exercisable for a five-year period was issued at an exercise price of $1.00 per share. During the year ended December 31, 2020, the warrants for the purchase of 115,385 shares of Common Stock were exercised at $0.01 and as of December 31, 2020, there are warrants for the purchase of up to 476,348 shares of Common Stock outstanding.\nNumber of\nShares\nExercise Price\nWeighted\nAverage\nRemaining Life\n(in years)\nWarrants as of December 31, 2018\n-\n-\nIssued during 2019\n84,295\n$1.95\nWarrants as of December 31, 2019\n84,295\n$0.01 - 1.95\n4.53\nIssued during 2020\n510,644\n$1.95\nExercised during 2020\n(115,385\n)\n$0.01\nWarrants as of December 31, 2020\n479,554\n$0.97\n9.05\n5. RELATED PARTY TRANSACTIONS\nAs of January 1, 2020, the Company was owed $9,823 from Gust C. Kepler. During the year ended December 31, 2020 Mr. Kepler repaid the advance.\nDuring the year ended December 31, 2019 the Company advanced $1,500 to its VP/Director of Operations and the balance remains outstanding, is unsecured and bears no interest.\nDuring the years ended December 31, 2020 and 2019, the Company engaged the services of EDM Operators, (“EDM”), whose two stockholders are Company stockholders. During the years ended December 31, 2020 and 2019, EDM was paid $40,200 and $13,500 for services, respectively.\nG2 International, Inc. (“G2”), which does business as IPA Tech Group (“IPA”), is a company wholly owned by Gust C. Kepler, a Director, President, Chief Executive Officer, Chief Financial Officer and Secretary of the Company, and the Company’s controlling stockholder. As of December 31, 2020 and 2019, the Company had a prepaid balance of $36,700 for public relations and marketing services with G2/IPA. These funds are reserved in anticipation of a future campaign to move the Company’s stock to listing on a national exchange.\n6. DEBT\nA summary of the Company’s debt at December 31, 2020 and December 31, 2019, by counterparty, is as follows:\nBalance\nLoan Description\n12/31/2020\n12/31/2019\n$1,000,000 12% Senior secured note due November 12 2022\n$ 1,000,000\n$ -\n$200,000 Senior secured note bearing interest at 12% per annum due November 18, 2018 guaranteed by Mr. Kepler\n-\n100,000\n$170,000 Quasi-factoring financing with daily payments of $292-1035 maturing June -August 18, 2020\n-\n152,013\n$130,200 loan bearing interest at 1% per annum maturing May 1, 2022 issued under the Payroll Protection Program\n130,200\n-\n$120,000 Related party note payable bearing interest at 12% per annum due May 1, 2024\n-\n120,000\n$108,000 Related party note payable due November 30, 2020\n108,000\n$385,000 8% convertible note payable due July 2021\n318,012\n442,750\n$165,000 8% convertible note payable due July 2021\n133,405\n165,000\nMiscellaneous equipment loans\n1,405\n4,419\n1,583,881\n1,092,182\nLess unamortized discount and debt issuance costs\n(294,119 )\n(52,153 )\nTotal notes payable\n$ 1,289,762\n$ 1,040,029\nCurrent portion of long-term debt\n399,614\n1,040,029\nLong-term portion\n$ 890,148\n$\nNotes Payable\nOn August 8, 2018 a third party advanced $200,000 to the Company in exchange for a secured promissory note, bearing interest at the rate of 12% per annum with a maturity date of November 20, 2018. The note is secured by a Security Agreement providing for a continuing lien and first priority security interest in the assets of the Company and by a personal Guaranty Agreement with Gust Kepler, a Director, President, Chief Executive Officer, Chief Financial Officer and Secretary of the Company, and the Company’s controlling stockholder. On December 6, 2018, Mr. Kepler made a payment on the note in the amount of $100,000 plus accrued interest of $8,000 for an aggregate of $108,000. This note was repaid on November 12, 2020.\nOn September 13, 2019 a third party advanced $90,000 to the Company in exchange for quasi-factoring financing arrangements to be repaid in daily installments of $490, through August 18, 2020. The related note discount of $27,000 was amortized as interest expense over the term of the agreement.\nIn October 2019 third parties advanced $80,000 to the Company in exchange for quasi-factoring financing arrangements to be repaid in daily installments of $761 through June 2020. Approximately $39,000 of this funding was settled with proceeds of the January 27, 2020 financing described in a later paragraph. The related note discount of $31,600 was amortized as interest expense over the term of the agreement.\nDuring the year ended December 31, 2020 the Company entered into quasi-factoring financing arrangements in the amounts of $35,000 and $207,000 that were repaid in daily installments. The related discounts of $12,500 and $57,000 were amortized as interest expense over the term of the agreements and were fully repaid during the year ended December 31, 2020.\nOn May 1, 2020, pursuant to the Paycheck Protection Program under the Coronavirus Aid Relief and Economic Security Act (“CARES Act”) the Company was awarded a loan of $130,200. The loan carries an interest rate of 1% and matures on May 1, 2022. The Company may apply for loan forgiveness following SBA guidelines and a portion or all of the loan may be forgiven.\nOn November 12, 2020, the Company executed a Loan Agreement with certain Lenders (“the Lenders”) and FVP Servicing LLC, as agent for the Lenders in connection with the issuance of a Note in the amount of $1,000,000 bearing interest at 12% per annum with an initial maturity of November 12, 2022. Simultaneously, with the execution of the Loan Agreement, the Company also entered into an agreement with an affiliate of FVP to provide certain credit and debit card processing services for the Company, which services will continue for a period of one year after the loan is repaid and contains a right of first refusal to continue to provide such services in the future subject to certain limitations. Mr. Kepler executed a guaranty in favor of FVP in connection with the loan. Proceeds from the loan were used to repay the existing senior secured loan balance of $100,000 along with accrued interest, certain outstanding trade payables in the amount of $133,880 and for general working capital purposes. In addition, the Company granted the Lender a security interest in substantially all of its assets.\nNotes Payable, related party\nOn November 9, 2018, Mr. Kepler, advanced $120,000 to the Company in exchange for a promissory note bearing interest at 12% per annum for a ninety-day period, maturing on January 28, 2019. On November 17, 2020 the note and accrued interest of $29,680 was paid in full.\nOn December 6, 2018, Mr. Kepler, advanced $108,000 to the Company for payment to a third party note holder in exchange for an unsecured promissory note. During the year ended December 31, 2020, the Company repaid $107,141 in principal, reducing the balance due as of December 31, 2020 to $859.\nConvertible Notes Payable\nOn May 21, 2019, the Company issued an 8% Fixed Convertible Promissory Note payable to a third party with a face value of $385,000, which included an original issue discount of 10% on the investment amount. On July 17, 2019, the Company issued another 8% Fixed Convertible Promissory Note with a face value of $165,000 which also included am original discount of 10% on the investment amount. The two notes contain substantially identical terms. The Company recorded the value of the notes’ conversion feature in the amount of $342,308 at inception. The Company defaulted on the notes and recorded default fees of $57,750 and $24,750 for the years ended December 31, 2019 and 2020, respectively, which amounts were added to the principal balance.\nOn July 10, 2020, the Company entered into Forbearance and Note Settlement Agreements (“Agreements”) with the holders of the 8% Fixed Convertible Promissory Notes agreeing to take no further action to avail themselves of the remedies of default defined in the Notes. The Agreements stipulated that the Company remit payment of all accrued interest and principal outstanding beginning on July 20, 2020 for thirteen agreed upon payments and until the note is repaid in full. Upon execution of these Agreements, effectively extinguishing the above-described notes, the Company recognized a cancellation of the derivative liability previously related to the conversion feature of $522,065. As additional consideration for the Agreements, the holders were issued warrants to purchase up to 360,000 shares of the Company’s Common Stock at a price of $1.00 per share, exercisable beginning January 10, 2021 and expiring on July 10, 2025. The fair value of the warrants at the date of issuance was $371,243, and was reflected in paid in capital and the related debt discount is being amortized over the term of the Agreements.\nOn March 23, 2020 third parties advanced $75,000 and $25,000 to the Company in exchange for Convertible Promissory Notes, bearing interest at 52% per annum to be paid monthly in arrears beginning April 30, 2020, secured by the Company’s assets, with rights to convert into the Company’s Common Stock at $0.60, and maturing on March 25, 2021. On June 23, 2020 the Company amended the notes changing the provision for conversion into the Company’s Common Stock from $0.60 to $1.95. Additional consideration for the amended and restated notes included the issuance of warrants for the purchase of up to 115,385 shares of common stock at a price of $0.01. On July 6, 2020 the holders exercised their warrants. On November 12, 2020 the holders of these notes elected to convert the obligations in the aggregate principal amount of $100,000 into 51,282 shares of Common Stock.\n7. DERIVATIVE LIABILITIES\nDuring the year ended December 31, 2020, notes payable in the principal amount of $100,000 were issued as convertible debt and qualified as derivative liabilities and were retired. As of December 31, 2019, the aggregate fair value of the outstanding derivative liability for notes issued during 2019 using the Black-Scholes option pricing model used the following key assumptions:\nVolatility\n356.33 %\nRisk-free interest rate\n1.52 %\nExpected dividends\n-\nExpected term (in years)\n.5\nThe Company determines the fair values of its financial instruments based on the fair value hierarchy, which requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. The following three levels of inputs may be used to measure fair value:\nLevel 1 inputs utilize unadjusted quoted prices in active markets for identical assets or liabilities that the Company has the ability to access;\nLevel 2 inputs utilize other-than-quoted prices that are observable, either directly or indirectly and include quoted prices for similar assets and liabilities in active markets, and inputs such as interest rates and yield curves that are observable at commonly quoted intervals; and\nLevel 3 inputs are unobservable and are typically based on our own assumptions, including situations where there is little, if any, market activity.\nThe following table presents the Company’s liabilities that were measured and recognized at fair value as of December 31, 2020:\nLevel 1\nLevel 2\nLevel 3\nBalance January 1, 2019\n-\n-\n-\nAdditions\n-\n-\n$ 1,321,764\nChange in Fair Value\n-\n-\n83,766\nBalance at December 31, 2019\n$ -\n$ -\n$ 1,405,530\nAdditions\n-\n-\n317,776\nAmendments\n-\n-\n(224,066 )\nRetirements\n-\n-\n(567,588 )\nChange in Fair Value\n-\n-\n(931,652 )\nBalance at December 31, 2020\n$ -\n$ -\n$ -\n8. COMMITMENTS AND CONTINGENCIES\nOn August 28, 2017, the Company acquired and was assigned all right, title and interest in an office lease with Teachers Insurance and Annuity Association of America for approximately 1,502 square feet of office space at 5430 LBJ Freeway, Dallas, Texas. On September 19, 2017 the Company amended the lease to expand its space by approximately 336 square feet for a total of 1,838 square feet and extended the expiration date to September 30, 2022. On January 1, 2019 the Company adopted ASC 842 requiring this lease to be recorded as an asset and corresponding liability on its balance sheet. The Company records rent expense associated with this lease on the straight-line basis in conjunction with the terms of the underlying lease. During the years ended December 31, 2020 and 2019 we incurred $59,597 and $54,631, respectively, in office rental expense. Future minimum rental payments under the extended lease for years ending December 31, are:\n61,800\n46,863\nOn August 11, 2020 the Company entered into a letter agreement with Winspear Investments, LLC (“Winspear”), pursuant to which the Company retained Winspear to provide strategic advisory services for financial and business matters. The agreement provides for a minimum three-month term and that Winspear would be compensated with the grant of 20,000 shares of the Company’s common stock at inception and an additional 5,000 shares per month for the initial term. In the event Winspear continues to provide services, Winspear shall be compensated an additional grant of 3,000 shares per month for a total of twelve-months and such grants shall not exceed an aggregate issuance of 71,000 shares. The agreement also provides that Winspear shall be granted 80,000 shares if the Company achieves a listing with NASDAQ. The total shares issuable under the agreement shall not be less than a minimum of 35,000 and not exceed a maximum of 151,000 shares. As of December 31. 2020 48,000 common shares have been issued.\nThe Company is not currently a defendant in any material litigation or any threatened litigation that could have a material effect on the Company’s financial statements.\n9. INCOME TAXES\nThe Company has established deferred tax assets and liabilities for the recognition of future deductions or taxable amounts and operating loss carry forwards. Deferred federal income tax expense or benefit is recognized as a result of the change in the deferred tax asset or liability during the year using the currently enacted tax laws and rates that apply to the period in which they are expected to affect taxable income. Valuation allowances are established, if necessary, to reduce deferred tax assets to the amounts that will more likely than not be realized.\nDuring the years ended December 31, 2020 and 2019, a reconciliation of income tax expense at the statutory rate of 21 % to income tax expense at the Company’s effective tax rate is as follows:\nIncome tax benefit at statutory rate\n$ 75,000\n$ 627,000\nPermanent differences\n233,000\n(21,000\n)\nChange in valuation allowance\n(308,000\n)\n(606,000\n)\nProvision for federal income taxes\n$ -\n$ -\nAt December 31, 2020, the Company had approximately $5,551,000, of unused net operating loss carry forwards. Unused net operating loss carry forwards may provide future tax benefits, although there can be no assurance that these net operating losses will be realized in the future. The tax benefits of these loss carryforward have been fully offset by a valuation allowance. These losses may be used to offset future taxable income and, if not fully utilized, expire in the year 2038.\n10. SUBSEQUENT EVENTS\nOn August 8, 2020 the Company entered into a subscription agreement to sell 12,821 shares of Common Stock and a Warrant, exercisable for a period of 5 years, to purchase 6,411 shares of Common Stock at an exercise price of $1.95 per share, to a third party, for aggregate consideration of $25,001. On January 4, 2021 the subscription agreement was amended to sell 6,411 shares of Common Stock and issue the Warrant to purchase 3,206 shares of Common Stock at the same exercise prices as the original agreement, for aggregate consideration of $12,500.\nIn January 2021 the Company entered into several subscription agreements to sell an aggregate of 43,591 shares of Common Stock at $1.95 per share, to third parties, for aggregate consideration of $85,002.\nOn January 28, 2021 the Company exchanged a liability of $130,000 for the purchase of a Simple Agreement for Future Tokens for 66,667 shares of Common Stock valued at $1.95 per share and on February 21, 2021 exchanged an additional $50,000 for 25,641 shares of Common Stock under a similar arrangement."
}