{
    "cik": "1591698",
    "company": "Paylocity Holding Corp",
    "filing_type": "10-K",
    "filing_date": "2021-08-06",
    "period_of_report": "2021-06-30",
    "sic": "7372",
    "state_of_inc": "DE",
    "state_location": "IL",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1591698/0001558370-21-010711-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1591698/000155837021010711/pcty-20210630x10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1591698/0001558370-21-010711.txt",
    "filename": "1591698_10K_2021_0001558370-21-010711.htm",
    "item_1": "Item 1. Business.\nOverview\nWe are a cloud-based provider of payroll and human capital management, or HCM, software solutions for medium-sized organizations, which we define as those having between 10 and 1,000 employees. Our comprehensive product suite delivers a unified platform to create a modern workplace for our clients and their employees through automation, data-driven insights and engagement. Excluding clients acquired through acquisitions, as of June 30, 2021, we provided our payroll and HCM software solutions to approximately 28,750 clients across the U.S., which on average had over 100 employees.\nOur multi-tenant software platform is highly configurable and includes a unified product suite for payroll, human capital management, workforce management, talent management, benefits, modern workforce solutions, and analytics & insights, to enable our clients to make strategic decisions all while promoting a modern workplace and improving employee engagement. Our payroll and HCM modules provide robust on-demand functionality, reporting and analytics. Our platform provides intuitive self-service functionality for employees and managers combined with seamless integration across all our solutions. We supplement our comprehensive software platform with an integrated implementation and client service organization, all of which are designed to meet the needs of our clients and prospects.\nEffective management of human capital is a core function in all organizations and requires a significant commitment of resources. Organizations are faced with complex and ever-changing requirements, including diverse federal, state and local regulations across multiple jurisdictions. In addition, the workplace operating environment is rapidly changing as employees increasingly become mobile, work remotely and expect an end user experience similar to\nthat of consumer-oriented applications. Many companies also are operating without the infrastructure, expertise or personnel to implement or support large and complex systems in today’s dynamic environment. Existing solutions offered by third-party payroll service providers can have limited capabilities and configurability while other enterprise-focused software vendors can be prohibitively expensive and time-consuming to implement and manage. We believe that modern organizations are better served by modern SaaS solutions designed to meet their unique needs, deliver fast time to value and provide their employees with the most engaging experience available.\nOur solutions provide the following key benefits to our clients:\n● Comprehensive payroll and HCM cloud-based platform built to connect with today’s workforce;\n● Modern, intuitive user experience and self-service capabilities that significantly increase employee engagement;\n● Flexible and configurable platform that aligns with business processes and centralizes payroll and HCM data;\n● Software as a service, or “SaaS”, delivery model that reduces total cost of ownership for our clients; and\n● Seamless data integration with our extensive partner ecosystem that saves time and expense and reduces the risk of errors.\nWe market and sell our products through our direct sales force. We generate sales leads through a variety of focused marketing initiatives and from our extensive referral network of 401(k) advisors, benefits administrators, insurance brokers, third-party administrators and HR consultants. We derive revenue from a client based on the solutions purchased by the client, the number of client employees and the amount, type and timing of services provided with respect to those client employees. Our annual revenue retention rate was greater than 92% in each of the fiscal years 2019, 2020 and 2021. Our total revenues increased from $467.6 million in fiscal 2019 to $561.3 million in fiscal 2020, representing a 20% year-over-year increase and to $635.6 million in fiscal 2021, representing a 13% year-over-year increase. While the majority of our agreements with clients are generally cancellable on 60 days’ or less notice, we also have term agreements which are generally two years in length. Our recurring revenue model and high annual revenue retention rates provide significant visibility into our future operating results.\nIndustry Background\nEffective management of human capital is a core capability for all organizations. Identifying, acquiring and retaining talent is a priority at all levels of an organization. Likewise, in today’s increasingly complex business and regulatory environment, organizations are being pressured to manage critical payroll and HCM functions more effectively, automate manual processes and decrease their operating costs, while at the same time successfully managing their workforces.\nComplex and Dynamic Tax and Regulatory Environment\nThe tax and regulatory environment in the United States is complex and dynamic. Organizations are subject to a myriad of benefit, workers compensation, healthcare, tax and other rules, regulations and reporting obligations. In addition to U.S. federal taxing and regulatory authorities, there are more than 10,000 state and local tax codes in the United States. Further, federal, state and local government agencies continually enact and amend the rules, regulations and reporting requirements with which organizations must comply. Leveraging industry leading technology and service to meet these demands delivers critical value to organizations.\nGrowing Demand for Mobility and Enhanced User Experience\nConnectivity and mobility are enabling employees to spend less time in traditional office environments and more time working remotely. This trend increases the demand for advanced and intuitive solutions that improve collaboration and foster employee engagement, such as remote self-service access to payroll and timesheet reporting, HR and benefits portals and other talent management applications. Given the prominence of consumer-oriented applications, employees expect the user experience and accessibility of internal systems to be similar to those of the latest consumer and social applications, such as LinkedIn, Amazon and Facebook.\nLarge Market Opportunity for Payroll and HCM Solutions\nThe market opportunity in the U.S. for payroll and HCM applications and services is driven by the importance of payroll and HCM solutions to the successful management of organizations. To estimate our addressable market, we focus our analysis on the number of U.S. medium-sized organizations and the number of their employees. According to the U.S. Census Bureau, there were over 1.3 million firms with 10 to 1,000 employees in the U.S. in 2018, employing over 55 million people. We estimate that if clients were to buy our entire suite of existing solutions at list prices, they would spend approximately $420 per employee annually. Based on this analysis, we believe our current target addressable market is approximately $23 billion. Our existing clients do not typically own our entire suite of solutions, and as we continue to expand our product offerings, we believe that we have an opportunity to increase the amount clients spend on payroll and HCM solutions per employee and to expand our addressable market.\nOrganizations Are Increasingly Transitioning to SaaS Solutions\nSaaS solutions are easier and more affordable to implement and operate than those offered by traditional service bureaus and legacy software providers. SaaS solutions also enable software updates with greater frequency and without new hardware investments, enabling organizations to better react to changes in their environments. Many organizations are transitioning to SaaS solutions to satisfy their software needs. Similarly, we believe organizations are adopting SaaS applications for payroll and HCM solutions with increasing frequency.\nLimitations of Legacy Competitive Solutions\nWe believe that legacy payroll and HCM solution providers have limitations that cause them to underserve the unique needs of modern organizations. Existing legacy payroll and HCM solutions include:\n● Traditional Payroll Service Providers. Traditional payroll service providers are primarily focused on delivery of a variety of payroll processing services, insurance products and HR business process outsourcing solutions. Many of these solutions offer limited capabilities and integration beyond traditional payroll processing. The lack of a unified and configurable employee-facing payroll and HCM suite can diminish the effectiveness of a system, detract from user experience and limit integration with other solutions. In addition, we believe that certain traditional payroll service providers often do not provide a high-quality technology and service experience.\n● Enterprise Software Vendors. Enterprise software vendors offer solutions and services that are designed for the complex needs and structures of very large enterprises. As a result, their solutions can be prohibitively expensive, complex and time-consuming to implement, operate and maintain.\n● HCM Point Solution Providers. Many HCM point solutions lack integrated payroll functionality. The implementation and management of multiple point solutions and the reliance on multiple service organizations can be challenging and expensive.\n● Manual Processes for Payroll and HCM Functions. Manual payroll and HCM processes require increased HR, payroll and finance personnel involvement, resulting in higher costs, slower processing and greater risks of data entry errors.\nGiven the challenges many organizations face operating in complex and dynamic environments and the limited ability of traditional offerings to address these challenges, we believe there is a significant market opportunity for a comprehensive, unified SaaS solution designed to serve the payroll and HCM needs of modern organizations.\nSegment Information\nOur chief operating decision maker reviews our financial results in total when evaluating financial performance and for purposes of allocating resources. We have thus determined that we operate in a single cloud-based software solution reporting segment.\nOur Solutions\nWe are a cloud-based provider of payroll and HCM software solutions. Our solutions enable organizations to more efficiently manage payroll and human capital in their complex and dynamic operating environments. Excluding clients acquired through acquisitions, as of June 30, 2021, we provided our payroll and HCM software solutions to approximately 28,750 clients across the U.S., which on average had over 100 employees.\nThe key benefits of our solutions include the following:\n● Comprehensive Payroll and HCM Platform Built to Connect with Today’s Workforce. Our solutions empower finance and HR professionals to drive strategic human capital decisions by providing enterprise-grade payroll and HCM modules, including robust reporting and analytics. Our unified platform fully automates payroll and HCM processes, enabling our clients to focus on core business activities. Our solutions help our clients attract, retain and manage their employees within a single, comprehensive system.\n● Modern, Intuitive User Experience. Our intuitive, easy-to-use and mobile-centric platform provides increased accessibility of our solutions and decreased need for training while also providing users with an engaging mobile and self-service experience.\n● Flexible and Configurable Platform. We design our solutions to be flexible and configurable, allowing our clients to match their use of our software with their specific business processes and workflows. Our platform has been organically developed from a common code base, data structure and user interface, providing a consistent user experience with powerful features that are easily adaptable to our clients’ needs. Our systems centralize payroll and HCM data, minimizing inconsistent and incomplete information that can be produced when using multiple databases.\n● Highly Attractive SaaS Solution. Our solutions are cloud-based and offered on a subscription basis, making them easier and more affordable to implement, operate and update and thus enabling our clients to focus less on their IT infrastructure and more on their core businesses. Our software can be operated by a single administrator without the support of an in-house information technology department. Our multi-tenant and modern architecture allows for frequent software enhancements thereby enabling our clients to react to a rapidly changing and complex operating environment. Our platform enables our clients to scale their businesses without having to acquire additional hardware or to resolve the integration challenges that often result from traditional outsourcing solutions.\n● Seamless Integration with Extensive Ecosystem of Partners. Our platform offers our clients automated data integration with over 400 related third-party partner systems, such as 401(k), benefits and insurance provider systems. This integration reduces the complexity and risk of error of manual data transfers and saves time for our clients and their employees. We integrate data with these related systems through a secure connection, which significantly decreases the risk of unauthorized third-party access and other security breaches. Our direct and automated data transmission improves the accuracy of data and facilitates data collection in our partners’ systems. We believe having automated data\nintegration with a payroll and HCM provider like us differentiates our partners’ product offerings, strengthening their competitive positioning in their own markets.\nOur Strategy\nWe intend to strengthen and extend our position as a leading provider of cloud-based payroll and HCM software solutions. Key elements of our strategy include the following:\n● Grow Our Client Base. We believe that our current client base represents only a small portion of the organizations that could benefit from our solutions. While we provide our payroll and HCM software solutions to approximately 28,750 clients across the U.S. (excluding clients acquired through acquisitions) as of June 30, 2021, there are over 1.3 million businesses with 10 to 1,000 employees in the U.S., employing more than 55 million people, according to the U.S. Census Bureau in 2018. In order to acquire new clients, we plan to continue growing our sales organization across the U.S.\n● Expand Our Product Offerings. We believe a significant part of our leadership position is the result of our investment and innovation in our product offerings. We plan to continue to invest in product development efforts that will allow us to offer a broader selection of products to new and existing clients.\n● Extend Technological Leadership. We believe that our organically developed cloud-based multi-tenant software platform, combined with our unified database architecture, enhances the experience and usability of our products, providing what we believe to be a competitive advantage over alternative solutions. Our modern, intuitive user interface utilizes features found on many popular consumer Internet sites, enabling users to use our solutions with limited training. We plan to continue our technology innovation, as we have done with our mobile applications, social features and analytics capabilities.\n● Further Develop Our Referral Network. We have developed a strong network of referral participants, such as 401(k) advisors, benefits administrators, insurance brokers, third-party administrators and HR consultants that recommend our solutions and provide referrals. We believe that our platform’s automated data integration with over 400 related third-party partner systems is valuable to our referral participants, as they are able to access payroll and HR data through a single system which decreases complexity and cost and complements their own product offerings. We plan to increase integration with third-party providers and expand our referral network to grow our client base and lower our client acquisition costs.\nOur Products\nOur comprehensive product suite delivers a unified platform to create a modern workplace for our clients through automation, data-driven insights and engagement. Our product suite includes the following categories:\nPayroll\nPayroll and Tax Services - Our Payroll and Tax Services solution is designed to simplify payroll, automate processes and manage complex compliance requirements within one system. Our payroll solution leverages data from our Time and Attendance and Human Capital Management solutions to accurately calculate wages, deductions and withholdings, without the need for manual reentry. Clients work with our experts to configure general ledger integrations, accruals and complex reports to enable data-driven decision making. Our integration capabilities also automatically transfer 401(k) information, retirement plans and benefit files to\nthird-party providers. Through our Tax Services solutions, we accurately prepare and file the necessary tax withholdings and filing documents for local, state and federal jurisdictions.\nExpense Management - Our Expense Management solution enables mobile app capture of receipts and imports transactions from credit cards, reducing manual entry errors and minimizing employee and approver paperwork, while also eliminating spreadsheets, calculators and manual approvals through automated workflows that route approved expenses for payroll reimbursement.\nOn Demand Payment - On Demand Payment provides employees with visibility into their earned wages in between pay cycles based on their hours worked and offers financial flexibility to employees through access to a portion of their earned wages before their scheduled payday without impacting the client’s standard payroll process.\nGarnishments - Our Garnishments solution provides the calculation, setup and maintenance of historical deduction records and performs calculation validation against state and federal legislation to mitigate compliance risk and prevent costly penalties and errors.\nHuman Capital Management\nHuman Capital Management - Our Human Capital Management solutions streamline HR processes using modern, mobile-enabled tools that help save time by automating administrative tasks and providing data-driven reporting. Clients can track headcount and status for positions, manage position and manager changes, manage compliance tracking and reporting, and employee data and documents in one central location.\nEmployee Self-Service - Our Employee Self-Service module provides employees with access to their information 24/7, which allows them to view checks, request time off, clock in and out, and update personal data. Employees can also enroll in benefits, view coverage, access Learning Management System training or view course completion status on-the-go via our mobile app.\nDocument Library - Our Document Library serves as a central location to securely store personal employee files such as offer letters and performance reviews to help clients stay compliant and organized by replacing manual processes and paper files. HR professionals can search electronic documents and easily upload, store and download documents while managing access with our role-based permission settings.\nCompliance Dashboard - With our Compliance Dashboard, clients save time and money by staying up to date with new laws and regulations related to topics such as employment verification, Equal Employment Opportunity and compensation.\nHR Edge - HR Edge supports human resource leaders’ navigation through complex compliance requirements, social issues and HR policies. Clients can also access a comprehensive library of detailed articles, guides and other resources to make informed decisions on compliance topics such as healthcare reform, wages and hours regulations, employee leave, state laws, discrimination and more.\nWorkforce Management\nTime and Attendance - Our Time and Attendance solution accurately tracks time and attendance data, eliminating the need for manual tracking of accruals and reducing administrative tasks. Employees can request and manage time off, edit timecards and manage schedule changes. A customizable supervisor dashboard provides at-a-glance visibility to missed punches, pending time off requests, attendance exceptions and more.\nScheduling - Clients can automate schedule tracking by creating and adjusting work schedules as needed, including leveraging templates and building policies based on duration, time between shifts and availability\nwithout having to manually correct payroll data. Managers and employees can easily manage their schedules from our mobile app to ensure the appropriate shift coverage.\nTime Collection - Our wide variety of time collection devices include kiosks, state-of-the-art time clocks, and mobile and web applications to meet unique needs of different companies while enabling employees to clock in wherever business is conducted. Advanced features include specifying geographic parameters for mobile punch-in, requiring employees to punch in with a photo, answering attestation prompts and temperature checks.\nTalent Management\nRecruiting - Recruiting helps clients find the right candidates by offering intuitive tools to streamline talent acquisition processes from application creation to candidate acceptance. By modernizing the experience, clients can conveniently reach candidates wherever they are, including through embedded text messaging, and instantly track conversations in our platform. HR professionals can customize job applications and reach more candidates by automatically posting to online job portals. Additionally, our solution provides clients with the ability to auto-fill and simplify background checks, maintain and track personal and confidential data, and have real-time access to candidate information to enable timely staffing decisions. Recruiters can communicate with modern candidates in the ways they expect, including email and text messaging from right within the Paylocity platform.\nOnboarding - Onboarding enables new employees to complete all pre-hire tasks through digital data collection to gather important personal and confidential information and documentation right through the Paylocity platform. Clients can streamline processes such as handbook acknowledgment, tax withholding forms, I-9 document verification, E-Verify and many others. Additionally, new hires feel an instant connection to their team and employer with welcome notes from leaders, introductory videos, company culture information and company policies.\nLearning Management - Our Learning Management solution allows clients to easily assign courses tailored to training their employees on new skills, policies, products, and other topics with a variety of course delivery methods including on-demand and webinars, all of which are available via our mobile app. Our clients can create a variety of content for their employees including via a Sharable Content Object Reference Model (SCORM), embedded video and various document types. The client’s custom content is supplemented by a library of standard trainings provided by Paylocity to help in areas like anti-harassment, new hire, workplace safety, diversity in recruiting and many more. Clients can also empower their employees to create trainings so that internal subject matter experts can share their expertise with colleagues.\nPerformance Management - Our Performance Management tools enable transparent, two-way communication, allowing teams to have ongoing performance conversations. With the ability to manage employee review cycles at the center of the performance management solution, employees can also manage goals and track their career development. Our tools help facilitate ongoing, goals-driven conversations using Journals, giving employees a record of their tasks, goals and accomplishments. Additionally, our clients can prepare succession planning assessments across their employee population by using our 9-box tool that provides context to employees’ performance and the ability to visualize the distribution of their workforce.\nCompensation Management - Compensation Management helps clients ensure alignment between organizational goals, budgets and participant eligibility in an efficient process that reduces manual effort and paper-based budgeting activities. Our customized dashboards provide visibility to individual performance and compensation history at custom permission levels and the full value of an employee’s compensation and\nbenefits. Clients can create employee-facing Total Rewards Statements in bulk to demonstrate the full compensation an employee receives-including not just pay but also benefits, time off, and more.\nBenefits\nEmployee Benefits Management - Clients can plan and administer competitive benefits packages in one place while offering a smooth, mobile-friendly enrollment and management experience for employees with our Employee Benefits Management tool. Benefit administrators can add enrollment rules, manage benefit offerings for different employee groups, customize user plan limits, and view plan documentation, among other features. Employees can manage their own elections in Employee Self Service or via the mobile app, which allows them to better understand their healthcare packages. Clients can also administer third-party benefit services such as Flexible Spending Accounts (FSA), Health Savings Accounts (HSA) and Consolidated Omnibus Budget Reconciliation Act (COBRA) with ease and supplement standard plans with complementary programs, giving employees the benefits options they need.\nThird-Party Administrative (TPA) Solutions - Our TPA solutions are designed to modernize the administration of HSA, FSA, Health Reimbursement Arrangement (HRA), Transportation Management Account (TMA) and Premium Only Plan (POP) benefits by providing users with a single, unified access point for payroll, HR, and benefits administration. Our TPA solutions include mobile and web access, allowing users to view transaction details and account balances while having the ability to submit claims from our integrated employee portal. It also eases the administration of COBRA coverage and retiree billing.\nModern Workforce Solutions\nCommunity - Community is our integrated, mobile-friendly social collaboration tool designed to centralize company communications while also providing clients with an avenue to increase employee connection, engagement and productivity. Community enables leaders, HR professionals and employees to share and respond to meaningful, timely and relevant content in the way today’s modern workforce expects, leveraging groups, which are Community’s foundation. Clients can create groups on topics ranging from project-related collaboration to employee resource groups (ERGs), fostering inclusivity to special interests like music or sports. In addition, specialized Ask an Expert group types can provide a consolidated forum between employees and subject matter experts in areas like IT troubleshooting or open enrollment. Employees can ask questions privately or publicly to designated group administrators who are alerted of submissions and can track questions and status in a dashboard. Employees receive notifications when questions are addressed.\nPremium Video - Premium Video provides clients the ability to record, upload and embed videos across our HCM platform to increase collaboration, morale, engagement and productivity. Our solution enables clients to embed videos seamlessly into tasks that are critical to their business such as employee communication, recruiting, onboarding, performance management and surveys.\nSurveys - Our Surveys tool help clients gather valuable feedback to encourage ongoing and transparent conversations.\nPeer Recognition - Peer Recognition promotes positive interactions by allowing employees to recognize and celebrate colleagues’ achievements. It also gives employees the ability to post accolades on their profiles and share with co-workers.\nAnalytics & Insights\nModern Workforce Index - The Modern Workforce Index (MWI) leverages patent-pending AI and data from more than 25,000 clients to provide insight and actionable recommendations to improve employee sentiment and engagement. Clients can view their overall MWI score and compare performance to peers-then break down results across tool utilization, employee sentiment, and organizational health. This enables our clients to improve employee engagement and productivity, lower turnover, and ultimately realize greater growth.\nData Insights - With our Data Insights solution, our clients can evaluate the health of their organizations with actionable insights in areas such as employee retention, composition of their employee populations and labor costs.\nReporting - In addition to over 200 out of the box reports, dynamic reporting capabilities help clients utilize data within the Paylocity platform, allowing them to customize and schedule reporting. New reports are added regularly in response to regulatory changes, compliance updates and client feedback.\nClient Support Teams\nWe supplement our comprehensive software platform with an integrated implementation and client service organization with deep subject matter expertise. Our core operation consists of various specialists, including implementation teams, account managers, payroll processing and tax service teams. Delivering a positive experience and a high level of support is an essential element of our ability to sell our solutions and retain clients.\nImplementation and Training Services\nOur clients are typically migrating to our platform from a competitive solution or are adopting their first online payroll and HCM solution. These organizations often have limited internal resources and rely on us to implement their payroll and HCM solutions. We typically implement our product suite within one to eight weeks, depending on the size and complexity of each client. Each client is guided through the implementation process by our knowledgeable consultants for all implementation matters. We believe our ability to rapidly implement our solutions is principally due to the combination of our emphasis on engagement with the client, our standardized methodology, our cloud-based architecture and our highly configurable, easy-to-use products.\nWe offer clients the opportunity to utilize on-demand or in-class training designed to provide clients with general knowledge on our solutions. We also host an annual client conference for clients to learn about new products and features and allow clients to provide feedback and learn best practices.\nClient Service\nOur client service model is designed to serve and support the needs of our clients and to build loyalty by developing strong relationships with clients. We strive to achieve high revenue retention, in part, by delivering high-quality service. Our revenue retention was greater than 92% in each of fiscal 2019, 2020 and 2021. Each client is assigned an account management team that serves as the central point of contact for any questions or support needs. We believe this approach enhances client service by providing clients with knowledgeable resources who understand the client’s business, respond quickly, and are accountable for the overall client experience. Account managers are supplemented by teams with deep technical and subject matter expertise who help to expediently and effectively address client needs. We also proactively solicit client feedback through ongoing surveys from which we receive actionable feedback that we use to enhance our client service processes. We have also built an online knowledge repository for clients that provide industry content and Paylocity product and service information.\nTax and Regulatory Services\nOur software contains a rules engine designed to make accurate federal, state, and local tax calculations that is continually updated to support all pertinent legislative changes across U.S. jurisdictions with the support of our tax compliance professionals. Our tax service teams provide a variety of solutions to clients including processing payroll tax deposits, preparing and filing quarterly and annual employment tax returns and amendments and resolving client employment tax notices. Our tax filing and compliance departments perform multiple audits to ensure that clients remit timely and accurate tax payments. In addition, a series of audit routines are run to ensure that quarterly tax filings are accurate and submitted on a timely basis.\nClients\nExcluding clients acquired through acquisitions, as of June 30, 2021, we provided our payroll and HCM software solutions to approximately 28,750 clients, across the U.S. The rate at which we add clients is variable period-to-period and is also seasonal as many clients switch solutions during the first calendar quarter of each year. Clients include for-profit and non-profit organizations across industries including business services, financial services, healthcare, manufacturing, restaurants, retail, technology and others. For each of the three years ended June 30, 2019, 2020 and 2021, no client accounted for more than 1% of our revenues.\nSales and Marketing\nWe market and sell our products and services through our direct sales force. Our direct sales force includes sales representatives who have defined geographic territories throughout the U.S. We seek to hire experienced sales representatives wherever they are located and believe we have room to grow the number of sales representatives in each of our territories.\nThe sales cycle begins with a sales lead generated by the sales representative, through our third-party referral network, a client referral, our telemarketing team, our external website, e-mail marketing, or other territory-based activities. We support our sales force with a marketing program that includes seminars and webinars, email marketing, social media marketing, broker events and web marketing.\nReferral Network\nAs a core element of our business strategy, we have developed a referral network of third-party service providers, including 401(k) advisors, benefits administrators, insurance brokers, third-party administrators and HR consultants, that recommend our solutions and provide referrals. Our referral network has become an increasingly important component of our sales process, and in fiscal 2021, more than 25% of our new client revenue originated by referrals from participants in our referral network.\nWe believe participants in our referral network refer potential clients to us because of the strength of our products and services, the value we provide our referral partners through our broker portal, the fact that we do not provide services that compete with our referral networks, and because we offer third parties the ability to integrate their systems with our platform. Unlike other payroll and HCM solution providers who also provide retirement plans, health insurance and other products and services competitive with the offerings of the participants in our referral network, we focus only on our core business of providing payroll and HCM solutions. In some cases, we have formalized relationships in which we are a recommended vendor of these participants. In other cases, relationships are informal. We typically do not compensate these participants for referrals.\nPartner Ecosystem\nWe have developed a partner ecosystem of third-party systems, such as 401(k), benefits and insurance provider systems, with whom we provide automated data integration for their clients. These third-party providers require certain financial, payroll and other employee demographic information from their clients to efficiently provide their respective services. After securing authorization from the client, we exchange data with these providers. In turn, these third-party providers supply data to us, which allows us to deliver comprehensive HR and benefit management services to our clients. We believe our partnerships with these third parties are an important part of their service offerings. We have also developed our solutions to integrate with a variety of other systems used by our clients, such as accounting, point of sale, banking, expense management, recruiting, background screening and skills assessment solutions.\nPaylocity’s automated data integration reduces the complexity and risk of error of manual data transfers and saves clients and employees time. Direct and automated data transmission improves the accuracy of data and facilitates data collection in partners’ systems. Having automated data integration with a payroll and HCM provider differentiates partners’ product offerings, strengthening their competitive positioning in their own markets.\nTechnology\nWe offer our solutions on a cloud-based platform that leverages a unified architecture and a common code base that we organically developed. Clients do not need to install our software in their data centers and can access our solutions through any mobile device or web browser with Internet access.\n● Multi-Tenant Architecture. Our software solutions were designed with a multi-tenant architecture. This architecture gives us an advantage over many disparate traditional systems, which are less flexible and require longer and more costly development and upgrade cycles.\n● Mobile Focused. We employ mobile-centric principles in our solution design and development. We believe that the increasing mobility of employees heightens the importance of access to our solutions through mobile devices, including smart phones and tablets. Our mobile experience provides our clients and their employees with access to our solutions through virtually any device having Internet access. We bring the flexibility of a secure, cloud-based solution to users without the need to access a traditional desktop or laptop computer.\n● Security. We maintain comprehensive security programs designed to ensure the security and integrity of client and employee data, protect against security threats or data breaches and prevent unauthorized access. We regulate and limit all access to servers and networks at our data centers. Our systems are monitored for irregular or suspicious activity, and we have dedicated internal staff perform security assessments for each release. Our systems undergo regular penetration testing and source code reviews by an independent third-party security firm.\nWe use multiple cloud hosting and third-party data center providers to host our solutions, including data centers in Franklin Park, Illinois and Kenosha, Wisconsin (for backup and disaster recovery). We supply the hardware infrastructure and are responsible for the ongoing maintenance of our equipment at all data center locations.\nCompetition\nThe market for payroll and HCM solutions is both fragmented and highly competitive. Our competitors vary for each of our solutions and primarily include payroll and HR service and software providers, such as Automatic Data Processing, Inc., Paychex, Inc., Paycom Software, Inc., Paycor, Inc., Ultimate Kronos Group and other local and regional providers.\nWe believe the principal competitive factors on which we compete in our market include the following:\n● Solutions built to connect with today’s workforce;\n● Comprehensive payroll and HCM product suite on a single platform;\n● Breadth and depth of product functionality;\n● Configurability and ease of use of our solutions;\n● Modern, mobile, intuitive and consumer-oriented user experience;\n● Benefits of a cloud-based technology platform;\n● Ability to innovate and respond to client needs rapidly;\n● Domain expertise in payroll and HCM;\n● Quality of implementation and client service;\n● Ease of implementation;\n● Real-time web-based payroll processing; and\n● Access to a wide variety of complementary third-party service providers.\nWe believe that we compete favorably on these factors and our ability to remain competitive will largely depend on the success of our continued investment in sales and marketing, research and development and implementation and client services.\nResearch and Development\nWe invest heavily in research and development to continuously introduce new modules, technologies, features and functionality. We are organized in small product-centric teams that utilize an agile development methodology. We focus our efforts on developing new modules and core technologies and on further enhancing the usability, functionality, reliability, performance and flexibility of existing modules.\nResearch and development costs, including research and development costs that were capitalized, were $73.6 million, $91.0 million and $108.5 million for the years ended June 30, 2019, 2020 and 2021, respectively.\nIntellectual Property\nOur success is dependent, in part, on our ability to protect our proprietary technology and other intellectual property rights. We rely on a combination of trade secrets, copyrights and trademarks, as well as contractual protections to establish and protect our intellectual property rights. We require our employees, consultants and other third parties to enter into confidentiality and proprietary rights agreements and control access to software, documentation and other proprietary information. Although we rely on laws respecting intellectual property rights, including trade secret, copyright and trademark laws, as well as contractual protections to establish and protect our intellectual property rights, we believe that factors such as the technological and creative skills of our personnel, creation of new modules, features and functionality and frequent enhancements to our modules are more essential to establishing and maintaining our technology leadership position.\nGovernmental Regulation\nAs a provider of payroll and HCM solutions, our systems contain a significant amount of sensitive data related to clients, employees of our clients, vendors and our employees. Data privacy has become a significant issue in the United States and in other countries. The regulatory framework for privacy issues worldwide is rapidly evolving and is likely to remain uncertain for the foreseeable future. Many federal and state government bodies and agencies have adopted or are considering adopting laws and regulations affecting or regarding the collection, use and disclosure of personal information. These include, for example, rules and regulations promulgated under the authority of the Federal Trade Commission, the Health Insurance Portability and Accountability Act of 1996, the Family Medical Leave Act, the Affordable Care Act, state breach notification laws and state privacy laws, such as the California Consumer Privacy Act of 2018, the California Privacy Rights Act and the Illinois Biometric Information Privacy Act. Further, because some of our clients have international operations, the European Union’s General Data Protection Regulation (“GDPR”) and other foreign data privacy laws may impact our processing of certain client and employee information.\nIn addition, many of our solutions are designed to assist clients with their compliance with certain U.S. federal, state and local laws and regulations that apply to them. As such, our products and services may become subject to increasing and/or changing regulatory requirements, including changes in tax, benefit and other laws, and as these requirements proliferate, we may be required to change or adapt our products and services to comply. Changing regulatory requirements might reduce or eliminate the need for some of our products and services, block us from developing new products and services or have an adverse effect on the functionality and acceptance of our solution. This might in turn impose additional costs upon us to comply, modify or further develop our products and services. It might also make introduction of new products and services more costly or more time-consuming than we currently anticipate or prevent\nintroduction of such new products and services. For example, the adoption of new money transmitter or money services business statutes in jurisdictions or changes in regulators’ interpretation of existing state and federal money transmitter or money services business statutes or regulations, could subject us to registration or licensing or limit business activities until we are appropriately licensed.\nOur ability to comply with and address the continuously evolving requirements and regulations applicable to our business depends on a variety of factors, including the functionality and design of our solutions and the manner in which our clients and their employees utilize them. We have implemented operating policies and procedures to protect the accuracy, privacy and security of our clients’ and their employees’ information and voluntarily undergo certain periodic audits and examinations and maintain certain certifications to demonstrate our commitment to regulatory compliance.\nThe foregoing description does not include an exhaustive list of the laws and regulations governing or impacting our business. See the discussion contained in the “Risk Factors” section in Part I,",
    "item_1A": "Item 1A. Risk Factors.\nOur business, prospects, financial condition or operating results could be materially adversely affected by any of these risks, as well as other risks not currently known to us or that are currently considered immaterial. The trading price of our common stock could decline due to any of the risks and uncertainties described below, and you may lose all or part of your investment. In assessing these risks, you should also refer to the other information contained in this Annual Report on Form 10-K, including our consolidated financial statements and related notes.\nRisks Related to our Business and Industry\nOur quarterly operating results have fluctuated in the past and may continue to fluctuate due to a variety of factors, many of which are outside of our control.\nOur number of new clients typically increases more during our third fiscal quarter ending March 31 than during the rest of our fiscal year, primarily because many new clients prefer to start using our payroll and human capital management, or HCM, solutions at the beginning of a calendar year. Client funds and year-end activities are also traditionally higher during our third fiscal quarter. As a result, our total revenue and expenses have historically grown disproportionately during our third fiscal quarter as compared to other quarters. Due to this seasonality in our business, quarter-to-quarter comparisons of our operations are not necessarily meaningful and such comparisons should not be relied upon as indications of future performance. Additionally, fluctuation in quarterly results may negatively impact the price of our common stock.\nIn addition to other risk factors listed within this “Risk Factors” section of this Annual Report on Form 10-K, some other important factors that may cause fluctuations in our quarterly operating results include the following:\n● The extent to which our products achieve or maintain market acceptance;\n● Our ability to introduce new products and enhancements and updates to our existing products on a timely basis;\n● Competitive pressures and the introduction of enhanced products and services from competitors;\n● Changes in client budgets and procurement policies;\n● The amount and timing of our investment in research and development activities and whether such investments are capitalized or expensed as incurred;\n● The number of our clients’ employees;\n● Timing of recognition of revenues and expenses;\n● Client renewal rates;\n● Seasonality in our business;\n● Technical difficulties with our products or interruptions in our services;\n● Our ability to hire and retain qualified personnel;\n● A repeal of or changes to the laws and regulations related to the products and services which we offer;\n● Changes in accounting principles;\n● Changes in interest rates;\n● Business disruptions caused by public health issues such as the coronavirus disease (“COVID-19”) pandemic; and\n● Unforeseen legal expenses, including litigation and settlement costs.\nIn addition, a significant portion of our operating expenses are related to compensation and other items which are relatively fixed in the short-term, and we plan expenditures based in part on our expectations regarding future needs and opportunities. Accordingly, changes in our business or revenue shortfalls could decrease our gross and operating margins and could negatively impact our operating results from period to period.\nChanges in regulatory laws or requirements applicable to our software and services could impose increased costs on us, delay or prevent our introduction of new products and services and impair the function or value of our existing products and services.\nOur products and services may become subject to increasing and/or changing regulatory requirements, including changes in tax, benefit and other laws, and as these requirements proliferate, we may be required to change or adapt our products and services to comply. Changing regulatory requirements might reduce or eliminate the need for some of our products and services, block us from developing new products and services or have an adverse effect on the functionality and acceptance of our solution. This might in turn impose additional costs upon us to comply, modify or further develop our products and services. It might also make introduction of new products and services more costly or more time-consuming than we currently anticipate or prevent introduction of such new products and services. For example, the adoption of new money transmitter or money services business statutes in jurisdictions or changes in regulators’ interpretation of existing state and federal money transmitter or money services business statutes or regulations, could subject us to registration or licensing or limit business activities until we are appropriately licensed. These occurrences could also impact how we conduct some aspects of our business or invest client funds, which could adversely impact interest income from investing client funds. Should any state or federal regulators determine that we have operated as an unlicensed money services business or money transmitter, we could be subject to civil and criminal fines, penalties, costs, legal fees, reputational damage or other negative consequences. Any of these regulatory implementations or changes could have an adverse effect on our business, operating results or financial condition.\nIf we do not continue to innovate and deliver high-quality, technologically advanced products and services, we will not remain competitive and our revenue and operating results could suffer.\nThe market for our solutions is characterized by rapid technological advancements, changes in client requirements, frequent new product introductions and enhancements and changing industry standards. The life cycles of our products are difficult to estimate. Rapid technological changes and the introduction of new products and enhancements by new or existing competitors, or development of entirely new technologies to replace existing offerings could limit the demand for our existing or future solutions and undermine our current market position.\nOur success depends in substantial part on our continuing ability to provide products and services that organizations will find superior to our competitors’ offerings and will continue to use. We intend to continue to invest significant resources in research and development to enhance our existing products and services and introduce new high-quality products that clients will want. If we are unable to predict user preferences or industry changes, or if we are unable to modify our products and services on a timely basis or to effectively bring new products to market, our revenue and operating results may suffer.\nFailure to manage our growth effectively could increase our expenses, decrease our revenue, and prevent us from implementing our business strategy and sustaining our revenue growth rates.\nWe have and we believe we will continue to experience rapid revenue and client base growth. However, the growth in our number of clients puts significant demands on our business, requires increased capital expenditures and increases our operating expenses. To manage this growth effectively, we must attract, train, and retain a significant number of qualified sales, implementation, client service, software development, information technology and management personnel. We also must maintain and enhance our technology infrastructure and our financial and accounting systems and controls. We must also expand and develop our network of third-party service providers, including 401(k) advisors, benefits administrators, insurance brokers, third-party administrators and HR consultants, which represent a significant source of referrals of potential clients for our products and implementation services. Failure to effectively manage our growth could adversely impact our business and results of operations. We could also suffer operational mistakes, a loss of business opportunities and employee losses. If our management is unable to\neffectively manage our growth, our expenses might increase more than expected, our revenue could decline or might grow more slowly than expected, and we might be unable to implement our business strategy.\nThe markets in which we participate are highly competitive, and if we do not compete effectively, our operating results could be adversely affected.\nThe market for payroll and HCM solutions is fragmented, highly competitive and rapidly changing. Our competitors vary for each of our solutions and primarily include payroll and HR service and software providers, such as Automatic Data Processing, Inc., Paychex, Inc., Paycom Software, Inc., Paycor, Inc., Ultimate Kronos Group and other local and regional providers.\nSeveral of our competitors are larger, have greater name recognition, longer operating histories and significantly greater resources than we do. Many of these competitors are able to devote greater resources to the development, promotion and sale of their products and services. Furthermore, our current or potential competitors may be acquired by third parties with greater available resources and the ability to initiate or withstand substantial price competition, which may include price concessions, delayed payment terms, or other terms and conditions that are more enticing to potential clients. As a result, our competitors may be able to develop products and services better received by our markets or may be able to respond more quickly and effectively than we can to new or changing opportunities, technologies, regulations, or client requirements.\nIn addition, current and potential competitors have established, and might in the future establish, partner or form other cooperative relationships with vendors of complementary products, technologies or services to enable them to offer new products and services, to compete more effectively or to increase the availability of their products in the marketplace. New competitors or relationships might emerge that have greater market share, a larger client base, more widely adopted proprietary technologies, greater marketing expertise, greater financial resources, and larger sales forces than we have, which could put us at a competitive disadvantage. In light of these advantages, current or potential clients might accept competitive offerings in lieu of purchasing our offerings. We expect competition to continue for these reasons, and such competition could negatively impact our sales, profitability or market share.\nIf we fail to manage our technical operations infrastructure, including operation of our data centers, our existing clients may experience service outages and our new clients may experience delays in the deployment of our modules.\nWe have experienced significant growth in the number of users, transactions and data that our operations infrastructure supports. We seek to maintain sufficient excess capacity in our data centers and other operations infrastructure to meet the needs of our clients. We also seek to maintain excess capacity to support new client deployments and the expansion of existing client deployments. In addition, we need to properly manage our technological operations infrastructure in order to support version control, changes in hardware and software parameters and the evolution of our modules. We may experience website disruptions, outages and other performance problems. These problems may be caused by a variety of factors, including infrastructure changes, human or software errors, viruses, security attacks, fraud, spikes in client usage and denial of service issues. In some instances, we may not be able to identify the cause or causes of these performance problems within an acceptable period of time. If we do not accurately predict our infrastructure requirements, our existing clients may experience service outages that may subject us to financial penalties, financial liabilities and client losses. If our operations infrastructure fails to keep pace with increased sales, clients may experience delays as we seek to obtain additional capacity, which could adversely affect our reputation and our revenues.\nIn addition, our ability to deliver our cloud-based modules depends on the development and maintenance of Internet infrastructure by third parties. This includes maintenance of a reliable network backbone with the necessary speed, data capacity, bandwidth capacity, and security. We may experience future interruptions and delays in services and availability from time to time. Any interruption may affect the availability, accuracy, or timeliness in our services and could damage our reputation, cause our clients to terminate their use of our software, require us to indemnify our clients against certain losses due to our own errors and prevent us from gaining additional business from current or future clients. In the event of a catastrophic event with respect to one or more of our systems, we may experience an\nextended period of system unavailability, which could negatively impact our relationship with clients. To operate without interruption, both we and our clients must guard against:\n● Damage from fire, power loss, natural disasters, pandemics and other force majeure events outside our control;\n● Communications failures;\n● Software and hardware errors, failures and crashes;\n● Security breaches, computer viruses, hacking, worms, malware, ransomware, denial-of-service attacks and similar disruptive problems; and\n● Other potential interruptions.\nWe use multiple cloud hosting and third-party data center providers to host our solutions, including data centers in Franklin Park, Illinois and Kenosha, Wisconsin (for backup and disaster recovery). We also may decide to employ additional offsite data centers in the future to accommodate growth. Problems faced by our data center locations (such as a hardware or other supply chain disruption), with the telecommunications network providers with whom we or they contract, or with the systems by which our telecommunications providers allocate capacity among their clients, including us, could adversely affect the availability and processing of our solutions and related services and the experience of our clients. If our data centers are unable to keep up with our growing needs for capacity, this could have an adverse effect on our business and cause us to incur additional expense. Any changes in service levels at our third-party data center or any errors, defects, disruptions or other performance problems with our modules could adversely affect our reputation and may damage our clients’ stored files or result in lengthy interruptions in our services. Interruptions in our services might reduce our revenues, subject us to potential liability or other expenses or adversely affect our renewal rates.\nIn addition, while we own, control and have access to our servers and all of the components of our network that are located in our backup data centers, we do not control the operation of these facilities. The operators of our third-party data center facilities have no obligation to renew their agreements with us on commercially reasonable terms, or at all. If we are unable to renew these agreements on commercially reasonable terms, or if the data center operators are acquired, we may be required to transfer our servers and other infrastructure to new data center facilities, and we may incur costs and experience service interruption in doing so.\nWe typically pay client employees and may pay taxing authorities amounts due for a payroll period before a client’s electronic funds transfers are finally settled to our account. If client payments are rejected by banking institutions or otherwise fail to clear into our accounts, we may require additional sources of short-term liquidity and our operating results could be adversely affected.\nOur payroll processing business involves the movement of significant funds from the account of a client to employees and relevant taxing authorities. Though we debit a client’s account prior to any disbursement on its behalf, due to Automated Clearing House, or ACH, banking regulations, funds previously credited could be reversed under certain circumstances and timeframes after our payment of amounts due to employees and taxing and other regulatory authorities. There is therefore a risk that the employer’s funds will be insufficient to cover the amounts we have already paid on its behalf. While such shortage and accompanying financial exposure has only occurred in very limited instances in the past, should clients default on their payment obligations in the future, we might be required to advance funds to cover such obligations. Depending on the magnitude of such an event, we may be required to seek additional sources of short-term liquidity, which may not be available on reasonable terms, if at all, and our operating results and our liquidity could be adversely affected and our banking relationships could be harmed.\nOur business could be negatively impacted by disruptions in the operations of third-party providers.\nWe rely on third-party couriers such as the United Parcel Service, or UPS, to ship printed checks to our clients, and any disruptions in their operations that impact their ability to successfully perform their tasks may negatively impact our business.\nWe also currently have agreements with eleven major U.S. banks to execute ACH and wire transfers to support our client payroll, benefit and tax services. If one or more of the banks fails to process ACH transfers on a timely basis, or at all, then our relationship with our clients could be harmed and we could be subject to claims by a client with respect to the failed transfers. In addition, these banks have no obligation to renew their agreements with us on commercially reasonable terms, if at all. If a material number of these banks terminate their relationships with us or restrict the dollar amounts of funds that they will process on behalf of our clients, their doing so may impede our ability to process funds and could have an adverse impact on our business.\nWe depend on our senior management team and other key employees, and the loss of these persons or an inability to attract and retain highly skilled employees, including product development, sales, implementation, client service and other technical persons, could adversely affect our business.\nOur success depends largely upon the continued services of our key executive officers. We also rely on our leadership team in the areas of product development, sales, client service, and general and administrative functions. From time to time, there may be changes in our executive management team resulting from the hiring or departure of executives, which could disrupt our business. While we have employment agreements with our executive officers, these employment agreements do not require them to continue to work for us for any specified period and, therefore, they could terminate their employment with us at any time. The loss of one or more of our executive officers or key employees could have an adverse effect on our business.\nWe believe that to grow our business and be successful, we must continue to develop products that are technologically advanced, are highly integrable with third-party services, provide significant mobility capabilities and have pleasing and intuitive user experiences. To do so, we must attract and retain highly qualified personnel, particularly employees with high levels of experience in designing and developing software. We must also identify, recruit and train qualified sales, client service and implementation personnel in the use of our software. The amount of time it takes for our sales representatives, client service and implementation personnel to be fully trained and to become productive varies widely. Competition for skilled employees across the United States and globally is intense. If we fail to attract new personnel or fail to retain and motivate our current personnel, our business and future growth prospects could be severely harmed. We follow a practice of hiring the best available candidates wherever located, but as we grow our business, the productivity of our product development and direct sales force may be adversely affected. In addition, if we hire employees from competitors or other companies, their former employers may attempt to assert that these employees have breached their legal obligations, resulting in a diversion of our time and resources.\nOur software might not operate properly, which could damage our reputation, give rise to claims against us, or divert application of our resources from other purposes, any of which could harm our business and operating results.\nOur payroll and HCM software is complex and may contain or develop undetected defects or errors, particularly when first introduced or as new versions are released. Despite extensive testing, from time to time, we have discovered defects or errors in our products. In addition, because changes in employer and legal requirements and practices relating to benefits, filing of tax returns and other regulatory reports are frequent, we may discover defects and errors in our software and service processes in the normal course of business compared against these requirements and practices. Defects and errors could also cause the information that we collect to be incomplete or contain inaccuracies that our clients, their employees and taxing and other regulatory authorities regard as significant.\nDefects and errors and any failure by us to identify and address them could result in delays in product introductions and updates, loss of revenue or market share, liability to clients or others, failure to achieve market acceptance or expansion, diversion of development and other resources, injury to our reputation, and increased service and maintenance costs. The costs incurred in correcting any defects or errors or in responding to resulting claims or liability might be substantial and could adversely affect our operating results. Our clients might assert claims against us in the future alleging that they suffered damages due to a defect, error, or other failure of our product or service processes. A product liability claim and errors or omissions claim could subject us to significant legal defense costs and adverse publicity regardless of the merits or eventual outcome of such a claim.\nOur agreements with our clients typically contain provisions intended to limit our exposure to such claims, but such provisions may not be effective in limiting our exposure. Contractual limitations we use may not be enforceable and may not provide us with adequate protection against product liability claims in certain jurisdictions. A successful claim for product or service liability brought against us could result in substantial cost to us and divert management’s attention from our operations. We also maintain insurance, but our insurance may be inadequate or may not be available in the future on acceptable terms, or at all. In addition, our policy may not cover all claims made against us and defending a suit, regardless of its merit, could be costly and divert management’s attention.\nIf third-party software used in our products is not adequately maintained or updated, our business could be materially adversely affected.\nSome of our products utilize certain third-party software. Although we believe that there are alternatives for these products, any significant interruption in the availability of such third-party software could have an adverse impact on our business unless and until we can replace the functionality provided by these products at a similar cost. Additionally, we rely, to a certain extent, upon such third parties’ abilities to enhance their current products, to develop new products on a timely and cost-effective basis and to respond to emerging industry standards and other technological changes. We may be unable to replace the functionality provided by the third-party software currently offered in conjunction with our products in the event that such software becomes obsolete or incompatible with future versions of our products or is otherwise not adequately maintained or updated.\nWe may acquire other companies or technologies, which could divert our management’s attention, result in additional dilution to our stockholders and otherwise disrupt our operations and adversely affect our operating results.\nWe have acquired and may in the future seek to acquire or invest in other businesses or technologies. The pursuit of potential acquisitions or investments may divert the attention of management and cause us to incur various expenses in identifying, investigating and pursuing suitable acquisitions, whether or not they are consummated.\nWe may not be able to integrate the acquired personnel, operations and technologies successfully, or effectively manage the combined business following the acquisition. Factors that may negatively impact our operating results, business and financial position, without limitation include the following:\n● Inability to integrate or benefit from acquired technologies, operations, or services in a profitable manner;\n● Unanticipated costs or liabilities associated with the acquisition;\n● Difficulty converting the clients of the acquired business onto our modules and contract terms, including disparities in the revenues, licensing, support or professional services model of the acquired company;\n● Diversion of management’s attention from other business concerns;\n● Adverse effects to our existing business relationships with business partners and clients as a result of the acquisition;\n● The potential loss of key employees;\n● Use of resources that are needed in other parts of our business;\n● Use of substantial portions of our available cash to consummate the acquisition; and\n● Dilutive issuances of equity securities or the incurrence of debt.\nIn addition, a significant portion of the purchase price of companies we acquire may be allocated to acquired goodwill and other intangible assets, which must be assessed for impairment at least annually. In the future, if our\nacquisitions do not yield expected returns, we may be required to take charges to our operating results based on this impairment assessment process, which could adversely affect our results of operations.\nRisks Related to Cybersecurity and Intellectual Property Rights\nIf our security measures are breached or unauthorized access to client data or funds is otherwise obtained, our solutions may be perceived as not being secure, clients may reduce the use of or stop using our solutions and we may incur significant liabilities.\nOur solutions involve the storage and transmission of our clients’ and their employees’ proprietary and confidential information. This information includes bank account numbers, tax return information, social security numbers, benefit information, retirement account information, payroll information, system passwords, and in the case of our benefit administration solution, BeneFLEX, health information protected by the Health Insurance Portability and Accountability Act of 1996, as amended, or HIPAA. In addition, we collect and maintain personal information on our own employees in the ordinary course of our business. Finally, our business involves the storage and transmission of funds from the accounts of our clients to their employees, taxing and regulatory authorities and others. As a result, unauthorized access or security breaches of our systems, the systems of our clients or use of confidential information we obtain during the normal course of our business could result in the unauthorized disclosure of confidential information, identity and financial theft, litigation, indemnity obligations and other significant liabilities. Because the techniques used to obtain unauthorized access or sabotage systems change frequently and generally are not identified until they are employed, we may be unable to anticipate these techniques or to implement adequate preventative measures in advance. As cyber threats continue to evolve, we are focused on ensuring that our operating environments safeguard and protect personal and business information. We may be required to invest significant additional resources to comply with evolving cybersecurity regulations and to modify and enhance our information security and controls, and to investigate and remediate any security vulnerabilities. We have security measures and controls in place to protect confidential information, prevent data loss, theft and other security breaches, including penetration tests of our systems by independent third parties. However, if our security measures are breached, our business could be substantially harmed, and we could incur significant liabilities. The costs of investigating, mitigating, and reporting such a breach to affected individuals (if required) can be substantial. In addition, if a high-profile security breach occurs with respect to an industry peer, our clients and potential clients may generally lose trust in the security of payroll and HCM modules. Any such breach or unauthorized access could negatively affect our ability to attract new clients, cause existing clients to terminate their agreements with us, result in reputational damage and subject us to lawsuits, regulatory fines or other actions or liabilities which could materially and adversely affect our business and operating results.\nThere can be no assurance that the limitations of liability in our contracts would be enforceable or adequate or would otherwise protect us from any such liabilities or damages with respect to any particular claim related to a breach or unauthorized access. We also cannot be sure that our existing general liability insurance coverage and coverage for errors or omissions will continue to be available on acceptable terms or will be available in sufficient amounts to cover one or more large claims, or that the insurer will not deny coverage as to any future claim. The successful assertion of one or more large claims against us that exceed available insurance coverage, or the occurrence of changes in our insurance policies, including premium increases or the imposition of large deductible or co-insurance requirements, could have a material adverse effect on our business, financial condition and results of operations.\nAny failure to protect our intellectual property rights could impair our ability to protect our proprietary technology and our brand.\nOur success is dependent, in part, upon protecting our proprietary technology. We rely on a combination of copyrights, trademarks, service marks, trade secret laws, and contractual restrictions to establish and protect our proprietary rights in our products and services. Our proprietary technologies are not covered by any patent or patent application. However, the steps we take to protect our intellectual property may be inadequate. We will not be able to protect our intellectual property if we are unable to enforce our rights or if we do not detect unauthorized use of our intellectual property. Despite our precautions, it may be possible for unauthorized third parties to copy our products and use information that we regard as proprietary to create products and services that compete with ours. Some license\nprovisions protecting against unauthorized use, copying, transfer and disclosure of our products may be unenforceable under the laws of certain jurisdictions and foreign countries.\nWe enter into confidentiality and invention assignment agreements with our employees and consultants and enter into confidentiality agreements with the parties with whom we have strategic relationships and business alliances. No assurance can be given that these agreements will be effective in controlling access to and distribution of our products and proprietary information. The confidentiality agreements on which we rely to protect certain technologies may be breached and may not be adequate to protect our proprietary technologies. Further, these agreements do not prevent our competitors from independently developing technologies that are substantially equivalent or superior to our solutions.\nIn order to protect our intellectual property rights, we may be required to spend significant resources, including cybersecurity resources, to monitor and protect these rights. Our intellectual property could be wrongfully acquired as a result of a cyberattack or other wrongful conduct by employees or third parties. Litigation may be necessary in the future to enforce our intellectual property rights and to protect our trade secrets. Litigation brought to protect and enforce our intellectual property rights could be costly, time consuming, and distracting to management and could result in the impairment or loss of portions of our intellectual property. Furthermore, our efforts to enforce our intellectual property rights may be met with defenses, counterclaims, and countersuits attacking the validity and enforceability of our intellectual property rights. Our inability to protect our proprietary technology against unauthorized copying or use, as well as any costly litigation or diversion of our management’s attention and resources, could delay further sales or the implementation of our solutions, impair the functionality of our solutions, delay introductions of new solutions, result in our substituting inferior or more costly technologies into our solutions, or damage our reputation. In addition, we may be required to license additional technology from third parties to develop and market new solutions, and we cannot assure you that we could license that technology on commercially reasonable terms, or at all. Although we do not expect that our inability to license this technology in the future would have a material adverse effect on our business or operating results, our inability to license this technology could adversely affect our ability to compete.\nWe may be sued by third parties for alleged infringement of their proprietary rights.\nThere is considerable patent and other intellectual property development activity in our industry. Our success depends, in part, upon our not infringing upon the intellectual property rights of others. Our competitors, as well as a number of other entities and individuals, may own or claim to own intellectual property relating to our industry. From time to time, third parties may claim that we are infringing upon their intellectual property rights, and we may be found to be infringing upon such rights. In the future, others may claim that our modules and underlying technology infringe or violate their intellectual property rights. However, we may be unaware of the intellectual property rights that others may claim cover some or all of our technology or services. Any claims or litigation could cause us to incur significant expenses and, if successfully asserted against us, could require that we pay substantial damages or ongoing royalty payments, prevent us from offering our services, or require that we comply with other unfavorable terms. In connection with any such claim or litigation, we may also be obligated to indemnify our clients or business partners or pay substantial settlement costs, including royalty payments, and to obtain licenses, modify applications, or refund fees, which could be costly. Even if we were to prevail in such a dispute, any litigation regarding our intellectual property could be costly and time-consuming and divert the attention of our management and key personnel from our business operations.\nThe use of open source software in our products and solutions may expose us to additional risks and harm our intellectual property rights.\nSome of our products and solutions use or incorporate software that is subject to one or more open source licenses. Open source software is typically freely accessible, usable and modifiable. Certain open source software licenses require a user who intends to distribute the open source software as a component of the user’s software to disclose publicly part or all of the source code to the user’s software. In addition, certain open source software licenses require the user of such software to make any derivative works of the open source code available to others on potentially unfavorable terms or at no cost.\nThe terms of many open source licenses to which we are subject have not been interpreted by U.S. or foreign courts. Accordingly, there is a risk that those licenses could be construed in a manner that imposes unanticipated conditions or restrictions on our ability to commercialize our solutions. In that event, we could be required to seek licenses from third parties in order to continue offering our products or solutions, to re-develop our products or solutions, to discontinue sales of our products or solutions, or to release our proprietary software code under the terms of an open source license, any of which could harm our business. Further, given the nature of open source software, it may be more likely that third parties might assert copyright and other intellectual property infringement claims against us based on our use of these open source software programs.\nWhile we monitor the use of all open source software in our products, solutions, processes and technology and try to ensure that no open source software is used in such a way as to require us to disclose the source code to the related product or solution when we do not wish to do so, it is possible that such use may have inadvertently occurred in deploying our proprietary solutions. In addition, if a third-party software provider has incorporated certain types of open source software into software we license from such third party for our products and solutions without our knowledge, we could, under certain circumstances, be required to disclose the source code to our products and solutions. This could harm our intellectual property position and our business, results of operations and financial condition.\nRisks Related to Legal and Regulatory Matters\nPrivacy concerns and laws or other domestic regulations may increase the cost of our solutions or reduce the effectiveness of our modules and adversely affect our business.\nOur clients collect, use and store personal or identifying information regarding their employees and their family members in our solutions. Federal and state government bodies and agencies have adopted, are considering adopting, or may adopt laws and regulations regarding the collection, use, storage and disclosure of such personal information. In addition, HIPAA, as amended by the Health Information Technology for Economic and Clinical Health Act, and its implementing regulations, applies to our benefit administration solution, BeneFLEX, as a business associate. The costs of compliance with, and other burdens imposed by, such laws and regulations that are applicable to our clients’ businesses may limit the use and adoption of our modules and reduce overall demand, or lead to significant fines, penalties or liabilities for any noncompliance with such privacy laws. Even the perception of privacy concerns, whether or not valid, may inhibit market adoption of our solutions.\nAdditionally, we expect that existing laws, regulations, and standards may be interpreted in new and differing manners in the future and may be inconsistent among jurisdictions. Future laws, regulations, standards, and other obligations, and changes in the interpretation of existing laws, regulations, standards, and other obligations could result in increased regulation, increased costs of compliance and penalties for non-compliance, and limitations on data collection, use, disclosure, and transfer for Paylocity and our clients. In 2016 the EU adopted a new regulation governing data privacy called the General Data Protection Regulation (“GDPR”), which became effective in May 2018. The GDPR establishes new requirements applicable to the handling of personal data and imposes penalties for non-compliance of up to 4% of worldwide revenue. California also enacted legislation, the California Consumer Privacy Act of 2018 (“CCPA”), effective as of January 1, 2020, and the California Privacy Rights Act (“CPRA”), which expands upon the CCPA, passed in November 2020, that affords California residents expanded privacy protections and a private right of action for security breaches affecting their personal information. In addition, the Illinois Biometric Information Privacy Act regulates the collection, use, safeguarding and storage of “biometric identifiers” or “biometric information” by private entities, and provides a private right of action of persons who are aggrieved by violations of the regulation. All of these legislative and regulatory initiatives may adversely affect our clients’ ability to process, handle, store, use and transmit demographic and personal information regarding their employees and family members, which could reduce demand for our solutions.\nIn addition to government activity, privacy advocacy groups and the technology and other industries are considering various new, additional or different self-regulatory standards that may place additional burdens on us. If the processing of personal information were to be curtailed in this manner, our products would be less effective, which may reduce demand for our modules and adversely affect our business.\nIf third parties we work with violate applicable laws or regulations or our policies, such violations may also put our clients’ content at risk and could in turn have an adverse effect on our business. Any significant change to applicable laws, regulations, or industry practices regarding the collection, use, retention, security, or disclosure of our clients’ content, or regarding the manner in which the express or implied consent of clients for the collection, use, retention, or disclosure of such content is obtained, could increase our costs and require us to modify our services and features, possibly in a material manner, which we may be unable to complete, and may limit our ability to store and transmit client data or develop new services and features.\nAdverse tax laws or regulations could be enacted or existing laws could be applied to us or our clients, which could increase the costs of our services and adversely impact our business.\nThe application of federal, state, and local tax laws to services provided electronically often involve complex issues and significant judgment. New or changes to existing income, sales, use or other tax laws, statutes, rules, regulations or ordinances could be enacted at any time, possibly with retroactive effect, and could be applied solely or disproportionately to services provided over the Internet. These enactments could adversely affect our business, results of operations and financial condition due to the inherent cost increase.\nMoreover, each state has different rules and regulations governing sales and use taxes, and these rules and regulations are subject to varying interpretations that change over time. We review these rules and regulations periodically and, when we believe we are subject to sales and use taxes in a particular state, we may voluntarily engage state tax authorities to determine how to comply with that state’s rules and regulations. We cannot, however, assure you that we will not be subject to sales and use taxes or related penalties for past sales in states where we currently believe no such taxes are required. If one or more taxing authorities determines that taxes should have, but have not, been paid with respect to our services, we might be liable for past taxes and the associated interest and penalty charges, in addition to taxes going forward, which will adversely affect our business, sales activity, results of operations and financial condition.\nAny future litigation against us could be costly and time-consuming to defend.\nWe may become subject, from time to time, to legal proceedings and claims that arise in the ordinary course of business such as claims brought by our clients in connection with commercial disputes, employment claims made by our current or former employees, or lawsuits related to breaches of personal information. Litigation might result in substantial costs and may divert management’s attention and resources, which might seriously harm our business, overall financial condition, and operating results. Insurance might not cover such claims, might not provide sufficient payments to cover all the costs to resolve one or more such claims and might not continue to be available on terms acceptable to us. A claim brought against us that is uninsured or underinsured could result in unanticipated costs, thereby harming our operating results and leading analysts or potential investors to lower their expectations of our performance, which could reduce the trading price of our stock.\nRisks Related to Financial Matters\nCertain of our debt agreements contain covenants that may constrain the operation of our business, and our failure to comply with these covenants could have a material adverse effect on our financial condition.\nThe five-year revolving credit agreement that we entered into in July 2019 contains restrictive covenants including restrictions regarding the incurrence of liens and indebtedness, substantial changes in the general nature of our business and our subsidiaries (taken as a whole), certain merger transactions, certain sales of assets and other matters, all subject to certain exceptions. Failure to comply with these covenants could have a negative impact on our business and financial condition.\nCorporate investments and client funds that we hold are subject to market, interest rate, credit and liquidity risks. The loss of these funds could have an adverse impact on our business.\nWe invest portions of excess cash and cash equivalents and funds held for our clients in liquid, investment-grade marketable securities such as corporate bonds, commercial paper, asset-backed securities, U.S. treasury securities, money market securities, and other cash equivalents. We follow an established investment policy and set of guidelines to monitor and help mitigate our exposure to liquidity and credit risks. Nevertheless, our corporate investments and client fund assets are subject to general market, interest rate, credit, and liquidity risks. These risks may be exacerbated, individually or in unison, during periods of unusual financial market volatility. Any loss of or inability to access our corporate investments or client funds could have adverse impacts on our business, results of operations, financial condition and liquidity.\nIn addition, funds held for clients are deposited in consolidated accounts on behalf of our clients, and as a result, the aggregate amounts in the accounts exceed the applicable federal deposit insurance limits. We believe that since such funds are deposited in trust on behalf of our clients, the Federal Deposit Insurance Corporation, or the FDIC, would treat those funds as if they had been deposited by each of the clients themselves and insure each client’s funds up to the applicable deposit insurance limits. If the FDIC were to take the position that it is not obligated to provide deposit insurance for our clients’ funds or if the reimbursement of these funds were delayed, our business and our clients could be materially harmed.\nOur reported financial results may be adversely affected by changes in accounting principles generally accepted in the United States.\nGenerally accepted accounting principles in the United States are subject to interpretation by the Financial Accounting Standards Board, or FASB, the Securities and Exchange Commission, or SEC, and various bodies formed to promulgate and interpret appropriate accounting principles. A change in these principles or interpretations could have a significant effect on our reported financial results, including increased volatility, and could affect the reporting of transactions completed before the announcement of a change. Our accounting policies that have been or may be affected by changes in accounting principles include, but are not limited to, revenue recognition and accounting for leases.\nRisks Related to Ownership of Our Common Stock\nInsiders have substantial control over us, which may limit our stockholders’ ability to influence corporate matters and delay or prevent a third party from acquiring control over us.\nAs of July 30, 2021, our directors, executive officers and holders of more than 5% of our common stock, together with their respective affiliates, beneficially owned, in the aggregate, approximately 29.1% of our outstanding common stock. This significant concentration of ownership may adversely affect the trading price for our common stock because investors often perceive disadvantages in owning stock in companies with controlling stockholders. In addition, these stockholders will be able to exercise influence over all matters requiring stockholder approval, including the election of directors and approval of corporate transactions, such as a merger or other sale of our company or its assets. This concentration of ownership could limit the ability of our other stockholders to influence corporate matters and may have the effect of delaying or preventing a change in control, including a merger, consolidation, or other business combination involving us, or discouraging a potential acquirer from making a tender offer or otherwise attempting to obtain control, even if that change in control would benefit our other stockholders.\nOur stock price may be subject to wide fluctuations.\nThe market price of our common stock has experienced, and may continue to experience, wide fluctuations and increased volatility. Factors that may impact our performance and market price include those discussed elsewhere in this “Risk Factors” section of this Annual Report on Form 10-K and others such as:\n● Our operating performance and the operating performance of similar companies;\n● Announcements by us or our competitors of acquisitions, business plans or commercial relationships;\n● Any major change in our board of directors or senior management;\n● Publication of research reports or news stories about us, our competitors, or our industry, or positive or negative recommendations or withdrawal of research coverage by securities analysts;\n● The public’s reaction to our press releases, our other public announcements and our filings with the SEC;\n● Sales of our common stock by our directors, executive officers and affiliates;\n● Adverse market reaction to any indebtedness we may incur or securities we may issue in the future;\n● Short sales, hedging and other derivative transactions in our common stock;\n● Threatened or actual litigation;\n● Public health issues such as the COVID-19 pandemic; and\n● Other events or factors, including changes in general conditions in the United States and global economies or financial markets (including acts of God, war, incidents of terrorism, or other destabilizing events and the resulting responses to them).\nIn addition, the stock market in general and the market for software or technology-related companies in particular, have experienced extreme price and volume fluctuations that have often been unrelated or disproportionate to the operating performance of those companies. Securities class action litigation has often been instituted against companies following periods of volatility in the overall market and in the market price of a company’s securities. This litigation, if instituted against us, could result in substantial costs, divert our management’s attention and resources, and harm our business, operating results, and financial condition.\nWe do not currently intend to pay dividends on our common stock and, consequently, your ability to achieve a return on your investment will depend on appreciation in the price of our common stock.\nWe have not declared or paid dividends on our common stock in the past three fiscal years and do not currently intend to do so for the foreseeable future. We currently intend to invest our future earnings to fund our growth and other corporate initiatives. Therefore, you are not likely to receive any dividends on your common stock for the foreseeable future, and the success of an investment in shares of our common stock will depend upon future appreciation in its value, if any. There is no guarantee that shares of our common stock will appreciate in value or even maintain the price at which our stockholders purchased their shares.\nFuture sales of shares of our common stock by existing stockholders could depress the market price of our common stock.\nAs of July 30, 2021, we had an aggregate of 54,601,434 outstanding shares of common stock. The 17,362,750 shares sold in our initial public offering, follow-on offering and secondary offering can be freely sold in the public market without restriction. The remaining shares can be freely sold in the public market, subject in some cases to volume and other restrictions under Rule 144 and 701 under the Securities Act of 1933, as amended, and various agreements.\nIn addition, we have registered 19,253,893 shares of common stock that we have issued and may issue under our equity plans. These shares can be freely sold in the public market upon issuance, subject in some cases to volume and other restrictions under Rules 144 and 701 under the Securities Act, and various vesting agreements. In addition, some of our employees, including our executive officers, have entered into 10b5-1 trading plans regarding sales of shares of our common stock. These plans provide for sales to occur from time to time. If any of these additional shares are sold, or if it is perceived that they will be sold, in the public market, the trading price of our common stock could decline.\nAlso, in the future, we may issue additional securities in connection with investments and acquisitions. The amount of our common stock issued in connection with an investment or acquisition could constitute a material portion\nof our then outstanding stock. Due to these factors, sales of a substantial number of shares of our common stock in the public market could occur at any time. These sales, or the perception in the market that the holders of a large number of shares intend to sell shares, could reduce the market price of our common stock.\nAnti-takeover provisions in our charter documents and Delaware law could discourage, delay, or prevent a change in control of our company and may affect the trading price of our common stock.\nWe are a Delaware corporation and the anti-takeover provisions of the Delaware General Corporation Law, which apply to us, may discourage, delay or prevent a change in control by prohibiting us from engaging in a business combination with an interested stockholder for a period of three years after the stockholder becomes an interested stockholder, even if a change in control would be beneficial to our existing stockholders. In addition, our amended and restated certificate of incorporation and amended and restated bylaws may discourage, delay or prevent a change in our management or control over us that stockholders may consider favorable. Our amended and restated certificate of incorporation and bylaws:\n● Authorize the issuance of “blank check” convertible preferred stock that could be issued by our board of directors to thwart a takeover attempt;\n● Establish a classified board of directors, as a result of which the successors to the directors whose terms have expired will be elected to serve from the time of election and qualification until the third annual meeting following their election;\n● Require that directors only be removed from office for cause and only upon a supermajority stockholder vote;\n● Provide that vacancies on the board of directors, including newly-created directorships, may be filled only by a majority vote of directors then in office rather than by stockholders;\n● Prevent stockholders from calling special meetings; and\n● Prohibit stockholder action by written consent, requiring all actions to be taken at a meeting of the stockholders.\nOur bylaws provide that the state and federal courts located within the state of Delaware are the sole and exclusive forums for certain legal actions involving the company or our directors, officers and employees.\nOn February 2, 2016, we amended our bylaws to designate the state and federal courts located within the state of Delaware as the sole and exclusive forums for claims arising derivatively, pursuant to the Delaware General Corporation Law or governed by the internal affairs doctrine. The choice of forum provision is expressly authorized by the Delaware General Corporation Law, which was amended so that companies would not have to litigate internal claims in more than one jurisdiction. If a court were to find the exclusive forum provision contained in our bylaws to be inapplicable or unenforceable, we may incur additional costs associated with resolving such extra-forum claims, which could adversely affect our business and financial condition. This bylaws provision, therefore, may dissuade or discourage claimants from initiating lawsuits or claims against us or our directors and officers in forums other than Delaware.\nGeneral Risk Factors\nOur business, results of operations and financial condition have been, and will continue to be, adversely impacted by the uncertainties and consequences stemming from the COVID-19 pandemic.\nThe spread of COVID-19 has continued to cause economic and individual uncertainty and disruption across the country and world. Many of our clients have also been unfavorably impacted by the COVID-19 pandemic, which is outside of our control, and as a result some clients have reduced employee headcount. If a significant number of our clients are unable to continue as viable businesses or otherwise are required to further reduce headcount, or we experience longer sales cycles, reduced demand for our solutions, clients failing to pay us under the terms of our agreements, lower renewal rates by our clients and increased competition, such factors could have an adverse impact on\nour business and financial condition. If the COVID-19 pandemic has a prolonged substantial impact on our employees, partners or clients, our results of operations and overall financial performance may be unfavorably impacted.\nOur business depends on the overall demand for payroll and HCM software and services, and on the economic health of our current and prospective clients. The impacts of the COVID-19 pandemic on our business, clients, partners, employees, markets and financial results and condition are uncertain, evolving and dependent on numerous unpredictable factors outside of our control, including:\n● The spread, duration and severity of the pandemic as a public health matter and its impact on governments, businesses, society, our clients, our partners and our business;\n● The measures being taken by governments, businesses and society in response to the pandemic and their effectiveness, including the effectiveness of vaccine availability, distribution and adoption;\n● The scope and effectiveness of fiscal and monetary stimulus programs (such as the Payroll Protection Program) and other legislative and regulatory measures being implemented by federal, state and local governments;\n● The increase in business failures among our clients and other businesses;\n● The pace and extent to which our clients and other businesses recover and add employees and other compensated individuals; and\n● The willingness of current and prospective clients to invest in our products and services.\nAny of these factors may impact our business unfavorably. While economic conditions have begun improving as vaccine distribution has accelerated in the United States, there can be no assurance that the economic recovery will continue or offset the uncertainty and instability resulting from the COVID-19 pandemic. Even after the COVID-19 pandemic has subsided, we may continue to experience adverse impacts to our business as a result of its global economic impact, including any recession, economic downturn, or increased unemployment that has occurred or may occur in the future.\nIf we are unable to maintain effective internal controls over financial reporting, investors may lose confidence in the accuracy and completeness of our financial reports and the market price of our common stock may be negatively affected.\nAs a public company, we are required to maintain internal controls over financial reporting and to report any material weaknesses in such internal controls. Section 404 of the Sarbanes-Oxley Act of 2002, or the Sarbanes-Oxley Act, requires that we evaluate and determine the effectiveness of our internal controls over financial reporting and provide a management report on the internal controls over financial reporting. In addition, the Sarbanes-Oxley Act requires that our management report on the internal controls over financial reporting be attested to by our independent registered public accounting firm. If we have a material weakness in our internal controls over financial reporting, we may not detect errors on a timely basis and our financial statements may be materially misstated. Compliance with these public company requirements has made some activities more time-consuming, costly and complicated. If we identify material weaknesses in our internal controls over financial reporting, if we are unable to assert that our internal controls over financial reporting are effective, or if our independent registered public accounting firm is unable to express an opinion as to the effectiveness of our internal controls over financial reporting, investors may lose confidence in the accuracy and completeness of our financial reports and the market price of our common stock could be negatively affected, and we could become subject to investigations by the stock exchange on which our securities are listed, the SEC or other regulatory authorities, which could require additional financial and management resources.",
    "item_1B": "Item 1B. Unresolved Staff Comments.\nNone.",
    "item_2": "Item 2. Properties.\nAs of June 30, 2021, our corporate headquarters occupied approximately 326,000 square feet in Schaumburg, Illinois under leases with final expiration in October 2032. We also utilize office spaces consisting of approximately 92,000 square feet in Lake Mary, Florida and approximately 69,000 square feet in Meridian, Idaho as other major operations centers. We lease other smaller facilities across the U.S. that serve as data centers, sales offices and distribution centers.\nFor additional information regarding obligations under operating leases, see Note 12 of the Notes to the Consolidated Financial Statements included in Part II, Item 8: “Financial Statements and Supplementary Data” of this Annual Report on Form 10-K.",
    "item_3": "Item 3. Legal Proceedings.\nFrom time to time, we may become involved in litigation related to claims arising from the ordinary course of our business. We believe that there are no claims or actions pending or threatened against us, the ultimate disposition of which would have a material adverse effect on us.",
    "item_4": "Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II",
    "item_5": "Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nOur common stock is listed on the NASDAQ Global Select Market under the symbol “PCTY”.\nOn July 30, 2021, the last reported sale price of our common stock on the NASDAQ Global Select Market was $207.46 per share, and there were 13 holders of record of our common stock. The actual number of holders of common stock is greater than these numbers of record holders and includes stockholders who are beneficial owners, but whose shares are held in street name by brokers and nominees. The number of holders of record also does not include stockholders whose shares may be held in trust by other entities.\nUse of Proceeds from Initial Public Offering of Common Stock\nOn March 24, 2014, we completed our initial public offering, or IPO, of 8,101,750 shares of common stock, at a price of $17.00 per share, before underwriting discounts and commissions. We sold 5,366,667 of such shares and existing shareholders sold an aggregate of 2,735,083 of such shares. The offer and sale of all of the shares in the IPO were registered under the Securities Act pursuant to a registration statement on Form S-1 (File No. 333-193661), which was declared effective by the SEC on March 18, 2014.\nWith the proceeds of the IPO, we repaid amounts outstanding under a note issued by us to Commerce Bank & Trust Company on March 9, 2011, which totaled $1.1 million, paid $9.4 million for the purchase of substantially all of the assets of BFKMS Inc., and paid $9.5 million for the purchase of substantially all of the assets of Synergy Payroll LLC.\nUse of Proceeds from Follow-On Offering of Common Stock\nOn December 17, 2014, we completed a follow-on offering of 4,960,000 shares of common stock at a price of $26.25 per share, before underwriting discounts and commissions. We sold 750,000 of such shares and existing shareholders sold an aggregate of 4,210,000 of such shares. The offer and sale of all of the shares in the follow-on offering were registered under the Securities Act pursuant to a registration statement on Form S-1 (File No. 333-200448) which was declared effective by the SEC on December 11, 2014. There have been no material changes in the planned use of proceeds from the follow-on offering as described in the final prospectus filed with the SEC pursuant to Rule 424(b) on December 12, 2014.\nUse of Proceeds from Secondary Offering of Common Stock\nOn September 30, 2015, we completed a secondary offering of 4,301,000 shares of common stock at a price of $29.75 per share, before underwriting discounts and commissions. The offer and sale of all of the shares in the secondary offering were registered under the Securities Act pursuant to a registration statement on Form S-3 (File No. 333-206941) which was declared effective by the SEC on September 25, 2015. The Company did not receive any proceeds from the sale of common stock, as all the shares were sold by shareholders of the Company.\nDividend Policy\nWe have not declared or paid dividends on our common stock since our IPO. Neither Delaware law nor our amended and restated certificate of incorporation requires our board of directors to declare dividends on our common stock. Any future determination to declare cash dividends on our common stock will be made at the discretion of our board of directors and will depend on our financial condition, results of operations, capital requirements, general business conditions and other factors that our board of directors may deem relevant. We do not anticipate paying cash dividends on our common stock for the foreseeable future.\nEquity Compensation Plan Information\nInformation regarding the securities authorized for issuance under our equity compensation plans will be included in our Proxy Statement relating to our 2022 annual meeting of stockholders to be filed with the SEC within 120 days after the end of our fiscal year ended June 30, 2021 and is incorporated herein by reference.\nPerformance Graph\nNotwithstanding any statement to the contrary in any of our filings with the SEC, the following information shall not be deemed “filed” with the SEC or “soliciting material” under the Securities Exchange Act of 1934 and shall not be incorporated by reference into any such filings irrespective of any general incorporation language contained in such filing.\nThe following graph compares the total cumulative stockholder return on our common stock with the total cumulative return of the S&P 500 Index and the S&P 1500 Application Software Index during the period commencing on June 30, 2016 and ending on June 30, 2021. The graph assumes that $100 was invested at the beginning of the period in our common stock and in each of the comparative indices, and the reinvestment of any dividends. Historical stock price performance should not be relied upon as an indication of future stock price performance.",
    "item_6": "Item 6. [Reserved]",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nThe statements included herein that are not based solely on historical facts are “forward looking statements.” Such forward-looking statements are based on current expectations and assumptions that are subject to risks and uncertainties. Our actual results could differ materially from those anticipated by us in these forward-looking statements as a result of various factors, including those discussed below and under Part I, Item 1A. “Risk Factors.”\nThe following discussion of our financial condition and results of operations covers fiscal 2021 and 2020 items and year-over-year comparisons between fiscal 2021 and 2020. Discussion of fiscal 2019 items and year-over-year comparisons between fiscal 2020 and 2019 that are not included in this Form 10-K can be found in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended June 30, 2020 that was filed with the SEC on August 7, 2020.\nOverview\nWe are a cloud-based provider of payroll and human capital management (“HCM”) software solutions. Our comprehensive product suite delivers a unified platform to create a modern workplace for our clients through automation, data-driven insights and engagement. Our product suite enables professionals to make strategic decisions in the areas of payroll, human capital management, workforce management, talent management, benefits, modern workforce solutions and analytics & insights, all while promoting a modern workplace and improving employee engagement.\nEffective management of human capital is a core function in all organizations and requires a significant commitment of resources. We believe payroll is the most critical system of record for organizations and an essential gateway to other HCM functionalities. We designed our cloud-based platform to provide a unified suite of modules using a multi-tenant architecture. Our solutions are highly flexible and configurable and feature a modern, intuitive user experience. Our platform offers automated data integration with over 400 related third-party systems, such as 401(k), benefits and insurance provider systems. We have invested in, and we intend to continue to invest in, research and development to expand our product offerings and advance our platform.\nWe believe there is a significant opportunity to grow our business by increasing our number of clients and we intend to invest in our business to achieve this purpose. We market and sell our solutions through our direct sales force. We have increased our sales and marketing expenses as we have added sales representatives and related sales and marketing personnel. We intend to continue to grow our sales and marketing organization across new and existing geographic territories. In addition to growing our number of clients, we intend to grow our revenue over the long term by increasing the number and quality of products that clients purchase from us. To do so, we must continue to enhance and grow the number of solutions we offer to advance our platform.\nWe also believe that delivering a positive service experience is an essential element of our ability to sell our solutions and retain our clients. We seek to develop deep relationships with our clients through our unified service model, which has been designed to meet the service needs of mid-market organizations. We expect to continue to invest in and grow our implementation and client service organization as our client base grows.\nIn order to continue to grow our business over the long term, we will continue to invest, across our entire organization. These investments include increasing the number of personnel across all functional areas, along with improving our solutions and infrastructure to support our growth. The timing and amount of these investments vary based on the rate at which we add new clients, add new personnel and scale our application development and other activities. Many of these investments will occur in advance of experiencing any direct benefit from them, which will make it difficult to determine if we are effectively allocating our resources. We expect these investments to increase our costs on an absolute basis, but as we grow our number of clients and our related revenues, we anticipate that we will gain economies of scale and increased operating leverage. As a result, we expect our gross and operating margins will improve over the long term.\nPaylocity Holding Corporation is a Delaware corporation, which was formed in November 2013. Our business operations are conducted by our wholly owned subsidiaries.\nCOVID-19 Impact\nIn March 2020, the World Health Organization declared the outbreak of the novel coronavirus disease (“COVID-19”) as a pandemic which has caused a global slowdown of economic activity. The duration and severity of the COVID-19 pandemic, and the long-term effects the pandemic will have on our clients and general economic conditions, remain uncertain and difficult to predict. Many of our prospective and existing clients’ businesses have been impacted by stay-at-home, business closure and other restrictive orders, which has resulted in reduced employee headcount, temporary and permanent business closures, and/or delayed sales/starts. Our business and financial performance may continue to be unfavorably impacted in future periods by a reduction in client employee counts, reduction in business confidence and activity, a decrease in payroll and HCM solutions spending by organizations, the pace of the macro-economic recovery or a continued low interest rate environment, among other factors. Refer to “Item 1A. Risk Factors” in this Annual Report on Form 10-K for risks related to the COVID-19 pandemic to our business and financial performance.\nKey Metrics\nWe regularly review a number of metrics, including the following key metrics, to evaluate our business, measure our performance, identify trends affecting our business, formulate financial projections and make strategic decisions.\nRevenue Growth\nOur recurring revenue model and high annual revenue retention rates provide significant visibility into our future operating results and cash flow from operations. This visibility enables us to better manage and invest in our business. Total revenues increased from $467.6 million in fiscal 2019 to $561.3 million in fiscal 2020, representing a 20% year-over-year increase. Total revenues increased from $561.3 million in fiscal 2020 to $635.6 million in fiscal 2021, representing a 13% year-over-year increase. During fiscal 2021, total revenue growth was impacted by the ongoing effects from the COVID-19 pandemic. Our revenue growth in future periods may continue to be impacted by a reduction in client employee counts, potential increases in client losses, a continued low interest rate environment and the pace of the macro-economic recovery, among other factors.\nClient Count Growth\nWe believe there is a significant opportunity to grow our business by increasing our number of clients. Excluding clients acquired through acquisitions, we have increased the number of clients using our payroll and HCM software solutions from approximately 20,200 as of June 30, 2019 to approximately 28,750 as of June 30, 2021, representing a compound annual growth rate of approximately 19%. The table below sets forth the total number of clients using our payroll and HCM software solutions for the periods indicated, rounded to the nearest fifty.\nYear Ended June 30,\nClient Count\n20,200\n24,450\n28,750\nThe rate at which we add clients is highly variable period-to-period and highly seasonal as many clients switch solutions during the first calendar quarter of each year. Although many clients have multiple divisions, segments or locations, we only count such clients once for these purposes.\nAnnual Revenue Retention Rate\nOur annual revenue retention rate has been in excess of 92% during each of the past three fiscal years. We calculate our annual revenue retention rate as our total revenue for the preceding 12 months, less the annualized value of revenue lost during the preceding 12 months, divided by our total revenue for the preceding 12 months. We calculate the annualized value of revenue lost by summing the recurring fees paid by lost clients over the previous twelve months\nprior to their termination if they have been a client for a minimum of twelve months. For those lost clients who became clients within the last twelve months, we sum the recurring fees for the period that they have been a client and then annualize the amount. We exclude interest income on funds held for clients from the revenue retention calculation. We believe that our annual revenue retention rate is an important metric to measure overall client satisfaction and the general quality of our product and service offerings.\nAdjusted Gross Profit and Adjusted EBITDA\nWe use Adjusted Gross Profit and Adjusted EBITDA to evaluate our operating results. We prepare Adjusted Gross Profit and Adjusted EBITDA to eliminate the impact of items we do not consider indicative of our ongoing operating performance. However, Adjusted Gross Profit and Adjusted EBITDA are not measurements of financial performance under generally accepted accounting principles in the United States, or GAAP, and these metrics may not be comparable to similarly titled measures of other companies.\nWe define Adjusted Gross Profit as gross profit before amortization of capitalized internal-use software costs and stock-based compensation expense and employer payroll taxes related to stock releases and option exercises. We define Adjusted EBITDA as net income before interest expense, income tax expense (benefit), depreciation and amortization expense, stock-based compensation expense and employer payroll taxes related to stock releases and option exercises, and other items as defined below.\nWe disclose Adjusted Gross Profit and Adjusted EBITDA, which are non-GAAP measures, because we believe these metrics assist investors and analysts in comparing our performance across reporting periods on a consistent basis by excluding items that we do not believe are indicative of our core operating performance. We believe these metrics are commonly used in the financial community to aid in comparisons of similar companies, and we present them to enhance investors’ understanding of our operating performance and cash flows.\nAdjusted Gross Profit and Adjusted EBITDA have limitations as analytical tools. Some of these limitations include the following:\n●Adjusted EBITDA does not reflect our ongoing or future requirements for capital expenditures;\n● Adjusted EBITDA does not reflect changes in, or cash requirements for, our working capital needs;\n● Adjusted EBITDA does not reflect our income tax expense or the cash requirement to pay our taxes;\n● Although depreciation and amortization are non-cash charges, the assets being depreciated and amortized may have to be replaced in the future, and Adjusted EBITDA does not reflect any cash requirements for such replacements; and\n● Other companies in our industry may calculate Adjusted Gross Profit and Adjusted EBITDA differently than we do, limiting their usefulness as a comparative measure.\nAdditionally, stock-based compensation will continue to be an element of our overall compensation strategy, although we exclude it from Adjusted Gross Profit and Adjusted EBITDA as an expense when evaluating our ongoing operating performance for a particular period.\nBecause of these limitations, you should not consider Adjusted Gross Profit as an alternative to gross profit or Adjusted EBITDA as an alternative to net income or net cash provided by operating activities, in each case as determined in accordance with GAAP. We compensate for these limitations by relying primarily on our GAAP results, and we use Adjusted Gross Profit and Adjusted EBITDA only as supplemental information.\nDirectly comparable GAAP measures to Adjusted Gross Profit and Adjusted EBITDA are gross profit and net income, respectively. We reconcile Adjusted Gross Profit and Adjusted EBITDA as follows:\nYear Ended June 30,\n(in thousands)\nAdjusted Gross Profit\n$\n336,247\n$\n404,797\n$\n447,904\nAdjusted EBITDA\n$\n134,047\n$\n159,775\n$\n170,028\nYear Ended June 30,\n(in thousands)\nReconciliation from Gross Profit to Adjusted Gross Profit\nGross profit\n$\n313,782\n$\n379,319\n$\n416,329\nAmortization of capitalized internal-use software costs\n16,921\n19,261\n23,227\nStock-based compensation expense and employer payroll taxes related to stock releases and option exercises\n5,544\n6,217\n8,348\nAdjusted Gross Profit\n$\n336,247\n$\n404,797\n$\n447,904\nYear Ended June 30,\n(in thousands)\nReconciliation from Net Income to Adjusted EBITDA\nNet income\n$\n53,823\n$\n64,455\n$\n70,819\nInterest expense\n-\n1,002\nIncome tax expense (benefit)\n4,223\n2,663\n(13,715)\nDepreciation and amortization expense\n34,564\n37,913\n42,972\nEBITDA\n92,610\n105,726\n101,078\nStock-based compensation expense and employer payroll taxes related to stock releases and option exercises\n41,014\n50,364\n67,059\nOther items*\n3,685\n1,891\nAdjusted EBITDA\n$\n134,047\n$\n159,775\n$\n170,028\n* Represents nonrecurring costs including lease exit and acquisition-related costs of $0.4 million, $1.6 million and $1.9 million incurred during the years ended June 30, 2019, 2020 and 2021, respectively, and the settlement of a certain legal matter and related litigation costs of $2.1 million during the year ended June 30, 2020.\nBasis of Presentation\nRevenues\nRecurring and Other Revenue\nBeginning in fiscal 2020, we simplified the presentation of revenue. Recurring fees and Implementation services and other have been combined into one revenue line: Recurring and other revenue. We changed the presentation of revenue as Implementation services and other has become a smaller component of our overall revenue mix as our HCM suite has become a larger part of the portfolio. Previously reported results for the year ended June 30, 2019 have been reclassified to conform to the current presentation.\nWe derive the majority of our revenues from recurring fees attributable to our cloud-based payroll and HCM software solutions. Recurring fees for each client generally include a base fee in addition to a fee based on the number of client employees and the number of products a client uses. We also charge fees attributable to our preparation of W-2 documents and annual required filings on behalf of our clients. We charge implementation fees for professional services provided to implement our payroll and HCM solutions. Implementations of our payroll solutions typically require only one to eight weeks, depending on the size and complexity of each client, at which point the new client’s payroll is first\nprocessed using our solution. We implement additional HCM products as requested by clients and leverage the data within our payroll solution to accelerate our implementation processes. Our average client size has continued to be over 100 employees.\nWhile the majority of our agreements with clients are generally cancellable by the client on 60 days’ notice or less, we also have entered into term agreements, which are generally two years in length. Our agreements do not include general rights of return and do not provide clients with the right to take possession of the software supporting the services being provided. We recognize recurring fees in the period in which services are provided and the related performance obligations have been satisfied. We defer implementation fees related to our proprietary products over a period generally up to 24 months. Recurring and other revenue accounted for approximately 96%, 97% and 99% of our total revenues during the years ended June 30, 2019, 2020 and 2021, respectively.\nInterest Income on Funds Held for Clients\nWe earn interest income on funds held for clients. We collect funds for employee payroll payments and related taxes in advance of remittance to employees and taxing authorities. Prior to remittance to employees and taxing authorities, we earn interest on these funds through demand deposit accounts with financial institutions with which we have automated clearing house, or ACH, arrangements. We also earn interest by investing a portion of funds held for clients in highly liquid, investment-grade marketable securities.\nCost of Revenues\nTo correspond with the simplification of the presentation of revenue discussed above, we also simplified the presentation of cost of revenue beginning in fiscal 2020. As a result, Cost of revenues - recurring revenues and Cost of revenues - implementation services and other have been combined into one line: Cost of revenues. Cost of revenues includes costs to provide our payroll and other HCM solutions which primarily consists of employee-related expenses, including wages, stock-based compensation, bonuses and benefits, relating to the provision of ongoing client support and implementation activities, payroll tax filing, distribution of printed checks and other materials as well as delivery costs, computing costs, and bank fees associated with client fund transfers. Costs related to recurring support are generally expensed as incurred. Implementation costs related to our proprietary products are capitalized and amortized over a period of 7 years. Our cost of revenues is expected to increase in absolute dollars for the foreseeable future as we increase our client base. However, we expect to realize cost efficiencies over the long term as our business scales, resulting in improved operating leverage and increased margins.\nWe also capitalize a portion of our internal-use software costs, which are then all amortized as Cost of revenues. We amortized $16.9 million, $19.3 million and $23.2 million of capitalized internal-use software costs in fiscal 2019, 2020 and 2021, respectively.\nOperating Expenses\nSales and Marketing\nSales and marketing expenses consist primarily of employee-related expenses for our direct sales and marketing staff, including wages, commissions, stock-based compensation, bonuses, benefits, marketing expenses and other related costs. Our sales personnel earn commissions and bonuses for attainment of certain performance criteria based upon new sales throughout the fiscal year. We capitalize certain selling and commission costs related to new contracts or purchases of additional services by our existing clients and amortize them over a period of 7 years.\nWe will seek to grow our number of clients for the foreseeable future and therefore our sales and marketing expense is expected to continue to increase in absolute dollars as we grow our sales organization and expand our marketing activities.\nResearch and Development\nResearch and development expenses consist primarily of employee-related expenses for our research and development and product management staff, including wages, stock-based compensation, bonuses and benefits. Additional expenses include costs related to the development, maintenance, quality assurance and testing of new technologies and ongoing refinement of our existing solutions. Research and development expenses, other than internal-use software costs qualifying for capitalization, are expensed as incurred.\nWe capitalize a portion of our development costs related to internal-use software. The timing of our capitalized development projects may affect the amount of development costs expensed in any given period. The table below sets forth the amounts of capitalized and expensed research and development expenses for each of fiscal 2019, 2020 and 2021.\nYear Ended June 30,\n(in thousands)\nCapitalized portion of research and development\n$\n23,313\n$\n28,187\n$\n31,744\nExpensed portion of research and development\n50,329\n62,766\n76,707\nTotal research and development\n$\n73,642\n$\n90,953\n$\n108,451\nWe expect to grow our research and development efforts as we continue to broaden our product offerings and extend our technological leadership by investing in the development of new technologies and introducing them to new and existing clients. We expect research and development expenses to continue to increase in absolute dollars but to vary as a percentage of total revenue on a period-to-period basis.\nGeneral and Administrative\nGeneral and administrative expenses consist primarily of employee-related costs, including wages, stock-based compensation, bonuses and benefits for our finance and accounting, legal, information systems, human resources and other administrative departments. Additional expenses include consulting and professional fees, occupancy costs, insurance and other corporate expenses. We expect our general and administrative expenses to continue to increase in absolute dollars as our company continues to grow.\nOther Income (Expense)\nOther income (expense) generally consists of interest income related to interest earned on our cash and cash equivalents and corporate investments, net of losses on disposals of property and equipment and interest expense related to our revolving credit facility.\nResults of Operations\nThe following table sets forth our statements of operations data for each of the periods indicated.\nYear Ended June 30,\n(in thousands)\nConsolidated Statements of Operations Data:\nRevenues:\nRecurring and other revenue\n$\n447,752\n$\n546,212\n$\n631,725\nInterest income on funds held for clients\n19,881\n15,117\n3,902\nTotal revenues\n467,633\n561,329\n635,627\nCost of revenues\n153,851\n182,010\n219,298\nGross profit\n313,782\n379,319\n416,329\nOperating expenses:\nSales and marketing\n112,599\n145,134\n161,808\nResearch and development\n50,329\n62,766\n76,707\nGeneral and administrative\n94,630\n105,248\n119,771\nTotal operating expenses\n257,558\n313,148\n358,286\nOperating income\n56,224\n66,171\n58,043\nOther income (expense)\n1,822\n(939)\nIncome before income taxes\n58,046\n67,118\n57,104\nIncome tax expense (benefit)\n4,223\n2,663\n(13,715)\nNet income\n$\n53,823\n$\n64,455\n$\n70,819\nThe following table sets forth our statements of operations data as a percentage of total revenue for each of the periods indicated.\nYear Ended June 30,\nConsolidated Statements of Operations Data:\nRevenues:\nRecurring and other revenue\n%\n%\n%\nInterest income on funds held for clients\n%\n%\n%\nTotal revenues\n%\n%\n%\nCost of revenues\n%\n%\n%\nGross profit\n%\n%\n%\nOperating expenses:\nSales and marketing\n%\n%\n%\nResearch and development\n%\n%\n%\nGeneral and administrative\n%\n%\n%\nTotal operating expenses\n%\n%\n%\nOperating income\n%\n%\n%\nOther income (expense)\n%\n%\n%\nIncome before income taxes\n%\n%\n%\nIncome tax expense (benefit)\n%\n%\n(2)\n%\nNet income\n%\n%\n%\nComparison of Fiscal Years Ended June 30, 2019, 2020 and 2021\nRevenues\n($ in thousands)\nChange from\nChange from\nYear Ended June 30,\n2019 to 2020\n2020 to 2021\n$\n%\n$\n%\nRecurring and other revenue\n$\n447,752\n$\n546,212\n$\n631,725\n$\n98,460\n%\n$\n85,513\n%\nPercentage of total revenues\n%\n%\n%\nInterest income on funds held for clients\n$\n19,881\n$\n15,117\n$\n3,902\n$\n(4,764)\n(24)\n%\n$\n(11,215)\n(74)\n%\nPercentage of total revenues\n%\n%\n%\nRecurring and Other Revenue\nRecurring and other revenue for the year ended June 30, 2021 increased by $85.5 million, or 16%, to $631.7 million from $546.2 million for the year ended June 30, 2020. Recurring and other revenue increased primarily as a result of incremental revenues from new and existing clients, partially offset by a reduction in client employees on our platform due to the ongoing impact from COVID-19. Excluding clients acquired through acquisitions, the number of clients using our payroll and HCM software solutions at June 30, 2021 increased by 18% to approximately 28,750 from approximately 24,450 at June 30, 2020.\nInterest Income on Funds Held for Clients\nInterest income on funds held for clients for the year ended June 30, 2021 decreased by $11.2 million, or 74%, to $3.9 million from $15.1 million for the year ended June 30, 2020. Interest income on funds held for clients decreased primarily as a result of lower average interest rates due to the interest rate cuts by the Federal Reserve in response to the COVID-19 pandemic. The impact from the reduction in interest rates was partially offset by higher average daily balances for funds held due to the addition of new clients to our client base.\nCost of Revenues\n($ in thousands)\nChange from\nChange from\nYear Ended June 30,\n2019 to 2020\n2020 to 2021\n$\n%\n$\n%\nCost of revenues\n$\n153,851\n$\n182,010\n$\n219,298\n$\n28,159\n%\n$\n37,288\n%\nPercentage of total revenues\n%\n%\n%\nGross margin\n%\n%\n%\nCost of revenues for the year ended June 30, 2021 increased by $37.3 million, or 20%, to $219.3 million from $182.0 million for the year ended June 30, 2020. Cost of revenues increased primarily as a result of the continued growth of our business, in particular, $25.9 million in additional employee-related costs resulting from additional personnel necessary to provide services to new and existing clients, $5.4 million in delivery and other processing-related fees, $4.0 million in increased internal-use software amortization and $2.0 million of additional stock-based compensation associated with our equity plan. Gross margin decreased from 68% in fiscal 2020 to 65% in fiscal 2021, primarily due to COVID-19 related headwinds and a near zero interest rate environment.\nOperating Expenses\n($ in thousands)\nSales and Marketing\nChange from\nChange from\nYear Ended June 30,\n2019 to 2020\n2020 to 2021\n$\n%\n$\n%\nSales and marketing\n$\n112,599\n$\n145,134\n$\n161,808\n$\n32,535\n%\n$\n16,674\n%\nPercentage of total revenues\n%\n%\n%\nSales and marketing expenses for the year ended June 30, 2021 increased by $16.7 million, or 11%, to $161.8 million from $145.1 million for the year ended June 30, 2020. The increase in sales and marketing expense was primarily the result of additional employee-related costs, including those incurred to expand our sales team, partially offset by reduced overall spending on travel and entertainment.\nResearch and Development\nChange from\nChange from\nYear Ended June 30,\n2019 to 2020\n2020 to 2021\n$\n%\n$\n%\nResearch and development\n$\n50,329\n$\n62,766\n$\n76,707\n$\n12,437\n%\n$\n13,941\n%\nPercentage of total revenues\n%\n%\n%\nResearch and development expenses for the year ended June 30, 2021 increased by $13.9 million, or 22%, to $76.7 million from $62.8 million for the year ended June 30, 2020. The increase in research and development expenses was primarily the result of $13.0 million of additional employee-related costs related to additional development personnel and $3.0 million of additional stock-based compensation associated with our equity incentive plan, partially offset by higher year-over-year capitalized internal-use software costs of $2.9 million.\nGeneral and Administrative\nChange from\nChange from\nYear Ended June 30,\n2019 to 2020\n2020 to 2021\n$\n%\n$\n%\nGeneral and administrative\n$\n94,630\n$\n105,248\n$\n119,771\n$\n10,618\n%\n$\n14,523\n%\nPercentage of total revenues\n%\n%\n%\nGeneral and administrative expenses for the year ended June 30, 2021 increased by $14.5 million, or 14%, to $119.8 million from $105.2 million for the year ended June 30, 2020. The increase in general and administrative expense was primarily the result of $8.8 in additional stock-based compensation associated with our equity incentive plan, $3.6 million of additional employee-related costs, $1.3 million in additional amortization of acquired intangible assets and $1.2 million of increased occupancy costs. Stock-based compensation expense for the year ended June 30, 2021 was higher than the year ended June 30, 2020 due to the impact of COVID-19 on performance targets starting from the third quarter of fiscal 2020 and the modification of certain performance awards during the first quarter of fiscal 2021. See Note 15 of the Notes to Consolidated financial Statements included in Part II, Item 8: “Financial Statements and Supplementary Data” of this annual Report on Form 10-K for further details.\nOther Income (Expense)\nChange from\nChange from\nYear Ended June 30,\n2019 to 2020\n2020 to 2021\n$\n%\n$\n%\nOther income (expense)\n$\n1,822\n$\n$\n(939)\n$\n(875)\n(48)\n%\n$\n(1,886)\n(199)\n%\nPercentage of total revenues\n%\n%\n%\nOther income (expense) for the year ended June 30, 2021 decreased by $1.9 million as compared to the year ended June 30, 2020. The change in other income (expense) was primarily due to lower interest income earned on our cash and cash equivalents and corporate investments and increased interest expense related to our revolving credit facility.\nIncome Tax Expense (Benefit)\nChange from\nChange from\nYear Ended June 30,\n2019 to 2020\n2020 to 2021\n$\n%\n$\n%\nIncome tax expense (benefit)\n$\n4,223\n$\n2,663\n$\n(13,715)\n$\n(1,560)\n(37)\n%\n$\n(16,378)\n*\nPercentage of total revenues\n%\n%\n(2)\n%\n*\nNot Meaningful\nThe difference in income tax expense (benefit) for the year ended June 30, 2021 as compared to the year ended June 30, 2020 was primarily due to increased deductions related to stock-based compensation and research and development credits, partially offset by an increase to the valuation allowance.\nSee Note 13 of the Notes to Consolidated Financial Statements included in Part II, Item 8: “Financial Statements and Supplementary Data” of this Annual Report on Form 10-K for further details on the components of income tax and a reconciliation of the U.S. federal statutory rate to the effective tax rate.\nCritical Accounting Policies and Significant Judgments and Estimates\nIn preparing our financial statements and accounting for the underlying transactions and balances in accordance with GAAP, we apply various accounting policies that require our management to make estimates, judgments and assumptions that affect the amounts reported in our financial statements. We consider the policies discussed below critical to understanding our financial statements, as their application places the most significant demands on management’s judgment. Management bases its estimates, judgments and assumptions on historical experience, current economic and industry conditions and on various other factors deemed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Because the use of estimates is an integral part of the financial reporting process, actual results could differ, and such differences could be material.\nRevenue Recognition\nWe apply Accounting Standards Codification (“ASC”) 606, Revenue from Contracts with Customers (“Topic 606”), whereby we recognize revenue when we transfer control of goods or services to our customers in an amount that reflects the consideration to which we expect to be entitled to for those goods or services.\nWe derive our revenue from contracts with clients predominantly from recurring and non-recurring service fees. Recurring fees are derived from payroll and HR related services including time and attendance, employee administration and benefits enrollment and administration services. Payroll services are delivered on a weekly, biweekly, semi-monthly, or monthly basis depending upon the payroll frequency of the client and on an annual basis if a client selects W-2 preparation and processing services. HR related services are typically delivered on a monthly basis.\nThe majority of our recurring fees are satisfied over time as services are provided. The performance obligations related to payroll services are satisfied upon the processing of a client’s payroll with the fee charged and collected based on a per employee per payroll frequency fee. The performance obligations related to time and attendance services and HR related services are satisfied over time each month with the fee charged and collected based on a per employee per month fee. For subscription-based fees which can include payroll, time and attendance and HR related services, we recognize the applicable recurring fees over time each month with the fee charged and collected based on a per employee per month fee. We believe that the total fees charged to our clients is indicative of the standalone selling price as these fees are within the range of prices typically charged for our services to our clients. Even though our subscription-based services include multiple performance obligations, we do not believe it is meaningful to determine the standalone selling price for each service separately since these services are delivered and related revenue recognized within the same period.\nWe have certain optional performance obligations that are satisfied at a point in time including the sales of time clocks and W-2 preparation services.\nNon-recurring service fees consist mainly of nonrefundable implementation fees, which involve setting up the client in, and loading data into, our cloud-based modules. These implementation activities are considered set-up activities. We have determined that the nonrefundable upfront fees provide certain clients with a material right to renew the contract. Implementation fees are deferred and amortized generally over a period up to 24 months.\nCapitalized Internal-Use Software Costs\nWe apply ASC 350-40, Intangibles-Goodwill and Other-Internal-Use Software, to the accounting for costs of internal-use software. Software development costs are capitalized when module development begins, it is probable that the project will be completed, and the software will be used as intended. Costs associated with preliminary project stage activities, training, maintenance and all other post implementation stage activities are expensed as incurred. We also capitalize certain costs related to specific upgrades and enhancements when it is probable the expenditures will result in significant additional functionality. The capitalization policy provides for the capitalization of certain payroll costs for employees who are directly associated with developing internal-use software as well as certain external direct costs. Capitalized employee costs are limited to the time directly spent on such projects.\nInternal-use software is amortized on a straight-line basis, generally over a 24 or 36-month period. We evaluate the useful lives of these assets on an annual basis and test for impairment whenever events or changes in circumstances occur that could impact the recoverability of these assets. There was no impairment to capitalized internal-use software during the years ended June 30, 2019, 2020 or 2021. We capitalized $23.3 million, $28.2 million, and $31.7 million of internal-use software costs for the years ended June 30, 2019, 2020 and 2021, respectively, including stock-based compensation costs of $2.8 million, $2.4 million and $2.6 million for the years ended June 30, 2019, 2020 and 2021, respectively. We amortized $16.9 million, $19.3 million, and $23.2 million of capitalized internal-use software costs for the years ended June 30, 2019, 2020 and 2021, respectively. In fiscal 2019, fiscal 2020 and fiscal 2021, we developed significant additional functionality in several of our modules. This development resulted in an increase in capitalized internal-use software costs in fiscal 2021 as compared to fiscal 2020 and in fiscal 2020 as compared to fiscal 2019.\nGoodwill and Intangible Assets\nGoodwill is an asset representing the future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized. Goodwill is not amortized, but instead is tested for impairment at the reporting unit level. If the fair value of the reporting unit is less than its carrying amount, we would record an impairment charge for the amount by which the carrying amount exceeds the reporting unit’s fair value. We perform our annual impairment review of goodwill in our fiscal fourth quarter or when a triggering event occurs between annual impairment tests. No impairment was recorded in fiscal 2019, 2020 or 2021 as a result of our qualitative assessments over our single reporting segment.\nIntangible assets are primarily comprised of acquired client relationships, proprietary technology, trade name and non-solicitation agreements and are reported net of accumulated amortization on the Consolidated Balance Sheets.\nClient relationships use the straight-line method of amortization over a five to nine-year time frame from the date of acquisition, while proprietary technology and trade names use the straight-line method of amortization over a five-year period from the date of acquisition. Non-solicitation agreements use the straight-line method of amortization over the term of the related agreements. Amortization expense associated with our intangible assets was $2.3 million, $2.5 million and $3.8 million during the years ended June 30, 2019, 2020 and 2021, respectively. We test intangible assets for potential impairment when events or changes in circumstances indicate that the carrying value of such assets may not be recoverable. There were no such events or changes in circumstances during the years ended June 30, 2019, 2020 or 2021.\nIncome Taxes\nWe account for federal income taxes under the asset and liability method. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases and operating loss and tax credit carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date.\nDeferred tax assets may be reduced by a valuation allowance to the extent we determine it is more likely than not that some portion or all of the deferred tax assets will not be realized. The valuation of deferred tax assets requires judgment in assessing the likely future tax consequences of events that have been recognized in our financial statements or tax returns and future profitability. Our accounting for deferred tax consequences represents the best estimate of those future events.\nIn assessing the need for a valuation allowance, we consider both positive and negative evidence related to the likelihood of realization of the deferred tax assets. The weight given to positive and negative evidence is commensurate with the extent to which the evidence may be objectively verified.\nWe recognize the effect of income tax positions only if those positions are more likely than not of being sustained. Recognized income tax positions are measured at the largest amount that is greater than 50% likely of being realized. Changes in recognition or measurement are reflected in the period in which the change in judgment occurs.\nLiquidity and Capital Resources\nOur primary liquidity needs are related to the funding of general business requirements, including working capital requirements, research and development, and capital expenditures. As of June 30, 2021, our principal sources of liquidity were $202.3 million of cash and cash equivalents and $4.5 million of total corporate investments. In July 2019, we entered into and currently maintain a five-year revolving credit agreement. This credit agreement provides for a $250.0 million senior revolving credit facility which may be increased up to $375.0 million. In the fourth quarter of fiscal 2020, we borrowed $100.0 million under this credit facility, which we repaid in the third quarter of fiscal 2021. Refer to Note 11 of the Notes to the Consolidated Financial Statements included in Part II, Item 8: “Financial Statements and Supplementary Data” for additional details on the credit agreement and borrowing activity.\nWe invest portions of our excess cash and cash equivalents in highly liquid, investment-grade marketable securities. These investments consist of commercial paper, asset-backed debt securities, corporate debt issuances and U.S. Treasury securities with credit quality ratings of A-1 or higher. We had no investments in unrealized loss positions as of June 30, 2021.\nIn order to grow our business, we intend to increase our personnel and related expenses and to make significant investments in our platform, data centers and general infrastructure. The timing and amount of these investments will vary based on our financial condition, the rate at which we add new clients and new personnel and the scale of our module development, data centers and other activities. Many of these investments will occur in advance of our experiencing any direct benefit from them, which could negatively impact our liquidity and cash flows during any particular period and may make it difficult to determine if we are effectively allocating our resources. However, we\nexpect to fund our operations, capital expenditures and other investments principally with cash flows from operations, and to the extent that our liquidity needs exceed our cash from operations, we would look to our cash on hand and corporate investments or utilize the borrowing capacity under our credit facility to satisfy those needs.\nFunds held for clients and client fund obligations will vary substantially from period to period as a result of the timing of payroll and tax obligations due. Our payroll processing activities involve the movement of significant funds from accounts of employers to employees and relevant taxing authorities. Though we debit a client’s account prior to any disbursement on its behalf, there is a delay between our payment of amounts due to employees and taxing and other regulatory authorities and when the incoming funds from the client to cover these amounts payable actually clear into our operating accounts. We currently have agreements with eleven major U.S. banks to execute ACH and wire transfers to support our client payroll and tax services. We believe we have sufficient capacity under these ACH arrangements to handle all transaction volumes for the foreseeable future. We primarily collect fees for our services via ACH transactions at the same time we debit the client’s account for payroll and tax obligations and thus are able to reduce collectability and accounts receivable risks.\nWe believe our current cash and cash equivalents, corporate investments, future cash flow from operations, and access to our credit facility will be sufficient to meet our ongoing working capital, capital expenditure and other liquidity requirements for at least the next 12 months, and thereafter, for the foreseeable future.\nCash Flows\nThe following table sets forth data regarding cash flows for the periods indicated:\nYear Ended June 30,\nNet cash provided by operating activities\n$\n115,032\n$\n112,655\n$\n124,850\nCash flows from investing activities:\nPurchases of available-for-sale securities and other\n(250,685)\n(400,343)\n-\nProceeds from sales and maturities of available-for-sale securities\n246,243\n410,593\n101,467\nCapitalized internal-use software costs\n(20,142)\n(25,715)\n(28,594)\nPurchases of property and equipment\n(11,280)\n(16,578)\n(9,461)\nLease allowances used for tenant improvements\n(7,480)\n-\n-\nAcquisition of business, net of cash acquired\n-\n(16,714)\n(14,992)\nNet cash provided by (used in) investing activities\n(43,344)\n(48,757)\n48,420\nCash flows from financing activities:\nNet change in client fund obligations\n168,855\n(67,165)\n432,373\nBorrowings under credit facility\n-\n100,000\n-\nRepayment of credit facility\n-\n-\n(100,000)\nPayment of contingent consideration\n(1,000)\n-\n-\nRepurchases of common shares\n(34,991)\n-\n-\nProceeds from exercise of stock options\n-\nProceeds from employee stock purchase plan\n5,982\n8,901\n12,214\nTaxes paid related to net share settlement of equity awards\n(24,207)\n(38,943)\n(64,191)\nPayment of debt issuance costs\n-\n(701)\n(64)\nNet cash provided by financing activities\n114,724\n2,092\n280,478\nNet change in cash, cash equivalents and funds held for clients' cash and cash equivalents\n$\n186,412\n$\n65,990\n$\n453,748\nOperating Activities\nNet cash provided by operating activities was $115.0 million, $112.7 million and $124.9 million for the years ended June 30, 2019, 2020 and 2021, respectively.\nThe increase in net cash provided by operating activities from fiscal 2020 to fiscal 2021 was primarily due to improved operating results after adjusting for non-cash items including stock-based compensation expense, depreciation and amortization expense and deferred income tax expense (benefit).\nInvesting Activities\nNet cash provided by (used in) investing activities was $(43.3) million, ($48.8) million and $48.4 million, for the years ended June 30, 2019, 2020 and 2021, respectively. The net cash used in investing activities is significantly impacted by the timing of purchases and sales and maturities of investments as we invest a portion of our excess cash and cash equivalents and funds held for clients in highly liquid, investment-grade marketable securities. The amount of funds held for clients invested will vary based on timing of client funds collected and payments due to client employees and taxing and other regulatory authorities.\nThe increase in net cash provided by (used in) investing activities from fiscal 2020 to fiscal 2021 was primarily due to a decrease in purchases of available-for-sale securities and other of $400.3 million during the year ended June 30, 2021 as compared to the year ended June 30, 2020 and $7.1 million in fewer purchases of purchases of property and equipment, partially offset by a decrease in proceeds from sales and maturities of available-for-sale securities of $309.1 million.\nFinancing Activities\nNet cash provided by financing activities was $114.7 million, $2.1 million and $280.5 million for the years ended June 30, 2019, 2020 and 2021, respectively. The change in net cash provided by financing activities from fiscal 2020 to fiscal 2021 was primarily the result of an increase of $499.5 million due to the timing of client funds collected and related remittance of those funds to client employees and taxing authorities, partially offset by certain borrowing activities and $25.2 million in additional taxes paid related to net share settlement of equity awards during the year ended June 30, 2021 as compared to the year ended June 30, 2020. In fiscal 2020, we borrowed $100.0 million under our credit facility that we fully repaid in fiscal 2021. We did not borrow any additional amounts during fiscal 2021.\nContractual Obligations and Commitments\nOur principal commitments consist of operating lease obligations. The following table summarizes our contractual obligations at June 30, 2021:\nPayment Due By Fiscal Period\nLess than 1\nMore than\nTotal\nYear\n1-3 Years\n3-5 Years\n5 Years\nOperating lease obligations\n$\n90,008\n$\n10,192\n$\n19,392\n$\n18,459\n$\n41,965\nPurchase obligations\n23,579\n15,888\n6,904\n-\n$\n113,587\n$\n26,080\n$\n26,296\n$\n19,246\n$\n41,965\nCapital Expenditures\nWe expect to continue to invest in capital spending as we continue to grow our business and expand and enhance our operating facilities, data centers and technical infrastructure. Future capital requirements will depend on many factors, including our rate of sales growth. In the event that our sales growth or other factors do not meet our expectations, we may eliminate or curtail capital projects in order to mitigate the impact on our use of cash. Capital expenditures were $11.3 million, $16.6 million and $9.5 million for the years ended June 30, 2019, 2020 and 2021, respectively, exclusive of capitalized internal-use software costs of $20.1 million, $25.7 million, and $28.6 million for the same periods, respectively. We also spent $7.5 million in fiscal 2019 on capital expenditures for which we received reimbursement for tenant improvement allowances.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that may be material to investors.\nNew Accounting Pronouncements\nRefer to Note 2 of the Notes to the Consolidated Financial Statements included in Part II, Item 8: “Financial Statements and Supplementary Data” for a discussion of recently issued accounting standards.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures about Market Risk.\nWe have operations solely in the United States and are exposed to market risks in the ordinary course of our business. These risks primarily include interest rate and certain other exposures as well as risks relating to changes in the general economic conditions in the United States. We have not used, nor do we intend to use, derivatives to mitigate the impact of interest rate or other exposure or for trading or speculative purposes.\nInterest Rate Risk\nAs of June 30, 2021, we had cash and cash equivalents of $202.3 million, total corporate investments of $4.5 million and funds held for clients of $1,759.7 million. We deposit our cash and cash equivalents and significant portions of our funds held for clients in demand deposit accounts with various financial institutions. We invest portions of our excess cash and cash equivalents and funds held for clients in marketable securities including asset-backed securities and corporate debt securities which were classified as available-for-sale securities as of June 30, 2021. Our investment policy is focused on generating higher yields from these investments while preserving liquidity and capital. However, as a result of our investing activities, we are exposed to changes in interest rates that may materially affect our financial statements.\nIn a falling rate environment, a decline in interest rates would decrease our interest income earned on both cash and cash equivalents and funds held for clients. An increase in the overall interest rate environment may cause the market value of our investments in fixed rate available-for-sale securities to decline. If we are forced to sell some or all of these securities at lower market values, we may incur investment losses. However, because we classify all marketable securities as available-for-sale, no gains or losses are recognized due to changes in interest rates until such securities are sold or decreases in fair value are deemed due to expected credit losses. We have not recorded credit impairment losses on our portfolio to date.\nBased upon a sensitivity model that measures market value changes caused by interest rate fluctuations, an immediate 100-basis point change in interest rates would have had an immaterial effect on the market value of our available-for-sale securities as of June 30, 2021. Fluctuations in the value of our available-for-sale securities caused by changes in interest rates are recorded in other comprehensive income and are only realized if we sell the underlying securities.\nAdditionally, as described in Note 11 of the Notes to the Consolidated Financial Statements included in Part II,",
    "item_8": "Item 8. Financial Statements and Supplementary Data.\nThe information required by this item is incorporated by reference to the consolidated financial statements and accompanying notes set forth on pages through of this Annual Report on Form 10-K.",
    "item_9": "Item 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure.\nNone.",
    "item_9A": "Item 9A. Controls and Procedures.\nDisclosure Controls and Procedures\nThe term “disclosure controls and procedures,” as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act refers to controls and procedures that are designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the SEC’s rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that such information is accumulated and communicated to a company’s management, including its principal executive and principal financial officers, as appropriate to allow timely decisions regarding required disclosure.\nOur management, with the participation of our Chief Executive Officer and Chief Financial Officer, has evaluated the effectiveness of our disclosure controls and procedures as of June 30, 2021, the end of the period covered by this Annual Report on Form 10-K. Based upon such evaluation, our Chief Executive Officer and Chief Financial Officer have concluded that our disclosure controls and procedures were effective as of such date.\nManagement’s Report on Internal Control Over Financial Reporting and Attestation Report of the Registered Public Accounting Firm\nOur management, including our Chief Executive Officer and Chief Financial Officer, is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act). Internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. GAAP. Our internal control over financial reporting includes those policies and procedures that: (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. GAAP, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of our assets that could have a material effect on the financial statements.\nUnder the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting as of June 30, 2021, based on the framework in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) (2013 framework). Based on this evaluation under the Internal Control-Integrated Framework our Chief Executive Officer and Chief Financial Officer have concluded that our internal control over financial reporting was effective as of June 30, 2021.\nOur independent registered public accounting firm, which has audited our financial statements, has also audited the effectiveness of our internal control over financial reporting as of June 30, 2021, as stated in their report, which is included in Item 15(a)(1) of this Annual Report on Form 10-K.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal control over financial reporting during the fiscal quarter ended June 30, 2021, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nLimitations on Controls\nOur disclosure controls and procedures and internal control over financial reporting are designed to provide reasonable assurance of achieving their objectives as specified above. Management does not expect, however, that our disclosure controls and procedures or our internal control over financial reporting will prevent or detect all error and fraud. Any control system, no matter how well designed and operated, is based upon certain assumptions and can provide only reasonable, not absolute, assurance that its objectives will be met. Further, no evaluation of controls can provide absolute assurance that misstatements due to error or fraud will not occur or that all control issues and instances of fraud, if any, within the Company have been detected.",
    "item_9B": "Item 9B. Other Information.\nNone.\nPART III",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nInformation required by Part III, Item 10, will be included in our Proxy Statement relating to our 2022 annual meeting of stockholders to be filed with the SEC within 120 days after the end of our fiscal year ended June 30, 2021, and is incorporated herein by reference.",
    "item_11": "Item 11. Executive Compensation\nInformation required by Part III, Item 11, will be included in our Proxy Statement relating to our 2022 annual meeting of stockholders to be filed with the SEC within 120 days after the end of our fiscal year ended June 30, 2021, and is incorporated herein by reference.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nInformation required by Part III, Item 12, will be included in our Proxy Statement relating to our 2022 annual meeting of stockholders to be filed with the SEC within 120 days after the end of our fiscal year ended June 30, 2021, and is incorporated herein by reference.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence.\nInformation required by Part III, Item 13, will be included in our Proxy Statement relating to our 2022 annual meeting of stockholders to be filed with the SEC within 120 days after the end of our fiscal year ended June 30, 2021, and is incorporated herein by reference.",
    "item_14": "Item 14. Principal Accounting Fees and Services.\nInformation required by Part III, Item 14, will be included in our Proxy Statement relating to our 2022 annual meeting of stockholders to be filed with the SEC within 120 days after the end of our fiscal year ended June 30, 2021, and is incorporated herein by reference.\nPART IV",
    "item_15": "Item 15. Exhibits and Financial Statement Schedules\n(a) Documents Filed with Report\n(1) Financial Statements.\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of June 30, 2020 and 2021\nConsolidated Statements of Operations and Comprehensive Income for the years ended June 30, 2019, 2020 and 2021\nConsolidated Statements of Changes in Stockholders’ Equity for the years ended June 30, 2019, 2020 and 2021\nConsolidated Statements of Cash Flows for the years ended June 30, 2019, 2020 and 2021\nNotes to the Consolidated Financial Statements\n(2) Exhibits.\nThe information required by this Item is set forth on the Exhibit Index immediately following this page.\nItem 16. Form 10-K Summary\nNone.\nEXHIBIT INDEX\nExhibit\nIncorporated by Reference\nNumber\nExhibit Description\nForm\nFile No.\nExhibit\nFiling Date\n2.1\nShare Exchange Agreement, dated November 7, 2013.\nS-1\n333-193661\n2.1\nJanuary 30, 2014\n3.1\nFirst Amended and Restated Certificate of Incorporation of the Registrant.\nS-1/A\n333-193661\n3.2\nFebruary 14, 2014\n3.2\nAmended and Restated By-Laws of the Registrant.\n10-K\n001-36348\n3.2\nAugust 11, 2017\n4.1\nAmended and Restated Investor Rights Agreement, dated June 29, 2012.\nS-1\n333-193661\n4.1\nJanuary 30, 2014\n4.2*\nDescription of Securities.\n10.1\nForm of Indemnification Agreement for directors and officers.\nS-1\n333-193661\n10.2\nJanuary 30, 2014\n10.2†\n2008 Equity Incentive Plan and forms of agreement thereunder.\nS-1\n333-193661\n10.3\nJanuary 30, 2014\n10.2.1†\nFirst Amendment to the 2008 Equity Incentive Plan, dated August 5, 2010.\nS-1\n333-193661\n10.3.1\nJanuary 30, 2014\n10.2.2†\nSecond Amendment to the 2008 Equity Incentive Plan, dated June 29, 2012.\nS-1\n333-193661\n10.3.2\nJanuary 30, 2014\n10.3†\n2014 Equity Incentive Plan and forms of agreement thereunder.\nS-1/A\n333-193661\n10.4\nFebruary 14, 2014\n10.3.1†\nForm of Market Stock Units Notice of Grant and Award Agreement under the 2014 Equity Incentive Plan.\n8-K\n001-36348\n10.1\nAugust 18, 2020\n10.4†\nThird Amended and Restated Executive Employment Agreement between Paylocity Corporation and Steven R. Beauchamp, dated February 7, 2014.\nS-1/A\n333-193661\n10.5\nFebruary 14, 2014\n10.5†\nSecond Amended and Restated Executive Employment Agreement between Paylocity Corporation and Michael R. Haske, dated February 7, 2014.\nS-1/A\n333-193661\n10.7\nFebruary 14, 2014\n10.6\nOffice Lease between 3850 Wilke LLC and Paylocity Corporation, dated January 12, 2007.\nS-1\n333-193661\n10.8\nJanuary 30, 2014\n10.7.1\nAmendment to Office Lease, dated January 5, 2011.\nS-1\n333-193661\n10.8.1\nJanuary 30, 2014\n10.7.2\nAmendment to Office Lease, dated May 6, 2013.\nS-1\n333-193661\n10.8.2\nJanuary 30, 2014\n10.7.3\nMulti-Tenant Office Lease Agreement, dated June 1, 2016, by and between Paylocity Corporation and RPAI Schaumburg American Lane, L.L.C.\n8-K\n001-36348\n10.1\nJune 2, 2016\nExhibit\nIncorporated by Reference\nNumber\nExhibit Description\nForm\nFile No.\nExhibit\nFiling Date\n10.8†\n2014 Employee Stock Purchase Plan.\nS-1/A\n333-193661\n10.9\nFebruary 14, 2014\n10.9†\nExecutive Employment Agreement between Paylocity Corporation and Mark S. Kinsey, dated May 1, 2015.\n10-K\n001-36348\n10.11\nAugust 12, 2016\n10.10†\nExecutive Employment Agreement between Paylocity Corporation and Edward W. Gaty, dated August 8, 2016.\n8-K\n001-36348\n10.1\nAugust 9, 2016\n10.11†\nExecutive Employment Agreement between Paylocity Corporation and Toby J. Williams, dated September 18, 2017.\n10-Q\n001-36348\n10.1\nNovember 3, 2017\n14.1\nCode of Business Conduct and Ethics.\n10-K\n001-36348\n14.1\nAugust 22, 2014\n21.1*\nList of Subsidiaries of the Registrant.\n23.1*\nConsent of KPMG LLP, Independent Registered Public Accounting Firm.\n24.1*\nPower of Attorney (see page 56 to this Annual Report on Form 10-K).\n31.1*\nCertification of Principal Executive Officer Required Under Rule 13a-14(a) and 15d-14(a) of the Securities Exchange Act of 1934, as amended.\n31.2*\nCertification of Principal Financial Officer Required Under Rule 13a-14(a) and 15d-14(a) of the Securities Exchange Act of 1934, as amended.\n32.1**\nCertification of Chief Executive Officer Under Rule 13a-14(a) and 15d-14(a) of the Securities Exchange Act of 1934, as amended, and 18 U.S.C. §1350 as adopted pursuant to Section 906 of The Sarbanes-Oxley Act of 2002.\n32.2**\nCertification of Chief Financial Officer Required Under Rule 13a-14(a) and 15d-14(a) of the Securities Exchange Act of 1934, as amended, and 18 U.S.C. §1350 as adopted pursuant to Section 906 of The Sarbanes-Oxley Act of 2002.\n101.INS*\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document).\n101.SCH*\nInline XBRL Taxonomy Extension Schema.\n101.CAL*\nInline XBRL Taxonomy Extension Calculation Linkbase.\n101.LAB*\nInline XBRL Taxonomy Extension Label Linkbase.\n101.PRE*\nInline XBRL Taxonomy Extension Presentation Linkbase.\nExhibit\nIncorporated by Reference\nNumber\nExhibit Description\nForm\nFile No.\nExhibit\nFiling Date\n101.DEF*\nInline XBRL Taxonomy Extension Definition Linkbase.\n104*\nCover Page Interactive Data File (Formatted as Inline XBRL and contained in Exhibit 101).\n†Management contract, compensatory plan or arrangement.\n*Filed herewith.\n**Furnished herewith.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDate: August 6, 2021\nPAYLOCITY HOLDING CORPORATION\nBy:\n/s/ Steven R. Beauchamp\nSteven R. Beauchamp\nChief Executive Officer (Principal Executive Officer) and Director\nSIGNATURES AND POWER OF ATTORNEY\nEach person whose individual signature appears below hereby authorizes and appoints Steven R. Beauchamp and Toby J. Williams, and each of them, with full power of substitution and resubstitution and full power to act without the other, as his or her true and lawful attorney-in-fact and agent to act in his or her name, place and stead and to execute in the name and on behalf of each person, individually and in each capacity stated below, and to file any and all amendments to this Annual Report on Form 10-K, and to file the same, with all exhibits thereto, and other documents in connection therewith, with the Securities and Exchange Commission, granting unto said attorneys-in-fact and agents full power and authority to do and perform each and every act and thing, ratifying and confirming all that said attorneys-in-fact and agents or any of them or their or his substitute or substitutes may lawfully do or cause to be done by virtue thereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities indicated.\nSignature\nTitle\nDate\n/s/ Steven R. Beauchamp\nChief Executive Officer (Principal Executive Officer) and Director\nAugust 6, 2021\nSteven R. Beauchamp\n/s/ Toby J. Williams\nChief Financial Officer (Principal Financial Officer)\nAugust 6, 2021\nToby J. Williams\n/s/ Andrew Cappotelli\nChief Accounting Officer (Principal Accounting Officer)\nAugust 6, 2021\nAndrew Cappotelli\n/s/ Steven I. Sarowitz\nChairman of the Board of Directors\nAugust 6, 2021\nSteven I. Sarowitz\n/s/ Virginia G. Breen\nDirector\nAugust 6, 2021\nVirginia G. Breen\n/s/ Ellen Carnahan\nDirector\nAugust 6, 2021\nEllen Carnahan\n/s/ Jeffrey T. Diehl\nDirector\nAugust 6, 2021\nJeffrey T. Diehl\n/s/ Robin L. Pederson\nDirector\nAugust 6, 2021\nRobin L. Pederson\n/s/ Andres D. Reiner\nDirector\nAugust 6, 2021\nAndres D. Reiner\n/s/ Kenneth B. Robinson\nDirector\nAugust 6, 2021\nKenneth B. Robinson\n/s/ Ronald V. Waters, III\nDirector\nAugust 6, 2021\nRonald V. Waters, III\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nConsolidated Financial Statements:\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of June 30, 2020 and 2021\nConsolidated Statements of Operations and Comprehensive Income for the years ended June 30, 2019, 2020 and 2021\nConsolidated Statements of Changes in Stockholders’ Equity for the years ended June 30, 2019, 2020 and 2021\nConsolidated Statements of Cash Flows for the years ended June 30, 2019, 2020 and 2021\nNotes to the Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nPaylocity Holding Corporation:\nOpinions on the Consolidated Financial Statements and Internal Control Over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Paylocity Holding Corporation and subsidiaries (the Company) as of June 30, 2021 and 2020, the related consolidated statements of operations and comprehensive income, changes in stockholders’ equity, and cash flows for each of the years in the three-year period ended June 30, 2021, and the related notes (collectively, the consolidated financial statements). We also have audited the Company’s internal control over financial reporting as of June 30, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of June 30, 2021 and 2020, and the results of its operations and its cash flows for each of the years in the three-year period ended June 30, 2021, in conformity with U.S. generally accepted accounting principles. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of June 30, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nChange in Accounting Principle\nAs discussed in Note 2 to the consolidated financial statements, the Company has changed its method of accounting for leases due to the adoption of Accounting Standard Update (ASU) No. 2016-02, Leases, effective July 1, 2019.\nBasis for Opinions\nThe Company’s management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control Over Financial Reporting and Attestation Report of the Registered Public Accounting Firm. Our responsibility is to express an opinion on the Company’s consolidated financial statements and an opinion on the Company’s internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nCapitalized internal-use software development costs\nAs discussed in Notes 2(h) and 7 to the consolidated financial statements, the Company capitalizes certain internal-use software costs related to new products as well as existing products when those costs will result in significant additional functionality. The Company's capitalized internal-use software asset, net of accumulated amortization was $45 million as of June 30, 2021. The Company capitalized $32 million of internal-use software costs during the year ended June 30, 2021.\nWe identified the determination of capitalized internal-use software development costs as a critical audit matter because of the degree of subjectivity involved in assessing which projects met the capitalization criteria.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of an internal control related to the critical audit matter. This control related to the determination of which software development projects met the capitalization criteria. For a selection of current year capitalized software costs, we evaluated the Company's determination to capitalize the costs by reading the Company's analysis and discussing the objective and status of the projects with IT department management. We also assessed a sample of the Company's capitalized costs by confirming the nature of the activities performed with individual software developers.\n/s/ KPMG LLP\nWe have served as the Company’s auditor since 2013.\nChicago, Illinois\nAugust 6, 2021\nPAYLOCITY HOLDING CORPORATION\nConsolidated Balance Sheets\n(in thousands, except per share data)\nAs of June 30,\nAssets\nCurrent assets:\nCash and cash equivalents\n$\n250,851\n$\n202,287\nCorporate investments\n34,556\n4,456\nAccounts receivable, net\n4,923\n6,267\nDeferred contract costs\n32,332\n44,230\nPrepaid expenses and other\n13,188\n15,966\nTotal current assets before funds held for clients\n335,850\n273,206\nFunds held for clients\n1,327,304\n1,759,677\nTotal current assets\n1,663,154\n2,032,883\nCapitalized internal-use software, net\n36,501\n45,018\nProperty and equipment, net\n66,737\n59,835\nOperating lease right-of-use assets\n48,658\n43,984\nIntangible assets, net\n13,360\n13,027\nGoodwill\n21,655\n33,650\nLong-term deferred contract costs\n125,711\n170,663\nLong-term prepaid expenses and other\n4,917\n4,223\nDeferred income tax assets\n4,955\n11,602\nTotal assets\n$\n1,985,648\n$\n2,414,885\nLiabilities and Stockholders’ Equity\nCurrent liabilities:\nAccounts payable\n$\n1,755\n$\n4,230\nAccrued expenses\n79,881\n103,109\nTotal current liabilities before client fund obligations\n81,636\n107,339\nClient fund obligations\n1,327,304\n1,759,677\nTotal current liabilities\n1,408,940\n1,867,016\nLong-term debt\n100,000\n-\nLong-term operating lease liabilities\n73,299\n67,201\nOther long-term liabilities\n1,747\n1,958\nDeferred income tax liabilities\n8,754\n1,780\nTotal liabilities\n$\n1,592,740\n$\n1,937,955\nStockholders’ equity:\nPreferred stock, $0.001 par value, 5,000 authorized, no shares issued and outstanding at June 30, 2020 and June 30, 2021\n$\n-\n$\n-\nCommon stock, $0.001 par value, 155,000 shares authorized at June 30, 2020 and June 30, 2021; 53,792 shares issued and outstanding at June 30, 2020 and 54,594 shares issued and outstanding at June 30, 2021\nAdditional paid-in capital\n227,907\n241,718\nRetained earnings\n164,272\n235,091\nAccumulated other comprehensive income\nTotal stockholders' equity\n$\n392,908\n$\n476,930\nTotal liabilities and stockholders’ equity\n$\n1,985,648\n$\n2,414,885\nSee accompanying notes to consolidated financial statements.\nPAYLOCITY HOLDING CORPORATION\nConsolidated Statements of Operations and Comprehensive Income\n(in thousands, except per share data)\nFor the Years Ended June 30,\nRevenues:\nRecurring and other revenue\n$\n447,752\n$\n546,212\n$\n631,725\nInterest income on funds held for clients\n19,881\n15,117\n3,902\nTotal revenues\n467,633\n561,329\n635,627\nCost of revenues\n153,851\n182,010\n219,298\nGross profit\n313,782\n379,319\n416,329\nOperating expenses:\nSales and marketing\n112,599\n145,134\n161,808\nResearch and development\n50,329\n62,766\n76,707\nGeneral and administrative\n94,630\n105,248\n119,771\nTotal operating expenses\n257,558\n313,148\n358,286\nOperating income\n56,224\n66,171\n58,043\nOther income (expense)\n1,822\n(939)\nIncome before income taxes\n58,046\n67,118\n57,104\nIncome tax expense (benefit)\n4,223\n2,663\n(13,715)\nNet income\n$\n53,823\n$\n64,455\n$\n70,819\nOther comprehensive income (loss), net of tax\n(609)\nComprehensive income\n$\n54,074\n$\n65,018\n$\n70,210\nNet income per share:\nBasic\n$\n1.02\n$\n1.20\n$\n1.30\nDiluted\n$\n0.97\n$\n1.15\n$\n1.26\nWeighted-average shares used in computing net income per share:\nBasic\n52,914\n53,547\n54,318\nDiluted\n55,414\n55,807\n56,305\nSee accompanying notes to consolidated financial statements.\nPAYLOCITY HOLDING CORPORATION\nConsolidated Statements of Changes in Stockholders’ Equity\n(in thousands)\nStockholders' Equity\nRetained\nAccumulated\nAdditional\nEarnings\nOther\nTotal\nCommon Stock\nPaid-in\n(Accumulated\nComprehensive\nStockholders’\nShares\nAmount\nCapital\nDeficit)\nIncome (Loss)\nEquity\nBalances at June 30, 2018\n52,758\n$\n$\n219,588\n$\n(6,678)\n$\n(139)\n$\n212,824\nCumulative effect of change in accounting\npolicy (adoption of Topic 606)\n-\n-\n-\n52,672\n-\n52,672\nStock-based compensation\n-\n-\n41,525\n-\n-\n41,525\nStock options exercised\n-\n4,882\n-\n-\n4,882\nIssuance of common stock upon vesting of\nrestricted stock units\n-\n-\n-\n-\n-\nIssuance of common stock under employee\nstock purchase plan\n-\n5,982\n-\n-\n5,982\nNet settlement for taxes and/or exercise\nprice related to equity awards\n(395)\n-\n(29,004)\n-\n-\n(29,004)\nRepurchases of common shares\n(442)\n-\n(34,991)\n-\n-\n(34,991)\nUnrealized gains on securities, net of tax\n-\n-\n-\n-\nNet income\n-\n-\n-\n53,823\n-\n53,823\nBalances at June 30, 2019\n53,075\n$\n$\n207,982\n$\n99,817\n$\n$\n307,964\nStock-based compensation\n-\n-\n49,890\n-\n-\n49,890\nStock options exercised\n-\n3,079\n-\n-\n3,079\nIssuance of common stock upon vesting of\nrestricted stock units\n(1)\n-\n-\n-\nIssuance of common stock under employee\nstock purchase plan\n-\n8,901\n-\n-\n8,901\nNet settlement for taxes and/or exercise\nprice related to equity awards\n(385)\n-\n(41,944)\n-\n-\n(41,944)\nUnrealized gains on securities, net of tax\n-\n-\n-\n-\nNet income\n-\n-\n-\n64,455\n-\n64,455\nBalances at June 30, 2020\n53,792\n$\n$\n227,907\n$\n164,272\n$\n$\n392,908\nStock-based compensation\n-\n-\n65,662\n-\n-\n65,662\nStock options exercised\n-\n3,313\n-\n-\n3,313\nIssuance of common stock upon vesting of\nrestricted stock units\n(1)\n-\n-\n-\nIssuance of common stock under employee\nstock purchase plan\n-\n12,214\n-\n-\n12,214\nNet settlement for taxes and/or exercise\nprice related to equity awards\n(436)\n-\n(67,377)\n-\n-\n(67,377)\nUnrealized losses on securities, net of tax\n-\n-\n-\n-\n(609)\n(609)\nNet income\n-\n-\n-\n70,819\n-\n70,819\nBalances at June 30, 2021\n54,594\n$\n$\n241,718\n$\n235,091\n$\n$\n476,930\nSee accompanying notes to consolidated financial statements.\nPAYLOCITY HOLDING CORPORATION\nConsolidated Statements of Cash Flows\n(in thousands)\nFor the Years Ended June 30,\nCash flows from operating activities:\nNet income\n$\n53,823\n$\n64,455\n$\n70,819\nAdjustments to reconcile net income to net cash provided by operating activities:\nStock-based compensation expense\n38,765\n47,493\n63,052\nDepreciation and amortization expense\n34,564\n37,913\n42,972\nDeferred income tax expense (benefit)\n4,134\n2,754\n(13,642)\nProvision for credit losses\nNet accretion of discounts and amortization of premiums on available-for-sale securities\n(2,230)\n(1,836)\nAmortization of debt issuance costs\n-\nOther\nChanges in operating assets and liabilities:\nAccounts receivable\n(1,188)\n(732)\n(1,654)\nDeferred contract costs\n(34,992)\n(54,944)\n(56,850)\nPrepaid expenses and other\n(196)\n(4,004)\nAccounts payable\n(75)\n(806)\n2,394\nAccrued expenses and other\n13,625\n17,696\n20,297\nTenant improvement allowance\n7,480\n-\n-\nNet cash provided by operating activities\n115,032\n112,655\n124,850\nCash flows from investing activities:\nPurchases of available-for-sale securities and other\n(250,685)\n(400,343)\n-\nProceeds from sales and maturities of available-for-sale securities\n246,243\n410,593\n101,467\nCapitalized internal-use software costs\n(20,142)\n(25,715)\n(28,594)\nPurchases of property and equipment\n(11,280)\n(16,578)\n(9,461)\nLease allowances used for tenant improvements\n(7,480)\n-\n-\nAcquisition of business, net of cash acquired\n-\n(16,714)\n(14,992)\nNet cash provided by (used in) investing activities\n(43,344)\n(48,757)\n48,420\nCash flows from financing activities:\nNet change in client fund obligations\n168,855\n(67,165)\n432,373\nBorrowings under credit facility\n-\n100,000\n-\nRepayment of credit facility\n-\n-\n(100,000)\nPayment of contingent consideration\n(1,000)\n-\n-\nRepurchases of common shares\n(34,991)\n-\n-\nProceeds from exercise of stock options\n-\nProceeds from employee stock purchase plan\n5,982\n8,901\n12,214\nTaxes paid related to net share settlement of equity awards\n(24,207)\n(38,943)\n(64,191)\nPayment of debt issuance costs\n-\n(701)\n(64)\nNet cash provided by financing activities\n114,724\n2,092\n280,478\nNet change in cash, cash equivalents and funds held for clients' cash and cash equivalents\n186,412\n65,990\n453,748\nCash, cash equivalents and funds held for clients' cash and cash equivalents-beginning of year\n1,239,731\n1,426,143\n1,492,133\nCash, cash equivalents and funds held for clients' cash and cash equivalents-end of year\n$\n1,426,143\n$\n1,492,133\n$\n1,945,881\nSupplemental Disclosure of Non-Cash Investing and Financing Activities\nBuild-out allowances received from landlords\n$\n1,264\n$\n-\n$\n-\nPurchases of property and equipment and internal-use software, accrued but not paid\n$\n4,260\n$\n$\nLiabilities assumed for acquisition\n$\n-\n$\n$\nSupplemental Disclosure of Cash Flow Information\nCash paid for interest\n$\n-\n$\n$\nCash paid (refunds received) for income taxes\n$\n$\n$\n(136)\nReconciliation of cash, cash equivalents and funds held for clients' cash and cash equivalents to the Consolidated Balance Sheets\nCash and cash equivalents\n$\n132,476\n$\n250,851\n$\n202,287\nFunds held for clients' cash and cash equivalents\n1,293,667\n1,241,282\n1,743,594\nTotal cash, cash equivalents and funds held for clients' cash and cash equivalents\n$\n1,426,143\n$\n1,492,133\n$\n1,945,881\nSee accompanying notes to consolidated financial statements.\nPAYLOCITY HOLDING CORPORATION\nNotes to the Consolidated Financial Statements\n(all amounts in thousands, except per share data)\n(1) Organization and Description of Business\nPaylocity Holding Corporation (the “Company”) is a cloud-based provider of payroll and human capital management software solutions. Services are provided in a Software-as-a-Service (“SaaS”) delivery model utilizing the Company’s cloud-based platform. The Company’s comprehensive product suite, comprised of payroll, human capital management, workforce management, talent management, benefits, modern workforce solutions and analytics & insights, delivers a unified platform that allows clients to make strategic decisions while promoting a modern workplace and improving employee engagement.\n(2) Summary of Significant Accounting Policies\n(a) Basis of Presentation, Consolidation, and Use of Estimates\nThe accompanying consolidated financial statements of the Company have been prepared pursuant to the rules and regulations of the United States Securities and Exchange Commission (the “SEC”).\nThe preparation of consolidated financial statements in conformity with U.S. generally accepted accounting principles (“GAAP”) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates. Future events and their effects cannot be predicted with certainty; accordingly, accounting estimates require the exercise of judgment. Accounting estimates used in the preparation of these consolidated financial statements change as new events occur, as more experience is acquired, as additional information is obtained and as the operating environment changes.\nThe consolidated financial statements include the accounts of the Company and its wholly owned subsidiaries. All intercompany accounts and transactions have been eliminated in consolidation.\nBeginning in fiscal 2020, the Company simplified the presentation of revenue and cost of revenues on its Consolidated Statements of Operations and Comprehensive Income. The line items “Recurring fees” and “Implementation services and other” have been combined into one revenue line: “Recurring and other revenue”. Likewise, the line items “Cost of revenues - recurring revenues” and “Cost of revenues - implementation services and other” have been combined into one line: “Cost of revenues”. The Company changed the presentation of revenue and cost of revenues as Implementation services and other has become a smaller component of its overall revenue mix due to the human capital management (“HCM”) suite becoming a larger part of the portfolio. Previously reported results for the year ended June 30, 2019 have been reclassified to conform to the current presentation.\n(b) Concentrations of Risk\nThe Company regularly maintains cash balances that exceed Federal Depository Insurance Corporation limits. No individual client represents 10% or more of total revenues. For all periods presented, substantially all of total revenues were generated by clients in the United States.\n(c) Cash and Cash Equivalents\nThe Company considers all highly liquid investments with an original maturity of three months or less when purchased to be cash equivalents.\n(d) Funds Held For Clients, Corporate Investments and Client Fund Obligations\nThe Company obtains funds from clients in advance of performing payroll and payroll tax filing services on behalf of those clients. Funds held for clients represent assets that are used solely for the purposes of satisfying the obligations to remit funds relating to payroll and payroll tax filing services. The Company has classified Funds held for\nclients as a current asset since these funds are held solely for the purposes of satisfying the client fund obligations. Funds held for clients is primarily comprised of cash and cash equivalents invested in demand deposit accounts. The Company also invests a portion of its funds held for clients and corporate funds in marketable securities.\nMarketable securities classified as available-for-sale are recorded at fair value on the Consolidated Balance Sheets. Unrealized gains and losses, net of applicable income taxes, are reported as Other comprehensive income (loss) in the Consolidated Statements of Operations and Comprehensive Income. Interest on marketable securities included in Funds held for clients is reported as Interest income on funds held for clients and interest on Corporate investments is reported as Other income on the Consolidated Statements of Operations and Comprehensive income, respectively.\nThe Company evaluates whether a decline in an individual security’s fair value as compared to its amortized cost basis resulted from credit loss or other factors by comparing the present value of cash flows expected to be collected from the impaired security with its amortized cost basis. If the security’s amortized cost basis exceeds the present value of expected cash flows, the Company records credit impairment loss through an allowance for credit loss. The Company did not recognize any credit impairment losses during the years ended June 30, 2019, 2020 or 2021.\nClient fund obligations represent the Company’s contractual obligations to remit funds to satisfy clients’ payroll and tax payment obligations and are recorded in the accompanying balance sheets at the time that the Company obtains funds from clients. The client fund obligations represent liabilities that will be repaid within one year of the balance sheet date.\n(e) Accounts Receivable\nAccounts receivable are recorded at the invoiced amount and do not bear interest. Amounts collected on trade accounts receivable are included in Net cash provided by operating activities in the Consolidated Statements of Cash Flows. The Company maintains an allowance for credit losses reflecting expected credit losses in its accounts receivable portfolio. In establishing the required allowance, management considers historical losses adjusted to take into account current market conditions and the Company’s clients’ financial conditions, the amount of receivables in dispute, the current receivables aging and current payment patterns. The Company reviews its allowance for credit losses quarterly. Past due balances over 60 days and over a specified amount are reviewed individually for collectability. All other balances are reviewed on a pooled basis. Account balances are charged off against the allowance after all commercially reasonable means of collection have been exhausted and the potential for recovery is considered remote. The Company does not have any off-balance-sheet credit exposure related to its clients.\nActivity in the allowance for credit losses related to accounts receivable was as follows:\nFor the Years Ended June 30,\nBalance at the beginning of the year\n$\n$\n$\nCharged to expense\nWrite-offs\n(185)\n(165)\n(133)\nBalance at the end of the year\n$\n$\n$\n(f) Deferred Contract Costs\nThe Company defers certain selling and commission costs that meet the capitalization criteria under ASC 340-40. The Company also capitalizes certain costs to fulfill a contract related to its proprietary products if they are identifiable, generate or enhance resources used to satisfy future performance obligations and are expected to be recovered under ASC 340-40. Implementation fees are treated as nonrefundable upfront fees and the related implementation costs are required to be capitalized and amortized over the expected period of benefit, which is the period in which the Company expects to recover the costs and enhance its ability to satisfy future performance obligations.\nThe Company utilizes the portfolio approach to account for both the cost of obtaining a contract and the cost of fulfilling a contract. These capitalized costs are amortized over the expected period of benefit, which has been determined to be over 7 years based on the Company’s average client life and other qualitative factors, including rate of technological changes. The Company does not incur any additional costs to obtain or fulfill contracts upon renewal. The\nCompany recognizes additional selling and commission costs and fulfillment costs when an existing client purchases additional services. These additional costs only relate to the additional services purchased and do not relate to the renewal of previous services.\n(g) Prepaid Expenses and Other Assets\nPrepaid expenses and other assets consist primarily of prepaid licensing fees, prepaid insurance premiums, deposits with vendors and time clocks available for sale or lease.\n(h) Capitalized Internal-Use Software\nThe Company applies Financial Accounting Standards Board (“FASB”) Accounting Standards Codification (“ASC”) Topic 350-40, Intangibles-Goodwill and Other-Internal-Use Software, to the accounting for costs of internal-use software. Internal-use software costs are capitalized when module development begins, it is probable that the project will be completed, and the software will be used as intended. Costs associated with preliminary project stage activities, training, maintenance and all other post implementation stage activities are expensed as incurred. The Company also capitalizes certain costs related to specific upgrades and enhancements when it is probable the expenditures will result in significant additional functionality. The capitalization policy provides for the capitalization of certain payroll costs for employees who are directly associated with developing internal-use software as well as certain external direct costs, such as consulting fees. Capitalized employee costs are limited to the time directly spent on such projects.\nCapitalized internal-use software costs are amortized on a straight-line basis over the estimated useful lives, generally over a 24 or 36-month period. Management evaluates the useful lives of these assets on an annual basis and tests for impairment whenever events or changes in circumstances occur that could impact the recoverability of these assets.\n(i) Property and Equipment and Long-Lived Assets\nProperty and equipment are stated at cost. Depreciation on property and equipment is calculated on the straight-line method over the estimated useful lives of the assets, generally three to seven years for most classes of assets, or over the term of the related lease for leasehold improvements.\nLong-lived assets, such as property and equipment, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. If circumstances require a long-lived asset or asset group to be tested for possible impairment, the Company first compares the undiscounted cash flows expected to be generated by that asset or asset group to its carrying amount. If the carrying amount of the long-lived asset or asset group is not recoverable on an undiscounted cash flow basis, an impairment is recognized to the extent that the carrying amount exceeds its fair value. Fair value is determined through various valuation techniques including discounted cash flow models, quoted market values and third-party independent appraisals, as considered necessary.\n(j) Intangible Assets, Net of Accumulated Amortization\nIntangible assets are comprised primarily of acquired client relationships, proprietary technology, trade name and non-solicitation agreements and are reported net of accumulated amortization on the Consolidated Balance Sheets. Client relationships use the straight-line method of amortization over a five to nine-year time frame from the date of acquisition, while proprietary technology and trade name use the straight-line method of amortization over a five-year period from the date of acquisition. Non-solicitation agreements use the straight-line method of amortization over the term of the related agreements. The Company tests intangible assets for potential impairment when events or changes in circumstances indicate that the carrying value of such assets may not be recoverable.\n(k) Goodwill\nGoodwill is an asset representing the future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized. Goodwill is not amortized, but instead is tested for impairment at the reporting unit level. If the fair value of the reporting unit is less than its carrying amount, the Company would record an impairment charge for the amount by which the carrying amount exceeds the reporting unit’s fair value, but the loss recognized should not exceed the amount of goodwill allocated to the reporting unit.\nThe Company performs its annual impairment review of goodwill in its fiscal fourth quarter or when a triggering event occurs between annual impairment tests. No impairment was recorded in fiscal 2019, 2020 or 2021 as a result of the Company’s qualitative assessments over its single reporting segment.\n(l) Leases\nThe Company adopted Accounting Standards Update (“ASU”) 2016-02, Leases (Topic 842) (“Topic 842”), effective July 1, 2019. The Company determines if an arrangement is a lease at agreement inception. Operating leases are included in Operating lease right-of-use assets, Accrued expenses, and Long-term operating lease liabilities in the Consolidated Balance Sheets. Right-of-use assets represent the Company’s right to use an underlying asset for the lease term and lease liabilities represent the Company’s obligation to make lease payments arising from the lease. Operating lease right-of-use assets and liabilities are recognized at the lease commencement date based on the present value of lease payments over the lease term. In determining the present value of lease payments, the Company uses its incremental borrowing rate based on the information available at the lease commencement date. The operating lease right-of-use assets also include any lease payments made at or before the commencement date and are reduced by any lease incentives received. The Company’s lease terms may include options to renew or extend a lease. The Company recognizes amounts in Operating lease right-of-use assets and Operating lease liabilities when it is reasonably certain it will exercise such options. Leases with an initial term of 12 months or less are not recorded on the balance sheet. Lease expense is recognized on a straight-line basis over the expected lease term.\nThe Company’s most significant leases are real estate leases of office space. The remaining operating leases are primarily comprised of leases of printers and other equipment. For all leases, the Company has elected the practical expedient permitted under Topic 842 to combine lease and non-lease components. As a result, non-lease components, such as common area or equipment maintenance charges, are accounted for as a single lease element. The Company does not have any material finance leases.\nFixed lease expense payments are recognized on a straight-line basis over the lease term. Variable lease payments vary because of changes in facts or circumstances occurring after the commencement date, other than the passage of time, and are often due to changes in an external market rate or the value of an index (e.g. Consumer Price Index). Certain of the Company’s operating lease agreements include variable payments that are passed through by the landlord, such as insurance, taxes, and common area maintenance, payments based on the usage of the asset, and rental payments adjusted periodically for inflation. Variable payments are expensed as incurred and included within variable rent expense.\nThe Company’s lease agreements do not contain material residual value guarantees, restrictions, or covenants.\n(m) Income Taxes\nIncome taxes are accounted for under the asset and liability method. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases and operating loss and tax credit carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date.\nDeferred tax assets may be reduced by a valuation allowance to the extent we determine it is more likely than not that some portion or all of the deferred tax assets will not be realized. Management judgment is required in determining the period in which the reversal of a valuation allowance should occur. The Company is required to consider all available evidence, both positive and negative, such as historical levels of income and future forecasts of taxable income among other items, in determining whether a full or partial release of its valuation allowance is required. The Company is also required to schedule future taxable income in accordance with accounting standards that address income taxes to assess the appropriateness of a valuation allowance, which further requires the exercise of significant management judgment. The Company’s accounting for deferred tax consequences represents the best estimate of those future events.\nThe Company recognizes the effect of income tax positions only if those positions are more likely than not of being sustained. Recognized income tax positions are measured at the largest amount that is greater than 50% likely of being realized. Changes in recognition or measurement are reflected in the period in which the change in judgment occurs. When applicable, the Company records interest and penalties as an element of income tax expense.\nRefer to Note 13 for additional information on income taxes.\n(n) Revenue Recognition\nThe Company applies Accounting Standards Codification Topic 606, Revenue from Contracts with Customers (“Topic 606”). Topic 606 requires revenue to be recognized when an entity transfers control of goods or services to a customer in an amount that reflects the consideration to which a company also expects to be entitled to for those goods or services. To achieve this core principle, the Company recognizes revenue from contracts with customers based on the following five steps:\n1) Identify the contract with a customer;\n2) Identify the performance obligations in the contract;\n3) Determine the transaction price;\n4) Allocate the transaction price to performance obligations in the contract; and\n5) Recognize revenue when or as the Company satisfies a performance obligation.\nThe Company derives its revenue from contracts predominantly from recurring and non-recurring service fees. While the majority of its agreements are generally cancellable by the client on 60 days’ notice or less, the Company offers term agreements to its clients, which are generally two years in length. Recurring fees are derived from payroll, timekeeping, and HR-related cloud-based computing services as follows:\n● Payroll processing and related services, including payroll reporting and tax filing services are delivered on a weekly, biweekly, semi-monthly, or monthly basis depending upon the payroll frequency of the client and on an annual basis if a client selects W-2 preparation and processing services,\n● Time and attendance reporting services, including time clock rentals, are delivered on a monthly basis, and\n● Cloud-based HR software solutions, including employee administration and benefits enrollment and administration, are delivered on a monthly basis.\nThe majority of the Company’s recurring fees are satisfied over time as services are provided. The performance obligations related to payroll services are satisfied upon the processing of the client’s payroll with the fee charged and collected based on a per employee per payroll frequency fee. The performance obligations related to time and attendance services and HR related services are satisfied over time each month with the fee charged and collected based on a per employee per month fee. For subscription-based fees which can include payroll, time and attendance, and HR related services, the Company recognizes the applicable recurring fees over time each month with the fee charged and collected based on a per employee per month fee.\nThe Company has certain optional performance obligations that are satisfied at a point in time including the sales of time clocks and W-2 services.\nNon-recurring service fees consist mainly of nonrefundable implementation fees, which involve setting the client up in, and loading data into, the Company’s cloud-based modules. These implementation activities are considered set-up activities. The Company has determined that the nonrefundable upfront fees provide certain clients with a material right to renew the contract. Implementation fees are deferred and amortized generally over a period up to 24 months.\nSales taxes collected from clients and remitted to governmental authorities where applicable are accounted for on a net basis and therefore are excluded from revenues in the Statements of Operations and Comprehensive Income.\nInterest income earned on funds held for clients is recognized in Interest income on funds held for clients when earned as the collection, holding and remittance of these funds are components of providing services to clients.\n(o) Cost of Revenues\nCost of revenues consists primarily of costs to provide payroll and HCM solutions relating to the provision of ongoing client support and implementation activities and also includes amortization of capitalized internal-use software. The Company generally expenses these costs when incurred except for costs related to the implementation of the Company’s proprietary products. These costs are capitalized and amortized over a period of 7 years.\n(p) Advertising\nAdvertising costs are expensed as incurred. Advertising costs amounted to $283, $1,023 and $3,189 for the June 30, 2019, 2020 and 2021, respectively.\n(q) Stock-Based Compensation\nThe Company recognizes all employee stock-based compensation as a cost in the financial statements. Equity-classified awards, including those under the 2014 Employee Stock Purchase Plan (“ESPP”), are measured at the grant date fair value of the award and expense is recognized, net of assumed forfeitures, on a straight-line basis over the requisite service period for each separately vesting portion of the award. For market share units, the Company estimates grant date fair value using a discrete model based on multiple stock price-paths developed through the use of Monte Carlo simulation. For estimated shares purchasable under the ESPP, the Company estimates grant date fair value using the Black-Scholes option-pricing model. The Company periodically updates the assumed forfeiture rates for actual experience over award vesting term.\n(r) Commitments and Contingencies\nLiabilities for loss contingencies arising from claims, assessments, litigation, fines, and penalties and other sources are recorded when it is probable that a liability has been incurred and the amount can be reasonably estimated. Legal costs incurred in connection with loss contingencies are expensed as incurred.\n(s) Segment Information\nThe Company’s chief operating decision maker reviews the financial results of the Company in total when evaluating financial performance and for purposes of allocating resources. The Company has thus determined that it operates in a single reporting segment.\n(t) Recently Adopted Accounting Standards\nIn February 2016, the FASB issued ASU 2016-02, Leases (Topic 842), which requires lessees to recognize leases on-balance sheet and disclose key information about leasing arrangements. The new standard establishes a right-of-use (“ROU”) model that requires a lessee to recognize a ROU asset and lease liability on the balance sheet for all leases with a term longer than 12 months. Leases will be classified as finance or operating, with classification affecting the pattern and classification of expense recognition in the income statement.\nThe Company adopted the new standard on July 1, 2019 using the modified retrospective method and the transition relief guidance provided by the FASB in ASU 2018-11, Leases (Topic 842): Targeted Improvements. Consequently, the Company did not update financial information or provide disclosures required under the new standard for dates and periods prior to July 1, 2019. The Company elected the package of practical expedients and did not reassess prior conclusions on whether contracts are or contain a lease, lease classification, and initial direct costs. In addition, the Company adopted the lessee practical expedient to combine lease and non-lease components for all asset classes and elected to not recognize ROU assets and lease liabilities for leases with a term of 12 months or less.\nAdoption of the new standard resulted in the Company recording operating lease ROU assets and operating lease liabilities of $52,083 and $83,852, respectively, as of July 1, 2019. The ROU assets were recorded net of $31,769 in deferred rent adjustments that were previously recorded in Accrued expenses and Deferred rent on the Consolidated Balance Sheets as of June 30, 2019. The adoption of this standard did not result in any cumulative-effect adjustments to Retained earnings. Additionally, there was no impact on the Company’s Consolidated Statements of Operations and Comprehensive Income or the Consolidated Statements of Cash Flows as a result of the adoption of\nTopic 842 for the year ended June 30, 2019. Refer to Note 2(l) and Note 12 for additional disclosures over the Company’s leases.\nIn June 2016, the FASB issued ASU 2016-13, Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments, which requires the measurement and recognition of expected credit losses for financial instruments held at amortized cost, including trade receivables. Under ASU 2016-13, the Company assesses its allowance for credit losses on accounts receivable by taking into consideration current economic conditions, reasonable and supportable forecasts, as well as past experience including historical write-off trends and client-specific circumstances. The new standard also eliminated the concept of other-than-temporary impairment and requires expected credit losses related to available-for-sale debt securities to be recorded through an allowance for credit losses rather than as a reduction in the amortized cost basis of the securities. The Company adopted this standard effective July 1, 2020, using a modified retrospective approach, and the adoption did not have a material impact on the Company’s financial statements.\nIn August 2018, the FASB issued ASU 2018-13, Fair Value Measurement (Topic 820): Disclosure Framework - Changes to the Disclosure Requirements for Fair Value Measurement (“ASU 2018-13”), which amends the requirements for fair value measurement disclosures. ASU 2018-13 removes, modifies or adds certain disclosure requirements under GAAP. The Company adopted this standard on July 1, 2020, and removed or modified disclosure requirements retrospectively to all periods presented, whereas any new requirements are being applied prospectively from the adoption date. The adoption of this standard did not have a material impact on the Company’s financial statements.\nIn December 2019, the FASB issued ASU 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes (“ASU 2019-12”) which provides guidance to reduce complexity in certain areas of accounting for income taxes. ASU 2019-12 removes certain exceptions to the general principles in Topic 740 and simplifies various aspects of the current guidance to promote consistent application of the standard among reporting entities. The Company adopted ASU 2019-12 on July 1, 2020, and the adoption of this standard did not have a material impact on the Company’s financial statements.\n(u) Recently Issued Accounting Standards\nFrom time to time, new accounting pronouncements are issued by the FASB or other standard setting bodies that are adopted by the Company as of the specified effective date. Unless otherwise discussed, the Company believes that the impact of other recently issued standards that are not yet effective will not have a material impact on the Company’s consolidated financial statements upon adoption.\n(3) Revenue\nThe following table disaggregates revenue by Recurring fees and Implementation services and other, which the Company believes depicts the nature, amount and timing of its revenue:\nYear Ended\nJune 30,\nRecurring fees\n$\n436,955\n$\n526,267\n$\n609,658\nImplementation services and other\n10,797\n19,945\n22,067\nTotal revenues from contracts\n$\n447,752\n$\n546,212\n$\n631,725\nDeferred revenue\nThe timing of revenue recognition for recurring revenue is consistent with the timing of invoicing as they occur simultaneously upon the client payroll-processing period or by month. As such, the Company does not recognize contract assets or liabilities related to recurring revenue.\nThe nonrefundable upfront fees related to implementation services are invoiced with the client’s first payroll period. The Company defers and amortizes these nonrefundable upfront fees generally over a period up to 24 months based on the type of contract. The following table summarizes the changes in deferred revenue (i.e. contract liability) related to these nonrefundable upfront fees as follows:\nYear Ended\nJune 30,\nBalance at beginning of the year\n$\n6,289\n$\n8,434\nDeferral of revenue\n15,998\n16,106\nRevenue recognized\n(13,853)\n(15,806)\nBalance at end of the year\n$\n8,434\n$\n8,734\nDeferred revenue related to these nonrefundable upfront fees are recorded within accrued expenses and other long-term liabilities on the consolidated balance sheets. The Company expects to recognize these deferred revenue balances of $7,068 in fiscal 2022, $1,600 in fiscal 2023, and $66 thereafter.\nDeferred contract costs\nThe following tables present the deferred contract costs balances and the related amortization expense for these deferred contract costs:\nYear Ended June 30, 2020\nBeginning\nCapitalized\nEnding\nBalance\nCosts\nAmortization\nBalance\nCosts to obtain a new contract\n$\n82,103\n$\n53,529\n$\n(22,057)\n$\n113,575\nCosts to fulfill a contract\n20,996\n28,893\n(5,421)\n44,468\nTotal\n$\n103,099\n$\n82,422\n$\n(27,478)\n$\n158,043\nYear Ended June 30, 2021\nBeginning\nCapitalized\nEnding\nBalance\nCosts\nAmortization\nBalance\nCosts to obtain a new contract\n$\n113,575\n$\n60,833\n$\n(28,690)\n$\n145,718\nCosts to fulfill a contract\n44,468\n34,574\n(9,867)\n69,175\nTotal\n$\n158,043\n$\n95,407\n$\n(38,557)\n$\n214,893\nDeferred contract costs are recorded within Deferred contract costs and Long-term deferred contract costs on the Consolidated Balance Sheets. Amortization of deferred contract costs is recorded in Cost of revenues, Sales and marketing, and General and administrative in the Consolidated Statements of Operations and Comprehensive Income. The Company did not record any impairment losses associated with its deferred contract costs during the years ended June 30, 2019, 2020 or 2021.\nRemaining Performance Obligations\nThe Company has applied the practical expedients as allowed under Topic 606 and elects not to disclose the value of unsatisfied performance obligations for contracts that have an original expected duration of one year or less and contracts for which the variable consideration is allocated entirely to wholly unsatisfied performance obligations. The Company’s remaining performance obligations related to minimum monthly fees on its term-based contracts was approximately $47,854 as of June 30, 2021, which will be generally recognized over the next 24 months.\n(4) Corporate Investments and Funds Held for Clients\nCorporate investments and funds held for clients consist of the following:\nJune 30, 2020\nGross\nGross\nAmortized\nunrealized\nunrealized\nType of Issue\ncost\ngains\nlosses\nFair value\nCash and cash equivalents\n$\n250,851\n$\n-\n$\n-\n$\n250,851\nFunds held for clients' cash and cash equivalents\n1,241,282\n-\n-\n1,241,282\nAvailable-for-sale securities:\nCommercial paper\n6,643\n-\n6,649\nCorporate bonds\n44,343\n-\n44,757\nAsset-backed securities\n49,978\n-\n50,402\nU.S. treasury securities\n21,302\n-\n21,369\nTotal available-for-sale securities (1)\n122,266\n-\n123,177\nTotal investments\n$\n1,614,399\n$\n$\n-\n$\n1,615,310\n(1) Included within the fair value of total available-for-sale securities above is $37,155 of Corporate investments and $86,022 of Funds held for clients.\nJune 30, 2021\nGross\nGross\nAmortized\nunrealized\nunrealized\nType of Issue\ncost\ngains\nlosses\nFair value\nCash and cash equivalents\n$\n202,287\n$\n-\n$\n-\n$\n202,287\nFunds held for clients' cash and cash equivalents\n1,743,594\n-\n-\n1,743,594\nAvailable-for-sale securities:\nCorporate bonds\n13,390\n-\n13,460\nAsset-backed securities\n7,062\n-\n7,079\nTotal available-for-sale securities (2)\n20,452\n-\n20,539\nTotal investments\n$\n1,966,333\n$\n$\n-\n$\n1,966,420\n(2) Included within the fair value of total available-for-sale securities above is $4,456 of Corporate investments and $16,083 of Funds held for clients.\nCash and cash equivalents and funds held for clients’ cash and cash equivalents included demand deposit accounts and money market funds as of June 30, 2020 and 2021. All of the Company’s available-for-sale securities had expected maturities of one year or less at June 30, 2021.\nClassification of investments on the consolidated balance sheets is as follows:\nJune 30,\nJune 30,\nCash and cash equivalents\n$\n250,851\n$\n202,287\nCorporate investments\n34,556\n4,456\nFunds held for clients\n1,327,304\n1,759,677\nLong-term prepaid expenses and other\n2,599\n-\nTotal investments\n$\n1,615,310\n$\n1,966,420\nThere were no available-for sale securities in an unrealized loss position as of June 30, 2020 or 2021. The Company regularly reviews the composition of its portfolio to determine the existence of credit impairment. The Company did not recognize any credit impairment losses during the years ended June 30, 2019, 2020 or 2021. All securities in the Company's portfolio held an A- rating or better as of June 30, 2021.\nThe Company did not make any material reclassification adjustments out of Accumulated other comprehensive income for realized gains and losses on the sale of available-for-sale securities during the years ended June 30, 2019,\n2020 or 2021. Gross realized gains and losses on the sale of available-for-sale securities were immaterial for the years ended June 30, 2019, 2020 and 2021.\n(5) Fair Value Measurement\nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. A three-level fair value hierarchy prioritizes the inputs used to measure fair value. The hierarchy requires entities to maximize the use of observable inputs and minimize the use of unobservable inputs. The three levels of inputs used to measure fair value are as follows:\n● Level 1-Quoted prices in active markets for identical assets and liabilities.\n● Level 2-Quoted prices in active markets for similar assets and liabilities, or other inputs that are observable for the asset or liability, either directly or indirectly, for substantially the full term of the financial instrument.\n● Level 3-Unobservable inputs that are supported by little or no market activity and that are significant to the fair value of the assets and liabilities. This includes certain pricing models, discounted cash flow methodologies and similar techniques that use significant unobservable inputs.\nThe Company measures any cash and cash equivalents, accounts receivable, accounts payable and client fund obligations at fair value on a recurring basis using Level 1 inputs. The Company considers the recorded value of these financial assets and liabilities to approximate the fair value of the respective assets and liabilities at June 30, 2020 and 2021 based upon the short-term nature of these assets and liabilities.\nMarketable securities, consisting of securities classified as available-for-sale as well as certain cash equivalents, are recorded at fair value on a recurring basis using Level 2 inputs obtained from an independent pricing service. Available-for-sale securities include commercial paper, corporate bonds, asset-backed securities and U.S. treasury securities. The independent pricing service utilizes a variety of inputs including benchmark yields, broker/dealer quoted prices, reported trades, issuer spreads as well as other available market data. The Company, on a sample basis, validates the pricing from the independent pricing service against another third-party pricing source for reasonableness. The Company has not adjusted any prices obtained by the independent pricing service, as it believes they are appropriately valued. There were no available-for-sale securities classified in Level 3 of the fair value hierarchy at June 30, 2020 or 2021.\nThe fair value level for the Company’s cash and cash equivalents and available-for-sale securities is as follows:\nJune 30, 2020\nTotal\nLevel 1\nLevel 2\nLevel 3\nCash and cash equivalents\n$\n250,851\n$\n250,851\n$\n-\n$\n-\nFunds held for clients' cash and cash equivalents\n1,241,282\n1,241,282\n-\n-\nAvailable-for-sale securities:\nCommercial paper\n6,649\n-\n6,649\n-\nCorporate bonds\n44,757\n-\n44,757\n-\nAsset-backed securities\n50,402\n-\n50,402\n-\nU.S. treasury securities\n21,369\n-\n21,369\n-\nTotal available-for-sale securities\n123,177\n-\n123,177\n-\nTotal investments\n$\n1,615,310\n$\n1,492,133\n$\n123,177\n$\n-\nJune 30, 2021\nTotal\nLevel 1\nLevel 2\nLevel 3\nCash and cash equivalents\n$\n202,287\n$\n202,287\n$\n-\n$\n-\nFunds held for clients' cash and cash equivalents\n1,743,594\n1,743,594\n-\n-\nAvailable-for-sale securities:\nCorporate bonds\n13,460\n-\n13,460\n-\nAsset-backed securities\n7,079\n-\n7,079\n-\nTotal available-for-sale securities\n20,539\n-\n20,539\n-\nTotal investments\n$\n1,966,420\n$\n1,945,881\n$\n20,539\n$\n-\nThe Company determined that the carrying value of long-term debt under its revolving credit facility approximated fair value, which was classified as Level 2 as of June 30, 2020, because interest rates associated with the borrowings reflected market rates.\n(6) Business Combinations\nThe Company accounts for business combinations in accordance with ASC 805, Business Combinations. The Company recorded the acquisitions disclosed below using the acquisition method of accounting and recognized assets and liabilities at their fair values as of the date of acquisitions, with the excess recorded to goodwill.\nIn April 2020, the Company acquired all of the shares outstanding of VidGrid, Inc. (“VidGrid”) through a merger for purchase price consideration of $17,256, which was paid in cash upon closing. VidGrid, Inc. is a leading video platform provider that enables peer-to-peer video learning courses, transforming video into two-way communication. This transaction expands the Company’s product functionality around workplace video communication and reaffirms its commitment to stronger employee collaboration, engagement and retention while helping clients prepare for the workplaces of the future. The allocation of the purchase price for VidGrid is approximately $12,065 of goodwill, $2,962 of proprietary technology and other immaterial assets and liabilities.\nIn November 2020, the Company acquired all of the shares outstanding of Samepage Labs Inc. (“Samepage”) through a merger for purchase price consideration of $15,018, which was paid in cash upon closing. Samepage offers digital collaboration tools including task management, file sharing, real-time collaboration and more. This transaction expands the Company’s product functionality in these areas and demonstrates its commitment to building a modern workforce suite of solutions that meet the needs of HR teams and employees. The allocation of the purchase price for Samepage is approximately $11,995 of goodwill, $3,167 of proprietary technology and other immaterial assets and liabilities.\nThe results from these acquisitions have been included in the Company’s consolidated financial statements since the closing of the acquisitions. Pro forma information was not presented because the effect of the acquisitions was not material to the Company’s consolidated financial statements. The goodwill associated with these acquisitions is not deductible for income tax purposes. Direct costs related to the acquisition were recorded as General and administrative expenses as incurred.\n(7) Capitalized Internal-Use Software\nCapitalized internal-use software and accumulated amortization were as follows:\nYear ended June 30,\nCapitalized internal-use software\n$\n119,178\n$\n150,922\nAccumulated amortization\n(82,677)\n(105,904)\nCapitalized internal-use software, net\n$\n36,501\n$\n45,018\nAmortization of capitalized internal-use software amounted to $16,921, $19,261 and $23,227 for the June 30, 2019, 2020 and 2021, respectively and is included in Cost of revenues.\n(8) Property and Equipment\nThe major classes of property and equipment are as follows as of June 30:\nYear ended June 30,\nOffice equipment\n$\n4,619\n$\n5,211\nComputer equipment\n42,936\n45,420\nFurniture and fixtures\n12,723\n13,104\nSoftware\n6,609\n6,641\nLeasehold improvements\n46,192\n46,814\nTime clocks rented by clients\n4,967\n5,399\nTotal\n118,046\n122,589\nAccumulated depreciation\n(51,309)\n(62,754)\nProperty and equipment, net\n$\n66,737\n$\n59,835\nDepreciation expense amounted to $15,392, $16,129 and $15,905 for the June 30, 2019, 2020 and 2021, respectively.\n(9) Goodwill and Intangible Assets\nThe following table summarizes changes in goodwill during the years presented below:\nYear ended June 30,\nBalance at beginning of year\n$\n9,590\n$\n21,655\nAdditions attributable to acquisitions\n12,065\n11,995\nBalance at end of year\n$\n21,655\n$\n33,650\nRefer to Note 6 for further details on the acquisitions during the years ended June 30, 2020 and 2021.\nThe Company’s amortizable intangible assets and estimated useful lives are as follows:\nWeighted\naverage\nYear ended June 30,\nuseful\nlife (years)\nClient relationships\n$\n19,200\n$\n19,200\n8.2\nProprietary technology\n2,962\n6,129\n5.0\nNon-solicitation agreements\n1,350\n1,600\n3.1\nTrade name\n5.0\nTotal\n23,862\n27,369\nAccumulated amortization\n(10,502)\n(14,342)\nIntangible assets, net\n$\n13,360\n$\n13,027\nAmortization expense for acquired intangible assets was $2,251, $2,523 and $3,840 for the June 30, 2019, 2020 and 2021, respectively. Future amortization expense for acquired intangible assets is as follows, as of June 30, 2021:\nFiscal 2022\n$\n4,093\nFiscal 2023\n3,919\nFiscal 2024\n2,914\nFiscal 2025\n1,860\nFiscal 2026\nTotal\n$\n13,027\n(10) Accrued Expenses\nThe components of accrued expenses are as follows:\nYear ended June 30,\nAccrued payroll and personnel costs\n$\n53,284\n$\n73,969\nOperating lease liabilities\n8,083\n7,549\nDeferred revenue\n8,777\n9,442\nOther\n9,737\n12,149\nTotal accrued expenses\n$\n79,881\n$\n103,109\n(11) Debt\nIn July 2019, the Company entered into a five-year revolving credit agreement with PNC Bank, National Association, and other lenders, which is secured by substantially all of the Company’s assets, subject to certain restrictions. The revolving credit agreement provides for a senior secured revolving credit facility (the “credit facility”) under which the Company may borrow up to $250,000, which may be increased to up to $375,000, subject to obtaining additional lender commitments and certain approvals and satisfying other requirements. The credit facility is scheduled to expire in July 2024, and any borrowings outstanding will mature and be payable upon such expiration. In April 2020, the Company borrowed $100,000 under the credit facility, which the Company repaid during the third quarter of fiscal 2021. The Company incurred interest expense related to this borrowing at an average interest rate of 1.04%.\nThe proceeds of any borrowings are to be used to fund working capital, capital expenditures and general corporate purposes, including permitted acquisitions, permitted investments, permitted distributions and share repurchases. The Company may generally borrow, prepay and reborrow under the credit facility and terminate or reduce the lenders’ commitments at any time prior to revolving credit facility expiration without a premium or a penalty, other than customary “breakage” costs with respect to London Interbank Offered Rate (“LIBOR”) revolving loans.\nAny borrowings under the credit facility generally bear interest, at the Company’s option, at a rate per annum determined by reference to either the LIBOR (or a replacement index for the LIBOR rate) or an adjusted base rate, in each case plus an applicable margin ranging from 0.875% to 1.375% and 0.0% to 0.375%, respectively, based on the then-applicable net senior secured leverage ratio. Additionally, the Company is required to pay certain commitment, letter of credit fronting and letter of credit participation fees on available and/or undrawn portions of the credit facility.\nUnder the credit facility, the Company is required to comply with certain customary affirmative and negative covenants, including a requirement to maintain a maximum net total leverage ratio of not greater than 4.00 to 1.00, a maximum net senior secured leverage ratio of not greater than 3.50 to 1.00 and a minimum interest coverage ratio of not less than 3.00 to 1.00. As of June 30, 2021, the Company was in compliance with all of the aforementioned covenants.\n(12) Leases\nThe Company primarily leases office space under non-cancellable operating leases expiring on various dates from July 2021 through October 2032. The leases provide for increasing annual base rents and oblige the Company to fund its proportionate share of operating expenses and, in certain cases, real estate taxes. The Company also leases various types of office and production related equipment under non-cancellable operating leases expiring on various dates from November 2021 through July 2024.\nThe components of operating lease expense were as follows:\nYear ended June 30,\nOperating lease cost\n$\n9,686\n$\n9,139\nShort-term lease cost\nVariable lease cost\n3,167\n4,796\nTotal lease costs\n$\n12,893\n$\n14,010\nThe classification of the Company’s operating lease right-of-use assets, operating lease liabilities and other supplemental information related to the Company’s operating leases are as follows:\nYear ended June 30,\nOperating lease right-of-use assets\n$\n48,658\n$\n43,984\nAccrued expenses\n$\n8,083\n$\n7,549\nLong-term operating lease liabilities\n$\n73,299\n$\n67,201\nWeighted-average remaining lease term (years)\n10.3\n9.6\nWeighted-average discount rate\n3.83\n%\n3.83\n%\nThe following table summarizes supplemental cash flow information related to the Company’s operating leases:\nYear ended June 30,\nCash paid for amounts included in the measurement of operating lease liabilities   \n$\n10,374\n$\n11,093\nOperating lease assets obtained in exchange for new liabilities\n$\n3,123\n$\n1,682\nThe undiscounted cash flows for future maturities of the Company’s operating lease liabilities and the reconciliation to the balance of operating lease liabilities reflected on the Company’s balance sheet are as follows as of June 30, 2021:\nFiscal 2022\n$\n10,192\nFiscal 2023\n9,798\nFiscal 2024\n9,594\nFiscal 2025\n9,392\nFiscal 2026\n9,067\nThereafter\n41,965\nTotal undiscounted cash flows\n90,008\nLess: Present value discount\n(15,258)\nTotal operating lease liabilities\n$\n74,750\nAs of June 30, 2021, the Company had not entered into any leases that had not yet commenced.\n(13) Income Taxes\n(a) Income Taxes\nIncome tax expense (benefit) for the June 30, 2019, 2020 and 2021 consists of the following:\nYear ended June 30,\nCurrent taxes\nU.S. federal\n$\n-\n$\n-\n$\n-\nState and local\n(92)\n(75)\nDeferred taxes:\nU.S. federal\n5,449\n(10,476)\nState and local\n(1,316)\n2,352\n(3,164)\nTotal income tax expense (benefit)\n$\n4,223\n$\n2,663\n$\n(13,715)\n(b) Tax Rate Reconciliation\nIncome tax expense (benefit) differed from the amounts computed by applying the U.S. federal income tax rate of 21% for the years ended June 30, 2019, 2020 and 2021 to pretax income as a result of the following:\nYear ended June 30,\nIncome tax expense (benefit) at statutory federal rate\n21.0\n%\n21.0\n%\n21.0\n%\nIncrease (reduction) in income taxes resulting from:\nResearch and development credit and other credits\n(3.0)\n(3.2)\n(7.1)\nNon-deductible expenses\n1.3\n1.6\n1.4\nChange in valuation allowance\n0.3\n5.2\n2.8\nStock-based compensation expense\n(10.4)\n(18.3)\n(35.0)\nState and local income taxes, net of federal income tax benefit\n(2.0)\n(1.8)\n(6.7)\nOther\n0.1\n(0.5)\n(0.4)\n7.3\n%\n4.0\n%\n(24.0)\n%\nThe effective tax rate for the years ended June 30, 2019, 2020 and 2021 was 7.3%, 4.0% and (24.0)%, respectively, on pre-tax income of $58,046, $67,118 and $57,104, respectively. The decrease in the effective tax rate is primarily due to increased deductions related to stock compensation and research and development credits, partially offset by an increase to the valuation allowance.\n(c) Components of Deferred Tax Assets and Liabilities\nThe tax effects of temporary differences that give rise to significant portions of the deferred tax assets and deferred tax liabilities at June 30, 2020 and 2021 are presented below.\nYear ended June 30,\nDeferred tax assets:\nOperating lease liabilities\n$\n21,041\n$\n19,415\nAccrued expenses\n9,915\n13,559\nStock-based compensation\n13,351\n15,835\nNet operating loss carryforwards\n13,596\n32,812\nFederal and state tax credits\n16,714\n23,105\nOther\n-\nTotal deferred tax assets\n74,617\n104,905\nValuation allowance\n(3,967)\n(5,584)\nNet deferred tax assets\n70,650\n99,321\nDeferred tax liabilities:\nDeferred contract costs\n(41,229)\n(56,618)\nOperating lease right-of-use assets\n(12,607)\n(11,460)\nResearch and development costs\n(8,563)\n(10,664)\nIntangible assets\n(781)\n(994)\nDepreciation\n(11,269)\n(9,763)\nTotal deferred tax liabilities\n(74,449)\n(89,499)\nNet deferred tax asset (liability)\n$\n(3,799)\n$\n9,822\nOn March 11, 2021, the President signed the American Rescue Plan Act, 2021 into law. The bill complements the provisions set forth in the Coronavirus Aid, Relief, and Economic Security Act (the “CARES Act”) and the Consolidated Appropriations Act, 2021, which were signed into law on March 27, 2020, and December 27, 2020, respectively. The provisions of the legislation do not have a significant impact on the Company’s income taxes.\nAs of June 30, 2021, the Company maintains a valuation allowance of $5,584 for certain state tax benefits which may not be realized. Such assessment may change in the future as further evidence becomes available.\nAt June 30, 2021, the Company has gross net operating loss carryforwards for federal income tax purposes of approximately $129,406, of which $37,525 expire between 2034 to 2038. The Company has gross net operating loss carryforwards for state income tax purposes of approximately $98,721, of which $73,751 expire from 2021 to 2040. The remaining $116,851 federal and state net operating loss carryforwards have an indefinite utilization period. The Company also has gross federal and state research and development tax credits and other state credit carryforwards of approximately $23,639, which expire between 2022 and 2041.\nAs of June 30, 2021, the Company’s liabilities for unrecognized tax benefits, which would impact the Company’s effective tax rate if recognized, are presented below. The Company will include applicable penalties and interest when the benefit is recognized:\nYear ended June 30,\nUnrecognized tax benefits at beginning of the year\n$\n-\nAdditions for tax positions\nAdditions for tax positions of prior periods\nUnrecognized tax benefit at end of year\n$\nThe Company files income tax returns with the United States federal government and various state jurisdictions. Certain tax years remain open for federal and state tax reporting jurisdictions in which the Company does business due to net operating loss carryforwards and tax credits unutilized from such years or utilized in a period remaining open for audit under normal statute of limitations relating to income tax liabilities. The Company, including its domestic subsidiaries, files a consolidated federal income tax return. For years before fiscal year ended June 30, 2018, the Company is no longer subject to U.S. federal examination; however, the Internal Revenue Service (IRS) has the ability to review years prior to fiscal year 2018 to the extent the Company utilized tax attributes carried forward from those prior years. The statute of limitations on state filings is generally three to four years.\n(14) Stockholders’ Equity\nCommon Stock\nHolders of common stock are entitled to one vote per share and to receive dividends, when declared. The holders have no preemptive or other subscription rights and there are no redemption or sinking fund provisions with respect to such shares.\n(15) Benefit Plans\n(a) Equity Incentive Plans\nThe Company maintains a 2008 Equity Incentive Plan (the “2008 Plan”) and a 2014 Equity Incentive Plan (the “2014 Plan”) pursuant to which the Company has reserved shares of its common stock for issuance to its employees, directors and non-employee third parties. The 2014 Plan serves as the successor to the 2008 Plan and permits the granting of restricted stock units and other equity incentives at the discretion of the compensation committee of the Company’s board of directors (“the Committee”). No new awards have been or will be issued under the 2008 Plan since the effective date of the 2014 Plan. Outstanding awards under the 2008 Plan continue to be subject to the terms and conditions of the 2008 Plan. The number of shares of common stock reserved for issuance under the 2014 Plan may increase each calendar year, continuing through and including January 1, 2024. The number of shares added each year may be equal to the lesser of (a) four and five tenths percent (4.5%) of the number of shares of common stock of the Company issued and outstanding on the immediately preceding December 31, or (b) an amount determined by the Company’s board of directors. The Company’s board of directors approved the increase in the number of common shares in reserve for issuance under the 2014 Plan by 1,000 shares, effective January 1, 2021.\nAs of June 30, 2021, the Company had 12,523 shares allocated to the plans, of which 2,211 shares were subject to outstanding options or awards. Generally, the Company issues previously unissued shares for the exercise of stock options or vesting of awards; however, shares previously subject to 2014 Plan grants or awards that are forfeited or net settled at exercise or release may be reissued to satisfy future issuances.\nThe following table summarizes the changes in the number of shares available for grant under the Company’s equity incentive plans during the year ended June 30, 2021:\nNumber of\nShares\nAvailable for grant at July 1, 2020\n9,519\nJanuary 1, 2021 Evergreen provision increase\n1,000\nRSUs granted\n(494)\nMSUs granted\n(58)\nShares withheld in settlement of taxes and/or exercise price\nForfeitures\nShares removed\n(179)\nAvailable for grant at June 30, 2021\n10,312\nShares removed represents forfeitures of shares and shares withheld in settlement of taxes and/or payment of exercise price related to grants made under the 2008 Plan. As noted above, no new awards will be issued under the 2008 Plan.\nStock-based compensation expense related to stock options, restricted stock units (“RSUs”), market share units (“MSUs”) and the Employee Stock Purchase Plan (as described below) is included in the following line items in the accompanying Consolidated Statements of Operations and Comprehensive Income:\nYear ended June 30,\nCost of revenues\n$\n5,027\n$\n5,637\n$\n7,687\nSales and marketing\n7,631\n13,960\n15,658\nResearch and development\n5,325\n7,182\n10,192\nGeneral and administrative\n20,782\n20,714\n29,515\nTotal stock-based compensation expense\n$\n38,765\n$\n47,493\n$\n63,052\nIn addition, the Company capitalized $2,760, $2,397 and $2,610 of stock-based compensation expense in its capitalized internal-use software costs in the years ended June 30, 2019, 2020 and 2021, respectively.\nIn August 2020, the Company’s board of directors approved the Company’s fiscal 2021 annual operating plan to reflect the operating and financial impacts of the COVID-19 pandemic. In connection and alignment with the board’s approval of the updated operating plan, the Committee approved the modification of the performance targets for vesting of the performance-based restricted stock units granted in fiscal 2020 to certain executives. The Company recorded $6,423 during the year ended June 30, 2021 related to these modified performance-based restricted stock units.\nStock option activity during the periods indicated is as follows:\nOutstanding Options\nWeighted\nWeighted\naverage\naverage\nremaining\nAggregate\nNumber of\nexercise\ncontractual\nintrinsic\nshares\nprice\nterm (years)\nvalue\nBalance at July 1, 2020\n1,255\n$\n12.43\n3.0\n$\n167,406\nOptions exercised\n(490)\n$\n6.76\nBalance at June 30, 2021\n$\n16.06\n2.4\n$\n133,550\nOptions vested and exercisable at June 30, 2021\n$\n16.06\n2.4\n$\n133,550\nThere were no stock options granted during the years ended June 30, 2019, 2020 or 2021. The total intrinsic value of options exercised during the years ended June 30, 2019, 2020 and 2021 was $24,920, $29,791 and $84,072, respectively.\nThe Company may also grant RSUs under the 2014 Plan with terms determined at the discretion of the Committee. RSUs generally vest over three or four years following the grant date. Certain RSU awards have time-based\nvesting conditions while other RSUs vest based on the achievement of certain revenue and Adjusted EBITDA targets in current and future fiscal years. For these performance-based RSUs, the Company recognizes stock-based compensation expense based upon the probable achievement of these aforementioned performance metrics. The following table represents restricted stock unit activity during the year ended June 30, 2021:\nUnits\nWeighted\naverage\ngrant date\nfair value\nRSU balance at July 1, 2020\n1,626\n$\n73.96\nRSUs granted\n$\n135.17\nRSUs vested\n(644)\n$\n65.46\nRSUs forfeited\n(88)\n$\n91.46\nRSU balance at June 30, 2021\n1,388\n$\n100.33\nRSUs expected to vest at June 30, 2021\n1,314\n$\n99.53\nAt June 30, 2021, there was $55,289 of total unrecognized compensation cost, net of estimated forfeitures, related to unvested restricted stock units granted. That cost is expected to be recognized over a weighted average period of 1.8 years.\nThe Company also grants MSUs under the 2014 Plan with terms determined at the discretion of the Committee. In August 2020, the Company granted approximately 58 MSUs with a grant date fair value of $178.04. The actual number of MSUs that will be eligible to vest is based on the achievement of a relative total shareholder return (“TSR”) target as compared to the TSR realized by each of the companies comprising the Russell 3000 Index over an approximately three-year period. The MSUs cliff-vest at the end of the TSR measurement period, and up to 200% of the target number of shares subject to each MSU are eligible to be earned.\nThe Company estimated the grant date fair value of the MSUs using a Monte Carlo simulation model that included the following assumptions:\nExpected dividend yield\n%\nExpected volatility\n52.0\n%\nExpected term (years)\n3.04\nRisk-free interest rate\n0.18\n%\nAt June 30, 2021, there was $6,608 of total unrecognized compensation cost, net of estimated forfeitures, related to unvested MSUs. That cost is expected to be recognized over a period of 2.2 years.\nThe total of excess income tax benefits for stock-based compensation arrangements was $41,195, $67,816 and $128,229 for the years ended June 30, 2019, 2020 and 2021, respectively, and were recognized through Income tax expense (benefit).\n(b) Employee Stock Purchase Plan\nUnder the Company’s Employee Stock Purchase Plan (“ESPP”), the Company can grant stock purchase rights to all eligible employees during specific offering periods not to exceed twenty-seven months. Each offering period will begin on the trading day closest to May 16 and November 16 of each year. Shares are purchased through employees’ payroll deductions, up to a maximum of 10% of employees’ compensation for each purchase period, at a purchase price equal to 85% of the lesser of the fair market value of the Company’s common stock at the first trading day of the applicable offering period or the purchase date. Participants may purchase up to $25 worth of common stock or 2 shares of common stock in any one year. The ESPP is considered compensatory and results in compensation expense.\nAs of June 30, 2021, a total of 1,194 shares of common stock were reserved for future issuances under the ESPP. The number of shares of common stock reserved for issuance under the ESPP may increase each calendar year, continuing through and including January 1, 2024. The number of shares added each year may be equal to the lesser of (a) 400, (b) seventy-five one hundredths percent (0.75%) of the number of shares of common stock of the Company issued and outstanding on the immediately preceding December 31, or (c) an amount determined by the Company’s\nboard of directors. The Company’s board of directors approved the increase in the number of common shares in reserve for issuance under the ESPP by 400 shares, effective January 1, 2021.\nThe Company issued a total of 104 shares upon the completion of its six-month offering periods ending November 13, 2020 and May 14, 2021. The Company recorded compensation expense attributable to the ESPP of $1,949, $3,235 and $4,570 for the years ended June 30, 2019, 2020 and 2021, respectively, which is included in the summary of stock-based compensation expense above. The grant date fair value of the ESPP offering periods was estimated using the following weighted average assumptions:\nYear ended June 30,\nValuation assumptions:\nExpected dividend yield\n%\n%\n%\nExpected volatility\n33.5 - 38.6\n%\n38.6 - 72.2\n%\n42.2 - 72.2\n%\nExpected term (years)\n0.5\n0.5\n0.5\nRisk-free interest rate\n2.10 - 2.48\n%\n0.15 - 2.44\n%\n0.04 - 0.15\n%\n(c) 401(k) Plan\nThe Company maintains a 401(k) plan with a matching provision that covers all eligible employees. The Company matches 50% of employees’ contributions up to 8% of their gross pay. Contributions were $5,693, $7,914 and $2,658 for the years ended June 30, 2019, 2020 and 2021, respectively. In response to the uncertainties presented by the COVID-19 pandemic, the Company temporarily suspended 401(k) plan matching contributions during the first three quarters of fiscal 2021. The Company reinstated contributions during the fourth quarter of fiscal 2021.\n(16) Commitments and Contingencies\n(a) Employment Agreements\nThe Company has employment agreements with certain of its key officers. The agreements allow for annual compensation increases, participation in equity incentive plans and bonuses for annual performance as well as certain change of control events as defined in the agreements.\n(b) Litigation\nOn July 12, 2019, a former employee filed a class and collective action complaint under federal and state law alleging that certain employees of the Company were misclassified as salaried exempt employees. The complaint sought unpaid overtime and other damages. The Company reached an agreement, without admitting any liability or wrongdoing, to settle this matter. The settlement of this claim did not have a material impact to the Company’s financial position, results of operations, or liquidity.\nOn November 16, 2020, a potential class action complaint was filed against the Company with the Circuit Court of Cook County alleging that the Company violated the Illinois Biometric Information Privacy Act. The complaint seeks statutory damages, attorney’s fees and other costs. This claim is still in its earliest stages and the Company is unable to estimate any reasonably possible loss, or range of loss, with respect to this matter. The Company intends to vigorously defend against this lawsuit.\nFrom time to time, the Company is subject to litigation arising in the ordinary course of business. Many of these matters are covered in whole or in part by insurance. In the opinion of the Company’s management, the ultimate disposition of any matters currently outstanding or threatened will not have a material adverse effect on the Company’s financial position, results of operations, or liquidity. However, these matters are subject to inherent uncertainties and could materially impact the Company’s financial position, results of operations, or liquidity based on the final disposition of these matters.\n(17) Net Income Per Share\nBasic net income per share is computed using the weighted-average number of common shares outstanding during the period. Diluted net income per share is computed using the weighted-average number of common shares outstanding during the period and, if dilutive, potential common shares outstanding during the period. The Company’s potential common shares consist of the incremental common shares issuable upon the exercise of stock options, the release of restricted stock units and market share units and the shares purchasable via the employee stock purchase plan as of the balance sheet date.\nThe following table presents the calculation of basic and diluted net income per share:\nYear ended June 30,\nNumerator:\nNet income\n$\n53,823\n$\n64,455\n$\n70,819\nDenominator:\nWeighted-average shares used in computing net income per share:\nBasic\n52,914\n53,547\n54,318\nWeighted-average effect of potentially dilutive shares:\nEmployee stock options, restricted stock units, market share units and employee stock purchase plan shares\n2,500\n2,260\n1,987\nDiluted\n55,414\n55,807\n56,305\nNet income per share:\nBasic\n$\n1.02\n$\n1.20\n$\n1.30\nDiluted\n$\n0.97\n$\n1.15\n$\n1.26\nThe following table summarizes the outstanding restricted stock units, market share units and employee stock purchase plan shares as of the balance sheet date that were excluded from the diluted per share calculation for the periods presented because to include them would have been anti-dilutive:\nYear ended June 30,\nMarket share units\n-\n-\nRestricted stock units\nEmployee stock purchase plan shares\n-\n-\nTotal\nIn August 2018, the Company announced that its board of directors approved a program to repurchase up to $35,000 of the Company’s common stock, with authorization through August 14, 2019. During the first quarter of fiscal 2019, the Company completed the repurchase program and repurchased 442 shares for $34,991. All shares of common stock repurchased were retired."
}