{
    "cik": "50471",
    "company": "PARK CITY GROUP INC",
    "filing_type": "10-K",
    "filing_date": "2021-09-28",
    "period_of_report": "2021-06-30",
    "sic": "7374",
    "state_of_inc": "NV",
    "state_location": "UT",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/50471/0001654954-21-010502-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/50471/000165495421010502/pcyg10k_june302021.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/50471/0001654954-21-010502.txt",
    "filename": "50471_10K_2021_0001654954-21-010502.htm",
    "item_1": "Item 1.\nBusiness",
    "item_1A": "ITEM 1A.\nRISK FACTORS\nAn investment in our Common Stock is subject to many risks. You should carefully consider the risks described below, together with all of the other information included in this Annual Report on Form 10-K (this “Annual Report”), including the financial statements and the related notes, before you decide whether to invest in our Common Stock. Our business, operating results and financial condition could be harmed by any of the following risks. The trading price of our Common Stock could decline due to any of these risks, and you could lose all or part of your investment.\nRisks Related to the Company\nWe have incurred losses in the past and there can be no assurance that we will operate profitably in the future.\nOur marketing strategy emphasizes sales of subscription-based services, instead of annual licenses, and using Spokes to connect to our Hubs. This strategy has resulted in the development of a foundation of retail and wholesale Hubs to which suppliers can be “connected”, thereby accelerating future growth. If, however, this marketing strategy fails, revenue and operations will be negatively affected. We had net income of $4,117,395 for the year ended June 30, 2021, compared to a net income of $1,593,269 for the year ended June 30, 2020. Although we generated net income in the year ended June 30, 2021, there can be no assurance that we will achieve profitability in future periods. We cannot provide assurance that we will continue to generate revenue or have sustainable profits. If we do not operate profitably in the future, our current cash resources will be used to fund our operating losses. Continued losses would have an adverse effect on the long-term value of our Common Stock and any investment in the Company.\nAlthough our cash resources are currently sufficient, our long-term liquidity and capital requirements may be difficult to predict, which may adversely affect our long-term cash position.\nHistorically, we have been successful in raising capital when necessary, including through private placements, a registered direct offering, and stock issuances to our officers and directors, including our Chief Executive Officer, to pay our indebtedness and fund our operations, in addition to cash flow from operations. If we are required to seek additional financing in the future in order to fund our operations, retire our indebtedness and otherwise carry out our business plan, there can be no assurance that such financing will be available on acceptable terms, or at all, and there can be no assurance that any such arrangement, if required or otherwise sought, would be available on terms deemed to be commercially acceptable and in our best interests.\nOur business is dependent upon the continued services of our founder and Chief Executive Officer, Randall K. Fields. Should we lose the services of Mr. Fields, our operations will be negatively impacted.\nOur business is dependent upon the expertise and continued service of our founder and Chief Executive Officer, Randall K. Fields. Mr. Fields is essential to our operations. Accordingly, an investor must rely on Mr. Fields’ management decisions that will continue to control our business affairs. We currently maintain key man insurance on Mr. Fields’ life in the amount of $5,000,000; however, that coverage would be inadequate to compensate for the loss of his services. The loss of the services of Mr. Fields would have a materially adverse effect upon our business.\nRisk Relating to Business Operations\nQuarterly and annual operating results may fluctuate, which makes it difficult to predict future performance.\nManagement expects a significant portion of our revenue stream to come from the sale of subscriptions, and to a lesser extent, transactions processed though MarketPlace, license sales, maintenance and professional services charged to new customers. These amounts will fluctuate and are uncertain because predicting future sales is difficult and involves speculation. In addition, we may potentially experience significant fluctuations in future operating results caused by a variety of factors, many of which are outside of our control, including:\n●\nour ability to retain and increase sales to existing customers, attract new customers and satisfy our customers’ requirements;\n●\nthe renewal rates for our subscriptions and other services;\n●\nchanges in our pricing policies, whether initiated by us or as a result of competition;\n●\nthe cost, timing and management effort for the introduction of new services, including new features to our existing services;\n●\nthe rate of expansion and productivity of our sales force;\n●\nnew product and service introductions by our competitors;\n●\nvariations in the revenue mix of editions or versions of our service;\n●\ntechnical difficulties or interruptions in our service;\n●\ngeneral economic conditions that may adversely affect either our customers’ ability or willingness to purchase additional subscriptions or upgrade their services, or delay a prospective customer’s purchasing decision, or reduce the value of new subscription contracts or affect renewal rates;\n●\ntiming of additional expenses and investments in infrastructure to support growth in our business;\n●\nregulatory compliance costs;\n●\nconsolidation in the food industry;\n●\nthe timing of customer payments and payment defaults by customers;\n●\nextraordinary expenses such as litigation or other dispute-related settlement payments;\n●\nthe impact of new accounting pronouncements;\n●\nthe timing of stock awards to employees and the related financial statement impact; and\n●\nsystem or service failures, security breaches or network downtime.\nFuture operating results may fluctuate because of the foregoing factors, making it difficult to predict operating results. Period-to-period comparisons of operating results are not necessarily meaningful and should not be relied upon as an indicator of future performance. In addition, a large portion of our expense will be fixed in the short-term, particularly with respect to facilities and personnel making future operating results sensitive to fluctuations in revenue.\nWe face threats from competing and emerging technologies that may affect our profitability, as well as competitors that are larger and have greater financial and operational resources that may give them an advantage in the market.\nMarkets for our type of software products and that of our competitors are characterized by development of new software, software solutions or enhancements that are subject to constant change; rapidly evolving technological change; and unanticipated changes in customer needs. Because these markets are subject to such rapid change, the life cycle of our products is difficult to predict. As a result, we are subject to the following risks: whether or how we will respond to technological changes in a timely or cost-effective manner; whether the products or technologies developed by our competitors will render our products and services obsolete or shorten the life cycle of our products and services; and whether our products and services will achieve market acceptance.\nMoreover, many of our competitors are larger and have greater financial and operational resources than we do. This may allow them to offer better pricing terms to customers in the industry, which could result in a loss of potential or current customers or could force us to lower prices. Our competitors may have the ability to devote more financial and operational resources to the development of new technologies that provide improved operating functionality and features to their product and service offerings. If successful, their development efforts could render our product and service offerings less desirable to customers, again resulting in the loss of customers or a reduction in the price we can demand for our offerings. Any of these actions could have a significant effect on revenue.\nWe face risks associated with new product introductions.\nOur future revenue is dependent upon the successful and timely development of new and enhanced versions of our products and potential product offerings suitable to the customers’ needs. If we fail to successfully upgrade existing products and develop new products, and those new products do not achieve market acceptance, our revenue will be negatively impacted.\nIt may be difficult for us to assess risks associated with potential new product offerings:\n●\nit may be difficult for us to predict the amount of service and technological resources that will be needed by customers of new offerings, and if we underestimate the necessary resources, the quality of our service will be negatively impacted, thereby undermining the value of the product to the customer;\n●\ntechnological issues between us and our customers may be experienced in capturing data necessary for new product offerings, and these technological issues may result in unforeseen conflicts or technological setbacks when implementing these products, which could result in material delays and even result in a termination of the engagement;\n●\na customer’s experience with new offerings, if negative, may prevent us from having an opportunity to sell additional products and services to that customer;\n●\nif customers do not use our products as recommends and/or fail to implement any needed corrective action(s), it is unlikely that customers will experience the business benefits from these products and may, therefore, be hesitant to continue the engagement as well as acquire any other products from us; and\n●\ndelays in proceeding with the implementation of new products for a new customer will negatively affect our cash flow and our ability to predict cash flow.\nWe cannot accurately predict renewal or upgrade rates and the impact these rates may have on our future revenue and operating results.\nOur customers have no obligation to renew their subscriptions for our service after the expiration of their initial subscription period. Our renewal rates may decline or fluctuate as a result of factors, including customer dissatisfaction with our service, customers’ ability to continue their operations and spending levels, consolidation, and deteriorating general economic conditions. If our customers do not renew their subscriptions for our service or reduce the level of service at the time of renewal, our revenue will decline, and our business will suffer.\nOur future success also depends in part on our ability to increase rates, sell additional features and services, or addition subscriptions to our current customers. This may also require increasingly sophisticated and costly sales and marketing efforts that are targeted at senior management. If these strategies fail, we will need to refocus our efforts toward other solutions, which could lead to increased development and marketing costs, delayed revenue streams, and otherwise negatively affect our operations.\nIf our Compliance and Food Safety solutions do not perform as expected, whether as a result of operator error or otherwise, it could impair our operating results and reputation.\nOur success depends on the food safety market’s confidence that we can provide reliable, high-quality reporting for our customers. We believe that our customers are likely to be particularly sensitive to product defects and operator errors, including if our systems fail to accurately report issues that could reduce the liability of our clients in the event of a product recall. In addition, our reputation and the reputation of our products can be adversely affected if our systems fail to perform as expected. However, if our customers or potential customers fail to implement and use our systems as suggested by us, they may not be able to deal with a recall as effectively as they could have. As a result, the failure or perceived failure of our products to perform as expected, could have a material adverse effect on our revenue, results of operations and business.\nIf a customer is sued because of a recalled product we could be joined in that suit, the defense of which would impair our operating results.\nWe believe our Compliance and Food Safety solutions would be helpful in the event of a recall. However, their ultimate usefulness is dependent on how the customer uses our products, which is in many ways out of our control. Similarly, a customer which is a defendant in a product liability case could claim that had our services performed as represented the extent of potential liability would have been minimized and therefore, we should have some contributory liability in the case. Defending such a claim could have a material adverse effect on our revenue, results of operations and business.\nThe deployment of our services, or consultation provided by our personnel, could result in litigation naming us as a party, which litigation could result in a material and adverse effect on us, and our results of operations.\nOur Compliance and Food Safety solutions are marketed to potential customers based, in part, on our service’s ability to reduce a company’s potential regulatory, legal, and criminal risk from its supply chain partners. In the event litigation is commenced against a customer based on issues caused by a constituent in the supply chain, or consultation provided by our personnel, we could be joined or named in such litigation. As a result, we could face substantial defense costs. In addition, any adverse determination resulting in such litigation could have a material and adverse effect on us, and our results of operations.\nWe face risks relating to the sale and delivery of merchandise to customers.\nWe depend on a number of other companies to perform functions critical to our ability to deliver products to our customers, including maintaining inventory, preparing merchandise for shipment to our customers and delivering purchased merchandise on a timely basis. We also depend on the delivery services that we and they utilize. We also depend on our partners to ensure proper labelling of products. Issues or concerns regarding, product safety, labelling, content or quality could result in consumer or governmental claims. In limited circumstances, we sell merchandise that we have purchased. In these instances, we assume the risks related to inventory.\nWe face risks associated with proprietary protection of our software.\nOur success depends on our ability to develop and protect existing and new proprietary technology and intellectual property rights. We seek to protect our software, documentation and other written materials primarily through a combination of patents, trademarks, and copyright laws, trade secret laws, confidentiality procedures and contractual provisions. While we have attempted to safeguard and maintain our proprietary rights, there are no assurances that we will be successful in doing so. Our competitors may independently develop or patent technologies that are substantially equivalent or superior to ours.\nDespite our efforts to protect our proprietary rights, unauthorized parties may attempt to copy aspects of our products or obtain and use information that we regard as proprietary. In some types of situations, we may rely in part on ‘shrink wrap’ or ‘point and click’ licenses that are not signed by the end user and, therefore, may be unenforceable under the laws of certain jurisdictions. Policing unauthorized use of our products is difficult. While we are unable to determine the extent to which piracy our software exists, software piracy can be expected to be a persistent problem, particularly in foreign countries where the laws may not protect proprietary rights as fully as the United States. We can offer no assurance that our means of protecting our proprietary rights will be adequate or that our competitors will not reverse engineer or independently develop similar technology.\nWe may discover software errors in our products that may result in a loss of revenue, injury to our reputation or subject us to substantial liability.\nNon-conformities or bugs (“errors”) may be found from time to time in our existing, new or enhanced products after commencement of commercial shipments, resulting in loss of revenue or injury to our reputation. In the past, we have discovered errors in our products and as a result, have experienced delays in the shipment of products. Errors in our products may be caused by defects in third-party software incorporated into our products. If so, we may not be able to fix these defects without the cooperation of these software providers. Because these defects may not be as significant to the software provider as they are to us, we may not receive the rapid cooperation that may be required. We may not have the contractual right to access the source code of third-party software, and even if we do have access to the code, we may not be able to fix the defect. In addition, our customers may use our service in unanticipated ways that may cause a disruption in service for other customers attempting to access their data. Since our customers use our products for critical business applications, any errors, defects or other performance problems could hurt our reputation and may result in damage to our customers’ business. If that occurs, customers could elect not to renew, delay or withhold payment to us, we could lose future sales or customers may make warranty or other claims against us, which could result in an increase in our provision for doubtful accounts, an increase in collection cycles for accounts receivable or the expense and risk of litigation. These potential scenarios, successful or otherwise, would likely be time consuming and costly.\nInterruptions or delays in service from our third-party data center hosting facility could impair the delivery of our service and harm our business.\nWe currently serve our customers from a third-party data center hosting facility located in the United States. Any damage to, or failure of, our systems generally could result in interruptions in our service. As we continue to add capacity, we may move or transfer our data and our customers’ data. Despite precautions taken during this process, any unsuccessful data transfers may impair the delivery of our service. Further, any damage to, or failure of, our systems generally could result in interruptions in our service. Interruptions in our service may reduce our revenue, cause us to issue credits or pay penalties, cause customers to terminate their subscriptions and adversely affect our renewal rates and our ability to attract new customers. Our business will also be harmed if our customers and potential customers believe our service is unreliable.\nAs part of our current disaster recovery arrangements, our production environment and all of our customers’ data is currently replicated in near real-time in a separate facility physically located in a different region of the United States. We do not control the operation of these facilities, and they are vulnerable to damage or interruption from earthquakes, floods, fires, power loss, telecommunications failures and similar events. They may also be subject to break-ins, sabotage, intentional acts of vandalism and similar misconduct. Despite precautions taken at these facilities, the occurrence of a natural disaster or an act of terrorism, a decision to close the facilities without adequate notice or other unanticipated problems at these facilities could result in lengthy interruptions in our service. Even with the disaster recovery arrangements, our service could be interrupted.\nIf our security measures are breached and unauthorized access is obtained to a customer’s data, our data or our information technology systems, our service may be perceived as not being secure, customers may curtail or stop using our service and we may incur significant legal and financial exposure and liabilities.\nOur service involves the storage and transmission of customers’ proprietary information, and security breaches could expose us to a risk of loss of this information, litigation and possible liability. These security measures may be breached as a result of third-party action, including intentional misconduct by computer hackers, employee error, malfeasance or otherwise during transfer of data to additional data centers or at any time, and result in someone obtaining unauthorized access to our customers’ data or our data, including our intellectual property and other confidential business information, or our information technology systems. Additionally, third parties may attempt to fraudulently induce employees or customers into disclosing sensitive information, such as user names, passwords or other information in order to gain access to our customers’ data or our data, including our intellectual property and other confidential business information, or our information technology systems. Because the techniques used to obtain unauthorized access, or to sabotage systems, change frequently and generally are not recognized until launched against a target, we may be unable to anticipate these techniques or to implement adequate preventative measures. Any security breach could result in a loss of confidence in the security of our service, damage our reputation, disrupt our business, lead to legal liability and negatively impact our future sales.\nSecurity breaches and other disruptions could compromise our information and expose us to liability, which would cause our business and reputation to suffer.\nIn the ordinary course of our business, we collect and store sensitive data, including intellectual property, our proprietary business information and that of our customers, suppliers and business partners, and personally identifiable information of our customers and employees, in our data centers and on our networks. The secure processing, maintenance and transmission of this information is critical to our operations and business strategy. Despite our security measures, our information technology and infrastructure may be vulnerable to attacks by hackers or breached due to employee error, malfeasance or other disruptions. Any such breach could compromise our networks and the information stored there could be accessed, publicly disclosed, lost or stolen. Any such access, disclosure or other loss of information could result in legal claims or proceedings, liability under laws that protect the privacy of personal information, and regulatory penalties, disrupt our operations and the services we provide to customers, and damage our reputation, and cause a loss of confidence in our products and services, which could adversely affect our business/operating margins, revenues and competitive position.\nThe secure processing, maintenance and transmission of this information is critical to our operations and business strategy, and we devote significant resources to protecting our information. The expenses associated with protecting our information could reduce our operating margins.\nWeakened global economic conditions may adversely affect our industry, business and results of operations.\nThe rate at which our customers purchase new or enhanced services depends on several factors, including general economic conditions. The United States and other key international economies have experienced in the past a downturn in which economic activity was impacted by falling demand for a variety of goods and services, restricted credit, poor liquidity, reduced corporate profitability, volatility in credit, equity and foreign exchange markets, bankruptcies and overall uncertainty with respect to the economy. These conditions affect the rate of information technology spending and could adversely affect our customers’ ability or willingness to purchase our enterprise cloud computing services, delay prospective customers’ purchasing decisions, reduce the value or duration of their subscription contracts or affect renewal rates, all of which could adversely affect our operating results.\nCOVID-19 could potentially affect our sales and disrupt our operations and could have a material adverse impact on the Company.\nThe global COVID-19 pandemic could adversely impact our operations or those of our customers. The extent to which COVID-19 impacts our operations and those of our customers will depend on future developments, which are highly uncertain and cannot be predicted with confidence. If the public continues to avoid public spaces, including retail stores, or if we, or any of our customers encounter any disruptions to our or their respective operations, facilities or stores, or if our customers were to partially or fully shut down due to COVID-19, then we or they may be prevented or delayed from effectively operating our or their business, respectively, and the marketing and sale of our services and our financial results could be adversely affected.\nRisks Relating to Our Common Stock\nOur quarterly results of operations may fluctuate in the future, which could result in volatility in our stock price.\nOur quarterly revenue and results of operations have varied in the past and may fluctuate as a result of a variety of factors. If our quarterly revenue or results of operations fluctuate, the price of our Common Stock could decline substantially. Fluctuations in our results of operations may be due to several factors, including, but not limited to, those listed and identified throughout this “Risk Factors” section.\nThe limited public market for our stock may adversely affect an investor’s ability to liquidate an investment in us.\nAlthough our Common Stock is currently quoted on the NASDAQ Capital Market, there is limited trading activity. We can give no assurance that an active market will develop, or if developed, that it will be sustained. If an investor acquires shares of our Common Stock, the investor may not be able to liquidate our shares should there be a need or desire to do so.\nFuture issuances of our shares may lead to future dilution in the value of our Common Stock, will lead to a reduction in shareholder voting power and may prevent a change in control.\nThe shares may be substantially diluted due to the following:\n●\nissuance of Common Stock in connection with funding agreements with third parties and future issuances of Common Stock and the Company’s Preferred Stock, par value $0.01 (“Preferred Stock ”) by the Board of Directors; and\n●\nthe Board of Directors has the power to issue additional shares of Common Stock and Preferred Stock and the right to determine the voting, dividend, conversion, liquidation, preferences and other conditions of the shares without shareholder approval.\nStock issuances may result in reduction of the book value or market price of outstanding shares of Common Stock. If we issue any additional shares of Common Stock or Preferred Stock, proportionate ownership of Common Stock and voting power will be reduced. Further, any new issuance of Common Stock or Preferred Stock may prevent a change in control or management.\nOur officers and directors have significant control over us, which may lead to conflicts with other stockholders over corporate governance.\nOur officers and directors control approximately 41% of our Common Stock. Randall K. Fields, our Chief Executive Officer, controls 34% of our Common Stock. Consequently, Mr. Fields, individually, and our officers and directors, as stockholders acting together, can significantly influence all matters requiring approval by our stockholders, including the election of directors and significant corporate transactions, such as mergers or other business combination transactions.\nOur corporate charter contains authorized, unissued “blank check” Preferred Stock issuable without stockholder approval with the effect of diluting then current stockholder interests.\nOur articles of incorporation currently authorize the issuance of up to 30,000,000 shares of ‘blank check’ Preferred Stock with designations, rights, and preferences as may be determined from time to time by our Board of Directors, of which 700,000 shares are currently designated as Series B Convertible Preferred Stock (“Series B Preferred”) and 550,000 shares are designated as Series B-1 Preferred Stock (“Series B-1 Preferred”). As of June 30, 2021, a total of 625,375 shares of Series B Preferred and 212,402 shares of Series B-1 Preferred were issued and outstanding.\nOur Board of Directors is empowered, without stockholder approval, to issue one or more additional series of Preferred Stock with dividend, liquidation, conversion, voting, or other rights that could dilute the interest of, or impair the voting power of, our Common Stockholders. The issuance of an additional series of Preferred Stock could be used as a method of discouraging, delaying or preventing a change in control.\nWe have not paid dividends on our Common Stock, and investors should consider the potential for us to pay dividends on our Common Stock as a factor when determining whether to invest in us.\nWe have not paid dividends on our Common Stock and do not anticipate the declaration of any dividends pertaining to our Common Stock in the foreseeable future. We intend to retain earnings, if any, to finance the development and expansion of our business. Our Board of Directors will determine our future dividend policy at their sole discretion, and future dividends will be contingent upon future earnings, if any, obligations of the stock issued, our financial condition, capital requirements, general business conditions and other factors. Future dividends may also be affected by covenants contained in loan or other financing documents, which we may executed in the future. Therefore, there can be no assurance that dividends will ever be paid on our Common Stock.\nOur officers and directors have limited liability and indemnification rights under our organizational documents, which may impact our results.\nOur officers and directors are required to exercise good faith and high integrity in the management of our affairs. Our articles of incorporation and bylaws, however, provide that the officers and directors shall have no liability to the stockholders for losses sustained or liabilities incurred which arise from any transaction in their respective managerial capacities unless they violated their duty of loyalty, did not act in good faith, engaged in intentional misconduct or knowingly violated the law, approved an improper dividend or stock repurchase or derived an improper benefit from the transaction. As a result, an investor may have a more limited right to action than he would have had if such a provision were not present. Our articles of incorporation and bylaws also require us to indemnify our officers and directors against any losses or liabilities they may incur as a result of the manner in which they operate our business or conduct our internal affairs, provided that the officers and directors reasonably believe such actions to be in, or not opposed to, our best interests, and their conduct does not constitute gross negligence, misconduct or breach of fiduciary obligations.",
    "item_1B": "",
    "item_2": "ITEM 2.\nPROPERTIES\nOur principal place of business operations is located at 5282 South Commerce Drive, Suite D292, Murray, Utah 84107. We lease approximately 10,000 square feet at this corporate office location, consisting primarily of office space, conference rooms and storage areas. Our telephone number is (435) 645-2000. Our website address is http://www.parkcitygroup.com.",
    "item_3": "ITEM 3.\nLEGAL PROCEEDINGS\nWe are, from time to time, involved in various legal proceedings incidental to the conduct of our business. Historically, the outcome of all such legal proceedings has not, in the aggregate, had a material adverse effect on our business, financial condition, results of operations or liquidity. There are no pending or threatened material legal proceedings at this time.",
    "item_4": "ITEM 4.\nMINE SAFETY DISCLOSURES\nNot applicable.\nPART II",
    "item_5": "ITEM 5.\nMARKET FOR COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nShare Price History\nOur Common Stock is traded on the NASDAQ Capital Market under the trading symbol “PCYG”. The following table sets forth the high and low sales prices of our Common Stock for the periods indicated:\nQuarterly Common Stock Price Ranges\nFiscal Quarter Ended\nHigh\nLow\nHigh\nLow\nSeptember 30\n$5.45\n$3.72\n$8.25\n$4.76\nDecember 31\n$5.53\n$3.80\n$6.17\n$4.27\nMarch 31\n$7.91\n$4.75\n$5.73\n$3.33\nJune 30\n$6.97\n$4.80\n$6.22\n$3.40\nDividend Policy\nOutstanding shares of Series B Preferred and Series B-1 Preferred each accrue dividends at the rate per share of 7% per annum if paid by the Company in cash, and 9% per annum if paid by the Company in additional shares of Series B-1 Preferred. Dividends on the Series B Preferred and Series B-1 Preferred are payable quarterly. To date, the Company has not paid dividends on its Common Stock. Our present policy is to retain future earnings (if any) for use in our operations and the expansion of our business.\nHolders of Record\nAt June 30, 2021, there were 636 holders of record of our Common Stock with 19,351,935 shares issued and outstanding, 3 holders of Series B Preferred with 625,375 shares issued and outstanding, and 4 holders of Series B-1 Preferred with 212,402 shares issued and outstanding. The number of holders of record and shares of Common Stock issued and outstanding was calculated by reference to the books and records of the Company’s transfer agent.\nIssuance of Securities\nWe issued shares of our Common Stock in unregistered transactions during fiscal year 2021. All of the shares of Common Stock issued in non-registered transactions were issued in reliance on Section 3(a)(9) and/or Section 4(a)(2) of the Securities Act of 1933, as amended (the “Securities Act”) and were reported in our Quarterly Reports on Form 10-Q and in our Current Reports on Form 8-K filed with the SEC during the fiscal year ended June 30, 2021. 40,217 shares of Common Stock were issued subsequent to June 30, 2021.\nShare Repurchase Program\nOn May 9, 2019, our Board of Directors approved of the repurchase of up to $4.0 million shares of our Common Stock, which repurchases may be made in privately negotiated transactions or in the open market at prices per share not exceeding the then-current market prices (the “Share Repurchase Program”). Under the Share Repurchase Program, management has discretion to determine the dollar amount of shares to be repurchased and the timing of any repurchases in compliance with applicable laws and regulations, including Rule 12b-18 of the Exchange Act. On March 17, 2020, given the extreme uncertainty due to COVID-19 at the time, the Board suspended the Share Repurchase Program.\nOn May 18, 2021, our Board of Directors resumed its Share Repurchase Program, and increased the buyback from $4 million to $6 million. The Share Repurchase Program expires 24 months following May 18, 2021, and it may be suspended for periods of time or discontinued at any time, at the Board’s discretion. The total remaining authorization for future shares of Common Stock repurchases under our Share Repurchase Program was $2,050,885 as of June 30, 2021. From time-to-time, our Board may authorize further increases to our Share Repurchase Program.\nThe following table provides information about repurchases of our Common Stock registered pursuant to Section 12 of the Exchange Act, during the years ended June 30, 2021 and 2020:\nPeriod (1)\nTotal Number of Shares Purchased\nAverage Price Paid Per Share\nTotal Number of Shares Purchased as Part of Publicly Announced Plans or Programs\nRemaining Amount Available for Future Share Repurchases Under the Plans or Programs\nYear Ended June 30, 2020:\nJuly 1, 2019 - September 30, 2019\n79,954\n$6.43\n167,554\n$3,000,235\nOctober 1, 2019 - December 31, 2019\n174,615\n$4.80\n342,169\n$2,162,557\nJanuary 1, 2020 - March 31, 2020\n157,616\n$5.11\n499,785\n$1,359,123\nApril 1, 2020 - June 30, 2020\n-\n-\n-\n$1,359,123\nYear Ended June 30, 2021:\nJuly 1, 2020 - September 30, 2020\n-\n$-\n-\n$1,359,123\nOctober 1, 2020 - December 31, 2020\n-\n$-\n-\n$1,359,123\nJanuary 1, 2021 - March 31, 2021\n84,081\n$6.04\n584,586\n$2,850,880\nApril 1, 2021 - June 30, 2021\n126,927\n$6.30\n457,659\n$2,050,885\n(1)\nWe close our books and records on the last calendar day of each month to align our financial closing with our business processes.",
    "item_6": "ITEM 6.\nSELECTED FINANCIAL DATA\nThe disclosures in this section are not required because we qualify as a smaller reporting company under federal securities laws.",
    "item_7": "ITEM 7.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following Management’s Discussion and Analysis is intended to assist the reader in understanding our results of operations and financial condition. Management’s Discussion and Analysis is provided as a supplement to, and should be read in conjunction with, our audited consolidated financial statements beginning on page of this Annual Report on Form 10-K (this \"Annual Report\"). This Annual Report includes certain statements that may be deemed to be “forward-looking statements” within the meaning of Section 27A of the Securities Act. All statements, other than statements of historical fact, included in this Annual Report that address activities, events or developments that we expect, project, believe, or anticipate will or may occur in the future, including matters having to do with expected and future revenue, our ability to fund our operations and repay debt, business strategies, expansion and growth of operations and other such matters, are forward-looking statements. These statements are based on certain assumptions and analyses made by our management in light of its experience and its perception of historical trends, current conditions, expected future developments, and other factors it believes are appropriate in the circumstances. These statements are subject to a number of assumptions, risks and uncertainties, including general economic and business conditions, the business opportunities (or lack thereof) that may be presented to and pursued by us, our performance on our current contracts and our success in obtaining new contracts, our ability to attract and retain qualified employees, and other factors, many of which are beyond our control. You are cautioned that these forward-looking statements are not guarantees of future performance and those actual results or developments may differ materially from those projected in such statements.\nOverview\nThe Company is a SaaS provider, and the parent company of ReposiTrak, a B2B e-commerce, compliance, and supply chain management platform company that partners with retailers, wholesalers, and product suppliers to help them source, vet, and transact with their suppliers in order to accelerate sales, control risks, and improve supply chain efficiencies. The Company’s fiscal year ends on June 30. References to fiscal 2021 refer to the fiscal year ended June 30, 2021.\nSources of Revenue\nThe principal customers for the Company’s products are multi-store retail chains, wholesalers and distributors, and their suppliers. The Company has a Hub and Spoke business model, whereby the Company is typically engaged by Hubs, which in turn require Spokes to utilize the Company’s services. The Company derives revenue from five sources: (i) subscription fees, (ii) transaction based fees, (iii) professional services fees, (iv) license fees, and (v) hosting and maintenance fees\nA significant portion of the Company’s revenue is generated from its Supply Chain solutions and Compliance and Food Safety solutions in the form of recurring subscription payments from the suppliers. Subscription fees can be based on a negotiated flat fee per supplier, or some volumetric metric, such as the number of stores, or the volume of economic activity between a retailer and its suppliers. Subscription revenue contains arrangements with customers for use of the application, application and data hosting, maintenance of the application, and standard support.\nRevenue from the Company’s MarketPlace sourcing solution is transactional, based on the volume of products sourced via the application. MarketPlace revenue can come from several sources depending on the customer’s specific requirements. These include acting as an agent for a supplier, providing supply chain technology services, and enabling a Hub to reduce its number of new suppliers by acting as the supplier for any number of products.\nThe Company also provides professional consulting services targeting implementation, assessments, profit optimization and support functions for its applications and related products, for which revenue is recognized on a percentage-of-completion or pro rata basis over the life of the subscription, depending on the nature of the engagement. Premier customer support includes extended availability and additional services and is available along with additional support services such as developer support and partner support for an addition fee.\nIn some instances, the Company will sell its software in the form of a license. License arrangements are a time-specific and perpetual license. Software license maintenance agreements are typically annual contracts, paid in advance or according to terms specified in the contract. When sold as a license, the Company’s software, is usually accompanied by a corresponding Maintenance and/or Hosting Agreement to support the service.\nSoftware maintenance agreements provide the customer with access to new software enhancements, maintenance releases, patches, updates and technical support personnel. Our hosting services provide remote management and maintenance of our software and customers’ data, which is physically located in third-party facilities. Customers access ‘hosted’ software and data through a secure internet connection.\nRevenue Recognition\nEffective July 1, 2018, we adopted the Financial Accounting Standards Board’s Accounting Standards Update 2014-09: Revenue from Contracts with Customers (Topic 606), and its related amendments (“ASU 2014-09”). ASU 2014-09 provides a unified model to determine when and how revenue is recognized and enhances certain disclosure around the nature, timing, amount and uncertainty of revenue and cash flows arising from customers.\nASU 2014-09 represents a change in the accounting model utilized for the recognition of revenue and certain expense arising from contracts with customers. We adopted ASU 2014-09 using a “modified retrospective” approach and, accordingly, revenue and expense totals for all periods before July 1, 2018 reflect those previously reported under the prior accounting model and have not been restated.\nOther Metrics - Non-GAAP Financial Measures\nTo supplement our financial statements, historically we have provided investors with Adjusted EBITDA and non-GAAP income per share, both of which are non-GAAP financial measures. We believe that these non-GAAP measures may provide useful information regarding certain financial and business trends relating to our financial condition and operations. Our management uses these non-GAAP measures to compare the Company’s performance to that of prior periods for trend analyses and planning purposes. These measures are also presented to our Board of Directors.\nThese non-GAAP measures should not be considered a substitute for, or superior to, financial measures calculated in accordance with generally accepted accounting principles in the United States of America (“GAAP”). These non-GAAP financial measures exclude significant expenses and income that are required by GAAP to be recorded in the Company’s financial statements and are subject to inherent limitations. Investors should review the reconciliations of non-GAAP financial measures to the comparable GAAP financial measures that are included in this “Management’s Discussion and Analysis of Financial Condition and Results of Operations.”\nCritical Accounting Policies\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations discusses the Company’s financial statements, which have been prepared in accordance with GAAP. The preparation of our financial statements requires management to make estimates and assumptions that affect reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amount of revenue and expense during the reporting period.\nOn an ongoing basis, management evaluates its estimates and assumptions based on historical experience of operations and on various other factors that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying value of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nIncome Taxes\nIn determining the carrying value of the Company’s net deferred income tax assets, the Company must assess the likelihood of sufficient future taxable income in certain tax jurisdictions, based on estimates and assumptions, to realize the benefit of these assets. If these estimates and assumptions change in the future, the Company may record a reduction in the valuation allowance, resulting in an income tax benefit in the Company’s statements of operations. Management evaluates quarterly whether to realize the deferred income tax assets and assesses the valuation allowance.\nGoodwill and Other Long-Lived Asset Valuations\nGoodwill is assigned to specific reporting units and is reviewed for possible impairment at least annually or upon the occurrence of an event or when circumstances indicate that a reporting unit’s carrying amount is greater than its fair value. Management reviews the long-lived tangible and intangible assets for impairment when events or changes in circumstances indicate that the carrying value of an asset may not be recoverable. Management evaluates, at each balance sheet date, whether events and circumstances have occurred which indicate possible impairment.\nThe carrying value of a long-lived asset is considered impaired when the anticipated cumulative undiscounted cash flows of the related asset or group of assets is less than the carrying value. In that event, a loss is recognized based on the amount by which the carrying value exceeds the estimated fair market value of the long-lived asset. Economic useful lives of long-lived assets are assessed and adjusted as circumstances dictate.\nStock-Based Compensation\nThe Company recognizes the cost of employee services received in exchange for awards of equity instruments based on the grant-date fair value of those awards. The Company records compensation expense on a straight-line basis. The fair value of any options granted are estimated at the date of grant using a Black-Scholes option pricing model with assumptions for the risk-free interest rate, expected life, volatility, dividend yield and forfeiture rate.\nCapitalization of Software Development Costs\nThe Company accounts for research costs of computer software to be sold, leased or otherwise marketed as expense until technological feasibility has been established for the product. Once technological feasibility is established, all software costs are capitalized until the product is available for general release to customers. Judgment is required in determining when technological feasibility of a product is established.\nWe have determined that technological feasibility for our software products is reached shortly after a working prototype is complete and meets or exceeds design specifications including functions, features, and technical performance requirements. Costs incurred after technological feasibility is established have been and will continue to be capitalized until such time as when the product or enhancement is available for general release to customers. The Company capitalized software development costs of $171,733 in the fiscal year ended June 30, 2021.\nOff-Balance Sheet Arrangements\nThe Company does not have any off-balance sheet arrangements that are reasonably likely to have a current or future effect on our financial condition, revenue and results of operation, liquidity or capital expenditures.\nRecent Accounting Pronouncements\nIn August 2018, the FASB issued ASU 2018-15 Intangibles - Goodwill and Other Internal-Use Software (Subtopic 350-40) - Customer’s Accounting for Implementation Costs Incurred in a Cloud Computing Arrangement That is a Service Contract. The amendments in this update apply to an entity who is a customer in a hosting arrangement accounted for as a service contract. The update requires a customer in a hosting arrangement to capitalize certain implementation costs. Costs associated with the application development stage of the implementation should be capitalized and costs with the other stages should be expensed. For instance, costs for training and data conversion should be expensed. The capitalized implementation costs should be expensed over the term of the hosting arrangement, which is the noncancelable period plus periods covered by an option to extend if the customer is reasonably certain to exercise the option. Impairment of the capitalized costs should be considered similar to other intangibles. The effective date of this update is effective for annual reporting periods beginning after December 15, 2019 for public entities and after December 15, 2020 for all other entities with early adoption permitted. The Company is a customer in a hosting arrangement and may enter into new arrangements in the future. The Company adopted the standard during the second quarter of fiscal year 2020. This standard did not have a material impact on the Company’s consolidated financial statements.\nIn August 2018, the FASB issued ASU 2018-13 Fair Value Measurement (Topic 820) Disclosure Framework - Changes to the Disclosure Requirements for Fair Value Measurement. This ASU eliminates, amends, and adds disclosure requirements for fair value measurements. The new standard is effective for fiscal years beginning after December 15, 2019, including interim periods within those fiscal years. The Company adopted the standard during the second quarter of fiscal year 2020. This standard did not have a material impact on the Company’s consolidated financial statements.\nIn June 2018, the FASB issued ASU 2018-07 Compensation - Stock Compensation (Topic 718), Improvements to Nonemployee Share-Based Payment Accounting. The amendments in this update expand the scope of Topic 718 to include share-based payment transactions for acquiring goods and services from nonemployees. Prior to this update, equity-based payments to non-employees was accounted for under Subtopic 505-50 resulting in significant differences between the accounting for share-based payments to non-employees as compared to employees. One of the most significant changes is that non-employee share-based awards (classified as equity awards) may be measured at grant-date fair value and not have to be continually revalued until the service/goods are rendered. The update also indicates that share-based awards related to financing and awards granted to a customer in conjunction with selling goods or services are not included in Topic 718. This standard is effective for interim and annual reporting periods beginning after December 15, 2018 for public entities and December 15, 2019 for all other entities. Early adoption is permitted, but no earlier than an entity’s adoption date of Topic 606. The Company adopted the standard during the first quarter of fiscal year 2020. This standard did not have a material impact on the Company’s consolidated financial statements.\nIn January 2017, the FASB issued ASU 2017-04 Intangibles-Goodwill and Other (Topic 350): Simplifying the Test for Goodwill Impairment, which amends and simplifies the accounting standard for goodwill impairment. The new standard removes Step 2 of the goodwill impairment test, which requires a hypothetical purchase price allocation. A goodwill impairment will now be the amount a reporting unit’s carrying value exceeds its fair value, limited to the total amount of goodwill allocated to that reporting unit. The new standard is effective for annual and any interim impairment tests for periods beginning after December 15, 2019. The Company adopted the standard during the fourth quarter of fiscal year 2020. This standard did not have a material impact on the Company’s consolidated financial statements.\nIn February 2016, the FASB issued ASU 2016-02 Leases (Topic 842). Under the new guidance, lessees will be required to recognize for all leases (with the exception of short-term leases) a lease liability, which is a lessee’s obligation to make lease payments arising from a lease, measured on a discounted basis and a right-of-use asset, which is an asset that represents the lessee’s right to use, or control the use of, a specified asset for the lease term.\nEffective July 1, 2019, the Company adopted the requirements of Accounting Standards Update No. 2016-02, Leases (Topic 842) (\"ASU 2016-02\"). All amounts and disclosures set forth in this Annual Report on Form 10-K have been updated to comply with this new standard with results for reporting periods beginning after July 1, 2019 presented under ASU 2016-02, while prior period amounts and disclosures are not adjusted and continue to be reported under the accounting standards in effect for the prior period.\nResults of Operations - Fiscal Years Ended June 30, 2021 and\nRevenue\nYear Ended\nJune 30, 2021\n$\nChange\n%\nChange\nYear Ended\nJune 30, 2020\nRevenue\n$21,007,076\n$969,022\n5%\n$20,038,054\nDuring the fiscal year ended June 30, 2021, the Company had revenue of $21,007,076 compared to $20,038,054 for the year ended June 30, 2020, a 5% increase. The increase in revenue was due to growth in both subscription revenue and Marketplace revenue, partially offset by approximately $145,500 in one-time license revenue that occurred in 2020 that did not reoccur in 2021.\nDuring fiscal 2021, as COVID-19 disrupted supply chains and generated shortages in products, our ability to source hard to find items for our customers resulted in increased revenue attributable to MarketPlace. These products largely consisted of personel protective equipment (\"PPE\") which includes nitrile gloves, masks, freezers and telecommunication equipment. While the Company has experienced a significant increase in Marketplace revenue for PPE during the height of COVID-19, it is uncertain whether demand for PPE will continue at the same level. As a result, we may experience reduced demand for MarketPlace attributable to PPE as the pandemic begins to abate.\nCost of Services and Product Support\nYear Ended\nJune 30, 2021\n$\nChange\n%\nChange\nYear Ended\nJune 30, 2020\nCost of service and product support\n$6,884,647\n$(112,777)\n-2%\n$6,997,424\nPercent of total revenue\n33%\n35%\nCost of services and product support was $6,884,647 or 33% of total revenue, and $6,997,424 or 35% of total revenue for the years ended June 30, 2021 and 2020, respectively, a 2% decrease. This decrease is primarily the result of (i) higher expense associated to MarketPlace and the sales of PPE; and (ii) an increase in hardware/software non-capitalized items required for updating our information systems security, maintaining equipment licensing and other database systems.\nWhile we have experienced a significant increase in Marketplace costs and corresponding revenue during the pandemic due to demand in PPE, it is unclear what level of ongoing Marketplace costs we may experience as the pandemic begins to abate.\nSales and Marketing Expense\nYear Ended\nJune 30,\n$\nChange\n%\nChange\nYear Ended\nJune 30,\nSales and marketing\n$4,995,578\n$(779,731)\n-14%\n$5,775,309\nPercent of total revenue\n24%\n29%\nThe Company’s sales and marketing expense was $4,995,578, or 24% of total revenue, and $5,775,309, or 29% of total revenue, for the fiscal years ended June 30, 2021 and 2020, respectively, a 14% decrease. This decrease in sales and marketing expense is due primarily to a decrease in variable compensation, a reduction in trade show expense, and lower sales and marketing travel expense.\nGeneral and Administrative Expense\nYear Ended\nJune 30,\n$\nChange\n%\nChange\nYear Ended\nJune 30,\nGeneral and administrative\n$5,214,936\n$266,493\n5%\n$4,948,443\nPercent of total revenue\n25%\n25%\nThe Company’s general and administrative expense was $5,214,936, or 25% of total revenue, and $4,948,443 or 25% of total revenue for the years ended June 30, 2021 and 2020, respectively, a 5% increase. General and administrative expense increased year over year due to an increase in bad debt expense and higher insurance costs. These increases were partially offset by lower general overhead due to cost cutting measures and natural reductions due to our “work from home” status since April of 2020.\nDepreciation and Amortization Expense\nYear Ended\nJune 30,\n$\nChange\n%\nChange\nYear Ended\nJune 30,\nDepreciation and amortization\n$1,019,515\n$180,649\n22%\n$838,866\nPercent of total revenue\n5%\n4%\nThe Company’s depreciation and amortization expense was $1,019,515 and $838,866 for the years ended June 30, 2021 and 2020, respectively, a 22% increase. This increase is due to the expansion of new equipment for the Company’s information technology infrastructure, buildout of our corporate headquarters, and expansion of our data center completed in June 2020.\nOther Income and Expense\nYear Ended\nJune 30,\n$\nChange\n%\nChange\nYear Ended\nJune 30,\nOther income and (expense)\n$1,301,892\n$1,144,716\n728%\n$157,176\nPercent of total revenue\n6%\n1%\nOther income was $1,301,892 compared to $157,176 for the years ended June 30, 2021, and 2020, respectively, a 728% increase. Other income increased due to recognition of a gain on debt extinguishment and higher interest income resulting from an increase of total cash held in short term investments offset in part by the increase in interest expense associated with financing arrangements for equipment purchased under a lease arrangement with a bank. The financing arrangement was paid off in August 2020.\nPreferred Dividends\nYear Ended\nJune 30,\n$\nChange\n%\nChange\nYear Ended\nJune 30,\nPreferred dividends\n$586,444\n$-\n-%\n$586,444\nPercent of total revenue\n3%\n3%\nDividends accrued on the Company’s Series B Preferred and Series B-1 Preferred was $568,444 for the years ended June 30, 2021 and 2020, respectively. Dividends remained flat in the comparable periods.\nFinancial Position, Liquidity and Capital Resources\nWe believe that our existing cash and short-term investments, together with funds generated from operations, are sufficient to fund operating and investment requirements for at least the next twelve months. Our future capital requirements will depend on many factors, including macroeconomic conditions, our rate of revenue growth, sales and marketing activities, the timing and extent of spending required for research and development efforts and the continuing market acceptance of our products and services.\nYear Ended\nJune 30,\n$\nChange\n%\nChange\nYear Ended\nJune 30,\nCash and Cash Equivalents\n$24,070,322\n$3,724,992\n18%\n$20,345,330\nWe have historically funded our operations with cash from operations, equity financings, and borrowings from the issuance of debt, including our existing line of credit with U.S. Bank N.A.\nCash was $24,070,322 and $20,345,330 at June 30, 2021 and 2020, respectively. This 18% increase is principally the result of growth in both software and MarketPlace revenue, collection of accounts receivable, and extinguished debt.\nNet Cash Flows from Operating Activities\nYear Ended\nJune 30, 2021\n$\nChange\n%\nChange\nYear Ended\nJune 30, 2020\nCash provided by operating activities\n$5,401,815\n$1,205,676\n29%\n$4,196,139\nNet cash provided by operating activities is summarized as follows:\nNet income\n$4,117,395\n$1,593,269\nNoncash expense and income, net\n1,388,831\n2,084,287\nNet changes in operating assets and liabilities\n(104,411)\n518,583\n$5,401,815\n$4,196,139\nNet cash provided by operating activities for the year ended June 30, 2021 was $5,401,815 compared to net cash provided by in operating activities of $4,916,139 for the year ended June 30, 2020. Net cash provided by operating activities increased 29% due largely to higher revenues and lower operating costs. Noncash expense decreased by $695,456 in the year ended June 30, 2021 compared to June 30, 2020 as a result of gain on debt extinguishment and an increase in depreciation and amortization offset by a decrease in stock compensation expense.\nNet Cash Flows Used in Investing Activities\nYear Ended\nJune 30, 2021\n$\nChange\n%\nChange\nYear Ended\nJune 30, 2020\nCash used in investing activities\n$(318,873)\n331,549\n-51%\n$(650,422)\nNet cash used in investing activities for the year ended June 30, 2021 was $318,873 compared to net cash used in investing activities of $650,422 for the year ended June 30, 2020. This decrease in cash used in investing activities for the year ended June 30, 2021 was primarily due to the buildout of new Murray, UT headquarters and expansion of our data center that was completed in 2020 that did not occur in the same period in 2021.\nNet Cash Flows from Financing Activities\nYear Ended\nJune 30, 2021\n$\nChange\n%\nChange\nYear Ended\nJune 30, 2020\nCash used in financing activities\n$(1,357,950)\n$451,860\n-25%\n$(1,809,810)\nNet cash used in financing activities totaled $1,357,950 for the year ended June 30, 2021 compared to net cash used in financing activities of $1,809,810 for the year ended June 30, 2020. The decrease in net cash used in financing activities is primarily attributable to the August 2020 payoff of a financing arrangement with a bank partially offset by a decrease in our stock buyback program.\nLiquidity and Working Capital\nAt June 30, 2021, the Company had positive working capital of $20,400,991, as compared with positive working capital of $18,236,664 at June 30, 2020. This $2,164,327 increase in working capital is primarily due to an increase in cash resulting from higher revenue.\nAs of\nJune 30,\nAs of\nJune 30,\nVariance\nDollars\nPercent\nCurrent assets\n$29,701,774\n$27,148,911\n$2,552,863\n9%\nCurrent assets as of June 30, 2021 totaled $29,701,774, an increase of $2,552,863, as compared to $27,148,911 as of June 30, 2020. The increase in current assets is primarily attributable to an increase in cash of $3,724,992, a decrease in contract assets and prepaid expense of $1,056,512 and a decrease in accounts receivable of $115,617.\nAs of\nJune 30,\nAs of\nJune 30,\nVariance\nDollars\nPercent\nCurrent liabilities\n$9,300,783\n$8,912,247\n$388,536\n4%\nCurrent liabilities totaled $9,300,783 as of June 30, 2021 as compared to $8,912,247 as of June 30, 2020. The comparative increase in current liabilities is primarily attributable to an increase of $1,340,000 in our line of credit, $161,356 decrease comprised of accrued liabilities and accounts payable, offset by a decrease of $790,108 of current portion of the notes payable and extinguished debt.\nWhile no assurances can be given, management currently believes that the Company will continue to increase its cash flow from operations and working capital position in subsequent periods, and that it will have adequate cash resources to fund its operations and satisfy its debt obligations for at least the next 12 months.\nContractual Obligations\nTotal contractual obligations and commercial commitments as of June 30, 2021 are summarized in the following table:\nPayment Due by Year\nTotal\nLess than 1 Year\n1-3 Years\n3-5 Years\nMore than 5 Years\nOperating lease obligations\n$695,370\n$90,156\n$194,326\n$214,783\n$196,105\nInflation\nThe impact of inflation has historically not had a material effect on the Company’s financial condition or results from operations; however, higher rates of inflation may cause retailers to slow their spending in the technology area, which could have an impact on the Company’s sales.",
    "item_7A": "ITEM 7A.\nQUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nEach of our contracts require payment in U.S. dollars. We therefore do not engage in hedging transactions to reduce our exposure to changes in currency exchange rates, although in the event any future contracts are denominated in a foreign currency, we may do so in the future. As a result, our financial results are not affected by factors such as changes in foreign currency exchange rates.",
    "item_8": "ITEM 8.\nFINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe information required hereunder in this Annual Report is set forth in the financial statements and the notes thereto beginning on Page.",
    "item_9": "ITEM 9.\nCHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.",
    "item_9A": "ITEM 9A.\nCONTROLS AND PROCEDURES\n(a)\nEvaluation of disclosure controls and procedures.\nUnder the supervision and with the participation of our Management, including our principal executive officer and principal financial officer, we conducted an evaluation of the effectiveness of the design and operations of our disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act, as of June 30, 2021. Based on this evaluation, the Company’s Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures are effective to ensure that information required to be disclosed in the reports submitted under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in SEC rules and forms, including to ensure that information required to be disclosed by the Company is accumulated and communicated to management, including the principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure.\n(b)\nManagement’s Annual Report on Internal Control over Financial Reporting.\nWe are responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act). Our internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes of GAAP.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance of achieving their control objectives.\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting for the Company. With our participation, an evaluation of the effectiveness of our internal control over financial reporting was conducted as of June 30, 2021, based on the framework and criteria established in Internal Control Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our internal control over financial reporting was effective as of June 30, 2021.\n(c)\nChanges in Internal Controls over Financial Reporting.\nOur Chief Executive Officer and Chief Financial Officer have determined that there has been no change, in the Company’s internal control over financial reporting during the period covered by this report identified in connection with the evaluation described in the above paragraph that have materially affected, or are reasonably likely to materially affect, Company’s internal control over financial reporting.",
    "item_9B": "ITEM 9B.\nOTHER INFORMATION\nNone.\nPART III",
    "item_10": "ITEM 10.\nDIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by this item will be incorporated by reference from Park City Group, Inc.’s definitive proxy statement, to be filed with the Securities and Exchange Commission on or before October 28, 2021.",
    "item_11": "ITEM 11.\nEXECUTIVE COMPENSATION\nThe information required by this item will be incorporated by reference from Park City Group, Inc.’s definitive proxy statement, to be filed with the Securities and Exchange Commission on or before October 28, 2021.",
    "item_12": "ITEM 12.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this item will be incorporated by reference from Park City Group, Inc.’s definitive proxy statement, to be filed with the Securities and Exchange Commission on or before October 28, 2021.",
    "item_13": "ITEM 13.\nCERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this item will be incorporated by reference from Park City Group, Inc.’s definitive proxy statement, to be filed with the Securities and Exchange Commission on or before October 28, 2021.",
    "item_14": "ITEM 14.\nPRINCIPAL ACCOUNTING FEES AND SERVICES\nThe information required by this item will be incorporated by reference from Park City Group, Inc.’s definitive proxy statement, to be filed with the Securities and Exchange Commission on or before October 28, 2021.\nPART IV",
    "item_15": "ITEM 15.\nEXHIBITS, FINANCIAL STATEMENT SCHEDULES\nExhibits, Financial Statements and Schedules\nExhibit\nNumber\nDescription\n3.1\nArticles of Incorporation (Incorporated by reference from the Company’s Definitive Proxy Statement on Schedule 14C dated June 5, 2002). (1)\n3.2\nCertificate of Amendment (Incorporated by reference from Exhibit 3.3 to the Company’s Quarterly Report on Form 10-QSB for the quarter ended Sept 30, 2005, dated November 10, 2005). (2)\n3.3\nCertificate of Amendment (Incorporated by reference from Exhibit 3.4 to the Company’s Annual Report on Form 10-KSB for the year ended June 30, 2006, dated September 29, 2006). (3)\n3.4\nCertificate of Amendment (Incorporated by reference from Exhibit 4.1 to the Company’s Current Report on Form 8-K dated July 28, 2017). (13)\n3.5\nAmended and Restated Bylaws (Incorporated by reference from Exhibit 3.1 the Company’s Current Report on Form 8-K dated October 21, 2016). (11)\n4.1\nCertificate of Designation of the Series B Convertible Preferred Stock (Incorporated by reference from Exhibit 3.1 to the Company’s Current Report on Form 8-K dated July 21, 2010). (4)\n4.2\nFourth Amended and Restated Certificate of Designation of the Relative Rights, Powers and Preferences of the Series B Preferred Stock of Park City Group, Inc. (Incorporated by reference from Exhibit 4.1 the Company’s Current Report on Form 8-K dated January 14, 2016). (10)\n4.3\nFirst Amended and Restated Certificate of Designation of the Relative Rights, Powers and Preferences of the Series B-1 Preferred Stock of Park City Group, Inc. (Incorporated by reference from Exhibit 4.2 to the Company’s Current Report on Form 8-K dated January 14, 2016). (10)\n10.1\nAmendment to Loan Agreement and Note, by and between U.S. Bank National Association and the Company, dated September 15, 2009 (Incorporated by reference from Exhibit 10.1 the Company’s Current Report on Form 8-K dated September 30, 2009). (5)\n10.2\nAmendment to Loan Agreement and Note, by and between U.S. Bank National Association and the Company, dated May 5, 2010 (Incorporated by reference from Exhibit 10.2 to the Company’s Current Report on Form 8-K dated May 6, 2010). (6)\n10.3\nSecond Amended and Restated 2011 Stock Incentive Plan, dated April 1, 2013 (Incorporated by reference from Exhibit 10.1 to the Company’s Registration Statement on Form S-8, dated September 4, 2013). (7)\n10.4\nSecond Amended and Restated 2011 Employee Stock Purchase Plan, dated April 1, 2013 (Incorporated by reference from Exhibit 10.2 to the Company’s Registration Statement on Form S-8, dated September 4, 2013). (7)\n10.5\nFields Employment Agreement (Incorporated by reference from Exhibit 10.8 to the Company’s Annual Report on Form 10-K dated September 11, 2014). (9)\n10.6\nServices Agreement (Incorporated by reference from the Company’s Form 10-K dated September 11, 2014).(9)\n10.7\nAmendment No. 1 to the Employment Agreement, by and between Park City Group, Inc., Randall K. Fields and Fields Management, Inc., dated July 1, 2016 (Incorporated by reference from Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q dated November 7, 2016). (12)\n10.8\nAmendment No. 1 to the Second Amended and Restated 2011 Stock Incentive Plan of Park City Group, Inc., dated August 3, 2017 (Incorporated by reference from Exhibit 10.1 to the Company’s Registration Statement on Form S-8 dated November 9, 2017) (15)\n10.9\nAmendment No. 1 to the Second Amended and Restated 2011 Employee Stock Purchase Plan of Park City Group, Inc., dated August 3, 2017 (Incorporated by reference from Exhibit 10.2 to the Company’s Registration Statement on Form S-8 dated November 9, 2017) (15)\n10.10\nAmendment to Services Agreement (Incorporated by reference from Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q dated May 10, 2018). (16)\n10.11\nAmendment to Note, by and between U.S. Bank National Association and the Company, dated January 9, 2019 (Incorporated by reference from Exhibit 10.1 to the Company’s Current Report on Form 8-K dated January 15, 2019). (17)\n10.12\nMaster Lease Agreement, dated January 9, 2019 (Incorporated by reference from Exhibit 10.2 to the Company’s Current Report on Form 8-K dated January 15, 2019). (17)\n10.13\nEmployment Agreement by and between John Merrill and Park City Group, Inc., dated May 29, 2019 (Incorporated by reference from Exhibit 10.1 to the Company’s Current Report on Form 8-K dated May 31, 2019). (18)\n10.14\nLoan Agreement by and between U.S. Bank National Association and the Company, dated April 23, 2020 (Incorporated by reference from Exhibit 10.2 to the Company’s Current Report on Form 8-K dated April 27, 2020). (19)\n10.15\nAmendment No. 2 to the Second Amended and Restated 2011 Employee Stock Purchase Plan of Park City Group, Inc., dated March 17, 2021 (Incorporated by reference from Exhibit 10.1 to the Company’s Form S-8 dated April 12, 2021). (20)\n14.1\nCode of Ethics and Business Conduct (Incorporated by reference from the Company’s Annual Report Form 10-KSB for the period ended June 30, 2008, dated September 29, 2008). (8)\nList of Subsidiaries (Incorporated by reference from the Company’s Annual Report on Form 10-K for the period ended June 30, 2017, dated September 13, 2017). (14)\n23.1\nConsent of Haynie & Company, dated September 28, 2021*\n31.1\nCertification of Principal Executive Officer pursuant to Section 302 of Sarbanes Oxley Act of 2002 *\n31.2\nCertification of Principal Financial Officer pursuant to Section 302 of Sarbanes Oxley Act of 2002 *\n32.1\nCertification of Principal Executive Officer and Principal Financial Officer pursuant to 18 U.S.C. Section 1350 *\n(1)\nIncorporated by reference from our Form DEF 14C dated June 5, 2002.\n(2)\nIncorporated by reference from our Form 10-QSB for the year ended Sept 30, 2005.\n(3)\nIncorporated by reference from our Form 10-KSB dated September 29, 2006.\n(4)\nIncorporated by reference from our Form 8-K dated July 21, 2010.\n(5)\nIncorporated by reference from our Form 8-K dated September 30, 2009.\n(6)\nIncorporated by reference from our Form 8-K dated May 6, 2010.\n(7)\nIncorporated by reference from our Registration Statement on Form S-8 dated September 4, 2013.\n(8)\nIncorporated by reference from our Form 10-KSB dated September 29, 2008.\n(9)\nIncorporated by reference from our Form 10-K dated September 11, 2014.\n(10)\nIncorporated by reference from our Form 8-K dated January 14, 2016.\n(11)\nIncorporated by reference from our Form 8-K dated October 21, 2016.\n(12)\nIncorporated by reference from our Form 10-Q dated November 7, 2016.\n(13)\nIncorporated by reference from our Form 8-K dated July 28, 2017.\n(14)\nIncorporated by reference from our Form 10-K dated September 13, 2017.\n(15)\nIncorporated by reference from our Registration Statement on Form S-8 dated November 9, 2017.\n(16)\nIncorporated by reference from our Form 10-Q dated May 10, 2018.\n(17)\nIncorporated by reference from our Form 8-K dated January 15, 2019.\n(18)\nIncorporated by reference from our Form 8-K dated May 31, 2019.\n(19)\nIncorporated by reference from our Form 8-K dated April 27, 2020.\n(20)\nIncorporated by reference from our Form 8-K dated April 12, 2021.\n*\nFiled herewith\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Exchange Act, the registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nPARK CITY GROUP, INC.\n(Registrant)\nDate: September 28, 2021\nBy: /s/ Randall K. Fields\nPrincipal Executive Officer,\nChair of the Board and Director\nIn accordance with the Exchange Act, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Randall K. Fields\nChair of the Board and Director,\nSeptember 28, 2021\nRandall K. Fields\nChief Executive Officer\n(Principal Executive Officer)\n/s/ John Merrill\nChief Financial Officer\nSeptember 28, 2021\nJohn Merrill\n(Principal Financial Officer &\nPrincipal Accounting Officer)\n/s/ Robert W. Allen\nDirector, and Compensation\nSeptember 28, 2021\nRobert W. Allen\nCommittee Chair\n/s/ Peter J. Larkin\nDirector\nSeptember 28, 2021\nPeter J. Larkin\n/s/ Ronald C. Hodge\nDirector, and Audit Committee Chair\nSeptember 28, 2021\nRonald C. Hodge\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nStockholders of Park City Group, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Park City Group, Inc. (the Company) as of June 30, 2021 and 2020, and the related statements of income, stockholders’ equity, and cash flows for each of the years in the two-year period ended June 30, 2021, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2021 and 2020, and the results of its operations and its cash flows for each of the years in the two-year period ended June 30, 2021, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nRevenue Recognition - Multiple Element Arrangements\nDescription of the Matter:\nThe Company recognized approximately $21 million in revenue during the year ended June 30, 2021. As discussed in Note 2 to the financial statements, the Company enters into several different types of revenue arrangements that often consist of multiple performance obligations. Management must use judgment to determine the appropriate value and allocation of revenue to these performance obligations.\nAuditing management’s assumptions and judgments can be complex, involves judgment, and requires a thorough understanding of the Company’s various revenue streams.\nHow We Addressed the Matter in Our Audit:\nWe obtained and reviewed documentation to support the revenue recognition criteria. We tested performance obligations by reviewing the underlying contracts, evaluating management’s determination of the method and timing of measuring revenue, and testing management’s allocation of revenue to the performance obligations. Lastly, we tested the design and operating effectiveness of internal controls over the revenue cycle as well as the Information Technology General Controls as these heavily impact the revenue cycle.\nHaynie & Company\nSalt Lake City, Utah\nSeptember 28,\nWe have served as the Company’s auditor since 2016.\nPARK CITY GROUP, INC.\nConsolidated Balance Sheets\nAssets\nJune 30,\nJune 30,\nCurrent Assets\nCash\n$24,070,322\n$20,345,330\nReceivables, net of allowance for doubtful accounts of $234,693 and $251,954 at June 30, 2021 and 2020, respectively\n3,891,699\n4,007,316\nContract asset - unbilled current portion\n1,248,936\n2,300,754\nPrepaid expense and other current assets\n490,817\n495,511\nTotal Current Assets\n29,701,774\n27,148,911\nProperty and equipment, net\n2,589,194\n3,003,402\nOther Assets:\nDeposits, and other assets\n22,414\n22,414\nPrepaid expense - less current portion\n47,987\n77,030\nContract asset - unbilled long-term portion\n408,925\n838,726\nOperating lease - right-of-use asset\n695,371\n781,137\nCustomer relationships\n525,600\n657,000\nGoodwill\n20,883,886\n20,883,886\nCapitalized software costs, net\n171,732\n18,539\nTotal Other Assets\n22,755,915\n23,278,732\nTotal Assets\n$55,046,883\n$53,431,045\nLiabilities and Shareholders’ Equity\nCurrent liabilities\nAccounts payable\n$467,194\n$407,497\nAccrued liabilities\n988,092\n1,123,528\nContract liability - deferred revenue\n1,755,341\n1,845,347\nLines of credit\n6,000,000\n4,660,000\nOperating lease liability - current\n90,156\n85,767\nCurrent portion of notes payable\n-\n310,242\nCurrent portion of paycheck protection program loans\n-\n479,866\nTotal current liabilities\n9,300,783\n8,912,247\nLong-term liabilities\nOperating lease liability - less current portion\n605,214\n695,369\nNotes payable, less current portion\n-\n610,512\nPaycheck protection program loans\n-\n629,484\nTotal liabilities\n9,905,997\n10,847,612\nCommitments and contingencies\nStockholders’ equity:\nPreferred Stock; $0.01 par value, 30,000,000 shares authorized;\nSeries B Preferred, 700,000 shares authorized; 625,375 shares issued and outstanding at June 30, 2021 and 2020;\n6,254\n6,254\nSeries B-1 Preferred, 550,000 shares authorized; 212,402 shares issued and outstanding at June 30, 2021 and 2020, respectively\n2,124\n2,124\nCommon Stock, $0.01 par value, 50,000,000 shares authorized; 19,351,935 and 19,484,485 issued and outstanding at June 30, 2021 and 2020, respectively\n193,522\n194,847\nAdditional paid-in capital\n74,298,924\n75,271,097\nAccumulated deficit\n(29,359,938)\n(32,890,889)\nTotal stockholders’ equity\n45,140,886\n42,583,433\nTotal liabilities and stockholders’ equity\n$55,046,883\n$53,431,045\nSee accompanying notes to consolidated financial statements.\nPARK CITY GROUP, INC. AND SUBSIDIARIES\nConsolidated Statements of Operations\nFor the Years Ended June 30,\nRevenue\n$21,007,076\n$20,038,054\nOperating expense:\nCost of revenue and product support\n6,884,647\n6,997,424\nSales and marketing\n4,995,578\n5,775,309\nGeneral and administrative\n5,214,936\n4,948,443\nDepreciation and amortization\n1,019,515\n838,866\nTotal operating expense\n18,114,676\n18,560,042\nIncome from operations\n2,892,400\n1,478,012\nOther income (expense):\nInterest income\n237,269\n224,908\nInterest expense\n(106,680)\n(67,732)\nUnrealized gain on short term investments\n61,953\n-\nGain on debt extinguishment\n1,109,350\n-\nIncome before income taxes\n4,194,292\n1,635,188\n(Provision) for income taxes\n(76,897)\n(41,919)\nNet income\n4,117,395\n1,593,269\nDividends on Preferred Stock\n(586,444)\n(586,444)\nNet income applicable to common shareholders\n$3,530,951\n$1,006,825\nWeighted average shares, basic\n19,502,000\n19,651,000\nWeighted average shares, diluted\n19,754,000\n19,863,000\nBasic earnings per share\n$0.18\n$0.05\nDiluted earnings per share\n$0.18\n$0.05\nSee accompanying notes to consolidated financial statements.\nPARK CITY GROUP, INC. AND SUBSIDIARIES\nConsolidated Statements of Stockholders’ Equity (Deficit)\nSeries B\nPreferred Stock\nSeries B-1\nPreferred Stock\nCommon Stock\nAdditional\nPaid-In\nAccumulated\nShares\nAmount\nShares\nAmount\nShares\nAmount\nCapital\nDeficit\nTotal\nBalance, June 30,\n625,375\n6,254\n212,402\n2,124\n19,793,372\n197,936\n76,908,566\n(33,897,714)\n43,217,166\nStock issued for:\nAccrued compensation\n-\n-\n-\n-\n76,575\n396,223\n-\n396,989\nCash\n-\n-\n-\n-\n26,723\n120,657\n-\n120,924\nPreferred Dividends-Declared\n-\n-\n-\n-\n-\n-\n-\n(586,444)\n(586,444)\nStock Buyback\n-\n-\n-\n-\n(412,185)\n(4,122)\n(2,154,349)\n-\n(2,158,471)\nNet income\n-\n-\n-\n-\n-\n-\n-\n1,593,269\n1,593,269\nBalance, June 30,\n625,375\n$6,254\n212,402\n$2,124\n19,484,485\n$194,847\n$75,271,097\n$(32,890,889)\n$42,583,433\nStock issued for:\nAccrued compensation\n-\n-\n-\n-\n46,376\n216,789\n-\n217,253\nCash\n-\n-\n-\n-\n32,082\n117,166\n-\n117,487\nPreferred Dividends-Declared\n-\n-\n-\n-\n-\n-\n-\n(586,444)\n(586,444)\nStock Buyback\n-\n-\n-\n-\n(211,008)\n(2,110)\n(1,306,128)\n-\n(1,308,238)\nNet income\n-\n-\n-\n-\n-\n-\n-\n4,117,395\n4,117,395\nBalance, June 30,\n625,375\n$6,254\n212,402\n$2,124\n19,351,935\n$193,522\n$74,298,924\n$(29,359,938)\n$45,140,886\nSee accompanying notes to consolidated financial statements.\nPARK CITY GROUP, INC. AND SUBSIDIARIES\nConsolidated Statements of Cash Flows\nFor the Years Ended June 30,\nCash flows from operating activities:\nNet income\n$4,117,395\n$1,593,269\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization\n1,019,515\n803,002\nAmortization of operating right of use asset\n85,766\n81,604\nStock compensation expense\n336,695\n399,681\nBad debt expense\n1,056,205\n800,000\nGain on debt extinguishment\n(1,109,350)\n-\nDecrease (increase) in:\nTrade receivables\n(199,437)\n(205,718)\nLong-term receivables, prepaids and other assets\n465,978\n1,279,674\nIncrease (decrease) in:\nAccounts payable\n59,697\n(122,797)\nAccrued liabilities\n(254,601)\n(278,255)\nOperating lease liability\n(85,766)\n(81,605)\nDeferred revenue\n(90,282)\n(72,716)\nNet cash provided by operating activities\n5,401,815\n4,196,139\nCash flows from investing activities:\nPurchase of property and equipment\n(147,140)\n(650,422)\nCapitalization of software development costs\n(171,733)\n-\nNet cash used in investing activities\n(318,873)\n(650,422)\nCash flows from financing activities:\nProceeds from employee stock purchase plans\n117,487\n120,923\nProceeds from issuance of note payable\n-\n1,109,350\nNet increase in lines of credit\n1,340,000\n-\nDividends paid\n(586,444)\n(586,444)\nCommon stock buy-back\n(1,308,238)\n(2,158,471)\nPayments on notes payable and capital leases\n(920,755)\n(295,168)\nNet cash used in financing activities\n(1,357,950)\n(1,809,810)\nNet increase in cash and cash equivalents\n3,724,992\n1,735,907\nCash and cash equivalents at beginning of period\n20,345,330\n18,609,423\nCash and cash equivalents at end of period\n$24,070,322\n$20,345,330\nSupplemental Disclosure of Cash Flow Information\nCash paid for income taxes\n$167,185\n$100,158\nCash paid for interest\n$103,411\n$16,042\nSupplemental Disclosure of Non-Cash Investing and Financing Activities\nCommon Stock to pay accrued liabilities\n$217,253\n$396,989\nDividends accrued on Preferred Stock\n$586,444\n$586,444\nRight-of-use asset\n$-\n$862,741\nSee accompanying notes to consolidated financial statements.\nPARK CITY GROUP, INC. AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nJune 30, 2021 and June 30, 2020\nNOTE 1.\nDESCRIPTION OF BUSINESS\nSummary of Business\nPark City Group, Inc., a Nevada corporation (“Park City Group”, “We”, “us”, “our” or the “Company”) is a Software-as-a-Service (“SaaS”) provider, and the parent company of ReposiTrak, Inc., a Utah corporation (“ReposiTrak”) which operates a business-to-business (“B2B”) e-commerce, compliance, and supply chain management platform that partners with retailers, wholesalers, and product suppliers to help them source, vet, and transact with their suppliers in order to accelerate sales, control risks, and improve supply chain efficiencies, and source hard-to-get-things.\nThe Company’s services are grouped in three application suites: (i) ReposiTrak MarketPlace (“MarketPlace”), encompassing the Company’s supplier discovery and B2B e-commerce solutions, which helps the Company’s customers find new suppliers, (ii) ReposiTrak Compliance and Food Safety (“Compliance and Food Safety”) solutions, which help the Company’s customers vet suppliers to mitigate the risk of doing business with these suppliers, and (iii) ReposiTrak’s Supply Chain (“Supply Chain”) solutions, which help the Company’s customers to more efficiently manage their various transactions with their suppliers.\nRecent Developments\nDuring the second half of fiscal year 2021, ReposiTrak launched two new products designed to expand market share in the manufacturing segment: Certificate of Analysis Automation and Active-QMS for Quality Management. Both solutions were developed at the request of existing Compliance Management Solution customers and improve competitiveness in the manufacturing/food supply chain with synergistic solutions for growth in existing customers and increasing competitiveness for new business focused on quality management.\nThe quality management solution also has application in the retail sector, in central commissaries, distribution centers, and even task management in stores.\nAnother major new product initiative commenced in February 2021, as ReposiTrak joined with a group of major retailers and wholesalers to form the Food Traceability Leadership Consortium (FTLC), in response to the FDA’s announcement regarding the increase of food traceability requirements under the Food Safety Modernization Act. The expanded traceability requirements proposed by the FDA have far reaching consequences for the US food supply chain, from farms to fisheries down to retail stores, due to new, detailed documentation requirements designed to support more effective recalls.\nThese new proposed requirements create substantial data and records management challenges for all supply chain trading partners, many of whom do not have this capability today. The risk is that the supply chain will become fractious array of inoperable systems that could lead to massive operational complexity and expense escalation. The FTLC founding members worked collaboratively with ReposiTrak to develop a complete food traceability solution that meets all the FDA FSMA proposed reporting requirements at a very large manageable cost, based on the ReposiTrak supply chain platform which tracks product/shipment data in a similar manner today for cost and inventory control purposes.\nThe new solution, called the ReposiTrak Traceability Network, is launching in September 2021 with phased roll outs at suppliers and retailers, and is expected to scale rapidly through out fiscal year 2022, based on the existing Compliance Management user network.\nCOVID-19. There are many uncertainties regarding COVID-19, and the Company is closely monitoring the impact of the pandemic on all aspects of its business, including how it will impact its services, customers, employees, vendors, and business partners. While the pandemic did not materially adversely affect the Company’s financial results and business operations during the fiscal years ended June 30, 2021 or June 30, 2020, we are unable to predict the impact that COVID-19 will have on its future financial position and operating results due to numerous uncertainties. The Company expects to continue to assess the evolving impact of COVID-19 and intends to make adjustments to its responses accordingly.\nPaycheck Protection Loan. On April 23, 2020, the Company received proceeds from a loan in the amount of approximately $1.1 million from its lender, U.S. Bank National Association (the “Lender”), pursuant to approval by the U.S. Small Business Administration (the “SBA”) for the Lender to fund the Company’s request for a loan under the SBA’s Paycheck Protection Program (“PPP Loan”) created as part of the CARES Act administered by the SBA. On December 19, 2020, the SBA authorized full forgiveness in the amount of approximately $1.1 million under the PPP Loan, and the Company will not need to make any payments on the PPP Loan that U.S. Bank National Association facilitates as an SBA lender. U.S. Bank National Association has applied the forgiveness amount the SBA authorized, plus all accrued interest, to the Company’s PPP Loan. The requirements under this program are established by the SBA. All requests for PPP Loan forgiveness are subject to SBA eligibility.\nNOTE 2.\nSIGNIFICANT ACCOUNTING POLICIES\nPrinciples of Consolidation\nThe financial statements presented herein reflect the consolidated financial position of Park City Group and our Subsidiaries. All inter-company transactions and balances have been eliminated in consolidation.\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with U.S. generally accepted accounting principles (“GAAP”) requires management to make estimates and assumptions that materially affect the amounts reported in the consolidated financial statements. Actual results could differ from these estimates. The methods, estimates, and judgments the Company uses in applying its most critical accounting policies have a significant impact on the results it reports in its financial statements. The Securities and Exchange Commission (the “SEC”) has defined the most critical accounting policies as those that are most important to the portrayal of the Company’s financial condition and results and require the Company to make its most difficult and subjective judgments, often because of the need to make estimates of matters that are inherently uncertain. Based on this definition, the Company’s most critical accounting policies include revenue recognition, goodwill, other long-lived asset valuations, income taxes, stock-based compensation, and capitalization of software development costs.\nConcentration of Credit Risk and Significant Customers\nThe Company maintains cash in bank deposit accounts, which, at times, may exceed federally insured limits. The Company has not experienced any losses in such accounts and believes it is not exposed to any significant credit risk on cash and cash equivalents. Financial instruments, which potentially subject the Company to concentration of credit risk, consist primarily of trade receivables. In the normal course of business, the Company provides credit terms to its customers. Accordingly, the Company performs ongoing evaluations of its customers and maintains allowances for possible losses. The provision is based on the overall composition of our accounts receivable aging, our prior history of accounts receivable write-offs, and our experience with specific customers.\nOther factors indicating significant risk include customers that have filed for bankruptcy or customers for which we have less payment history to rely upon. We rely on historical trends of bad debt as a percentage of total revenue and apply these percentages to the accounts receivable which when realized have been within the range of management’s expectations. The Company does not require collateral from its customers.\nThe Company’s accounts receivable are derived from sales of products and services primarily to customers operating multilocation retail and grocery stores. The Company writes off accounts receivable when they are determined to be uncollectible. Changes in the allowances for doubtful accounts are recorded as bad debt expense and are included in general and administrative expense in our consolidated financial statements. Amounts that have been invoiced are recorded in accounts receivable (current and long-term), and in deferred revenue or revenue, depending on whether the revenue recognition criteria have been met.\nThe Company had two customers that accounted for greater than 10% of accounts receivable at June 30, 2021. Customer A had a balance of $967,300 and $0 and customer B had a balance of $404,155 and $122,000, for June 30, 2021 and June 30, 2020, respectively.\nPrepaid Expense and Other Current Assets\nPrepaid expense and other current assets include amounts for which payment has been made but the services have not yet been consumed. The Company’s prepaid expense is made up primarily of prepayments for hosted software applications used in the Company’s operations, maintenance agreements on hardware and software, and other miscellaneous amounts for insurance, membership fees and professional fees. Prepaid expense is amortized on a pro-rata basis to expense accounts as the services are consumed typically by the passage of time or as the service is used.\nDepreciation and Amortization\nDepreciation and amortization of property and equipment is computed using the straight-line method based on the following estimated useful lives:\nYears\nFurniture and fixtures\n5-7\nComputer equipment\nEquipment under capital leases\nLong-term use equipment\nLeasehold improvements\nSee below\nLeasehold improvements are amortized over the shorter of the remaining lease term or the estimated useful life of the improvements.\nAmortization of intangible assets are computed using the straight-line method based on the following estimated useful lives:\nYears\nCustomer relationships\nAcquired developed software\nDeveloped software\nGoodwill\nSee below\nGoodwill and intangible assets deemed to have indefinite lives are subject to annual impairment tests. Other intangible assets are amortized over their useful lives.\nWarranties\nThe Company offers a limited warranty against software defects. Customers who are not completely satisfied with their software purchase may attempt to be reimbursed for their purchases outside the warranty period. For the years ending June 30, 2021 and 2020, the Company did not incur any expense associated with warranty claims.\nAdoption of ASC 718, Compensation - Stock Compensation\nFrom time to time, the Company issues shares of common stock as share-based compensation to employees and non-employees. The Company accounts for its share-based compensation to employees in accordance with FASB ASC 718, Compensation - Stock Compensation. Stock-based compensation cost is measured at the grant date, based on the estimated fair value of the award, and is recognized as expense over the requisite service or vesting period.\nIn prior periods through September 30, 2019, the Company accounted for share-based compensation issued to non-employees and consultants in accordance with the provisions of FASB ASC 505-50, Equity - Based Payments to Non-Employees. Measurement of share-based payment transactions with non-employees is based on the fair value of whichever is more reliably measurable: (a) the goods or services received; or (b) the equity instruments issued. The final fair value of the share-based payment transaction is determined at the performance completion date. For interim periods, the fair value is estimated, and the percentage of completion is applied to that estimate to determine the cumulative expense recorded.\nThe Company adopted the standard during the second quarter of fiscal year 2020. This standard did not have a material impact on the Company’s consolidated financial statements.\nAdoption of ASU 2016-02 “Leases (Topic 842)”\nIn February 2016, the FASB issued ASU 2016-02 “Leases (Topic 842)”. Under the new guidance, lessees will be required to recognize for all leases (with the exception of short-term leases) a lease liability, which is a lessee’s obligation to make lease payments arising from a lease, measured on a discounted basis and a right-of-use asset, which is an asset that represents the lessee’s right to use, or control the use of, a specified asset for the lease term.\nEffective July 1, 2019, the Company adopted the requirements of Accounting Standards Update No. 2016-02, \"Leases (Topic 842)\" (\"ASU 2016-02\"). All amounts and disclosures set forth in this Annual Report on Form 10-K have been updated to comply with this new standard with results for reporting periods beginning after July 1, 2019 presented under ASU 2016-02, while prior period amounts and disclosures are not adjusted and continue to be reported under the accounting standards in effect for the prior period.\nThe Company adopted the requirements of ASU 2016-02 utilizing the modified retrospective method of transition to identified leases as of July 1, 2019 (the “effective date”). The recognition of additional operating lease liabilities was $82,517 for the current portion and $760,172 for the long-term portion and corresponding operating right-of-use assets were recorded in the amount of $842,689. This represents the operating lease existing as of the effective date which has a lease term of three years with the option for two additional three-year terms.\nOn June 21, 2018, the Company entered into an office lease at 5258 South Commerce Drive Suite D292, Murray, Utah 84107, providing for the lease of approximately 9,800 square feet, commencing on March 1, 2019. The monthly rent is $10,200. The initial term of the lease is three years. The Company has the option of renewing for an additional two three-year terms.\nRevenue Recognition\nThe Company recognizes revenue as it transfers control of deliverables (products, solutions and services) to its customers in an amount reflecting the consideration to which it expects to be entitled. To recognize revenue, the Company applies the following five step approach: (1) identify the contract with a customer, (2) identify the performance obligations in the contract, (3) determine the transaction price, (4) allocate the transaction price to the performance obligations in the contract, and (5) recognize revenue when a performance obligation is satisfied. The Company accounts for a contract based on the terms and conditions the parties agree to, the contract has commercial substance and collectability of consideration is probable. The Company applies judgment in determining the customer’s ability and intention to pay, which is based on a variety of factors including the customer’s historical payment experience.\nThe Company may enter into arrangements that consist of multiple performance obligations. Such arrangements may include any combination of its deliverables. To the extent a contract includes multiple promised deliverables, the Company applies judgment to determine whether promised deliverables are capable of being distinct and are distinct in the context of the contract. If these criteria are not met, the promised deliverables are accounted for as a combined performance obligation. For arrangements with multiple distinct performance obligations, the Company allocates consideration among the performance obligations based on their relative standalone selling price. Standalone selling price is the price at which the Company would sell a promised good or service separately to the customer. When not directly observable, the Company typically estimates standalone selling price by using the expected cost plus a margin approach. The Company typically establishes a standalone selling price range for its deliverables, which is reassessed on a periodic basis or when facts and circumstances change.\nFor performance obligations where control is transferred over time, revenue is recognized based on the extent of progress towards completion of the performance obligation. The selection of the method to measure progress towards completion requires judgment and is based on the nature of the deliverables to be provided. Revenue related to fixed-price contracts for application development and systems integration services, consulting or other technology services is recognized as the service is performed using the output method, under which the total value of revenue is recognized based on each contract’s deliverable(s) as they are completed and when value is transferred to a customer. Revenue related to fixed-price application maintenance, testing and business process services is recognized based on our right to invoice for services performed for contracts in which the invoicing is representative of the value being delivered, in accordance with the practical expedient in ASC 606-10-55-18.\nIf the Company’s invoicing is not consistent with the value delivered, revenue is recognized as the service is performed based on the method described above. The output method measures the results achieved and value transferred to a customer, which is updated as the project progresses to reflect the latest available information; such estimates and changes in estimates involve the use of judgment. The cumulative impact of any revision in estimates is reflected in the financial reporting period in which the change in estimate becomes known and any anticipated losses on contracts are recognized immediately. Revenue related to fixed-price hosting and infrastructure services is recognized based on the Company’s right to invoice for services performed for contracts in which the invoicing is representative of the value being delivered, in accordance with the practical expedient in ASC 606-10-55-18. If the Company’s invoicing is not consistent with value delivered, revenue is recognized on a straight-line basis unless revenue is earned and obligations are fulfilled in a different pattern. The revenue recognition method applied to the types of contracts described above provides the most faithful depiction of performance towards satisfaction of the Company’s performance obligations.\nRevenue related to the Company’s software license arrangements that do not require significant modification or customization of the underlying software is recognized when the software is delivered as control is transferred at a point in time. For software license arrangements that require significant functionality enhancements or modification of the software, revenue for the software license and related services is recognized as the services are performed in accordance with the methods described above. In software hosting arrangements, the rights provided to the customer, such as ownership of a license, contract termination provisions and the feasibility of the client to operate the software, are considered in determining whether the arrangement includes a license or a service. Revenue related to software maintenance and support is generally recognized on a straight-line basis over the contract period.\nManagement expects that incremental commission fees paid as a result of obtaining a contract are recoverable and therefore the Company capitalized them as contract costs. The Company recognizes the incremental costs of obtaining contracts as an expense when incurred if the amortization period of the asset that the Company otherwise would have recognized is one year or less.\nRevenue related to transaction-based or volume-based contracts is recognized over the period the services are provided in a manner that corresponds with the value transferred to the customer to-date relative to the remaining services to be provided.\nFrom time to time, the Company may enter into arrangements with third party suppliers to resell products or services. In such cases, the Company evaluates whether the Company is the principal (i.e. report revenue on a gross basis) or agent (i.e. report revenue on a net basis). In doing so, the Company first evaluates whether it controls the good or service before it is transferred to the customer. If the Company controls the good or service before it is transferred to the customer, the Company is the principal; if not, the Company is the agent. Determining whether the Company controls the good or service before it is transferred to the customer may require judgment.\nThe Company provides customers with assurance that the related deliverable will function as the parties intended because it complies with agreed-upon specifications. General updates or patch fixes are not considered an additional performance obligation in the contract.\nVariable consideration is estimated using either the sum of probability weighted amounts in a range of possible consideration amounts (expected value), or the single most likely amount in a range of possible consideration amounts (most likely amount), depending on which method better predicts the amount of consideration to which we may be entitled. The Company includes in the transaction price variable consideration only to the extent it is probable that a significant reversal of revenue recognized will not occur when the uncertainty associated with the variable consideration is resolved. The Company’s estimates of variable consideration and determination of whether to include estimated amounts in the transaction price may involve judgment and is based largely on an assessment of its anticipated performance and all information that is reasonably available to the Company.\nThe Company assesses the timing of the transfer of goods or services to the customer as compared to the timing of payments to determine whether a significant financing component exists. As a practical expedient, the Company does not assess the existence of a significant financing component when the difference between payment and transfer of deliverables is a year or less. If the difference in timing arises for reasons other than the provision of finance to either the customer or us, no financing component is deemed to exist. The primary purpose of the Company’s invoicing terms is to provide customers with simplified and predictable ways of purchasing its services, not to receive or provide financing from or to customers. The Company does not consider set up or transition fees paid upfront by its customers to represent a financing component, as such fees are required to encourage customer commitment to the project and protect us from early termination of the contract.\nTrade Accounts Receivable and Contract Balances\nWe classify our right to consideration in exchange for deliverables as either a receivable or a contract asset (unbilled receivable). A receivable is a right to consideration that is unconditional (i.e. only the passage of time is required before payment is due). For example, we recognize a receivable for revenue related to our transaction or volume-based contracts when earned regardless of whether amounts have been billed. We present such receivables in trade accounts receivable, net in our consolidated statements of financial position at their net estimated realizable value. We maintain an allowance for doubtful accounts to provide for the estimated amount of receivables that may not be collected. The allowance is based upon an assessment of customer creditworthiness, historical payment experience, the age of outstanding receivables, judgment, and other applicable factors.\nA contract asset is a right to consideration that is conditional upon factors other than the passage of time. Contract assets are presented in current and other assets in our consolidated balance sheets and primarily relate to unbilled amounts on fixed-price contracts utilizing the output method of revenue recognition. The table below shows movements in contract assets:\nContract assets\nBalance - June 30,\n$3,139,480\nRevenue recognized during the period but not billed\n-\nAmounts reclassified to accounts receivable\n(1,391,313)\nOther\n(90,306)\nBalance - June 30,\n$1,657,861\n(1)\n(1) Contract asset balances for June 30, 2021 include a current and a long-term contract asset, $1,248,936 and $408,925, respectively.\nOur contract assets and liabilities are reported at the end of each reporting period. The difference between the opening and closing balances of our contract assets and deferred revenue primarily results from the timing difference between our performance obligations and the customer’s payment. We receive payments from customers based on the terms established in our contracts, which may vary generally by contract type.\nThe table below shows movements in the deferred revenue balances (current and noncurrent) for the period:\nContract liability\nBalance - June 30, 2020\n$1,845,347\nAmounts billed but not recognized as revenue\n1,665,648\nRevenue recognized related to the opening balance of deferred revenue\n(1,755,654)\nOther\n-\nBalance - June 30, 2021\n$1,755,341\nOur contract assets and liabilities are reported in a net position on a contract by contract basis at the end of each reporting period. The difference between the opening and closing balances of our contract assets and deferred revenue primarily results from the timing difference between our performance obligations and the customer’s payment. We receive payments from customers based on the terms established in our contracts, which may vary generally by contract type.\nDisaggregation of Revenue\nThe table below presents disaggregated revenue from contracts with customers by contract-type. All revenues for the years ending June 30, 2020 and 2021 were generated from sales in North America. We believe this disaggregation best depicts the nature, amount, timing and uncertainty of our revenue and cash flows that may be affected by industry, market and other economic factors:\nYear Ended, June 30\nChg $\nChg %\nRecurring - Subscription, Support and Services\n$17,733,134\n$16,043,245\n$1,689,889\n11%\nNon - Recurring - Services\n37,121\n849,288\n(812,167)\n-96%\nNon - Recurring - License\n-\n218,250\n(218,250)\n-100%\nTransaction Based - Marketplace\n3,236,821\n2,927,271\n309,550\n11%\nTotal\n$21,007,076\n$20,038,054\n$969,022\n5%\nSoftware Development Costs\nThe Company accounts for research costs of computer software to be sold, leased or otherwise marketed as expense until technological feasibility has been established for the product. Once technological feasibility is established, the company will occasionally capitalize software costs until the product is available for general release to customers. In these instances, the Company determines technological feasibility for its software products to have been reached when a working prototype is complete and meets or exceeds design specifications including functions, features, and technical performance requirements. The Company capitalized software development costs of $171,733 in the fiscal year ended June 30, 2021.\nResearch and Development Costs\nResearch and development costs include personnel costs, engineering, consulting, and contract labor and are expensed as incurred for software that has not achieved technological feasibility.\nAdvertising Costs\nAdvertising is expensed as incurred. Advertising costs were approximately $5,000 and $54,048 for the years ended June 30, 2021 and 2020, respectively.\nIncome Taxes\nThe Company recognizes deferred tax liabilities and assets for the expected future tax consequences of temporary differences between tax bases and financial reporting bases of other assets and liabilities.\nEarnings Per Share\nBasic net income per common share (“Basic EPS”) excludes dilution and is computed by dividing net income applicable to common shareholders by the weighted average number of shares of the Company’s common stock, par value $0.01 (“Common Stock”) outstanding during the period. Diluted net income per common share (“Diluted EPS”) reflects the potential dilution that could occur if stock options or other contracts to issue shares of Common Stock were exercised or converted into Common Stock. The computation of Diluted EPS does not assume exercise or conversion of securities that would have an antidilutive effect on net income per share of Common Stock.\nFor the years ended June 30, 2021 and 2020 warrants to purchase 1,085,068 shares of Common Stock were included in the computation of diluted EPS and warrants to purchase 23,737 shares were excluded due to the anti-dilutive effect. Warrants to purchase shares of Common Stock were outstanding at prices ranging $4.00 from to $10.00 per share at June 30, 2021.\nThe following table presents the components of the computation of basic and diluted earnings per share for the periods indicated:\nYear ended June 30,\nNumerator\nNet income applicable to common shareholders\n$3,530,951\n$1,006,825\nDenominator\nWeighted average common shares outstanding, basic\n19,502,000\n19,651,000\nWarrants to purchase Common Stock\n252,000\n212,000\nWeighted average common shares outstanding, diluted\n19,754,000\n19,863,000\nNet income per share\nBasic\n$0.18\n$0.05\nDiluted\n$0.18\n$0.05\nStock-Based Compensation\nThe Company recognizes the cost of employee services received in exchange for awards of equity instruments based on the grant-date fair value of those awards. The Company records compensation expense on a straight-line basis. The fair value of options granted are estimated at the date of grant using a Black-Scholes option pricing model with assumptions for the risk-free interest rate, expected life, volatility, dividend yield and forfeiture rate.\nCash and Cash Equivalents\nThe Company considers all highly liquid investments purchased with an original maturity of twelve months or less to be cash equivalents. Cash and cash equivalents are stated at fair value.\nFair Value of Financial Instruments\nThe Company’s financial instruments consist of cash, cash equivalents, receivables, payables, accruals and notes payable. The carrying amount of cash, cash equivalents, receivables, payables and accruals approximates fair value due to the short-term nature of these items. The notes payable also approximate fair value based on evaluations of market interest rates.\nNOTE 3.\nRECEIVABLES\nAccounts receivable consist of the following at June 30:\nAccounts receivable\n$5,375,598\n$6,560,024\nAllowance for doubtful accounts\n(234,963)\n(251,954)\n$5,140,635\n$6,308,070\nAccounts receivable consist of trade accounts receivable and unbilled amounts recognized as revenue during the year for which invoicing occurs subsequent to year-end. Amounts that have been invoiced are recorded in accounts receivable and in deferred revenue or revenue, depending on whether the revenue recognition criteria have been met.\nNOTE 4.\nPROPERTY AND EQUIPMENT\nProperty and equipment are stated at cost and consist of the following at June 30:\nComputer equipment\n$4,069,543\n$3,974,792\nFurniture and equipment\n2,237,684\n2,185,295\nLeasehold improvements\n807,816\n807,816\n7,115,043\n6,697,903\nLess accumulated depreciation and amortization\n(4,525,849)\n(3,964,501)\n$2,589,194\n$3,003,402\nDepreciation expense for the years ended June 30, 2021 and 2020 was $561,348 and $619,277, respectively.\nNOTE 5.\nCAPITALIZED SOFTWARE COSTS\nCapitalized software costs consist of the following at June 30:\nCapitalized software costs\n$2,909,044\n$2,737,312\nLess accumulated amortization\n(2,737,312)\n(2,718,773)\n$171,732\n$18,539\nAmortization expense for the years ended June 30, 2021 and 2020 was $18,539 and $52,326, respectively.\nNOTE 6.\nACQUISITION RELATED INTANGIBLE ASSETS, NET\nCustomer relationships consist of the following at June 30:\nCustomer relationships\n$5,537,161\n$5,537,161\nLess accumulated amortization\n(5,011,561)\n(4,880,161)\n$525,600\n$657,000\nAmortization expense for the years ended June 30, 2021 and 2020 was $131,400 and $131,400, respectively.\nEstimated aggregate amortization expense per year are as follows:\nYears ending June 30:\n$131,400\n$131,400\n$131,400\n$131,400\nNOTE 7.\nACCRUED LIABILITIES\nAccrued liabilities consist of the following at June 30:\nAccrued stock-based compensation\n$348,265\n$252,959\nAccrued compensation\n293,130\n383,088\nAccrued other liabilities\n56,333\n207,003\nAccrued taxes\n146,004\n136,117\nAccrued dividends\n144,360\n144,361\n$988,092\n$1,123,528\nNOTE 8.\nNOTES PAYABLE\nThe Company had the following notes payable obligations at June 30:\nNotes Payable:\nNote payable to a bank, due in monthly installments of $29,097 bearing interest at 4.99% due April 1, 2023 secured by related capital equipment\n$-\n$920,754\nUnsecured Paycheck Protection Program loans which carries an interest rate of 1%. Principle payments begin on November 23, 2020 in the amount of $61,429.\n-\n1,109,350\n$-\n$2,030,104\nLess current portion notes payable\n-\n(790,108)\n$-\n$1,239,996\nPaycheck Protection Loan. On December 19, 2020, the SBA authorized full forgiveness in the amount of approximately $1.1 million under the PPP Loan, whereby the Company will not need to make any payments on the PPP Loan that U.S. Bank National Association facilitates as an SBA lender. U.S. Bank National Association has applied the forgiveness amount the SBA authorized, plus all accrued interest, to the Company’s PPP Loan. The requirements under this program are established by the SBA. All requests for PPP Loan forgiveness are subject to SBA eligibility.\nNOTE 9.\nLINES OF CREDIT\nOn January 10, 2021, the Company and U.S. Bank entered into an amendment (the “Amendment”) to the outstanding Stand-Alone Revolving Note (the “Revolving Note”), preferred accompanying addendum. Pursuant to the Amendment, the parties agreed to (i) extend the maturity date to December 31, 2021 and (ii) increase the interest rate in the event of a default to 5% per annum.\nThe line of credit, as amended, is scheduled to mature on December 31, 2021. The balance on the line of credit at June 30, 2021 and June 30, 2020 was $6,000,000 and $4,660,000, respectively.\nNOTE 10.\nDEFERRED REVENUE\nDeferred revenue consisted of the following at June 30:\nSubscription\n$1,513,729\n$1,596,228\nOther\n241,612\n249,119\n$1,755,341\n$1,845,347\nNOTE 11.\nINCOME TAXES\nDeferred taxes are provided on a liability method whereby deferred tax assets are recognized for deductible temporary differences and operating loss and tax credit carry forwards and deferred tax liabilities are recognized for taxable differences. Temporary differences are the differences between the reported amounts of assets and liabilities and their tax bases. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment. Due to the tax rates being changed in 2018 we have used a federal and state blended rate of 26%.\nNet deferred tax liabilities consist of the following components at June 30:\nDeferred tax assets:\nNOL carryover\n$17,044,800\n$27,788,000\nAllowance for bad debts\n61,000\n65,500\nAccrued expenses\n77,200\n52,000\nDepreciation\n(630,200)\n(700,400)\nAmortization\n(687,500)\n(565,100)\nValuation allowance\n(15,865,300)\n(26,640,000)\nNet deferred tax asset\n$-\n$-\nThe income tax provision differs from the amounts of income tax determined by applying the US federal income tax rate to pretax income from continuing operations for the years ended June 30, 2021 and 2020 due to the following:\nBook income\n$1,062,891\n$414,250\nStock for services\n(25,679)\n4.625\nChange in accrual\n25,286\n(3,726)\nLife insurance\n17,626\n17,626\nMeals and entertainment\n3,505\n8,874\nChange in allowance\n(4,488)\n27,594\nChange in depreciation\n(52,113)\n(168,095)\nPPP & EIDL loan forgiveness\n(288,431)\n-\nNOL utilization\n(738,597)\n(301,148)\nValuation allowance\n-\n-\n$-\n$-\nAt June 30, 2021, the Company had net operating loss carry-forwards of approximately $65,557,000 that may be offset against past and future taxable income from the year 2020 through 2037. A significant portion of the net operating loss carryforwards began to expire in 2019. No tax benefit has been reported in the June 30, 2021 consolidated financial statements since the potential tax benefit is offset by a valuation allowance of the same amount.\nDue to the change in ownership provisions of the Tax Reform Act of 1986, net operating loss carryforwards for Federal income tax reporting purposes are subject to annual limitations. In January of 2009 the Company acquired Prescient Applied Intelligence, Inc. which had significant net operating loss carry-forwards. Due to the change in ownership, Prescient's net operating loss carryforwards may be limited as to use in future years. The limitation will be determined on a year-to-year basis. In June of 2015 the Company acquired Repositrak, Inc. which had significant net operating loss carryforwards. Due to the change in ownership, Repositrak's net operating loss carryforwards may be limited as to use in future years. The limitation will be determined on a year-to-year basis.\nThe Company determines whether it is more likely than not that a tax position will be sustained upon examination based upon the technical merits of the position. If the more-likely-than-not threshold is met, the Company measures the tax position to determine the amount to recognize in the financial statements. The Company performed a review of its material tax positions in accordance with these recognition and measurement standards.\nThe Company has concluded that there are no significant uncertain tax positions requiring disclosure, and there are not material amounts of unrecognized tax benefits.\nThe Company includes interest and penalties arising from the underpayment of income taxes in the consolidated statements of operations in the provision for income taxes. As of June 30, 2021, the Company had no accrued interest or penalties related to uncertain tax positions.\nThe Company files income tax returns in the U.S. federal jurisdiction and various state jurisdictions. With few exceptions, the Company is no longer subject to U.S. federal, state and local income tax examinations by tax authorities for years before June 30, 2018.\nNOTE 12.\nCOMMITMENTS AND CONTINGENCIES\nLeases\nOn May 1, 2019, the Company completed the expansion of new equipment for the Company’s information technology infrastructure, buildout of its corporate headquarters, and expansion of its collocation data center, which it completed using approximately $1,269,000 (the “Lease Amount”) of funds provided by U.S. Bank to finance equipment and services related to the Company’s expansion and relocation pursuant to that certain lease agreement, originally entered into by and between the Company and U.S. Bank on January 9, 2019 (the “Lease Agreement”). Pursuant to the Lease Agreement, as of May 1, 2019, U.S. Bank is now leasing back the property and equipment purchased by the Company. Pursuant to the Lease Agreement, commencing May 1, 2019, the initial term of the lease shall be 48 months, the Lease Amount shall accrue interest at a rate of 5.0% per annum, and the Company shall be required to make monthly rental payments in the amount of approximately $29,097 per month. On July 30, 2020 the Company made an early repayment of the entire outstanding balance on the note payable due to U.S. Bank in the amount of $960,208. The repayment amount included $64,721 of accrued interest. No repayment penalties were incurred as a result of the transaction.\nOn June 21, 2018 the Company entered into an office lease at 5252 South Commerce Drive Suite D292, Murray, Utah 84107, providing for the lease of approximately 9,800 square feet for a period of three years, commencing on March 1, 2019. The monthly rent is $10,200.\nMinimum future payments, including principal and interest, under the non-cancelable capital leases are as follows:\nYear ending June 30:\n$81,600\nFrom time to time the Company may enter into or exit from diminutive operating lease agreements for equipment such as copiers, temporary back up servers, etc. These leases are not of a material amount and thus will not in the aggregate have a material adverse effect on our business, financial condition, results of operation or liquidity.\nNOTE 13.\nEMPLOYEE BENEFIT PLAN\nThe Company offers an employee benefit plan under Benefit Plan Section 401(k) of the Internal Revenue Code. Employees who have attained the age of 18 are eligible to participate. The Company, at its discretion, may match employee’s contributions at a percentage determined annually by the Board of Directors. The Company does not currently match contributions. There were no expenses for the years ended June 30, 2021 and 2020.\nNOTE 14.\nSTOCKHOLDERS EQUITY\nOfficers and Directors Stock Compensation\nEffective October 2018, the Board of Directors approved the following compensation for directors who are not employed by the Company:\n●\nAnnual cash compensation of $75,000 payable at the rate of $18,750 per quarter. The Company has the right to pay this amount in the form of shares of the Company’s Common Stock.\n●\nUpon appointment, outside independent directors receive a grant of $150,000 payable in shares of the Company’s restricted Common Stock calculated based on the market value of the shares of Common Stock on the date of grant. The shares vest ratably over a five-year period.\n●\nReimbursement of all travel expense related to performance of Directors’ duties on behalf of the Company.\nOfficers, Key Employees, Consultants and Directors Stock Compensation.\nIn January 2013, the Board of Directors approved the Second Amended and Restated 2011 Stock Plan (the “Amended 2011 Plan”), which Amended 2011 Plan was approved by shareholders on March 29, 2013. Under the terms of the Amended 2011 Plan, all employees, consultants and directors of the Company are eligible to participate. The maximum aggregate number of shares of Common Stock that may be granted under the Amended 2011 Plan is 675,000 shares.\nA Committee of independent members of the Company’s Board of Directors administers the Amended 2011 Plan. The exercise price for each share of Common Stock purchasable under any incentive stock option granted under the Amended 2011 Plan shall be not less than 100% of the fair market value of the Common Stock, as determined by the stock exchange on which the Common Stock trades on the date of grant. If the incentive stock option is granted to a shareholder who possesses more than 10% of the Company’s voting power, then the exercise price shall be not less than 110% of the fair market value on the date of grant. Each option shall be exercisable in whole or in installments as determined by the Committee at the time of the grant of such options. All incentive stock options expire after 10 years. If the incentive stock option is held by a shareholder who possesses more than 10% of the Company's voting power, then the incentive stock option expires after five years. If the option holder is terminated, then the incentive stock options granted to such holder expire no later than three months after the date of termination. For option holders granted incentive stock options exercisable for the first time during any fiscal year and in excess of $100,000 (determined by the fair market value of the shares of Common Stock as of the grant date), the excess shares of Common Stock shall not be deemed to be purchased pursuant to incentive stock options.\nDuring the years ended June 30, 2021 and 2020 the Company issued 40,883 and 61,551 shares to its directors and 37,575 and 41,747 shares to employees and consultants, respectively, under the Amended 2011 Plan. The Company, under its Share Repurchase Program, repurchased 211,008 and 412,185 shares of its Common Stock during the years ended June 30, 2021 and 2020, respectively. Those shares were cancelled and returned to authorized but unissued shares. The Company holds no Treasury Stock. Vested and issued shares under the Amended 2011 plan for the fiscal year ending June 30, 2021 and June 30, 2020, totaling 9,357 and 16,059, respectively are included in the rollforward of Restricted Stock units below.\nRestricted Stock Units\nRestricted Stock Units\nWeighted Average Grant Date Fair Value ($/share)\nOutstanding at July 1,\n866,274\n$5.47\nGranted\n1,008\n4.96\nVested and issued\n(16,059)\n9.33\nForfeited\n(13,799)\n7.74\nOutstanding at June 30,\n837,424\n5.36\nGranted\n13,249\n6.35\nVested and issued\n(9,357)\n8.74\nForfeited\n-\n-\nOutstanding at June 30,\n841,316\n5.34\nThe number of restricted stock units outstanding at June 30, 2021 included 9,288 units that have vested but for which shares of Common Stock had not yet been issued pursuant to the terms of the agreement.\nAs of June 30, 2021, there was approximately $4.5 million of unrecognized stock-based compensation expense under our equity compensation plans, which is expected to be recognized on a straight-line basis over a weighted average period of 2.51 years.\nWarrants\nOutstanding warrants were issued in connection with private placements of the Company’s Common Stock and with the restructuring of the Series B Preferred that occurred in March of 2018. The following table summarizes information about fixed stock warrants outstanding at June 30, 2021:\nWarrants Outstanding\nat June 30,\nWarrants Exercisable\nat June 30,\nRange of\nexercise prices\nNumber\nOutstanding\nWeighted average\nremaining contractual life (years)\nWeighted average exercise price\nNumber\nexercisable\nWeighted average\nexercise price\n$4.00\n1,085,068\n1.60\n$4.00\n1,085,068\n$4.00\n$10.00\n23,737\n1.57\n$10.00\n23,737\n$10.00\n1,108,805\n1.60\n$4.13\n1,108,805\n$4.13\nPreferred Stock\nThe Company’s articles of incorporation currently authorizes the issuance of up to 30,000,000 shares of ‘blank check’ preferred stock, par value $0.01 (“Preferred Stock”) with designations, rights, and preferences as may be determined from time to time by the Company’s Board of Directors, of which 700,000 shares are currently designated as Series B Preferred Stock (“Series B Preferred”) and 550,000 shares are designated as Series B-1 Preferred Stock (“Series B-1 Preferred”). Both classes of Series B Preferred Stock pay dividends at a rate of 7% per annum if paid by the Company in cash, or 9% if paid by the Company by the issuance of additional shares of Series B Preferred, or Series B-1 Preferred, as applicable.\nThe Company does business with some of the largest retailers and wholesalers in the World. Management believes the Series B-1 Preferred favorably impacts the Company’s overall cost of capital in that it is: (i) perpetual and, therefore, an equity instrument that positively impacts the Company’s coverage ratios, (ii) possesses a below market dividend rate relative to similar instruments, (iii) offers the flexibility of a paid-in-kind (PIK) payment option, and (iv) is without covenants. After exploring alternative options for redeeming the Series B-1 Preferred, management determined that alternative financing options were materially more expensive, or would impair the Company’s net cash position, which management believes could cause customer concerns and negatively impact the Company’s ability to attract new business.\nSection 4 of the Company’s First Amended and Restated Certificate of Designation of the Relative Rights, Powers and Preferences of the Series B-1 Preferred Stock, as amended (the “Series B-1 COD”) provides the Company’s Board of Directors with the right to redeem any or all of the outstanding shares of the Company’s Series B-1 Preferred for a cash payment of $10.70 per share at any time upon providing the holders of Series B-1 Preferred at least ten days written notice that sets forth the date on which the redemption will occur (the “Redemption Notice”).\nAs of June 30, 2021, a total of 625,375 shares of Series B Preferred and 212,402 shares of Series B-1 Preferred were issued and outstanding.\nShare Repurchase Program\nOn May 9, 2019, our Board of Directors approved of the repurchase of up to $4.0 million shares of our Common Stock, which repurchases may be made in privately negotiated transactions or in the open market at prices per share not exceeding the then-current market prices (the “Share Repurchase Program”). Under the Share Repurchase Program, management has discretion to determine the dollar amount of shares to be repurchased and the timing of any repurchases in compliance with applicable laws and regulations, including Rule 12b-18 of the Exchange Act. On March 17, 2020, given the extreme uncertainty due to COVID-19 at the time, the Board suspended the Share Repurchase Program.\nOn May 18, 2021, our Board of Directors resumed its Share Repurchase Program, and increased the buyback from $4 million to $6 million. The Share Repurchase Program expires 24 months following May 18, 2021, and it may be suspended for periods of time or discontinued at any time, at the Board’s discretion. The total remaining authorization for future shares of Common Stock repurchases under our Share Repurchase Program was $2,050,885 as of June 30, 2021. From time-to-time, our Board may authorize further increases to our Share Repurchase Program.\nThe following table provides information about repurchases of our Common Stock registered pursuant to Section 12 of the Exchange Act, during the years ended June 30, 2021 and 2020:\nPeriod (1)\nTotal Number of Shares Purchased\nAverage Price Paid Per Share\nTotal Number of Shares Purchased as Part of Publicly Announced Plans or Programs\nRemaining Amount Available for Future Share Repurchases Under the Plans or Programs\nYear Ended June 30, 2020\nJuly 1, 2019 - September 30, 2019:\n79,954\n$6.43\n167,554\n$3,000,235\nOctober 1, 2019 - December 31, 2019:\n174,615\n$4.80\n342,169\n$2,162,557\nJanuary 1, 2020 - March 31, 2020:\n157,616\n$5.11\n499,785\n$1,359,123\nApril 1, 2020 - June 30, 2020:\n-\n$-\n-\n$1,359,123\nYear Ended June 30, 2021\nJuly 1, 2020 - September 30, 2020:\n-\n$-\n-\n$1,359,123\nOctober 1, 2020 - December 31, 2020:\n-\n$-\n-\n$1,359,123\nJanuary 1, 2021 - March 31, 2021:\n84,081\n$6.04\n584,586\n$2,850,880\nApril 1, 2021 - June 30, 2021:\n126,927\n$6.30\n457,659\n$2,050,885\n(1)\nWe close our books and records on the last calendar day of each month to align our financial closing with our business processes.\nNOTE 15.\nRECENT ACCOUNTING PRONOUNCEMENTS\nIn August 2018, the FASB issued ASU 2018-15 Intangibles - Goodwill and Other Internal-Use Software (Subtopic 350-40) - Customer’s Accounting for Implementation Costs Incurred in a Cloud Computing Arrangement That is a Service Contract. The amendments in this update apply to an entity who is a customer in a hosting arrangement accounted for as a service contract. The update requires a customer in a hosting arrangement to capitalize certain implementation costs. Costs associated with the application development stage of the implementation should be capitalized and costs with the other stages should be expensed. For instance, costs for training and data conversion should be expensed. The capitalized implementation costs should be expensed over the term of the hosting arrangement, which is the noncancelable period plus periods covered by an option to extend if the customer is reasonably certain to exercise the option. Impairment of the capitalized costs should be considered similar to other intangibles. The effective date of this update is effective for annual reporting periods beginning after December 15, 2019 for public entities and after December 15, 2020 for all other entities with early adoption permitted. The Company is a customer in a hosting arrangement and may enter into new arrangements in the future. The Company adopted the standard during the second quarter of fiscal year 2020. This standard did not have a material impact on the Company’s consolidated financial statements.\nIn August 2018, the FASB issued ASU 2018-13 Fair Value Measurement (Topic 820) Disclosure Framework - Changes to the Disclosure Requirements for Fair Value Measurement. This ASU eliminates, amends, and adds disclosure requirements for fair value measurements. The new standard is effective for fiscal years beginning after December 15, 2019, including interim periods within those fiscal years. The Company adopted the standard during the second quarter of fiscal year 2020. This standard did not have a material impact on the Company’s consolidated financial statements.\nIn June 2018, the FASB issued ASU 2018-07 Compensation - Stock Compensation (Topic 718), Improvements to Nonemployee Share-Based Payment Accounting. The amendments in this update expand the scope of Topic 718 to include share-based payment transactions for acquiring goods and services from nonemployees. Prior to this update, equity-based payments to non-employees was accounted for under Subtopic 505-50 resulting in significant differences between the accounting for share-based payments to non-employees as compared to employees. One of the most significant changes is that non-employee share-based awards (classified as equity awards) may be measured at grant-date fair value and not have to be continually revalued until the service/goods are rendered. The update also indicates that share-based awards related to financing and awards granted to a customer in conjunction with selling goods or services are not included in Topic 718. This standard is effective for interim and annual reporting periods beginning after December 15, 2018 for public entities and December 15, 2019 for all other entities. Early adoption is permitted, but no earlier than an entity’s adoption date of Topic 606. The Company adopted the standard during the first quarter of fiscal year 2020. This standard did not have a material impact on the Company’s consolidated financial statements.\nIn January 2017, the FASB issued ASU 2017-04 Intangibles-Goodwill and Other (Topic 350): Simplifying the Test for Goodwill Impairment, which amends and simplifies the accounting standard for goodwill impairment. The new standard removes Step 2 of the goodwill impairment test, which requires a hypothetical purchase price allocation. A goodwill impairment will now be the amount a reporting unit’s carrying value exceeds its fair value, limited to the total amount of goodwill allocated to that reporting unit. The new standard is effective for annual and any interim impairment tests for periods beginning after December 15, 2019. The Company adopted the standard during the fourth quarter of fiscal year 2020. This standard did not have a material impact on the Company’s consolidated financial statements.\nIn February 2016, the FASB issued ASU 2016-02 Leases (Topic 842). Under the new guidance, lessees will be required to recognize for all leases (with the exception of short-term leases) a lease liability, which is a lessee’s obligation to make lease payments arising from a lease, measured on a discounted basis and a right-of-use asset, which is an asset that represents the lessee’s right to use, or control the use of, a specified asset for the lease term.\nEffective July 1, 2019, the Company adopted the requirements of Accounting Standards Update No. 2016-02, Leases (Topic 842) (\"ASU 2016-02\"). All amounts and disclosures set forth in this Annual Report on Form 10-K have been updated to comply with this new standard with results for reporting periods beginning after July 1, 2019 presented under ASU 2016-02, while prior period amounts and disclosures are not adjusted and continue to be reported under the accounting standards in effect for the prior period.\nNOTE 16.\nRELATED PARTY TRANSACTIONS\nService Agreement. During the year ended June 30, 2021, the Company continued to be a party to a Service Agreement with Fields Management, Inc. (“FMI”), pursuant to which FMI provided certain executive management services to the Company, including designating Mr. Fields to perform the functions of President and Chief Executive Officer for the Company. Mr. Fields, FMI’s designated executive, who also serves as the Company’s Chair of the Board of Directors, controls FMI. The Company had no payables to FMI at June 30, 2021 and 2020 respectively, under the Service Agreement.\nNOTE 17.\nSUBSEQUENT EVENTS\nIn accordance with the Subsequent Events Topic of the FASB ASC 855, we have evaluated subsequent events, through the filing date and noted no further subsequent events that are reasonably likely to impact the Company’s financial statements."
}