{
    "cik": "713425",
    "company": "AMERICAN SOFTWARE INC",
    "filing_type": "10-K",
    "filing_date": "2021-07-09",
    "period_of_report": "2021-04-30",
    "sic": "7372",
    "state_of_inc": "GA",
    "state_location": "GA",
    "fiscal_year_end": "0430",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/713425/0001628280-21-013701-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/713425/000162828021013701/amswa-20210430.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/713425/0001628280-21-013701.txt",
    "filename": "713425_10K_2021_0001628280-21-013701.htm",
    "item_1": "Item 1. BUSINESS\nSpecial Cautionary Notice Regarding Forward-Looking Statements\nWe believe that it is important to communicate our future expectations to our shareholders and to the public. This report contains forward-looking statements, including, in particular, statements about our goals, plans, objectives, beliefs, expectations and prospects under the headings “Item 1. Business” and “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.” You can identify these statements by forward-looking words such as “anticipate,” “intend,” “plan,” “continue,” “could,” “grow,” “may,” “potential,” “predict,” “strive,” “will,” “seek,” “estimate,” “believe,” “expect,” and similar expressions that convey uncertainty about future events or outcomes. Any forward-looking statements herein are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements include statements concerning future:\n•results of operations;\n•liquidity, cash flow and capital expenditures;\n•demand for and pricing of our products and services;\n•viability and effectiveness of strategic alliances;\n•industry and market conditions;\n• acquisition activities and the effect of completed acquisitions; and\n•general economic conditions.\nAlthough we believe that the goals, plans, expectations, and prospects reflected by our forward-looking statements are reasonable based on the information currently available to us, those statements are not guarantees of performance. There are a number of factors that could cause actual results or performance to differ materially from what is anticipated by statements made herein. These factors include, but are not limited to, continuing U.S. and global economic uncertainty and the timing and degree of business recovery; the irregular pattern of our revenue; dependence on particular market segments or customers; competitive pressures; market acceptance of our products and services; technological complexity; undetected software errors; potential product liability or warranty claims; risks associated with new product development; the challenges and risks associated with integration of acquired product lines, companies and services; uncertainty about the viability and effectiveness of strategic alliances; as well as a number of other risk factors that could affect our future performance. Factors that could cause or contribute to such differences include, but are not limited to, those we discuss under the section captioned “Risk Factors” in",
    "item_1A": "ITEM 1A. RISK FACTORS\nThe following summarizes risks and uncertainties that could materially adversely affect our business, financial condition, results of operations and stock price. You should read this summary together with the detailed description of each risk factor contained below.\nRISK FACTORS RELATED TO THE ECONOMY\na.The effects of the COVID-19 pandemic have materially affected how we and our customers are operating our businesses.\nb.Disruptions in the financial and credit markets, international trade disputes, the COVID-19 pandemic and other external influences may reduce demand for our software and related services.\nc.There may be an increase in customer bankruptcies due to weak economic conditions.\nd.We are subject to foreign exchange rate risk.\nRISK FACTORS RELATED TO COMPETITION\na.Our markets are very competitive, and we may not be able to compete effectively.\nb.Many of our current and potential competitors have significantly greater resources than we do, and therefore we may be at a disadvantage in competing with them.\nc.Due to competition, we may change our pricing practices, which could adversely affect operating margins or customer ordering patterns.\nRISK FACTORS RELATED TO OUR OPERATIONS\na.Our growth is dependent upon the successful further development of our direct and indirect sales channels.\nb.Our growth depends upon our ability to develop and sustain relationships with complementary vendors to market and implement our software products.\nc.We are dependent upon the retail industry for a significant portion of our revenue.\nd.We derive a significant portion of our services revenue from a small number of customers.\ne.We may derive a significant portion of our revenue from a limited number of large, non-recurring sales.\nf.Our lengthy sales cycle makes it difficult to predict quarterly revenue levels and operating results.\ng.Services revenue carries lower gross margins than do license or subscription revenue and an overall increase in services revenue as a percentage of total revenue could have an adverse impact on our business.\nh.Failure to maintain our margins and service rates for implementation services could have a material adverse effect on our operating performance and financial condition.\ni.We are subject to risks related to renewal of maintenance contracts.\nj.We are subject risks related to accounting interpretations.\nk.Our past and future acquisitions may not be successful and we may have difficulty integrating acquisitions.\nl.Our business may require additional capital.\nm.Business disruptions could affect our operating results.\nn.Our international operations and sales subject us to risks.\no.It may become increasingly expensive to obtain and maintain liability insurance.\np.Growth in our operations could increase demands on our managerial and operational resources.\nRISK FACTORS RELATED TO OUR PRODUCTS\na.We may not be successful in convincing customers to migrate to current or future releases of our products.\nb.We may be unable to retain or attract customers if we do not develop new products and enhance our current products in response to technological changes and competing products.\nc.If our products are not able to deliver quick, demonstrable value to our customers, our business could be seriously harmed.\nd.If we do not maintain software performance across accepted platforms and operating environments, our license, subscription and services revenue could be adversely affected.\ne.Our software products and product development are complex, which makes it increasingly difficult to innovate, extend our product offerings, and avoid costs related to correction of program errors.\nf.The use of open source software in our products may expose us to additional risks and harm our intellectual property.\ng.If the open source community expands into enterprise application and supply chain software, our revenue may decline.\nh.Implementation of our products can be complex, time-consuming and expensive, customers may be unable to implement our products successfully, and we may become subject to warranty or product liability claims.\ni.An increase in sales of software products that require customization would result in revenue being recognized over the term of the contract for those products.\nj.We sometimes experience delays in product releases, which can adversely affect our business.\nk.We may not receive significant revenue from our current research and development efforts for several years.\nl.We have limited protection of our intellectual property and proprietary rights and may potentially infringe third-party intellectual property rights.\nm.We may experience liability claims arising out of the sale of our software and provision of services.\nn.Privacy and security concerns, including evolving government regulation in the area of data privacy, could adversely affect our business and operating results.\no.We face risks associated with the security of our products.\np.We depend on third-party technology which could result in increased costs or delays in the production and improvement of our products if it should become unavailable or if it contains defects.\nq.Any interruptions or delays in services from third parties or our inability to adequately plan for and manage service interruptions or infrastructure capacity requirements, could impair the delivery of our services and harm our business.\nRISK FACTORS RELATED TO OUR PERSONNEL\na.We are dependent upon key personnel, and need to attract and retain highly qualified personnel.\nb.We periodically have restructured our sales force, which can be disruptive.\nc.Our technical personnel have unique access to customer data, and may abuse that privilege.\nRISK FACTORS RELATED TO OUR CORPORATE STRUCTURE AND GOVERNANCE\na.Our business is subject to changing regulation of corporate governance and public disclosure.\nb.One shareholder beneficially owns a substantial portion of our stock, and as a result, exerts substantial control over us.\nc.Our articles of incorporation and bylaws and Georgia law may inhibit a takeover of our company.\nd.We are a “controlled company” within the meaning of NASDAQ rules and, as a result, qualify for, and rely on, exemptions from certain corporate governance requirements.\nRISK FACTORS RELATED TO OUR STOCK PRICE\na.We could experience fluctuations in quarterly operating results that could adversely affect our stock price.\nb.Our stock price is volatile and there is a risk of litigation.\nc.Our dividend policy is subject to change.\nd.The price of our common stock may decline due to shares eligible for future sale or actual future sales of substantial amounts of our common stock.\nA variety of factors may affect our future results and the market price of our stock.\nWe have included certain forward-looking statements in Management’s Discussion and Analysis of Financial Condition and Results of Operations and elsewhere in this Form 10-K. We may also make oral and written forward-looking statements from time to time, in reports filed with the SEC and otherwise. We undertake no obligation to revise or publicly release the results of any revisions to these forward-looking statements based on circumstances or events which occur in the future, unless otherwise required by law. Actual results may differ materially from those projected in any such forward-looking statements due to a number of factors, including those set forth below and elsewhere in this Form 10-K.\nWe operate in a dynamic and rapidly changing environment that involves numerous risks and uncertainties. New risk factors emerge from time to time, and it is not possible for management to predict all such risk factors, nor can it assess the potential impact of all such risk factors on our business or the extent to which any factor, or combination of factors, may cause actual results to differ materially from those in any forward-looking statements. The following section lists some, but not all, of the risks and uncertainties that we believe may have a material adverse effect on our business, financial condition, cash flow or results of operations. In that case, the trading price of our securities could decline and you may lose all or part of your investment in our Company. This section should be read in conjunction with the audited Consolidated Financial Statements and Notes thereto, and Management’s Discussion and Analysis of Financial Condition and Results of Operations included in this Form 10-K.\nWe cannot predict every event and circumstance that may affect our business, and therefore the risks and uncertainties discussed below may not be the only ones you should consider.\nThe risks and uncertainties discussed below are in addition to those that apply to most businesses generally. Furthermore, as we continue to operate our business, we may encounter risks of which we are not aware at this time. These additional risks may cause serious damage to our business in the future, the impact of which we cannot estimate at this time.\nRISK FACTORS RELATED TO THE ECONOMY\nThe effects of the COVID-19 pandemic have materially affected how we and our customers are operating our businesses, and the duration and extent to which this will impact our future results of operations and overall financial performance remain uncertain.\nIn December 2019, a novel coronavirus, COVID-19, was first reported. On March 11, 2020, the World Health Organization (WHO) characterized COVID-19 as a pandemic. The COVID-19 pandemic, which has spread throughout the world, and the related adverse public health developments, including orders to shelter-in-place, travel restrictions, and mandated business closures, have adversely affected workforces, organizations, customers, economies, and financial markets globally, leading to increased market volatility. It also has disrupted the normal operations of many businesses, including ours.\nAs a result of the COVID-19 pandemic, we temporarily suspended all Company-related travel unless absolutely necessary, and substantially all Company employees globally have been encouraged to work from home. We have either canceled or changed employee, customer and industry events to dial-in experiences. We may deem it advisable to similarly alter, postpone or cancel entirely additional customer, employee or industry events in the future. All of these changes may disrupt the way we operate our business.\nMoreover, the conditions caused by the COVID-19 pandemic may affect the rate of spending on our products and services, and could adversely affect our customers’ ability or willingness to purchase our offerings or the timing of our current\nor prospective customers’ purchasing decisions; require pricing discounts or extended payment terms; or increase customer attrition rates, all of which could adversely affect our future sales, operating results and overall financial performance.\nThe duration and extent of the impact of the COVID-19 pandemic depends on future developments that cannot be accurately predicted at this time, such as the severity and transmission rate of the virus, the extent and effectiveness of containment actions, the disruption caused by such actions, the efficacy of vaccines and rates of vaccination in various states and countries, and the impact of these and other factors on our employees, customers, partners, vendors and the global economy. If we are not able to effectively respond to and manage the impact of such events, our business will be harmed.\nTo the extent that the COVID-19 pandemic adversely affects our business and financial results, it may also amplify many of the other risks described in this “Risk Factors” section.\nDisruptions in the financial and credit markets, international trade disputes, the COVID-19 pandemic and other external influences in the U.S. and global markets may reduce demand for our software and related services, which may negatively affect our revenue and operating results.\nOur revenue and profitability depend on the overall demand for our software, professional services and maintenance services. Regional and global changes in the economy and financial markets, such as the severe global economic downturn in 2008, which was followed by a slow and relatively weak recovery, have resulted in companies generally reducing their spending for technology projects and therefore delaying or reconsidering potential purchases of our products and related services. Adverse conditions in credit markets, lagging consumer confidence and spending, the fluctuating cost of fuel and commodities and their effects on the U.S. and global economies and markets are examples of negative factors that have delayed or canceled certain potential customer purchases. Furthermore, the uncertainty posed by the long-term effects of conflicts in the Middle East, terrorist activities, the COVID-19 pandemic, and other geopolitical and trade issues also may adversely affect the purchasing decisions of current or potential customers. Weakness in European economies may adversely affect demand for our products and services, both directly and by affecting U.S. customers that rely heavily on European sales. There can be no assurance that government responses to these factors will sufficiently restore confidence, stabilize markets or increase liquidity and the availability of credit.\nWe are a technology company selling technology-based solutions with total pricing, including software and services, in many cases exceeding $500,000. Reductions in the capital budgets of our customers and prospective customers could have an adverse impact on our ability to sell our solutions. These economic, trade, public health and political conditions may reduce the willingness or ability of our customers and prospective customers to commit funds to purchase our products and services or renew existing post-contract support agreements, or their ability to pay for our products and services after purchase. Future declines in demand for our products or services, or a broadening or protracted extension of these conditions, would have a significant negative impact on our revenue and operating results.\nThere may be an increase in customer bankruptcies due to weak economic conditions.\nWe have been in the past, and may be in the future, affected by customer bankruptcies that occur in periods subsequent to the software sale. During weak economic conditions, there is an increased risk that some of our customers will file a petition for bankruptcy. When our customers file a petition for bankruptcy, we may be required to forego collection of pre-petition amounts owed and to repay amounts remitted to us during the 90-day preference period preceding the filing. Accounts receivable balances related to pre-petition amounts may in some of these instances be large, due to extended payment terms for software fees and significant billings for consulting and implementation services on large projects. The bankruptcy laws, as well as the specific circumstances of each bankruptcy, may severely limit our ability to collect pre-petition amounts, and may force us to disgorge payments made during the 90-day preference period. We also face risk from international customers that file for bankruptcy protection in foreign jurisdictions, as the application of foreign bankruptcy laws may be more difficult to predict. Although we believe that we have sufficient reserves to cover anticipated customer bankruptcies, there can be no assurance that such reserves will be adequate, and if they are not adequate, our business, operating results and financial condition would be adversely affected. We anticipate that the ongoing COVID-19 pandemic will increase the likelihood of these risks.\nChanges in the value of the U.S. dollar, as compared to the currencies of foreign countries where we transact business, could harm our operating results.\nOur international revenue and the majority of our international expenses, including the wages of some of our employees, are denominated primarily in currencies other than the U.S. dollar. Therefore, changes in the value of the U.S. dollar as compared to these other currencies may adversely affect our operating results. We do not hedge our exposure to currency fluctuations affecting future international revenue and expenses and other commitments. For the foregoing reasons, currency exchange rate fluctuations have caused, and likely will continue to cause, variability in our foreign currency denominated revenue streams and our cost to settle foreign currency denominated liabilities.\nRISK FACTORS RELATED TO COMPETITION\nOur markets are very competitive, and we may not be able to compete effectively.\nThe markets for our solutions are very competitive. The intensity of competition in our markets has significantly increased, in part as a result of the slow growth in investment in IT software. We expect this intense competition to increase in the future. Our current and potential competitors have made and may continue to make acquisitions of other competitors and may establish cooperative relationships among themselves or with third parties. Any significant consolidation among supply chain software providers could adversely affect our competitive position. Increased competition has resulted and, in the future, could result in price reductions, lower gross margins, longer sales cycles and loss of market share. Each of these developments could have a material adverse effect on our operating performance and financial condition.\nMany of our current and potential competitors have significantly greater resources than we do, and therefore we may be at a disadvantage in competing with them.\nWe directly compete with other supply chain software vendors, including SAP SE, Oracle Corporation, Blue Yonder, o9 Solutions, Kinaxis, Inc. and others. Some of our current and potential competitors have significantly greater financial, marketing, technical and other competitive resources than we do, as well as greater name recognition and a larger installed base of customers. The software market has experienced significant consolidation, including numerous mergers and acquisitions. It is difficult to estimate what long-term effect these acquisitions will have on our competitive environment. We have encountered competitive situations where we suspect that large competitors, in order to encourage customers to purchase non-retail applications and gain retail market share, also have offered at no charge certain retail software applications that compete with our solutions. If competitors such as Oracle and SAP SE and other large private companies are willing to offer their retail and/or other applications at no charge, this may result in a more difficult competitive environment for our products. In addition, we could face competition from large, multi-industry technology companies that historically have not offered an enterprise solution set to the retail supply chain market. We cannot guarantee that we will be able to compete successfully for customers against our current or future competitors, or that such competition will not have a material adverse effect on our business, operating results and financial condition.\nAlso, some prospective buyers are reluctant to purchase applications that could have a short lifespan, as an acquisition could result in the application’s life being abruptly cut short. In addition, increased competition and consolidation in these markets is likely to result in price reductions, reduced operating margins and changes in market share, any one of which could adversely affect us. If customers or prospects want fewer software vendors, they may elect to purchase competing products from a larger vendor than us since those larger vendors offer a wider range of products. Furthermore, some of these larger vendors may be able to bundle their software with their database applications, which underlie a significant portion of our installed applications. When we compete with these larger vendors for new customers, we believe that these larger businesses often attempt to use their size as a competitive advantage against us.\nMany of our competitors have well-established relationships with our current and potential customers and have extensive knowledge of our industry. As a result, they may be able to adapt more quickly to new or emerging technologies and changes in customer requirements or devote greater resources to the development, promotion and sale of their products than we can. Some competitors have become more aggressive with their prices and payment terms and issuance of contractual implementation terms or guarantees. In addition, third parties may offer competing maintenance and implementation services to our customers and thereby reduce our opportunities to provide those services. We may be unable to continue to compete successfully with new and existing competitors without lowering prices or offering other favorable terms. Furthermore, potential customers may consider outsourcing options, including application service providers, data center outsourcing and service bureaus, as alternatives to our software products. Any of these factors could materially impair our ability to compete and have a material adverse effect on our operating performance and financial condition.\nWe also face competition from the corporate IT departments of current or potential customers capable of internally developing solutions and we compete with a variety of more specialized software and services vendors, including:\n•Internet (on demand) software vendors;\n•single-industry software vendors;\n•enterprise resource optimization software vendors;\n•human resource management software vendors;\n•financial management software vendors;\n•merchandising software vendors;\n•services automation software vendors; and\n•outsourced services providers.\nAs a result, the market for enterprise software applications has been and continues to be intensely competitive. We expect competition to persist and continue to intensify, which could negatively affect our operating results and market share.\nDue to competition, we may change our pricing practices, which could adversely affect operating margins or customer ordering patterns.\nThe intensely competitive markets in which we compete can put pressure on us to reduce our prices. If our competitors offer deep discounts on certain products or services in an effort to recapture or gain market share or to sell other products or services, we may need to lower prices or offer other favorable terms in order to compete successfully. For these and other reasons, in the future we may choose to make changes to our pricing practices. For example, we may offer additional discounts to customers; increase (or decrease) the use of pricing that involves periodic fees based on the number of users of a product; or change maintenance pricing. Such changes could materially and adversely affect our margins, and our revenue may be negatively affected if our competitors are able to recapture or gain market share.\nRISK FACTORS RELATED TO OUR OPERATIONS\nOur growth is dependent upon the successful further development of our direct and indirect sales channels.\nWe believe that our future growth will depend on developing and maintaining successful strategic relationships with systems integrators and other technology companies. We intend to continue to increase the proportion of customers served through these indirect channels, so we are currently investing, and plan to continue to invest, significant resources to develop them. This investment could adversely affect our operating results if these efforts do not generate sufficient license, subscription and service revenue to offset our investment. Also, our inability to partner with other technology companies and qualified systems integrators could adversely affect our results of operations. Because lower unit prices are typically charged on sales made through indirect channels, increased indirect sales could reduce our average selling prices and result in lower gross margins. In addition, sales of our products through indirect channels will likely reduce our consulting service revenue, as third-party systems integrators generally provide these services. As indirect sales increase, our direct contact with our customer base will decrease, and we may have more difficulty accurately forecasting sales, evaluating customer satisfaction and recognizing emerging customer requirements. In addition, these systems integrators and third-party software providers may develop, acquire or market products competitive with our products. Marketing our products directly to customers and indirectly through systems integrators and other technology companies may result in distribution channel conflicts. Our direct sales efforts may compete with those of our indirect channels and, to the extent that different systems integrators target the same customers, systems integrators also may come into conflict with each other. Any channel conflicts that develop may have a material adverse effect on our relationships with systems integrators or harm our ability to attract new systems integrators.\nOur growth depends upon our ability to develop and sustain relationships with complementary vendors to market and implement our software products, and a failure to develop and sustain these relationships could have a material adverse effect on our operating performance and financial condition.\nWe are developing, maintaining and enhancing significant working relationships with complementary vendors, such as software companies, consulting firms, resellers and others that we believe can play important roles in marketing our products and solutions. We are currently investing, and intend to continue to invest, significant resources to develop and enhance these relationships, which could adversely affect our operating margins. We may be unable to develop relationships with organizations that will be able to market our products effectively. Our arrangements with these organizations are not exclusive, and in many cases may be terminated by either party without cause. Many of the organizations with which we are developing or maintaining marketing relationships have commercial relationships with our competitors. There can be no assurance that any organization will continue its involvement with us. The loss of relationships with such organizations could materially and adversely affect our operating performance and financial condition.\nWe are dependent upon the retail industry for a significant portion of our revenue.\nHistorically, we have derived a significant percentage of our revenue from the sale of software products and collaborative applications that address vertical market opportunities with manufacturers and wholesalers that supply retail customers. The success of our customers is directly linked to economic conditions in the retail industry, which in turn are subject to intense competitive pressures and are affected by overall economic conditions. In addition, we believe that the acquisition of certain of our software products involves a large capital expenditure, which is often accompanied by large-scale hardware purchases or other capital commitments. As a result, demand for our products and services could decline in the event of instability or potential downturns in our customers’ industries.\nDue to the COVID-19 pandemic, among other factors, we expect the retail industry to remain relatively cautious in its level of investment in IT when compared to other industries. We are concerned about weak and uncertain economic conditions,\nconsolidations and the disappointing results of retailers in certain markets, especially if such weak economic conditions persist for an extended period of time. Weak and uncertain economic conditions have negatively affected our revenue in the past and may do so in the future, particularly due to the impact of the COVID-19 pandemic, including potential deterioration of our maintenance revenue base as customers look to reduce their costs, elongation of our selling cycles, and reduction in the demand for our products. As a result, in the current economic environment it is difficult to predict exactly when specific sales will close. In addition, weak and uncertain economic conditions could impair our customers’ ability to pay for our products or services. We also believe the retail business transformation from retail brick-and-mortar to technology-enabled omni-channel commerce models will be a multi-year trend. Consequently, we cannot predict when the disruption from the COVID-19 pandemic or the transformation to new commerce models may moderate or end. Any of these factors could adversely affect our business, our quarterly or annual operating results and our financial condition.\nWe have observed that as the retail industry consolidates, it is experiencing increased competition in certain geographic regions that could negatively affect the industry and our customers’ ability to pay for our products and services. Such consolidation has negatively impacted our revenue in the past and may continue to do so in the future, which may reduce the demand for our products, and may adversely affect our business, operating results and financial condition.\nWe derive a significant portion of our services revenue from a small number of customers. If these customers were to discontinue the use of our services or delay their implementation, our total revenue would be adversely affected.\nWe derive a significant portion of our services revenue from a small number of customers. If these customers were to discontinue or delay their use of these services, or obtain these services from a competitor, our services revenue and total revenue would be adversely affected. Customers may delay or terminate implementation of our services due to budgetary constraints related to economic uncertainty, dissatisfaction with product quality, the difficulty of prioritizing numerous IT projects, changes in business strategy, personnel or priorities, or other reasons. Customers may be less likely to invest in additional software in the future or continue to pay for software maintenance. Our business relies to a large extent upon sales to existing customers and maintenance and services revenue are key elements of our revenue base, so any reduction in these sales or these maintenance and services payments could have a material adverse effect on our business, results of operations, cash flows and financial condition.\nWe may derive a significant portion of our revenue in any quarter from a limited number of large, non-recurring sales.\nFrom time to time, we expect to continue to experience large, individual customer sales, which may cause significant variations in quarterly fees. We also believe that purchasing our products is relatively discretionary and generally involves a significant commitment of a customer’s capital resources. Therefore, a downturn in any customer’s business, including due to the COVID-19 pandemic, could result in order cancellations or requests for flexible payment terms that could have a significant adverse impact on our revenue and quarterly results. Moreover, continued uncertainty about general economic conditions could precipitate significant reductions in corporate spending for IT, which could result in delays or cancellations of orders for our products.\nOur lengthy sales cycle makes it difficult to predict quarterly revenue levels and operating results.\nBecause fees for our software products are substantial and the decision to purchase our products typically involves members of our customers’ senior management, the sales process for our solutions is lengthy. Furthermore, our existing and prospective customers routinely require education regarding the use and benefits of our products, which may lead to delays in receiving customers’ orders. Accordingly, the timing of our revenue is difficult to predict, and the delay of an order could cause our quarterly revenue to fall substantially below our expectations and those of public market analysts and investors. Moreover, to the extent that we succeed in shifting customer purchases away from individual software products and toward more costly integrated suites of software and services, our sales cycle may lengthen further, which could increase the likelihood of delays and cause the effect of a delay to become more pronounced. Delays in sales could cause significant shortfalls in our revenue and operating results for any particular period. Also, it is difficult for us to forecast the timing and recognition of revenue from sales of our products because our existing and prospective customers often take significant time evaluating our products before purchasing them. The period between initial customer contact and a purchase by a customer could be nine months or longer. During the evaluation period, prospective customers may decide not to purchase or may scale down proposed orders of our products for various reasons, including:\n•reduced demand for enterprise software solutions;\n•introduction of products by our competitors;\n•lower prices offered by our competitors;\n•changes in budgets and purchasing priorities;\n•increased time to obtain purchasing approval; and\n•reduced need to upgrade existing systems.\nServices revenue carries lower gross margins than do license or subscription revenue and an overall increase in services revenue as a percentage of total revenue could have an adverse impact on our business.\nBecause our service revenue has lower gross margins than do our license or subscription revenue, an increase in the percentage of total revenue represented by service revenue or a change in the mix between services that are provided by our employees versus services provided by third-party consultants could have a detrimental impact on our overall gross margins and could adversely affect operating results.\nFailure to maintain our margins and service rates for implementation services could have a material adverse effect on our operating performance and financial condition.\nA significant portion of our revenue is derived from implementation services. If we fail to scope our implementation projects correctly, our services margins may suffer. We bill for implementation services predominantly on an hourly or daily basis (time and materials) and sometimes under fixed price contracts, and we generally recognize revenue from those services as we perform the work. If we are not able to maintain the current service rates for our time and materials implementation services and cannot make corresponding cost reductions, or if the percentage of fixed price contracts increases and we underestimate the costs of our fixed price contracts, our operating performance may suffer. The rates we charge for our implementation services depend on a number of factors, including:\n•perceptions of our ability to add value through our implementation services;\n•complexity of services performed;\n•competition;\n•pricing policies of our competitors and of systems integrators;\n•use of globally sourced, lower-cost service delivery capabilities within our industry; and\n•economic, political and market conditions.\nIf our customers elect not to renew maintenance contracts after the initial maintenance period and the loss of those customers is not offset by new maintenance customers, our maintenance revenue and total revenue would be adversely affected.\nUpon the purchase of a software license, our customers typically enter into a maintenance contract with a typical term of one to three years. If customers elect not to renew their maintenance contracts after this initial maintenance period and we do not offset the loss of those customers with new maintenance customers as a result of new license fees, our maintenance revenue and total revenue would be adversely affected.\nIf accounting interpretations relating to revenue recognition change or companies we acquire have applied such standards differently than we do or have not applied them at all, our reported revenue could decline or we could be forced to make changes in our business practices or we may incur the expense and risks associated with an audit or restatement of the acquired company’s financial statements.\nThere are several accounting standards and interpretations covering revenue recognition for the software industry. These standards address software revenue recognition matters primarily from a conceptual level and do not include specific implementation guidance. We believe that we currently comply with these standards.\nThe accounting profession and regulatory agencies continue to discuss various provisions of these pronouncements with the objective of providing additional guidance on their application and potential interpretations. These discussions and the issuance of new interpretations could lead to unanticipated changes in our current revenue accounting practices, which could change the timing of recognized revenue. They also could drive significant adjustments to our business practices, which could result in increased administrative costs, lengthened sales cycles and other changes that could adversely affect our reported revenue and results of operations. In addition, companies we acquire historically may have interpreted software revenue recognition rules differently than we do or may not have been subject to U.S. GAAP as a result of reporting in a foreign country. If we discover that companies we have acquired have interpreted and applied software revenue recognition rules differently than prescribed by U.S. GAAP, we could be required to devote significant management resources, and incur the expense associated with an audit, restatement or other examination of the acquired companies’ financial statements.\nOur past and future acquisitions may not be successful and we may have difficulty integrating acquisitions.\nWe continually evaluate potential acquisitions of complementary businesses, products and technologies. We have in the past acquired and invested, and may continue to acquire or invest in, complementary companies, products and technologies, and enter into joint ventures and strategic alliances with other companies. Acquisitions, joint ventures, strategic alliances, and investments present many risks, and we may not realize the financial and strategic goals that were contemplated at the time of any transaction. Risks commonly encountered in such transactions include:\n•risk that an acquired company or assets may not further our business strategy or that we paid more than the company or assets were worth;\n•difficulty of assimilating the operations and retaining and motivating personnel of an acquired company;\n•risk that we may not be able to integrate acquired technologies or products with our current products and technologies;\n•potential disruption of our ongoing business and the diversion of our management’s attention from other business concerns;\n•inability of management to maximize our financial and strategic position through the successful integration of an acquired company;\n•adverse impact on our annual effective tax rate;\n•dilution of existing equity holders caused by capital stock issuance to the shareholders of an acquired company or stock option grants to retain employees of an acquired company;\n•difficulty in maintaining controls, procedures and policies;\n•potential adverse impact on our relationships with partner companies or third-party providers of technology or products;\n•impairment of relationships with employees and customers;\n•potential assumption of liabilities of the acquired company;\n•significant exit or impairment charges if products acquired in business combinations are unsuccessful; and\n•issues with product quality, product architecture, legal contingencies, product development issues, or other significant issues that may not be detected through our due diligence process.\nAccounting rules require the use of the purchase method of accounting in all new business acquisitions. Many acquisition candidates have significant intangible assets, so an acquisition of these businesses would likely result in significant amounts of goodwill and other intangible assets. The purchase method of accounting for business combinations may require large write-offs of any in-process research and development costs related to companies being acquired, as well as ongoing amortization costs for other intangible assets. Goodwill and certain other intangible assets are not amortized to income, but are subject to impairment reviews at least annually. If the acquisitions do not perform as planned, future write-offs and charges to income arising from such impairment reviews could be significant. In addition, these acquisitions could involve acquisition-related charges, such as one-time acquired research and development charges. Such write-offs and ongoing amortization charges may have a significant negative impact on operating margins and net earnings in the quarter of the combination and for several subsequent years. We may not be successful in overcoming these risks or any other problems encountered in connection with such transactions.\nFully integrating an acquired company or business into our operations may take a significant amount of time. In addition, we may be able to conduct only limited due diligence on an acquired company’s operations. Following an acquisition, we may be subject to liabilities arising from an acquired company’s past or present operations, including liabilities related to data security, encryption and privacy of customer data, and these liabilities may not be covered by the warranty and indemnity provisions that we negotiate. We cannot assure you that we will be successful in overcoming these risks or any other problems encountered with acquisitions. To the extent we do not successfully avoid or overcome the risks or problems related to any acquisitions, our results of operations and financial condition could be adversely affected. Future acquisitions also could impact our financial position and capital needs, and could cause substantial fluctuations in our quarterly and yearly results of operations.\nOur business may require additional capital.\nWe may require additional capital to finance our growth or to fund acquisitions or investments in complementary businesses, technologies or product lines. Our capital requirements may be influenced by many factors, including:\n•demand for our products;\n•timing and extent of our investment in new technology;\n•timing and extent of our acquisition of other companies;\n•level and timing of revenue;\n•expenses of sales, marketing and new product development;\n•cost of facilities to accommodate a growing workforce;\n•extent to which competitors are successful in developing new products and increasing their market shares; and\n•costs involved in maintaining and enforcing intellectual property rights.\nTo the extent that our resources are insufficient to fund our future activities, we may need to raise additional funds through public or private financing. However, additional funding, if needed, may not be available on terms attractive to us, or at all. Our inability to raise capital when needed could have a material adverse effect on our business, operating results and financial condition. If additional funds are raised through the issuance of equity securities, the percentage ownership of our company by our current shareholders would be diluted.\nBusiness disruptions could affect our operating results.\nA significant portion of our research and development activities and certain other critical business operations is concentrated in a few geographic areas. We are a highly automated business and a disruption or failure of our systems could cause delays in completing sales and providing services. A natural disaster, public health crisis such as the COVID-19 pandemic, or other catastrophic event such as fire, power loss, telecommunications failure, cyber-attack, war, or terrorist attack that results in the destruction or disruption of any of our critical business or IT systems could severely affect our ability to conduct normal business operations and, as a result, our future operating results could be materially and adversely affected.\nTo effectively mitigate this risk, we must continue to improve our operational, financial and management controls and our reporting systems and procedures by, among other things, improving our key processes and IT infrastructure to support our business needs, and enhancing information and communication systems to ensure that our employees and offices around the world are well-connected and can effectively communicate with each other and our customers and employees can work remotely as appropriate.\nAlthough we maintain crisis management and disaster response plans, in the event of a natural disaster, public health crisis or other catastrophic event, or if we fail to implement the improvements described above, we may be unable to continue our operations and may experience system interruptions, reputational harm, delays in our product development, lengthy interruptions in service, breaches of data security, and loss of critical data, all of which could have an adverse effect on our future operating results.\nOur international operations and sales subject us to risks associated with unexpected activities outside of the United States.\nThe global reach of our business could cause us to be subject to unexpected, uncontrollable and rapidly changing events and circumstances outside the United States. As we grow our international operations, we may need to recruit and hire new consulting, product development, sales, marketing and support personnel in the countries in which we have or will establish offices or otherwise have a significant presence. Entry into new international markets typically requires the establishment of new marketing and distribution channels, and may involve the development and subsequent support of localized versions of our software. International introductions of our products often require a significant investment in advance of anticipated future revenue. In addition, the opening of a new office typically results in initial recruiting and training expenses and reduced labor efficiencies. If we are less successful than we expect in a new market, we may not be able to realize an adequate return on our initial investment and our operating results could suffer. We cannot guarantee that the countries in which we operate will have a sufficient pool of qualified personnel from which to hire, that we will be successful at hiring, training or retaining such personnel or that we can expand or contract our international operations in a timely, cost-effective manner. If we have to downsize certain international operations, the costs to do so are typically much higher than downsizing costs in the United States. The following factors, among others, could have an adverse impact on our business and earnings:\n•failure to properly comply with foreign laws and regulations applicable to our foreign activities including, without limitation, software localization requirements;\n•failure to properly comply with U.S. laws and regulations relating to the export of our products and services;\n•compliance with multiple and potentially conflicting regulations in Europe, Asia and North America, including export requirements, tariffs, import duties and other trade barriers, as well as health and safety requirements;\n•difficulties in managing foreign operations and appropriate levels of staffing;\n•longer collection cycles;\n•tariffs and other trade barriers, including the economic burden and uncertainty placed on our customers by the imposition and threatened imposition of tariffs by the U.S., China and other countries;\n•seasonal reductions in business activities, particularly throughout Europe;\n•reduced protection for intellectual property rights in some countries;\n•proper compliance with local tax laws which can be complex and may result in unintended adverse tax consequences;\n•anti-American sentiment due to conflicts in the Middle East and U.S. policies that may be unpopular in certain countries;\n•localized spread of infection resulting from the COVID-19 pandemic, including any economic downturns and other adverse impacts.\n•political instability, adverse economic conditions and the potential for war or other hostilities in many of these countries;\n•difficulties in enforcing agreements through foreign legal systems;\n•fluctuations in exchange rates that may affect product demand and may adversely affect the profitability in U.S. dollars of products and services provided by us in foreign markets where payment for our products and services is made in the local currency, including any fluctuations caused by uncertainties relating to the United Kingdom’s exit from the European Union (“Brexit”);\n•impact of Brexit on the United Kingdom’s access to the European Union Single Market, the related regulatory environment, the global economy and the resulting impact on our business, including delays in execution of contracts by our customers;\n•changes in general economic, health and political conditions in countries where we operate;\n•potential labor strikes, lockouts, work slowdowns and work stoppages; and\n•restrictions on downsizing operations in Europe and expenses and delays associated with any such activities.\nIt may become increasingly expensive to obtain and maintain liability insurance.\nOur products are often critical to the operations of our customers’ businesses and provide benefits that may be difficult to quantify. If our products fail to function as required, we may be subject to claims for substantial damages. Courts may not enforce provisions in our contracts that would limit our liability or otherwise protect us from liability for damages. Although we maintain general liability insurance coverage, including coverage for errors or omissions and cybersecurity risks, this coverage may not continue to be available on reasonable terms or in sufficient amounts to cover claims against us. In addition, our insurers may disclaim coverage for future claims. If claims exceeding the available insurance coverage are successfully asserted against us, or our insurers impose premium increases, large deductibles or co-insurance requirements, our business and results of operations could be adversely affected.\nWe contract for insurance to cover a variety of potential risks and liabilities, including those relating to the unexpected failure of our products. In the current market, insurance coverage for all types of risk is becoming more restrictive, and when insurance coverage is offered, the amount for which we are responsible is larger. In light of these circumstances, it may become more difficult to maintain insurance coverage at historical levels or, if such coverage is available, the cost to obtain or maintain it may increase substantially. Consequently, we may be forced to bear the burden of an increased portion of risks for which we have traditionally been covered by insurance, which could negatively impact our results of operations.\nGrowth in our operations could increase demands on our managerial and operational resources.\nIf the scope of our operating and financial systems and the geographic distribution of our operations and customers significantly expand, this may increase demands on our management and operations. Our officers and other key employees will need to implement and improve our operational, customer support and financial control systems and effectively expand, train and manage our employee base. We also may be required to manage an increasing number of relationships with various customers and other third parties. We may not be able to manage future expansion successfully, and our inability to do so could harm our business, operating results and financial condition.\nRISK FACTORS RELATED TO OUR PRODUCTS\nWe may not be successful in convincing customers to migrate to current or future releases of our products, which may lead to reduced services and maintenance revenue and less future business from existing customers.\nOur customers may not be willing to incur the costs or invest the resources necessary to complete upgrades to current or future releases of our products. This may lead to a loss of services and maintenance revenue and future business from customers that continue to operate prior versions of our products or choose to no longer use our products.\nWe may be unable to retain or attract customers if we do not develop new products and enhance our current products in response to technological changes and competing products.\nOver time, we have been required to migrate our products and services from mainframe to customer server to web-based environments. In addition, we have been required to adapt our products to emerging standards for operating systems, databases and other technologies. We will be unable to compete effectively if we fail to:\n•maintain and enhance our technological capabilities to correspond to these emerging environments and standards;\n•develop and market products and services that meet changing customer needs; or\n•anticipate or respond to technological changes on a cost-effective and timely basis.\nA substantial portion of our research and development resources is devoted to product upgrades that address regulatory and support requirements, leaving fewer resources available for new products. New products require significant development investment. That investment is further constrained because of the added costs of developing new products that work with multiple operating systems or databases. We face uncertainty when we develop or acquire new products because there is no assurance that a sufficient market will develop for those products. If we do not attract sufficient customer interest in those products, we will not realize a return on our investment and our operating results will be adversely affected.\nOur core products face competition from new or modified technologies that may render our existing technology less competitive or obsolete, reducing the demand for our products. As a result, we must continually redesign our products to incorporate these new technologies and adapt our software products to operate on, and comply with evolving industry standards for, various hardware and software platforms. Maintaining and upgrading our products to operate on multiple hardware and database platforms reduces our resources for developing new products. Because of the increased costs of developing and supporting software products across multiple platforms, we may need to reduce the number of those platforms. In addition, conflicting new technologies present us with difficult choices about which new technologies to adopt. If we fail to anticipate the most popular platforms, fail to respond adequately to technological developments, or experience significant delays in product development or introduction, our business and operating results will be negatively impacted.\nIn addition, to the extent we determine that new technologies and equipment are required to remain competitive, the development, acquisition and implementation of such technologies may require us to make significant capital investments. We may not have sufficient capital for these purposes and investments in new technologies may not result in commercially viable products. The loss of revenue and increased costs from such changing technologies would adversely affect our business and operating results.\nIf our products are not able to deliver quick, demonstrable value to our customers, our business could be seriously harmed.\nEnterprises are requiring their application software vendors to provide faster returns on their technology investments. We must continue to improve our speed of implementation and the pace at which our products deliver value or our competitors may gain important strategic advantages over us. If we cannot successfully respond to these market demands, or if our competitors respond more successfully than we do, our business, results of operations and financial condition could be materially and adversely affected.\nIf we do not maintain software performance across accepted platforms and operating environments, our license, subscription and services revenue could be adversely affected.\nWe continuously evaluate new technologies and implement advanced technology into our products. However, if in our product development efforts we fail to accurately address, in a timely manner, evolving industry standards, new technology advancements or important third-party interfaces or product architectures, sales of our products and services will suffer. Market acceptance of new platforms and operating environments may require us to undergo the expense of developing and maintaining compatible product lines. We can license our software products for use with a variety of popular industry standard relational database management system platforms using different programming languages and underlying databases and architectures. There may be future or existing relational database platforms that achieve popularity in the marketplace that may or may not be architecturally compatible with our software product design. In addition, the effort and expense of developing, testing, and maintaining software product lines will increase as more hardware platforms and operating systems achieve market acceptance within our target markets. Moreover, future or existing user interfaces may or may not be architecturally compatible with our software product design. If we do not achieve market acceptance of new user interfaces that we support, or adapt to popular new user interfaces that we do not support, our sales and revenue may be adversely affected. Developing and maintaining consistent software product performance characteristics across all of these combinations could place a significant strain on our resources and software product release schedules, which could adversely affect revenue and results of operations.\nOur software products and product development are complex, which makes it increasingly difficult to innovate, extend our product offerings, and avoid costs related to correction of program errors.\nThe market for our software products is characterized by rapid technological change, evolving industry standards, changes in customer requirements and frequent new product introductions and enhancements. For example, existing products can become obsolete and unmarketable when vendors introduce products utilizing new technologies or new industry standards emerge. As a result, it is difficult for us to estimate the life cycles of our software products. There can be no assurance that we will successfully identify new product opportunities or develop and bring new products to the market in a timely and cost-effective manner, or that products, capabilities or technologies developed by our competitors will not render our products obsolete. Our future success will depend in part upon our ability to:\n•continue to enhance and expand our core applications;\n•continue to sell our products;\n•continue to successfully integrate third-party products;\n•enter new markets and achieve market acceptance; and\n•develop and introduce new products that keep pace with technological developments, satisfy increasingly sophisticated customer requirements and achieve market acceptance.\nDespite our testing, our software programs, like software programs generally, may contain a number of undetected errors or “bugs” when we first introduce them or as new versions are released. We do not discover some errors until we have installed the product and our customers have used it. Errors may result in the delay or loss of revenue, diversion of software engineering resources, material non-monetary concessions, negative media attention, or increased service or warranty costs as a result of performance or warranty claims that could lead to customer dissatisfaction, litigation, damage to our reputation, and impaired demand for our products. Correcting bugs may result in increased costs and reduced acceptance of our software products in the marketplace. Further, such errors could subject us to claims from our customers for significant damages, and we cannot assure you that courts would enforce the provisions in our customer agreements that limit our liability for damages. The effort and expense of developing, testing and maintaining software product lines will increase with the increasing number of possible combinations of:\n•vendor hardware platforms;\n•operating systems and updated versions;\n•application software products and updated versions; and\n•database management system platforms and updated versions.\nDeveloping consistent software product performance characteristics across all of these combinations could place a significant strain on our development resources and software product release schedules.\nThe use of open source software in our products may expose us to additional risks and harm our intellectual property.\nSome of our products use or incorporate software that is subject to one or more open source licenses. Open source software is typically freely accessible, usable and modifiable. Certain open source software licenses require a user who intends to distribute the open source software as a component of the user’s software to disclose publicly part or all of the source code to the user’s software. In addition, certain open source software licenses require the user of such software to make any derivative works of the open source code available to others on unfavorable terms or at no cost. This can subject previously proprietary software to open source license terms.\nWhile we monitor the use of all open source software in our products, processes and technology and try to ensure that our open source software use does not require us to disclose the source code to the related product or solution, such use could inadvertently occur. Additionally, if a third-party software provider has incorporated certain types of open source software in software we license from such third party for our products and solutions, under certain circumstances we could be required to disclose the source code to our products and solutions. This could harm our intellectual property rights and have a material adverse effect on our business, results of operations, cash flow and financial condition.\nIf the open source community expands into enterprise application and supply chain software, our revenue may decline.\nThe open source community is comprised of many different formal and informal groups of software developers and individuals who have created a wide variety of software and have made that software available for use, distribution and modification, often free of charge. Open source software, such as the Linux operating system, has been gaining in popularity among business users. If developers contribute enterprise and supply chain application software to the open source community and that software has competitive features and scale to support business users in our markets, we will need to change our product pricing and distribution strategy to compete successfully.\nImplementation of our products can be complex, time-consuming and expensive, customers may be unable to implement our products successfully, and we may become subject to warranty or product liability claims, which could be costly to resolve and result in negative publicity.\nOur products must integrate with the existing computer systems and software programs of our customers. This can be complex, time-consuming and expensive, and may cause delays in the deployment of our products. Our customers may be unable to implement our products successfully or otherwise achieve the benefits attributable to our products. Although we test each of our new products and releases and evaluate and test the products we obtain through acquisitions before introducing them to the market, there still may be significant errors in existing or future releases of our software products, with the possible result that we may be required to expend significant resources in order to correct such errors or otherwise satisfy customer demands. In addition, defects in our products or difficulty integrating our products with our customers’ systems could result in delayed or lost revenue, warranty or other claims against us by customers or third parties, adverse customer reactions and negative publicity about us or our products and services, or reduced acceptance of our products and services in the marketplace, any of which could have a material adverse effect on our reputation, business, results of operations and financial condition.\nAn increase in sales of software products that require customization would result in revenue being recognized over the term of the contract for those products and could have a material adverse effect on our operating performance and financial condition.\nHistorically, we generally have been able to recognize software revenue upon delivery of our solutions and contract execution. Customers and prospects could ask for unique capabilities in addition to our core capabilities, which could cause us to recognize more of our software revenue on a contract accounting basis over the course of the delivery of the solution rather than upon delivery and contract execution. The period between the initial contract and the completion of the implementation of our products can be lengthy and is subject to a number of factors (over many of which we have little or no control) that may cause significant delays, including the size and complexity of the overall project. As a result, a shift toward a higher proportion of software contracts requiring contract accounting would have a material adverse effect on our operating performance and financial condition and cause our operating results to vary significantly from quarter to quarter.\nWe sometimes experience delays in product releases, which can adversely affect our business.\nHistorically, we have issued significant new releases of our software products periodically, with minor interim releases issued more frequently. Although we now issue software releases more frequently under our agile methodology, the complexities inherent in our software, major new product enhancements and new products often require long development and testing periods before they are released. On occasion, we have experienced delays in the scheduled release dates of new or enhanced products, and we cannot provide any assurance that we will achieve future scheduled release dates. The delay of product releases or enhancements, or the failure of such products or enhancements to achieve market acceptance, could materially affect our business and reputation.\nWe may not receive significant revenue from our current research and development efforts for several years.\nDeveloping and localizing software is expensive, and investment in product development may involve a long payback cycle. Our future plans include significant investments in software research and development and related product opportunities. We believe that we must continue to dedicate a significant amount of resources to our research and development efforts to maintain or improve our competitive position. However, we do not expect to receive significant revenue from these investments for several years, if at all.\nWe have limited protection of our intellectual property and proprietary rights and may potentially infringe third-party intellectual property rights.\nWe consider certain aspects of our internal operations, software and documentation to be proprietary, and rely on a combination of copyright, trademark and trade secret laws; confidentiality agreements with employees and third parties; protective contractual provisions (such as those contained in our agreements with consultants, vendors, partners and customers); and other measures to protect this information. Existing copyright laws afford only limited protection. We believe that the rapid pace of technological change in the computer software industry has made trade secret and copyright protection less significant than factors such as:\n•knowledge, ability and experience of our employees;\n•frequent software product enhancements;\n•customer education; and\n•timeliness and quality of support services.\nOur competitors may independently develop technologies that are substantially equivalent or superior to our technology. The laws of some countries in which our software products are or may be sold do not protect our software products and intellectual property rights to the same extent as do the laws of the United States.\nWe generally enter into confidentiality or similar agreements with our employees, customers, and vendors. These agreements control access to and distribution of our software, documentation, and other proprietary information. Despite our efforts to protect our proprietary rights, unauthorized parties may copy aspects of our products, obtain and use information that we regard as proprietary, or develop similar technology through reverse engineering or other means. Preventing or detecting unauthorized use of our products is difficult. There can be no assurance that the steps we take will prevent misappropriation of our technology or that such agreements will be enforceable. In addition, we may need to resort to litigation to enforce our intellectual property rights, protect our trade secrets, determine the validity and scope of others’ proprietary rights, or defend against claims of infringement or invalidity. Such litigation could result in significant costs and the diversion of resources. This could materially and adversely affect our business, operating results and financial condition.\nThird parties may assert infringement claims against us. Although we do not believe that our products infringe on the proprietary rights of third parties, we cannot guarantee that third parties will not assert or prosecute infringement or invalidity\nclaims against us. These claims could distract management, require us to enter into royalty arrangements, and result in costly and time-consuming litigation, including damage awards. Such assertions or the defense of such claims may materially and adversely affect our business, operating results, or financial condition. In addition, such assertions could result in injunctions against us. Injunctions that prevent us from distributing our products would have a material adverse effect on our business, operating results, and financial condition. If third parties assert such claims against us, we may seek to obtain a license to use such intellectual property rights. There can be no assurance that such a license would be available on commercially reasonable terms or at all. If a patent claim against us were successful and we could not obtain a license on acceptable terms or license a substitute technology or redesign to avoid infringement, we may be prevented from distributing our software or required to incur significant expense and delay in developing non-infringing software.\nWe may experience liability claims arising out of the sale of our software and provision of services.\nOur agreements normally contain provisions designed to limit our exposure to potential liability claims and generally exclude consequential and other forms of extraordinary damages. However, these provisions could be rendered ineffective, invalid or unenforceable by unfavorable judicial decisions or by federal, state, local or foreign laws or ordinances. For example, we may not be able to avoid or limit liability for disputes relating to product performance or the provision of services. If a claim against us were to be successful, we may be required to incur significant expense and pay substantial damages, including consequential or punitive damages, which could have a material adverse effect on our business, operating results and financial condition. Even if we prevail in contesting such a claim, the accompanying publicity could adversely affect the demand for our products and services.\nWe also rely on certain technology that we license from third parties, including software that is integrated with our internally developed software. Although these third parties generally indemnify us against claims that their technology infringes on the proprietary rights of others, such indemnification is not always available for all types of intellectual property. Often such third-party indemnifiers are not well capitalized and may not be able to indemnify us in the event that their technology infringes on the proprietary rights of others. As a result, we may face substantial exposure if technology we license from a third party infringes on another party’s proprietary rights. Defending such infringement claims, regardless of their validity, could result in significant cost and diversion of resources.\nPrivacy and security concerns, including evolving government regulation in the area of data privacy, could adversely affect our business and operating results.\nGovernments in many jurisdictions have enacted or are considering enacting consumer data privacy legislation, including laws and regulations applying to the solicitation, collection, processing and use of consumer data. For example, in 2016, the European Union adopted a new law governing data practices and privacy called the General Data Protection Regulation (“GDPR”), which became effective in May 2018. The law establishes new requirements regarding the handling of personal data. Non-compliance with the GDPR may result in monetary penalties of up to 4% of worldwide revenue. The GDPR and other changes in laws or regulations associated with the enhanced protection of certain types of sensitive data could greatly increase our cost of providing our products and services or even prevent us from offering certain services in jurisdictions that we operate. In the U.S., California enacted the California Consumer Privacy Act of 2018 (“CCPA”), which took effect on January 1, 2020, and the California Privacy Rights Act (“CPRA”), which expands upon the CCPA was passed in November 2020 and comes into effect on January 1, 2023, with a “lookback” period to January 1, 2022. This legislation broadly defines personal information, gives California residents expanded privacy rights and protections and provides for civil penalties for violations.\nAdditionally, public perception and standards related to the privacy of personal information can shift rapidly, in ways that may affect our reputation or influence regulators to enact regulations and laws that may limit our ability to provide certain products. Federal, state, or foreign laws and regulations, including laws and regulations regulating privacy, data security, or consumer protection, or other policies, public perception, standards, self-regulatory requirements or legal obligations, could reduce the demand for our software products if we fail to design or enhance our products to enable our customers to comply with the privacy and security measures dictated by these requirements. Moreover, we may be exposed to liability under existing or new data privacy legislation. Even technical violations of these laws can result in penalties that are assessed for each non-compliant transaction. If we or our customers were found to be subject to and in violation of any of these laws or other data privacy laws or regulations, our business could suffer and we and/or our customers would likely have to change our business practices.\nWe face risks associated with the security of our products, and if our data protection or other security measures are compromised and as a result our data, our customers’ data or our IT systems are accessed improperly, made unavailable, or improperly modified, our products and services may be perceived as vulnerable, our reputation could be damaged, the IT services we provide to our customers could be disrupted, and customers may stop using our products and services, all of which could reduce our revenue and earnings, increase our expenses and expose us to legal claims and regulatory actions.\nMaintaining the security of computers and computer networks is an issue of critical importance for our customers. Attempts by experienced computer programmers, or hackers, to penetrate customer network security or the security of web sites to misappropriate confidential information have become an industry-wide phenomenon that affects computers and networks across all platforms. We have included security features in certain of our Internet browser-enabled products that are intended to protect the privacy and integrity of customer data. In addition, some of our software applications use encryption technology to permit the secure exchange of valuable and confidential information. Despite these security features, our products may be vulnerable to break-ins and similar problems caused by hackers, which could jeopardize the security of information stored in and transmitted through the computer systems of our customers. Actual or perceived security vulnerabilities in our products (or the Internet in general) could lead some customers to seek to reduce or delay future purchases or to purchase competitors’ products which are not Internet-based applications. Customers may also increase their spending to protect their computer networks from attack, which could delay adoption of new technologies. Any of these actions by customers and the cost of addressing such security problems may have a material adverse effect on our business.\nAlthough our agreements with our customers contain provisions designed to limit our exposure as a result of the situations listed above, such provisions may not be effective. Existing or future federal, state, local or foreign laws or ordinances or unfavorable judicial decisions could affect their enforceability. To date, we have not experienced any such product liability claims, but there can be no assurance that this will not occur in the future. Because our products may be used in essential business applications, a successful product liability claim could have a material adverse effect on our business, operating results, and financial condition. Additionally, defending such a suit, regardless of its merits, could entail substantial expense and require the time and attention of key management.\nWe depend on third-party technology, which could result in increased costs or delays in the production and improvement of our products if it should become unavailable or if it contains defects.\nWe license critical third-party software that we incorporate into our own software products. We are likely to incorporate and include additional third-party software in our products and solutions as we expand our product offerings. The operation of our products would be impaired if errors occur in the third-party software that we utilize. It may be difficult for us to correct any defects in third-party software because the software is not within our control. Accordingly, our business could be adversely affected in the event of any errors in this software. There can be no assurance that third parties will continue to make their software available to us on acceptable terms, invest the appropriate levels of resources in their products and services to maintain and enhance the capabilities of their software, or even remain in business. Further, due to the limited number of vendors of certain types of third-party software, it may be difficult for us to replace such third-party software if a vendor terminates our license of the software or our ability to license the software to customers. If our relations with any of these third-party software providers are impaired, and if we are unable to obtain or develop a replacement for the software, our business could be harmed. In addition, if the cost of licensing any of these third-party software products significantly increases, our gross margin levels could significantly decrease.\nAny interruptions or delays in services from third parties, including data center hosting facilities and cloud computing platform providers, or our inability to adequately plan for and manage service interruptions or infrastructure capacity requirements, could impair the delivery of our services and harm our business.\nWe currently serve our customers from third-party data center hosting facilities and cloud computing platform providers located in the United States and other countries. Any damage to or failure of our systems generally, including the systems of our third-party platform providers, could result in interruptions in our services. From time to time we have experienced interruptions in our services and such interruptions may occur in the future. As we increase our reliance on these third-party systems, the risk of service interruptions may increase. Interruptions in our services may cause customers to make warranty or other claims against us or terminate their agreements and adversely affect our ability to attract new customers, all of which would reduce our revenue. Our business also would be harmed if customers and potential customers believe our services are unreliable.\nThese data and cloud computing platforms may not continue to be available at reasonable prices, on commercially reasonable terms or at all. Any loss of the right to use any of these cloud computing platforms could significantly increase our expenses and otherwise result in delays in providing our services until equivalent technology either is developed by us or, if available, is identified, purchased or licensed and integrated into our services.\nIf we do not accurately plan for our infrastructure capacity requirements and we experience significant strain on our data center capacity, our customers could experience performance degradation or service outages that may subject us to financial liability, result in customer losses and harm our business. As we add data centers and capacity and continue to move to a cloud computing platform, we may move or transfer our data and our customers’ data. Despite precautions taken during this process, any unsuccessful data transfers may impair the delivery of our services, which may adversely impact our business.\nRISK FACTORS RELATED TO OUR PERSONNEL\nWe are dependent upon key personnel, and need to attract and retain highly qualified personnel in all areas.\nOur future operating results depend significantly upon the continued service of a relatively small number of key senior management and technical personnel, including our Chief Executive Officer and President, H. Allan Dow. None of our key personnel are bound by long-term employment agreements. We do not have in place “key person” life insurance policies on any of our employees. If we fail to retain senior management or other key personnel, or fail to attract key personnel, our succession planning and operations could be materially and adversely affected and could jeopardize our ability to meet our business goals.\nOur future success also depends on our continuing ability to attract, train, retain and motivate other highly qualified managerial and technical personnel. Competition for these personnel is intense, and at times we have experienced difficulty in recruiting and retaining qualified personnel, including sales and marketing representatives, qualified software engineers involved in ongoing product development, and personnel who assist in the implementation of our products and provide other services. The market for such individuals is competitive. Given the critical roles of our sales, product development and consulting personnel, our inability to recruit successfully or any significant loss of key personnel would adversely affect us. The software industry is characterized by a high level of employee mobility and aggressive recruiting of skilled personnel. It may be particularly difficult to retain or compete for skilled personnel against larger, better-known software companies. We cannot guarantee that we will be able to retain our current personnel, attract and retain other highly qualified technical and managerial personnel in the future, or assimilate the employees from any acquired businesses. We will continue to adjust the size and composition of our workforce to match the relevant product and geographic demand cycles. If we are unable to attract and retain the necessary technical and managerial personnel, or assimilate the employees from any acquired businesses, our business, operating results and financial condition would be adversely affected.\nThe failure to attract, train, retain and effectively manage employees could negatively impact our development and sales efforts and cause a degradation of our customer service. In particular, the loss of sales personnel could lead to lost sales opportunities because it can take several months to hire and train replacement sales personnel. If our competitors increase their use of non-compete agreements, the pool of available sales and technical personnel may further shrink, even if the non-compete agreements ultimately prove to be unenforceable. We may grant large numbers of stock options to attract and retain personnel, which could be highly dilutive to our shareholders. The volatility or lack of positive performance of our stock price may adversely affect our ability to retain or attract employees. The loss of key management and technical personnel or the inability to attract and retain additional qualified personnel could have an adverse effect on us.\nWe periodically have restructured our work force, which can be disruptive.\nPeriodically, we have restructured or made other adjustments to our work force in response to factors such as product changes, geographical coverage and other internal considerations. Change in the structures of the work force and management can cause us to terminate and then hire new personnel, and/or result in temporary lack of focus and reduced productivity, which may affect revenue in one or more quarters. Future restructuring of our work force could occur, and if so we may again experience the adverse transition issues associated with such restructuring.\nOur technical personnel have unique access to customer data, and may abuse that privilege.\nIn order to properly render the services we provide, our technical personnel have the ability to access data on the systems run by our customers or hosted by us for our customers, including data about the operations of our customers and even about the customers of our customers. Although we have never had such an occurrence in the entire history of our Company, it is conceivable that such access could be abused in order to improperly utilize that data to the detriment of such customers.\nRISK FACTORS RELATED TO OUR CORPORATE STRUCTURE AND GOVERNANCE\nOur business is subject to changing regulation of corporate governance and public disclosure that has increased both our costs and the risk of non-compliance.\nBecause our common stock is publicly traded, we are subject to certain rules and regulations of federal, state and financial market exchange entities charged with the protection of investors and the oversight of companies whose securities are publicly traded. These entities, including the Public Company Accounting Oversight Board, the SEC and NASDAQ, have issued requirements and regulations and continue to develop additional regulations and requirements in response to laws enacted by Congress. Our efforts to comply with these regulations have resulted in, and are likely to continue to result in, increased general and administrative expenses and a diversion of management time and attention from revenue-generating activities to compliance activities.\nIn particular, our efforts to comply with Section 404 of the Sarbanes-Oxley Act of 2002 and the related regulations regarding our required assessment of our internal control over financial reporting and our independent registered public accounting firm’s audits of that assessment have required, and continue to require, the commitment of significant financial and managerial resources. Moreover, because these laws, regulations and standards are subject to varying interpretations, their application in practice may evolve over time as new guidance becomes available. This evolution may result in continuing uncertainty regarding compliance matters and additional costs necessitated by ongoing revisions to our disclosure and governance practices. Over time, we have made significant changes in, and may consider making additional changes to, our internal controls, our disclosure controls and procedures, and our corporate governance policies and procedures. Any system of controls, however well-designed and -operated, is based in part on certain assumptions and can provide only reasonable, and not absolute, assurances that the objectives of the system are met. Any failure of our controls, policies and procedures could have a material adverse effect on our business, results of operations, cash flow and financial condition.\nIf in the future we are unable to assert that our internal control over financial reporting is effective as of the end of the then current fiscal year (or if our independent registered public accounting firm is unable to express an opinion on the effectiveness of our internal control over financial reporting), we could lose investor confidence in the accuracy and completeness of our financial reports, which would have a negative market reaction.\nOne shareholder beneficially owns a substantial portion of our stock, and as a result exerts substantial control over us.\nAs of June 30, 2021, James C. Edenfield, Executive Chairman, Treasurer and a Director of the Company, beneficially owned 1,821,587 shares, or 100%, of our Class B common stock, and 60,000 shares, or 0.18%, of our Class A common stock. If all of Mr. Edenfield’s Class B shares were converted into Class A shares, Mr. Edenfield would beneficially own 1,881,587 Class A shares, which would represent approximately 5.66% of all outstanding Class A shares after giving effect to such conversion. As a result of Mr. Edenfield’s ownership of Class B common stock, he has the right to elect a majority of our Board of Directors. Such control and concentration of ownership may discourage a potential acquirer from making a purchase offer that other shareholders might find favorable, which in turn could adversely affect the market price of our common stock.\nOur articles of incorporation and bylaws and Georgia law may inhibit a takeover of our company.\nOur basic corporate documents and Georgia law contain provisions that might enable our management to resist a takeover. These provisions might discourage, delay or prevent a change in the control or a change in our management. These provisions could also discourage proxy contests and make it more difficult for you and other shareholders to elect directors and take other corporate actions. The existence of these provisions could also limit the price that investors might be willing to pay in the future for shares of our common stock.\nWe are a “controlled company” within the meaning of NASDAQ rules and, as a result, qualify for, and rely on, exemptions from certain corporate governance requirements.\nBecause Mr. Edenfield has the ability to elect more than half of the members of our Board of Directors, we are a “controlled company” within the meaning of the rules governing companies with stock quoted on the NASDAQ Global Select Market. Under these rules, a “controlled company” is a company of which more than 50% of the voting power for the election of directors is held by an individual, a group or another company. As a controlled company, we are exempt from certain corporate governance requirements, including requirements that: (1) a majority of the board of directors consist of independent directors; (2) compensation of officers be determined or recommended to the board of directors by a majority of its independent directors or by a compensation committee that is composed entirely of independent directors; and (3) director nominees be selected or recommended for selection by a majority of the independent directors or by a nominating committee composed solely of independent directors. Our Board of Directors does not have a majority of independent directors, and our compensation committee is not required to consist entirely of independent directors. We are not required to have, and have not chosen to establish, a nominating committee. Accordingly, our procedures for approving significant corporate decisions are not subject to the same corporate governance requirements as non-controlled companies with stock quoted on the NASDAQ Global Select Market.\nRISK FACTORS RELATED TO OUR STOCK PRICE\nWe could experience fluctuations in quarterly operating results that could adversely affect our stock price.\nWe have difficulty predicting our actual quarterly operating results, which have varied widely in the past and which we expect to continue to vary significantly from quarter to quarter due to a number of factors, many of which are outside our control. We base our expense levels, operating costs and hiring plans on projections of future revenue, and it is difficult for us to rapidly adjust when actual results do not match our projections. If our quarterly revenue or operating results fall below the\nexpectations of investors or public market analysts, the price of our common stock could fall substantially. Revenue in any quarter depend on the combined sales activity of the American Software group of companies and our ability to recognize revenue in that quarter in accordance with our revenue recognition policies. Our sales activity is difficult to forecast for a variety of reasons, including the following:\n•we complete a significant portion of our customer agreements within the last few weeks of each quarter;\n•if an agreement includes cloud services that are performed over the term of the contract, this requires all revenue to be spread over the term of the contract;\n•our sales cycle for products and services, including multiple levels of authorization required by some customers, is relatively long and variable because of the complex and mission-critical nature of our products;\n•the demand for our products and services can vary significantly;\n•the size of our transactions can vary significantly;\n•the possibility of adverse global political or public health conditions and economic downturns, both domestic and international, characterized by decreased product demand, price erosion, technological shifts, work slowdowns and layoffs, may substantially reduce customer demand and contracting activity;\n•customers may unexpectedly postpone or cancel anticipated system replacement or new system evaluation and implementation due to changes in their strategic priorities, project objectives, budgetary constraints, internal purchasing processes or company management;\n•customer evaluation and purchasing processes vary from company to company, and a customer’s internal approval and expenditure authorization process can be difficult and time-consuming, even after selection of a vendor; and\n•the number, timing and significance of software product enhancements and new software product announcements by us and by our competitors may affect purchase decisions.\nVariances or slowdowns in our contracting activity in prior quarters may affect current and future consulting, training and maintenance revenue, since these revenue typically follow license or subscription fee revenue. Our ability to maintain or increase services revenue primarily depends on our ability to increase the number and size of our customer agreements. In addition, we base our budgeted operating costs and hiring plans primarily on our projections of future revenue. Because most of our expenses, including employee compensation and rent, are relatively fixed in the near term, if our actual revenue falls below projections in any particular quarter, our business, operating results, and financial condition could be materially and adversely affected. In addition, our expense levels are based, in part, on our expectations regarding future revenue increases. As a result, any shortfall in revenue in relation to our expectations could cause significant changes in our operating results from quarter to quarter and could result in quarterly losses. As a result of these factors, we believe that period-to-period comparisons of our revenue and operating results are not necessarily meaningful. Therefore, predictions of our future performance should not be based solely on our historical quarterly revenue and operating results.\nOur stock price is volatile and there is a risk of litigation.\nThe trading price of our common stock has been in the past and in the future may be subject to wide fluctuations in response to factors such as the following:\n•general market conditions;\n•revenue or results of operations in any quarter failing to meet the expectations, published or otherwise, of the investment community;\n•customer order deferrals resulting from the anticipation of new products, economic uncertainty, disappointing operating results by the customer, management changes, corporate reorganizations or otherwise;\n•reduced investor confidence in equity markets, due in part to corporate collapses in recent years;\n•speculation in the press or analyst community;\n•wide fluctuations in stock prices, particularly in relation to the stock prices for other technology companies;\n•announcements of technological innovations by us or our competitors;\n•new products or the acquisition or loss of significant customers by us or our competitors;\n•developments with respect to our proprietary rights or those of our competitors;\n•changes in interest rates;\n•changes in investors’ beliefs as to the appropriate price-earnings ratios for us and our competitors;\n•changes in recommendations or financial estimates by securities analysts who track our common stock or the stock of other software companies;\n•changes in management;\n•sales of common stock by our controlling shareholder, directors and executive officers;\n•rumors or dissemination of false or misleading information, particularly through Internet chat rooms, instant messaging, and other rapid-dissemination methods;\n•conditions and trends in the software industry generally;\n•the announcement of acquisitions or other significant transactions by us or our competitors;\n•adoption of new accounting standards affecting the software industry;\n•domestic or international terrorism, public health crises including the COVID-19 pandemic, and other significant external factors; and\n•the other factors described in these “Risk Factors.”\nFluctuations in the price of our common stock may expose us to the risk of securities class action lawsuits. Although no such lawsuits are currently pending against us and we are not aware that any such lawsuit is threatened to be filed in the future, there is no assurance that we will not be sued based on fluctuations in the price of our common stock. Defending against such lawsuits could result in substantial cost and divert management’s attention and resources. In addition, any settlement or adverse determination of these lawsuits could subject us to significant liabilities.\nOur dividend policy is subject to change.\nOn May 26, 2021, our Board of Directors declared a quarterly cash dividend of $0.11 per share of our Class A and Class B common stock. The cash dividend will be payable on August 27, 2021 to Class A and Class B shareholders of record at the close of business on August 13, 2021. We currently expect to declare and pay cash dividends at this level on a quarterly basis in the future. However, our dividend policy may be affected by, among other things, our views on business conditions, financial position, earnings, earnings outlook, capital spending plans and other factors that our Board of Directors considers relevant at that time. Our dividend policy has changed in the past and may change from time to time, and we cannot provide assurance that we will continue to declare dividends in any particular amounts or at all. A change in our dividend policy could have a negative effect on the market price of our common stock.\nThe price of our common stock may decline due to shares eligible for future sale or actual future sales of substantial amounts of our common stock.\nSales of substantial amounts of our common stock in the public market, or the perception that such sales may occur, could cause the market price of our common stock to decline. As of June 30, 2021, if all of our outstanding Class B common shares were converted into Class A common shares, our current directors and executive officers of the Company as a group would beneficially own approximately 9.41% of all outstanding Class A common shares after giving effect to such conversion. Sales of substantial amounts of our common stock in the public market by these persons, or the perception that such sales may occur, could cause the market price of our common stock to decline and could impair our ability to raise capital through the sale of additional equity securities.",
    "item_1B": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item_2": "ITEM 2. PROPERTIES\nOur corporate headquarters are located in an approximately 100,000 square foot office building that we own at 470 East Paces Ferry Road, N.E., Atlanta, Georgia.\nWe have entered into leases for sales and technology development offices located in various cities in the United States and overseas. We believe our existing facilities are adequate for our current needs and that suitable additional or substitute space will be available as needed on commercially reasonable terms.\nEach of our three segments makes use of the property at 470 East Paces Ferry Road and our SCM segment occupies office space that we lease in the United Kingdom, Sweden, Germany, India, New Zealand and Australia.",
    "item_3": "ITEM 3. LEGAL PROCEEDINGS\n(a)Many of our installations involve products that are critical to the operations of our customers’ businesses. Any failure in our products could result in a claim for substantial damages against us, regardless of our responsibility for such failure. Although we attempt to contractually limit our liability for damages arising from product failures or negligent acts or omissions, there can be no assurance that the limitations of liability contained in our contracts will be enforceable in all instances. We are not currently a party to any material legal proceedings that would require disclosure under this Item.\n(b)None.",
    "item_4": "ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II",
    "item_5": "ITEM 5. MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS, AND ISSUER PURCHASES OF EQUITY SECURITIES\nTrading Market\nOur Class A Common Shares are listed on the NASDAQ Global Select Market under the symbol “AMSWA”. As of July 2, 2021, there were 14,419 holders of Class A shares who held their stock either individually or in nominee or “street” names through various brokerage firms, and one holder of Class B Common Shares.\nEquity Compensation Plans\nThe following table discloses information regarding the Company’s equity compensation plans as of April 30, 2021:\nPlan Category Number of securities to be\nissued upon exercise of\noutstanding options,\nwarrants and rights Weighted-average\nexercise price of\noutstanding options,\nwarrants and rights Number of securities\nremaining available for\nfuture issuance under\nequity compensation plans\n(excluding securities\nreflected in the first column)\nEquity compensation plans approved by security holders\n4,109,733 $ 13.33 379,143\nDividend Policy\nSince the third quarter of fiscal 2013, our Board of Directors had declared quarterly dividends of $0.10 per share. On May 11, 2016, our Board increased the quarterly dividends to $0.11 per share, payable to our Class A and Class B common stockholders. We currently expect to declare and pay cash dividends at this level on a quarterly basis in the future. The continuation of this policy, and payment of future cash dividends, will be at the sole discretion of the Board of Directors. In exercising this discretion, the Board will consider our profitability, financial condition, cash requirements, future prospects and other relevant factors. Our dividend policy has changed in the past and may change from time to time, and we cannot provide assurance that we will continue to declare dividends in any particular amounts or at all.\nStock Price Performance Graph\nThe graph below reflects the cumulative stockholder return on the Company’s shares compared to the return of the NASDAQ Stock Market - US Companies (\"NASDAQ Composite Index\") and a peer group index on a quarterly basis. The graph reflects the investment of $100 on April 30, 2016 in the Company’s stock, the NASDAQ Composite Index and the NASDAQ Computer Index, a published industry peer group index. The NASDAQ Computer Index consists of approximately 393 NASDAQ-listed companies, including computer hardware and software companies that furnish computer programming and data processing services and firms that produce computers, office equipment, and electronic component/accessories. The total cumulative dollar returns shown below represent the value that such investments would have had on April 30, 2021.\nFY 2016 FY 2017 FY 2018 FY 2019 FY 2020 FY 2021\nAmerican Software(a) $ 100 $ 126 $ 153 $ 161 $ 211 $ 275\nNASDAQ Composite 100 127 148 170 186 295\nNASDAQ Computer Index 100 138 168 202 243 401\n_______________\n(a)This series includes dividends paid over the disclosed period.\nPurchases of Equity Securities by the Company\nThe following table summarizes repurchases of our stock in the quarter ended April 30, 2021:\nFiscal Period Total Number of\nShares Purchased Average Price\nPaid Per Share Total Number of\nShares Purchased as\nPart of Publicly\nAnnounced Plans\nor Programs Maximum Number of\nShares that May Yet\nBe Purchased\nUnder the Plans\nor Programs*\nFebruary 1, 2021 through February 28, 2021 - $ - - 946,321\nMarch 1, 2021 through March 31, 2021 - $ - - 946,321\nApril 1, 2021 through April 30, 2021 - $ - - 946,321\nTotal Fiscal 2021 Fourth Quarter - $ - - 946,321\n_____________\n* The above share purchase authority was approved by the Board of Directors on August 19, 2002, when the Board approved a resolution authorizing the Company to repurchase up to 2.0 million shares of Class A common stock. This action was announced on August 22, 2002. The authorization has no expiration date.\nTransfer Agent\nAmerican Stock Transfer & Trust Company LLC\n6201 15th Ave.\nBrooklyn, NY 11219\nToll free: (800) 937-5449\nLocal & international: (718) 921-8124\nhttp://www.astfinancial.com\nInquiries regarding stock transfers, lost certificates or address changes should be directed to the above address.\nMarket Makers\nThe following firms make a market in the Class A common shares of American Software, Inc.\nArchipelago Stock Exchange Morgan Stanley & Co. LLC\nB. Riley FBR, INC. Nasdaq Execution Services LLC\nBarclays Capital Inc./Le NASDAQ OMX PHLX LLC\nBofa Securities, Inc. National Stock Exchange\nCanaccord Genuity Inc. New York Stock Exchange\nCantor, Fitzgerald & Co. Raymond, James & Associates\nCBOE TRADING, INC. RBC Capital Markets, LLC\nCitadel Derivatives Group LLC Robert W. Baird & Co Inc.\nCitadel Securities LLC SG Americas Securities LLC\nCowen and Company, LLC Stifel Nicolaus & Co.\nDirect Edge ECN LLC SunTrust Capital Markets Inc.\nG1 Execution Services, LLC Susquehanna Financial Group,\nGoldman Sachs & Co. LLC Susquehanna Securities\nGTS Securities LLC Two Sigma Securities, LLC\nIMC Financial Markets UBS Securities LLC\nJefferies LLC Virtu Americas LLC\nKeybanc Capital Markets Inc. Wall Street Investor Services\nLatour Trading LLC Wells Fargo Advisors, LLC\nMaxim Group LLC William Blair",
    "item_6": "ITEM 6. SELECTED CONSOLIDATED FINANCIAL DATA\nThe information required by Item 301 of Regulation S-K is incorporated by reference to Item 8. Consolidated Financial Statements and Supplementary Data” of this report. Quarterly financial data previously required by item 302 of Regulation S-K has been omitted as we have elected to early adopt the changes to Item 302 contained in SEC Release No. 33-10890.",
    "item_7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis should be read in conjunction with “Item 8. Consolidated Financial Statements and Supplementary Data”. This discussion contains forward-looking statements relating to our future financial performance, business strategy, financing plans and other future events that involve uncertainties and risks. You can identify these statements by forward-looking words such as “anticipate,” “intend,” “plan,” “continue,” “could,” “grow,” “may,” “potential,” “predict,” “strive,” “estimate,” “believe,” “expect” and similar expressions that convey uncertainty of future events or outcomes. Any forward-looking statements herein are made pursuant to the safe harbor provision of the Private Securities Litigation Reform Act of 1995. Our actual results could differ materially from the results anticipated by these forward-looking statements as a result of many known and unknown factors that are beyond our ability to control or predict, including but not limited to those discussed above in “Risk Factors” and elsewhere in this report. See also “Special Cautionary Notice Regarding Forward-Looking Statements” at the beginning of “Item 1. Business.”\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nWe have based the following discussion and analysis of financial condition and results of operations on our consolidated financial statements, which we have prepared in accordance with U.S. GAAP. The preparation of these consolidated financial statements requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosures of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenue and expenses during the reporting period. Note 1 to the Consolidated Financial Statements for the fiscal year ended April 30, 2021, describes the significant accounting policies that we have used in preparing our consolidated financial statements. On an ongoing basis, we evaluate our estimates, including, but not limited to, those related to revenue/collectability. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Our actual results could differ materially from these estimates under different assumptions or conditions.\nWe believe the critical accounting policies listed below affect significant judgments and estimates used in the preparation of the financial statements.\nRevenue Recognition.\nLicense. Our perpetual software licenses provide the customer with a right to use the software as it exists at the time of purchase. We recognize revenue for distinct software licenses once the license period has begun and we have made the software available to the customer.\nOur perpetual software licenses are sold with maintenance under which we provide customers with telephone consulting, product updates on a when and if available basis, and releases of new versions of products previously purchased by the customer, as well as error reporting and correction services.\nSubscription. Subscription fees include Software-as-a-Service (\"SaaS\") revenue for the right to use the software for a limited period of time in an environment hosted by the Company or by a third party. The customer accesses and uses the software on an as needed basis over the Internet or via a dedicated line; however, the customer has no right to take delivery of the software. The underlying arrangements typically include a single fee for the service that is billed monthly, quarterly or annually. The Company’s SaaS solutions represent a series of distinct services that are substantially the same and have the same pattern of transfer to the customer. Revenue from a SaaS solution is generally recognized ratably over the term of the arrangement.\nProfessional Services and Other. Our professional services revenue consists of fees generated from consulting, implementation and training services, including reimbursements of out-pocket expenses in connection with our services. These services are typically optional to our customers, and are distinct from our software. Fees for our professional services are separately priced and are generally billed on an hourly basis, and revenue is recognized over time as the services are performed. We believe the output method of hours worked provides the best depiction of the transfer of our services since the customer is receiving the benefit from our services as the work is performed. Reimbursements received from customers for out-of-pocket expenses were recorded in revenue and totaled approximately $20,000, $1.5 million, and $1.4 million for 2021, 2020 and 2019, respectively.\nMaintenance and Support. Revenue is derived from maintenance and support services, under which we provide customers with telephone consulting, product updates on a when and if available basis, and releases of new versions of products previously purchased by the customer, as well as error reporting and correction services. Maintenance for perpetual licenses is renewable, generally on an annual basis, at the option of the customer. Maintenance terms typically range from one to three years. Revenue related to maintenance is generally paid in advance and recognized ratably over the term of the agreement since the Company is standing ready to provide a series of maintenance services that are substantially the same each period over the term; therefore, time is the best measure of progress. Support services for subscriptions are included in the subscription fees and are recognized as a component of such fees.\nIndirect Channel Revenue. We record revenue from sales made through the indirect sales channels on a gross basis, because we control the goods or services and act as the principal in the transaction. In reaching this determination, we evaluate sales through our indirect channel on a case-by-case basis and consider a number of factors including indicators of control such as the party having the primary responsibility to provide specified goods or services, and the party having discretion in establishing prices.\nSales Taxes. We account for sales taxes collected from customers on a net basis.\nSignificant Judgments. Many of our contracts include multiple performance obligations. Our products and services generally do not require a significant amount of integration or interdependency; therefore, our products and services are generally not combined. We allocate the transaction price for each contract to each performance obligation based on the relative standalone selling price (SSP) for each performance obligation within each contract.\nWe use judgment in determining the SSP for products and services. For substantially all performance obligations except on-premise licenses, we are able to establish SSP based on the observable prices of products or services sold separately in comparable circumstances to similar customers. We typically establish an SSP range for our products and services which is reassessed on a periodic basis or when facts and circumstances change. Our on-premise licenses have not historically been sold on a standalone basis, as the vast majority of all customers elect to purchase on-premise license support contracts at the time of a on-premise license purchase. Support contracts are generally priced as a percentage of the net fees paid by the customer to access the on-premise license. We are unable to establish the SSP for our on-premise licenses based on observable prices given the same products are sold for a broad range of amounts (that is, the selling price is highly variable) and a representative SSP is not discernible from past transactions or other observable evidence. As a result, the SSP for a on-premise license included in a contract with multiple performance obligations is determined by applying a residual approach whereby all other performance obligations within a contract are first allocated a portion of the transaction price based upon their respective SSPs, with any residual amount of transaction price allocated to on-premise license revenue.\nRESULTS OF OPERATIONS\nThe following table sets forth certain revenue and expense items as a percentage of total revenue for the three years ended April 30, 2021, 2020, and 2019 and the percentage increases and decreases in those items for the years ended April 30, 2021 and 2020:\nPercentage of Total Revenue Pct. Change in\nDollars Pct. Change in\nDollars\n2021 2020 2019 2021 vs. 2020 2020 vs. 2019\nRevenue:\nSubscription fees 26 % 19 % 13 % 31 % 57 %\nLicense fees 3 7 6 (61) 6\nProfessional services and other 35 37 39 (7) 1\nMaintenance 36 37 42 (7) (5)\nTotal revenue 100 100 100 (4) 6\nCost of revenue:\nSubscription fees 11 8 5 25 65\nLicense fees 2 4 6 (60) (25)\nProfessional services and other 26 27 29 (5) (2)\nMaintenance 7 6 8 3 (12)\nTotal cost of revenue 46 45 48 (4) 1\nGross margin 54 55 52 (3) 11\nResearch and development 15 13 12 11 17\nSales and marketing 18 19 19 (8) 5\nGeneral and administrative 17 17 16 (2) 15\nAmortization of acquisition-related intangibles - - - (26) (27)\nTotal operating expenses 50 49 47 (1) % 11\nOperating income 4 6 5 (28) 15\nOther income:\nInterest income - 1 2 (73) (27)\nOther, net 4 (1) - (627) nm\nEarnings before income taxes 8 6 7 30 (11)\nIncome tax expense 1 - 1 1255 (93)\nNet earnings 7 % 6 % 6 % 20 % (1) %\nnm - not meaningful\nEconomic Overview and Significant Trends in Our Business\nFor fiscal 2022, we expect the global economy to improve modestly when compared to recent periods. We believe information technology spending will incrementally improve over the long term as increased global competition forces companies to improve productivity by upgrading their technology systems, which could result in an improved selling environment. Although this improvement could slow or regress at any time, due in part to concerns related to the effects of the spread of the global virus and trade conflicts on global capital markets and general economic conditions, we believe that our organizational and financial structure will enable us to take advantage of any sustained economic rebound. While we do not expect that the COVID-19 pandemic will cause any material adverse changes on our business or financial results for fiscal 2022, we are unable to accurately predict the impact that the coronavirus will have due to various uncertainties, including the ultimate geographic spread of the virus, the severity of the disease, the duration of the outbreak, and actions that may be taken by governmental authorities. Customers continue to take long periods to evaluate discretionary software purchases.\nCorporate capital spending trends and commitments are the primary determinants of the size of the market for business software. Corporate capital spending is, in turn, a function of general economic conditions in the U.S. and abroad and in particular may be affected by conditions in U.S. and global credit markets. In recent years, the weakness in the overall global economy and the U.S. economy has resulted in reduced expenditures in the business software market.\nIn April 2021, the International Monetary Fund (“IMF”) provided an update to the World Economic Outlook for the 2021 and 2022 world economic growth forecast. The update noted that, “High uncertainty surrounds the global economic outlook, primarily related to the path of the pandemic. The contraction of activity in 2020 was unprecedented in living memory in its speed and synchronized nature. But it could have been a lot worse. Although difficult to pin down precisely, IMF staff estimates suggest that the contraction could have been three times as large if not for extraordinary policy support. Much remains to be done to beat back the pandemic and avoid divergence in income per capita across economies and persistent increases in inequality within countries.\nAfter an estimated contraction of -3.3 percent in 2020, the global economy is projected to grow at 6 percent in 2021, moderating to 4.4 percent in 2022. The contraction for 2020 is 1.1 percentage points smaller than projected in the October 2020 World Economic Outlook (WEO), reflecting the higher-than-expected growth out turns in the second half of the year for most regions after lockdowns were eased and as economies adapted to new ways of working. The projections for 2021 and 2022 are 0.8 percentage point and 0.2 percentage point stronger than in the October 2020 WEO, reflecting additional fiscal support in a few large economies and the anticipated vaccine-powered recovery in the second half of the year.”\nAs the economy improves from the COVID-19 decline, we believe that the recovery may drive some businesses to invest in achieving more process and efficiency enhancements in their operations and to invest in solutions that improve operating margins, rather than make large infrastructure-type technology purchases. If this trend continues, we believe it may tend to favor our supply chain solutions, which are designed to provide a more rapid return on investment and are targeted at some of the largest profit drivers in a customer’s business. While the recent difficult economic environment has had a particularly adverse impact on the weaker companies in our target markets, we believe a large percentage of our customers are seeking to make investments to strengthen their operations, and some are taking advantage of current economic conditions to gain market share. We have taken steps to best ensure the health and safety of our employees globally. Our daily execution has evolved into a largely virtual model, and we continue to find innovative ways to engage with customers and prospects, ensuring that they are supported as they navigate through this unprecedented period.\nBusiness Opportunities and Risks\nWe currently view the following factors as the primary opportunities and risks associated with our business:\n•Dependence on Capital Spending Patterns. There is risk associated with our dependence on the capital spending patterns of U.S. and international businesses, which in turn are functions of economic trends and conditions over which we have no control.\n•Acquisition Opportunities. There are opportunities for selective acquisitions or investments to expand our sales distribution channels and/or broaden our product offering by providing additional solutions for our target markets.\n•Acquisition Risks. There are risks associated with acquisitions of complementary companies, products and technologies, including the risks that we will not achieve the financial and strategic goals that we contemplate at the time of the transaction. More specifically, in any acquisition we will face risks and challenges associated with the uncertain value of the acquired business or assets, the difficulty of assimilating operations and personnel, integrating acquired technologies and products and maintaining the loyalty of the customers of the acquired business.\n•Competitive Technologies. There is a risk that our competitors may develop technologies that are substantially equivalent or superior to our technology.\n•Competition in General. There are risks inherent in the market for business application software and related services, which has been and continues to be intensely competitive; for example, some of our competitors may become more aggressive with their prices and/or payment terms, which may adversely affect our profit margins.\nFor more information, please see “Risk Factors” in Item 1A. above.\nRecent Accounting Pronouncements\nFor information with respect to recent accounting pronouncements, if any, and the impact of these pronouncements on our consolidated financial statements, if any, see Note 1(n) of Notes to Consolidated Financial Statements included elsewhere in this Form 10-K.\nMarket Conditions by Operating Segment\nWe operate and manage our business in three segments based on software and services provided in three key product markets: (1) SCM, which provides collaborative supply chain solutions to streamline and optimize the production, distribution and management of products between trading partners; (2) IT Consulting, which consists of IT staffing and consulting services; and (3) Other, which consists of (i) American Software ERP, a provider of purchasing and materials management, customer order processing, financial, human resources, and manufacturing solutions, and (ii) unallocated corporate overhead expenses. The SCM segment includes the businesses of Logility and DMI.\nOur SCM segment experienced a 5% decrease in revenue during fiscal 2021 when compared to fiscal 2020, primarily due to a 60% decrease in license fees, a 17% decrease in professional services and other revenue and an 8% decrease in maintenance revenue partially offset by a 31% increase in subscription fees. Our SCM segment experienced a 10% increase in revenue during fiscal 2020 when compared to fiscal 2019, primarily due to a 57% increase in subscription fees, a 12% increase in professional services and other revenue and a 5% increase in license fees partially offset by a 5% decrease in maintenance revenue.\nOur IT Consulting segment experienced an approximately 6% increase in revenue in fiscal 2021 when compared to fiscal 2020 and a 10% decrease in revenue in fiscal 2020 when compared to fiscal 2019, due primarily to fluctuations in IT staffing work at our largest customer. As companies have moved to cut costs and limit IT budgets, they have utilized more outsourcing services, which tend to be more cost effective for them. In the past, this trend has resulted in increased business for this segment. However, there is a countervailing trend to outsource IT to international markets that historically have been more price competitive than domestic sources like us. Our largest consulting customer comprised 29% of our IT Consulting revenue in fiscal 2021, 33% in fiscal 2020 and 47% in fiscal 2019. The loss of this customer would negatively and materially affect our IT Consulting business.\nThe Other segment revenue decreased 14% in fiscal 2021 when compared to fiscal 2020, primarily due to a 93% decrease in license fees, a 13% decrease in professional services and other revenue and a 1% decrease in maintenance revenue. The Other segment revenue increased 2% in fiscal 2020 when compared to fiscal 2019, primarily due to a 70% increase in license fees and a 4% increase in professional services and other revenue, partially offset by a 6% decrease in maintenance revenue.\nREVENUE\nYears Ended April 30,\n2021 2020 2019 % Change % of Total Revenue\n2021 vs. 2020 2020 vs. 2019 2021 2020 2019\n(in thousands)\nSubscription fees $ 28,877 $ 22,033 $ 14,026 31 % 57 % 26 % 19 % 13 %\nLicense fees 2,993 7,582 7,126 (61) % 6 % 3 % 7 % 6 %\nProfessional service and other 39,616 42,774 42,154 (7) % 1 % 35 % 37 % 39 %\nMaintenance 39,922 43,077 45,400 (7) % (5) % 36 % 37 % 42 %\nTotal revenue $ 111,408 $ 115,466 $ 108,706 (4) % 6 % 100 % 100 % 100 %\nFor the year ended April 30, 2021, the 4% decrease in total revenue was attributable primarily to a 61% decrease in license revenue, a 7% decrease in professional services and other revenue and a 7% decrease in maintenance revenue partially offset by a 31% increase in subscription fees revenue.\nFor the year ended April 30, 2020, the 6% increase in total revenue was attributable primarily to a 57% increase in subscription fees revenue, a 6% increase in license revenue and a 1% increase in professional services and other revenue, partially offset by a 5% decrease in maintenance revenue.\nDue to intensely competitive markets, we discount subscription and license fees from our published list price due to pricing pressure in our industry. Numerous factors contribute to the amount of the discounts provided, such as previous customer purchases, the number of customer sites utilizing the software, the number of modules purchased and the number of users, the type of platform deployment, as well as the overall size of the contract. While all these factors affect the discount amount of a particular contract, the overall percentage discount has not materially changed in the recent reported fiscal periods.\nThe change in our revenue from period to period is primarily due to the volume of products and related services sold in any period and the amounts of products or modules purchased with each sale.\nInternational revenue represented approximately 15% of total revenue for the year ended April 30, 2021, 19% of total revenue for the year ended April 30, 2020, and 20% for the year ended April 30, 2019. Our international revenue may fluctuate substantially from period to period primarily because we derive these revenue from a relatively small number of customers.\nSubscription Fees Revenue\nYears Ended April 30,\n2021 2020 2019 % Change\n2021 vs. 2020 2020 vs. 2019\n(in thousands)\nSupply Chain Management $ 28,877 $ 22,033 $ 14,026 31 % 57 %\nTotal subscription fees revenue $ 28,877 $ 22,033 $ 14,026 31 % 57 %\nFor the year ended April 30, 2021, subscription fee revenue increased by 31% when compared to the same period in the prior year primarily due to an increase in Cloud Services Annual Contract Value (\"ACV\") of approximately 53% to $26.4 million compared to $17.3 million in the same period of the prior year. This increase was attributable to an increase in the number of contracts, contracts with a higher Cloud Services ACV, as well as an increase in the value of multi-year contracts (typically three to five years). This is evidence of our successful transition to the cloud subscription model. ACV is a forward-looking operating measure used by management to better understand Cloud Services (SaaS and other related cloud services) revenue trends within our business, as it reflects our current estimate of revenue to be generated under existing client contracts in the forward 12-month period.\nLicense Fees Revenue\nYears Ended April 30,\n2021 2020 2019 % Change\n2021 vs. 2020 2020 vs. 2019\n(in thousands)\nSupply Chain Management $ 2,977 $ 7,354 $ 6,992 (60) % 5 %\nOther 16 228 134 (93) % 70 %\nTotal license fees revenue $ 2,993 $ 7,582 $ 7,126 (61) % 6 %\nFor the year ended April 30, 2021, license fee revenue decreased by 61% when compared to the previous year. Our Other business segment experienced a 93% decrease in license fees for the year ended April 30, 2021 when compared to the same period in the prior year due to the timing of selling into the installed customer base. Our SCM segment experienced a 60% decrease in license fees primarily due to a decrease in the number of new customers choosing to deploy our software on-premise this year. We anticipate that the majority of future license fee sales will be to existing on-premise customers for add-on expansion. The SCM segment constituted 99%, 97% and 98% of our total license fee revenue for the years ended April 30, 2021, 2020 and 2019, respectively.\nFor the year ended April 30, 2020, license fee revenue increased by 6% when compared to the previous year. Our Other business segment experienced a 70% increase in license fees for the year ended April 30, 2020 when compared to the same period in the prior year due to the timing of selling into the installed customer base. SCM experienced a 5% increase in license fees primarily due to a few new customers choosing to deploy our software on-premise. SCM constituted 97% and 98% of our total license fee revenue for the years ended April 30, 2020 and 2019, respectively.\nThe direct sales channel provided approximately 83% of license fee revenue for the year ended April 30, 2021, compared to approximately 92% in fiscal 2020 and 84% in fiscal 2019. The decrease in direct license fees from fiscal 2020 to fiscal 2021 was largely due to one large license fee deal to a new customer last year compared to none this year. The increase in direct license fees from fiscal 2019 to fiscal 2020 was largely due to our indirect channel selling proportionately more SaaS than license contracts compared to our direct channel.\nFor the year ended April 30, 2021, our margins after commissions on direct sales were approximately 84%, and our margins after commissions on indirect sales were approximately 58%. For the year ended April 30, 2020, our margins after commissions on\ndirect sales were approximately 88%, and our margins after commissions on indirect sales were approximately 53%. For the year ended April 30, 2019, our margins after commissions on direct sales were approximately 87%, and our margins after commissions on indirect sales were approximately 55%. The margins after commissions for direct sales were relatively consistent, between 84% to 88%, while the range for indirect sales had a wider spread of 53% to 58%. The indirect channel margins for the fiscal year ended April 30, 2021 increased when compared to the same periods in the prior year due to the mix of value-added reseller (“VAR”) commission rates. DMI is responsible for the bulk of our indirect sales and the commission percentage varies based on whether the sale is domestic or international.\nProfessional Services and Other Revenue\nYears Ended April 30,\n2021 2020 2019 % Change\n2021 vs. 2020 2020 vs. 2019\n(in thousands)\nSupply Chain Management $ 19,713 $ 23,782 $ 21,190 (17) % 12 %\nIT Consulting 19,036 17,997 20,007 6 % (10) %\nOther 867 995 957 (13) % 4 %\nTotal professional services and other revenue $ 39,616 $ 42,774 $ 42,154 (7) % 1 %\nThe 7% decrease in total professional services and other revenue for the year ended April 30, 2021 was due to a 17% decrease in our SCM segment professional services due primarily due to lower implementation project work resulting from lower subscription and license fee sales in the first three quarters of fiscal 2021, combined with a 13% decrease in our Other segment due to lower utilization from project implementation services and services activity. This increase was partially offset by a 6% increase in our IT consulting segment due to the timing of project work.\nThe 1% increase in total professional services and other revenue for the year ended April 30, 2020 was due to a 12% increase from our SCM segment due primarily due to a ramp up of implementation project work resulting from increased subscription and license fee sales in recent periods, combined with a 4% increase in our Other segment due to utilization from project implementation services and services revenue. This increase was partially offset by an 10% decrease in our IT consulting segment due to the timing of project work.\nIn our software segments, we have observed that there is a tendency for professional services and other revenue to lag changes in license revenue by one to three quarters, as new licenses in one quarter often involve implementation and consulting services in subsequent quarters, for which we recognize revenue only as we perform those services.\nMaintenance Revenue\nYears Ended April 30,\n2021 2020 2019 % Change\n2021 vs. 2020 2020 vs. 2019\n(in thousands)\nSupply Chain Management $ 38,701 $ 41,848 $ 44,088 (8) % (5) %\nOther 1,221 1,229 1,312 (1) % (6) %\nTotal maintenance revenue $ 39,922 $ 43,077 $ 45,400 (7) % (5) %\nThe 7% decrease in total maintenance revenue for the year ended April 30, 2021 was due to a 1% decrease in our Other segment due to fewer customer renewals and an 8% decrease in maintenance revenue from our SCM segment due to normal customer attrition and customers converting from on-premise support to our SaaS cloud platform.\nThe 5% decrease in total maintenance revenue for the year ended April 30, 2020 was due to a 6% decrease in our Other segment due to fewer customer renewals and a 5% decrease in maintenance revenue from our SCM segment due to normal customer attrition.\nThe SCM segment’s maintenance revenue constituted 97% of total maintenance revenue for the years ended April 30, 2021, 2021, 2020 and 2019. Typically, our maintenance revenue has had a direct relationship to current and historic license fee revenue, since new licenses are the potential source of new maintenance customers.\nGROSS MARGIN\nThe following table provides both dollar amounts and percentage measures of gross margin:\nYears Ended April 30,\n2021 2020 2019\n(in thousands)\nGross margin on subscriptions fees $ 16,993 59 % $ 12,542 57 % 8,267 59 %\nGross margin on license fees 1,072 36 % 2,784 37 % 696 10 %\nGross margin on professional services and other 10,523 27 % 12,079 28 % 10,733 25 %\nGross margin on maintenance 32,392 81 % 35,753 83 % 37,044 82 %\nTotal gross margin $ 60,980 54 % $ 63,158 55 % $ 56,740 52 %\nThe total gross margin percentage for the year ended April 30, 2021 decreased to 54% when compared to the same period in the prior year due to decreases in gross margin percentage for professional services and other gross margins, license fees margins and maintenance gross margins, partially offset by an increase in subscription fees. The total gross margin percentage for the year ended April 30, 2020 increased to 55% when compared to the same period in the prior year due to increases in gross margin percentage for license fees, professional services and other gross margins and maintenance gross margins, partially offset by a decrease in subscription fees margins.\nGross Margin on Subscription Fees\nFor the year ended April 30, 2021, our gross margin percentage on subscription fees increased from 57% in fiscal 2020 to 59% primarily due to an increase in subscription revenue and lower capitalized software amortization expense.\nFor the year ended April 30, 2020, our gross margin percentage on subscription fees decreased from 59% in fiscal 2019 to 57% primarily due to an increase in capitalized software amortization expense.\nGross Margin on License Fees\nThe decrease in license fee gross margin percentage for the year ended April 30, 2021 when compared to fiscal 2020 was primarily due to lower license fee revenue.\nThe increase in license fee gross margin percentage for the year ended April 30, 2020 when compared to fiscal 2019 was primarily due to lower agent commission and amortization of intangibles expense and to a lesser extent higher license fee revenue.\nLicense fee gross margin percentage tends to be directly related to the level of license fee revenue due to the relatively fixed cost of capitalized software amortization expense, amortization of acquired software and the sales mix between our direct and indirect channels.\nGross Margin on Professional Services and Other\nFor the year ended April 30, 2021, our gross margin percentage on professional services and other decreased from 28% in fiscal 2020 to 27% primarily because our IT Consulting segment professional services and other revenue gross margin decreased from 18% in fiscal 2020 to 17% in fiscal 2021 due to a decrease in project utilization rates. Our other segment decreased from 53% in fiscal 2020 to 41% in fiscal 2021 due to a slower ramp up of project work. Our SCM segment professional services and other gross margin was 35% for both fiscal 2021 and fiscal 2020.\nFor the year ended April 30, 2020, our gross margin percentage on professional services and other increased from 25% in fiscal 2019 to 28% due to increased gross margins in our SCM segment which increased from 28% in fiscal 2019 to 35% in fiscal 2020 due to increased revenue and higher billing utilization. Our IT Consulting segment professional services and other revenue\ngross margin decreased from 22% in fiscal 2019 to 18% in fiscal 2020 due to a decrease in project related billing. Our other segment increased from 47% in fiscal 2019 to 53% in fiscal 2020 due to improved billing utilization rates.\nAs discussed above, our IT Consulting segment typically has lower margins when compared to the Other segments that have higher margin implementation service revenue. The IT Consulting segment was 48%, 42% and 47% of the Company’s professional services and other revenue in fiscal 2021, 2020 and 2019, respectively. Our SCM segment was 50%, 56% and 50% of the Company’s professional services and other revenue in fiscal 2021, 2020 and 2019, respectively. Our Other segment was 2%, 2% and 3% of the Company’s professional services and other revenue in fiscal 2021, 2020 and 2019, respectively.\nGross Margin on Maintenance\nMaintenance gross margin decreased to 81% in fiscal 2021 from 83% in fiscal 2020 due to lower maintenance revenue cost containment efforts. The primary cost component is maintenance staffing, which is relatively inelastic in the short term.\nMaintenance gross margin increased to 83% in fiscal 2020 from 82% in fiscal 2019 due to cost containment efforts. The primary cost component is maintenance staffing, which is relatively inelastic in the short term.\nEXPENSES\nYears Ended April 30,\n2021 2020 2019 % of Revenue\n2021 2020 2019\n(in thousands)\nResearch and development $ 16,964 $ 15,348 $ 13,078 15 % 13 % 12 %\nSales and marketing 20,304 21,958 20,992 18 % 19 % 19 %\nGeneral and administrative 19,139 19,519 17,006 17 % 17 % 16 %\nAmortization of acquisition-related intangible assets 212 285 388 - % - % - %\nOther income, net 4,487 750 2,365 4 % - % 2 %\nIncome tax expense 759 56 838 1 % - % 1 %\nResearch and Development\nGross product research and development costs include all non-capitalized and capitalized software development costs.\nA breakdown of the research and development costs is as follows:\nYears Ended April 30,\n2021 Percent\nChange 2020 Percent\nChange 2019\nTotal capitalized computer software development costs $ 620 (80) % $ 3,170 (47) % $ 5,961\nPercentage of gross product research and development costs 4 % 17 % 31 %\nTotal research and development expense 16,964 11 % 15,348 17 % 13,078\nPercentage of total revenue 15 % 13 % 12 %\nTotal research and development expense and capitalized computer software development costs $ 17,584 (5) % $ 18,518 (3) % $ 19,039\nPercentage of total revenue 16 % 16 % 18 %\nTotal amortization of capitalized computer software development costs* $ 4,215 (28) % $ 5,871 27 % $ 4,627\n______________\n* Included in cost of license fees and cost of subscription fees.\nFor the year ended April 30, 2021, gross product research and development costs and capitalized software development costs decreased by 5% primarily due to a decrease in headcount from third-party contractors compared to fiscal 2020. Capitalized software development costs decreased in fiscal 2021 compared to fiscal 2020 due to the timing of project work and an increase in agile software programming that accelerates the software releases to weeks from months. We expect capitalized software to be\nimmaterial in fiscal 2022. Amortization of capitalized software development decreased 28% in fiscal 2021 when compared to fiscal 2020 as some projects were fully amortized.\nFor the year ended April 30, 2020, gross product research and development costs and capitalized software development costs decreased by 3% primarily due to a decrease in headcount from third-party contractors compared to fiscal 2019. Capitalized software development costs decreased in fiscal 2020 compared to fiscal 2019 due to the timing of project work. Amortization of capitalized software development increased 27% in fiscal 2020 when compared to fiscal 2019 due to the timing of project releases.\nSales and Marketing\nFor the year ended April 30, 2021, the decrease in sales and marketing expenses compared to fiscal 2020 was due primarily to lower marketing spend, including a reduction in trade shows and conferences and lower travel costs due to COVID-19. Fiscal 2021 was impacted by COVID-19 for the entire year versus fiscal 2020.\nFor the year ended April 30, 2020, the increase in sales and marketing expenses compared to fiscal 2019 was due primarily to an increase in headcount, higher variable compensation, higher sales commissions, an increase in contractor costs and an increase in recruiting fees, which was partially offset by lower marketing spend and lower travel costs due to COVID-19.\nGeneral and Administrative\nFor the year ended April 30, 2021, general and administrative expenses remained relatively flat when compared to fiscal 2020 primarily due to a reduction in variable compensation, legal fees and cost containment efforts of overhead costs, partially offset by an increase in insurance and benefit expenses.\nFor the year ended April 30, 2020, the increase in general and administrative expenses compared to fiscal 2019 was primarily due to higher variable compensation and higher overhead costs and, to a lesser extent, higher legal, stock option and insurance costs.\nThe total number of employees was 424 on April 30, 2021, 428 on April 30, 2020 and 424 on April 30, 2019.\nAmortization of Acquisition-related Intangible Assets\nFor the year ended April 30, 2021, we recorded $0.8 million in intangible amortization expense, of which $0.2 million is included in operating expenses and $0.6 million is included in cost of license fees.\nFor the year ended April 30, 2020, we recorded $1.6 million in intangible amortization expense, of which $0.3 million is included in operating expenses and $1.3 million is included in cost of license fees.\nOperating Income/(Loss)\nYears Ended April 30,\n2021 2020 2019 % Change\n2021 vs. 2020 2020 vs. 2019\n(in thousands)\nSupply Chain Management $ 18,922 $ 19,612 $ 15,967 (4) % 23 %\nIT Consulting 456 332 964 37 % (66) %\nOther* (15,017) (13,896) (11,655) 8 % 19 %\nTotal Operating Income $ 4,361 $ 6,048 $ 5,276 (28) % 15 %\n______________\n* Includes certain unallocated expenses.\nOur SCM segment operating income decreased by 4% in fiscal 2021 compared to fiscal 2020 primarily due to a 5% decrease in revenue. Our SCM segment operating income increased by 23% in fiscal 2020 compared to fiscal 2019 primarily due to a 10% increase in revenue.\nOur IT Consulting segment operating income increased 37% in fiscal 2021 compared to fiscal 2020 primarily due to a 6% increase in revenue due to the type of project billing. Our IT Consulting segment operating income decreased 66% in fiscal 2020 compared to fiscal 2019 primarily due to a decrease in revenue and lower gross margins due to the type of project billing.\nThe increase in the Other segment operating loss in fiscal 2021 when compared to fiscal 2020 was due primarily to a 14% decrease in revenue and an increase in variable compensation and benefit costs. The increase in the Other segment operating loss in fiscal 2020 when compared to fiscal 2019 was due primarily to an increase in variable compensation and overhead costs, partially offset by a 2% increase in revenue in fiscal 2020.\nOther Income\nOther income is comprised of net interest and dividend income, rental income net of related depreciation expenses, exchange rate gains and losses, realized and unrealized gains and losses from investments. Other income was approximately $4.5 million in the year ended April 30, 2021 compared to $0.8 million in fiscal 2020. The increase was primarily due to unrealized gains of $3.6 million in fiscal 2021 compared to unrealized losses of $0.1 million for the same period last year, lower interest income of $0.4 million in fiscal 2021 compared to $1.5 million in fiscal 2020 and exchange rate gains of approximately $53,000 compared to losses of $605,000 for the same period last year.\nOther income was approximately $0.8 million in the year ended April 30, 2020 compared to $2.4 million in fiscal 2019. The decrease was primarily due to unrealized losses of $0.1 million in fiscal 2020 compared to unrealized gains of $1.0 million in fiscal 2019, lower interest income of $1.5 million in fiscal 2020 compared to $2.1 million in fiscal 2019 and higher exchange rate losses of approximately $605,000 compared to $486,000 for the same period last year.\nFor the years ended April 30, 2021 and 2020, our investments generated an annualized yield of approximately 1.7% and 1.4%, respectively.\nIncome Taxes\nDuring the year ended April 30, 2021, we recorded income tax expense of $759,000 compared to $56,000 in fiscal 2020 and $838,000 in fiscal 2019. Our effective income tax rate takes into account the source of taxable income by state and available income tax credits. Our effective tax rate was 8.6%, 1%, and 11% in fiscal 2021, 2020 and 2019, respectively. The effective tax rate for fiscal 2021 is higher compared to fiscal 2020 due to a decrease in the amount of excess tax benefits from stock option deductions and a decrease in foreign tax credits.\nOperating Pattern\nWe experience an irregular pattern of quarterly and annual operating results, caused primarily by fluctuations in both the number and size of software contracts received and delivered from quarter to quarter and our ability to recognize revenue in that quarter and annually in accordance with our revenue recognition policies. We expect this pattern to continue.\nLIQUIDITY AND CAPITAL RESOURCES\nSources and Uses of Cash\nWe have historically funded, and continue to fund, our operations and capital expenditures primarily with cash generated from operating activities. The changes in net cash that our operating activities provide generally reflect the changes in net earnings and non-cash operating items plus the effect of changes in operating assets and liabilities, such as investment trading securities, trade accounts receivable, trade accounts payable, accrued expenses and deferred revenue. We have no debt obligations or off-balance sheet financing arrangements, and therefore we used no cash for debt service purposes.\nThe following tables provide information about our cash flows and liquidity positions as of and for the fiscal years ended April 30, 2021, 2020 and 2019. You should read these tables and the discussion that follows in conjunction with our consolidated statements of cash flows contained in Item 8 of this report.\nYears ended\nApril 30,\n2021 2020 2019\n(in thousands)\nNet cash provided by operating activities $ 17,756 $ 25,982 $ 23,930\nNet cash used in investing activities (1,298) (3,590) (7,213)\nNet cash used in financing activities (7,614) (3,866) (8,223)\nNet change in cash and cash equivalents $ 8,844 $ 18,526 $ 8,494\nThe decrease in cash provided by operating activities in fiscal 2021 compared to fiscal 2020 was due primarily to: (1) a decrease in the net proceeds from sales and maturities of trading securities due to timing of sales and maturity dates, (2) unrealized\ngains on investments due to timing of sales of investments, (3) lower depreciation and amortization expense due to several capitalized software projects and intangible assets being fully amortized and (4) a lower increase in accounts payable and other liabilities during fiscal 2021, when compared to a higher increase in fiscal 2020 due primarily to timing and the amount of sales commissions and bonuses.\nThese factors were partially offset by: (1) a decrease in the purchases of trading securities due to timing, (2) the decrease in accounts receivable was more significant in fiscal 2020 compared to fiscal 2021 due to timing of sales and billing, (3) an increase in prepaid expenses and other assets in fiscal 2021 compared to the decrease in fiscal 2020 due to timing of purchases, (4) an increase in deferred revenue in fiscal 2021 when compared to fiscal 2020 primarily due to the timing of cloud and maintenance revenue recognition, (5) an increase in net earnings, (6) higher stock-based compensation expense in fiscal 2021 due to an increase in options granted and (7) a decrease in deferred income taxes in fiscal 2021 compared to fiscal 2020 due to timing.\nThe decrease in cash used in investing activities in fiscal 2021 compared to cash used in investing activities in fiscal 2020 was due to: a decrease in capitalized software development costs due to the timing of R&D efforts and partially offset by higher purchases of equipment.\nThe increase in cash used in financing activities in fiscal 2021 when compared to fiscal 2020 was due primarily to: a decrease in proceeds from exercise of stock options, partially offset by an increase in cash dividends paid on common stock in fiscal 2021 due to an increase in the number of shares outstanding.\nThe following table provides information regarding the changes in our total cash and investments position:\nAs of April 30,\n2021 2020\n(in thousands)\nCash and cash equivalents $ 88,658 $ 79,814\nInvestments 16,006 14,862\nTotal cash and investments $ 104,664 $ 94,676\nNet increase in total cash and investments 9,988 6,194\nAs of April 30, 2021, we had $104.7 million in total cash and investments with no outstanding debt, and believe that our sources of liquidity and capital resources will be sufficient to satisfy our presently anticipated requirements for working capital, capital expenditures and other corporate needs during at least the next twelve months. However, at some future date we may need to seek additional sources of capital to meet our requirements. If such need arises, we may be required to raise additional funds through equity or debt financing. We currently do not have a bank line of credit. We can provide no assurance that bank lines of credit or other financing will be available on terms acceptable to us. If available, such financing may result in dilution to our shareholders or higher interest expense.\nDays Sales Outstanding (\"DSO\") in accounts receivable were 85 and 78 days as of April 30, 2021 and April 30, 2020, respectively. Our current ratio on April 30, 2021 was 2.7 to 1, compared to 2.9 to 1 on April 30, 2020. DSO can fluctuate significantly on a quarterly basis due to a number of factors including the percentage of total revenue that comes from software license sales (which typically have installment payment terms), seasonality, shifts in customer buying patterns, the timing of customer payments and annual SaaS and maintenance renewals, lengthened contractual payment terms in response to competitive pressures, the underlying mix of products and services, and the geographic concentration of revenue.\nOn August 19, 2002, our Board of Directors approved a resolution authorizing the repurchase of up to 2.0 million shares of our Class A common stock. These repurchases have been and will be made through open market purchases at prevailing market prices. The timing of any repurchases will depend upon market conditions, the market price of our common stock and management’s assessment of our liquidity and cash flow needs. For this repurchase plan, through April 30, 2021, we have repurchased 1,053,679 shares of common stock at a cost of approximately $6.2 million. Under all repurchase plans as of April 30, 2021, we have repurchased 4,588,632 shares of common stock at a cost of approximately $25.6 million.\nOff-Balance Sheet Arrangements\nWe are not a party to any off-balance sheet arrangements that have, or are reasonably likely to have, a material current or future effect on our financial condition, revenue or expenses, results of operations, liquidity, capital expenditures or capital resources.\nSee Item 5 of this report, under the caption “Market for Registrant’s Common Equity, Related Stockholder Matters, and Issuer Purchases of Equity Securities.”",
    "item_7A": "ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nForeign Currency. For the fiscal years ended April 30, 2021 and 2020, we generated 15% and 19%, respectively, of our revenue outside of the United States. We typically denominate our international sales in U.S. dollars, euros or British pounds sterling. Our consolidated financial statements are presented in U.S. dollars, which is also the functional currency for our foreign operations. Where transactions may be denominated in foreign currencies, we are subject to market risk with respect to fluctuations in the relative value of currencies. We recorded exchange rate gains of approximately $0.1 million in fiscal 2021, compared to exchange rate losses of $0.6 million in fiscal 2020. We estimate that a 10% movement in foreign currency rates would have the effect of creating an exchange gain or loss of approximately $0.4 million for fiscal 2021.\nInterest Rates and Other Market Risks. We manage our interest rate risk by maintaining an investment portfolio of trading investments with high credit quality and relatively short average maturities. These instruments include, but are not limited to, money-market instruments, bank time deposits, and taxable and tax-advantaged variable rate and fixed rate obligations of corporations, municipalities, and national, state, and local government agencies. These instruments are denominated in U.S. dollars. The fair market value of our cash equivalents and investments increased 8% to approximately $97.7 million in fiscal 2021 from $90.1 million in the prior year.\nWe also hold cash balances in accounts with commercial banks in the United States and foreign countries. These cash balances represent operating balances only and are invested in short-term time deposits of the local bank. Such operating cash balances held at banks outside the United States are denominated in the local currency and are nominal.\nMany of our investments carry a degree of interest rate risk. When interest rates fall, our income from investments in variable-rate securities declines. When interest rates rise, the fair market value of our investments in fixed-rate securities declines. In addition, our investments in equity securities are subject to stock market volatility. Due in part to these factors, our future investment income may fall short of expectations or we may suffer losses in principal if forced to sell securities, which have seen a decline in market value due to changes in interest rates. We attempt to mitigate risk by holding fixed-rate securities to maturity, but if our liquidity needs force us to sell fixed-rate securities prior to maturity, we may experience a loss of principal. We believe that a 10% fluctuation in interest rates would not have a material effect on our financial condition or results of operations.",
    "item_8": "ITEM 8. CONSOLIDATED FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nManagement’s Report on Internal Control Over Financial Reporting\nReports of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of April 30, 2021 and 2020\nConsolidated Statements of Operations for the Years ended April 30, 2021, 2020 and 2019\nConsolidated Statements of Shareholders’ Equity for the Years ended April 30, 2021, 2020 and 2019\nConsolidated Statements of Cash Flows for the Years ended April 30, 2021, 2020 and 2019\nNotes to Consolidated Financial Statements\n(a) Management’s Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is a process designed by or under the supervision of our CEO and CFO, and used by our Board of Directors, management and other personnel to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. GAAP and includes those policies and procedures that:\n•Pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect our transactions and dispositions of our assets;\n•Provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. GAAP, and that receipts and expenditures are being made only in accordance with authorizations from our management and directors; and\n•Provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, there is a risk that material misstatements may not be prevented or detected on a timely basis by internal control over financial reporting. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur management, including our Chief Executive Officer, and President, as our Principal Executive Officer (“PEO”), assessed the effectiveness of our internal control over financial reporting as of April 30, 2021. In making this assessment, our management used the criteria set forth in Internal Control-Integrated Framework (2013) published by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on this assessment, our management, including our PEO, has concluded that our internal control over financial reporting was effective as of April 30, 2021.\nKPMG LLP, our independent registered public accounting firm, has issued an attestation report on the effectiveness of our internal control over financial reporting as of April 30, 2021, and this attestation report follows immediately below.\n(b) Report of Independent Registered Public Accounting Firm\nTo the Shareholders and Board of Directors\nAmerican Software, Inc.:\nOpinion on Internal Control Over Financial Reporting\nWe have audited American Software, Inc. and subsidiaries (the Company) internal control over financial reporting as of April 30, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of April 30, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of April 30, 2021 and 2020, the related consolidated statements of operations, shareholders’ equity, and cash flows for each of the years in the three-year period ended April 30, 2021, and the related notes and financial statement schedules II (collectively, the consolidated financial statements), and our report dated July 9, 2021 expressed an unqualified opinion on those consolidated financial statements.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ KPMG LLP\nAtlanta, Georgia\nJuly 9, 2021\n(c) Report of Independent Registered Public Accounting Firm\nTo the Shareholders and Board of Directors\nAmerican Software, Inc.:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of American Software, Inc. and subsidiaries (the Company) as of April 30, 2021 and 2020, the related consolidated statements of operations, shareholders’ equity, and cash flows for each of the years in the three-year period ended April 30, 2021, and the related notes and financial statement schedule II (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of April 30, 2021 and 2020, and the results of its operations and its cash flows for each of the years in the three-year period ended April 30, 2021, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of April 30, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission, and our report dated July 9, 2021 expressed an unqualified opinion on the effectiveness of the Company’s internal control over financial reporting.\nChange in Accounting Principle\nAs discussed in Note 7 to the consolidated financial statements, the Company has changed its method of accounting for leases in 2020 due to the adoption of ASU 2016-02, Leases, and related amendments.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nTesting of revenue\nAs discussed in Note 1 to the consolidated financial statements, the Company recognizes revenue when they transfer control of the promised goods or services to their customers, in an amount that reflects the consideration the Company expects to receive in exchange for those goods or services. The Company’s revenue consists of the following types of revenue streams: i) subscription fees, ii) license, iii) maintenance, and iv) professional services and other. Total revenue recorded by the Company amounted to $111.4 million.\nWe identified the sufficiency of audit evidence over the subscription fees, maintenance, and professional services and other revenue streams as a critical audit matter. Evaluating the sufficiency of audit evidence required subjective auditor judgment because of the large volume of data and the information technology (IT) applications utilized in the revenue recognition process to capture and aggregate the data.\nThe following are the primary procedures we performed to address this critical audit matter. Based on our knowledge of the Company, we applied auditor judgment to determine the nature and extent of procedures to be performed over revenue. Specifically, we:\n•evaluated the design and tested the operating effectiveness of certain internal controls related to the processing and recording of revenue, including general IT controls and IT application controls,\n•involved IT professionals with specialized skills and knowledge who assisted in the identification and testing of certain IT systems, including the design of audit procedures, used by the Company for the processing and recording of revenue,\n•recalculated the recorded revenue for a sample of transactions by comparing the amounts recognized for consistency with the Company’s accounting policies and underlying documentation, including contracts with customers and other relevant and reliable third-party data, and\n•confirmed key contract terms with customers for a selection of contracts.\nWe evaluated the sufficiency of the audit evidence obtained by assessing the results of the procedures performed over revenue.\n/s/ KPMG LLP\nWe have served as the Company’s auditor since 1982.\nAtlanta, Georgia\nJuly 9, 2021\nAmerican Software, Inc. and Subsidiaries\nConsolidated Balance Sheets\nApril 30, 2021 and 2020\n(in thousands, except share data)\n2021 2020\nASSETS\nCurrent assets:\nCash and cash equivalents $ 88,658 $ 79,814\nInvestments 16,006 14,161\nTrade accounts receivable, less allowance for doubtful accounts of $430 at April 30, 2021 and $264 at April 30, 2020:\nBilled 24,438 22,582\nUnbilled 2,201 2,425\nPrepaid expenses and other current assets 5,320 6,684\nTotal current assets 136,623 125,666\nInvestments-noncurrent - 701\nProperty and equipment, net 3,428 3,373\nCapitalized software, net 4,767 8,362\nGoodwill 25,888 25,888\nOther intangibles, net 360 1,132\nDeferred sales commissions - non-current 2,474 2,177\nLease right of use assets 1,454 2,053\nOther assets 2,163 1,941\nTotal assets $ 177,157 $ 171,293\nLIABILITIES AND SHAREHOLDERS’ EQUITY\nCurrent liabilities:\nAccounts payable $ 1,732 $ 1,643\nAccrued compensation and related costs 6,129 6,635\nDividends payable 3,615 3,547\nOperating lease obligation 739 763\nOther current liabilities 1,307 643\nDeferred revenue 37,142 34,227\nTotal current liabilities\n50,664 47,458\nDeferred income taxes 2,627 2,897\nLong-term operating lease obligations 821 1,424\nOther long-term liabilities 654 92\nTotal liabilities\n54,766 51,871\nShareholders’ equity:\nCommon stock:\nClass A, $0.10 par value. Authorized 50,000,000 shares: Issued and outstanding 35,629,566 (31,040,934, net) shares at April 30, 2021 and 35,000,649 (30,412,017, net) shares at April 30, 2020\n3,563 3,500\nClass B, $0.10 par value. Authorized 10,000,000 shares: Issued and outstanding 1,821,587 shares at April 30, 2021 and 1,821,587 shares at April 30, 2020; convertible into Class A shares on a one-for-one basis\n182 182\nAdditional paid-in capital 159,492 150,312\nRetained deficit (15,287) (9,013)\nClass A treasury stock, 4,588,632 shares at April 30, 2021 and 4,588,632 shares at April 30, 2020, at cost\n(25,559) (25,559)\nTotal shareholders’ equity 122,391 119,422\nCommitments and contingencies\nTotal liabilities and shareholders’ equity $ 177,157 $ 171,293\nSee accompanying notes to consolidated financial statements.\nAmerican Software, Inc. and Subsidiaries\nConsolidated Statements of Operations\nYears ended April 30, 2021, 2020, and 2019\n(in thousands, except per share data)\n2021 2020 2019\nRevenue:\nSubscriptions fees $ 28,877 $ 22,033 $ 14,026\nLicense 2,993 $ 7,582 7,126\nProfessional services and other 39,616 42,774 42,154\nMaintenance 39,922 43,077 45,400\nTotal revenue 111,408 115,466 108,706\nCost of revenue:\nSubscriptions fees 11,884 9,491 5,759\nLicense 1,921 $ 4,798 6,430\nProfessional services and other 29,093 30,695 31,421\nMaintenance 7,530 7,324 8,356\nTotal cost of revenue 50,428 52,308 51,966\nGross margin 60,980 63,158 56,740\nResearch and development 16,964 15,348 13,078\nSales and marketing 20,304 21,958 20,992\nGeneral and administrative 19,139 19,519 17,006\nAmortization of acquisition-related intangibles 212 285 388\nTotal operating expenses 56,619 57,110 51,464\nOperating income 4,361 6,048 5,276\nOther income (expense):\nInterest income 409 1,524 2,092\nOther, net 4,078 (774) 273\nEarnings before income taxes 8,848 6,798 7,641\nIncome tax expense 759 56 838\nNet earnings $ 8,089 $ 6,742 $ 6,803\nEarnings per common share:(a)\nBasic $ 0.25 $ 0.21 $ 0.22\nDiluted $ 0.24 $ 0.21 $ 0.22\nShares used in the calculation of earnings per common share:\nBasic 32,559 31,747 30,950\nDiluted 33,169 32,367 31,378\n(a)Diluted per share amounts for Class A shares are shown above. Diluted per share for Class B shares under the two-class method are $0.25, $0.22 and $0.22 for the years ended April 30, 2021, 2020 and 2019, respectively. See Note 1 to the Consolidated Financial Statements.\nSee accompanying notes to consolidated financial statements.\nAmerican Software, Inc. and Subsidiaries\nConsolidated Statements of Shareholders’ Equity\nYears ended April 30, 2021, 2020, and 2019\n(in thousands, except share data)\nCommon stock Additional\npaid-in\ncapital Retained\nearnings/deficit Treasury\nstock Total\nshareholders’\nequity\nClass A Class B\nShares Amount Shares Amount\nBalance at April 30, 2018 33,141,764 $ 3,314 2,057,390 $ 205 $ 131,258 $ 3,366 $ (25,559) $ 112,584\nCumulative effect of the adoption of Topic 606\n- - - - - 1,753 - 1,753\nProceeds from stock options exercised 602,176 61 - - 5,306 - - 5,367\nConversion of Class B shares into Class A shares 235,799 23 (235,803) (23) - - - -\nStock-based compensation - - - - 1,751 - - 1,751\nNet earnings - - - - - 6,803 - 6,803\nDividends declared ($0.44 per share)\n- - - - - (13,651) - (13,651)\nBalance at April 30, 2019 33,979,739 3,398 1,821,587 182 138,315 (1,729) (25,559) 114,607\nProceeds from stock options exercised 1,020,910 102 - - 9,970 - - 10,072\nStock-based compensation - - - - 2,027 - - 2,027\nNet earnings - - - - - 6,742 - 6,742\nDividends declared ($0.44 per share)\n- - - - - (14,026) - (14,026)\nBalance at April 30, 2020 35,000,649 3,500 1,821,587 182 150,312 (9,013) (25,559) 119,422\nProceeds from stock options exercised 628,917 63 - - 6,634 - - 6,697\nStock-based compensation - - - - 2,546 - - 2,546\nNet earnings - - - - - 8,089 - 8,089\nDividends declared* ($0.44 per share)\n- - - - - (14,363) - (14,363)\nBalance at April 30, 2021 35,629,566 $ 3,563 1,821,587 $ 182 $ 159,492 $ (15,287) $ (25,559) $ 122,391\nSee accompanying notes to consolidated financial statements.\n*Amounts adjusted for rounding\nAmerican Software, Inc. and Subsidiaries\nConsolidated Statements of Cash Flows\nYears ended April 30, 2021, 2020, and 2019\n(in thousands)\n2021 2020 2019\nCash flows from operating activities:\nNet earnings $ 8,089 $ 6,742 $ 6,803\nAdjustments to reconcile net earnings to net cash provided by operating activities:\nDepreciation and amortization 5,610 8,103 7,719\nStock-based compensation expense 2,546 2,027 1,751\nNet (gain) loss on investments (3,569) 563 (373)\nNet gain on sale of fixed assets - - (4)\nDeferred income tax (benefit) expense (270) (609) 320\nChanges in operating assets and liabilities, net of effects of acquisition:\nPurchases of trading securities (1,294) (22,433) (10,254)\nProceeds from sales and maturities of trading securities 3,718 34,202 18,447\nAccounts receivable, net (1,632) (4,712) 2,165\nPrepaid expenses and other assets 845 (1,537) 536\nAccounts payable and other liabilities 799 2,692 (3,611)\nDeferred revenue 2,914 944 431\nNet cash provided by operating activities 17,756 25,982 23,930\nCash flows from investing activities:\nCapitalized computer software development costs (620) (3,170) (5,961)\nPurchases of property and equipment, net of disposals (678) (420) (1,252)\nNet cash used in investing activities (1,298) (3,590) (7,213)\nCash flows from financing activities:\nProceeds from exercise of stock options 6,697 10,072 5,367\nDividends paid (14,311) (13,938) (13,590)\nNet cash used in financing activities (7,614) (3,866) (8,223)\nNet change in cash and cash equivalents 8,844 18,526 8,494\nCash and cash equivalents at beginning of year 79,814 61,288 52,794\nCash and cash equivalents at end of year $ 88,658 $ 79,814 $ 61,288\nSupplemental disclosures of cash paid during the year for:\nIncome taxes $ 518 $ 544 $ 516\nSupplemental disclosures of noncash operating, investing and financing activities:\nAccrual of dividends payable $ 3,615 $ 3,547 $ 3,434\nSee accompanying notes to consolidated financial statements.\nAmerican Software, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nApril 30, 2021, 2020, and 2019\n(1) Presentation and Summary of Significant Accounting Policies\n(a) Basis of Presentation\nFounded in 1970 and headquartered in Atlanta, Georgia, American Software, Inc. and its subsidiaries (collectively, the “Company”) are engaged in the development, marketing, and support activities of a broad range of computer business application software products. The Company’s operations are principally in the computer software industry, and its products and services are used by customers within the United States and certain international markets. We provide our software solutions through three major business segments, which are further broken down into a total of six major product and service groups. The three operating segments are: (1) Supply Chain Management (“SCM”), (2) Information Technology Consulting (“IT Consulting”) and (3) Other.\n•The SCM segment consists of Logility, Inc. (see Note 9), which provides collaborative supply chain solutions to streamline and optimize the production, distribution and management of products between trading partners, as well as Demand Management, Inc., a wholly-owned subsidiaries of Logility.\n•The IT Consulting segment consists of The Proven Method, Inc., an IT staffing and consulting services firm.\n•The Other segment consists of (i) American Software ERP, which provides purchasing and materials management, customer order processing, financial, e-commerce and traditional manufacturing solutions, and (ii) unallocated corporate overhead expenses.\n(b) Principles of Consolidation\nThe consolidated financial statements include the accounts of American Software, Inc. and its wholly-owned subsidiaries. All significant intercompany balances and transactions have been eliminated in consolidation.\n(c) Revenue Recognition\nIn accordance with the Financial Accounting Standards Board (\"FASB\") issued Accounting Standards Update (“ASU”) No. 2014-09, Revenue from Contracts with Customers (Topic 606), we recognize revenue when we transfer control of the promised goods or services to our customers, in an amount that reflects the consideration we expect to receive in exchange for those goods or services. We derive our revenue from software licenses, maintenance services, consulting, implementation and training services, and Software-as-a-Service (“SaaS”), which includes a subscription to our software as well as support, hosting and managed services.\nThe Company determines revenue recognition through the following steps:\nStep 1 - Identification of the Contract with the Customer\nStep 2 - Identification of Promised Goods and Services and Evaluation of Whether the Promised Goods and Services are Distinct Performance Obligations\nStep 3 - Determination of the Transaction Price\nStep 4 - Allocation of the Transaction Price to Distinct Performance Obligations\nStep 5 - Attribution of Revenue for Each Distinct Performance Obligation\nNature of Products and Services.\nLicense. Our perpetual software licenses provide the customer with a right to use the software as it exists at the time of purchase. We recognize revenue for distinct software licenses once the license period has begun and we have made the software available to the customer.\nOur perpetual software licenses are sold with maintenance under which we provide customers with telephone consulting, product updates on a when and if available basis, and releases of new versions of products previously purchased by the customer, as well as error reporting and correction services.\nSubscription. Subscription fees include Software-as-a-Service (\"SaaS\") revenue for the right to use the software for a limited period of time in an environment hosted by the Company or by a third party. The customer accesses and uses the software on an as needed basis over the Internet or via a dedicated line; however, the customer has no right to take delivery of the software. The underlying arrangements typically include a single fee for the service that is billed monthly, quarterly or annually. The Company’s SaaS solutions represent a series of distinct services that are substantially the same and have the same pattern of transfer to the customer. Revenue from a SaaS solution is generally recognized ratably over the term of the arrangement.\nProfessional Services and Other. Our professional services revenue consists of fees generated from consulting, implementation and training services, including reimbursements of out-pocket expenses in connection with our services. These services are typically optional to our customers, and are distinct from our software. Fees for our professional services are separately priced and are generally billed on an hourly basis, and revenue is recognized over time as the services are performed. We believe the output method of hours worked provides the best depiction of the transfer of our services since the customer is receiving the benefit from our services as the work is performed. Reimbursements received from customers for out-of-pocket expenses were recorded in revenue and totaled approximately $20,000, $1.5 million, and $1.4 million for 2021, 2020 and 2019, respectively.\nMaintenance and Support. Revenue is derived from maintenance and support services, under which we provide customers with telephone consulting, product updates on a when and if available basis, and releases of new versions of products previously purchased by the customer, as well as error reporting and correction services. Maintenance for perpetual licenses is renewable, generally on an annual basis, at the option of the customer. Maintenance terms typically range from one to three years. Revenue related to maintenance is generally paid in advance and recognized ratably over the term of the agreement since the Company is standing ready to provide a series of maintenance services that are substantially the same each period over the term; therefore, time is the best measure of progress. Support services for subscriptions are included in the subscription fees and are recognized as a component of such fees.\nIndirect Channel Revenue. We record revenue from sales made through the indirect sales channels on a gross basis, because we control the goods or services and act as the principal in the transaction. In reaching this determination, we evaluate sales through our indirect channel on a case-by-case basis and consider a number of factors including indicators of control such as the party having the primary responsibility to provide specified goods or services, and the party having discretion in establishing prices.\nSales Taxes. We account for sales taxes collected from customers on a net basis.\nSignificant Judgments. Many of our contracts include multiple performance obligations. Our products and services generally do not require a significant amount of integration or interdependency; therefore, our products and services are generally not combined. We allocate the transaction price for each contract to each performance obligation based on the relative standalone selling price (SSP) for each performance obligation within each contract.\nWe use judgment in determining the SSP for products and services. For substantially all performance obligations except on-premise licenses, we are able to establish SSP based on the observable prices of products or services sold separately in comparable circumstances to similar customers. We typically establish an SSP range for our products and services which is reassessed on a periodic basis or when facts and circumstances change. Our on-premise licenses have not historically been sold on a standalone basis, as the vast majority of all customers elect to purchase on-premise license support contracts at the time of a on-premise license purchase. Support contracts are generally priced as a percentage of the net fees paid by the customer to access the on-premise license. We are unable to establish the SSP for our on-premise licenses based on observable prices given the same products are sold for a broad range of amounts (that is, the selling price is highly variable) and a representative SSP is not discernible from past transactions or other observable evidence. As a result, the SSP for a on-premise license included in a contract with multiple performance obligations is determined by applying a residual approach whereby all other performance obligations within a contract are first allocated a portion of the transaction price based upon their respective SSPs, with any residual amount of transaction price allocated to on-premise license revenue.\nContract Balances. Timing of invoicing to customers may differ from timing of revenue recognition and these timing differences result in unbilled accounts receivables or contract liabilities (deferred revenue) on the Company’s consolidated balance sheets. Fees for our software licenses are generally due within 30 days of contract execution. We have an established history of collecting under the terms of our software license contracts without providing refunds or concessions to our customers. SaaS solutions and maintenance are typically billed in advance on a monthly, quarterly, or annual basis. Services are typically billed as\nperformed. In instances where the timing of revenue recognition differs from the timing of invoicing, we have determined that our contracts generally do not include a significant financing component. The primary purpose of our invoicing terms is to provide customers with predictable ways to purchase our software and services, not to provide or receive financing. Additionally, we are applying the practical expedient to exclude any financing component from consideration for any contracts with payment terms of one year or less since we rarely offer terms extending beyond one year. The consideration in our customer contracts is fixed.\nWe have an unconditional right to consideration for all goods and services transferred to our customers. That unconditional right to consideration is reflected in billed and unbilled accounts receivable in the accompanying consolidated balance sheets in accordance with ASC Topic 606.\nDeferred revenue consists of amounts collected prior to having completed the performance of maintenance, SaaS, hosting, and managed services. We typically invoice customers for cloud subscription and support fees in advance on a monthly, quarterly or annual basis, with payment due at the start of the cloud subscription or support term. During the twelve months ended April 30, 2021, the Company recognized $33.0 million of revenue that was included in the deferred revenue balance as of April 30, 2020.\nYears ended April 30,\n2021 2020\n(in thousands)\nDeferred revenue, current $ 37,142 $ 34,227\nDeferred revenue, long-term* 540 -\nTotal deferred revenue $ 37,682 $ 34,227\n*Included in other long-term liabilities on the accompanying consolidated balance sheet\nRemaining Performance Obligations. A performance obligation is a promise in a contract to transfer a distinct good or service to the customer and is the unit of account under Topic 606. The transaction price is allocated to each distinct performance obligation and recognized as revenue when, or as, the performance obligation is satisfied by transferring the promised good or service to the customer. The Company identifies and tracks the performance obligations at contract inception so that the Company can monitor and account for the performance obligations over the life of the contract. Remaining performance obligations represent the transaction price of orders for which products have not been delivered or services have not been performed. As of April 30, 2021, the aggregate amount of the transaction price allocated to remaining performance obligations was approximately $116.0 million. The Company expects to recognize revenue on approximately 46% of the remaining performance obligations over the next 12 months, with the remainder recognized thereafter.\nDisaggregated Revenue. The Company disaggregates revenue from contracts with customers by geography, as it believes it best depicts how the nature, amount, timing and uncertainty of revenue and cash flows are affected by economic factors.\nThe Company’s revenue by geography is as follows:\nYears ended April 30,\n2021 2020\n(in thousands)\nRevenue:\nDomestic $ 94,676 $ 93,332\nInternational 16,732 22,134\n$ 111,408 $ 115,466\nPractical Expedients and Exemptions. There are several practical expedients and exemptions allowed under Topic 606\nthat impact the timing of revenue recognition and the Company’s disclosures. Below is a list of practical expedients the Company applies in the application of Topic 606:\n•The Company does not evaluate a contract for a significant financing component if payment is expected within one year or less from the transfer of the promised items to the customer.\n•The Company does not disclose the value of unsatisfied performance obligations for contracts for which the Company recognizes revenue at the amount to which it has the right to invoice for services performed (this applies to time-and-material engagements).\nContract Costs. The Company capitalizes the incremental costs of obtaining a contract with a customer if the Company expects to recover those costs. The incremental costs of obtaining a contract are those that the Company incurs to obtain a contract with a customer that it would not have incurred if the contract had not been obtained (for example, a sales commission). The Company capitalizes the costs incurred to fulfill a contract only if those costs meet all of the following criteria:\n•The costs relate directly to a contract or to an anticipated contract that the Company can specifically identify.\n•The costs generate or enhance resources of the Company that will be used in satisfying (or in continuing to satisfy) performance obligations in the future.\n•The costs are expected to be recovered.\nCertain sales commissions incurred by the Company were determined to be incremental costs to obtain the related contracts, which are deferred and amortized ratably over the economic benefit period for license and term subscriptions. These deferred commission costs are classified as current or non-current based on the timing of when the Company expects to recognize the expense. The current and non-current portions of deferred commissions are included in prepaid expenses and other current assets and deferred sales commissions in long-term assets, respectively, in the Company’s consolidated balance sheets. Total deferred commissions at April 30, 2021 and April 30, 2020 were $3.9 million and $3.5 million, respectively. Amortization of sales commissions was $2.0 million for year ended April 30, 2021, which is included in sales and marketing expense in the accompanying consolidated statements of operations. During the fiscal 2021 and 2020 impairment analyses, no losses were recognized.\nUnbilled Accounts Receivable. The unbilled receivable balance consists of amounts generated from license fee and services revenue. At April 30, 2021 and 2020, unbilled license fees were approximately $0.7 million and $1.3 million, respectively, and unbilled services revenue was approximately $1.5 million and $1.1 million, respectively. Unbilled license fee accounts receivable represents revenue that has been recognized but under the terms of the license agreements, which include specified payment terms that are considered normal and customary, certain payments have not yet been invoiced to the customers. Unbilled services revenue primarily occurs due to the timing of the billings, which occur subsequent to the end of each reporting period.\n(d) Cost of Revenue\nCost of revenue for licenses includes amortization of developed technology and capitalized computer software development costs, salaries and benefits and value-added reseller (\"VAR\") commissions. Costs for maintenance and services revenue includes the cost of personnel to conduct implementations, customer support and consulting, and other personnel-related expenses as well as agent commission expenses related to maintenance revenue generated by the indirect channel. Costs for subscriptions revenue includes amortization of developed technology and capitalized computer software development costs, third-party hosting costs, salaries and benefits and value-added reseller (\"VAR\") commissions. Commission costs for maintenance are deferred and amortized over the related maintenance term. Commission costs for subscriptions are deferred and amortized over the related subscription term.\n(e) Cash Equivalents\nCash equivalents of $81.7 million and $75.3 million at April 30, 2021 and 2020, respectively, consist of overnight repurchase agreements and money market deposit accounts. The Company considers all such investments with original maturities of three months or less to be cash equivalents for purposes of the consolidated statements of cash flows.\n(f) Concentrations of Credit Risk\nFinancial instruments that potentially subject the Company to significant concentrations of credit risk consist principally of cash and cash equivalents, short- and long-term investments and accounts receivable. The Company maintains cash and cash equivalents and short- and long-term investments with various financial institutions. The Company’s sales are primarily to companies located in North America and Europe. The Company performs periodic credit evaluations of its customers’ financial condition and does not require collateral. Accounts receivable are due principally from companies under stated contract terms.\n(g) Returns and Allowances\nThe Company has not experienced significant returns or warranty claims to date and, as a result, the allowance for the cost of returns and product warranty claims at April 30, 2021 and 2020 is not material.\nThe Company records an allowance for doubtful accounts based on the historical experience of write-offs and a detailed assessment of accounts receivable. The total amounts of expense to operations were approximately $0, $97,000, and $0 for fiscal 2021, 2020, and 2019, respectively, which are included in general and administrative expenses in the accompanying consolidated statements of operations. In estimating the allowance for doubtful accounts, management considers the age of the accounts receivable, the Company’s historical write-offs, and the credit worthiness of the customer, among other factors. Should any of these factors change, the estimates made by management will also change accordingly, which could affect the level of the Company’s future provision for doubtful accounts. Uncollectible accounts are written off when it is determined that the specific balance is not collectible.\n(h) Investments\nInvestments consist of commercial paper, corporate bonds, government securities, certificates of deposits and marketable equity securities. The Company accounts for its investments in accordance with the Investments - Debt Securities (Topic 320) and Investments-Equity Securities (Topic 321). The Company has classified its investment portfolio as “trading.” “Trading” securities are bought and held principally for the purpose of selling them in the near term and are recorded at fair value. Unrealized gains and losses on trading securities are included in the determination of net earnings. For the purposes of computing realized gains and losses, cost is identified on a specific identification basis. Investments with maturities less than one year as of the consolidated balance sheet date are classified as short-term investments and those that mature greater than one year are classified as long-term investments.\n(i) Property and Equipment\nProperty and equipment are recorded at cost, less accumulated depreciation and amortization. Depreciation of buildings, computer equipment, purchased computer software, office furniture and equipment is calculated using the straight-line method based upon the estimated useful lives of the assets (three years for computer equipment and software, seven years for office furniture and equipment, fifteen years for building improvements and thirty years for buildings). Leasehold improvements are amortized using the straight-line method over the estimated useful lives of the assets or the related lease term, whichever is shorter. Depreciation and amortization expense on buildings, furniture, equipment and purchased computer software was $0.6 million, $0.6 million, and $0.7 million in 2021, 2020, and 2019, respectively.\n(j) Capitalized Computer Software Development Costs\nThe Company capitalizes certain computer software development costs in accordance with the Costs of Software to be Sold, Leased or Marketed under ASC 985-20. Costs incurred internally to create a computer software product or to develop an enhancement to an existing product are charged when incurred as research and development expense until technological feasibility for the respective product is established. Thereafter, software development costs are capitalized and reported at the lower of unamortized cost or net realizable value. Capitalization ceases when the product or enhancement is available for general release to customers. The Company makes ongoing evaluations of the recoverability of its capitalized software projects by comparing the net amount capitalized for each product to the estimated net realizable value of the product. If such evaluations indicate that the unamortized software development costs exceed the net realizable value, the Company writes off the amount by which the unamortized software development costs exceed net realizable value. Capitalized computer software development costs are amortized ratably based on the projected revenue associated with the related software or on a straight-line basis over three years, whichever method results in a higher level of amortization. Amortization of capitalized computer software development costs is included in the cost of license and subscription revenue in the consolidated statements of operations.\nTotal Expenditures and Amortization. Total expenditures for capitalized computer software development costs, total research and development expense, and total amortization of capitalized computer software development costs are as follows:\nYears ended April 30,\n2021 2020 2019\n(in thousands)\nTotal capitalized computer software development costs $ 620 $ 3,170 $ 5,961\nTotal research and development expense 16,964 15,348 13,078\nTotal research and development expense and capitalized computer software-development costs $ 17,584 $ 18,518 $ 19,039\nTotal amortization of capitalized computer software development costs $ 4,215 $ 5,871 $ 4,627\nCapitalized computer software development costs consist of the following at April 30, 2021 and 2020 (in thousands):\n2021 2020\nCapitalized computer software development costs $ 43,593 $ 42,973\nAccumulated amortization (38,826) (34,611)\n$ 4,767 $ 8,362\nOf the Company’s capitalized software projects that are currently completed and being amortized, the Company expects amortization expense for the next three years to be as follows (in thousands):\n2022 $ 3,154\n2023 1,156\n2024 340\n$ 4,650\n(k) Acquisition-Related Intangible Assets (exclusive of Logility’s treasury stock repurchases)\nAcquisition-related intangible assets are stated at historical cost and include acquired software and certain other intangible assets with definite lives. Intangible assets are being amortized over a period ranging from one to eight years. For 2021, total amortization expense related to acquisition-related intangible assets was approximately $0.8 million, with $0.2 million included in operating expense and $0.6 million included in cost of license fees in the accompanying consolidated statements of operations. For 2020, total amortization expense related to acquisition-related intangible assets was approximately $1.6 million, with $0.3 million included in operating expense and $1.3 million included in cost of license fees in the accompanying consolidated statements of operations. For 2019, total amortization expense related to acquisition-related intangible assets was approximately $2.4 million, with $0.4 million included in operating expense and $2.0 million included in cost of license fees in the accompanying consolidated statements of operations.\nAcquisition-Related Intangible Assets consist of the following at April 30, 2021 and 2020 (in thousands):\nWeighted\nAverage\nAmortization\nin Years 2021 2020\nCurrent technology 3 $ 6,000 $ 6,000\nCustomer relationships 8 1,700 1,700\nNon-compete 3 100 100\nTrademarks 3 340 340\n8,140 8,140\nAccumulated amortization (7,780) (7,008)\n$ 360 $ 1,132\nThe Company expects amortization expense for the next five years to be as follows based on intangible assets as of April 30, 2021 (in thousands):\n2022 $ 212\n2023 52\n2024 38\n2025 38\nThereafter 20\n$ 360\n(l) Goodwill and Other Intangibles\nGoodwill represents the excess of costs over fair value of assets of businesses acquired. Goodwill and intangible assets acquired in a purchase business combination and determined to have an indefinite useful life are not amortized, but instead are tested for impairment at least annually in accordance with the FASB issued Accounting Standards Update (“ASU”) No. 2017-04 Intangibles-Goodwill and Other (Topic 350). The Company evaluates the carrying value of goodwill annually and between annual evaluations if events occur or circumstances change that would more likely than not reduce the fair value of the reporting unit below its carrying amount. Such circumstances could include, but are not limited to, (1) a significant adverse change in legal factors or in business climate, (2) unanticipated competition, or (3) an adverse action or assessment by a regulator.\nWhen evaluating whether the goodwill is impaired, the Company compares the fair value of the reporting unit to which the goodwill is assigned to its carrying amount, including goodwill. The Company identifies the reporting unit on a basis that is similar to its method for identifying operating segments as defined by the Segment Reporting Topic of the FASB ASC. If the carrying amount of a reporting unit exceeds its fair value, then the amount of the impairment loss must be measured. This evaluation is applied annually on each impairment testing date (April 30) unless there is a triggering event present during an interim period.\nFor the years ended April 30, 2021 and 2020, the Company performed a qualitative assessment based on economic, industry and company-specific factors as the initial step in the annual goodwill impairment test for all reporting units. Based on the results of the qualitative assessment, companies are only required to perform Step 1 of the annual impairment test for a reporting unit if the company concludes that it is more likely than not that the unit’s fair value is less than its carrying amount. To the extent the Company concludes it is more likely than not that a reporting unit’s estimated fair value is less than its carrying amount, the two-step approach is applied. The first step would require a comparison of each reporting unit’s fair value to the respective carrying value. If the carrying value exceeds the fair value, a second step is performed to measure the amount of impairment loss, if any. The Company did not identify any macroeconomic or industry conditions as of April 30, 2021, that would indicate the fair value of the reporting units were more likely than not to be less than their respective carrying values. If circumstances change or events occur to indicate it is more likely than not that the fair value of any reporting units have fallen below their carrying value, the Company would test such reporting unit for impairment.\nIntangible assets with estimable useful lives are required to be amortized over their respective estimated useful lives to their estimated residual values, and reviewed for impairment in accordance with the (ASU) No. 2011-10, Property, Plant and Equipment (Topic 360).\nGoodwill consisted of the following by segment (in thousands):\nSupply Chain\nManagement* IT\nConsulting Other Total\nBalance at April 30, 2019 $ 25,888 $ - $ - $ 25,888\nBalance at April 30, 2020 25,888 - - 25,888\nBalance at April 30, 2021 $ 25,888 $ - $ - $ 25,888\n* Goodwill related to Logility, Inc., Demand Management, Inc. and their acquisitions.\nIntangible Assets (including Acquisition-Related Intangible Assets) consisted of the following by segment (in thousands):\nIT\nConsulting Other Total\nBalance at April 30, 2019 $ 2,732 $ - $ - $ 2,732\nAmortization expense (1,600) - - (1,600)\nBalance at April 30, 2020 1,132 - - 1,132\nAmortization expense (772) - - (772)\nBalance at April 30, 2021 $ 360 $ - $ - $ 360\n(m) Income Taxes\nThe Company accounts for income taxes using the asset and liability method. Under the asset and liability method, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases and operating loss and tax credit carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date.\n(n) Recent Accounting Pronouncements\nIn January 2017, the FASB issued ASU 2017-04, Intangibles-Goodwill and Other (Topic 350): Simplifying the Test for Goodwill Impairment, which simplifies the subsequent measurement of goodwill to eliminate Step 2 from the goodwill impairment test. In addition, it eliminates the requirements for any reporting unit with a zero or negative carrying amount to perform a qualitative assessment and, if it fails that qualitative test, to perform Step 2 of the goodwill impairment test. Therefore, the same impairment assessment applies to all reporting units. ASU 2017-04 is effective for the Company’s fiscal year beginning May 1, 2020. The new guidance is required to be applied on a prospective basis. The adoption of ASU 2017-04 did not have a material impact on the Company's consolidated financial statements.\nIn August 2018, the FASB issued ASU 2018-15, Intangibles - Goodwill and Other - Internal-Use Software (Subtopic 350-40): Customer's Accounting for Implementation Costs Incurred in a Cloud Computing Arrangement that is a Service Contract (A Consensus of the FASB Emerging Issues Task Force). ASU 2018-15 provides additional guidance on the accounting for costs of implementation activities performed in a cloud computing arrangement (i.e., hosting arrangement) that is a service contract. The new guidance amends the definition of a hosting arrangement and requires a customer in a hosting arrangement that is a service contract to capitalize certain implementation costs following the internal use software capitalization criteria within Accounting Standards Codification (\"ASC\") Subtopic 350-40.\nWe adopted ASU 2018-15 on May 1, 2020, applying the guidance prospectively, and the adoption of this standard did not have an impact on our consolidated financial statements. Historically we have not capitalized implementation costs associated with cloud computing arrangements that are service contracts, following the guidance in Subtopic 350-40, but we will do so pursuant to the clarifications provided in the new guidance on a go forward basis.\nOn May 1, 2020, we adopted ASU 2016-13, Financial Instruments Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments, using the modified retrospective method applied for all financial assets measured at amortized cost. In estimating the allowance for credit losses, we considered the age of the accounts receivable, our historical write-offs, and the historical creditworthiness of the customer, among other factors. Should any of these factors change, the estimates made by us will also change accordingly, which could affect the level of our future allowances. We also analyzed future expected credit losses given ever present changes to future risks in projected economic conditions and future risks of customer collection. The net impact of the adoption of ASU 2016-13 on our consolidated financial statements was immaterial.\nRecent Accounting Pronouncements Not Yet Adopted\nIn December 2019, the FASB issued ASU 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes. The new guidance eliminates certain exceptions related to the approach for intra-period tax allocation, the methodology for calculating taxes for each quarter and the recognition of deferred tax liabilities for outside basis differences. This guidance also simplifies aspects of the accounting for franchise taxes and changes in tax laws or rates, as well as clarifies the accounting for transactions that result in a step-up in the tax basis of goodwill. ASU 2019-12 will be effective for the Company beginning May 1, 2021 and would require us to recognize a cumulative effect adjustment to the opening balance of reinvested earnings, if applicable. We do not expect our adoption of this guidance to have a material impact on our consolidated financial statements.\n(o) Use of Estimates\nThe preparation of these consolidated financial statements requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, and disclosures of contingent assets and liabilities, at the date of the consolidated financial statements and the reported amounts of revenue and expenses during the reporting period. On an ongoing basis, we evaluate our estimates, including, but not limited to, those related to revenue/reserves and allowances. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Our actual results could differ materially from these estimates under different assumptions or conditions.\n(p) Stock-Based Compensation\nThe Company has one stock-based employee compensation plan under which options to purchase common stock of the Company were outstanding as of April 30, 2021. This plan is described more fully in Note 6.\nThe Company recorded stock option compensation cost of approximately $2.5 million, $2.0 million and $1.8 million and related income tax benefit of approximately $0.6 million, an income tax benefit of approximately $0.7 million, and an income tax benefit of approximately $0.3 million for the years ended April 30, 2021, April 30, 2020 and 2019, respectively. Stock-based compensation expense is recorded on a straight-line basis over the vesting period for the entire award directly to additional paid-in capital.\n(q) Comprehensive Income`-\nAccounting Standards Update (ASU) 2018-02, Comprehensive Income (Topic 220), establishes standards for reporting and presentation of comprehensive income and its components in a full set of financial statements.\nThe Company did not have any other comprehensive income items for 2021, 2020, or 2019.\n(r) Impairment of Long-Lived Assets\nThe Company reviews long-lived assets, such as property, and equipment, and purchased intangibles subject to amortization, for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Recoverability of assets to be held and used is measured by a comparison of the carrying amount of an asset to estimated undiscounted future cash flows expected to be generated by the asset. If the carrying amount of an asset exceeds its estimated future cash flows, an impairment charge is recognized by the amount by which the carrying amount of the asset exceeds the fair value of the asset. Assets to be disposed of by sale would be separately presented in the consolidated balance sheet and reported at the lower of the carrying amount or fair value less costs to sell, and are no longer depreciated. The assets and liabilities of a group classified as held for sale would be presented separately in the appropriate asset and liability sections of the consolidated balance sheet.\n(s) Earnings per Common Share\nThe Company has two classes of common stock. Class B common shares are convertible into Class A common shares at any time, on a one-for-one basis. Under the Company’s Articles of Incorporation, if dividends are declared, holders of Class A common shares shall receive a $.05 dividend per share prior to the Class B common shares receiving any dividend and holders of Class A common shares shall receive a dividend at least equal to Class B common shares dividends on a per share basis. As a result, the Company has computed the earnings per share in compliance with the Earnings Per Share Topic of the FASB ASC, which requires companies that have multiple classes of equity securities to use the “two-class” method in computing earnings per share.\nFor the Company’s basic earnings per share calculation, the Company uses the “two-class” method. Basic earnings per share are calculated by dividing net earnings attributable to each class of common stock by the weighted average number of shares outstanding. All undistributed earnings are allocated evenly between Class A and B common shares in the earnings per share calculation to the extent that earnings equal or exceed $.05 per share. This allocation is based on management’s judgment after considering the dividend rights of the two-classes of common stock, the control of the Class B shareholders and the convertibility rights of the Class B shares to Class A shares. If Class B shares convert to Class A shares during the period, the distributed net earnings for Class B shares is calculated using the weighted average common shares outstanding during the period.\nDiluted earnings per share is calculated similarly to basic earnings per share, except that the calculation includes the dilutive effect of the assumed exercise of options issuable under the Company’s stock incentive plans. For the Company’s diluted earnings per share calculation for Class A shares, the Company uses the “if-converted” method. This calculation assumes that all Class B common shares are converted into Class A common shares and, as a result, assumes there are no holders of Class B common shares to participate in undistributed earnings.\nFor the Company’s diluted earnings per share calculation for Class B shares, the Company uses the “two-class” method. This calculation does not assume that all Class B common shares are converted into Class A common shares. In addition, this method assumes the dilutive effect of Class A stock options were converted to Class A shares and the undistributed earnings are allocated evenly to both Class A and B shares including Class A shares issued pursuant to those converted stock options. This allocation is based on management’s judgment after considering the dividend rights of the two-classes of common stock, the control of the Class B shareholders and the convertibility rights of the Class B shares into Class A shares.\nThe following tables set forth the computation of basic earnings per common share and diluted earnings per common share (in thousands except for per share amounts). See Note 6 for total stock options outstanding and potential dilution:\nBasic earnings per common share:\nYear Ended\nApril 30, 2021 Year Ended\nApril 30, 2020 Year Ended\nApril 30, 2019\nClass A Common Shares Class B Common Shares Class A Common Shares Class B Common Shares Class A Common Shares Class B Common Shares\nDistributed earnings per share $ 0.44 $ 0.44 $ 0.44 $ 0.44 $ 0.44 $ 0.44\nUndistributed earnings/(loss) per share (0.19) (0.19) (0.23) (0.23) (0.22) (0.22)\nTotal per share $ 0.25 $ 0.25 $ 0.21 $ 0.21 $ 0.22 $ 0.22\nDistributed earnings $ 13,556 $ 803 $ 13,219 $ 805 $ 12,837 $ 819\nUndistributed earnings/(loss) (5,921) (351) (6,864) (418) (6,441) (412)\nTotal $ 7,635 $ 452 $ 6,355 $ 387 $ 6,396 $ 407\nBasic weighted average common shares 30,737 1,822 29,925 1,822 29,106 1,844\nDiluted EPS for Class A common shares using the If-Converted Method\nYear Ended April 30, 2021\nUndistributed and\ndistributed earnings\nto Class A\nCommon Shares Class A\nCommon\nShares EPS*\nPer basic $ 7,635 30,737 $ 0.25\nCommon stock equivalents - 610\n7,635 31,347 0.24\nClass B Common Share Conversion 452 1,822\nDiluted EPS for Class A Common Shares $ 8,087 33,169 $ 0.24\nYear Ended April 30, 2020\nUndistributed and\ndistributed earnings\nto Class A\nCommon Shares Class A\nCommon\nShares EPS*\nPer basic $ 6,355 29,925 $ 0.21\nCommon stock equivalents - 620\n6,355 30,545 0.21\nClass B Common Share Conversion 387 1,822\nDiluted EPS for Class A Common Shares $ 6,742 $ 32,367 $ 0.21\nYear Ended April 30, 2019\nUndistributed and\ndistributed earnings\nto Class A\nCommon Shares Class A\nCommon\nShares EPS*\nPer basic $ 6,396 29,106 $ 0.22\nCommon stock equivalents - 429\n6,396 29,535 0.22\nClass B Common Share Conversion 407 1,844\nDiluted EPS for Class A Common Shares $ 6,803 $ 31,379 $ 0.22\nDiluted EPS for Class B common shares using the Two-Class Method\nYear Ended April 30, 2021\nUndistributed and\ndistributed earnings\nto Class B\nCommon Shares Class B\nCommon\nShares EPS*\nPer basic $ 452 1,822 0.25\nReallocation of undistributed earnings from Class A Common Shares to\nClass B Common Shares\n5 -\nDiluted EPS for Class B Common Shares\n$ 457 1,822 0.25\nYear Ended April 30, 2020\nUndistributed and\ndistributed earnings\nto Class B\nCommon Shares Class B\nCommon\nShares EPS*\nPer basic $ 387 1,822 0.21\nReallocation of undistributed earnings from Class A Common Shares to\nClass B Common Shares\n5 -\nDiluted EPS for Class B Common Shares\n$ 392 1,822 0.22\nYear Ended April 30, 2019\nUndistributed and\ndistributed earnings\nto Class B\nCommon Shares Class B\nCommon\nShares EPS*\nPer basic $ 407 1,844 0.22\nReallocation of undistributed earnings from Class A Common Shares to\nClass B Common Shares\n2 -\nDiluted EPS for Class B Common Shares\n$ 409 1,844 0.22\n_______________\n* Amounts adjusted for rounding\n(t) Advertising\nAll advertising costs are expensed as incurred. Advertising expenses, which are included within sales and marketing expenses, were $2.1 million, $2.9 million and $2.3 million in fiscal 2021, 2020 and 2019, respectively.\n(u) Guarantees and Indemnifications\nThe Company accounts for guarantees in accordance with the Guarantee Topic of the FASB ASC. The Company’s sales agreements with customers generally contain infringement indemnity provisions. Under these agreements, the Company agrees to indemnify, defend and hold harmless the customer in connection with intellectual property infringement claims made by third parties with respect to the customer’s authorized use of the Company’s products and services. The indemnity provisions generally provide for the Company’s control of defense and settlement and cover costs and damages finally awarded against the customer, as well as the Company’s modification of the product so it is no longer infringing or, if it cannot be corrected, return of the product for a refund. The sales agreements with customers sometimes also contain indemnity provisions for death, personal injury or property damage caused by the Company’s personnel or contractors in the course of performing services to customers. Under these agreements, the Company agrees to indemnify, defend and hold harmless the customer in connection with death, personal injury and property damage claims made by third parties with respect to actions of the Company’s personnel or contractors. The indemnity provisions generally provide for the Company’s control of defense and settlement and cover costs and damages finally awarded against the customer. The indemnity obligations contained in sales agreements generally have a limited monetary award. The Company has not previously incurred costs to settle claims or pay awards under these indemnification obligations. The Company accounts for these indemnity obligations in accordance with the Contingencies Topic of the FASB ASC, and records a liability for these obligations when a loss is probable and reasonably estimable. The Company has not recorded any liabilities for these agreements as of April 30, 2021 or 2020.\nThe Company warrants to its customers that its software products will perform in all material respects in accordance with the standard specifications, generally for 90 days after delivery of the licensed products and for the subscription term for SaaS products. Additionally, the Company warrants to its customers that services will be performed consistent with generally accepted industry standards or specific service levels through completion of the agreed upon services. If necessary, the Company will provide for the estimated cost of product and service warranties based on specific warranty claims and claim history. However, the Company has not incurred significant recurring expense under product or service warranties. Accordingly, the Company has no liabilities recorded for these agreements as of April 30, 2021 or 2020.\n(v) Industry Segments\nThe Company operates and manages its business in three reportable segments. See Note 9 of the Consolidated Financial Statements.\n(2) Investments\nInvestments consist of the following (in thousands):\nApril 30,\n2021 2020\nTrading:\nDebt securities-Tax-exempt state and municipal bonds\n$ 674 $ 3,104\nMarketable equity securities 15,332 11,758\n$ 16,006 $ 14,862\nThe total carrying value of all investments on a consolidated basis was approximately $16.0 million and $14.9 million at April 30, 2021 and 2020, respectively. At April 30, 2021, there were no trading investments included in investments-noncurrent in the accompanying consolidated balance sheet. At April 30, 2020, there were approximately $0.7 million in trading investments included in investments-noncurrent in the accompanying consolidated balance sheet.\nThe contractual maturities of debt securities classified as trading at April 30, 2021 and 2020 were as follows (in thousands):\n2021 2020\nDue within one year $ 674 $ 2,403\nDue within two years - 701\nDue within three years - -\nDue after three years - -\n$ 674 $ 3,104\nIn fiscal 2021, 2020 and 2019, the Company’s investment portfolio of marketable equity securities experienced unrealized holding gains of $3.5 million, unrealized holding gains of $0.7 million, and unrealized holding losses of approximately $0.9 million, respectively. In fiscal 2021, 2020 and 2019, the Company’s investment portfolio of debt securities experienced unrealized holding gains of approximately $0.1 million, unrealized holding losses of approximately $0.6 million, and unrealized holding losses of $0.1 million, respectively. In fiscal 2021, 2020 and 2019, the Company’s investment portfolio of marketable equity securities experienced realized holding gains of approximately $0.1 million, realized holding losses of $0.2 million and realized holding losses of approximately $0.1 million, respectively. In fiscal 2021, 2020 and 2019, the Company’s investment portfolio of debt securities experienced realized holding losses of approximately $0.1 million in 2021 and realized holding gains of $0.7 million in 2020 and 2019. Unrealized and realized gains and losses are included in \"Other income, net\" in the Company’s consolidated statements of operations.\n(3) Fair Value of Financial Instruments\nThe Company measures its investments based on a fair value hierarchy disclosure framework that prioritizes and ranks the level of market price observability used in measuring assets and liabilities at fair value. A number of factors affect market price observability including the type of asset or liability and its characteristics. This hierarchy prioritizes the inputs into three broad levels as follows:\n•Level 1-Quoted prices in active markets for identical instruments.\n•Level 2-Quoted prices for similar instruments in active markets; quoted prices for identical or similar instruments in markets that are not active; and model-derived valuations in which all significant inputs and significant value drivers are observable in active markets.\n•Level 3-Valuations derived from valuation techniques in which one or more significant inputs or significant value drivers are unobservable.\nThe following is a general description of the valuation methodologies used for financial assets and liabilities measured at fair value, including the general classification of such assets and liabilities pursuant to the valuation hierarchy.\nCash Equivalents-Cash equivalents include investments in government obligation based money-market funds, other money market instruments and interest-bearing deposits with initial or remaining terms of three months or less. The fair value of cash equivalents approximates its carrying value due to the short-term nature of these instruments.\nMarketable Securities-Marketable securities utilizing Level 1 inputs include active exchange-traded equity securities and equity index funds, and most U.S. government debt securities, as these securities all have quoted prices in active markets. Marketable securities utilizing Level 2 inputs include municipal bonds. We value these securities using market-corroborated pricing or other models that use observable inputs such as yield curves.\nThe following table presents our assets that we measured at fair value on a recurring basis and indicates the fair value hierarchy of the valuation techniques we utilized to determine such fair value (in thousands):\nApril 30, 2021 April 30, 2020\nQuoted Prices\nin Active\nMarkets for\nIdentical Assets\n(Level 1) Significant\nOther\nObservable\nInputs\n(Level 2) Significant\nUnobservable\nInputs\n(Level 3) Total Quoted Prices\nin Active\nMarkets for\nIdentical Assets\n(Level 1) Significant\nOther\nObservable\nInputs\n(Level 2) Significant\nUnobservable\nInputs\n(Level 3) Total\nCash equivalents $ 81,720 $ - $ - $ 81,720 $ 75,256 $ - $ - $ 75,256\nMarketable securities 15,332 674 - 16,006 11,758 3,104 - 14,862\nTotal $ 97,052 $ 674 $ - $ 97,726 $ 87,014 $ 3,104 $ - $ 90,118\nThe carrying amounts of cash, trade accounts receivable and unbilled accounts receivable, accounts payable, accrued compensation and related costs, and other current liabilities approximate fair value because of their short-term maturities.\n(4) Property and Equipment\nProperty and equipment consisted of the following at April 30, 2021 and 2020 (in thousands):\n2021 2020\nBuildings and leasehold improvements $ 16,944 $ 16,881\nComputer equipment and purchased software 12,089 11,478\nOffice furniture and equipment 4,976 4,973\n34,009 33,332\nAccumulated depreciation and amortization (30,581) (29,959)\n$ 3,428 $ 3,373\n(5) Income Taxes\nIncome tax expense (benefit) consisted of the following:\nYears ended April 30,\n2021 2020 2019\n(in thousands)\nCurrent:\nFederal $ 693 $ 295 $ 184\nState 386 370 334\n1,079 665 518\nDeferred:\nFederal (238) (513) 256\nState (82) (96) 64\n(320) (609) 320\n$ 759 $ 56 $ 838\nThe Company’s actual income tax expense differs from the “expected” income tax expense calculated by applying the Federal statutory rate of 21.0% for fiscal 2021, 2020, and 2019 to earnings before income taxes as follows:\nYears ended April 30,\n2021 2020 2019\n(in thousands)\nComputed “expected” income tax expense $ 1,858 $ 1,428 $ 1,605\nIncrease (decrease) in income taxes resulting from:\nState income taxes, net of federal income tax effect 323 214 339\nResearch and development credits (640) (703) (678)\nExcess tax benefits from stock option deductions (641) (737) (251)\nForeign tax credits (1) (164) (112)\nOther, net, including permanent items (140) 18 (65)\n$ 759 $ 56 $ 838\nOur effective income tax rates were 8.6%, 1% and 11% in 2021, 2020 and 2019, respectively. Our effective income tax rate takes into account the source of taxable income, by state, and available income tax credits. The provision for income taxes in fiscal 2021, 2020 and 2019 includes approximately $763,000, $878,000 and $298,000, respectively, in income tax benefits related to the tax benefits realized from stock option deductions.\nThe tax effects of temporary differences that give rise to significant portions of the deferred tax assets and deferred tax liabilities at April 30, 2021 and 2020 are presented as follows:\n2021 2020\n(in thousands)\nDeferred tax assets:\nAccruals and expenses not deducted for tax purposes $ 565 $ 363\nState net operating loss carryforwards 136 226\nFixed asset basis differences 797 822\nNonqualified stock options 1,184 848\nForeign net operating loss carryforwards 3,141 -\nRight of use liability 390 547\nTax credit carryforwards 83 83\nTotal gross deferred tax assets 6,296 2,889\nLess valuation allowance (3,252) (190)\nNet deferred tax 3,044 2,699\nDeferred tax liabilities:\nCapitalized computer software development costs (1,192) (2,090)\nNet gains/losses on trading securities (1,891) (1,005)\nGoodwill and intangible assets basis differences (1,003) (746)\nRight of use asset (364) (513)\nDeferred agent commissions (1,221) (1,242)\nTotal gross deferred tax liabilities (5,671) (5,596)\nNet deferred tax liabilities $ (2,627) $ (2,897)\nAt April 30, 2021, the Company had approximately $3.4 million of various state net operating loss carryforwards which are available to offset future state taxable income, if any, through 2036. The Company has foreign branch operations in the United Kingdom and New Zealand. The branches have incurred losses since inception dating back to 2003. The losses have been utilized in the US federal jurisdiction but have not been utilized in the respective jurisdictions. At April 30, 2021, the Company had approximately $16.2 million of net operating loss carryforwards in these foreign jurisdictions, which are indefinitely available to offset future taxable income. As a result, the Company has recorded a deferred tax asset of $3.1 million related to these losses. Furthermore, the Company does not believe it will realize the benefit of these foreign net operating loss carryforwards and therefore, has established a full valuation allowance associated with this deferred tax asset\nIn assessing the realizability of deferred tax assets, management considers whether it is more likely than not that some portion or all of the deferred tax assets will not be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income during the periods in which those temporary differences become deductible. Management considers the scheduled reversal of deferred tax liabilities, projected future taxable income, and tax planning strategies in making this assessment. Based upon reversal of deferred tax liabilities and expected future profitability, management believes it is more likely than not the Company will realize the benefits of these deductible differences, net of the existing valuation allowances, at April 30, 2021.\nThe Company applies the accounting provisions which require us to prescribe a recognition threshold and measurement attribution for the financial statement recognition and measurement of a tax position taken or expected to be taken within an income tax return.\nAs of April 30, 2021, 2020 and 2019, we recorded approximately $25,000, $34,000, and $43,000, respectively, of unrecognized tax benefits, inclusive of interest and penalties, all of which would impact our effective tax rate if recognized. The liability for unrecognized tax benefits is recorded net of any federal tax benefit that would result from payment.\nWe recognize potential accrued interest and penalties related to unrecognized tax benefits within income tax expense. To the extent interest and penalties are not assessed with respect to uncertain tax positions, amounts accrued will be reduced and reflected as a reduction of the overall income tax provision. As of April 30, 2021 and 2020, we recorded a liability for potential penalties and interest of approximately $15,000 and $19,000, respectively, related to uncertain tax positions.\nA reconciliation of the beginning and ending amount of unrecognized tax benefits is as follows, excluding interest and penalties (in thousands):\n2021 2020\nBalance at beginning of the period $ 15 $ 21\nDecreases as a result of positions taken during prior periods (5) (6)\nIncreases as a result of positions taken during the current period - -\nBalance at April 30, $ 10 $ 15\nWe conduct business globally and, as a result, file consolidated income tax returns in the United States federal jurisdiction and in many state and foreign jurisdictions. We are no longer subject to state and local, or non-U.S. income tax examinations for years prior to 2003. We are no longer subject to U.S. federal income tax examination for years prior to 2017.\nDuring the years ended April 30, 2021, 2020, and 2019 we recorded research and development state tax credits against payroll taxes of approximately $555,000 and $427,000, and $488,000 respectively, which reduced general and administrative expenses by the same amounts.\n(6) Shareholders’ Equity\nExcept for the election or removal of directors and class votes as required by law or our Articles of Incorporation, holders of both classes of common stock vote as a single class on all matters, with each Class A common share entitled to cast one-tenth vote per share and each Class B common share entitled to cast one vote per share. Neither class has cumulative voting rights. Holders of Class A common shares, as a class, are entitled to elect 25% of the board of directors (rounded up to the nearest whole number of directors) if the number of outstanding Class A common shares is at least 10% of the number of outstanding shares of both classes of common stock. No cash or property dividend may be paid to holders of Class B common shares during any fiscal year of the Company unless a dividend of $0.05 per share has been paid in such year on each outstanding Class A common share. This $0.05 per share annual dividend preference is noncumulative. Dividends per Class B common share during any fiscal year may not exceed dividends paid per Class A common share during such year. Each Class B common share is convertible at any time into one Class A common share at the option of the shareholder.\nStock Option Plans\nAs of April 30, 2021, the Company has outstanding stock options granted pursuant to two stock option plans. The 2011 Equity Compensation Plan (the “2011 Plan”) which was effective as of May 17, 2010, and the 2020 Equity Compensation Plan (the \"2020 Plan\") which was effective as of August 21, 2019. The 2020 Plan reserves for issuance 2,500,000 shares of Class A Common Stock.\nUnder the 2020 Plan, options to purchase Class A common shares are granted in the form of both incentive stock options and non-qualified stock options. The number of options granted under this plan is determined in each grant. By resolution of the Board of Directors, non-employee directors receive grants of non-qualified options to purchase 10,000 shares upon election and 4,000 shares at the end of each fiscal quarter. The price of such grants is equal to the closing market price of the shares on the date of grant. Options are exercisable based on the terms of such options, but no more than six years after the date of grant (or five years for incentive stock options granted to any person who owns 10% or more of the combined voting power of all classes of capital stock of the Company at the time of grant). A total of 2,500,000 shares are authorized for issuance pursuant to options granted under this Plan. Incentive and nonqualified options exercisable at April 30, 2021, 2020 and 2019 totaled 1,188,933, 900,610, and 1,086,180, respectively. Options available for grant at April 30, 2021, under the 2020 Plan were 379,143 shares.\nA summary of changes in outstanding options for the year ended April 30, 2021 is as follows:\nNumber of\nShares Weighted\nAverage\nExercise\nPrice Weighted\nAverage\nRemaining\nContractual\nTerm\n(years) Aggregate\nIntrinsic\nValue\nOutstanding at May 1, 2020 3,745,650 $ 12.21\nGranted 1,360,000 15.15\nExercised (628,917) 10.65\nForfeited (365,000) 13.12\nExpired (2,000) 14.85\nOutstanding at 4/30/2021* 4,109,733 $ 13.33 3.7 $ 30,228,318\nExercisable at April 30, 2021 1,188,933 $ 11.69 2.4 $ 10,702,164\n*amounts adjusted for rounding\nThe weighted-average grant date fair value of stock options granted during the years ended April 30, 2021, 2020, and 2019 is $3.87, $3.20, and $2.58 per share, respectively. The fair value of each option award is estimated on the date of grant using the Black-Scholes option pricing model with the following weighted-average assumptions for the years ended April 30, 2021, 2020, and 2019:\n2021 2020 2019\nDividend yield 2.7 % 2.8 % 3.6 %\nExpected volatility 38.3 % 30.9 % 30.0 %\nRisk-free interest rate 0.3 % 1.6 % 2.9 %\nExpected term 5 years 5 years 5 years\nThe expected volatility is based on the historical volatility and implied volatility. The Company uses historical data to estimate stock option exercise and forfeiture rates. The expected term represents the period over which the share-based awards are expected to be outstanding and was estimated using historical data. The dividend yield is an estimate of the expected dividend yield on the Company’s stock. The risk-free rate is based on U.S. Treasury yields in effect at the time of the grant for the expected term of the stock options.\nOptions with graded vesting are valued as a single award. The total value of the award is expensed on a straight-line basis over the vesting period with the amount of compensation cost recognized at any date at least equal to the portion of the grant date value of the award that is vested at that date. During the years ended April 30, 2021, 2020, and 2019, we issued 628,917, 1,020,910 and 602,176 shares of common stock, respectively, resulting from the exercise of stock options. The total intrinsic value of options exercised during the years ended April 30, 2021, 2020 and 2019 based on market value at the exercise dates was $4,229,040, $5,569,882 and $2,441,830 respectively. The fair value of grants vested during the years ended April 30, 2021, 2020 and 2019 was $2,206,610, $1,786,342 and $1,470,840, respectively. As of April 30, 2021, unrecognized compensation cost related to unvested stock option awards approximated $7.1 million and is expected to be recognized over a weighted average period of 1.8 years.\nStock Repurchases\nOn August 19, 2002, our Board of Directors approved a resolution authorizing the repurchase of up to 2.0 million shares of our Class A common stock. These repurchases have been and will be made through open market purchases at prevailing market prices. The timing of any repurchases will depend upon market conditions, the market price of our common stock and management’s assessment of our liquidity and cash flow needs. For this repurchase plan, through April 30, 2021, we have repurchased 1,053,679 shares of common stock at a cost of approximately $6.2 million. During fiscal 2021 we did not repurchase any shares. Under all repurchase plans as of April 30, 2021, we have repurchased 4,588,632 shares of common stock at a cost of approximately $25.6 million.\n(7) Leases\nThe Company adopted ASU 2016-02, Leases (Topic 842), as of May 1, 2019 using the modified retrospective approach, which allows the Company to apply Accounting Standards Codification (ASC) 840, Leases, in the comparative periods presented in the year of adoption. Accordingly, the 2019 period and disclosures have not been restated. Adoption of the new standard resulted in the recognition of operating lease ROU assets of approximately $2.7 million, current operating lease liabilities of approximately $0.7 million and long-term operating lease liabilities of approximately $2.1 million as of May 1, 2019.\nThe Company’s operating leases are primarily related to facility leases for administration and sales personnel. The operating leases have terms ranging from three to five years. While each of the leases includes renewal options, the Company has only included the base lease term in its calculation of lease assets and liabilities. The Company does not have any finance leases.\nBalance sheet information related to operating leases is as follows (in thousands):\nAs of April 30, 2021 As of April 30, 2020\nAssets\nRight of use assets 1,454 2,053\nLiabilities\nCurrent lease liabilities 739 763\nLong-term lease liabilities 821 1,424\nTotal liabilities $ 1,560 $ 2,187\nLease cost information related to operating leases is as follows (in thousands):\nYear ended April 30, 2021 Year ended April 30, 2020\nLease cost\nOperating lease cost 784 770\nShort-term lease cost 567 643\nVariable lease cost 270 225\nTotal lease cost $ 1,621 $ 1,638\nLease costs are primarily included in \"Sales and marketing\" and \"General and administrative\" expenses in the Company’s consolidated statements of operations.\nThe impact of the Company's leases on the consolidated statement of cash flows is presented in the operating activities section, which mainly consisted of cash paid for operating lease liabilities of approximately $1.7 million during fiscal 2021. The Company did not modify any existing leases or execute any new leases during fiscal 2021.\nThe impact of the Company's leases on consolidated statement of cash flows is presented in the operating activities section, which mainly consisted of cash paid for operating lease liabilities of approximately $1.3 million during fiscal 2020. The Company did not modify any existing leases or execute any new leases during fiscal 2020.\nWeighted average information associated with the measurement of the Company’s remaining operating lease obligations is as follows:\nApril 30, 2021 April 30, 2020\nWeighted average remaining lease term 2.4 years 3.3 years\nWeighted average discount rate 3.3 % 3.5 %\nThe following table summarizes the maturity of the Company’s operating lease liabilities as of April 30, 2021 (in thousands):\nYears ended April 30:\n2022 $ 749\n2023 487\n2024 361\n2025 20\n2026 -\nThereafter -\nTotal operating lease payments\n$ 1,617\nLess imputed interest\n(57)\nTotal operating lease liabilities\n$ 1,560\nThe Company leases to other tenants a portion of its headquarters building that it owns in Atlanta, Georgia. The leases expire at various dates through October 2025. Lease income is included in \"Other, net\" in the Company’s consolidated statements of operations and totaled approximately $323,000 for the year ending April 30, 2021. Lease payments to be received as of April 30, 2021 are as follows (in thousands):\nYears ended April 30:\n2022 $ 149\n2023 96\n2024 98\n2025 100\n2026 50\nThereafter -\n$ 493\n(8) Commitments and Contingencies\n(a) 401(k) Profit Sharing Plan\nEmployees are offered the opportunity to participate in the Company’s 401(k) Profit Sharing Plan (the \"401(k) Plan\"), which is intended to be a tax-qualified defined contribution plan under Section 401(k) of the Internal Revenue Code. Under the 401(k) Plan, employees are eligible to participate on the first day of the month following the date of hire. Eligible employees may contribute up to $19,500 of their salary to the 401(k) Plan. Subject to certain limitations, the Company may make a discretionary profit sharing contribution at an amount determined by the board of directors of the Company. The Company’s profit sharing contribution was $451,000 for fiscal 2021, $451,000 for fiscal 2020 and $429,000 for fiscal 2019.\n(b) Contingencies\nThe Company more often than not indemnifies its customers against damages and costs resulting from claims of intellectual property infringement associated with use of the Company’s products. The Company historically has not been required to make any payments under such indemnifications. However, the Company continues to monitor the circumstances that are subject to the indemnifications to identify whether it is probable that a loss has occurred, and would recognize any such losses under the indemnifications when those losses are estimable.\nIn addition, the Company warrants to customers that the Company’s products operate substantially in accordance with the software product’s specifications. Historically, no costs have been incurred related to software product warranties and none are expected in the future, and as such no accruals for software product warranty costs have been made. Additionally, the Company is involved in various claims arising in the ordinary course of business. In the opinion of management, the ultimate disposition of these matters will not have a material adverse effect on the financial position or results of operations of the Company.\n(9) Segment Information\nFASB ASC 280, Segment Reporting, establishes standards for reporting information about operating segments. Operating segments are defined as components of a public entity about which separate financial information is available that is evaluated regularly by the chief operating decision makers (“CODMs”), or decision making group, in deciding how to allocate resources and in assessing performance. Our CODMs are our Chief Executive Officer and President and our Chief Financial Officer. While our CODMs are apprised of a variety of financial metrics and information, we manage our business primarily on a segment basis, with the CODMs evaluating performance based upon segment operating profit or loss that includes an allocation of common expenses, but excludes certain unallocated corporate expenses, which are included in the Other segment. Our CODMs review the operating results of our three segments, assess performance and allocate resources in a manner that is consistent with the changing market dynamics that we have experienced. As a result, in the third quarter of fiscal 2018, we updated our operating segments to reflect the fact that we provide our software solutions through three major operating segments, which are further broken down into a total of six major product and service groups. The three operating segments are: (1) Supply Chain Management (“SCM”), (2) Information Technology Consulting (“IT Consulting”) and (3) Other.\nThe SCM segment consists of Logility and DMI. Both operating companies leverage a single platform spanning eight supply chain process areas, including demand optimization, inventory optimization, supply optimization, retail optimization, quality and compliance, PLM, sourcing management and integrated business planning. The IT Consulting segment consists of The Proven Method, Inc., an IT staffing and consulting services firm, which provides support for our software products, such as software enhancements, documentation, updates, customer education, consulting, systems integration services, maintenance and support services. The Other segment consists of (i) American Software ERP, which provides purchasing and materials management, customer order processing, financial, e-commerce and traditional manufacturing solutions, and (ii) unallocated corporate overhead expenses.\nAll of our revenue is derived from external customers. We do not have any inter-segment revenue. Our income taxes and dividends are paid at a consolidated level. Consequently, it is not practical to show these items by operating segment.\nFollowing is information related to each segment as of and for the years ended April 30, 2021, 2020 and 2019, (in thousands):\n2021 2020 2019\nRevenue:\nSupply Chain Management $ 90,268 $ 95,018 $ 86,296\nIT Consulting 19,036 17,997 20,007\nOther 2,104 2,451 2,403\n$ 111,408 $ 115,466 $ 108,706\nOperating income/(loss):\nSupply Chain Management $ 18,922 $ 19,612 $ 15,967\nIT Consulting 456 332 964\nOther (15,017) (13,896) (11,655)\n$ 4,361 $ 6,048 $ 5,276\nCapital expenditures:\nSupply Chain Management $ 266 $ 156 $ 375\nIT Consulting - - 1\nOther 412 264 876\n$ 678 $ 420 $ 1,252\nCapitalized software:\nSupply Chain Management $ 620 $ 3,170 $ 5,961\nIT Consulting - - -\nOther - - -\n$ 620 $ 3,170 $ 5,961\nDepreciation and amortization:\nSupply Chain Management $ 5,223 $ 7,727 $ 7,372\nIT Consulting 2 5 7\nOther 385 371 340\n$ 5,610 $ 8,103 $ 7,719\nInterest income:\nSupply Chain Management $ 71 $ 829 $ 1,408\nIT Consulting - - -\nOther 338 695 684\n$ 409 $ 1,524 $ 2,092\nEarnings/(loss) before income taxes:\nSupply Chain Management $ 19,119 $ 19,855 $ 16,335\nIT Consulting 454 332 964\nOther (10,725) (13,389) (9,658)\n$ 8,848 $ 6,798 $ 7,641\nApril 30,\n2021 April 30,\n(in thousands)\nTotal Consolidated Assets:\nSupply Chain Management $ 110,652 $ 117,135\nIT Consulting 4,658 5,200\nOther 61,847 48,958\n$ 177,157 $ 171,293\nInternational Revenue and Significant Customer\nInternational revenue approximated $16.7 million or 15%, $22.1 million or 19%, and $21.4 million or 20%, of consolidated revenue for the years ended April 30, 2021, 2020, and 2019, respectively, and were derived primarily from customers in Canada and Europe. International revenue is based on the delivery of software and performance of services.\nNo single customer accounted for more than 10% of total revenue for the years ended April 30, 2021, 2020, and 2019.\n(10) Subsequent Events\nOn May 27, 2021, our Board of Directors declared a quarterly cash dividend of $0.11 per share of our Class A and Class B common stock. The cash dividend is payable on August 27, 2021 to Class A and Class B shareholders of record at the close of business on August 13, 2021.",
    "item_9": "ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.",
    "item_9A": "ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur disclosure controls and procedures (as defined in Rule 13a-15(e) of the Securities Exchange Act of 1934 (“Exchange Act”)) are designed to provide reasonable assurance that information required to be disclosed in our reports filed or submitted under the Exchange Act, such as this annual report on Form 10-K, is recorded, processed, summarized and reported within the time periods specified in the SEC's rules and forms. Our disclosure controls and procedures are also designed to ensure that such information is accumulated and communicated to our management, including our principal executive officer and principal financial officer, to allow timely decisions regarding required disclosure.\nOur principal executive officer and principal financial officer, with the assistance of our Disclosure Committee, have conducted an evaluation of the effectiveness of our disclosure controls and procedures as of April 30, 2021. We perform this evaluation on a quarterly basis so that the conclusions concerning the effectiveness of our disclosure controls and procedures can be reported in our annual report on Form 10-K and quarterly reports on Form 10-Q. Based on this evaluation, our principal executive officer and principal financial officer have concluded that our disclosure controls and procedures were effective to provide such reasonable assurance as of April 30, 2021.\nWe believe our consolidated financial statements fairly present, in all material respects, our financial position, results of operations and cash flows in our annual report on Form 10-K. The unqualified opinion of our independent registered public accounting firm on our consolidated financial statements as of April 30, 2021 and 2020 and for each of the years in the three-year period ended April 30, 2021 is included in this annual report on Form 10-K.\nChanges in Internal Control over Financial Reporting\nThere have not been any changes in the Company’s internal control over financial reporting (as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) during the last fiscal quarter of fiscal 2021 to which this report relates that have materially affected, or are reasonably likely to materially affect, the Company’s internal control over financial reporting.\nReports on Internal Control Over Financial Reporting\nManagement’s report on internal control over financial reporting and the report of the independent registered public accounting firm on internal control over financial reporting are included under Item 8, “Consolidated Financial Statements and Supplementary Data,” of this report.",
    "item_9B": "ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNone.\nPART III",
    "item_10": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by this item is incorporated by reference from the information contained in our Proxy Statement for the Annual Meeting of Shareholders expected to be filed with the SEC on or about July 29, 2021 (the \"Proxy Statement\") under the captions “Election of Directors,” “Executive Compensation,” “Section 16(a) Beneficial Ownership Reporting Compliance,” “Code of Business Conduct and Ethics,” and “Committees of the Board of Directors.”",
    "item_11": "ITEM 11. EXECUTIVE COMPENSATION\nThis information is set forth under the caption “Executive Compensation” in the Proxy Statement, which information is incorporated herein by reference.",
    "item_12": "ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nInformation regarding security ownership of management and others is set forth under the caption “Security Ownership of Certain Beneficial Owners and Management” in the Proxy Statement, which information is incorporated herein by reference.",
    "item_13": "ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nPolicy Regarding Transactions with Related Persons\nOn December 8, 2003, our Board of Directors adopted a resolution directing the Audit Committee of the Board of Directors to establish and implement procedures for identifying and conducting an appropriate review of any proposed transaction that meets the definition of “related party transaction” within the meaning of Item 404 of SEC Regulation S-K. In January 2004, the Audit Committee adopted written procedures in accordance with such direction. Under those procedures, the Audit Committee reviews and evaluates any proposed related party transaction and determines whether the terms of such transaction, judged at the time of the determination, are fair to the Company. Our officers are instructed that when a related party transaction is proposed, they are to bring it to the attention of the Audit Committee, which then reviews the transaction and makes a determination of whether it meets the above standard. The Audit Committee is required to prepare a report of its deliberations, conclusions and recommendations, and furnish that report to the full Board of Directors.\nInformation regarding director independence is set forth under the captions “Director Independence” and “Committees of the Board of Directors” in the Proxy Statement, which information is incorporated herein by reference.",
    "item_14": "ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThis information is set forth under the caption “Ratification of Appointment of Independent Registered Public Accounting Firm” in the Proxy Statement, which information is incorporated herein by reference.\nPART IV",
    "item_15": "ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(a) Documents filed as part of this report.\n1. Financial statements; All financial statements of the Company as described in Item 8 of this report on Form 10-K.\n2. Financial statement schedule included in Part IV of this Form:\nPage\nSchedule II-Consolidated Valuation Accounts-for the three years ended April 30, 2021\nAll other financial statements and schedules not listed above are omitted as the required information is not applicable or the information is presented in the financial statements or related notes.\n3. Exhibits\nThe following exhibits are filed herewith or incorporated herein by reference:\n3.1 The Company’s Amended and Restated Articles of Incorporation, and amendments thereto.(1)(P)\n3.2 The Company’s Amended and Restated By-Laws dated May 18, 2009.(2)\n10.1 American Software, Inc. 401(k)/Profit Sharing Plan and Trust Agreement.(3)(P)\n10.2 Amendment to American Software, Inc. 401(k)/Profit Sharing Plan and Trust Agreement.(4)\n10.3 The Company’s 2011 Equity Compensation Plan, as amended.(5)\n10.4 Retention Agreement, dated as of July 11, 2016, by and between American Software, Inc. and James C. Edenfield.(6)\n10.5 Retention Agreement, dated as of July 11, 2016, by and between American Software, Inc. and Vincent C. Klinges.(7)\n10.6 Retention Agreement, dated as of July 11, 2016, by and between American Software, Inc. and H. Allan Dow.(8)\n10.7 The Company’s 2020 Equity Compensation Plan.(9)\n21.1 List of Subsidiaries.\n23.1 Consent of Independent Registered Public Accounting Firm.\n31.1 Certification Pursuant to Rule 13a-14(a)/15d-14(a).\n31.2 Certification Pursuant to Rule 13a-14(a)/15d-14(a).\n32.1 Certifications Pursuant to Section 906 of Sarbanes-Oxley Act of 2002.\n101.INS XBRL Instance Document.\n101.SCH XBRL Taxonomy Extension Schema Document.\n101.CAL XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE XBRL Taxonomy Extension Presentation Linkbase Document.\n______________\n(1)Incorporated by reference herein. Filed by the Company as an exhibit to its quarterly report filed on Form 10-Q for the quarter ended October 31, 1990.\n(2)Incorporated by reference herein. Filed by the Company as an exhibit to its quarterly report filed on Form 10-Q for the quarter ended January 31, 2010.\n(3)Incorporated by reference herein. Filed by the Company as an exhibit to its Registration Statement No. 33-55214 filed on Form S-8 on December 1, 1992.\n(4)Incorporated by reference herein. Filed by the Company as an exhibit to its annual report filed on Form 10-K for the fiscal year ended April 30, 2002.\n(5)Incorporated by reference herein. Filed by the Company as an appendix to its Definitive Proxy Statement filed on July 27, 2017.\n(6)Incorporated by reference herein. Filed by the Company as exhibit 10.1 to its current report on Form 8-K filed on July 15, 2016.\n(7)Incorporated by reference herein. Filed by the Company as exhibit 10.3 to its current report on Form 8-K filed on July 15, 2016.\n(8)Incorporated by reference herein. Filed by the Company as exhibit 10.1 to its current report on Form 8-K/A filed on July 13, 2017.\n(9)Incorporated by reference herein. Filed as Appendix A to the Company’s Definitive Proxy Statement on Schedule 14A filed with the Securities and Exchange Commission on July 26, 2019.\nSCHEDULE II\nAMERICAN SOFTWARE, INC.\nCONSOLIDATED VALUATION ACCOUNTS\nYears ended April 30, 2021, 2020, 2019\n(In thousands)\nAllowance for Doubtful Accounts\nYear ended: Balance at\nbeginning\nof year Amounts\ncharged to\nexpense Other\nAdditions\n(1) Deductions\n(2) Balance at\nend of year\nApril 30, 2021 $ 264 - 166 - 430\nApril 30, 2020 $ 153 97 14 - 264\nApril 30, 2019 $ 159 - - 6 153\n_______________\n(1)Recovery of previously written-off amounts.\n(2)Write-off of uncollectible accounts.\nDeferred Income Tax Valuation Allowance\nThe deferred tax valuation allowance roll-forward is included in Item 8 of this Report in the Notes to Consolidated Financial Statements-Note 5.\nSee accompanying report of independent registered public accounting firm.\nITEM 16. FORM 10-K SUMMARY.\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nAMERICAN SOFTWARE, INC.\nBy: /s/ H. Allan Dow\nH. Allan Dow\nChief Executive Officer and President (Principal Executive Officer)\nDate: July 9, 2021\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignatures Title Date\n/s/ James C. Edenfield Executive Chairman, Treasurer and Director July 9, 2021\nJames C. Edenfield\n/s/ H. Allan Dow Chief Executive Officer and President (Principal Executive Officer) and Director July 9, 2021\nH. Allan Dow\n/s/ W. Dennis Hogue Director July 9, 2021\nW. Dennis Hogue\n/s/ James B. Miller, Jr. Director July 9, 2021\nJames B. Miller, Jr.\n/s/ Thomas L. Newberry, V. Director July 9, 2021\nThomas L. Newberry, V.\n/s/ Matthew G. McKenna Director July 9, 2021\nMatthew G. McKenna\n/s/ Lizanne Thomas Director July 9, 2021\nLizanne Thomas\n/s/ Vincent C. Klinges Chief Financial Officer (Principal Financial Officer) July 9, 2021\nVincent C. Klinges\n/s/ Bryan L. Sell Controller (Principal Accounting Officer) July 9, 2021\nBryan L. Sell"
}