{
    "cik": "723531",
    "company": "PAYCHEX INC",
    "filing_type": "10-K",
    "filing_date": "2021-07-16",
    "period_of_report": "2021-05-31",
    "sic": "8700",
    "state_of_inc": "DE",
    "state_location": "NY",
    "fiscal_year_end": "0531",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/723531/0000723531-21-000035-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/723531/000072353121000035/payx-20210531x10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/723531/0000723531-21-000035.txt",
    "filename": "723531_10K_2021_0000723531-21-000035.htm",
    "item_1": "Item 1. Business\nUnless we state otherwise or the context otherwise requires, the terms “Paychex,” “we,” “us,” “our” and the “Company” refer to Paychex, Inc., a Delaware corporation, and its consolidated subsidiaries.\nOverview\nWe are a leading human resource (“HR”) software and services company, offering HR, payroll, benefits, and insurance services for small- to medium-sized businesses. Our purpose is to allow our customers the freedom to succeed. The workplace is evolving, and we lead the way by making complex HR, payroll, and benefits simple for our clients.\nPaychex incorporated in Delaware in 1979 and has a fiscal year that ends May 31st. We maintain our corporate headquarters in Rochester, New York, and serve clients throughout the U.S. and parts of Europe. As of May 31, 2021, we served greater than 710,000 payroll and PEO clients.\nFor any organization, a key function is effective human capital management (“HCM”), which requires both resources and expertise. Organizations are faced with complex and ever-changing requirements, including diverse and complicated federal, state, and local regulations across multiple jurisdictions. In addition, the workplace is rapidly changing as employees increasingly become mobile, work remotely, and expect a user experience similar to consumer-oriented Internet applications. We focus on helping small- to medium-sized businesses who do not have the resources or expertise to adapt to the constantly evolving environment. The COVID-19 pandemic has further accelerated certain trends toward remote work, consumer-oriented user experience, and increased regulatory complexity which required us to pivot and adapt quickly to these changes.\nPaychex offers a wide range of services and products - including a fully outsourced HR solution, payroll processing, retirement services, and insurance - allowing us to customize our offering to the client's business, whether it is small or large, simple, or complex. We believe that we have the breadth of solutions to cover the spectrum of the employee life cycle, but we also allow integration with some of the most popular HR, accounting, point-of-sale, and productivity applications on the market today.\nOur comprehensive solutions allow our clients to manage their workforces effectively from hire to retire. We provide leading-edge HCM technology solutions, coupled with human expertise, to make complex HR, payroll, and benefits issues simple for our clients. The key features of our solutions are:\n·Comprehensive cloud-based platform optimized to meet the payroll and HR needs of small- and medium-sized organizations;\n·Streamlined workforce management that combines technology with flexible service options;\n·Modern, mobile, and intuitive user experience and self-service capabilities that significantly increase employee engagement;\n·Scalable and customizable platform that allows clients the ability to add services as they grow;\n·Software as a service, or “SaaS”, delivery model that reduces total cost of ownership for our clients; and\n·50 years of expertise in HR and payroll with our technology backed by over 200 compliance experts and 650 HR business professionals.\nWe market our solutions through our direct and virtual sales forces which are supported by various corporate lead generation and marketing initiatives. Over 50% of our revenues are gained from our services beyond payroll processing. We focus on providing an industry-leading client experience and continue to see improving client satisfaction scores and retention.\nCompany Strategy\nOur mission is to be the leading provider of HR, payroll, benefits, and insurance solutions by being an essential partner to small- and medium-sized businesses across the U.S. and parts of Europe. We believe that success in this mission will lead to strong, long-term financial performance. We intend to strengthen and extend our position as a leading provider through continued investments in both our technology and service offerings. Key elements of our strategy include:\n·Providing industry-leading, integrated technology. We continue to invest significantly in our award-winning Paychex Flex® platform and mobility applications to increase efficiency and functionality for our clients and their employees.\n‎\n·Increasing client satisfaction. Our flexible service model and technology-enabled service allows us to provide a personalized service experience for our clients and their employees. We continue to invest in artificial intelligence and machine learning and self-service capabilities to allow clients and their employees easy, intuitive, and flexible service how, when, and where they want it.\n·Expanding our leadership in HR. We have a comprehensive suite of value-added HR solutions for our clients and their employees. After several strategic PEO acquisitions over the past several years, we are the second largest provider of PEO services in the U.S. With over 650 HR business professionals, we have extensive expertise that we believe sets us apart in the industry.\n·Growing our client base. We believe there is significant potential to grow within our current target markets. We have invested significantly in new demand generation and sales tools and expanding certain areas of our sales force. We continue to focus on sales productivity with the intent of expanding our market share across all our product lines.\n·Engaging in strategic acquisitions. In the past, we utilized acquisitions as a means to expand our portfolio, enter new markets or increase our scale. We continue to evaluate and monitor potential acquisitions and will utilize this when the acquisitions are in alignment with our overall strategy.\nOur Solutions\nOur solutions bring together payroll and HCM software with flexible, personalized, and technology-enabled service capabilities. Clients have the option of doing payroll online using our SaaS technology, outsourcing to our payroll specialists, or using a combination of those solutions. Payroll is then integrated with HCM software modules for clients who have more complex HR needs. We also provide comprehensive HR outsourcing through our administrative services organization (“ASO”) and PEO solutions. The integration of leading-edge technology and flexible service options allows us to meet our clients’ needs how, when, and where they want.\nAs the global economy continues to evolve, whether due to legislative changes, the COVID-19 pandemic, or other factors, we are committed to supporting our clients to help them navigate these challenges. Developments in fiscal 2021 designed to meet the evolving needs of employers and employees during the COVID-19 pandemic included:\nThe COVID-19 Help Center: Paychex brought a multifaceted response to the COVID-19 pandemic and delivers resources and services to help our clients respond and adapt. The COVID-19 Help Center on our website continues to provide support throughout every stage of the pandemic.\nPortfolio of Paycheck Protection Program (“PPP”) tools, which include the ability for employers to easily navigate the complexities of the PPP and Employee Retention Tax Credit.\nEmployee health and safety offerings, including COVID-19 leave tracking, COVID-19 screening, and health attestation solutions.\nEnhanced Onboarding Self-Service experience, which simplifies the user experience for entering and reviewing new-hire information and includes the ability to invite employees to complete onboarding and documentation digitally.\nHCM Technology: Paychex Flex is our proprietary HCM SaaS platform that unites HR, payroll, time and attendance, and benefits processes to maximize efficiency and savings. Paychex Flex helps clients manage the employee life cycle from recruiting and hiring to retirement, providing an integrated suite of solutions including recruiting, onboarding, HR, time and attendance and employee benefits. It utilizes a single cloud-based platform, with single client and employee records. Clients can select the modules they need and easily add on services as they grow. In addition, Paychex Flex presents function-focused analytics throughout the platform, providing HR leaders with data to make more informed business decisions. Paychex Flex uses a device-independent design throughout our HCM suite, which allows full functionality of all application components, regardless of device or screen size. We believe our Paychex mobile applications add greater value and convenience for our clients and their employees by allowing them instant access on their mobile device, and we have experienced strong growth in mobile and self-service usage over the past year.\n‎\nWe continue to invest in Paychex Flex, making significant enhancements designed to simplify the complexity of HR. In fiscal 2021, product development focused on new products geared toward increasing digital transformation and use of technology for our clients allowing them to function efficiently with a distributed workforce. Our fiscal 2021 product development included enhancements to:\nData analytics and live reports\nOnline employee onboarding tool\nHR Connect\nPerformance management features\nMobility and self-service tools\nVoice recognition\nHR and Compliance Expertise: Paychex supports its HCM software solutions with 50 years of experience. We have over 650 HR business professionals who are dedicated to our clients and have the experience and training to provide HR best practices and advice. Our HR business partners are available to provide our ASO and PEO clients with specific guidance on HR issues. In addition, we have over 200 compliance professionals who are in real-time contact with tax agencies and regulators to understand upcoming or newly enacted laws and regulations and advocate for our clients’ interests. The contributions of these compliance experts are intended to ensure that our HCM solutions are updated timely to adhere to regulations and to help our clients stay in compliance.\nTechnology-Enabled Client Service: Paychex Flex also provides technology-enabled service with options that include self-service, a 24/7 dedicated service center, an individual payroll specialist, and integrated service via a multi-product service center. In addition, medium-sized clients can utilize a relationship manager for more personalized service. This flexible platform services our small- to medium-sized clients and a portion of our PEO business.\nWithin Paychex Flex there is embedded technology to assist clients. The Paychex Flex Intelligence Engine includes the Flex Assistant, a customer service chatbot that can answer over 340 commonly asked questions and offer access to 800 instructional resources. Our Paychex Flex Intelligence Engine allows clients to elect their preference for learning - via written how-to-documents, tutorial-style video vignettes, or a guided interactive tour. At any time, a live Paychex agent is just a click away, with the entire chat conversation available real-time to provide a better, more personalized service experience.\nThe platform embeds self-service capabilities that empower client employees to manage their HR and benefits information from any location, on any device. These self-service capabilities allow for greater access and convenience for client employees and greater productivity for clients.\nOur Clients\nPaychex has HR solutions to fit the needs of any small- to medium-sized business, from do-it-yourself payroll to comprehensive HR outsourcing. The target market for our integrated HCM solutions is small- to medium-sized businesses. Within this space, we serve a diverse client base operating in a broad range of industries throughout the U.S. and parts of Europe. The flexibility and scalability of our solutions allow our clients to define the solution that best meets their needs and to grow within the Paychex Flex platform. We utilize service agreements and arrangements with clients that generally do not contain specified contract periods and may be terminated by either party with 30-days notice of termination. For the fiscal year ended May 31, 2021 (“fiscal 2021”), client retention was at record levels of approximately 85% of our beginning client base.\nWe support our small-business clients, reducing the complexity and risk of running their own payroll, while ensuring greater accuracy with up-to-date tax rates and regulatory information. We simplify their payroll with a combination of our solutions and customer service options for a quick and easy payday. Clients may choose to have our service team handle everything for them, or process payroll themselves utilizing our proprietary, robust SaaS Paychex Flex platform and our SurePayroll® SaaS-based products. Both products allow users to process payroll when they want, how they want, and on any device (desktop, tablet, and mobile phone).\nOur medium-sized clients generally have more complex payroll and employee benefit needs, though with the environment of increasing regulations, we believe the need for HR outsourcing services has been moving down-market. Any of our clients on Paychex Flex can opt for the integrated suite of HCM solutions, which allows clients to choose the services and software that will meet the needs of their business.\nWhile Paychex Flex is our primary SaaS-based platform utilized by the majority of our clients for their HCM needs, there are some clients that use other platforms, including SurePayroll clients, certain PEO clients, and some smaller tenured clients.\nBoth our small- and medium-sized clients can choose one of our comprehensive HR outsourcing services, which include ASO and PEO solutions, and participate in our benefits offerings, which include our insurance and retirement services. Our insurance services simplify the insurance process to make it easy to find plans with the features and affordability to meet the client’s needs. Our retirement services product line offers many plan design options to meet the client’s requirements, as well as investment options.\nDescription of Services\nWithin our HCM solutions we offer a comprehensive portfolio of services and products that allow our clients to meet their diverse HR and payroll needs. Clients can select services on an á la carte basis or as part of various product bundles. Our offerings often leverage the information gathered in our base payroll processing service, allowing us to provide comprehensive outsourcing services covering the HCM spectrum.\nOur portfolio of services is comprised of the following:\nManagement Solutions:\n·Payroll processing services: Our payroll processing services include the calculation, preparation, and delivery of employee payroll checks; production of internal accounting records and management reports; preparation of federal, state, and local payroll tax returns; and collection and remittance of clients’ payroll obligations.\n·Payroll tax administration services: Payroll tax administration services provide for accurate preparation and timely filing of quarterly and year-end tax returns, as well as the electronic transfer of funds to the applicable federal, state, and local tax or regulatory agencies. In connection with these services, we electronically collect payroll taxes from clients’ bank accounts, typically on payday, prepare and file the applicable tax returns, and remit taxes to the applicable tax or regulatory agencies on the respective due dates. These taxes are typically paid between one and 30 days after receipt of collections from clients, with some items extending up to 90 days. We handle regulatory correspondence, amendments, and penalty and interest disputes.\n·Employee payment services: Our employee payment services provide an employer the option of paying their employees by direct deposit, payroll debit card, a check drawn on a Paychex account (Readychex®), or a check drawn on the employer’s account and electronically signed by us. For each of the first three methods, we electronically collect net payroll from the clients’ bank accounts, typically one business day before payday, and provide payment to the employees on payday. Our Readychex service provides a cost-effective solution that offers the benefit of convenient, one-step payroll account reconciliation for employers.\nWe also allow employers to opt for more flexible pay options. Same day ACH functionality is also available for clients using direct deposit, allowing employers the flexibility to pay employees via direct deposit on the same day they initiate payroll. In addition, we are giving business owners the ability to leverage real-time payments to process payroll and deliver net pay to their employees immediately for time worked. Pay-on-demand functionality enables an employee to request access to a portion of earned pay before the scheduled pay date, which is deposited into a traditional bank account or a third-party account.\n·Regulatory compliance services: We offer new-hire reporting services, which enable clients to comply with federal and state requirements to report information on newly hired employees. This information aids the government in enforcing child support orders and minimizes fraudulent unemployment and workers’ compensation insurance claims. Our garnishment processing service provides deductions from employees’ pay, forwards payments to third-party agencies, including those that require electronic payments, and tracks the obligations to fulfillment. These services enable employers to comply with legal requirements and reduce the risk of penalties. We also offer comprehensive solutions to help employers and employees with certain mandates under the Affordable Care Act (“ACA”), which sets forth specific coverage and reporting requirements that employers must meet.\n·HR Solutions (ASO): Our ASO offers businesses a combined package that includes payroll, employer compliance, HR and employee benefits administration, risk management outsourcing, and the on-site availability of a professionally trained HR representative, among other services. Paychex HR Essentials is an ASO product that provides support to our clients over the phone or online to help manage employee-related topics.\n·Retirement services administration: Our retirement services product line offers a variety of options to clients, including 401(k) plans, 401(k) SIMPLE plans, SIMPLE IRAs, 401(k) plans with safe harbor provisions, owner-only 401(k) plans, profit sharing plans, and money purchase plans. These services provide plan implementation, ongoing\ncompliance with government regulations, employee and employer reporting, participant and employer online access, electronic funds transfer, and other administrative services. Auto enrollment is an optional plan feature that allows employers to automatically enroll employees in their company’s 401(k) plan and increase overall plan participation. Clients may choose from a group of pre-defined fund selections or customize their investment options within their plan. We are the largest 401(k) recordkeeper for small businesses in the U.S. Our large-market retirement services clients include relationships with financial advisors. In January 2021, we were among the first in the retirement industry to sponsor and maintain a Pooled Employer Plan (“PEP”) to help businesses provide a cost-effective retirement plan option for their eligible employees.\n·HR administration services: We offer cloud-based HR administration software for employee benefits management and administration, time and attendance solutions, recruiting, and onboarding. These services include:\noPaychex HR Online offers powerful tools for managing employee personnel information, performance management, HR compliance and reporting. Our Learning Management solution complements our performance management tool. When combined with our workflow and approval engine, we offer clients the flexibility to capture ongoing performance feedback, recommend and enroll employees in specific training courses, and leverage automated workflows to track progress and approve compensation changes tied to performance.\noDigital communication solutions, including Paychex Flex HR Connect and HR Conversations, which helps strengthen connections and keep workers engaged no matter their work location. Paychex Flex HR Connect provides the ability to digitally submit questions, requests, and incident reports directly to HR through an easy-to-use workflow. HR Conversations enables managers and HR leaders to initiate communications with employees, and enhancements to performance assessments allow for 360-degree feedback digitally within the tool.\noBenefits administration software that manages the employee-benefit enrollment process for both open-enrollment and life events.\noTime and attendance products, including our integrated Paychex Flex Time software, provide timekeeping, scheduling, and workforce analytics. The InVisionTM IRIS Time Clock, a biometric clock that scans the iris, provides fast and accurate time capture. Paychex Flex Time also works with wearable technology to allow for employees to clock in and out using their smartwatch.\noApplicant tracking suite provides technology that streamlines, simplifies, and drives the applicant workflow and onboarding process for companies of all sizes.\n·Other HR services and products: We offer the outsourcing of plan administration under section 125 of the Internal Revenue Code, allowing employees to use pre-tax dollars to pay for certain health insurance benefits and health and dependent care expenses not covered by insurance. All required implementation, administration, compliance, claims processing and reimbursement, and coverage tests are provided with these services. We offer state unemployment insurance services, which provide clients with prompt processing for all claims, appeals, determinations, change statements, and requests for separation documents.\n·Business services: We offer various business services for small- to medium-sized businesses. Our wholly owned subsidiary, Paychex Advance, LLC, provides a portfolio of services to the temporary staffing industry, including payroll funding (via the purchase of accounts receivable) and outsourcing services, which include payroll processing, invoicing, and tax preparation. Paychex Promise, a subscription-based service, offers protection against payroll interruptions and solutions to address routine challenges of running a successful business. The primary offering is payroll protection, which extends the collection of payroll funds from a client’s bank account by seven days without interruption of service or charges for insufficient funds. In addition, through partnerships with third-party providers, we provide clients opportunities for services such as payment processing services, financial fitness programs, and a small-business loan resource center.\nPEO and Insurance Solutions:\n·PEO solutions: Our licensed PEO subsidiaries offer businesses a combined package that includes payroll, employer compliance, HR and employee benefits administration, risk management outsourcing, and the on-site availability of a professionally trained HR representative, among other services. What differentiates our PEO solutions from our ASO solutions is that we serve as a co-employer of our clients’ employees and assume the risks and rewards of certain workers’ compensation insurance and certain health insurance offerings. We are certified under the Small Business\nEfficiency Act to provide PEO solutions. In fiscal 2021, we began to offer the PEO Protection Plus Package, which helps business owners protect their bottom line from unforeseen costs, including cyberattacks and employee lawsuits, as exposure to these risks rapidly increased due to the COVID-19 pandemic.\n·Insurance solutions: Our licensed insurance agency, Paychex Insurance Agency, Inc., provides insurance through a variety of carriers, allowing employers to expand their employee benefit and corporate offerings at an affordable cost. Insurance offerings include property and casualty coverage such as workers’ compensation, business-owner policies, cyber security protection, commercial auto, and health and benefits coverage, including health, dental, vision, and life. Our insurance services simplify the insurance process to make it easy to find plans with the features and affordability to meet the client’s needs. With access to numerous top national and regional insurance carriers, our professional insurance agents have access to a wide selection of plans from which they can best match the insurance needs of small businesses. Additionally, clients have the option to integrate their insurance plans with Paychex payroll processing for easy, accurate plan administration.\nSales and Marketing\nWe market and sell our services primarily through our direct sales force based in the markets we serve. Our direct sales force includes sales representatives who have defined geographical territories and specialize within our portfolio of services. Our sales representatives are also supported by marketing, advertising, public relations, trade shows, and telemarketing programs. Our virtual sales force manages inbound sales leads for the under ten employee space, sales in areas without a direct sales force presence, and sales of various ancillary services. During fiscal 2021, in response to the COVID-19 pandemic, our entire field sales force pivoted to working in a virtual environment.\nIn addition to our direct selling and marketing efforts, we utilize other indirect sales channels such as our relationships with existing clients, certified public accountants (“CPAs”), and banks for new client referrals. More than 50% of our new small-market payroll clients (excluding business acquisitions) come from these referral sources. Our dedicated business development group drives sales through banking, national associations, and franchise channels. We also utilize digital marketing as a means to market our services.\nWe have a long-standing partnership with the American Institute of Certified Public Accountants (“AICPA”) as the preferred payroll provider for its AICPA Business SolutionsTM Program. Our current partnership agreement with the AICPA is in place through September 2023. We also partner with numerous state CPA society organizations.\nOur website is available at www.paychex.com. It is a cost-efficient channel that serves as a source of leads and new sales, while complementing the efforts of our direct and virtual sales forces. The website allows us to market to existing and prospective clients that want to learn more about our products and services and offers information about our core lines of business: human resources (www.paychex.com/human-resources), payroll (www.paychex.com/payroll), benefits (www.paychex.com/employee-benefits), and insurance (www.paychex.com/business-insurance).\nPaychex also builds on its reputation as an expert in the HCM industry by providing education and assistance primarily to clients and the CPA community. We provide free webinars, white papers, and other information on our website to inform existing and prospective clients on the impact of regulatory change as well as HR and business best practices. Paychex WORX, available at www.paychex.com/worx, is a digital destination for insightful resources useful for businesses at every stage, from entrepreneur to enterprise. Paychex WORX highlights our expertise and ability to help businesses of all sizes with a wide range of HR and financial information for current clients and prospects alike.\nWe also track current regulatory issues that impact the business community and provide regulatory updates. We issue small business trend reports through our Paychex | IHS Markit Small Business Employment Watch. Our Paychex Accountant Knowledge Center is a free online resource available through our website that brings valuable information and time-saving online tools to accounting professionals. Through Paychex Flex, AccountantHQ offers access to authorized client payroll and HR data and key account contacts, along with an extensive accountant resource library. AccountantHQ drives efficiency by putting accountants in the best position possible to easily access critical client payroll and HR data, as well as powerful reporting tools, including our PPP loan forgiveness estimator.\nMarkets and Competition\nWe remain focused on servicing small- to medium-sized businesses based upon the growth potential that we believe exists in the markets we serve. Our internal database source indicates that there are approximately 8 million employer firms in the target markets that we currently serve in the U.S.\nThe market for HCM services is highly competitive and fragmented. We have one primary national competitor and we also compete with other national, international, regional, local, and online service providers. In addition to traditional payroll processing and HR service providers, we compete with in-house payroll and HR systems and departments. Payroll and HR systems and software are sold by many vendors. Our products also compete with a variety of providers of HR services, such as retirement services companies, insurance companies, HR and benefits consulting firms, and national and regional PEOs.\nCompetition in the payroll processing and HR services industry is primarily based on service responsiveness, product quality and reputation, including ease of use and accessibility of technology, breadth of service and product offerings, and price. We believe we are competitive in each of these areas. We believe that our leading-edge technology and mobility applications, combined with personalized service provided by industry professionals and our technology-enabled service capabilities, distinguishes us from our competitors.\nSoftware Maintenance and Development\nThe ever-changing mandates of federal, state, and local tax and regulatory agencies require us to regularly update our proprietary software to provide payroll and HR services to our clients. We are continually engaged in developing enhancements to and maintaining our various software platforms to meet the changing requirements of our clients and the marketplace. We continue to enhance our SaaS solutions and mobility applications to offer our users an integrated and unified experience. Continued enhancement of the client and client employee experience is important to our future success.\nHuman Capital\nWe believe our ability to attract and retain qualified employees in all areas of our business is critical to our future success and growth. We strive to foster a diverse, equitable, and inclusive (“DE&I”) workplace; attract, retain, and develop talented employees; and keep them safe.\nFor detailed information regarding our HCM activities, we encourage investors to visit our Corporate Responsibility website page at https://www.paychex.com/corporate/corporate-responsibility. We have also made our Corporate Social Responsibility (“CSR”) report for fiscal 2020 available on our website. The information contained on our website and in our CSR report is not and should not be viewed as being incorporated by reference into this Form 10-K.\nOur Employees: As of May 31, 2021, we employed approximately 15,000 people, primarily in the U.S. and on a full-time basis. None of our employees were covered by collective bargaining agreements. We have not experienced a strike or similar work stoppage, and we consider our relations with our employees to be good.\nPaychex Culture: Our core cultural values (“Paychex Values”) are designed to guide decision making aligned to the expectations of clients, stockholders, regulators, employees, and the multiple communities in which we operate and to reflect our continuing commitment to DE&I. The Paychex Values are:\nIntegrity\nService\nInnovation\nPartnership\nAccountability\nRespect\nEach of these values guide our decision-making process and are critical to our ongoing success. All employees are required to verify their understanding and observance of these values during our annual “Right Way” training, review these values with management during periodic performance discussions, and are further encouraged to attend ongoing training during the year. Volunteer “Culture Champions” throughout the Company also help promote these values daily. We encourage employee feedback through our employee engagement surveys, as described below. This approach empowers our employees and allows us to make a positive impact in the communities we work and serve. As a result of our commitment to these principles, in 2021 we were recognized by Ethisphere, a global leader in defining and advancing the standards of ethical business practices, as one of the World’s Most Ethical Companies. We have achieved this recognition 13 times, and consecutively since 2012.\nTalent Acquisition and Development: We compete for talent along with our direct competitors and other companies in the geographic areas we serve. We invest significant resources to attract and retain top talent. Our Talent Acquisition Team, in conjunction with certain third-party partners, have developed comprehensive processes to identify and recruit accomplished professionals.\nOnce hired, our world-class Training Department provides functional training for payroll and HCM specialists and sales associates and also offers personal training, professional development, and leadership-development programs. As a result of our efforts, we have earned the distinction of being named to Training Magazine’s list of the Top 100 Training Organizations 20\nconsecutive times. Most recently, we ranked No. 7 on the 2021 list in addition to being recognized as a 2021 Best Practice award winner for our Culture Shaping initiative.\nComprehensive Compensation and Benefits: We are committed to providing a fair wage and a total rewards package that allows our employees to be their best in every area of their lives. We regularly review employee salaries to ensure we are competitive in the industry and offer financial benefits such as a 401(k) plan, employee stock purchase plan, tuition assistance, scholarships for children of employees, and financial education. We are also committed to rewarding employees with comprehensive and competitive wellness benefits and well-being programs which include medical, prescription, dental, and vision insurance, short- and long-term disability, Employee Assistance Program, paid family leave, and a variety of well-being programs. For fiscal 2021, compensation-related expenses accounted for approximately 59% of our total expenses.\nEmployee Well-being Initiatives: In addition to providing a comprehensive compensation and benefits package, we are committed to providing a safe and healthy workplace for our employees. Healthier employees are at lower risk of injury from workplace related exposures, perform work more safely with lower rates of absenteeism, and experience better job performance. Our well-being program is a robust and comprehensive program focusing on the physical, emotional, community, career, and financial health of our employees. We have been recognized on multiple occasions with the Gold or Platinum designation as a “Best Employer for Worksite Wellbeing” by the Business Group on Health.\nOur award-winning well-being initiatives offer a wide variety of services, tools, and resources that can help employees achieve their health goals using a holistic approach. In addition, we sponsor onsite health screenings, Red Cross blood donation events, flu vaccination clinics, vaping and tobacco cessation, weight management, resiliency training, meditation and yoga classes, and a variety of other programs. Similar to our Culture Champions, we also promote the use of “Well-Being Champions” - Paychex employees who serve as a liaison between the Employee Well-Being Program and their team members. Our employees’ financial well-being is equally important, so we have developed programs for financial education and support. We also maintain procedures for events such as fires, severe weather, medical emergencies, and active shooters, as well as other important information related to general workforce safety.\nEmployee Engagement: Each year we ask our employees to share their views on working at Paychex through a company-wide engagement survey. Facilitated internally by our Human Resources Organizational Development Team, the survey methodology is periodically updated to reflect currents trends and issues including company direction and strategy, DE&I, individual development, collaboration, and our Paychex Values. A third-party administers the survey in order to maintain confidentiality of responses.  We use the survey responses to help inform management and assist in developing programs and policies that will maintain and promote Paychex Values.\nIntellectual Property\nWe own or license and use a number of trademarks, trade names, copyrights, service marks, trade secrets, computer programs and software, and other intellectual property rights. Collectively, our intellectual property rights are material to the conduct of our business. Where it is determined to be appropriate, we take measures to protect our intellectual property rights, including, but not limited to, confidentiality/non-disclosure agreements or policies with employees, vendors, and others; license agreements with licensees and licensors of intellectual property; and registration of certain trademarks. We believe that the “Paychex” name, trademark, and logo are of material importance to us.\nSeasonality\nThere is no significant seasonality to our business. However, during our third fiscal quarter, which ends in February, the number of new payroll clients, new retirement services clients, and new worksite employees associated with our ASO and PEO businesses tends to be higher than during the rest of the fiscal year, primarily because many new clients prefer to start using our services at the beginning of a calendar year. In addition, calendar year-end transaction processing and client funds activity are traditionally higher during our third fiscal quarter due to clients paying year-end bonuses, clients requesting additional year-end services, and the preparation and delivery of end-of year reporting requirements.\nAvailable Information\nWe are subject to the informational and reporting requirements of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). Therefore, we file periodic reports, proxy statements, and other information with the SEC. The SEC maintains a website (www.sec.gov) that includes our reports, proxy statements, and other information.\nOur corporate website, www.paychex.com, provides materials for investors and information about our services. Our Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and other SEC filings, as well as any amendments to such reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act, are made available, free of charge, on our\nwebsite as soon as reasonably practicable after such reports have been filed with or furnished to the SEC. The information on our website is not incorporated by reference into our Form 10-K. Also, copies of our Annual Report to Stockholders and Proxy Statement, to be issued in connection with our 2021 Annual Meeting of Stockholders, will be made available, free of charge, upon written request submitted to Paychex, Inc., c/o Corporate Secretary, 911 Panorama Trail South, Rochester, New York 14625-2396.",
    "item_1A": "Item 1A. Risk Factors\nOur future results of operations are subject to risks and uncertainties that could cause actual results to differ materially from historical and current results, and from our projections. The following risk factors represent our current view of some of the most important risks facing our business and are important to understanding our business. These are not the only risks we face. Additional factors not presently known to us or that we currently deem to be immaterial also may adversely affect, possibly to a material extent, our business, cash flows, financial condition, or results of operations in future periods. In addition, refer to the cautionary note regarding forward-looking statements at the beginning of Part I of this Form 10-K.\nBusiness and Operational Risks\nWe may not be able to keep pace with changes in technology or provide timely enhancements to our products and services.\nThe market for our products is characterized by rapid technological advancements, changes in customer requirements, frequent new product introductions and enhancements, and changing industry standards. To maintain our growth strategy, we must adapt and respond to technological advances and technological requirements of our clients. Our future success will depend on our ability to: enhance our current products and introduce new products in order to keep pace with products offered by our competitors; enhance capabilities and increase the performance of our internal systems, particularly our systems that meet our clients’ requirements; and adapt to technological advancements and changing industry standards. We continue to make significant investments related to the development of new technology. If our systems become outdated, it may negatively impact our ability to meet performance expectations related to quality, time to market, cost and innovation relative to our competitors. The failure to provide a more efficient and user-friendly customer-facing digital experience across internet and mobile platforms as well as in physical locations may adversely impact our business and operating results. There can be no assurance that our efforts to update and integrate systems will be successful. If we do not integrate and update our systems in a timely manner, or if our investments in technology fail to provide the expected results, there could be a material adverse effect to our business and results of operations. The failure to continually develop enhancements and use of technologies such as robotics and other workflow automation tools, natural language processing, and artificial intelligence/machine learning may impact our ability to increase the efficiency of and reduce costs associated with operational risk management and compliance activities.\nWe may experience software defects, undetected errors, and development delays, which could damage our relationship with clients, decrease our potential profitability and expose us to liability.\nOur products rely on software and computing systems that can encounter development delays, and the underlying software may contain undetected errors, viruses or defects. Defects in our products and errors or delays caused by our products could result in additional development costs, diversion of technical and other resources from our other development efforts, loss of credibility with current or potential clients, harm to our reputation and exposure to liability. In addition, we rely on technologies and software supplied by third parties that may also contain undetected errors, viruses or defects that could have a material adverse effect on our business, financial condition, results of operations and cash flows.\nWe could be subject to reduced revenues, increased costs, liability claims, or harm to our competitive position as a result of cyberattacks, security vulnerabilities or Internet disruptions.\nWe rely upon information technology (“IT”) networks, cloud-based platforms, and systems to process, transmit, and store electronic information, and to support a variety of business processes, some of which are provided by third-party vendors. Cyberattacks and security threats are a risk to our business and reputation. A cyberattack, unauthorized intrusion, malicious software infiltration, network disruption or outage, corruption of data, or theft of personal or other sensitive information, could have a material adverse effect on our business operations or that of our clients, result in liability or regulatory sanction, or cause harm to our business and reputation and result in a loss in confidence in our ability to serve clients all of which could have a material adverse effect on our business. The rapid speed of disruptive innovations involving cyberattacks, security vulnerabilities and Internet disruptions enabled by new and emerging technologies may outpace our organization's ability to compete and/or manage the risk appropriately. In addition, cybercriminals may seek to exploit the disruptions caused by the COVID-19 pandemic by attempting to engage in payment-related fraud or by more frequently attempting to gain access to our systems through phishing or other means that may be more successful when employees are working remotely.\nData Security and Privacy Leaks: We collect, use, and retain increasingly large amounts of personal information about our clients, employees of our clients, and our employees, including: bank account, credit card, and social security numbers, tax return information, health care information, retirement account information, payroll information, system and network passwords, and other sensitive personal and business information. At the same time, the continued occurrence of high-profile cyber and ransomware attacks and data breaches provides evidence of an external environment increasingly hostile to information security. We may be particularly targeted for cyber-attack because of the amount and type of personal and business information that we collect, use, and retain. Vulnerabilities, threats, and more sophisticated and targeted computer crimes pose a risk to the security of our systems and networks, and the confidentiality, availability, and integrity of our data. Furthermore, if any of our products contains a software vulnerability, the vulnerability may be exploited to obtain access to our data or our clients’ data.\nOur service platforms enable our clients to store and process personal data on premises or, increasingly, in a cloud-based environment that we host. The security of our IT infrastructure is an important consideration in our customers’ purchasing decisions. Because the techniques used to obtain unauthorized access, disable or degrade service or sabotage systems change frequently, are increasingly more complex and sophisticated and may be difficult to detect for long periods of time, we may be unable or fail to anticipate these techniques or implement adequate or timely preventative or responsive measures. As cyber threats continue to evolve, we are focused on ensuring that our operating environments safeguard and protect personal and business information. We may be required to invest significant additional resources to comply with evolving cybersecurity regulations and to modify and enhance our information security and controls, and to investigate and remediate any security vulnerabilities. While we have security systems and IT infrastructure in place designed to detect and protect against unauthorized access to such information, if our security measures are breached, our business could be substantially harmed, and we could incur significant liabilities. Any such breach or unauthorized access could negatively affect our ability to attract new clients, cause existing clients to terminate their agreements with us, result in reputational damage, and subject us to lawsuits, regulatory fines, or other actions or liabilities which could materially and adversely affect our business and operating results. Third-parties, including vendors that provide services for our operations, could also be a source of security risk to us in the event of a failure of their own security systems and infrastructure.\nData Loss and Business Interruption: If our systems are disrupted or fail for any reason, including Internet or systems failure, or if our systems are infiltrated by unauthorized persons, both the Company and our clients could experience data loss, financial loss, harm to reputation, or significant business interruption. Hardware, applications and services, including cloud-based services, that we develop or procure from third-party vendors may contain defects in design or other problems that could compromise the integrity and availability of our services. Any delays or failures caused by network outages, software or hardware failures, or other data processing disruptions, could result in our inability to provide services in a timely fashion or at all. We may be required to incur significant costs to protect against damage caused by disruptions or security breaches in the future. Such events may expose us to unexpected liability, litigation, regulatory investigation and penalties, loss of clients’ business, unfavorable impact to business reputation, and there could be a material adverse effect on our business and results of operations.\nIn the event of a catastrophe, our business continuity plan may fail, which could result in the loss of client data and adversely interrupt operations.\nOur operations are dependent on our ability to protect our infrastructure against damage from catastrophe or natural disaster, unauthorized security breach, power loss, telecommunications failure, terrorist attack, public health emergency, pandemic, or other events that could have a significant disruptive effect on our operations. Climate-related weather disasters, including hurricanes, flooding, snowstorms, and severe rainstorms, could also threaten the business continuity of our operations. We have a business continuity plan in place in the event of system failure due to any of these events. Our business continuity plan has been tested in the past by circumstances of severe weather, including hurricanes, floods, snowstorms, and rain storms and has been successful. However, these past successes are not an indicator of success in the future. If the business continuity plan is unsuccessful in a disaster recovery scenario, we could potentially lose client data or experience material adverse interruptions to our operations or delivery of services to our clients.\nWe may be adversely impacted by any failure of third-party service providers to perform their functions.\nAs part of providing services to clients, we rely on a number of third-party service providers. These service providers include, but are not limited to, couriers used to deliver client payroll checks, banks used to electronically transfer funds from clients to their employees, and information technology vendors servicing cloud-based platforms we use. Failure by these service providers, for any reason, to deliver their services in a timely manner and in compliance with applicable laws and regulations could result in material interruptions to our operations, impact client relations, and result in significant penalties or liabilities to us.\nWe may be exposed to additional risks related to our co-employment relationship within our PEO business.\nMany federal and state laws that apply to the employer-employee relationship do not specifically address the obligations and responsibilities of the “co-employment” relationship within our PEO business. State and federal positions regarding co-employment relationships are in a constant state of flux and changed with varying degrees of impact on our operations. We cannot predict when changes will occur or forecast whether any future changes will be favorable or unfavorable to our operations. There is a possibility that we may be subject to liability for violations of employment or discrimination laws by our clients and acts or omissions of client employees, who may be deemed to be our agents, even if we do not participate in any such acts or violations. Although our agreements with clients provide that they will indemnify us for any liability attributable to their own or their employees’ conduct, we may not be able to effectively enforce or collect such contractual obligations. In addition, we could be subject to liabilities with respect to our employee benefit plans if it were determined that we are not the “employer” under any applicable state or federal laws. Incurring additional liabilities related to our PEO business may adversely affect our results of operations.\nWe may be adversely impacted by changes in health insurance and workers’ compensation rates and underlying claims trends.\nWithin our PEO business, we maintain health and workers’ compensation insurance covering worksite employees. The insurance costs are impacted by claims experience and are a significant portion of our PEO costs. If we experience a sudden or unexpected increase in claims activity, our costs could increase. In addition, in the event of expiration or cancellation of existing contracts, we may not be able to secure replacement contracts on competitive terms. Also, as a co-employer in the PEO, we assume or share many of the employer-related responsibilities associated with health care reform, which may result in increased costs. Increases in costs not incorporated into service fees timely or fully could have a material adverse effect on our results of operations. Incorporating cost increases into service fees could also impact our ability to attract and retain clients.\nWe made and may continue to make acquisitions that involve numerous risks and uncertainties.\nAcquisitions subject us to risks, including increased debt, assumption of unforeseen liabilities, and difficulties in integrating operations. Successful integration involves many challenges, including the difficulty of developing and marketing new products and services, our exposure to unforeseen liabilities of acquired companies, and the loss of key employees of an acquired business. The integration and conversion of our acquired operations or other future acquisitions, if any, could result in increased operating costs if the anticipated synergies of operating these businesses as one are not achieved, a loss of strategic opportunities if management is distracted by the integration process, and a loss of customers if our service levels drop during or following the integration process. In addition, an acquisition could adversely impact cash flows and/or operating results, and dilute stockholder interests, for many reasons, including charges to our income to reflect the impairment of acquired intangible assets including goodwill, interest costs and debt service requirements for any debt incurred in connection with an acquisition, and any issuance of securities in connection with an acquisition or new business venture that dilutes or lessens the rights of our current stockholders. If the integration of any or all of our acquisitions or future acquisitions is not successful, it could have a material adverse impact on our operating results and stock price.\nFinancial Risks\nOur clients could have insufficient funds to cover payments we made on their behalf, resulting in financial loss to us.\nAs part of our payroll processing service, we are authorized by our clients to transfer money from their accounts to fund amounts owed to their employees and various taxing authorities. It is possible that we could be held liable for such amounts in the event the client has insufficient funds to cover them. We have in the past, and may in the future, make payments on our clients’ behalf for which we may not be reimbursed, resulting in loss to us. If a significant number of our clients are unable to cover payments we make on their behalf, our results of operations will be materially adversely impacted.\nOur interest earned on funds held for clients may be impacted by changes in government regulations mandating the amount of tax withheld or timing of remittance.\nWe receive interest income from investing client funds collected but not yet remitted to applicable tax or regulatory agencies or to client employees. A change in regulations either decreasing the amount of taxes to be withheld or allowing less time to remit taxes to applicable tax or regulatory agencies could adversely impact interest income.\nCertain of our debt agreements contain covenants that may constrain the operation of our business, and our failure to comply with these covenants could have a material adverse effect on our financial condition.\nThe Note Purchase and Guarantee Agreement (the “Agreement”) that we entered into in January 2019 in connection with our acquisition of Oasis Outsourcing Group Holdings, L.P. (“Oasis”), contains covenants which may restrict our flexibility to operate our business. These covenants include restrictions regarding the incurrence of liens and indebtedness, substantial changes in the general nature of our business and our subsidiaries (taken as a whole), certain merger transactions, certain sales\nof assets and other matters, all subject to certain exceptions. The Agreement also contains financial covenants, which are reviewed for compliance on a quarterly basis, that require us not to exceed a maximum leverage ratio of 3.5:1.0 and a minimum interest coverage ratio of 2.0:1.0. In addition, certain of our indebtedness may not exceed 20% of our consolidated stockholders’ equity. If we do not comply with these covenants, it could result in material adverse effects on our operating results and our financial condition.\nLegal, Regulatory and Political Risks\nOur business, services, and financial condition may be adversely impacted by changes in government regulations and policies.\nMany of our services, particularly payroll tax administration services and employee benefit plan administration services, are designed according to government regulations that often change. Changes in regulations could affect the extent and type of benefits employers are required, or may choose, to provide employees or the amount and type of taxes employers and employees are required to pay. Such changes could reduce or eliminate the need for some of our services and substantially decrease our revenue. Added requirements could also increase our cost of doing business.\nOur business and reputation may be adversely impacted if we fail to comply with U.S. and foreign laws and regulations.\nOur services are subject to various laws and regulations, including, but not limited to, the ACA and anti-money laundering rules. The growth of our international operations via acquisition also subjects us to additional risks, such as compliance with foreign laws and regulations. The enactment of new laws and regulations, modifications of existing laws and regulations, or the adverse application or interpretation of new or existing laws or regulations can adversely affect our business. Failure to update our services to comply with modified or new legislation in the area of health care reform as well as failure to educate and assist our clients regarding this legislation could adversely impact our business reputation and negatively impact our client base. Failure to comply with anti-money laundering laws and regulations, which require us to develop and implement risk-based anti-money laundering programs, and maintain transaction records, could result in civil and criminal penalties and adversely impact our business reputation.\nIn addition, there has been and may continue to be a significant number of new laws and regulations promulgated by federal, state, local, and foreign governments following the outbreak of the COVID-19 pandemic. We have expended additional resources and incurred additional costs in addressing regulatory requirements applicable to us and our clients. These regulations may be unclear, difficult to interpret or in conflict with other applicable regulations. Failure to comply with laws and regulations could result in the imposition of consent orders or civil and criminal penalties, including fines, which could damage our reputation and have an adverse effect on our results of operations or financial condition.\nAs a U.S. company, we are required to comply with the economic sanctions and embargo programs administered by the Office of Foreign Assets Control and similar multi-national bodies and governmental agencies worldwide, and the Foreign Corrupt Practices Act (“FCPA”). A violation of a sanction or embargo program, or of the FCPA, or similar laws prohibiting certain payments to governmental officials, could subject us, and individual employees, to a regulatory enforcement action as well as significant civil and criminal penalties which could adversely impact our business and operations.\nOur reputation, results of operations, or financial condition may be adversely impacted if we fail to comply with data privacy laws and regulations.\nOur services require the storage and transmission of proprietary and confidential information of our clients and their employees, including personal or identifying information, as well as their financial and payroll data. Our applications are subject to various complex government laws and regulations on the federal, state, and local levels, including those governing personal privacy. In the U.S., we are subject to rules and regulations promulgated under the authority of the Federal Trade Commission, the Health Insurance Portability and Accountability Act of 1996, the Family Medical Leave Act of 1993, the ACA, federal and state labor and employment laws, and state data breach notification and data privacy laws, such as the California Consumer Protection Act. In the European Union, we are subject to the European Union’s General Data Privacy Regulation. Failure to comply with such laws and regulations could result in the imposition of consent orders or civil and criminal penalties, including fines, which could damage our reputation and have an adverse effect on our results of operations or financial condition. We could be subject to litigation or reputational risk if we or our third-party providers fail to utilize data practices sufficient to safeguard proprietary, confidential, or personal or identifying information. The regulatory framework for privacy issues is rapidly evolving and future enactment of more restrictive laws, rules, or regulations and/or future enforcement actions or investigations could have a materially adverse impact on us through increased costs or restrictions on our business and noncompliance could result in regulatory penalties and significant legal liability.\nFailure to protect our intellectual property rights may harm our competitive position and litigation to protect our intellectual property rights or defend against third-party allegations of infringement may be costly.\nDespite our efforts to protect our intellectual property and proprietary information, we may be unable to do so effectively in all cases. Our intellectual property could be wrongfully acquired as a result of a cyberattack or other wrongful conduct by employees or third-parties. To the extent that our intellectual property is not protected effectively by trademarks, copyrights, patents, or other means, other parties with knowledge of our intellectual property, including former employees, may seek to exploit our intellectual property for their own and others’ advantage. Competitors may also misappropriate our trademarks, copyrights or other intellectual property rights or duplicate our technology and products. Any significant impairment or misappropriation of our intellectual property or proprietary information could harm our business and our brand and may adversely affect our ability to compete. Third parties may claim that we are infringing on their intellectual property rights. To the extent we seek to enforce or must defend our intellectual property rights with litigation, we could incur significant expenses and/or be required to pay substantial damages. We may also be obligated to indemnify our customers or vendors in connection with claims or litigation. The litigation to enforce or defend our intellectual property rights could be costly and time-consuming.\nWe are involved in litigation from time to time arising from the operation of our business and, as such, we could incur substantial judgments, fines, legal fees, or other costs.\nWe are sometimes the subject of complaints or litigation from customers, employees, or other third-parties for various actions. From time to time, we are involved in litigation involving claims related to, among other things, breach of contract, tortious conduct, and employment and labor law matters. The damages sought against us in some of these litigation proceedings could be substantial. Although we maintain liability insurance for some litigation claims, if one or more of the claims were to greatly exceed our insurance coverage limits or if our insurance policies do not cover a claim, this could have a material adverse effect on our business, financial condition, results of operations, and cash flows.\nGeneral Risk Factors\nOur business, results of operations, and financial condition may continue to be impacted by the outbreak of COVID-19 and such impact could be materially adverse.\nThe global spread of COVID-19 created significant volatility, uncertainty and economic disruption. The restrictions imposed to prevent the spread of COVID-19 disrupted economic activity, resulting in reduced commercial and consumer confidence and spending, increased unemployment, closure or restricted operating conditions for businesses, volatility in the global capital markets, instability in the credit and financial markets, labor shortages, regulatory relief for impacted consumers, disruption in supply chains, and restrictions on many hospitality and travel industry operations. While economic conditions have begun improving as vaccine distribution has accelerated in the United States, there can be no assurance that the economic recovery will occur or offset the uncertainty and instability triggered by the pandemic.\nWe are subject to the impacts related to the COVID-19 pandemic for so long as our clients are exposed to those heightened risks and uncertainties. Our business is substantially dependent on our clients’ continued use of our solutions and services, and our results of operations will decline if our clients are no longer willing or able to use them. Our clients are sensitive to negative changes in economic conditions. If they cease operations or file for bankruptcy protection, we may not be paid for services we already provided, and our client base will shrink, which will lower our revenue. If under financial pressure, our clients may determine that they are no longer willing to pay for the services and solutions we provide, which would reduce our revenue. Our clients may decrease their workforce, which would decrease their demand for our services. Because of spending constraints on our clients and competition in the industry, we may face pricing pressure on our services and face challenges in onboarding new clients, which would reduce revenue and ultimately impact our results of operations. Furthermore, if the third-party service providers we rely on are unable to perform their services for us and our clients, our operations could be materially disrupted, and we could face significant penalties or liabilities.\nWe may be adversely impacted by volatility in the political and economic environment.\nTrade, monetary and fiscal policies, and political and economic conditions may substantially change, and credit markets may experience periods of constriction and variability. These conditions may impact our business due to lower transaction volumes or an increase in the number of clients going out of business. Current or potential clients may decide to reduce their spending on payroll and other outsourcing services. In addition, new business formation may be affected by an inability to obtain credit.\nWe invest our funds held for clients in high quality, investment-grade marketable available-for-sale (“AFS”) securities, money markets, and other cash equivalents. We also invest our corporate funds in short- to intermediate-term instruments. Funds held for clients and corporate investments are subject to general market, interest rate, credit, and liquidity risks. These risks may be exacerbated during periods of unusual financial market volatility. The interest we earn on funds held for clients and corporate investments may decrease as a result of a decline in funds available to invest and lower interest rates. In addition, during periods\nof volatility in the credit markets, certain types of investments may not be available to us or may become too risky for us to invest in, further reducing the interest we may earn on client funds. If we are unable to reinvest our AFS securities when they mature, our interest income earned and investment portfolio would be reduced. If we sell AFS securities to satisfy short-term funding requirements, we may recognize losses, which would further reduce the interest income earned on funds held for clients and corporate investments.\nConstriction in the credit markets may impact the availability of financing, even to borrowers with the highest credit ratings. Historically, we have periodically borrowed against available credit arrangements to meet short-term liquidity needs. However, should we require additional short-term liquidity during days of large outflows of client funds, a credit constriction may limit our ability to access those funds or the flexibility to obtain them at interest rates that would be acceptable to us. Growth in services for funding payrolls of our clients in the temporary staffing industry may be constricted if access to financing becomes limited. In addition, our ability to grow through significant acquisitions may be limited. See also “Item 7A. Quantitative and Qualitative Disclosures About Market Risk.” If all of these financial and economic circumstances were to remain in effect for an extended period of time, there could be a material adverse effect on our results of operations and financial condition.\nWe may not be able to attract and retain qualified people, which could impact the quality of our services and customer satisfaction.\nOur success, growth, and financial results depend in part on our continuing ability to attract, retain, and motivate highly qualified people at all levels, including management, technical, compliance, and sales personnel. Competition for these individuals can be intense, and we may not be able to retain our key people, or attract, assimilate, or retain other highly-qualified individuals in the future, which could harm our future success.\nIn the event we receive negative publicity, our reputation and the value of our brand could be harmed, and clients may not use our products and services, which may have a material adverse effect on our business.\nNegative publicity relating to events or activities attributed to us, our corporate employees, or others associated with us, whether or not justified, may tarnish our reputation and reduce the value of our brand. If we are unable to maintain quality HCM and employee benefit-related solutions and PEO and insurance solutions, our reputation with our clients may be harmed and the value of our brand may diminish. In addition, if our brand is negatively impacted, it may have a material adverse effect on our business, including challenges retaining clients or attracting new clients and recruiting talent and retaining employees.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNone.",
    "item_2": "Item 2. Properties\nWe owned and leased the following properties as of May 31, 2021:\nSquare feet\nOwned facilities:\nRochester, New York\n1,012,000\nOther U.S. locations\n30,000\nInternational locations\n13,000\nTotal owned facilities\n1,055,000\nLeased facilities:\nRochester, New York\n90,000\nOther U.S. locations\n1,541,000\nInternational locations\n92,000\nTotal leased facilities\n1,723,000\nOur facilities in Rochester, New York house various distribution, processing, and technology functions, certain ancillary functions, a telemarketing unit, and other back-office functions. Facilities outside of Rochester, New York are in various locations throughout the U.S. and house our service centers, fulfillment centers and sales functions. Our international locations primarily house our European operations in Denmark and Germany and a location in India houses information technology, service, and sales support functions.\nDuring fiscal 2021, the Company substantially completed cost-saving initiatives, including an acceleration of our long-term strategy to reduce our geographic footprint. As such, the Company ceased the use of certain leased properties. We believe that adequate, suitable lease space will continue to be available to meet our needs.",
    "item_3": "Item 3. Legal Proceedings\nWe are subject to various claims and legal matters that arise in the normal course of our business. Refer to Note Q of the Notes to Consolidated Financial Statements contained in Item 8 of this Form 10-K for further discussion of our legal proceedings, if any.",
    "item_4": "Item 4. Mine Safety Disclosures\nNot applicable.\nPART II",
    "item_5": "Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur common stock trades on the NASDAQ Global Select Market under the symbol “PAYX”. Dividends have historically been paid on our common stock in August, November, February, and May. The level and continuation of future dividends are dependent on our future earnings and cash flows and are subject to the discretion of our Board of Directors (the “Board”).\nAs of June 30, 2021, there were 10,611 holders of record of our common stock, which includes registered holders and participants in the Paychex, Inc. Dividend Reinvestment and Stock Purchase Plan. There were also 3,733 participants in the Paychex, Inc. Qualified Employee Stock Purchase Plan and 4,177 participants in the Paychex, Inc. Employee Stock Ownership Plan.\nIn May 2019, our Board approved a program to repurchase up to $400.0 million of our common stock with authorization expiring in May 2022. All shares repurchased during fiscal 2021 were retired and were as follows:\nIn millions, except per share amount\nTotal\n‎number\n‎of shares\n‎purchased\nAverage price paid per share\nTotal dollars\nApproximate dollar value of shares that may yet be purchased under the program\nFirst quarter\n0.4\n$\n74.70\n$\n28.8\n$\n199.3\nSecond quarter\n-\n$\n-\n-\n$\n199.3\nThird quarter\n0.5\n$\n90.38\n47.2\n$\n152.1\nMarch 1 to March 31, 2021\n-\n$\n-\n-\n$\n152.1\nApril 1 to April 30, 2021\n-\n$\n-\n-\n$\n152.1\nMay 1 to May 31, 2021\n0.8\n$\n98.83\n79.7\n$\n72.4\nFiscal year\n1.7\n$\n90.83\n$\n155.7\nIn July 2021, our Board authorized an additional program allowing us to repurchase up to $400.0 million of our common stock which expires on January 31, 2024.\nThe following graph shows a five-year comparison of the total cumulative returns of investing $100 on May 31, 2016, in Paychex common stock, the S&P 500 Index, and two Peer Group Indexes. All comparisons of stock price performance shown assume reinvestment of dividends. We are a participant in the S&P 500 Index, a market group of companies with a larger than average market capitalization. Our Peer Group is a group of companies with comparable revenue and net income, who are in a comparable industry, or who are direct competitors of Paychex (as detailed below).\nMay 31,\nPaychex\n$100.00\n$112.73\n$128.98\n$174.18\n$151.49\n$218.39\nS&P 500\n$100.00\n$117.47\n$134.36\n$139.45\n$157.35\n$220.79\nPeer Group - old\n$100.00\n$118.33\n$150.41\n$176.65\n$194.66\n$254.29\nPeer Group - new\n$100.00\n$116.29\n$145.72\n$169.82\n$190.66\n$246.04\nThere can be no assurance that our stock performance will continue with the same or similar trends depicted in the graph above. We neither make nor endorse any predictions as to future stock performance.\nThe Governance & Compensation Committee of our Board annually reviews and approves the selection of Peer Group companies, adjusting the group from year to year based upon our business and changes in the Peer Group companies’ business or the comparability of their metrics. The Peer Group may also be adjusted in the event of mergers, acquisitions, or other significant economic changes. The Peer Group was adjusted for fiscal 2021. The Dun & Bradstreet Corporation, TD AMERITRADE Holding Corporation, Total Systems Services, Inc. and Worldpay, Inc. were removed and replaced with FleetCor Technologies, Inc., Sabre Corporation, TransUnion and Verisk Analytics, Inc., as they are more closely aligned with the Paychex business. Both the old and new peer groups are presented for this year of transition.\nOur new Peer Group for fiscal 2021 is comprised of the following companies:\nAlliance Data Systems Corporation\nIHS Markit, Ltd.\nAutomatic Data Processing, Inc. (direct competitor)\nIntuit Inc.\nBroadridge Financial Solutions, Inc.\nMoody’s Corporation\nEquifax, Inc.\nSabre Corporation\nFiserv, Inc.\nTransUnion\nFleetCor Technologies, Inc.\nVerisk Analytics, Inc.\nGlobal Payments Inc.\nThe Western Union Company\nH&R Block, Inc.",
    "item_6": "Item 6. [Reserved]",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations reviews the operating results of Paychex, Inc. and its wholly owned subsidiaries (“Paychex,” the “Company,” “we,” “our,” or “us”) for our fiscal year ended May 31, 2021 (“fiscal 2021” or the “fiscal year”), as compared to our fiscal year ended May 31, 2020 (“fiscal 2020”), and our financial condition as of May 31, 2021. A detailed review of our fiscal 2020 performance compared to our fiscal year ended May 31, 2019 performance and our financial condition as of May 31, 2020 is set forth in Part II, Item 7 of our Annual Report on Form 10-K (“Form 10-K”) for fiscal 2020. This review should be read in conjunction with the accompanying consolidated financial statements and the related Notes to Consolidated Financial Statements contained in Item 8 of this Form 10-K and the “Risk Factors” discussed in Item 1A of this Form 10-K. Forward-looking statements in this review are qualified by the cautionary statement under the heading “Cautionary Note Regarding Forward-Looking Statements” contained at the beginning of Part I of this Form 10-K.\nOverview\nWe are a leading human resource (“HR”) software and services company, offering HR, payroll, benefits, and insurance services for small- to medium-sized businesses. Within our human capital management (“HCM”) solutions, we offer a comprehensive portfolio of services and products that allow our clients to meet their diverse HR and payroll needs.\nWe support our small-business clients, reducing the complexity and risk of running their own payroll, while ensuring greater accuracy with up-to-date tax rates and regulatory information. Clients may choose to have our service team handle everything for them, or process payroll themselves utilizing our proprietary, robust software-as-a-service (“SaaS”) Paychex Flex® platform and our SurePayroll® SaaS-based products. Our medium-sized clients generally have more complex payroll and employee benefit needs, though with the environment of increasing regulations, we believe the need for HR outsourcing services has been moving down-market. Any of our clients on Paychex Flex can opt for the integrated suite of HCM solutions, which allows clients to choose the services and software that will meet the needs of their business.\nOur portfolio of HCM and employee benefit-related services is disaggregated into two categories, (1) Management Solutions and (2) Professional Employer Organization (“PEO”) and Insurance Solutions, as discussed in Part 1, Item 1 of this Form 10-K.\nOur mission is to be the leading provider of HR, payroll, benefits, and insurance solutions by being an essential partner to small- and medium-sized businesses across the United States (“U.S.”) and parts of Europe. We believe that success in this mission will lead to strong, long-term financial performance. Our strategy focuses on providing industry-leading, integrated technology; increasing client satisfaction; expanding our leadership in HR; growing our client base; and engaging in strategic acquisitions.\nWe continue to focus on driving growth in the number of clients, revenue per client, total revenue, and profits, while providing industry-leading service and technology solutions to our clients and their employees. We maintain industry-leading margins by managing our personnel costs and expenses while continuing to invest in our business, particularly in sales and marketing and leading-edge technology. We believe these investments are critical to our success. Looking to the future, we believe that investing in our products, people, and service capabilities will position us to capitalize on opportunities for long-term growth.\nA key component of our service delivery strategy is to be a proactive partner with our clients and to develop and release integrated solutions within Paychex Flex to meet their current and future needs. Our ongoing investments in our platforms have prepared us well for the demands of the current business and regulatory environments, allowing us to adapt while maintaining strong service delivery, resulting in high levels of client satisfaction and retention.\nFiscal 2021 Business Highlights\nHighlights compared to fiscal 2020 are as follows:\nFiscal Year\nIn millions, except per share amounts\nChange(3)\nTotal service revenue\n$\n3,997.5\n$\n3,953.6\n%\nTotal revenue\n$\n4,056.8\n$\n4,040.5\n-\n%\nOperating income\n$\n1,460.7\n$\n1,460.5\n-\n%\nNet income\n$\n1,097.5\n$\n1,098.1\n-\n%\nAdjusted net income(1)\n$\n1,102.4\n$\n1,083.2\n%\nDiluted earnings per share\n$\n3.03\n$\n3.04\n-\n%\nAdjusted diluted earnings per share(1)\n$\n3.04\n$\n3.00\n%\nDividends paid to stockholders(2)\n$\n908.7\n$\n889.4\n%\n(1)Adjusted net income and adjusted diluted earnings per share are not U.S. generally accepted accounting principle (“GAAP”) measures. Refer to the “Non-GAAP Financial Measures” section of this Item 7 for a discussion of non-GAAP measures and a reconciliation to the U.S. GAAP measures of net income and diluted earnings per share.\n(2)Dividends paid to stockholders represented approximately 83% of net income for fiscal 2021 compared to approximately 81% of net income for fiscal 2020.\n(3)Percentage changes are calculated based on unrounded numbers.\nFor further analysis of our results of operations for fiscal years 2021 and 2020, and our financial position as of May 31, 2021, refer to the tables and analysis in the “Results of Operations” and “Liquidity and Capital Resources” sections of this Item 7.\nBusiness Outlook\nOur payroll and PEO client base was greater than 710,000 and 680,000 clients as of May 31, 2021 and May 31, 2020, respectively. Client retention was at record levels of approximately 85% of the beginning client base for fiscal 2021, compared to over 83% for fiscal 2020.\nWhile our HR product offerings provide services to employers and employees beyond payroll, they effectively leverage payroll processing data. These services are included as part of the integrated HCM solution within Paychex Flex or provided through the PEO platform. The following table illustrates the growth in selected HR product offerings:\n$ in billions\nAs of May 31,\nChange(1)\nPaychex HR Solutions and PEO client worksite employees\n1,680,000\n1,428,000\n%\nPaychex HR Solutions and PEO clients\n62,000\n55,000\n%\nHealth and benefits services applicants\n205,000\n182,000\n%\nRetirement services plans\n96,000\n91,000\n%\nAsset value of retirement services participants’ funds\n$\n42.0\n$\n32.3\n%\n(1)Percentage changes are calculated based on unrounded numbers.\nWe continue to make investments in technology a priority as companies look to leverage technology solutions to maintain operations, stay connected to employees, and increase productivity. In fiscal 2021, we enhanced our solutions to support businesses as they navigate the federal stimulus programs and engage in digital transformation. We have continued to evolve our products to help business leaders find, hire, and retain employees quickly and effectively with an eye on driving engagement and managing labor costs. Our fiscal 2021 technology and solution developments provide a unique combination of data, technology, and service designed to meet the evolving needs of employers and employees, and include:\nPortfolio of Paycheck Protection Program (“PPP”) tools, which include the ability for employers to easily navigate the complexities of the PPP and Employee Retention Tax Credit (“ERTC”). This portfolio contains resources to help small businesses navigate complex regulations and evaluate business decisions during this challenging time as well as tools for PPP loan applications, including access to small business loan providers, and signature-ready PPP loan forgiveness applications. We have continued to update these tools in near real-time throughout the COVID-19 pandemic in response to changes in regulations.\nEmployee health and safety offerings, including a COVID-19 leave tracking tool to identify employee-submitted issues, a COVID-19 screening tool to give employers a way to initiate employee COVID-19 screenings and track test results within a single platform, and health attestation solutions which enable employers to customize and\ndigitally distribute a health attestation form to employees daily, securely store responses in real-time, and view advanced analytics for individuals or the entire workforce.\nDigital communication solutions, including Paychex Flex HR Connect and HR Conversations, which helps strengthen connections and keep workers engaged no matter their work location. Paychex Flex HR Connect provides the ability to digitally submit questions, requests, and incidents directly to HR through an easy-to-use workflow. HR Conversations enables managers, employees, and HR staff to initiate communications with employees and enhancements to performance assessments allow for 360-degree feedback digitally within the tool.\nPooled Employer Plan, which provides business owners with a plan option that relieves the compliance and administration burdens of a traditional 401(k) plan, giving their employees access to a retirement plan benefit and allowing them to prepare for their future.\nClover® Integration, which streamlines payroll and time and attendance management for business owners using the popular Clover platform from Fiserv. With Paychex Flex available in the Clover App Market, business owners can more efficiently manage the essential tasks of payroll, staffing, time tracking, and scheduling all within a single application to help save time, increase accuracy, and reduce cost.\nPaychex Flex Labor Cost Hub, which gives customers and CPAs a holistic, real-time view of total payroll labor job costing and labor distribution in one place, enabling them to see how much they are spending on a significant operational expense - their workforce.\nEnhanced Onboarding Self-Service experience, which simplifies the user experience for entering and reviewing new-hire information and includes the ability to invite employees to complete onboarding and documentation digitally.\nEnhancements to data analytics and Live Reports throughout the Platform. For example, the Diversity and Equal Pay Live Report builds upon a recently released Equal Employment Opportunity-1 compliance solution and gives administrators the ability to analyze their pay and diversity data via a simple, customizable report. With improved access to this critical data, businesses are better positioned to uncover opportunities to create a more diverse and equitable workforce, while also meeting compliance requirements.\nPEO Protection Plus Package reduces risks for business owners by offering insurance coverage related to cyberattacks and employee lawsuits. By offering both Cyber Liability and Employment Practices Liability Insurance coverage as part of our PEO solution, and by leveraging the group plan model of our PEO, the coverage is significantly more affordable to businesses.\nWe continue to strengthen our position in the industry by serving as a source of education and information to clients, businesses of all sizes, and other interested parties. We provide free webinars, white papers, and other information on our website to aid existing and prospective clients with the impact of regulatory changes. The Paychex Insurance Agency, Inc. website, www.paychex.com/group-health-insurance, helps small-business owners navigate the area of insurance coverage. Both this website and www.paychex.com/worx have sections dedicated to the topic of health care reform.\nCOVID-19 Update\nAs the global COVID-19 pandemic has continued to evolve, our priority has been, and continues to be, the health and safety of our employees. A portion of our workforce that initially transitioned to work remotely has voluntarily returned to the office. As vaccination levels continue to increase and masking and social distancing guidelines further relax, we look forward to welcoming more of our employees back to their office locations. We currently anticipate a general return to the office in September 2021, with a greater level of flexibility in response to the feedback our employees have shared with us.\nAs our clients continue to manage through the COVID-19 pandemic, we remain committed to helping them adapt and thrive, not only through the uncertainties of the COVID-19 pandemic, but the transition to the future business environment. We have brought a multifaceted response to the pandemic and delivered resources and services to help our clients respond and adapt. The COVID-19 Help Center on our website continues to provide support throughout every stage of the pandemic. Since the Help Center’s launch in March 2020, it has been viewed by over a half million visitors. On June 5, 2020, the PPP Flexibility Act was signed into law, relaxing the original requirements for how businesses could use PPP loans and continue to qualify for forgiveness. Within days of the bill passing, we introduced a PPP Loan Forgiveness Estimator and Forgiveness Report in our cloud-based HR suite, Paychex Flex, to simplify the application process for customers and provide them the accurate information needed to satisfy the new forgiveness requirements. As of May 31, 2021, Paychex customers have secured $65 billion in PPP relief funds and $2.5 billion in combined employee retention tax credits and paid leave credits. As the global economy continues\nto evolve, whether due to legislative changes, the pandemic, or other factors, we are committed to supporting our clients to help them navigate these challenges. Our blend of technology and service provides valuable tools and resources to assist our clients and their employees during this critical time and beyond.\nThe effects of the COVID-19 pandemic impacted our results and year-over-year comparisons, however, our client base continued to grow with sales performance and client retention that was at record levels. Our strong balance sheet and operational flexibility have allowed us to successfully manage through the ongoing impacts of the COVID-19 pandemic to date while protecting our cash flow and liquidity. In addition, during the first half of this fiscal year, we substantially completed cost-saving initiatives, including an acceleration of our long-term strategy to reduce our geographic footprint and headcount optimization. We ended this year with strong momentum having navigated through a fiscal year of unprecedented challenge and the uncertain environment of the COVID-19 pandemic. We are well-positioned with a broad portfolio of innovative technology and products along with our unparalleled expertise to meet the continuing needs of businesses and help them succeed and thrive as they begin to bring employees back to work and adjust to the changes of how, where, and when work gets done.\nWe continue to evaluate the nature and extent of changes to the market and economic conditions related to the COVID-19 pandemic and will assess the potential impact on our business and financial position. Despite improving macroeconomic conditions and the emergence of vaccines, surges in COVID-19 cases, including variants of the strain, such as those recently experienced in Europe and the U.S., may cause people to self-quarantine or governments to shut down nonessential businesses again. We expect that the pandemic will continue to have an effect on our results, although the magnitude, duration, and full effects of the pandemic on our future results of operations or cash flows are not possible to predict at this time.\nFor further information on the risks posed to our business from the COVID-19 pandemic, refer to Item 1A of this Form 10-K.\nResults of Operations\nSummary of Results of Operations for Fiscal Years:\nIn millions, except per share amounts\nChange(1)\nRevenue:\nManagement Solutions\n$\n3,023.4\n$\n2,963.0\n%\nPEO and Insurance Solutions\n974.1\n990.6\n(2)\n%\nTotal service revenue\n3,997.5\n3,953.6\n%\nInterest on funds held for clients\n59.3\n86.9\n(32)\n%\nTotal revenue\n4,056.8\n4,040.5\n-\n%\nTotal expenses\n2,596.1\n2,580.0\n%\nOperating income\n1,460.7\n1,460.5\n-\n%\nOther expense, net\n(26.5)\n(23.4)\nn/m\nIncome before income taxes\n1,434.2\n1,437.1\n-\n%\nIncome taxes\n336.7\n339.0\n(1)\n%\nEffective income tax rate\n23.5\n%\n23.6\n%\nNet income\n$\n1,097.5\n$\n1,098.1\n-\n%\nDiluted earnings per share\n$\n3.03\n$\n3.04\n-\n%\n(1)Percentage changes are calculated based on unrounded numbers.\nn/m - not meaningful\nThe changes in revenue as compared to the prior year period were primarily driven by the following factors:\nManagement Solutions revenue: $3.0 billion for fiscal 2021, reflecting an increase of 2%:\noPayroll client base growth of approximately 4%, due to solid sales performance and record client retention, and\n‎\noIncreased penetration of our suite of solutions, including HR Solutions, Retirement Services, and Time and Attendance, and growth in ancillary products and services due to higher transaction volumes, offset by\noDecline in check volumes experienced during the first three quarters of our fiscal year from an overall reduction in the number of clients processing payrolls due to lower employment levels during the pandemic.\nPEO and Insurance Solutions revenue: $974.1 million for fiscal 2021, reflecting a decrease of 2%:\noDecrease in the number of worksite employees at our clients in the first three quarters, offset by growth in the fourth quarter, and\noLower workers’ compensation premiums driven by reduced wages and softening of market rates, offset by\noIncrease in the number of health and benefit clients.\nInterest on funds held for clients: $59.3 million for fiscal 2021, reflecting a decrease of 32%:\noLower average interest rates, due to historically low federal funds rates, and\noLower realized gains, which primarily resulted from our decision to strategically reposition our client fund portfolio at the end of fiscal 2020 to enhance liquidity in response to the economic uncertainties caused by COVID-19.\noAverage investment balances were consistent.\nWe invest in highly liquid, investment-grade fixed income securities and do not utilize derivative instruments to manage interest rate risk. As of May 31, 2021, we had no exposure to high-risk or non-liquid investments. Details regarding our combined funds held for clients and corporate cash equivalents and investment portfolios are as follows:\nYear ended May 31,\n$ in millions\nAverage investment balances:\nFunds held for clients\n$\n3,941.9\n$\n3,931.3\nCorporate cash equivalents and investments\n1,043.3\n870.7\nTotal\n$\n4,985.2\n$\n4,802.0\nAverage interest rates earned (exclusive of net realized gains/(losses)):\nFunds held for clients\n1.5\n%\n1.9\n%\nCorporate cash equivalents and investments\n0.2\n%\n1.4\n%\nCombined funds held for clients and corporate cash equivalents and investments\n1.2\n%\n1.8\n%\nTotal net realized gains\n$\n1.2\n$\n11.3\n$ in millions\nAs of May 31,\nNet unrealized gains on AFS securities(1)\n$\n79.3\n$\n100.0\nFederal Funds rate(2)\n0.25\n%\n0.25\n%\nTotal fair value of AFS securities\n$\n3,020.2\n$\n2,757.2\nWeighted-average duration of AFS securities in years(3)\n3.3\n2.9\nWeighted-average yield-to-maturity of AFS securities(3)\n1.9\n%\n2.1\n%\n(1)The net unrealized gain on our investment portfolios was approximately $77.4 million as of July 14, 2021.\n(2)The Federal Funds rate was in the range of 0.00% to 0.25% as of both May 31, 2021 and May 31, 2020.\n(3)These items exclude the impact of variable rate demand notes (“VRDNs”), as they are tied to short-term interest rates.\nRefer to the “Market Risk Factors” section contained in",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nMarket Risk Factors\nChanges in interest rates and interest rate risk: Funds held for clients are primarily comprised of short-term funds and AFS securities. Corporate investments are primarily comprised of AFS securities. As a result of our investing activities, we are exposed to changes in interest rates that may materially affect our results of operations and financial position. Changes in interest rates will impact the earnings potential of future investments and will cause fluctuations in the fair value of our longer-term AFS securities. We follow an investment strategy of protecting principal and optimizing liquidity. A substantial portion of our portfolios is invested in high credit quality securities with ratings of AA or higher, and A-1/P-1 ratings on short-term securities. We invest predominately in municipal bonds - including general obligation bonds and revenue bonds; U.S. government agency and treasury securities; and corporate bonds. We limit the amounts that can be invested in any single issuer and invest primarily in short- to intermediate-term instruments whose fair value is less sensitive to interest rate changes. We manage the AFS securities to a benchmark duration of two and one-half to three and three-quarters years.\nDuring fiscal 2021, our primary short-term investment vehicles were bank demand deposit accounts and VRDNs. We have no exposure to high-risk or non-liquid investments. We have insignificant exposure to European investments. We have not and do not utilize derivative financial instruments to manage our interest rate risk.\nDuring fiscal 2021, the average interest rate earned on our combined funds held for clients and corporate cash equivalents and investment portfolios was 1.2%, compared to 1.8% for fiscal 2020. When interest rates are falling, the full impact of lower interest rates will not immediately be reflected in net income due to the interaction of short- and long-term interest rate changes. During a falling interest rate environment, earnings decrease from our short-term investments, and over time, earnings will decrease from our longer-term AFS securities. Earnings from the AFS securities, which as of May 31, 2021 had an average duration of 3.3 years, would not reflect decreases in interest rates until the investments are sold or mature and the proceeds are reinvested at lower rates.\nThe amortized cost and fair value of AFS securities that had stated maturities as of May 31, 2021 are shown below by expected maturity.\nMay 31, 2021\nAmortized\nFair\nIn millions\ncost\nvalue\nMaturity date:\nDue in one year or less\n$\n335.7\n$\n338.6\nDue after one year through three years\n731.6\n759.0\nDue after three years through five years\n970.6\n1,008.3\nDue after five years\n903.0\n914.3\nTotal\n$\n2,940.9\n$\n3,020.2\nVRDNs are primarily categorized as due after five years in the table above as the contractual maturities on these securities are typically 20 to 30 years. Although these securities are issued as long-term securities, they are priced and traded as short-term instruments because of the liquidity provided through the tender feature.\nThe Federal Reserve reduced the Federal Funds rate a total of 225 basis points during fiscal 2020, of which 150 basis points was in response to the COVID-19 pandemic. As of May 31, 2021 and May 31, 2020, the Federal Funds rate was in the range of 0.00% to 0.25% There continues to be uncertainty in the changing market and economic conditions, including the possibility of additional measures that could be taken by the Federal Reserve and other government agencies, related to the COVID-19 pandemic. We will continue to monitor market conditions.\nCalculating the future effects of changing interest rates involves many factors. These factors include, but are not limited to:\ngovernmental action resulting from the COVID-19 pandemic;\ndaily interest rate changes;\nseasonal variations in investment balances;\nactual duration of short-term and AFS securities;\nthe proportion of taxable and tax-exempt investments;\n‎\nchanges in tax-exempt municipal rates versus taxable investment rates, which are not synchronized or simultaneous; and\nfinancial market volatility and the resulting effect on benchmark and other indexing interest rates.\nSubject to these factors and under normal financial market conditions, a 25-basis-point change in taxable interest rates generally affects our tax-exempt interest rates by approximately 17 basis points. Under normal financial market conditions, the impact to earnings from a 25-basis-point change in short-term interest rates would be approximately $3.0 million to $3.5 million, after taxes, for a twelve-month period. Such a basis point change may or may not be tied to changes in the Federal Funds rate.\nOur total investment portfolio (funds held for clients and corporate cash equivalents and investments) averaged approximately $5.0 billion for fiscal 2021. Our anticipated allocation is approximately 40% invested in short-term securities and VRDNs with an average duration of less than 30 days, and 60% invested in available-for-sale securities with an average duration of two and one-half to three and three-quarters years.\nThe combined funds held for clients and corporate available-for-sale securities reflected net unrealized gains of $79.3 million and $100.0 million as of May 31, 2021 and May 31, 2020, respectively. Refer to Note H of the Notes to Consolidated Financial Statements contained in",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nDescription\nPage\nReport on Management’s Assessment of Internal Control Over Financial Reporting\nReport of Independent Registered Public Accounting Firm\nConsolidated Statements of Income and Comprehensive Income for the Years Ended May 31, 2021, 2020, and 2019\nConsolidated Balance Sheets as of May 31, 2021 and 2020\nConsolidated Statements of Stockholders’ Equity for the Years Ended May 31, 2021, 2020, and 2019\nConsolidated Statements of Cash Flows for the Years Ended May 31, 2021, 2020, and 2019\nNotes to Consolidated Financial Statements\nSchedule II - Valuation and Qualifying Accounts for the Years Ended May 31, 2021, 2020, and 2019\nREPORT ON MANAGEMENT’S ASSESSMENT OF\nINTERNAL CONTROL OVER FINANCIAL REPORTING\nManagement of Paychex, Inc. (the “Company”) is responsible for establishing and maintaining adequate internal control over financial reporting as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934, as amended. The Company’s internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of the financial statements for external purposes in accordance with generally accepted accounting principles.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement assessed the effectiveness of the Company’s internal control over financial reporting as of May 31, 2021. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in “Internal Control - Integrated Framework” (2013). Based on our assessment, management determined that the Company maintained effective internal control over financial reporting as of May 31, 2021.\nThe Company’s independent registered public accounting firm, PricewaterhouseCoopers LLP, is appointed by the Company’s Audit Committee. PricewaterhouseCoopers LLP has audited the Consolidated Financial Statements included in this Annual Report on Form 10-K and the effectiveness of the Company’s internal control over financial reporting as of May 31, 2021, and as a part of their integrated audit, has issued their report, included herein, on the effectiveness of the Company’s internal control over financial reporting.\n/s/ Martin Mucci\nMartin Mucci\nPresident and Chief Executive Officer\n/s/ Efrain Rivera\nEfrain Rivera\nSenior Vice President, Chief Financial Officer, and Treasurer\n‎\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of Paychex, Inc.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Paychex, Inc. and its subsidiaries (the “Company”) as of May 31, 2021 and 2020, and the related consolidated statements of income and comprehensive income, of stockholders’ equity, and of cash flows for each of the three years in the period ended May 31, 2021, including the related notes and financial statement schedule listed in the accompanying index (collectively referred to as the “consolidated financial statements”). We also have audited the Company's internal control over financial reporting as of May 31, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of May 31, 2021 and 2020, and the results of its operations and its cash flows for each of the three years in the period ended May 31, 2021 in conformity with accounting principles generally accepted in the United States of America. Also, in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of May 31, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the COSO.\nChange in Accounting Principle\nAs discussed in Note A to the consolidated financial statements, the Company changed the manner in which it accounts for leases on June 1, 2019.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Report on Management’s Assessment of Internal Control Over Financial Reporting. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nProfessional Employer Organization (PEO) Insurance Reserves - Workers’ Compensation Insurance Reserves\nAs described in Note A to the consolidated financial statements, the Company offers workers’ compensation insurance to clients for the benefit of client employees. Workers’ compensation insurance is primarily provided under fully insured high deductible workers’ compensation insurance policies. Workers’ compensation insurance reserves are established to provide for the estimated costs of paying claims up to per occurrence liability limits. As of May 31, 2021, the total liability for workers’ compensation insurance reserves is $183.1 million. In establishing the workers' compensation insurance reserves, management uses an independent actuarial estimate of undiscounted future cash payments that would be made to settle the claims. The determination of estimated ultimate losses by the Company’s actuary are based on accepted actuarial methods and assumptions. The estimated ultimate losses are primarily based upon loss development factors, and other factors such as the nature of employees’ job responsibilities, the historical frequency and severity of workers’ compensation claims, and an estimate of future cost trends.\nThe principal considerations for our determination that performing procedures relating to PEO insurance reserves - workers’ compensation insurance reserves is a critical audit matter are (i) there was significant judgment by management in determining the workers’ compensation insurance reserves, which in turn led to a high degree of auditor judgment, subjectivity and effort in performing our procedures and evaluating management’s assumptions and actuarial estimates related to the loss development factors and other factors such as the historical frequency and severity of workers’ compensation claims and an estimate of future cost trends, and (ii) the audit effort included the involvement of professionals with specialized skill and knowledge.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to the Company’s workers’ compensation insurance reserves, including controls over the development of management’s assumptions and actuarial estimates related to the estimated loss development factors. These procedures also included, among others (i) the involvement of professionals with specialized skill and knowledge to assist in developing an independent estimate of the workers’ compensation insurance reserves and (ii) comparison of this independent estimate to management’s estimate to evaluate the reasonableness of management’s estimate. Developing an independent estimate involved (i) testing the completeness and accuracy of data provided by management and (ii) evaluating management’s model, assumptions and actuarial estimates related to the loss development factors and other factors such as the historical frequency and severity of workers’ compensation claims and an estimate of future cost trends.\n/s/ PricewaterhouseCoopers LLP\nRochester, New York\nJuly 16, 2021\nWe have served as the Company’s auditor since 2013.\nPAYCHEX, INC.\nCONSOLIDATED STATEMENTS OF INCOME AND COMPREHENSIVE INCOME\nIn millions, except per share amounts\nYear ended May 31,\nRevenue:\nManagement Solutions\n$\n3,023.4\n$\n2,963.0\n$\n2,877.7\nPEO and Insurance Solutions\n974.1\n990.6\n814.2\nTotal service revenue\n3,997.5\n3,953.6\n3,691.9\nInterest on funds held for clients\n59.3\n86.9\n80.6\nTotal revenue\n4,056.8\n4,040.5\n3,772.5\nExpenses:\nCost of service revenue\n1,271.2\n1,280.8\n1,177.8\nSelling, general and administrative expenses\n1,324.9\n1,299.2\n1,223.4\nTotal expenses\n2,596.1\n2,580.0\n2,401.2\nOperating income\n1,460.7\n1,460.5\n1,371.3\nOther expense, net\n(26.5)\n(23.4)\n(3.3)\nIncome before income taxes\n1,434.2\n1,437.1\n1,368.0\nIncome taxes\n336.7\n339.0\n333.6\nNet income\n$\n1,097.5\n$\n1,098.1\n$\n1,034.4\nOther comprehensive (loss)/income, net of tax\n(4.7)\n56.4\n36.3\nComprehensive income\n$\n1,092.8\n$\n1,154.5\n$\n1,070.7\nBasic earnings per share\n$\n3.05\n$\n3.06\n$\n2.88\nDiluted earnings per share\n$\n3.03\n$\n3.04\n$\n2.86\nWeighted-average common shares outstanding\n359.9\n358.5\n359.2\nWeighted-average common shares outstanding, assuming dilution\n362.1\n361.0\n361.8\nSee Notes to Consolidated Financial Statements.\nPAYCHEX, INC.\nCONSOLIDATED BALANCE SHEETS\nIn millions, except per share amounts\nAs of May 31,\nAssets\nCash and cash equivalents\n$\n995.2\n$\n905.2\nRestricted cash\n51.3\n49.8\nCorporate investments\n36.7\n27.2\nInterest receivable\n24.4\n26.2\nAccounts receivable, net of allowance for doubtful accounts\n578.3\n384.1\nPEO unbilled receivables, net of advance collections\n450.9\n380.0\nPrepaid income taxes\n33.5\n16.8\nPrepaid expenses and other current assets\n249.2\n244.8\nCurrent assets before funds held for clients\n2,419.5\n2,034.1\nFunds held for clients\n3,750.0\n3,430.5\nTotal current assets\n6,169.5\n5,464.6\nLong-term restricted cash\n37.0\n21.3\nLong-term corporate investments\n7.1\n10.2\nProperty and equipment, net of accumulated depreciation\n395.8\n407.4\nOperating lease right-of-use assets, net of accumulated amortization\n103.0\n114.8\nIntangible assets, net of accumulated amortization\n275.8\n330.6\nGoodwill\n1,820.7\n1,791.1\nLong-term deferred costs\n384.1\n372.5\nOther long-term assets\n34.2\n38.2\nTotal assets\n$\n9,227.2\n$\n8,550.7\nLiabilities\nAccounts payable\n$\n89.0\n$\n79.4\nAccrued corporate compensation and related items\n209.7\n131.7\nAccrued worksite employee compensation and related items\n586.4\n512.4\nShort-term borrowings\n7.4\n5.1\nAccrued income taxes\n-\n50.5\nDeferred revenue\n37.9\n39.2\nOther current liabilities\n336.8\n277.6\nCurrent liabilities before client fund obligations\n1,267.2\n1,095.9\nClient fund obligations\n3,671.0\n3,331.0\nTotal current liabilities\n4,938.2\n4,426.9\nAccrued income taxes\n25.8\n33.5\nDeferred income taxes\n218.0\n240.8\nLong-term borrowings, net of debt issuance costs\n797.3\n796.8\nOperating lease liabilities\n92.4\n96.9\nOther long-term liabilities\n207.5\n174.4\nTotal liabilities\n6,279.2\n5,769.3\nCommitments and contingencies - Note Q\nStockholders’ equity\nCommon stock, $0.01 par value; Authorized: 600.0 shares;\nIssued and outstanding: 359.8 shares as of May 31, 2021\nand 358.8 shares as of May 31, 2020\n3.6\n3.6\nAdditional paid-in capital\n1,446.7\n1,289.9\nRetained earnings\n1,445.9\n1,431.4\nAccumulated other comprehensive income\n51.8\n56.5\nTotal stockholders’ equity\n2,948.0\n2,781.4\nTotal liabilities and stockholders’ equity\n$\n9,227.2\n$\n8,550.7\nSee Notes to Consolidated Financial Statements.\nPAYCHEX, INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\nIn millions\nAccumulated\nAdditional\nother\nCommon stock\npaid-in\nRetained\ncomprehensive\nShares\nAmount\ncapital\nearnings\n(loss)/income\nTotal\nBalance as of May 31, 2018\n359.0\n$\n3.6\n$\n1,126.8\n$\n1,262.6\n$\n(36.2)\n$\n2,356.8\nNet income\n-\n-\n-\n1,034.4\n-\n1,034.4\nUnrealized gains on securities, net of $14.2 million in tax expense\n-\n-\n-\n-\n44.0\n44.0\nReclassification adjustment for realized gains on securities, net of $- million in tax expense (1)\n-\n-\n-\n-\n-\n-\nCash dividends declared ($2.30 per share)\n-\n-\n-\n(826.8)\n-\n(826.8)\nRepurchases of common shares (2)\n(0.7)\n-\n(1.4)\n(55.5)\n-\n(56.9)\nStock-based compensation\n-\n-\n46.2\n-\n-\n46.2\nForeign currency translation adjustment\n-\n-\n-\n-\n(7.7)\n(7.7)\nActivity related to equity-based plans\n1.0\n-\n34.7\n(5.2)\n-\n29.5\nBalance as of May 31, 2019\n359.3\n3.6\n1,206.3\n1,409.5\n0.1\n2,619.5\nNet income\n-\n-\n-\n1,098.1\n-\n1,098.1\nUnrealized gains on securities, net of $22.6 million in tax expense\n-\n-\n-\n-\n68.9\n68.9\nReclassification adjustment for realized gains on securities, net of $2.8 million in tax expense (1)\n-\n-\n-\n-\n(8.5)\n(8.5)\nCash dividends declared ($2.48 per share)\n-\n-\n-\n(889.4)\n-\n(889.4)\nRepurchases of common shares (2)\n(2.0)\n-\n(3.7)\n(168.2)\n-\n(171.9)\nStock-based compensation\n-\n-\n47.4\n-\n-\n47.4\nForeign currency translation adjustment\n-\n-\n-\n-\n(4.0)\n(4.0)\nActivity related to equity-based plans\n1.5\n-\n39.9\n(18.6)\n-\n21.3\nBalance as of May 31, 2020\n358.8\n3.6\n1,289.9\n1,431.4\n56.5\n2,781.4\nNet income\n-\n-\n-\n1,097.5\n-\n1,097.5\nUnrealized losses on securities, net of $4.8 million in tax benefit\n-\n-\n-\n-\n(14.7)\n(14.7)\nReclassification adjustment for realized gains on securities, net of $0.3 million in tax expense (1)\n-\n-\n-\n-\n(0.9)\n(0.9)\nCash dividends declared ($2.52 per share)\n-\n-\n-\n(908.7)\n-\n(908.7)\nRepurchases of common shares (2)\n(1.7)\n-\n(3.1)\n(152.6)\n-\n(155.7)\nStock-based compensation\n-\n-\n52.5\n-\n-\n52.5\nForeign currency translation adjustment\n-\n-\n-\n-\n10.9\n10.9\nActivity related to equity-based plans\n2.7\n-\n107.4\n(21.7)\n-\n85.7\nBalance as of May 31, 2021\n359.8\n$\n3.6\n$\n1,446.7\n$\n1,445.9\n$\n51.8\n$\n2,948.0\n(1)Reclassification adjustments out of accumulated other comprehensive income for realized gains, net of tax, on the sale of available-for-sale (“AFS”) securities are reflected in interest on funds held for clients and other expense, net on the Consolidated Statements of Income and Comprehensive Income.\n(2)The Company maintains a program to repurchase up to $400.0 million of its common stock, with authorization expiring on May 31, 2022. The purpose of this program is to manage common stock dilution. All shares of common stock repurchased were retired.\nSee Notes to Consolidated Financial Statements.\nPAYCHEX, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nIn millions\nYear ended May 31,\nOperating activities\nNet income\n$\n1,097.5\n$\n1,098.1\n$\n1,034.4\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization\n192.0\n209.7\n181.5\nAmortization of premiums and discounts on available-for-sale securities, net\n35.8\n40.8\n49.0\nAmortization of deferred contract costs\n191.4\n186.1\n180.2\nStock-based compensation costs\n52.5\n47.4\n46.2\n(Benefit)/provision for deferred income taxes\n(21.0)\n(4.0)\n4.7\nProvision for allowance for doubtful accounts\n8.0\n7.8\n3.3\nNet realized gains on sales of available-for-sale securities\n(1.2)\n(11.3)\n-\nChanges in operating assets and liabilities:\nInterest receivable\n1.8\n1.2\n4.8\nAccounts receivable and PEO unbilled receivables, net\n(272.9)\n55.1\n(117.2)\nPrepaid expenses and other current assets\n(15.8)\n(1.6)\n1.0\nAccounts payable and other current liabilities\n169.0\n(4.9)\n77.5\nDeferred costs\n(208.0)\n(196.6)\n(188.5)\nNet change in other long-term assets and liabilities\n32.1\n12.7\n(5.4)\nNet change in operating lease right-of-use assets and liabilities\n(0.9)\n0.4\n-\nNet cash provided by operating activities\n1,260.3\n1,440.9\n1,271.5\nInvesting activities\nPurchases of available-for-sale securities\n(6,089.7)\n(25,218.1)\n(35,145.8)\nProceeds from sales and maturities of available-for-sale securities\n5,771.9\n26,132.9\n34,638.8\nPurchases of property and equipment\n(114.6)\n(127.0)\n(123.8)\nAcquisition of businesses, net of cash acquired\n(19.5)\n(6.1)\n(992.2)\nPurchases of other assets\n(8.7)\n(9.8)\n(5.3)\nNet cash (used in)/provided by investing activities\n(460.6)\n771.9\n(1,628.3)\nFinancing activities\nNet change in client fund obligations\n340.0\n(453.3)\n(950.6)\nNet proceeds from short-term borrowings\n2.3\n5.1\n-\nProceeds from borrowings to fund acquisition\n-\n-\n796.3\nDividends paid\n(908.7)\n(889.4)\n(826.8)\nRepurchases of common shares\n(155.7)\n(171.9)\n(56.9)\nActivity related to equity-based plans\n85.7\n21.3\n29.5\nNet cash used in financing activities\n(636.4)\n(1,488.2)\n(1,008.5)\nNet change in cash, restricted cash, and equivalents\n163.3\n724.6\n(1,365.3)\nCash, restricted cash, and equivalents, beginning of fiscal year\n1,659.8\n935.2\n2,300.5\nCash, restricted cash, and equivalents, end of fiscal year\n$\n1,823.1\n$\n1,659.8\n$\n935.2\nReconciliation of cash, restricted cash, and equivalents\nCash and cash equivalents\n$\n995.2\n$\n905.2\n$\n673.6\nRestricted cash\n88.3\n71.1\n57.1\nRestricted cash and restricted cash equivalents included in funds held for clients\n739.6\n683.5\n204.5\nTotal cash, restricted cash, and equivalents\n$\n1,823.1\n$\n1,659.8\n$\n935.2\nSee Notes to Consolidated Financial Statements.\nPAYCHEX, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote A - Description of Business, Basis of Presentation, and Significant Accounting Policies\nDescription of business: Paychex, Inc. and its wholly owned subsidiaries (collectively, the “Company” or “Paychex”) is a leading human resource (“HR”) software and services company, offering integrated human capital management (“HCM”) solutions for HR, payroll, benefits, and insurance services for small- to medium-sized businesses in the United States (“U.S.”). The Company also has operations in parts of Europe.\nPaychex, a Delaware corporation formed in 1979, reports as one segment. Substantially all of the Company’s revenue is generated within the U.S. Approximately one percent of the Company’s total revenue was generated within Europe for each of the fiscal years ended May 31, 2021 (“fiscal 2021”), May 31, 2020 (“fiscal 2020”), and May 31, 2019 (“fiscal 2019”). Long-lived assets in Europe were approximately 7% and 5% of total long-lived assets of the Company as of May 31, 2021 and May 31, 2020, respectively.\nWithin Paychex’s HCM solutions, Paychex offers a comprehensive portfolio of services and products that allow its clients to meet their diverse HR and payroll needs. Clients can select services on an á la carte basis or as part of various product bundles. Paychex’s offerings often leverage the information gathered in its base payroll processing service, allowing the Company to provide comprehensive outsourcing services covering the HCM spectrum.\nPaychex supports its small business clients utilizing its proprietary, robust, software-as-a-service (“SaaS”) Paychex Flex® platform and the Company’s SurePayroll® SaaS-based products. Both products allow users to process payroll when they want, how they want, and on any type of device (desktop, tablet, and mobile phone). Paychex’s medium-sized clients generally have more complex payroll and employee benefit needs and can opt for an integrated suite of HCM solutions, which allows them to choose the services and software that will meet the needs of their businesses. In the current environment of increasing regulations, the Company believes the needs for HR outsourcing solutions have been moving down-market.\nTotal revenue is comprised of service revenue and interest on funds held for clients. Service revenue is comprised primarily of the fees earned on the portfolio of HCM services, which include payroll processing, complementary HR management and administration services, professional employer organization (“PEO”) solutions, and insurance agency commissions. Refer to Note B of this Item 8 for further discussion of the Company’s service revenue.\nBasis of presentation: The consolidated financial statements include the accounts of Paychex, Inc., and its wholly owned subsidiaries. All intercompany accounts and transactions have been eliminated in consolidation. Certain disclosures are reported as zero balances due to rounding.\nReclassifications: Certain prior year amounts have been reclassified to conform to the current period presentation. These reclassifications had no effect on reported consolidated earnings.\nSubsequent Events: On July 7, 2021, our Board of Directors (the “Board”) voted to authorize a program to repurchase up to $400 million of Paychex common stock with authorization expiring on January 31, 2024. This repurchase program is in addition to the existing program with authorization expiring on May 31, 2022. On July 8, 2021, Paychex announced that its Board declared a regular quarterly dividend of $0.66 per share payable August 26, 2021 to stockholders of record as of August 2, 2021.\nCash and cash equivalents: Cash and cash equivalents consist of available cash, money market securities, and other investments with a maturity of 90 days or less at acquisition. Cash and cash equivalents include funds collected from the Company’s PEO clients for the payment of worksite employee payrolls and associated payroll taxes. Funds of $150.5 million and $136.4 million collected from PEO clients are included in cash and cash equivalents on the Company’s Consolidated Balance Sheets as of May 31, 2021 and May 31, 2020, respectively.\nRestricted cash and restricted cash equivalents: Restricted cash and restricted cash equivalents are recorded at fair value, and consist of cash and cash equivalents, primarily money market securities, included in funds held for clients and cash that is restricted in use for payment of workers’ compensation claims.\nAccounts receivable, net of allowance for doubtful accounts: Accounts receivable balances are shown on the Consolidated Balance Sheets net of the allowance for doubtful accounts of $16.0 million and $12.5 million as of May 31, 2021 and May 31, 2020, respectively. These balances include trade receivables for services provided to clients and purchased receivables related to payroll funding arrangements with clients in the temporary staffing industry. Trade receivables were $98.4 million and $84.7 million as of May 31, 2021 and May 31, 2020, respectively. Purchased receivables were $495.9 million and $311.9 million as of May 31, 2021 and May 31, 2020, respectively.\nThe Company is exposed to credit losses through the sale of services, payment of client obligations, and collection of purchased receivables. To mitigate this credit risk, the Company has multiple programs in place to assess and continuously monitor each client’s ability to pay for these products and services. Credit monitoring programs include, but are not limited to, new client credit reviews, establishing appropriate credit limits, monitoring of credit distressed clients, and early electronic wire and collection procedures. The Company also considers contract terms and conditions, client business type or strategy and may require collateralized asset support or prepayment to mitigate credit risk.\nAccounts receivable are written off and charged against the allowance for doubtful accounts when the Company has exhausted all collection efforts without success. The Company estimates its allowance for credit losses based on historical loss activity adjusted for current economic conditions and reasonable and supportable forecast factors, when applicable. The provision for the allowance for doubtful accounts and accounts written off were not material for the fiscal year ended May 31, 2021 and May 31, 2020, respectively. No single client had a material impact on total accounts receivable, service revenue, or results of operations for the fiscal year ended May 31, 2021 or May 31, 2020.\nPEO unbilled receivables, net of advance collections: The Company recognizes a liability for worksite employee gross wages and related payroll tax liabilities at the end of the period in which the worksite employee performs work, and where it assumes, under applicable state regulations, the obligation for the payment of payroll and payroll tax liabilities. The estimated payroll and payroll tax liabilities are recorded in accrued worksite employee compensation and related items on the Company’s Consolidated Balance Sheets. The associated unbilled receivables, including estimated revenues, offset by advance collections from clients, are recorded as PEO unbilled receivables, net of advance collections on the Company’s Consolidated Balance Sheets. As of May 31, 2021 and May 31, 2020, advance collections included in PEO unbilled receivables, net of advance collections were $2.5 million and $6.1 million, respectively.\nFunds held for clients and corporate investments: Marketable securities included in funds held for clients and corporate investments consist primarily of securities classified as AFS and are recorded at fair value obtained from an independent pricing service. The funds held for clients portfolio also includes cash and cash equivalents such as money market securities. Unrealized gains and losses, net of applicable income taxes, are reported as other comprehensive income in the Consolidated Statements of Income and Comprehensive Income. Realized gains and losses on the sale of AFS securities are determined by specific identification of the cost basis of each security. On the Consolidated Statements of Income and Comprehensive Income, realized gains and losses from the funds held for clients portfolio and corporate investments portfolio are included in interest on funds held for clients and other expense, net, respectively.\nConcentrations: Substantially all the Company’s deposited cash is maintained at large well-capitalized (as defined by their regulators) financial institutions. These deposits may exceed the amount of any insurance provided. All the Company’s deliverable securities, primarily municipal bond securities, are held in custody with certain of the aforementioned financial institutions, for which that institution bears the risk of custodial loss. Non-deliverable securities are primarily time deposits and money market funds.\nProperty and equipment, net of accumulated depreciation: Property and equipment is stated at cost, less accumulated depreciation. Depreciation is based on the estimated useful lives of property and equipment using the straight-line method. The estimated useful lives of depreciable assets are generally as follows:\nCategory\nDepreciable life\nBuildings and improvements\n10 to 35 years or the remaining life, whichever is shorter\nData processing equipment\n3 to 4 years\nFurniture, fixtures, and equipment\n2 to 7 years\nLeasehold improvements\n10 years or the life of the lease, whichever is shorter\nNormal and recurring repairs and maintenance costs are charged to expense as incurred. The Company reviews the carrying value of property and equipment for impairment when events or changes in circumstances indicate that the carrying value of such assets may not be recoverable.\nSoftware development and enhancements: Expenditures for software purchases and software developed for internal use are capitalized and depreciated on a straight-line basis over the estimated useful lives, which are generally 3 to 5 years. Software developed as part of the Company’s main processing platform is depreciated over 12 years. For software developed for internal use, certain costs are capitalized, including external direct costs of materials and services associated with developing or obtaining the software, and payroll and payroll-related costs for employees who are directly associated with internal-use software projects. Capitalization of these costs ceases no later than the point at which the project is substantially complete and ready for its intended use. Costs associated with preliminary project stage activities, training, maintenance, and other post-implementation stage activities are expensed as incurred. The carrying value of software and development costs is reviewed for impairment when events or changes in circumstances indicate that the carrying value of such assets may not be recoverable.\nGoodwill and other intangible assets, net of accumulated amortization: Goodwill is not amortized, but instead is tested for impairment on an annual basis and between annual tests if an event occurs or circumstances change in a way to indicate that there has been a potential decline in the fair value of a reporting unit. The Company performs its annual impairment testing in its fiscal fourth quarter. A qualitative analysis was performed for all reporting units in fiscal 2021, 2020, and 2019 to determine if it is more-likely-than-not that the fair value of the reporting units had declined below their carrying value. The qualitative assessment considered various financial, macroeconomic, industry, and reporting unit specific qualitative factors. Based on the results of the Company’s testing, no impairment loss was recognized in the results of operations for fiscal 2021, 2020, or 2019. Subsequent to the latest review, there have been no events or circumstances that indicate any potential impairment of the Company’s goodwill balance.\nIntangible assets are comprised primarily of client list acquisitions and are reported net of accumulated amortization on the Consolidated Balance Sheets. Intangible assets are amortized over periods generally ranging from 3 to 12 years. Certain client lists use an accelerated method, while other intangible assets use the straight-line method of amortization. In addition, the Company has intangible assets with indefinite useful lives, which are tested for impairment on an annual basis and between annual tests if an event occurs or circumstances change in a way to indicate that the carrying value may not be recoverable. The Company has determined there is no impairment of intangible assets with indefinite useful lives for fiscal 2021, 2020, or 2019.\nImpairment of Long-Lived Assets: Long-lived assets, including intangible assets with finite lives and operating lease right-of-use assets, are reviewed for impairment when events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Recoverability of assets to be held and used is measured by a comparison of the carrying amount of an asset to estimated undiscounted future cash flows expected to be generated by the asset. If the carrying amount of an asset exceeds its estimated future cash flows, an impairment charge is recognized for the amount by which the carrying amount of the asset exceeds the estimated fair value of the asset. The Company has determined that there was no impairment of long-lived assets for fiscal 2021, 2020, or 2019.\nForeign Currency: The financial statements of the Company’s foreign subsidiaries have been translated into U.S. dollars. Assets and liabilities are translated into U.S. dollars at period-end exchange rates. Income and expenses are translated at the average exchange rate for the reporting period. The resulting non-cash foreign currency translation adjustments, representing unrealized gains or losses, are included in Consolidated Statements of Stockholders’ Equity as a component of accumulated other comprehensive (loss)/income, net of tax. The Company did not have any material realized gains or losses resulting from foreign exchange transactions during fiscal 2021, 2020, or 2019.\nRevenue recognition: Revenues are primarily attributable to fees for providing services as well as investment income earned on funds held for clients. Fees associated with services are recognized in the period services are rendered and earned under service arrangements with clients where service fees are fixed or determinable and collectability is reasonably assured. The Company’s service revenue is largely attributable to processing services where the fee is based on a fixed amount per processing period or a fixed amount per processing period plus a fee per employee or transaction processed. Insurance Solutions revenues are recognized when commissions are earned on premiums billed and collected. Fees earned for funding payrolls of our clients in the temporary staffing agency via the purchase of accounts receivable are based on a percentage of funding amounts as specified in the client contract. These fees are then recognized over the average collection period of 35 to 45 days. The revenue earned from delivery service for the distribution of certain client payroll checks and reports is included in service revenue, and the costs for the delivery are included in cost of service revenue on the Consolidated Statements of Income and Comprehensive Income.\nThe Company receives advance payments for set-up fees from its clients. Advance payments received for certain of the Company’s service offerings for set-up fees are considered a material right. Therefore, the Company defers the revenue associated with these advance payments, recognizing the revenue and related expenses over the expected period to which the material right exists.\nPEO Solutions revenue is included in service revenue and is reported net of certain pass-through costs billed and incurred, which include payroll wages, payroll taxes, including federal and state unemployment insurance, and certain health insurance benefit premiums, primarily costs related to the Company’s guaranteed cost benefit plans. Direct costs related to workers’ compensation and certain benefit plans where the Company retains risk are recognized as cost of service revenue rather than as a reduction in service revenue. Refer to Note B of this Item 8 for further discussion of the PEO pass-through costs.\nInterest on funds held for clients is earned primarily on funds that are collected from clients before due dates for payroll tax administration services and for employee payment services and invested until remittance to the applicable tax or regulatory agencies or client employees. The interest earned on these funds is included in total revenue on the Consolidated Statements of Income and Comprehensive Income because the collecting, holding, and remitting of these funds are components of providing these services.\nAssets Recognized from the Costs to Obtain and Fulfill Contracts: The Company recognizes an asset for the incremental costs of obtaining a contract with a client if it is expected that the economic benefit and amortization period will be longer than one year. Incremental costs of obtaining a contract include only those costs that are directly related to the acquisition of new contracts and that would not have been incurred if the contract had not been obtained. The Company does not incur incremental costs to obtain a contract renewal. The Company determined that certain sales commissions and bonuses, including related fringe benefits, meet the capitalization criteria under Accounting Standards Codification (“ASC”) Subtopic 340-40, “Other Assets and Deferred Costs: Contracts with Customers” (“ASC 340-40”). The Company also recognizes an asset for the costs to fulfill a contract with a client if the costs are specifically identifiable, generate or enhance resources used to satisfy future performance obligations, and are expected to be recovered. The Company determined that substantially all costs related to implementation activities are administrative in nature and meet the capitalization criteria under ASC 340-40. These capitalized costs to fulfill a contract principally relate to upfront direct costs that are expected to be recovered and enhance the Company’s ability to satisfy future performance obligations.\nThe assets related to both costs to obtain and costs to fulfill contracts with clients are capitalized and amortized using an accelerated method over an eight-year life to closely align with the pattern of client attrition over the estimated life of the client relationship. The Company regularly reviews its deferred costs for potential impairment and did not recognize an impairment loss during fiscal 2021, 2020, or 2019.\nCost of service revenue: The Company’s costs and expenses applicable to total service revenue represent direct costs associated with providing HR, payroll, benefits, and insurance services. This includes labor-related costs, direct costs related to certain PEO offerings, postage and delivery costs, facility costs, professional services, and depreciation and amortization of property and equipment, including internally developed software.\nSelling, general and administrative expenses: The Company’s selling, general and administrative expenses represent labor-related costs, including amortization of deferred sales commissions and bonuses, corporate asset depreciation and amortization, marketing, and other general and administrative expenses incurred by the Company.\nPEO insurance reserves: As part of the PEO solution, the Company offers workers’ compensation insurance and health insurance to clients for the benefit of client employees. Workers’ compensation insurance is primarily provided under fully insured high deductible workers’ compensation insurance policies. Workers’ compensation insurance reserves are established to provide for the estimated costs of paying claims up to per occurrence liability limits. These reserves include estimates of certain expenses associated with processing and settling these claims. In establishing the PEO workers’ compensation insurance reserves, the Company uses an independent actuarial estimate of undiscounted future cash payments that would be made to settle claims. The determination of estimated ultimate losses by the Company’s independent actuary are based on accepted actuarial methods and assumptions. The estimated ultimate losses are primarily based upon loss development factors, and other factors such as the nature of employees’ job responsibilities, the historical frequency and severity of workers’ compensation claims, and an estimate of future cost trends. Each reporting period, changes in actuarial assumptions resulting from changes in actual claims experience and other trends are incorporated into our workers’ compensation claims cost estimates.\nThe Company’s maximum individual claims liability under its PEO workers’ compensation insurance policies was $1.0 million for both fiscal 2021 and fiscal 2020. As of May 31, 2021 and May 31, 2020, the Company had recorded current liabilities of $65.3 million and $72.3 million, respectively, and long-term liabilities of $117.8 million and $101.3 million, respectively, on its Consolidated Balance Sheets for workers’ compensation insurance reserves.\nWith respect to the PEO health insurance, the Company offers various health insurance plans that take the form of either fully insured guaranteed cost plans or fully insured insurance arrangements where the Company retains risk. A reserve for insurance arrangements where the Company retains risk is established to provide for the payment of claims in accordance with the Company’s service contract with the carrier. The claims liability includes estimates for reported losses, plus amounts for those claims incurred but not reported, and estimates of certain expenses associated with processing and settling the claims. The Company’s maximum individual claims liability was $0.3 million under its policies during both fiscal 2021 and fiscal 2020. Amounts accrued related to the health insurance and dental and vision plan reserves were $43.9 million and $36.7 million as of May 31, 2021 and May 31, 2020, respectively. These amounts are included in current liabilities on the Consolidated Balance Sheets.\nEstimating the ultimate cost of future claims is an uncertain and complex process based upon historical loss experience and independent actuarial loss projections, and is subject to change due to multiple factors, including economic trends, changes in legal liability law, and damage awards, all of which could materially impact the reserves as reported in the consolidated financial statements. Accordingly, final claim settlements may vary from the present estimates, particularly with workers’ compensation insurance where those payments may not occur until well into the future. The Company regularly reviews the adequacy of its estimated insurance reserves. Adjustments to previously established reserves are reflected in the results of operations for the period in which the adjustment is identified. Such adjustments could be significant, reflecting any combination of new and adverse or favorable trends. Adjustments to previously established reserves were not material for fiscal 2021, 2020, or 2019.\nLeases: The Company adopted the requirements of ASU No. 2016-02 on June 1, 2019. At contract inception, the Company determines if the new contractual arrangement is a lease or contains a leasing arrangement. If a contract contains a lease whose term is greater than one year, the Company evaluates whether it should be classified as an operating or a finance lease. Currently, all the Company’s leases have been classified as operating leases. Upon modification of a contract, the Company will reassess to determine if a contract is or contains a leasing arrangement.\nThe Company records lease liabilities based on the future estimated cash payments discounted over the lease term, defined as the non-cancellable time period of the lease, together with all the following:\nperiods covered by an option to extend the lease if the Company is reasonably certain to exercise the extension option; and\nperiods covered by an option to terminate the lease if the Company is reasonably certain not to exercise the termination option.\nLeases may also include options to terminate the arrangement or options to purchase the underlying lease property. The Company does not separate lease and non-lease components of contracts. Lease components provide the Company with the right to use an identified asset, which consist of the Company’s real estate properties and office equipment. Non-lease components consist primarily of maintenance services.\nAs an implicit discount rate is typically not readily determinable in the Company’s lease agreements, the Company uses its estimated secured incremental borrowing rate based on the information available at the lease commencement date in determining the present value of future lease payments. The incremental borrowing rate is determined using a portfolio approach utilizing publicly available information related to our unsecured borrowing rates. For certain leases with original terms of 12 months or less, the Company recognizes lease expense as incurred and does not recognize any lease liabilities. Short-term and long-term portions of operating lease liabilities are classified as other current liabilities and operating lease liabilities, respectively, in the Company’s Consolidated Balance Sheets.\nA right-of-use (“ROU”) asset is measured as the amount of the lease liability with adjustments, if applicable, for lease incentives, initial direct costs incurred by the Company, and lease prepayments made prior to or at lease commencement. ROU assets are classified as operating lease right-of-use assets, net of accumulated amortization, on the Company’s Consolidated Balance Sheets. The Company evaluates the carrying value of ROU assets if there are indicators of potential impairment and performs the analysis concurrent with the review of the recoverability of the related asset group. If the carrying value of the asset group is determined to not be fully recoverable and is in excess of its estimated fair value, the Company will record an impairment loss in its Consolidated Statements of Income and Comprehensive Income. The Company did not recognize an impairment loss during fiscal 2021 or fiscal 2020.\nFixed lease expense payments are recognized on a straight-line basis over the lease term. Variable lease payments vary because of changes in facts or circumstances occurring after the commencement date, other than the passage of time, and are often due to changes in an external market rate or the value of an index (e.g. Consumer Price Index). Variable lease payments are expensed as incurred in the Company’s Consolidated Statements of Income and Comprehensive Income.\nStock-based compensation costs: All stock-based awards to employees are recognized as compensation costs in the consolidated financial statements based on their fair values measured as of the date of grant. The Company estimates the fair value of stock option grants using a Black-Scholes option pricing model. This model requires various assumptions as inputs including expected volatility of the Paychex stock price and expected option life. Volatility is estimated based on a combination of historical volatility, using stock prices over a period equal to the expected option life, and implied market volatility. Expected option life is estimated based on historical exercise behavior. The Company periodically reassesses its assumptions as well as its choice of valuation model. The Company will reconsider use of this model if additional information becomes available in the future indicating that another model would provide a more accurate estimate of fair value or if characteristics of future grants would warrant such a change.\nThe fair value of stock awards is determined based on the stock price at the date of grant. For grants that do not accrue dividends or dividend equivalents, the fair value is the stock price reduced by the present value of estimated dividends over the vesting period or performance period.\nThe Company’s policy is to estimate forfeitures and only record compensation costs for those awards that are expected to vest. The assumptions for forfeitures are determined based on type of award and historical experience. Forfeiture assumptions are adjusted at the point in time a significant change is identified, with any adjustment recorded in the period of change, and the final adjustment at the end of the requisite service period to equal actual forfeitures.\nThe assumptions of volatility, expected option life, and forfeitures all require significant judgment and are subject to change in the future due to factors such as employee exercise behavior, stock price trends, and changes to type or provisions of stock-based awards. Any material change in one or more of these assumptions could have an impact on the estimated fair value of a future award.\nRefer to Note F of this Item 8 for further discussion of the Company’s stock-based compensation plans.\nIncome taxes: The Company accounts for deferred taxes by recognizing deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the consolidated financial statements or tax returns. Under this method, deferred tax assets and liabilities are determined based on the difference between the financial statement and tax basis of assets and liabilities, using enacted tax rates in effect for the fiscal year in which the differences are expected to reverse.\nThe Company also maintains a reserve for uncertain tax positions. The Company evaluates tax positions taken or expected to be taken in a tax return for recognition in its consolidated financial statements. Prior to recording the related tax benefit in the consolidated financial statements, the Company must conclude that tax positions will be more-likely-than-not to be sustained, assuming those positions will be examined by taxing authorities with full knowledge of all relevant information. The benefit recognized in the consolidated financial statements is the amount the Company expects to realize after examination by taxing authorities. If a tax position drops below the more-likely-than-not standard, the benefit can no longer be recognized. Assumptions, judgment, and the use of estimates are required in determining if the more-likely-than-not standard has been met when developing the provision for income taxes and in determining the expected benefit. A change in the assessment of the more-likely-than-not standard could materially impact the Company’s results of operations or financial position. Refer to Note L of this Item 8 for further discussion of the Company’s reserve for uncertain tax positions.\nUse of estimates: The preparation of financial statements in conformity with U.S. generally accepted accounting principles requires management to make estimates, judgments, and assumptions that affect reported amounts of assets, liabilities, revenue, and expenses during the reporting period. Actual amounts and results could differ from these estimates.\nRecently adopted accounting pronouncements: In June 2020, the Company adopted the following Accounting Standards Updates (“ASUs”), none of which had a material impact on its consolidated financial statements:\nASU No. 2020-04, “Reference Rate Reform (Topic 848): Facilitation of the Effects of Reference Rate Reform on Financial Reporting;”\nASU No. 2019-08, “Compensation - Stock Compensation (Topic 718) and Revenue from Contracts with Customers (Topic 606): Codification Improvements - Share-Based Consideration Payable to a Customer;”\nASU No. 2019-04, “Codification Improvements to Topic 326, Financial Instruments - Credit Losses, Topic 815, Derivatives and Hedging, and Topic 825, Financial Instruments;”\n‎\nASU No. 2018-18, “Collaborative Arrangements (Topic 808): Clarifying the Interaction between Topic 808 and Topic 606;”\nASU No. 2018-15, “Intangibles - Goodwill and Other - Internal-Use Software (Subtopic 350-40): Customer’s Accounting for Implementation Costs Incurred in a Cloud Computing Arrangement That Is a Service Contract (a consensus of the Financial Accounting Standards Board (“FASB”) Emerging Issues Task Force);”\nASU No. 2018-13, “Fair Value Measurement (Topic 820): Disclosure Framework - Changes to the Disclosure Requirements for Fair Value Measurement;”\nASU No. 2017-04, “Intangibles - Goodwill and Other (Topic 350): Simplifying the Test for Goodwill Impairments;” and\nASU No. 2016-13, “Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments,” as amended by subsequent ASUs on the topic, using a modified retrospective transition method.\nRecently issued accounting pronouncements: In October 2020, the FASB issued ASU No. 2020-08, “Codification Improvements to Subtopic 310-20, Receivables - Nonrefundable Fees and Other Costs.” The amendments in ASU No. 2020-08 clarify that an entity should reevaluate whether a callable debt security is within the scope of the Accounting Standards Codification (“ASC”) paragraph 310-20-35-33 for each reporting period. This guidance is effective for public business entities for fiscal years beginning after December 15, 2020, and for interim periods within those fiscal years. This guidance is applicable to the Company’s fiscal year beginning June 1, 2021. The adoption of this guidance will not have a material impact on the Company’s consolidated financial statements.\nIn December 2019, the FASB issued ASU No. 2019-12, “Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes.” ASU No. 2019-12 is intended to simplify various aspects related to accounting for income taxes, eliminates certain exceptions to the general principles in the ASC Topic 740 related to intra-period tax allocation, simplifies when companies recognize deferred taxes in an interim period, and clarifies certain aspects of the current guidance to promote consistent application. This guidance is effective for public business entities for fiscal years beginning after December 15, 2020, and for interim periods within those fiscal years, with early adoption permitted. This guidance is applicable to the Company’s fiscal year beginning June 1, 2021. The adoption of this guidance will not have a material impact on the Company’s consolidated financial statements.\nOther recent authoritative guidance issued by the FASB (including technical corrections to the FASB ASC), the American Institute of Certified Public Accountants, and the SEC did not, or are not expected to have a material impact on the Company’s consolidated financial statements.\nNote B - Service Revenue\nService revenue is primarily attributable to fees for providing services to the Company’s clients and is recognized when control of the contracted services is transferred to its clients, in an amount that reflects the consideration it expects to receive in exchange for such services. Insurance Solutions revenue is commissions earned on premiums collected and remitted to insurance carriers. The Company’s contracts generally do not contain specified contract periods and may be terminated by either party with 30-days notice of termination. Sales and other applicable non-payroll related taxes are excluded from service revenue.\nBased upon similar operational and economic characteristics, the Company’s service revenue is disaggregated by Management Solutions and PEO and Insurance Solutions as reported in the Company’s Consolidated Statements of Income and Comprehensive Income. The Company believes these revenue categories depict how the nature, amount, timing, and uncertainty of its revenue and cash flows are affected by economic factors.\nManagement Solutions Revenue\nManagement Solutions revenue is primarily derived from the Company’s payroll processing, payroll-related ancillary services, and HR outsourcing solutions. Clients can select services on an á la carte basis or as part of various product bundles. The Company’s offerings often leverage the information gathered in its base payroll processing service, allowing it to provide comprehensive outsourcing services covering the HCM spectrum. Management Solutions revenue is generally recognized over time as services are performed and the customer simultaneously receives and controls the benefits from these services.\nRevenue earned from delivery service for the distribution of certain client payroll checks and reports is also included in Management Solutions revenue in the Company’s Consolidated Statements of Income and Comprehensive Income. Delivery service revenue is recognized at a point in time following the delivery of payroll checks, reports, quarter-end packages, and tax returns to the Company’s clients.\nPEO and Insurance Solutions Revenue\nPEO solutions are sold through the Company’s registered and licensed subsidiaries and offer businesses a combined package of services that includes payroll, employer compliance, HR and employee benefits administration, risk management outsourcing, and the on-site availability of a professionally trained HR representative, among other services. The Company serves as a co-employer of its clients’ employees, offers health insurance coverage to client employees, and assumes the risks and rewards of workers’ compensation insurance and certain health insurance offerings. PEO Solutions revenue is recognized over time as the services are performed and the customer simultaneously receives and controls the benefits from these services. PEO Solutions revenue is reported net of certain pass-through costs billed and incurred, which include payroll wages, payroll taxes, including federal and state unemployment insurance, and health insurance premiums on guaranteed cost benefit plans. For workers’ compensation and health insurance plans where the Company retains risk, revenues and costs are recorded on a gross basis.\nPEO pass-through costs netted within the PEO and Insurance Solutions revenue are as follows:\nYear ended May 31,\nIn billions\nPayroll wages and payroll taxes\n$\n20.6\n$\n20.5\n$\n14.5\nIn millions\nState unemployment insurance (included in payroll wages and payroll taxes)\n$\n119.0\n$\n85.7\n$\n82.3\nGuaranteed cost benefit plans\n$\n586.4\n$\n647.0\n$\n451.8\nInsurance solutions are sold through the Company’s licensed insurance agency, Paychex Insurance Agency, Inc., which provides insurance through a variety of carriers, allowing companies to expand their employee benefit offerings at an affordable cost. Insurance offerings include property and casualty coverage such as workers’ compensation, business-owner policies, commercial auto, cyber security, and health and benefits coverage, including health, dental, vision, and life. Insurance Solutions revenue reflects commissions earned on remitted insurance services premiums billed and is recognized over time as services are performed and the customer simultaneously receives and controls the benefits from these services.\nContract Balances\nThe timing of revenue recognition for Management Solutions and PEO and Insurance Solutions is consistent with the invoicing of clients as they both occur during the respective client payroll period for which the services are provided. Therefore, the Company does not recognize a contract asset or liability resulting from the timing of revenue recognition and invoicing.\nPayments received for certain of the Company’s service offerings for set-up fees are considered a material right. Therefore, the Company defers revenue associated with these performance obligations, which exceed one year, and subsequently recognizes them as future services are provided, over approximately three years to four years.\nChanges in deferred revenue related to material rights that exceed one year were as follows:\nYear ended May 31,\nIn millions\nBalance, beginning of period\n$\n42.6\n$\n45.7\nDeferral of revenue\n23.5\n24.7\nRecognition of unearned revenue\n(25.9)\n(27.8)\nBalance, end of period\n$\n40.2\n$\n42.6\nDeferred revenue related to material rights is reported in the deferred revenue and other long-term liabilities line items on the Company’s Consolidated Balance Sheets. As of May 31, 2021, the Company expects to recognize $20.3 million of deferred revenue related to material rights during its fiscal year ending May 31, 2022 and $19.9 million of deferred revenue thereafter.\nAssets Recognized from the Costs to Obtain and Fulfill Contracts\nThe Company recognizes an asset for the incremental costs of obtaining a contract with a client if it is expected that the economic benefit and amortization period will be longer than one year. The Company also recognizes an asset for the costs to fulfill a contract with a client if the costs are specifically identifiable, generate or enhance resources used to satisfy future performance obligations, and are expected to be recovered.\nDeferred costs to obtain and fulfill contracts are reported in the prepaid expenses and other current assets and long-term deferred costs line items on the Company’s Consolidated Balance Sheets. Amortization expense related to costs to obtain and fulfill a contract are included in cost of service revenue and selling, general and administrative expenses in the Company’s Consolidated Statements of Income and Comprehensive Income. Refer to Note A of this Item 8 for additional disclosures on our policies for assets recognized from the costs to obtain and fulfill contracts.\nThe Company regularly reviews its deferred costs for potential impairment and did not recognize an impairment loss during fiscal 2021, 2020, or 2019.\nChanges in deferred costs to obtain and fulfill contracts were as follows:\nCosts to fulfill contracts:\nYear ended May 31,\nIn millions\nBalance, beginning of period\n$\n67.3\n$\n66.1\nCapitalization of costs\n26.2\n24.9\nAmortization\n(24.2)\n(23.7)\nBalance, end of period\n$\n69.3\n$\n67.3\nCosts to obtain contracts:\nYear ended May 31,\nIn millions\nBalance, beginning of period\n$\n473.6\n$\n464.3\nCapitalization of costs\n181.8\n171.7\nAmortization\n(167.2)\n(162.4)\nBalance, end of period\n$\n488.2\n$\n473.6\nNote C - Basic and Diluted Earnings Per Share\nBasic and diluted earnings per share were calculated as follows:\nYear ended May 31,\nIn millions, except per share amounts\nBasic earnings per share:\nNet income\n$\n1,097.5\n$\n1,098.1\n$\n1,034.4\nWeighted-average common shares outstanding\n359.9\n358.5\n359.2\nBasic earnings per share\n$\n3.05\n$\n3.06\n$\n2.88\nDiluted earnings per share:\nNet income\n$\n1,097.5\n$\n1,098.1\n$\n1,034.4\nWeighted-average common shares outstanding\n359.9\n358.5\n359.2\nDilutive effect of common share equivalents\n2.2\n2.5\n2.6\nWeighted-average common shares outstanding, assuming dilution\n362.1\n361.0\n361.8\nDiluted earnings per share\n$\n3.03\n$\n3.04\n$\n2.86\nWeighted-average anti-dilutive common share equivalents\n0.6\n0.7\n0.4\nWeighted-average common share equivalents that had an anti-dilutive impact are excluded from the computation of diluted earnings per share.\nNote D - Business Combinations\nEffective December 20, 2018, the Company acquired Oasis. Upon closing, Oasis became a wholly owned subsidiary of the Company. Oasis is an industry leader in providing HR outsourcing services. The purchase price was $992.2 million, net of $262.3 million in cash acquired, including $132.1 million of restricted cash.\nThe results of operations for Oasis have been included in the Company’s Consolidated Statements of Income and Comprehensive Income since the date of acquisition. During fiscal 2019, Oasis contributed $163.7 million of total revenues and $5.1 million of operating income, including the impact of certain one-time charges related to the acquisition and integration of the Oasis business, in the Company’s consolidated results of operations. The Company incurred $5.3 million of acquisition and integration costs associated with Oasis during fiscal 2019, which was included within selling, general and administrative expenses in the Company’s Consolidated Statements of Income and Comprehensive Income.\nPro Forma Financial Results (Unaudited): The following table summarizes the Company’s unaudited pro forma operating results for fiscal 2019 as if the acquisition of Oasis had been consummated as of June 1, 2017. The following pro forma information does not include the impact of any costs incurred to integrate Oasis’ operations:\nYear ended\nMay 31, 2019\nRevenues\n$\n3,958.0\nNet income\n$\n1,021.7\nThe unaudited pro forma operating results have been calculated after applying the Company’s accounting policies and include the acquisition of Oasis adjusted, net of tax, for depreciation and amortization expense resulting from the determination of fair values of the acquired property and equipment and amortizable intangible assets, the inclusion of interest expense related to borrowings used to fund the acquisition, the amortization of debt issuance costs related to the permanent financing of debt, the elimination of interest income related to available cash used for the acquisition, and the elimination of Oasis’ interest expense related to debt not assumed in the acquisition. Since the pro forma financial results assume the acquisition was consummated on June 1, 2017, the unaudited pro forma operating results for fiscal 2019 excluded $2.7 million ($2.0 million, net of tax) of costs incurred by the Company related to the acquisition of Oasis.\nThe pro forma financial information does not purport to be indicative of the results that would have been obtained had the transactions been completed as of June 1, 2017 for the period presented and are not intended to be a projection of future results or trends.\nNote E - Other Expense, Net\nOther expense, net, consisted of the following items:\nYear ended May 31,\nIn millions\nInterest income on corporate investments\n$\n2.3\n$\n12.3\n$\n13.3\nInterest expense\n(35.8)\n(38.8)\n(17.6)\nOther\n7.0\n3.1\n1.0\nOther expense, net\n$\n(26.5)\n$\n(23.4)\n$\n(3.3)\nNote F - Stock-Based Compensation Plans\nThe Paychex, Inc. 2002 Stock Incentive Plan, as last amended and restated effective October 15, 2020 (the “2002 Plan”), authorizes grants of up to 44.1 million shares of the Company’s common stock. As of May 31, 2021, there were 16.4 million shares available for future grants under the 2002 Plan.\nAll stock-based awards to employees are recognized as compensation costs in the consolidated financial statements based on their fair values measured as of the date of grant. These costs are recognized as an expense in the Consolidated Statements of Income and Comprehensive Income on a straight-line basis over the requisite service period and an increase in additional paid-in capital.\nStock-based compensation expense was $52.5 million, $47.4 million, and $46.2 million for fiscal years 2021, 2020, and 2019, respectively. Related income tax benefits recognized were $8.6 million, $9.0 million, and $8.9 million for the respective fiscal years.\nAs of May 31, 2021, the total unrecognized compensation cost related to all unvested stock-based awards was $72.2 million and is expected to be recognized over a weighted-average period of 2.8 years.\nBlack-Scholes fair value assumptions: The fair value of stock option grants and performance-based stock option grants was estimated at the date of grant using a Black-Scholes option pricing model. The weighted-average assumptions used for valuation under the Black-Scholes option pricing model are as follows:\nYear ended May 31,\nStock options\nRisk-free interest rate\n0.5\n%\n2.0\n%\n2.9\n%\nDividend yield\n3.2\n%\n3.3\n%\n3.5\n%\nVolatility factor\n0.29\n0.18\n0.18\nExpected option life in years\n6.1\n6.2\n6.1\nWeighted-average grant-date\n‎ fair value of stock options granted (per share)\n$\n13.52\n$\n9.86\n$\n8.87\nYear ended May 31,\nPerformance-based\nstock options\nRisk-free interest rate\n2.9\n%\nDividend yield\n3.5\n%\nVolatility factor\n0.18\nExpected option life in years\n6.5\nWeighted-average grant-date\n‎ fair value of stock options granted (per share)\n$\n9.02\nNo performance-based stock options were granted during fiscal 2021 or fiscal 2020.\nRisk-free interest rates are yields for zero coupon U.S. Treasury notes maturing approximately at the end of the expected option life. The estimated volatility factor is based on a combination of historical volatility, using stock prices over a period equal to the expected option life, and implied market volatility. The expected option life is based on historical exercise behavior.\nStock options: Stock options entitle the holder to purchase, at the end of the vesting term, a specified number of shares of Paychex common stock at an exercise price per share equal to the closing market price of the common stock on the date of grant. All stock options have a contractual life of ten years from the date of the grant and a vesting schedule as established by the Board. The Company issues new shares of common stock to satisfy stock option exercises. Stock option grants to executives and outside directors are typically approved by the Board in July. Grants of stock options to executives vest one-third per annum. Grants to members of the Board vest after one year. Vesting is generally achieved on these dates with active employment or participation as a member of the Board on the date of vesting.\nThe following table summarizes stock option activity for fiscal 2021:\nWeighted-\nWeighted-\naverage\nShares\naverage\nremaining\nAggregate\nsubject\nexercise price\ncontractual\nintrinsic\nIn millions, except per share amounts\nto options\nper share\nterm (years)\nvalue(1)\nOutstanding as of May 31, 2020\n4.4\n$\n55.02\nGranted\n0.7\n$\n73.55\nExercised\n(1.4)\n$\n42.66\nForfeited\n(0.1)\n$\n78.69\nExpired\n-\n$\n36.79\nOutstanding as of May 31, 2021\n3.6\n$\n62.89\n6.2\n$\n136.8\nExercisable as of May 31, 2021\n2.4\n$\n56.25\n5.0\n$\n108.0\n(1)Total shares valued at the market price of the underlying stock as of May 31, 2021 less the exercise price.\nOther information pertaining to stock option grants is as follows:\nYear ended May 31,\nIn millions\nTotal intrinsic value of stock options exercised\n$\n58.5\n$\n22.0\n$\n25.7\nTotal grant-date fair value of stock options vested\n$\n6.0\n$\n5.0\n$\n4.3\nRestricted Stock Units (“RSUs”): The Board grants RSUs to certain executive and non-executive employees. An RSU is an agreement to issue shares at the time of vesting with no associated exercise cost for the employee. For each unit granted, the holder will receive one share of Paychex common stock at the time of vesting. If the recipient does not vest in the shares due to leaving Paychex, all shares or units of RSUs, and any dividends accrued thereon, when applicable, will be forfeited and returned to the Company.\nTime-based RSUs: Time-based RSUs granted to non-executives vest one-fifth per annum over five years, while those granted to executives vest one-third per annum over three years. Vesting is generally achieved on these dates with active employment. The fair value of time-based RSUs is equal to the closing market price of the underlying common stock as of the date of grant, adjusted for the present value of expected dividends over the vesting period. Time-based RSUs may, or may not, earn dividend equivalents depending on the terms of the specific grant.\nPerformance-based RSUs: Performance-based RSUs primarily have a two year performance period, after which the number of underlying RSUs earned will be determined based on achievement against pre-established performance targets. The RSUs earned are then subject to a one year service period. Performance-based RSUs do not earn dividend equivalents during the performance period. The fair value of the RSUs is equal to the closing market price of the underlying common stock as of the date of grant, adjusted for the present value of expected dividends over the performance period.\nThe following table summarizes RSU activity for fiscal 2021:\nWeighted-\nWeighted-\naverage\naverage\nTime-\ngrant-date\nPerformance-\ngrant-date\nBased\nfair value\nbased\nfair value\nIn millions, except per share amounts\nRSUs\nper share\nRSUs\nper share\nNonvested as of May 31, 2020\n1.4\n$\n61.60\n0.1\n$\n80.59\nGranted (1)\n0.7\n$\n67.92\n-\n$\n-\nVested\n(0.5)\n$\n57.10\n-\n$\n-\nForfeited\n(0.1)\n$\n64.40\n-\n$\n-\nNonvested as of May 31, 2021\n1.5\n$\n65.64\n0.1\n$\n80.59\n(1)For performance-based RSUs, granted number assumes achievement of performance goals at target. Actual number of shares to be earned may differ from this amount.\nOther information pertaining to RSUs is as follows:\nYear ended May 31,\nIn millions, except per share amounts\nTime-based RSUs:\nWeighted-average grant-date fair value per share of RSUs granted\n$\n67.92\n$\n73.28\n$\n62.20\nWeighted-average remaining vesting period (years)\n3.0\n2.9\n2.9\nTotal intrinsic value of RSUs vested\n$\n32.6\n$\n40.0\n$\n1.2\nAggregate intrinsic value of nonvested RSUs (1)\n$\n152.7\n$\n99.9\n$\n127.0\nTotal grant-date fair value of RSUs vested\n$\n25.6\n$\n23.6\n$\n0.8\nPerformance-based RSUs(2):\nWeighted-average grant-date fair value per share of RSUs granted\n$\n-\n$\n80.59\n$\n-\nWeighted-average remaining vesting period (years)\n1.1\n2.1\n-\nTotal intrinsic value of RSUs vested\n$\n-\n$\n-\n$\n-\nAggregate intrinsic value of nonvested RSUs (1)\n$\n6.2\n$\n4.4\n$\n-\nTotal grant-date fair value of RSUs vested\n$\n-\n$\n-\n$\n-\n(1)Based on the market price of the underlying common stock as of May 31, 2021, 2020 and 2019.\n(2)No performance-based RSUs were granted during fiscal 2021 or fiscal 2019.\nRestricted stock awards: The Board approves grants of restricted stock awards to the Company’s executives and outside directors. All shares underlying awards of restricted stock are restricted in that they are not transferable until they vest. Recipients of the restricted stock earn dividends, which are paid to the recipient at the time the awards vest. If the recipient does not vest in the shares due to leaving Paychex, all shares of restricted stock, and the dividends accrued thereon, when applicable, will be forfeited and returned to the Company.\nTime-based restricted stock awards: Time-based restricted stock awards granted to executives vest one-third per annum. Time-based restricted stock awards granted to outside directors vest on the one year anniversary of the grant date. Vesting is generally achieved on these dates with active employment or participation as a member of the Board on the date of vesting. The fair value of time-based restricted stock awards is equal to the closing market price of the underlying common stock as of the date of grant.\nPerformance-based restricted stock awards: Performance-based restricted stock awards primarily have a two year performance period, after which the number of shares earned will be determined based on achievement against pre-established performance targets. The restricted shares earned are then subject to a one year service period. Performance-based shares do not earn dividend equivalents during the performance period. The fair value of performance-based shares is equal to the closing market price of the underlying common stock as of the date of grant, adjusted for the present value of expected dividends over the performance period.\nThe following table summarizes time-based and performance-based restricted stock award activity for fiscal 2021:\nWeighted-\nWeighted-\naverage\naverage\ngrant-date\nPerformance-\ngrant-date\nTime-based\nfair value\nbased\nfair value\nIn millions, except per share amounts\nshares\nper share\nshares\nper share\nNonvested as of May 31, 2020\n0.1\n$\n73.20\n0.3\n$\n61.97\nGranted (1)\n0.1\n$\n73.93\n-\n$\n65.17\nVested\n(0.1)\n$\n70.11\n(0.2)\n$\n54.28\nForfeited\n-\n$\n76.45\n-\n$\n72.31\nNonvested as of May 31, 2021\n0.1\n$\n74.60\n0.1\n$\n69.28\n(1)For performance-based shares, granted number assumes achievement of performance goals at target. Actual number of shares to be earned may differ from this amount.\nOther information pertaining to time-based and performance-based restricted stock awards is as follows:\nYear ended May 31,\nIn millions, except per share amounts\nWeighted-average grant-date fair value per share of time-based shares granted\n$\n73.93\n$\n84.46\n$\n69.80\nTotal grant-date fair value of time-based restricted stock vested\n$\n3.0\n$\n3.2\n$\n3.0\nWeighted-average grant-date fair value per share of performance-based shares granted\n$\n65.17\n$\n80.59\n$\n65.17\nTotal grant-date fair value of performance-based restricted stock vested\n$\n8.4\n$\n5.8\n$\n5.3\nLong-term Incentive Plan (“LTIP”): The Company has two long-term incentive performance-based stock awards under its LTIP. In July 2011, the Board approved a special award of performance-based non-qualified stock options. Subsequent grants of this award were made upon the hire of new executives. Under this award, stock options were granted to executives with vesting dependent on achievement against long-term strategic and financial objectives. Total stock options earned and vested were based on achievement against pre-established targets for the fiscal year ended May 31, 2016 (“fiscal 2016”). The performance period was completed in fiscal 2016. Although the performance period was completed and the stock options were earned and vested, some stock options remained outstanding as of May 31, 2020; there are no stock options outstanding as of May 31, 2021.\nIn July 2016, the Board approved an LTIP award comprised of both performance-based non-qualified stock options and performance-based restricted stock. This award was granted to executives down to the vice president level with vesting dependent on achievement against long-term strategic and financial objectives. Total stock options and restricted shares earned are based on achievement against pre-established targets for fiscal 2020.\nThe following table summarizes LTIP performance-based stock option activity for fiscal 2021:\nWeighted-\nWeighted-\naverage\nShares\naverage\nremaining\nAggregate\nsubject\nexercise price\ncontractual\nintrinsic\nIn millions, except per share amounts\nto options\nper share\nterm (years)\nvalue(1)\nOutstanding as of May 31, 2020\n1.3\n$\n56.13\nGranted(2)\n0.2\n$\n60.92\nExercised\n(0.8)\n$\n53.34\nOutstanding as of May 31, 2021\n0.7\n$\n60.71\n5.0\n$\n27.8\nExercisable as of May 31, 2021\n0.7\n$\n60.71\n5.0\n$\n27.8\n(1)Shares valued at the market price of the underlying stock as of May 31, 2021 less the exercise price.\n(2)Shares issued above target achievement level upon final performance measurement.\n‎\nOther information pertaining to LTIP performance-based stock options is as follows:\nYear ended May 31,\nIn millions\nTotal intrinsic value of stock options exercised\n$\n26.3\n$\n23.0\n$\n8.2\nNo performance-based stock options vested in fiscal years 2020 or 2019.\nLTIP performance-based restricted stock do not earn dividend equivalents during the performance period. The fair value of LTIP performance-based restricted stock is equal to the closing market price of the underlying common stock as of the date of grant, adjusted for the present value of expected dividends over the performance period. If the recipient leaves Paychex prior to the vesting date for any reason, the shares of performance-based restricted stock will be forfeited and returned to the Company.\nThe following table summarizes LTIP performance-based restricted stock activity for fiscal 2021:\nWeighted-\naverage grant\nRestricted\ndate fair value\nIn millions, except per share amounts\nshares\nper share\nNonvested as of May 31, 2020\n0.1\n$\n53.97\nGranted\n-\n$\n53.97\nExercised\n(0.1)\n$\n53.97\nNonvested as of May 31, 2021\n-\n$\n-\nNon-compensatory employee benefit plan: The Company offers a qualified Employee Stock Purchase Plan (“ESPP”) to all employees. The Company’s common stock can be purchased through a payroll deduction at a discount to the market price. The qualified ESPP allows for a discount of up to 15% based on the sole discretion of the committee established to administer the plan. For offering periods during fiscal years 2021, 2020, and 2019 the discount was set at 5% of the market price. Transactions under the non-qualified ESPP occurred directly through the Company’s transfer agent and no brokerage fees were charged to employees. Transactions under the qualified ESPP occur through the Company’s third-party stock plan administrator. The plans have been deemed non-compensatory and therefore, no stock-based compensation costs have been recognized for fiscal years 2021, 2020, or 2019 related to the plan.\nNote G - Funds Held for Clients and Corporate Investments\nFunds held for clients and corporate investments are as follows:\nMay 31, 2021\nGross\nGross\nAmortized\nunrealized\nunrealized\nFair\nIn millions\ncost\ngains\nlosses\nvalue\nType of issue:\nFunds held for clients' money market securities and other\n‎ restricted cash equivalents\n$\n739.6\n$\n-\n$\n-\n$\n739.6\nAFS securities:\nAsset-backed securities\n86.5\n1.4\n-\n87.9\nCorporate bonds\n635.8\n28.8\n(0.2)\n664.4\nMunicipal bonds\n1,669.0\n33.0\n(2.3)\n1,699.7\nU.S. government agency and treasury securities\n549.6\n20.1\n(1.5)\n568.2\nTotal AFS securities\n2,940.9\n83.3\n(4.0)\n3,020.2\nOther\n26.4\n7.7\n(0.1)\n34.0\nTotal funds held for clients and corporate investments\n$\n3,706.9\n$\n91.0\n$\n(4.1)\n$\n3,793.8\nMay 31, 2020\nGross\nGross\nAmortized\nunrealized\nunrealized\nFair\nIn millions\ncost\ngains\nlosses\nvalue\nType of issue:\nFunds held for clients' money market securities and other\n‎ restricted cash equivalents\n$\n683.5\n$\n-\n$\n-\n$\n683.5\nAFS securities:\nAsset-backed securities\n68.0\n1.7\n-\n69.7\nCorporate bonds\n649.6\n34.1\n(0.1)\n683.6\nMunicipal bonds\n1,373.8\n37.4\n(1.6)\n1,409.6\nU.S. government agency and treasury securities\n565.8\n28.5\n-\n594.3\nTotal AFS securities\n2,657.2\n101.7\n(1.7)\n2,757.2\nOther\n25.4\n2.2\n(0.4)\n27.2\nTotal funds held for clients and corporate investments\n$\n3,366.1\n$\n103.9\n$\n(2.1)\n$\n3,467.9\nIncluded in funds held for clients’ money market securities and other restricted cash equivalents as of May 31, 2021 were bank demand deposit accounts and money market funds.\nIncluded in asset-backed securities as of May 31, 2021 were investment-grade securities primarily collateralized by fixed-rate auto loans and credit card receivables and all have credit ratings of AAA. The primary risk associated with these securities is the collection of the underlying receivables. Collateral on these asset-backed securities has performed as expected through May 31, 2021.\nIncluded in corporate bonds as of May 31, 2021 were investment-grade securities covering a wide range of issuers, industries, and sectors and primarily carry credit ratings of A or better and having maturities ranging from June 1, 2021 through May 12, 2028.\nIncluded in municipal bonds as of May 31, 2021 were general obligation bonds and revenue bonds primarily carrying credit ratings of AA or better and have maturities ranging from June 1, 2021 through August 1, 2028.\nA substantial portion of our portfolios are invested in high credit quality securities with ratings of AA or higher, and A-1/P-1 ratings on short-term securities.\nThe classification of funds held for clients and corporate investments on the Consolidated Balance Sheets is as follows:\nMay 31,\nIn millions\nFunds held for clients\n$\n3,750.0\n$\n3,430.5\nCorporate investments\n36.7\n27.2\nLong-term corporate investments\n7.1\n10.2\nTotal funds held for clients and corporate investments\n$\n3,793.8\n$\n3,467.9\nFunds held for clients’ money market securities and other restricted cash equivalents is collected from clients before due dates for payroll tax administration services and employee payment services and is invested until remitted to the applicable tax or regulatory agencies or client employees. Based upon the Company’s intent and its contractual obligation to clients, these funds are considered restricted until they are remitted to fund these client obligations.\nThe Company’s AFS securities reflected net unrealized gains of $79.3 million and $100.0 million as of May 31, 2021 and May 31, 2020 respectively. Included in net unrealized gains as of May 31, 2021 and May 31, 2020 were 137 and 19 AFS securities in an unrealized loss position, representing approximately 11% and 2% of the total securities held, respectively. AFS securities in an unrealized loss position for which a credit loss has not been recognized were as follows:\nMay 31, 2021\nSecurities in an unrealized\n‎loss position for less than\n‎twelve months\nSecurities in an unrealized\n‎loss position for more than\n‎twelve months\nTotal\nGross\nGross\nGross\nunrealized\nFair\nunrealized\nFair\nunrealized\nFair\nIn millions\nlosses\nvalue\nlosses\nvalue\nlosses\nvalue\nType of issue:\nAsset-backed securities\n$\n-\n$\n7.1\n$\n-\n$\n-\n$\n-\n$\n7.1\nCorporate bonds\n(0.2)\n22.0\n-\n-\n(0.2)\n22.0\nMunicipal bonds\n(2.3)\n288.2\n-\n-\n(2.3)\n288.2\nU.S. government agency and treasury securities\n(1.5)\n102.6\n-\n-\n(1.5)\n102.6\nTotal\n$\n(4.0)\n$\n419.9\n$\n-\n$\n-\n$\n(4.0)\n$\n419.9\nMay 31, 2020\nSecurities in an unrealized\n‎loss position for less than\n‎twelve months\nSecurities in an unrealized\n‎loss position for more than\n‎twelve months\nTotal\nGross\nGross\nGross\nunrealized\nFair\nunrealized\nFair\nunrealized\nFair\nIn millions\nlosses\nvalue\nlosses\nvalue\nlosses\nvalue\nType of issue:\nCorporate bonds\n$\n(0.1)\n$\n6.5\n$\n-\n$\n-\n$\n(0.1)\n$\n6.5\nMunicipal bonds\n(1.6)\n60.3\n-\n-\n(1.6)\n60.3\nTotal\n$\n(1.7)\n$\n66.8\n$\n-\n$\n-\n$\n(1.7)\n$\n66.8\nThe Company regularly reviews its investment portfolios to determine if any investment is impaired due to changes in credit risk or other potential valuation concerns. The Company believes the investments held as of May 31, 2021 that had gross unrealized losses of $4.0 million were not impaired due to credit risk or other valuation concerns and was not required to record a credit loss or an allowance for credit losses on its AFS securities. The Company believes it is probable that the principal and interest will be collected in accordance with contractual terms and that the unrealized losses on these securities were due to changes in interest rates and were not due to increased credit risk or other valuation concerns. Most of the securities in an unrealized loss position as of May 31, 2021 and May 31, 2020 held an AA rating or better. The Company does not intend to sell these investments until the recovery of their amortized cost basis or maturity and further believes that it is not more-likely-than-not that it will be required to sell these investments prior to that time. The Company’s assessment that an investment is not impaired due to credit risk or other valuation concerns could change in the future due to new developments, including developments related to the COVID-19 pandemic, or changes in the Company’s strategies or assumptions related to any particular investment.\nRealized gains and losses from the sale of AFS securities were as follows:\nYear ended May 31,\nIn millions\nGross realized gains\n$\n1.2\n$\n11.6\n$\n0.6\nGross realized losses\n-\n(0.3)\n(0.6)\nNet realized gains\n$\n1.2\n$\n11.3\n$\n-\nThe amortized cost and fair value of AFS securities that had stated maturities as of May 31, 2021 are shown below by expected maturity.\nMay 31, 2021\nAmortized\nFair\nIn millions\ncost\nvalue\nMaturity date:\nDue in one year or less\n$\n335.7\n$\n338.6\nDue after one year through three years\n731.6\n759.0\nDue after three years through five years\n970.6\n1,008.3\nDue after five years\n903.0\n914.3\nTotal\n$\n2,940.9\n$\n3,020.2\nVariable rate demand notes (“VRDNs”) are primarily categorized as due after five years in the table above as the contractual maturities on these securities are typically 20 to 30 years. Although these securities are issued as long-term securities, they are priced and traded as short-term instruments because of the liquidity provided through the tender feature.\nNote H - Fair Value Measurements\nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability (an exit price) in an orderly transaction between market participants at the measurement date. The accounting standards related to fair value measurements include a hierarchy for information and valuations used in measuring fair value that is broken down into three levels based on reliability, as follows:\nLevel 1 valuations are based on quoted prices in active markets for identical instruments that the Company can access at the measurement date.\nLevel 2 valuations are based on inputs other than quoted prices included in Level 1 that are observable for the instrument, either directly or indirectly, for substantially the full term of the asset or liability including the following:\nquoted prices for similar, but not identical, instruments in active markets;\nquoted prices for identical or similar instruments in markets that are not active;\ninputs other than quoted prices that are observable for the instrument; or\ninputs that are derived principally from or corroborated by observable market data by correlation or other means.\nLevel 3 valuations are based on information that is unobservable and significant to the overall fair value measurement.\nThe carrying values of cash and cash equivalents, restricted cash and restricted cash equivalents, accounts receivable, net of allowance for doubtful accounts, PEO unbilled receivables, net of advance collections, accounts payable and short-term borrowings, when used by the Company, approximate fair value due to the short maturities of these instruments. Marketable securities included in funds held for clients and corporate investments consist primarily of securities classified as AFS and are recorded at fair value on a recurring basis.\nThe Company’s financial assets and liabilities measured at fair value on a recurring basis were as follows:\nMay 31, 2021\nQuoted\nSignificant\nprices in\nother\nSignificant\nCarrying\nactive\nobservable\nunobservable\nvalue\nmarkets\ninputs\ninputs\nIn millions\n(Fair value)\n(Level 1)\n(Level 2)\n(Level 3)\nAssets:\nRestricted and unrestricted cash equivalents:\nMoney market securities\n$\n2.9\n$\n2.9\n$\n-\n$\n-\nTotal restricted and unrestricted cash equivalents\n$\n2.9\n$\n2.9\n$\n-\n$\n-\nAFS securities:\nAsset-backed securities\n$\n87.9\n$\n-\n$\n87.9\n$\n-\nCorporate bonds\n664.4\n-\n664.4\n-\nMunicipal bonds\n1,699.7\n-\n1,699.7\n-\nU.S. government agency and treasury securities\n568.2\n-\n568.2\n-\nTotal AFS securities\n$\n3,020.2\n$\n-\n$\n3,020.2\n$\n-\nOther\n$\n34.0\n$\n34.0\n$\n-\n$\n-\nLiabilities:\nOther long-term liabilities\n$\n32.6\n$\n32.6\n$\n-\n$\n-\nMay 31, 2020\nQuoted\nSignificant\nprices in\nother\nSignificant\nCarrying\nactive\nobservable\nunobservable\nvalue\nmarkets\ninputs\ninputs\nIn millions\n(Fair value)\n(Level 1)\n(Level 2)\n(Level 3)\nAssets:\nRestricted and unrestricted cash equivalents:\nMoney market securities\n$\n43.5\n$\n43.5\n$\n-\n$\n-\nTotal restricted and unrestricted cash equivalents\n$\n43.5\n$\n43.5\n$\n-\n$\n-\nAFS securities:\nAsset-backed securities\n$\n69.7\n$\n-\n$\n69.7\n$\n-\nCorporate bonds\n683.6\n-\n683.6\n-\nMunicipal bonds\n1,409.6\n-\n1,409.6\n-\nU.S. government agency and treasury securities\n594.3\n-\n594.3\n-\nTotal AFS securities\n$\n2,757.2\n$\n-\n$\n2,757.2\n$\n-\nOther\n$\n27.2\n$\n27.2\n$\n-\n$\n-\nLiabilities:\nOther long-term liabilities\n$\n26.8\n$\n26.8\n$\n-\n$\n-\nIn determining the fair value of its assets and liabilities, the Company predominately uses the market approach. Money market securities, which are cash equivalents, are considered Level 1 investments as they are valued based on quoted market prices in active markets. AFS securities, including asset-backed securities, corporate bonds, municipal bonds, U.S. government agency and treasury securities, and VRDNs, when held by the Company, are included in Level 2 and are valued utilizing inputs obtained from an independent pricing service. To determine the fair value of the Company’s Level 2 AFS securities, the independent pricing service uses a variety of inputs, including benchmark yields, reported trades, non-binding broker/dealer quotes, issuer spreads, two-sided markets, benchmark securities, bids, offers, reference data, new issue data, and monthly payment information. The Company has not adjusted the prices obtained from the independent pricing service because it believes that they are appropriately valued.\nAssets included as other are mutual fund investments, consisting of participants’ eligible deferral contributions under the Company’s non-qualified and unfunded deferred compensation plans. The related liability is reported as other long-term liabilities. The mutual funds are considered Level 1 investments as they are valued based on quoted market prices in active markets.\nThe Company’s long-term borrowings are accounted for on a historical cost basis. As of May 31, 2021 and May 31, 2020, the fair value of long-term borrowings, net of debt issuance costs was $450.2 million and $441.9 million for the Senior Notes, Series A, respectively, and $457.7 million and $448.7 million for the Senior Notes, Series B, respectively.\nThe Company’s long-term borrowings are not traded in active markets, and as a result, its fair values were estimated using a market approach employing Level 2 valuation inputs, including borrowing rates the Company believes are currently available based on loans with similar terms and maturities.\nThe preceding methods described may produce a fair value calculation that may not be indicative of net realizable value or reflective of future fair values. Furthermore, although the Company believes its valuation methods are appropriate and consistent with other market participants, the use of different methodologies or assumptions to determine the fair value of certain financial instruments could result in a different fair value measurement at the reporting date.\nNote I: Leases\nThe Company’s lease portfolio consists primarily of operating leases for office space and equipment and has remaining terms from less than one year up to ten years, with contractual terms expiring from 2021 to 2031. Lease contracts may include one or more renewal options that allow the Company to extend the lease term, typically from one year to five years per each renewal option. The exercise of lease options is generally at the discretion of the Company. None of the Company’s leases contain residual value guarantees, substantial restrictions, or covenants.\nSupplemental balance sheet information related to the Company’s leases were as follows:\nMay 31,\n$ in millions\nOperating lease right-of-use assets, net of accumulated amortization\n$\n103.0\n$\n114.8\nOperating lease liabilities, current(1)\n28.9\n37.2\nOperating lease liabilities, non-current\n92.4\n96.9\nWeighted average remaining lease term (in years)\n5.2\n4.6\nWeighted average discount rate\n1.81%\n2.06%\n(1) The current portion of operating lease liabilities is reported in the other current liabilities line item on the Company’s Consolidated Balance Sheets.\nThe components of lease expense were as follows:\nYear ended May 31,\nIn millions\nFixed payment operating lease expense\n$\n34.6\n$\n38.2\nVariable payment operating lease expense\n8.3\n8.6\nShort-term lease expense\n0.1\n0.2\nFixed payment lease expense was $34.6 million, $38.2 million, and $42.9 million for fiscal years 2021, 2020, and 2019, respectively.\nDuring the three months ended August 31, 2020, the Company ceased the use of certain leased property and accelerated the amortization of operating lease right-of-use assets, resulting in an additional $24.4 million of expense. The accelerated amortization expense recognized subsequent to August 31, 2020 is immaterial. This expense was included in selling, general and administrative expenses on the Consolidated Statements of Income and Comprehensive Income. The related lease liabilities will be satisfied under the original terms of the lease arrangements, unless buy-outs can be negotiated.\nSupplemental cash flow information related to the Company’s leases were as follows:\nYear ended May 31,\nIn millions\nCash paid for amounts included in the measurement of lease liabilities\n$\n32.2\n$\n41.6\nAmortization of ROU assets\n29.2\n34.4\nROU assets obtained in exchange for new operating lease liabilities\n26.8\n21.5\nLease incentives received in the form of tenant allowances and free rent\n0.8\n6.1\nLease incentives received in the form of tenant allowances and free rent was $0.8 million, $6.1 million, and $3.5 million for fiscal years 2021, 2020, and 2019, respectively.\nFuture lease payments are as follows:\nMay 31,\nIn millions\n$\n31.5\n25.4\n21.5\n18.2\n11.4\nThereafter\n19.4\nTotal future lease payments\n127.4\nLess: Imputed interest\n6.1\nTotal operating lease liabilities\n$\n121.3\nCurrent portion\n$\n28.9\nNon-current portion\n$\n92.4\nAs of May 31, 2021, the Company has entered into four lease agreements that have not yet commenced for terms up to ten years. These leases will require lease payments over their terms of approximately $13.9 million.\nNote J - Property and Equipment, Net of Accumulated Depreciation\nThe components of property and equipment, at cost, consisted of the following:\nMay 31,\nIn millions\nLand and improvements\n$\n10.3\n$\n10.8\nBuildings and improvements\n158.3\n166.5\nData processing equipment\n211.4\n222.4\nSoftware (1)\n748.3\n690.9\nFurniture, fixtures, and equipment\n99.8\n116.3\nLeasehold improvements\n83.5\n110.6\nConstruction in progress (1)\n50.3\n47.1\nTotal property and equipment, gross\n1,361.9\n1,364.6\nLess: Accumulated depreciation\n966.1\n957.2\nProperty and equipment, net of accumulated depreciation\n$\n395.8\n$\n407.4\n(1)Software includes both purchased software and costs capitalized related to internally developed software placed in service. Capitalized costs related to internally developed software that has not yet been placed in service is included in construction in progress.\nDepreciation expense was $123.4 million, $127.8 million, and $125.7 million for fiscal 2021, 2020, and 2019, respectively. During the three months ended August 31, 2020, the Company disposed of certain furniture and fixtures associated with abandoned leased property and recorded a loss on disposal of $5.1 million. The loss was included in selling, general and administrative expenses on the Consolidated Statements of Income and Comprehensive Income.\nNote K - Goodwill and Intangible Assets, Net of Accumulated Amortization\nGoodwill and changes in goodwill as of and for the years ended May 31, 2021 and May 31, 2020 were as follows:\nMay 31,\nIn millions\nBalance, beginning of fiscal year\n$\n1,791.1\n$\n1,782.6\nChanges during the period:\nGoodwill acquired\n19.6\n4.1\nAcquisition accounting adjustments\n-\n4.5\nCurrency translation adjustment\n10.0\n(0.1)\nBalance, end of fiscal year\n$\n1,820.7\n$\n1,791.1\nThe Company had certain intangible assets on its Consolidated Balance Sheets. The components of intangible assets, at cost, consisted of the following:\nMay 31,\nIn millions\nClient lists\n$\n632.3\n$\n618.4\nOther intangible assets\n24.1\n23.3\nTotal intangible assets, gross\n656.4\n641.7\nLess: Accumulated amortization\n380.6\n311.1\nIntangible assets, net of accumulated amortization\n$\n275.8\n$\n330.6\nDuring fiscal 2021, the Company acquired customer lists with a weighted-average amortization of 8.9 years.\nAmortization expense relating to intangible assets was $68.6 million, $81.9 million, and $55.8 million for fiscal 2021, 2020, and 2019, respectively.\nThe Company did not recognize an impairment loss as it relates to its goodwill or intangible assets during fiscal 2021, 2020, or 2019.\nThe estimated amortization expense for the next five fiscal years relating to intangible asset balances is as follows:\nIn millions\nEstimated amortization\nYear ending May 31,\nexpense\n$\n61.7\n57.0\n54.1\n51.5\n30.1\nNote L - Income Taxes\nThe components of deferred tax assets and liabilities are as follows:\nMay 31,\nIn millions\nDeferred tax assets:\nCompensation and employee benefit liabilities\n$\n53.0\n$\n37.6\nOther current liabilities\n19.8\n8.0\nTax credit carry forward\n0.2\n0.2\nStock-based compensation\n12.0\n16.8\nLeases\n29.0\n34.2\nNet operating loss (\"NOL\") carry forwards\n7.6\n9.7\nTax benefit of uncertain tax positions\n5.3\n7.0\nOther\n-\n0.5\nGross deferred tax assets\n126.9\n114.0\nDeferred tax liabilities:\nDeferred contract costs\n127.5\n122.8\nCapitalized software\n49.0\n45.7\nDepreciation\n8.9\n11.4\nGoodwill and intangible assets\n111.3\n117.4\nOperating lease right-of-use assets\n26.1\n29.3\nRevenue not subject to current taxes\n1.9\n3.7\nUnrealized gains on available-for-sale securities\n20.2\n24.5\nGross deferred tax liabilities\n344.9\n354.8\nNet deferred tax liability\n$\n(218.0)\n$\n(240.8)\nThe deferred tax asset related to NOL carry forward is comprised of $2.2 million of federal NOL carry forwards and $5.4 million of state NOL carry forwards. The federal NOL carry forwards were acquired through various acquisitions and expire between the fiscal years ending May 31, 2022 and May 31, 2037. The state NOL carry forwards expire between the fiscal years ending May 31, 2022 through May 31, 2040.\nThe components of the provision for income taxes are as follows:\nYear ended May 31,\nIn millions\nCurrent:\nFederal\n$\n271.8\n$\n265.5\n$\n258.2\nState\n85.9\n77.5\n70.7\nTotal current\n357.7\n343.0\n328.9\nDeferred:\nFederal\n(13.4)\n(0.5)\n0.7\nState\n(7.6)\n(3.5)\n4.0\nTotal deferred\n(21.0)\n(4.0)\n4.7\nIncome taxes\n$\n336.7\n$\n339.0\n$\n333.6\nA reconciliation of the U.S. federal statutory tax rate to the Company’s effective income tax rate is as follows:\nYear ended May 31,\nFederal statutory tax rate\n21.0\n%\n21.0\n%\n21.0\n%\nIncrease/(decrease) resulting from:\nState income taxes, net of federal tax benefit\n4.3\n%\n3.9\n%\n4.3\n%\nTax-exempt municipal bond interest\n(0.3)\n%\n(0.4)\n%\n(0.5)\n%\nStock option windfall benefit\n(1.3)\n%\n(0.8)\n%\n(0.5)\n%\nOther items, including adoption of ASC 606\n(0.2)\n%\n(0.1)\n%\n0.1\n%\nEffective income tax rate\n23.5\n%\n23.6\n%\n24.4\n%\nThe effective income tax rates in all periods were impacted by recognition of net discrete tax benefits related to employee stock-based compensation payments. In fiscal 2019, the effective income tax rate included discrete tax expense for changes in tax reserves and the revaluation of deferred tax balances for legislative updates.\nUncertain income tax positions: The Company is subject to U.S. federal income tax, numerous local and state tax jurisdictions within the U.S., and taxes in Europe. The Company maintains a reserve for uncertain tax positions. As of May 31, 2021 and May 31, 2020, the total reserve for uncertain tax positions, including interest and net of federal benefits, was $20.4 million and $26.5 million, respectively, and was included in long-term liabilities on the Consolidated Balance Sheets.\nA reconciliation of the beginning and ending amounts of the Company’s gross unrecognized tax benefits, not including interest or other potential offsetting effects, is as follows:\nYear ended May 31,\nIn millions\nBalance as of beginning of fiscal year\n$\n26.2\n$\n22.1\n$\n14.9\nAdditions for tax positions of the current year\n5.5\n4.1\n3.8\nAdditions for tax positions of prior years\n9.2\n1.2\n5.2\nReductions for tax positions of prior years\n-\n(0.6)\n-\nSettlements with tax authorities\n(15.2)\n-\n(1.2)\nExpiration of the statute of limitations\n(3.3)\n(0.6)\n(0.6)\nBalance as of end of fiscal year\n$\n22.4\n$\n26.2\n$\n22.1\nThe reserve as of May 31, 2021 substantially relates to the Company’s uncertain tax positions for certain state income tax matters. The Company believes the reserve for uncertain tax positions, including interest and net of federal benefits, of $20.4 million as of May 31, 2021 adequately covers open tax years and uncertain tax positions up to and including fiscal 2021 for major taxing jurisdictions. As of May 31, 2021 and May 31, 2020, the entire $20.4 million and $26.5 million, respectively, of unrecognized tax benefits, including interest and net of federal benefit, if recognized, would impact the Company’s effective income tax rate.\nThe Company has concluded all U.S. federal income tax matters through fiscal 2017. With limited exception, state income tax audits by taxing authorities are closed through fiscal 2014, primarily due to expiration of the statute of limitations.\nThe Company continues to follow its policy of recognizing interest and penalties accrued on tax positions as a component of income taxes on the Consolidated Statements of Income and Comprehensive Income. The amount of accrued interest and penalties associated with the Company’s tax positions is immaterial to the Consolidated Balance Sheets. The amount of interest and penalties recognized for fiscal years 2021, 2020, and 2019 was immaterial to the Company’s results of operations.\nNote M - Short-term Financing\nThe Company maintains committed and unsecured credit facilities and irrevocable letters of credit as part of its normal and recurring business operations. The purpose of these credit facilities is to meet short-term funding requirements, finance working capital needs, and for general corporate purposes. The Company typically borrows on an overnight or short-term basis on its credit facilities.\nDetails of the Company’s credit facilities are as follows:\nMaximum\nAmount Outstanding\nAmount\nMay 31,\n$ in millions\nExpiration Date\nAvailable\nCredit facilities:\nJP Morgan Chase Bank, N.A. (\"JPM\") (1)\nJuly 31, 2024\n$\n1,000.0\n$\n-\n$\n-\nJPM (1)\nAugust 17, 2022\n$\n500.0\n-\n-\nPNC Bank, National Association (“PNC”) (weighted-average interest rate of 1.16% at May 31, 2021 (2)\nFebruary 6, 2023\n$\n250.0\n7.4\n5.1\nOutstanding short-term financing (3)\n$\n7.4\n$\n5.1\n(1)JPM acts as the administrative agent for this syndicated credit facility.\n(2)This agreement replaced the Company’s predecessor four year unsecured $150.0 million credit facility dated March 17, 2016, which was terminated on February 6, 2020.\n(3)The total amount available under these credit facilities as of May 31, 2021 was approximately $1.7 billion. Amounts under the PNC credit facility remain outstanding as of the date of this report.\nUpon the expiration date of any credit facility, any borrowings outstanding under that facility will mature and be payable.\nInterest rates on each of the Company’s credit facilities can be based upon (1) an alternate base rate that is established by the lending institution at the highest of several publicly available interest rates, plus an applicable interest rate margin, or (2) at our election, the adjusted London Interbank Offered Rate (“LIBOR”) or an alternate interest rate as determined by the administrative agent, plus an applicable interest rate margin. The Company is also required to pay a commitment fee, ranging from 0.05% to 0.15%, related to the unutilized portion of each credit facility. The commitment fee is determined on a sliding-scale basis based upon the Company’s consolidated leverage ratio.\nObligations under the credit facilities are guaranteed by the Company and certain of its subsidiaries. The credit facilities contain financial and operational covenants with which the Company must maintain compliance. The Company’s ability to borrow under the credit facilities may be restricted in the event of certain covenant breaches or events of default. In addition, the terms of the credit facilities could restrict the Company’s ability to engage in certain business transactions. The Company was in compliance with all these covenants as of May 31, 2021.\nCertain lenders under these credit facilities, and their respective affiliates, have performed, and may in the future perform for the Company, various commercial banking, investment banking, underwriting, and other financial advisory services, for which they have received, and will continue to receive in the future, customary fees and expenses.\nLetters of credit: The Company had irrevocable standby letters of credit outstanding totaling $180.4 million and $147.9 million as of May 31, 2021 and May 31, 2020, respectively, required to secure commitments for certain insurance policies. The letters of credit expire at various dates between June 26, 2021 and July 15, 2022. No amounts were outstanding on these letters of credit during fiscal 2021 or fiscal 2020, or as of May 31, 2021 and May 31, 2020. Subsequent to May 31, 2021, a $41.2 million letter of credit was cancelled, and letters of credit expiring on June 26, 2021 were renewed through June 26, 2022.\nNote N - Long-term Financing\nLong-term debt, at amortized cost, consisted of the following as of:\nMay 31,\nIn millions\nSenior Notes, Series A\n$\n400.0\n$\n400.0\nSenior Notes, Series B\n400.0\n400.0\nTotal long-term borrowings\n800.0\n800.0\nLess: Debt issuance costs, net of accumulated amortization\n(2.7)\n(3.2)\nLong-term borrowings, net of debt issuance costs\n$\n797.3\n$\n796.8\nCertain information related to the Senior Notes, Series A and Senior Notes, Series B (collectively the “Notes”) issued pursuant to the Note Purchase and Guarantee Agreement (the “Agreement”) for fiscal 2021 and fiscal 2020 are as follows:\nSenior Notes\nSenior Notes\nSeries A\nSeries B\nStated interest rate\n4.07%\n4.25%\nEffective interest rate\n4.15%\n4.31%\nInterest rate type\nFixed\nFixed\nInterest payment dates\nSemi-annual, in arrears\nSemi-annual, in arrears\nPrincipal payment dates\nMarch 13, 2026\nMarch 13, 2029\nNote type\nUnsecured\nUnsecured\nThe effective interest rates for each note series includes the interest on the note and amortization of debt issuance costs.\nProceeds from the Notes were used to pay off $800.0 million in short-term borrowings under the Company’s JPM credit facilities used to temporarily finance the acquisition of Oasis in fiscal 2019. Payment of all amounts due with respect to the Notes and performance under the Agreement is guaranteed by the Company, Paychex of New York LLC, and certain other subsidiaries of the Company. The Company may, at its option, prepay at any time all, or any part of, the Notes, subject to certain conditions as described in the Agreement.\nThe Agreement contains customary representations, warranties, affirmative and negative covenants, including financial covenants that are usual and customary for such arrangements. The Company was in compliance with all these covenants as of May 31, 2021.\nNote O - Supplemental Cash Flow Information\nIncome taxes paid were $421.4 million, $298.8 million, and $317.9 million for fiscal 2021, 2020, and 2019, respectively.\nInterest expense paid was $34.9 million, $38.0 million, and $10.4 million for fiscal 2021, 2020, and 2019, respectively.\nNote P - Employee Benefit Plans\n401(k) plan: The Company maintains a contributory savings plan that qualifies under section 401(k) of the Internal Revenue Code. The Paychex, Inc. 401(k) Incentive Retirement Plan (the “Plan”) allows all employees to immediately participate in the salary deferral portion of the Plan, contributing up to a maximum of 50% of their salary, subject to Internal Revenue Service limitations. Employees who have completed one year of service and a minimum of 1,000 hours worked are eligible to receive a Company matching contribution, when such contribution is in effect. The Company provides a matching contribution of 100% of the first 3% and 50% on the next 2% of eligible pay for a total matching contribution of 4%. The Company temporarily suspended its matching contribution effective July 31, 2020 through December 31, 2020. The Company’s matching contribution was reinstated on January 1, 2021 at the percentages in effect at the time of the temporary suspension. Company contributions to the Plan for fiscal 2021, 2020, and 2019 were $19.2 million, $30.1 million, and $29.3 million, respectively.\nThe Plan is 100% participant directed. Plan participants can fully diversify their portfolios by choosing from any or all investment fund choices in the Plan. Transfers in and out of investment funds, including the Paychex, Inc. Employee Stock Ownership Plan Stock Fund, are not restricted, except for certain restricted trading periods for individuals designated as insiders as specified in the Company’s Insider Trading Policy. The Company matching contribution, when in effect, follows the same fund elections as the employee compensation deferrals.\nDeferred compensation plans: The Company and certain subsidiaries offer non-qualified and unfunded deferred compensation plans to a select group of key employees, executive officers, and outside directors. Eligible employees are provided with the opportunity to defer up to 50% of their annual base salary and bonus and outside directors may defer 100% of their Board cash compensation. Gains and losses are credited based on the participant’s election of a variety of investment choices. The Company does not match any participant deferral or guarantee its return. Distributions are paid at one of the following dates selected by the participant: the participant’s termination date, the date the participant retires from any active employment, or a designated specific date. The amounts accrued under these plans were $32.6 million and $26.8 million as of May 31, 2021 and May 31, 2020, respectively, and are reflected in other long-term liabilities on the accompanying Consolidated Balance Sheets.\nNote Q - Commitments and Contingencies\nContingencies: The Company is subject to various claims and legal matters that arise in the normal course of its business. These include disputes or potential disputes related to breach of contract, tort, employment-related claims, tax claims, statutory, and other matters.\nThe Company’s management currently believes that resolution of any outstanding legal matters will not have a material adverse effect on the Company’s financial position or results of operations. However, legal matters are subject to inherent uncertainties and there exists the possibility that the ultimate resolution of these matters could have a material adverse impact on the Company’s financial position and the results of operations in the period in which any such effect is recorded.\nOther commitments: As of May 31, 2021, the Company had outstanding commitments under existing workers’ compensation insurance agreements and legally binding contractual arrangements with minimum future payment obligations of approximately $345.8 million. The Company also enters into various purchase commitments with vendors in the ordinary course of business and had outstanding commitments to purchase approximately $7.0 million of capital assets. These minimum future payment obligations relate to the following fiscal years:\nPayments due by period\nIn millions\nThereafter\nWorkers' compensation estimated obligations\n$\n65.3\n$\n36.0\n$\n21.3\n$\n13.2\n$\n9.5\n$\n37.8\nPurchase obligations\n91.0\n46.2\n17.5\n8.0\n-\n-\nIn the normal course of business, the Company makes representations and warranties that guarantee the performance of services under service arrangements with clients. Historically, there have been no material losses related to such guarantees. The Company has also entered into indemnification agreements with its officers and directors, which require the Company to defend and, if necessary, indemnify these individuals for certain pending or future claims as they relate to their services provided to the Company.\nThe Company currently self-insures the deductible portion of various insured exposures under certain corporate employee and PEO employee health and medical benefit plans. The Company’s estimated loss exposure under these insurance arrangements is recorded in other current liabilities on the Consolidated Balance Sheets. Historically, the amounts accrued have not been material and were not material as of May 31, 2021. The Company also maintains insurance coverage in addition to its purchased primary insurance policies for gap coverage for employment practices liability, errors and omissions, warranty liability, theft and embezzlement, cyber threats, and acts of terrorism; and capacity for deductibles and self-insured retentions through its captive insurance company.\nSchedule II - Valuation and Qualifying Accounts\nPAYCHEX, INC.\nCONSOLIDATED FINANCIAL STATEMENT SCHEDULE\nFOR THE YEAR ENDED MAY 31,\n(In millions)\nAdditions to/\nBalance as of\nAdditions\n(deductions\nBalance as\nbeginning\ncharged to\nfrom) other\nCosts and\nof end\nDescription\nof fiscal year\nexpenses\naccounts (1)\ndeductions (2)\nof fiscal year\nAllowance for expected credit losses\n$\n12.5\n$\n8.0\n$\n-\n$\n4.5\n$\n16.0\nReserve for client fund losses\n$\n-\n$\n3.5\n$\n-\n$\n3.5\n$\n-\nAllowance for expected credit losses\n$\n7.5\n$\n7.8\n$\n3.0\n$\n5.8\n$\n12.5\nReserve for client fund losses\n$\n2.7\n$\n5.2\n$\n(3.0)\n$\n4.9\n$\n-\nAllowance for expected credit losses\n$\n7.0\n$\n3.3\n$\n0.7\n$\n3.5\n$\n7.5\nReserve for client fund losses\n$\n2.4\n$\n3.7\n$\n-\n$\n3.4\n$\n2.7\n(1)Amounts related to business acquisitions in fiscal 2019 and the reclassification of the reserve for client fund losses in fiscal 2020.\n(2)Uncollectible amounts written off, net of recoveries, and other adjustments.",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A. Controls and Procedures\nDisclosure Controls and Procedures: Disclosure controls and procedures are designed with the objective of ensuring that information required to be disclosed in the Company’s reports filed under the Exchange Act, such as this report, is recorded, processed, summarized, and reported within the time periods specified in the SEC’s rules and forms. Disclosure controls and procedures are also designed with the objective of ensuring that such information is accumulated and communicated to the Company’s management, including the Company’s principal executive officer and principal financial officer, as appropriate, to allow timely decisions regarding required disclosure.\nConclusion Regarding the Effectiveness of Disclosure Controls and Procedures: As of the end of the period covered by this report, the Company carried out an evaluation, under the supervision and with the participation of the Company’s principal executive officer and principal financial officer, of the effectiveness of disclosure controls and procedures as defined in Rules 13a-15(e) and 15d-15(e) of the Exchange Act. Based on such evaluation, the Company’s principal executive officer and principal financial officer have concluded that as of May 31, 2021, the end of the period covered by this report, the Company’s disclosure controls and procedures were effective.\nChanges in Internal Control Over Financial Reporting: The Company also carried out an evaluation of the internal control over financial reporting to determine whether any changes occurred during the fiscal quarter ended May 31, 2021. Based on such evaluation, there have been no changes in the Company’s internal control over financial reporting that occurred during the Company’s most recently completed fiscal quarter ended May 31, 2021, that materially affected, or are reasonably likely to materially affect, the Company’s internal control over financial reporting.\nInternal Control Over Financial Reporting: The Report on Management’s Assessment of Internal Control Over Financial Reporting and the Report of Independent Registered Public Accounting Firm are included in Part II, Item 8 of this Form 10-K.",
    "item_9B": "Item 9B. Other Information\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot Applicable.\nPART III",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nThe following table shows the executive officers of the Company as of May 31, 2021, and information regarding their positions and business experience. Such executive officers hold principal policy-making powers at the Company.\nName\nAge\nPosition and business experience\nMartin Mucci\nMr. Mucci has served as President and Chief Executive Officer of the Company since September 2010. Mr. Mucci joined the Company in 2002 as Senior Vice President, Operations. Prior to joining Paychex, he held senior level positions with Frontier Communications of Rochester, a telecommunications company, including President of Telephone Operations and Chief Executive Officer of Frontier Telephone of Rochester, during his 20-year career. Mr. Mucci also serves as a director of NCR Corporation. Mr. Mucci was a director of Cbeyond, Inc. until it was purchased by Birch Communications in July 2014. He is a Trustee Emeritus of St. John Fisher College. He also serves as a director of the Company and is chairman of the Executive Committee.\nEfrain Rivera\nMr. Rivera joined Paychex in June 2011 as Senior Vice President, Chief Financial Officer, and Treasurer. Prior to joining the Company, Mr. Rivera served as Vice President of Finance and Administration for Houghton College from 2009 to 2011. He previously served for over twenty years with Bausch & Lomb Incorporated, a world leader in the development, manufacture, and marketing of eye health products, most recently as Corporate Vice President and Chief Financial Officer from 2007 to 2009.\nMark A. Bottini\nMr. Bottini joined Paychex in October 2011 as Senior Vice President of Sales. From 2008 to 2011, Mr. Bottini served as Vice President of Sales for Ricoh, North America, a provider of advanced office technology and innovative document imaging products, services, and software. He assumed his most recent position with Ricoh when Ricoh acquired IKON Office Solutions, Inc. During his nearly 20 years with IKON, Mr. Bottini served in a variety of sales leadership and field management roles.\nJohn B. Gibson\nMr. Gibson joined Paychex in May 2013 as Senior Vice President of Service. Prior to joining the Company, Mr. Gibson served as President and Chief Executive Officer for AlphaStaff, a national provider of human resource outsourcing services to small- and medium-sized businesses. Prior to joining AlphaStaff in 2010, Mr. Gibson was President of the HR Management Division of Convergys, a global leader in technology, outsourcing, and business services. From 2004 to 2007, he served as Senior Vice President of Global Operations and Client Services of Convergys.\nMichael E. Gioja\nMr. Gioja was named Senior Vice President of Information Technology and Product Development in July 2011. Mr. Gioja has been with the Company since November 2008 and previously served as Senior Vice President of Information, Technology, Product Management, and Development and Vice President of Product Management. Previously, he was Chief Information Officer and Executive Vice President of Products and Services for Workstream, Inc., a provider of on-demand enterprise talent management solutions and services.\nName\nAge\nPosition and business experience\nKaren E. Saunders McClendon\nMs. Saunders McClendon joined the Company in April 2021 as Vice President and Chief Human Resources Officer. Prior to joining the Company, she served as Vice President of Human Resources for Comcast Cable from 2013 to 2021. From 2009 to 2013, she served as Vice President of Human Resources for Aramark.\nStephanie L. Schaeffer\nMs. Schaeffer was named Vice President and Chief Legal Officer in January 2006. In 2011, she was appointed Corporate Secretary. She joined Paychex in 2000 as Corporate Counsel and was promoted to Director of Legal Affairs in 2004. In her current role, she is responsible for overseeing all the Company's legal functions, including litigation, corporate governance, and regulatory matters.\nRobert L. Schrader\nMr. Schrader was named Vice President and Controller in July 2019. He joined the Company in December 2014 and previously held roles as Senior Director of Financial Planning and Analysis and Director of Internal Audit. Prior to joining Paychex, he served as a Chief Financial Officer for Unither Manufacturing, LLC, and held various senior management positions during his ten-year career at Bausch & Lomb, including Vice President of Finance and Controller of Global Quality and Operations. Previously in his career, he held leadership roles with a public accounting firm.\nThe additional information required by this item is set forth in the Company’s Definitive Proxy Statement for its 2021 Annual Meeting of Stockholders, anticipated to be held on or about October 14, 2021, in the sections “MANAGEMENT PROPOSAL 1: ELECTION OF DIRECTORS FOR A ONE-YEAR TERM,” “CORPORATE GOVERNANCE,” “DELINQUENT SECTION 16(a) REPORTS,” and “CODE OF BUSINESS ETHICS AND CONDUCT” and is incorporated herein by reference.",
    "item_11": "Item 11. Executive Compensation\nThe information required by this item is set forth in the Company’s Definitive Proxy Statement for its 2021 Annual Meeting of Stockholders, anticipated to be held on or about October 14, 2021, in the sections “COMPENSATION DISCUSSION AND ANALYSIS,” “NAMED EXECUTIVE OFFICER COMPENSATION,” “DIRECTOR COMPENSATION FOR THE FISCAL YEAR ENDED May 31, 2021,” “THE GOVERNANCE AND COMPENSATION COMMITTEE REPORT” and the sub-heading “Governance and Compensation Committee Interlocks and Insider Participation” within the section “CORPORATE GOVERNANCE” and is incorporated herein by reference.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this item is set forth below and in the Company’s Definitive Proxy Statement for its 2021 Annual Meeting of Stockholders, anticipated to be held on or about October 14, 2021, under the section “BENEFICIAL OWNERSHIP OF PAYCHEX COMMON STOCK,” and is incorporated herein by reference.\nThe Company maintains equity compensation plans in the form of stock incentive plans. Under the Paychex, Inc. 2002 Stock Incentive Plan, as last amended and restated effective October 15, 2020 (the “2002 Plan”), non-qualified or incentive stock options, restricted stock, restricted stock units, performance shares, and performance stock options have been awarded to employees and the Board. The 2002 Plan was adopted on July 9, 2020 by the Board and became effective upon stockholder approval at the Company’s Annual Meeting of Stockholders held on October 15, 2020. Refer to Note F of the Notes to Consolidated Financial Statements, contained in Item 8 of this Form 10-K, for more information on the Company’s stock incentive plans.\nThe following table details information on securities authorized for issuance upon the exercise of outstanding options under the Company’s equity compensation plans as of May 31, 2021:\nIn millions, except per share amounts\nNumber of securities to be issued upon exercise of outstanding options(1)\nWeighted-average exercise price of outstanding options\nNumber of securities remaining available for future issuance under equity compensation plans(2)\nEquity compensation plans approved by security holders\n4.3\n$\n62.54\n16.4\n(1)Amounts include performance stock options granted, assuming achievement of performance goals at target. Actual number of shares to be earned may differ from the target amount.\n(2)Includes shares available for future issuance through grants of restricted stock units and restricted stock awards under our 2002 Plan. Refer to Note F of the Notes to Consolidated Financial Statements, contained in Item 8 of this Form 10-K, for more information on the Company’s stock incentive plans.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by this item is set forth in the Company’s Definitive Proxy Statement for its 2021 Annual Meeting of Stockholders, anticipated to be held on or about October 14, 2021, under the sub-headings “Board Meetings and Committees,” “Policy on Transactions with Related Persons,” and “Transactions with Related Persons” within the section “CORPORATE GOVERNANCE,” and is incorporated herein by reference.",
    "item_14": "Item 14. Principal Accounting Fees and Services\nThe information required by this item is set forth in the Company’s Definitive Proxy Statement for its 2021 Annual Meeting of Stockholders, anticipated to be held on or about October 14, 2021, under the section “MANAGEMENT PROPOSAL 3: RATIFICATION OF THE SELECTION OF OUR INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM,” and is incorporated herein by reference.\nPART IV",
    "item_15": "Item 15. Exhibits and Financial Statement Schedules\n(a)\nFinancial Statements, Financial Statement Schedules, and Exhibits\n1.\nFinancial Statements\nSee Financial Statements and Supplementary Data Table of Contents at page 37.\n2.\nFinancial Statement Schedules\nFinancial statement schedules required to be filed by Item 8 of this Form 10-K include Schedule II - Valuation and Qualifying Accounts. See Financial Statements and Supplementary Data Table of Contents at page 37. All other schedules are omitted as the required matter is not present, the amounts are not significant, or the information is shown in the financial statements or the notes thereto.\n3.\nExhibits\n(2.1)\nStock Purchase Agreement by and among Oasis Outsourcing Acquisition Corporation, Oasis Outsourcing Group Holdings, L.P., and Paychex North America Inc., incorporated herein by reference from Exhibit 2.1 to the Company’s Form 10-Q filed with the Commission on December 21, 2018.\n(3)(a)\nRestated Certificate of Incorporation, incorporated herein by reference from Exhibit 3(a) to the Company’s Form 10-K filed with the Commission on July 20, 2004.\n(3.1)\nAmended and Restated By-Laws of Paychex, Inc., as of May 1, 2020, incorporated herein by reference from Exhibit 3.1 to the Company’s Form 8-K filed with the Commission on May 5, 2020.\n(4.1)\nForm of 4.07% Senior Notes, Series A, of Paychex of New York LLC, due March 13, 2026, incorporated herein by reference from Exhibit 4.1 to the Company’s Form 8-K filed with the Commission on January 11, 2019.\n(4.2)\nForm of 4.25% Senior Notes, Series B, of Paychex of New York LLC, due March 13, 2029, incorporated herein by reference from Exhibit 4.2 to the Company’s Form 8-K filed with the Commission on January 11, 2019.\n(4.3)\nDescription of Registrant’s Securities, incorporated herein by reference from Exhibit 4.3 to the Company’s Form 10-K filed with the Commission on July 24, 2019.\n#\n(10.1)\nPaychex, Inc. 2015 Qualified Employee Stock Purchase Plan, incorporated herein by reference from Exhibit 4.3 to the Company’s Registration Statement on Form S-8, No. 333-207594.\n#\n(10.2)\nPaychex, Inc. 2002 Stock Incentive Plan (as amended and restated effective October 14, 2015), incorporated herein by reference from Exhibit 4.3 to the Company’s Registration Statement on Form S-8, No. 333-207592.\n#\n(10.3)\nPaychex, Inc. 2002 Stock Incentive Plan (as amended and restated effective October 12, 2005) Form of Non-Qualified Stock Option Award Agreement (Officer), incorporated herein by reference from Exhibit 10.19 to the Company’s Form 10-K filed with the Commission on July 16, 2010.\n#\n(10.4)\nPaychex, Inc. 2002 Stock Incentive Plan (as amended and restated effective October 13, 2010) Form of Non-Qualified Stock Option Award Agreement (Board), incorporated herein by reference from Exhibit 10.20 to the Company’s Form 10-K filed with the Commission on July 15, 2011.\n#\n(10.5)\nPaychex, Inc. 2002 Stock Incentive Plan (as amended and restated effective October 14, 2015) Form of Non-Qualified Stock Option and Restricted Stock Award Agreement LTIP, incorporated herein by reference from Exhibit 10.14 to the Company’s Form 10-K filed with the Commission on July 22, 2016.\n#\n(10.6)\nPaychex, Inc. Change In Control Plan, incorporated herein by reference from Exhibit 10.24 to the Company’s Form 10-K filed with the Commission on July 15, 2011.\n#\n(10.7)\nPaychex, Inc. Form of Performance Award Incentive Program, incorporated herein by reference from Exhibit 10.25 to the Company’s Form 10-K filed with the Commission on July 15, 2011.\n(10.8)\nForm of Indemnity Agreement for Directors and Officers, incorporated herein by reference from Exhibit 10.1 to the Company’s Form 10-Q filed with the Commission on March 28, 2012.\n#\n(10.9)\nPaychex, Inc. Board Deferred Compensation Plan, incorporated herein by reference from Exhibit 10.29 to the Company’s Form 10-K filed with the Commission on July 20, 2009.\n#\n(10.10)\nPaychex, Inc. Employee Deferred Compensation Plan, incorporated herein by reference from Exhibit 10.30 to the Company’s Form 10-K filed with the Commission on July 20, 2009.\n#\n(10.11)\nPaychex, Inc. 2002 Stock Incentive Plan (as amended and restated October 14, 2015) Form of Non-Qualified Stock Option Award Agreement, incorporated herein by reference from Exhibit 10.18 to the Company’s Form 10-K filed with the Commission on July 21, 2017.\n#\n(10.12)\nPaychex Inc. 2002 Stock Incentive Plan (as amended and restated October 14, 2015) Form of Officer Performance Incentive Award Agreement (Long-Term), incorporated herein by reference from Exhibit 10.19 to the Company’s Form 10-K filed with the Commission on July 21, 2017.\n#\n(10.13)\nPaychex, Inc. 2002 Stock Incentive Plan (as amended and restated effective October 14, 2015) Amendment to Award Agreements, incorporated herein by reference from Exhibit 10.2 to the Company’s Form 8-K filed with the Commission on September 8, 2017.\n(10.14)\nNote Purchase and Guarantee Agreement, dated as of January 9, 2019, by and among the Company, the Parent, and the respective purchasers thereto, incorporated herein by reference from Exhibit 10.1 to the Company’s Form 8-K filed with the Commission on January 11, 2019.\n#\n(10.15)\nPaychex, Inc. 2002 Stock Incentive Plan (as amended and restated effective October 14, 2015) Amended Form of Restricted Stock Unit Award Agreement, incorporated herein by reference from Exhibit 10.1 to the Company’s Form 10-Q filed with the Commission on October 4, 2019.\n#\n(10.16)\nPaychex, Inc. 2002 Stock Incentive Plan (as amended and restated effective October 14, 2015) Amended Form of Restricted Stock Unit Award Agreement (Officer), incorporated herein by reference from Exhibit 10.2 to the Company’s Form 10-Q filed with the Commission on October 4, 2019.\n#\n(10.17)\nPaychex, Inc. 2002 Stock Incentive Plan (as amended and restated effective October 14, 2015) Amended Form of 2019-2021 Performance Incentive Award Agreement, incorporated herein by reference from Exhibit 10.3 to the Company’s Form 10-Q filed with the Commission on October 4, 2019.\n#\n(10.18)\nPaychex, Inc. 2002 Stock Incentive Plan (as amended and restated effective October 14, 2015) Amended Form of Non-Qualified Stock Option Award Agreement, incorporated herein by reference from Exhibit 10.4 to the Company’s Form 10-Q filed with the Commission on October 4, 2019.\n#\n(10.19)\nPaychex, Inc. 2002 Stock Incentive Plan (as amended and restated effective October 14, 2015) Master Restricted Stock Unit Award Agreement, incorporated herein by reference from Exhibit 10.5 to the Company’s Form 10-Q filed with the Commission on October 4, 2019.\n(10.20)\nFive-Year Credit Agreement, dated as of July 31, 2019, by and among the Company, the Parent, and the lender parties hereto, incorporated herein by reference from Exhibit 10.1 to the Company’s Form 8-K filed with the Commission on August 1, 2019.\n(10.21)\nThree-Year Credit Agreement, dated as of February 6, 2020, by and among Paychex Advance LLC, Paychex Inc., and the lender party thereto, incorporate herein by reference from Exhibit 10.1 to the Company’s Form 8-K filed with the Commission on February 11, 2020.\n(10.22)\nForm of Pooled Plan Provider Indemnification Agreement, incorporated herein by reference from Exhibit 10.1 to the Company's Form 8-K filed with the Commission on February 23, 2021.\n* #\n(10.23)\nPaychex, Inc. 2002 Stock Incentive Plan (as amended and restated effective October 15, 2020).\n*\n(21.1)\nSubsidiaries of the Registrant.\n*\n(23.1)\nConsent of Independent Registered Public Accounting Firm, PricewaterhouseCoopers LLP.\n*\n(24.1)\nPower of Attorney.\n*\n(31.1)\nCertification Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n*\n(31.2)\nCertification Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n*\n(32.1)\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n*\n(32.2)\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n*\n101.INS\nXBRL instance document.\n*\n101.SCH\nXBRL taxonomy extension schema document.\n*\n101.CAL\nXBRL taxonomy extension calculation linkbase document.\n*\n101.LAB\nXBRL taxonomy label linkbase document.\n*\n101.PRE\nXBRL taxonomy extension presentation linkbase document.\n*\n101.DEF\nXBRL taxonomy extension definition linkbase document.\n*\nCover Page Interactive Data File - the cover page interactive data file does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n*\nExhibit filed with this report.\n#\nManagement contract or compensatory plan.\nItem 16. Form 10-K Summary\nNone.\n‎\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, on July 16, 2021.\nPAYCHEX, INC.\nBy: /s/ Martin Mucci\nMartin Mucci\nPresident and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities indicated on July 16, 2021.\n/s/ Martin Mucci\nMartin Mucci, President and\nChief Executive Officer, and Director\n(Principal Executive Officer)\n/s/ Efrain Rivera\nEfrain Rivera, Senior Vice President, Chief Financial Officer, and Treasurer\n(Principal Financial Officer)\n/s/ Robert L. Schrader\nRobert L. Schrader, Vice President and Controller\n(Principal Accounting Officer)\nB. Thomas Golisano*, Chairman of the Board\nThomas F. Bonadio*, Director\nJoseph G. Doody*, Director\nDavid J.S. Flaschen*, Director\nPamela A. Joseph*, Director\nKevin A. Price*, Director\nJoseph M. Tucci*, Director\nJoseph Velli*, Director\nKara Wilson*, Director\n*By: /s/ Martin Mucci\nMartin Mucci, as Attorney-in-Fact"
}