{
    "cik": "727634",
    "company": "iSign Solutions Inc.",
    "filing_type": "10-K",
    "filing_date": "2021-04-07",
    "period_of_report": "2020-12-31",
    "sic": "7372",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/727634/0001213900-21-020616-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/727634/000121390021020616/f10k2020_isignsolutions.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/727634/0001213900-21-020616.txt",
    "filename": "727634_10K_2020_0001213900-21-020616.htm",
    "item_1": "Item 1. Business\nGeneral\niSign Solutions Inc. (the “Company” or “iSign”), was incorporated in Delaware in October 1986. iSign is a leading supplier of digital transaction management (DTM) software enabling the paperless, secure and cost-effective management and authentication of document-based transactions. iSign’s solutions encompass a wide array of functionality and services, including electronic signatures, simple-to-complex workflow management and various options for biometric authentication. These solutions are available across virtually all enterprise, desktop and mobile environments as a seamlessly integrated platform for both ad-hoc and fully automated transactions. iSign’s platform can be deployed both on premise and as a cloud-based (“SaaS”) service, with the ability to easily transition between deployment models. The Company is headquartered in San Jose, California.\nIn December 2019, an outbreak of a novel strain of coronavirus (COVID-19) originated in Wuhan, China and has since spread to a number of other countries, including the U.S. On March 11, 2020, the World Health Organization characterized COVID-19 as a pandemic. In addition, several states in the U.S., including California, where the Company is headquartered, have experienced an increase of new cases of COVID-19. It is uncertain if this trend will continue into 2021, as shown by the recent uptick in reported cases. The COVID-19 outbreak is disrupting supply chains and affecting production and sales across a wide range of industries. The extent of the impact of COVID-19 on our operational and financial performance will depend on certain developments, including the duration and spread of the outbreak, impact on our customers, employees and vendors all of which are uncertain and cannot be predicted. At this point, the extent to which COVID-19 may impact our financial condition or results of operations is uncertain.\nFor the year ended December 31, 2020, total revenue was $966, an increase of $122, or 14%, compared to total revenue of $844 in the prior year. For the year ended December 31, 2020, software product revenue was $247, an increase of $52, or 27%, compared to product revenue of $195 in the prior year. Maintenance revenue for the year ended December 31, 2020 was $719, an increase of $70, or 11%, compared to maintenance revenue of $649 in the prior year. These increases are primarily attributable to the Company’s growth in recurring revenue and related engineering services.\nFor the year ended December 31, 2020, the net loss was $528, a decrease of $558, or 51%, compared to $1,086 in the prior year. For the year ended December 31, 2020, non-cash charges, consisting of interest expense, warrant expense and the amortization of debt discount were $293, a decrease of $11, or 4%, compared to $304 in the prior year. For the year ended December 31, 2020, operating expenses were $1,619, a decrease of $8, or 0.5%, compared to operating expenses of $1,627 for the prior year. The decrease in operating expenses resulted from reductions in the amortization of stock options and warrant compensation and professional service expenses.\nCore Technologies\nThe Company’s core technologies can be referred to as “transaction-enabling” and “business process work flow” technologies. These technologies include various forms of electronic signature methods, such as handwritten, biometric, click-to-sign and others, as well as technologies related to signature verification, authentication, cryptography and the logging of audit trails to prove signers’ intent. These technologies enable the appending of secure, legal and regulatory compliant electronic signatures coupled with an enhanced user experience, all at a fraction of the time and cost required by traditional, paper-based processes for signature capture.\nProducts\nThe Company’s enterprise-class SignatureOne® and iSign® suite of electronic signature solutions enable businesses to implement truly paperless, electronic signature-driven business processes. The aggregate of the software functionality enabling the digitization of end-to-end work flow processes is sometimes referred to as “digital transaction management” (DTM). Many applications provide electronic forms and allow users to fill-in information, but most of these applications still require users to print out a paper copy for a handwritten, ink signature. Solutions powered by iSign products allow legally binding electronic signatures to be added to digital documents, eliminating the need for paper to memorialize the completion, approval or authentication of the transaction. This allows users to reduce transaction times and processing costs.\nThe SignatureOne® and iSign® suite of products includes the following:\nSignatureOne® Ceremony® Server The SignatureOne® Ceremony® Server (“Ceremony Server”) provides a highly secure, scalable, patent-protected and streamlined electronic signature solution. Its flexible, easy-to-configure and agile workflow can be rapidly integrated via standard Web services to become an ultimate and cost efficient endpoint in true straight-through processing (the complete removal of paper from business processes) and to facilitate end-to-end management of multi-party approvals for PDF and XHTML documents. The Ceremony Server contains iSign’s core e-signature engine and signature ceremony management tools, and can be seamlessly integrated with numerous ancillary products. Its key features include:\n● Consent/disclosure management - integral part of audit record; easily reproducible in the event of a dispute;\n● Configurable document presentment - signatory receipt, access and viewing of document tracked in audit trail;\n● Multi-party ceremonies - complex processes, simplified; allows for dynamic, multi-channel workflow changes, including remote, face-to-face and mobile scenarios;\n● Supports complex business rules and dynamic user behaviors;\n● Configurable branding and workflow;\n● Flexible tracking and reporting - includes event notification service\n● Extensive audit trail - embedded in individual document in a tamper evident digital seal; and\n● Support for multiple signature methods - click-to-sign; biometric; and others.\niSign® Console™ The iSign® Console™ (“Console”) leverages the Ceremony Server’s core signature engine and is ideal for organizations looking for a standalone electronic signature solution. Through its intuitive graphical interface, the Console allows users to upload documents for signature, select signers and signature methods, and manage and enforce document workflow for routing, reviewing, signing and notifications. The Console offers a secure and intuitive solution that requires no integration and is available on-premise or in the cloud.\niSign® Enterprise iSign® Enterprise incorporates the features and function of the Ceremony Server and the Console.\niSign® Family The growing suite of iSign® products and service includes iSign® Mobile (for signing on iOS and Android mobile devices), iSign® Forms (for integrated use of templates and forms), and iSign® Live (iSign’s patent-pending co-browsing solution for simultaneous browsing signature ceremonies).\nSign-it® Sign-it® is a family of desktop software products that enable the real-time capture of electronic and digital signatures, as well as their verification and binding within a standard set of applications, including Adobe Acrobat and Microsoft Word, web-based applications using HTML, XML and XHTML, and custom applications for .NET, C# and similar development environments for the enterprise market. The Sign-it® family of products combines the strengths of biometrics, and other forms of electronic signatures, with cryptography in a patented process that insures the creation of documents containing legally compliant electronic signatures. These signatures have the same legal standing as a traditional so-called wet signature on paper and are created pursuant to the Electronic Signature in National and Global Commerce Act, as well as other related legislation and regulations. With Sign-it® products, organizations wishing to process electronic forms, requiring varying levels of security, can reduce the cost and other inefficiencies inherent with paper documents by adding electronic signature technologies to their workflow solutions.\niSign® Toolkits The iSign® suite of application development tools for electronic signature capture, encryption and verification in custom applications and web-based processes captures and analyzes the image, speed, stroke sequence and acceleration of a person’s handwritten electronic signature. This capability offers an effective and inexpensive solution for immediate authentication of handwritten signatures. iSign® toolkits also store certain forensic elements of an electronic signature for use in determining whether a person’s electronic signature is legally valid. They also include software libraries for industry standard encryption and hashing to protect a user’s signature, as well as the data captured in the Ceremony® process.\nProducts and upgrades that were introduced and first deployed in 2020 include the following:\niSign Enterprise 7.4.4\niSign Enterprise 7.5\niSign Enterprise 7.4.5\niSign Enterprise 7.5.1\niSign Enterprise 7.4.6\niSign Enterprise 7.5.2\niSign Enterprise 7.5.3\niSign Enterprise 7.5.4\niSign Enterprise 6.6.24\niSign Enterprise 7.6\niSign Enterprise 6.6.25\niSign Enterprise 7.5.5\niSign Enterprise 7.6.1\niSign Enterprise 7.5.6\nSign-it for Acrobat 10.7\nIntellectual Property\nThe Company relies on a combination of patent applications, trademarks, trade secrets and contractual provisions to protect its software offerings and technologies. The Company has a policy of requiring its employees and contractors to commit to the protection of proprietary information through written agreements. The Company also has a policy of requiring prospective business partners to enter into non-disclosure agreements before disclosure of any of its proprietary information.\nOver the years, the Company has developed and patented major elements of its software offerings and technologies. The Company currently has the following applications pending:\nPatent App. No.\nFiling Date\n14/650,271\nJune 5, 2015\n14/455,425\nAugust 8, 2014\nThe Company’s technologies go beyond simple electronic signature and include biometric signatures, verification solutions, authentication and validation methods, that result in signed documents that are secure, legal and tamper-resistant.\nThe Company has over 20 registered and unregistered trademarks in the United States and other countries. The Company intends to register its trademarks in those jurisdictions where significant marketing of its products will be undertaken in the foreseeable future.\nResearch and Development\nOur research and development effort is focused on the development, advancement and refinement of our core products and the development of new products. In addition, our research and development team is responsible for the continuous quality measurement and assurance of both existing and new products. We conduct research on software technology, related computer hardware, competitive offerings and alternative solution approaches to develop appropriate product and service offerings for our target markets. Our research and development efforts are often aimed at assisting clients and licensees in further streamlining new and existing workflow processes that our software solutions support and at ensuring that we meet or exceed industry standards and competitive offerings. We provide certain customization and integration services to our clients, including software integration partners and enterprise customers. These efforts are conducted by our team in San Jose, California, supported by contracted staff, including offshore engineers.\nWe believe that our software technologies, platforms and products are now competitive and, while research and development activities will remain at the core of our operations, we intend, going forward, to invest an increasing amount of our resources in sales and marketing activities.\nOur research and development expense was $578 for the year ended December 31, 2020 and $630 for the year ended December 31, 2019.\nMaterial Customers\nHistorically, the Company’s revenue has been derived from hundreds of customers, but a significant percentage of the revenue has been attributable to a limited number of customers. Four customers, as described in Note 2 to the Consolidated Financial statements, accounted for 10%, 23%, 23% and 25%, respectively, of total revenue for the year ended December 31, 2020.\nSeasonality of Business\nThe Company believes that the sale of its products is not subject to seasonal fluctuations.\nBacklog\nBacklog was approximately $215 and $416 at December 31, 2020 and 2019, respectively, representing advanced payments on product and service maintenance agreements. One customer decided to convert their December renewal of a $94 annual maintenance contract to a maintenance contract on a time and materials basis in 2021.\nCompetition\nWe believe that our primary competitive advantages include the following:\n● Customer options and platform flexibility: Unlike most of our competitors, we offer many flexible configuration options for enterprise clients to address many variants of complex business work flows without the need for costly and time-consuming customization. These solution configurations can be rapidly and seamlessly integrated into a variety of enterprise technology environments.\n● Software deployment options: Unlike most of our competitors, our software solutions are available as an on demand, private cloud-based software as a service, and on the customer’s premises, which is an important feature for most of our large enterprise clients for compliance, security and control reasons.\n● Lower cost structure: Through our technology, sales and marketing partners, including Cegedim SA, we believe we offer a lower relative cost structure and higher operating margin than most of our larger competitors.\nCurrently, our primary competition for basic click-to-sign electronic signatures includes Adobe EchoSign, DocuSign and OneSpan (f.k.a. VASCO Data Security International Inc.). We view the balance of the U.S. market as fragmented with a variety of smaller competitors focused on the consumer and small business markets rather than enterprise organizations.\nEmployees\nAs of December 31, 2020, the Company employed five full-time employees, one part time employee and eight independent contractors. The Company has established longstanding strategic relationships that allow it to rapidly access product development and deployment capabilities that could be required to address most customer requirements. None of the Company’s employees are party to any collective bargaining agreements. We believe our employee relations are good.\nGeographic Areas\nFor the years ended December 31, 2020 and 2019, sales in the United States as a percentage of total sales was 75% and 80%, respectively. At December 31, 2020 and 2019, long-lived assets located in the United States were $10 and $13, respectively. There were no long-lived assets located elsewhere as of December 31, 2020 and 2019.\nSegments\nThe Company reports its financial results in one segment.\nAvailable Information\nOur web site is located at www.isignnow.com. The information on or accessible through our web site is not part of this Annual Report on Form 10-K. Our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to such reports are available, free of charge, on our web site as soon as reasonably practicable after we electronically file with or furnish such material to the Securities and Exchange Commission (“SEC”). Furthermore, a copy of this Annual Report on Form 10-K and other reports filed by iSign with the SEC may be read and copied by the public at the SEC’s Public Reference Room at 100 F Street, NE, Washington, D.C. 20549 on official business days during the hours of 10 a.m. and 3 p.m. Information on the operation of the Public Reference Room can be obtained by calling the SEC at 1-800-SEC-0330. The SEC maintains an internet site that contains reports, proxy and information statements and other information regarding issuers, including iSign, that file electronically with the SEC at www.sec.gov.",
    "item_1A": "Item 1A.\tRisk Factors\nNot applicable.",
    "item_1B": "Item 1B.\tUnresolved Staff Comments\nNone.",
    "item_2": "Item 2.\tProperties\nThe Company rents its principal facilities, consisting of approximately 144 square feet in San Jose, California, pursuant to a month to month arrangement.",
    "item_3": "Item 3.\tLegal Proceedings\nNone.",
    "item_4": "Item 4.\tMine Safety Disclosures\nNone.\nPART II",
    "item_5": "Item 5. \tMarket for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nThe Company’s common stock (“Common Stock”) is quoted on OTC Markets Group Inc.’s OTC Pink quotation system under the trading symbol ISGN. Trading activity for the Company’s Common Stock can be viewed at www.otcmarkets.com. The following table sets forth the high and low sale prices of the Common Stock for the periods noted.\nSale Price\nPer Share\nYear Period High Low\nFirst Quarter $ 0.70 $ 0.38\nSecond Quarter $ 0.55 $ 0.34\nThird Quarter $ 0.59 $ 0.31\nFourth Quarter $ 0.47 $ 0.30\nFirst Quarter $ 0.51 $ 0.31\nSecond Quarter $ 0.40 $ 0.29\nThird Quarter $ 0.50 $ 0.30\nFourth Quarter $ 0.44 $ 0.20\nHolders\nAs of March 20, 2021, there were approximately 130 holders of record of our Common Stock.\nDividends\nTo date, the Company has not paid any dividends on its Common Stock and does not anticipate paying any such dividends in the foreseeable future. The declaration and payment of dividends on the Common Stock is at the discretion of the Board of Directors and will depend on, among other things, the Company’s operating results, financial condition, capital requirements, contractual restrictions or such other factors as the Board of Directors may deem relevant.\nRecent Sales of Unregistered Securities\nNone\nIssuer Purchases of Equity Securities\nNone.",
    "item_6": "Item 6. Selected Financial Data\nNot applicable.",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis should be read in conjunction with our financial statements and related notes appearing elsewhere in this Form 10-K. The following discussion relating to projected growth and future results and events constitutes forward-looking statements. Actual results in future periods may differ materially from the forward-looking statements due to a number of risks and uncertainties. We cannot guarantee future results, levels of activity, performance or achievements. Except as otherwise required under applicable law, we disclaim any obligation to revise or update forward-looking statements to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events.\nUnless otherwise stated herein, all figures in this Item 7, other than price per share data, are stated in thousands (“000s”).\nOverview and Recent Developments\nThe Company is a leading supplier of DTM software enabling the paperless, secure and cost-effective management and authentication of document-based transactions. iSign’s solutions encompass a wide array of functionality and services, including electronic signatures, simple-to-complex workflow management and various options for biometric authentication. These solutions are available across virtually all enterprise, desktop and mobile environments as a seamlessly integrated platform for both ad-hoc and fully automated transactions. The Company’s products and services result in legally binding transactions that are compliant with applicable laws and regulations and that can provide a higher level of security than paper-based processes. The Company has been a leading supplier of enterprise software solutions within the financial services and insurance industries and has made available to its customers significant expense reduction by enabling a completely electronic document and workflow process, as well as the resulting reduction in mailing, scanning, filing and other costs related to the use of paper.\nThe Company was incorporated in Delaware in October 1986. Except for the year ended December 31, 2004, in each year since its inception the Company has incurred losses. For the two-year period ended December 31, 2020, the net loss aggregated approximately $1,761, and at December 31, 2020, the Company’s accumulated deficit was approximately $135,350.\nIn December 2019, an outbreak of a novel strain of coronavirus (COVID-19) originated in Wuhan, China and has since spread to a number of other countries, including the U.S. On March 11, 2020, the World Health Organization characterized COVID-19 as a pandemic. In addition, several states in the U.S., including California, where the Company is headquartered, have experienced an increase of new cases of COVID-19. It is uncertain if this trend will continue into the 2021, as shown by the recent uptick in reported cases. The COVID-19 outbreak is disrupting supply chains and affecting production and sales across a wide range of industries. The extent of the impact of COVID-19 on our operational and financial performance will depend on certain developments, including the duration and spread of the outbreak, impact on our customers, employees and vendors all of which are uncertain and cannot be predicted. At this point, the extent to which COVID-19 may impact our financial condition or results of operations is uncertain.\nFor the year ended December 31, 2020, total revenue was $966, an increase of $122, or 14%, compared to total revenue of $844 in the prior year. For the year ended December 31, 2020, software product revenue was $247, an increase of $52, or 27%, compared to product revenue of $195 in the prior year. Maintenance revenue for the year ended December 31, 2020 was $719, an increase of $70, or 11%, compared to maintenance revenue of $649 in the prior year. These increases are primarily attributable to the Company’s growth in recurring revenue and related engineering services.\nFor the year ended December 31, 2020, operating expenses were $1,619, a decrease of $8, or 0.5%, compared to operating expenses of $1,627 in the prior year. The decrease in operating expense resulted from reductions in the amortization of stock options and professional service expenses. For the year ended December 31, 2020, the loss from operations was $653, a decrease of $130, or 17%, compared to a loss from operations of $783 in the prior year.\nOn May 6, 2020, the Company received loan proceeds in the amount of approximately $123 under the Paycheck Protection Program (“PPP”). The PPP, established as part of the Coronavirus Aid, Relief and Economic Security Act (“CARES Act”), provides for loans to qualifying businesses for amounts up to 2.5 times of the average monthly payroll expenses of the qualifying business. The Companies may apply for the loans and accrued interest to be forgiven after a period of either eight or twenty-four weeks, as long as the borrower uses the loan proceeds for eligible purposes, including payroll, benefits, rent and utilities, and maintains its payroll levels. The amount of loan forgiveness may be reduced if the borrower terminates employees or reduces salaries during the period in question. Under the terms of the related promissory note, the unforgiven portion of the PPP loan is payable over two years at an interest rate of 1%, with a deferral of payments for the first six months. The Company used the proceeds for purposes consistent with the PPP. While the Company currently believes that its use of the loan proceeds, for the most part, meet the conditions for forgiveness of the loan, we cannot assure you that we did not take actions that caused the Company to be ineligible for forgiveness of the loan, in whole or in part.\nThe Company recorded $3 in debt discount amortization for the twelve months ended December 31, 2020 related to its debt financings.\nOn January 28, 2020, the Company issued 30 warrants to a consultant for services. The warrants are exercisable for three years with an exercise price of $0.50 per share. The Company ascribed a value of $13 to the warrants based on the Black-Scholes-Merton valuation model. The warrant cost was charged to general and administrative expense during the period.\nOn July 9, 2020, the Company entered into a settlement agreement with a vendor. In addition to a cash payment the Company issued 10 warrants to purchase 10 shares of common stock in settlement of the outstanding accounts payable balance. The warrants are exercisable for five years with an exercise price of $0.50 per share. The Company ascribed a value of $3 to the warrants based on the Black-Scholes-Merton valuation model. The warrant cost was charged to general and administrative expense during the period.\nOn August 11, 2020, the Company issued warrants to purchase 425 shares of common stock to two consultants associated with their unpaid consulting fees. The Company ascribed a value of $160 to the warrants which is booked as stock based compensation in general and administrative expense in the statement of operations. The warrants are only exercisable for deferred consulting fees. Upon exercise, the Company would not receive any cash and would reduce accrued expenses. The above warrants have a three year life from the date of grant and an exercise price of $0.50 per share.\nNew Accounting Pronouncements\nSee Note 1, Notes to Consolidated Financial Statements included under Part IV, Item 15 of this report on Form 10-K.\nCritical Accounting Policies\nThe preparation of financial statements and related disclosures in conformity with accounting principles generally accepted in the United States of America requires management to make judgments, assumptions and estimates that affect the amounts reported in the Company’s consolidated financial statements and the accompanying notes. The amounts of assets and liabilities reported in its balance sheets and the amounts of revenue and expenses reported for each period presented are affected by these estimates and assumptions that are used for, but not limited to, revenue recognition, allowance for doubtful accounts, intangible asset impairments, fair value of financial instruments, stock based compensation and valuation allowances on deferred tax assets. Actual results may differ from these estimates. The following critical accounting policies are significantly affected by judgments, assumptions and estimates used by the Company’s management in the preparation of the consolidated financial statements.\nStock based Compensation: Stock-based compensation expense is based on the estimated grant date fair value of the portion of stock-based payment awards that are ultimately expected to vest during the period. The grant date fair value of stock-based awards to employees and directors is calculated using the Black-Scholes-Merton option pricing model. Forfeitures of share-based payment awards are estimated at the time of grant and revised, if necessary, in subsequent periods if actual forfeitures differ from those estimates. Forfeitures are estimated and it is assumed no dividends will be declared. The estimated fair value of stock-based compensation awards to employees is amortized on an accrual basis over the vesting period of the options.\nValuation of equity warrants: The Company values warrants issued using the Black-Scholes-Merton pricing model.\nDerivatives: The Company follows the relevant accounting guidance and records derivative instruments (including certain derivative instruments embedded in other contracts) in the consolidated balance sheet as either an asset or a liability measured at their fair value, with changes in the derivative’s fair value recognized currently in earnings. The Company values these derivative securities under the fair value method at the end of each reporting period (quarter), and their value is marked-to-market at the end of each reporting period with the gain or loss recorded in earnings. The Company continues to revalue these instruments each quarter to reflect their current value in light of the current market price of our Common Stock. The Company used a simulated probability valuation model to value warrants containing embedded derivative instruments. Determining the appropriate fair-value model and calculating the fair value of such warrants requires considerable judgment. Any change in the estimates (specifically, probabilities) used may cause the value to be higher or lower than that reported. The assumptions used in the model require significant judgment by management and include the following: volatility, expected term, risk-free interest rate, dividends, and warrant holders’ expected rate of return, reset provisions based on expected future financings, projected stock prices, and probability of exercise.\nThe conversion option included within the unsecured convertible promissory notes is accounted for as a derivative liability at its estimated fair value. The derivative is subject to re-measurement at the end of each reporting period, with changes in fair value recognized as a component of interest and other income, in the consolidated statements of operations. The Company will continue to adjust the liability for changes in fair value until the earlier of the conversion or maturity of the unsecured convertible promissory note purchase agreements.\nRevenue: The Company’s principal sources of revenues are from the sale of software products, SOW (engineering services), annual software product, and software maintenance contracts. The Company also derives revenue from customers based on the numbers of signatures produced by the Company’s signature software solutions imbedded within the customer’s product.\nRevenue from contracts with customers is recognized using the following five steps:\na) Identify the contract(s) with a customer;\nb) Identify the performance obligations (a good or service) in the contract;\nc) Determine the transaction price; for each performance obligation within the contract\nd) Allocate the transaction price to the performance obligations in the contract; and\ne) Recognize revenue when (or as) the Company satisfies a performance obligation.\nContracts contain performance obligation(s) for the transfer goods or services to a customer. The performance obligations are a promise (or a group of promises) that are distinct. The transaction price is the amount of consideration a Company expects to receive from a customer in exchange for satisfying the performance obligations specified in the contract.\nContracts may contain one or more performance obligations (a good or service). Performance obligations are accounted for separately if they are distinct. A good or service is distinct if the customer can benefit from the good or service either on its own or together with other resources readily available to the customer, and the good or service is distinct in the context of the contract. Otherwise performance obligations will be combined with other promised goods or services until the Company identifies a bundle of goods or services that is distinct.\nThe transaction price is allocated to all separate performance obligations within the contract based on their relative standalone selling prices (“SSP”). The best evidence for SSP is the price the Company would charge for that good or service when sold separately in similar circumstances to similar customers. If goods or services are not always sold separately, the Company would use the best estimate of SSP in the allocation of transaction price.\nThe transaction price reflects the amount of consideration to which the Company expects to be entitled in exchange for transferring goods or services, which may include an estimate of variable consideration to the extent that it is probable of not being subject to significant reversals in the future based on the Company’s experience with similar arrangements. The transaction price also reflects the impact of the time value of money if there is a significant financing component present in an arrangement. The transaction price excludes amounts collected on behalf of third parties, such as sales taxes.\nRevenue is recognized when the Company satisfies each performance obligation identified within the contract by transferring control of the promised goods or services to the customer. Goods or services can transfer at a point in time or over time depending on the nature of the arrangement.\nDeferred revenue represents the Company’s obligation to transfer goods or services to a customer for which the Company has received consideration from the customer. Our payment terms do not vary by the type of products or services offered. The term between invoicing and when payment is due is not significant. During the year ended December 31, 2019, the Company recognized $413 of revenue that was included in deferred revenue at the beginning of the period.\nContract assets exist when the Company has satisfied a performance obligation but does not have an unconditional right to consideration (e.g., because the entity first must satisfy another performance obligation in the contract before it is entitled to invoice the customer).\nThe Company transfers all of its goods and services electronically with the associated costs recorded in cost of sales in the Company’s Condensed Consolidated Statements of Operations.\nSoftware. Revenue from the sale of software products is recognized when the control is transferred. For most of the Company’s software product sales, the control is transferred at the time the product is electronically transferred because the customer has significant risks and rewards of ownership of the asset and the Company has a present right to payment at that time.\nStatement of Work (SOW). Revenue from SOW (engineering services) is recognized upon completion, transfer and satisfaction of the performance obligations identified with in the contract by the customer.\nTransactional revenue. For transactional type contracts, the Company’s performance obligations are met upon transfer of the software master to the customer. Revenue from transactional customers is recognized as the customer reports the number of units (signatures) rendered over the specified reporting period, generally three months.\nRecurring Product revenue. The company has revenue contracts that allow the customer to utilize the Company’s signature software on an annual basis. Maintenance and support costs are included in the annual price to the customer. The customer has the right to renew or cancel the contract on an annual basis. Recurring revenue is recognized on a straight line basis over the contract period, generally one year.\nMaintenance and support. Maintenance and support services are satisfied ratably over time as the customer simultaneously receives and consumes the benefits of the services. As a result, support and maintenance revenue is recognized on a straight line basis over the period of the contract.\nArrangements with Multiple Performance Obligations. The Company has, from time to time, revenue arrangements that include multiple performance obligations. The Company allocates transaction price to all separate performance obligations based on their relative standalone selling prices (“SSP”). The Company’s best evidence for SSP is the price the Company would charge for that good or service when the Company sells it separately in similar circumstances to similar customers. If goods or services are not always sold separately, the Company uses the best estimate of SSP in the allocation of transaction price. The Company’s process for determining best estimate of SSP involves management’s judgment, and considers multiple factors including, but not limited to, major product groupings, gross margin objectives and pricing practices. Pricing practices may vary over time, depending upon the unique facts and circumstances related to each deliverable. If the facts and circumstances underlying the factors considered change or should future facts and circumstances lead the Company to consider additional factors, the Company’s best estimate of SSP may also change.\nContract costs. The incremental costs of obtaining a contract are capitalized if the costs are expected to be recovered. Costs that are recognized as assets are amortized straight-line over the period as the related goods or services transfer to the customer. Costs incurred to fulfill a contract are capitalized if they are not covered by other relevant guidance, relate directly to a contract, will be used to satisfy future performance obligations, and are expected to be recovered.\nSignificant Judgments. The Company may exercise significant judgment when determining whether products and services are considered distinct performance obligations that should be accounted for separately versus together.\nPractical Expedients and Exemptions. Under Topic 606, incremental costs of obtaining a contract, such as sales commissions, are capitalized if they are expected to be recovered. Expensing these costs as they are incurred is not permitted unless they qualify for the practical expedient. The Company elected the practical expedient to expense the costs to obtain a contract as incurred when the expected amortization period is one year or less.\nThe Company elected the practical expedient under Topic 606 to not disclose the transaction price allocated to remaining performance obligations, since the majority of the Company’s arrangements have original expected durations of one year or less, or the invoicing corresponds to the value of the Company’s performance completed to date.\nThe Company elected the practical expedient that allows the Company to not assess a contract for a significant financing component if the period between the customer’s payment and the transfer of the goods or services is one year or less.\nAllowance for Doubtful Accounts: The allowance for doubtful accounts is based on the Company’s assessment of the collectability of specific customer accounts and an assessment of international, political and economic risk as well as the aging of the accounts receivable. If there is a change in actual defaults from the Company’s historical experience, the Company’s estimates of recoverability of amounts due could be affected and the Company would adjust the allowance accordingly.\nLong-lived assets: The Company evaluates the recoverability of its long-lived assets, including intangible assets at least annually or whenever circumstances or events indicate such assets might be impaired. The Company would recognize an impairment charge in the event the net book value of such assets exceeded the future undiscounted cash flows attributable to such assets. Estimation of future cash flows from the products considers the following additional factors:\n● legal, regulatory or contractual provisions known to the Company that limit the useful life of any product technology to less than the assigned useful life;\n● whether the Company needs to incur material costs or make modifications in order for it to continue to be able to realize the benefits afforded by the product technologies;\n● effects of obsolescence or significant competitive pressure on the Company’s current or future products are expected to reduce the anticipated cash flow from the products;\n● demand for products utilizing the technology will diminish, remain stable or increase; and\n● whether the current markets for the products based on the technology will remain constant or will change over the useful lives assigned to the technologies.\nCustomer Base: To date, the Company’s electronic signature revenue has been derived primarily from financial service industry end-users and from resellers and channel partners serving the financial service industry primarily in North America, the ASEAN Region and Europe. The Company performs periodic credit evaluations of its customers and does not require collateral. The Company maintains reserves for potential credit losses. Historically, such losses have been within the range of management’s expectations.\nCost of sales: Cost of sales includes direct engineering labor and overhead for specific revenue based projects initiated by customers and maintenance projects specific to customer needs, along with third party services related to the Company’s transactional based revenues.\nResearch and Development Costs: Research and development costs are charged as expense as incurred.\nNet Operating Loss Carry-forwards: Utilization of the Company’s net operating losses may be subject to an annual limitation due to the ownership change limitations under Section 382 of the Internal Revenue Code and similar state provisions. As a result, a portion of the Company’s net operating loss carry-forwards may not be available to offset future taxable income. The Company has provided a full valuation allowance for deferred tax assets at December 31, 2020 of approximately $65,121 based upon the Company’s history of losses.\nSegments: The Company reports its financial results in one segment.\nRevision to Financial Statements for the Year Ended December 31, 2019\nThe Company is revising its financial statements for the year ended December 31, 2019 to revise the reporting for certain warrants issued by the Company on February 6, 2019 to four consultants and one employee to purchase 985 shares of common stock and other miscellaneous reclassifications.\nResults of Operations - Years Ended December 31, 2020 and December 31, 2019\nRevenue\nFor the year ended December 31, 2020, total revenue was $966, an increase of $122, or 14%, compared to total revenue of $844 in the prior year. For the year ended December 31, 2020, software product revenue was $247, an increase of $52, or 27%, compared to product revenue of $195 in the prior year. Maintenance revenue for the year ended December 31, 2020, was $719, an increase of $70, or 11%, compared to maintenance revenue of $649 in the prior year. The increase in product revenue is primarily attributable to the increase in engineering service revenue. The increase in maintenance revenue is primarily attributable to existing customers renewing maintenance contracts at higher price points.\nCost of Sales\nFor the year ended December 31, 2020, cost of sales was $146, an increase of $25, or 21%, compared to cost of sales of $121 in the prior year. The increase was primarily due to an increase in direct engineering costs associated with the mix of engineering service and software product revenue during the year ended December 31, 2020 compared to the prior year.\nOperating Expenses\nResearch and Development Expenses\nFor the year ended December 31, 2020, research and development expenses were $578, a decrease of $52, or 8%, compared to research and development expenses of $630 in the prior year. Research and development expenses consist primarily of salaries and related costs, outside contract engineering, maintenance items, and allocated facility expenses. The most significant factors contributing to the decrease in research and development expenses was a decrease in stock option expense, a reduction in outside engineering expense and the reduction in allocated facilities expenses. These reductions were enhanced by an increase in direct labor transfers to cost of sales due to the increase in engineering service revenue. For the year ended December 31, 2020, total research and development expenses before IT and cost of sales allocations were $723, a decrease of $27, or 4%, compared to $750 of total research and development expenses before allocations in the prior year.\nSales and Marketing Expenses\nFor the year ended December 31, 2020, sales and marketing expenses were $83, a decrease of $26, or 24%, compared to sales and marketing expenses of $109 in the prior year. The decrease was primarily attributable to an increase in sales to non-commissionable accounts.\nGeneral and Administrative Expenses\nFor the year ended December 31, 2020, administrative expenses were $812, an increase of $45, or 6%, compared to administrative expenses of $767 in the prior year. The increase was due to an increase in warrant expense of $108 issued in connection to deferred compensation, offset by a decrease of $57 in stock option compensation. All other overhead expenses increased $6.\nOther Income (Expense), Net\nOther income (expense), net, for the year ended December 31, 2020, was $435, an increase of $433, or 21650%, compared to income of $2 in the prior year. The increase in other income and expense is due primarily to the forgiveness of $435 of accounts payable during the twelve months ended December 31, 2020. Such forgiveness was generated in conjunction with cash payments of approximately $286.\nInterest Expense\nFor the year ended December 31, 2020, related party interest expense was $104, an increase of $30, or 41%, compared to related party interest expense of $74 in the prior year. For the year ended December 31, 2020, other interest expense was $202, an increase of $8, or 4%, compared to other interest expense of $194 in the prior year. The increase in interest expense is primarily due to the increase in borrowings during the year ended December 31, 2020.\nFor the year ended December 31, 2020, the Company recorded $3 in debt discount amortization associated with its short-term borrowings, $1 of which is attributable to related parties and $2 of which is attributable to other investors, compared to $36 in the prior year, $10 of which is attributable to related parties and $26 of which is attributable to other investors. The decrease in debt discount amortization was primarily due to the extension of the due date of the notes from December 31, 2019 to December 31, 2020. As of December 31, 2020 the entire amount of debt discount has been fully written off.\nThe due date of the notes was extended again in November 2020 to December 31, 2021.\nLiquidity and Capital Resources\nCash and cash equivalents totaled $26 at December 31, 2020, compared to $25 at December 31, 2019.\nThe cash used in operations was primarily attributable to the net loss of $528. This amount was partially offset by non-cash depreciation and amortization of $6, amortization of warrants associated with long-term liabilities of $160, the issuance of warrants valued at $16 for services and stock-based compensation of $103.\nCash out flows for the acquisition of property and equipment for the year ended December 31, 2020 was $0.\nAccounts receivable were $100 at December 31, 2020, an increase of $39, or 64%, compared to accounts receivable of $61 at December 31, 2019. The increase in accounts receivable is primarily attributable to an increase in orders billed in the fourth quarter ended December 31, 2020 compared to the prior year.\nPrepaid expenses and other current assets were $10 at December 31, 2020, a decrease of $12, or 55%, compared to prepaid expenses and other current assets of $22 at December 31, 2019. The decrease is primarily due to the transfer to cost of sales of prepaid engineering expense associated with current year revenue.\nShort-term debt was $2,995 at December 31, 2020, an increase of $749, or 33%, compared to $2,246 in the prior year. See financing transactions below. Short term debt includes principal amount on notes for $2,649, accounts receivable advances of $183, a PPP loan of $123 and a vendor note of $40.The Company negotiated an extension of the due date of the notes to December 31, 2021\nAccounts payable were $353 at December 31, 2020, a decrease of $843, or 70%, compared to $1,196 at December 31, 2019. The decrease is due primarily to the forgiveness of $435 of accounts payable, related cash payments of approximately $286 and the issuance of a note payable of $130. These payments and other reductions were offset by the addition of $8 in new accounts payable.\nAccrued compensation was $82 at December 31, 2020, an increase of $11 or 15%, compared to $71 at December 31, 2019. The increase was due primarily to the accrual of commissions and an increase in accrued vacation. Deferred compensation of $219 was reclassified from other long-term liabilities at December 31, 2020 and represents amounts owed to former employees.\nOther accrued liabilities including the long term portion were $1,879 at December 31, 2020, compared to $1,630 at December 31, 2019, an increase of $249, or 15%. The increase is primarily attributable to the accrual of certain franchise taxes and professional service fees.\nDeferred revenue was $215 at December 31, 2020, a decrease of $201, or 48%, compared to deferred revenue, including the long-term portion, of $416 at December 31, 2019. The decrease is primarily due to the shift of one customer to a time and material basis rather than a prepayment bases and an increase in the amount of uncollected maintenance billed in the fourth quarter of 2019. The Company records deferred maintenance when the billing is collected.\nFinancing Transactions\nAdvances:\nDuring the current year the Company received advances against certain accounts receivable of $183, net of a partial repayment of $20 in December 2020 upon collection of the receivable in November of 2020.\nDebt:\nIn May of 2020 the Company applied for and received a PPP loan of $123. The Company used the proceeds for purposes consistent with the PPP. While the Company currently believes that its use of the loan proceeds meets the conditions for forgiveness of the loan, we cannot assure you that we did not take actions that caused the Company to be ineligible for forgiveness of the loan, in whole or in part.\nOn March 25, 2020, the Company issued an aggregate of $150 in unsecured notes to affiliates and other investors. The Company received $75 in cash and $75 in exchange for accounts receivable advances. The unsecured notes are convertible by the holder into common stock at any time at a price per share of $0.50. Upon closing a new financing of at least $1,000 in aggregate proceeds, the Company can force conversion at a price equal to the lesser of $0.50 per share or the price per share of the new financing. The notes bear interest at the rate of 10% per annum and are due December 31, 2021.\nOn June 19, 2020, the Company issued an additional unsecured note for $250,000. The note has the same terms and maturity date as the Company’s other unsecured notes.\nOn July 1, 2020 the Company entered into a settlement agreement with one of its vendors whereby the Company paid $135 in cash and issued a promissory note in the amount of $130 in settlement of approximately $537 in outstanding accounts payable. The note bears interest at the rate of 4% per annum and is due in installments of $40, $45 and $45 on or before the anniversary date of the note over the next three years. The settlement agreement discussed above resulted in gain of $272 recorded as other income in the statement of operations.\nThe Company recorded $3 in debt discount amortization for the twelve months ended December 31, 2020 related to prior year debt financings, $1 was to related parties and $2 was to other investors.\nContractual Obligations\nThe Company had no material commitments as of December 31, 2020.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nInterest Rate Risk. Any investments in fixed income securities are subject to interest rate risk and will fall in value if the market interest rates increase. The Company attempts to limit this exposure by investing primarily in short-term securities.\nForeign Currency Risk. The Company operates a joint venture in China and from time-to-time could make certain capital equipment or other purchases denominated in foreign currencies. As a result, the Company’s cash flows and earnings could be exposed to fluctuations in interest rates and foreign currency exchange rates. The Company would attempt to limit any such exposure through operational strategies and generally has not hedged currency exposure.\nFuture Results and Stock Price Risk. The Company’s stock price may be subject to significant volatility. The public stock markets have experienced significant volatility in stock prices in recent years. The stock prices of technology companies have experienced particularly high volatility, including, at times, severe price changes that are unrelated or disproportionate to the operating performance of such companies. The trading price of the Company’s Common Stock could be subject to wide fluctuations in response to, among other factors, quarter-to-quarter variations in operating results, announcements of technological innovations or new products by the Company or its competitors, competitor consolidation in the industry, announcements of new strategic relationships by the Company or its competitors, general conditions in the computer software industry or the global economy generally, or market volatility unrelated to the Company’s business and operating results. The impact and severity of the above factors could be exacerbated by the Company’s small size, public float and a lack of market liquidity for its Common Stock.\nRisks and Uncertainties. In December 2019, an outbreak of a novel strain of coronavirus (COVID-19) originated in Wuhan, China and has since spread to a number of other countries, including the U.S. On March 11, 2020, the World Health Organization characterized COVID-19 as a pandemic. In addition, several states in the U.S., including California, where the Company is headquartered, have declared a state of emergency. The COVID-19 outbreak is disrupting supply chains and affecting production and sales across a wide range of industries. The extent of the impact of COVID-19 on our operational and financial performance will depend on certain developments, including the duration and spread of the outbreak, impact on our customers, employees and vendors all of which are uncertain and cannot be predicted. At this point, the extent to which COVID-19 may impact our financial condition or results of operations is uncertain.",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nThe Company’s audited consolidated financial statements for the years ended December 31, 2020 and 2019, and for each of the years in the two-year period ended December 31, 2020, begin on page of this Annual Report on Form 10-K, and are incorporated into this item by reference.",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosures\nNone",
    "item_9A": "Item 9A. Controls and Procedures\nDisclosure Controls and Procedures\nThe Company carried out an evaluation as of the end of the period covered by this report, under the supervision and with the participation of our management, including our Chief Executive Officer and our Chief Financial Officer, of the effectiveness of our disclosure controls and procedures pursuant to paragraph (b) of Rule 13a-15 and 15d-15 under the Exchange Act of 1934 (the “Exchange Act”). Based on that evaluation the Chief Executive Officer and the Chief Financial Officer have concluded that as of the end of the period covered by this report, our disclosure controls and procedures were effective to ensure that the information required to be disclosed in reports we file or submit under the Exchange Act (1) is recorded, processed, summarized, and reported within the time periods specified in the SEC’s rules and forms, and (2) is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosures.\nThe Company does not expect that its disclosure controls and procedures will prevent all error and all fraud. A control procedure, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control procedures are met. Because of the inherent limitations in all control procedures, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within the Company have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty, and that breakdowns can occur because of simple error or mistake. Additionally, controls can be circumvented by the individual acts of some persons, by collusion of two or more people, or by management override of the control. The Company considered these limitations during the development of its disclosure controls and procedures, and will continually reevaluate them to ensure they provide reasonable assurance that such controls and procedures are effective.\nInternal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting. Our internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect transactions and dispositions of assets; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. generally accepted accounting principles, and that receipts and expenditures are being made only in accordance with authorizations of our management and directors; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on our financial statements. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements.\nManagement has assessed the effectiveness of the Company’s internal control over financial reporting based on the criteria established in “Internal Control, Integrated Framework” issued by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”) in 2013. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the Company’s annual or interim financial statements will not be prevented or detected on a timely basis.\nIn performing this assessment, management identified the following material weaknesses:\nAs a small company with limited resources that are mainly focused on the development and sales of software products and services, iSign does not employ a sufficient number of staff in its finance department to possess an optimal segregation of duties or to provide optimal levels of oversight. This has resulted in certain audit adjustments and management believes that there may be a possibility for a material misstatement to occur in future periods while it employs the current number of personnel in its finance department.\nBased on its assessment, our management concluded that, as of December 31, 2020, our internal control over financial reporting was not effective. Management believes that the identified weaknesses have not affected our ability to present GAAP-compliant financial statements in this Form 10-K. During the year-end financial statement close the Company was able to adjust its financial records to properly present its financial statements and we were therefore able to present GAAP-compliant financial statements. Management does not believe that its weakness with respect to its procedures and controls have had a pervasive effect upon our financial reporting due to our ability to make the necessary reconciling adjustments to our financial statements.\nManagement’s Remediation Initiatives\nManagement conducts a number of activities to address the material weaknesses noted above, including but not limited to the following:\n● Key managers and accounting personnel work closely with our independent audit firm in evaluating our progress in remediating our material weaknesses with oversight by the audit committee;\n● Evaluate control procedures on an ongoing basis, and, where possible, modify those control procedures to improve oversight;\n● Evaluate, and, where possible, employ additional third party resources that can provide oversight support within the Company’s budget constraints; and\n● As the Company grows its business and the cash flow necessary to hire additional accounting personnel, management expects to pursue and implement such additional hires.\nElements of our remediation plan can only be accomplished over time and we can offer no assurances that those initiatives will ultimately have the intended effects. Ultimately, revenue growth and performance improvements are the most likely avenue to greater resources that will improve the Company’s internal controls.\nManagement will continue the process of reviewing existing controls, procedures and responsibilities to more closely identify financial reporting risks and the required controls to address them. Key control and compensating control procedures will be developed to ensure that material weaknesses are properly addressed and related financial reporting risks are mitigated. Periodic control validation and testing will also be implemented to ensure that controls continue to operate consistently and as designed.\nChanges in Internal Control over Financial Reporting\nThere have not been any changes in the Company’s internal control over financial reporting (as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) during the quarter ended December 31, 2020 that materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.",
    "item_9B": "Item 9B. Other Information\nNone.\nPART III",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nDirectors and Executive Officers\nThe following table sets forth certain information concerning the Company’s directors and executive officers:\nName\nAge\nPositions with the Company\nPhilip S. Sassower\nCo-Chairman and Chief Executive Officer\nMichael Engmann\nCo-Chairman and Chief Operating Officer\nAndrea Goren\nDirector and Chief Financial Officer\nFrancis J. Elenio\nDirector\nStanley Gilbert\nDirector\nJeffrey Holtmeier\nDirector\nDavid E. Welch\nDirector\nThe business experience of each of the directors and executive officers for at least the past five years includes the following:\nPhilip S. Sassower has served as the Company’s Chairman and Chief Executive Officer since August 2010, and Co-Chairman since October 2015. Mr. Sassower is a Managing Director of SG Phoenix LLC, a private equity firm, and has served in that capacity since May 2003. Mr. Sassower has also been Chief Executive Officer of Phoenix Enterprises LLC, a private equity firm, and has served in that capacity since 1996. In addition, and until his retirement in October 2017, Mr. Sassower served as Chief Executive Officer of Xplore Technologies Corp. (NASDAQ:XPLR) from February 2006 and as a director of Xplore Technologies Corp. and served as Chairman of its board of directors since December 2004. Mr. Sassower also served as Chairman of the Board of The Fairchild Corporation (NYSE: FA), a motorcycle accessories and aerospace parts and services company. Mr. Sassower also served as Chairman of the Board of the Company from 1998 to 2002 and as Co-Chief Executive Officer of the Company from 1997 to 1998. Mr. Sassower is co-manager of the managing member of Phoenix Venture Fund LLC. Mr. Sassower’s qualifications to serve on the Board of Directors include more than 40 years of business and investment experience. Mr. Sassower has developed extensive experience working with management teams and boards of directors, and in acquiring, investing in and building companies and implementing changes.\nMichael Engmann has served as the Company’s Co-Chairman since October 2015, and as the Company’s Chief Operating Officer since May 2017. Mr. Engmann is Chairman of Engmann Options, a family trading and investment holding company and has served in that capacity since 1978. Mr. Engmann has approximately 40 years of experience in building successful financial service companies. He began his career as a trader and was one of the early market-makers in the Pacific Stock Exchange’s options program. He (i) founded, in 1980, Sage Clearing Corporation, a stock and options clearing company for professional traders, which was sold to ABN Amro Inc. in 1988, (ii) founded, in 1982, Preferred Trade, Inc., a broker-dealer providing research and trade execution services, which was sold to Fimat in May 2005, and (iii) acquired in 2001 Revere Data LLC, a global financial and market data company, which was sold to Factset in 2013. Mr. Engmann’s qualifications to serve on the Board of Directors include more than 40 years of business and investment experience.\nAndrea Goren has served as a director since August 2010. Mr. Goren was appointed the Company’s Chief Financial Officer in December 2010. Mr. Goren is a Managing Director of SG Phoenix LLC, a private equity firm, and has served in that capacity since May 2003. Mr. Goren is co-manager of the managing member of Phoenix Venture Fund LLC, the Company’s largest shareholder. Prior to that, Mr. Goren served as Vice President of Shamrock International, Ltd., a private equity firm. Mr. Goren served on the board of directors of Xplore Technologies Corp. (NASDAQ:XPLR) from December 2004 to July 2018, and of The Fairchild Corporation (NYSE: FA) from May 2008 to January 2010. Mr. Goren’s qualifications to serve on the Board of Directors include his experience and knowledge acquired in more than 20 years of private equity investing and his extensive experience working with management teams and boards of directors.\nFrancis J. Elenio has served as a director since November 2015, after having served as a director of the Company from August 2010 to October 2011. Since November 2005, Mr. Elenio has served as Managing Director of Reeff Consulting LLC, a financial and business advisory firm providing outsourced accounting and consulting services for start-up to midsized companies. Mr. Elenio also served as Chief Financial Officer of Signal Point Communications Corp. from February 2011 to October 2013. Mr. Elenio has over 25 years of experience working with corporations as a strategic, solution-driven professional focused on finance and accounting, operations and turn-around management. Mr. Elenio has served at the CFO level at numerous public and private companies, including Wilshire Enterprises, Inc., a real estate investment and management company, WebCollage, Inc., an internet content integrator for manufacturers, GoAmerica, Inc., a wireless internet service provider and Roomlinx, Inc., a provider of wireless high speed internet access to hotels and conference centers. Mr. Elenio is a CPA and received an MBA. Since September 2007, Mr. Elenio has also been an Adjunct Professor of Finance at Seton Hall University. Mr. Elenio serves on the Company’s audit committee. Mr. Elenio’s qualifications to serve on the Board of Directors and Audit Committee include his experience as a CFO working with technology companies like iSign.\nStanley L. Gilbert has served as a director since October 2011. Mr. Gilbert has more than 45 years of experience as a lawyer with primary specialties in wills, trusts, estate planning and administration, as well as tax planning. Mr. Gilbert is Founder, and, has been President of Stanley L. Gilbert PC since 1982. Mr. Gilbert has also been a partner of a number of law firms, including Nager Korobow, Bell Kallnick Klee and Green, and Migdal Pollack Rosenkrantz and Sherman. Mr. Gilbert has served as a Director of Planned Giving at Columbia University Medical Center’s Nathaniel Wharton Fund, which supports a broad variety of projects in basic research, clinical care and teaching since 2001. Mr. Gilbert was elected by a majority of iSign’s Series B Preferred Stock and Series C Preferred stockholders voting together as a separate class on an as converted to Common Stock basis, and serves on iSign’s audit and compensation committees. Mr. Gilbert’s qualifications to serve on the Board of Directors include his significant tax and accounting expertise acquired through his years of practicing law.\nJeffrey Holtmeier has served as a director since August 2011. Mr. Holtmeier has more than 25 years of successful entrepreneurship in the technology and communications fields. As CEO of GENext from 2001 to present, and through its subsidiary China US Business Development, LLC, Mr. Holtmeier has assisted many US companies in establishing relationships in China, where he also co-founded Koncept International, Inc., a Chinese-based VoIP and digital media technology company. Prior to his involvement in the Chinese market, Mr. Holtmeier founded, built over seventeen years and successfully sold InfiNET in 2001 to Teligent, a NASDAQ listed company. Mr. Holtmeier was a recipient of the prestigious Ernst & Young, NASDAQ/USA Today “Entrepreneur of the Year” award in 1999, and has served on the boards of numerous corporations and non-profit organizations. He serves on iSign’s audit and compensation committees. Mr. Holtmeier’s qualifications to serve on the Board of Directors include his experience as a successful entrepreneur and his experience in establishing business relationships in China.\nDavid E. Welch has served as a director since March 2004. From July 2002 to present Mr. Welch has been the principal of David E. Welch Consulting, a financial consulting firm. Mr. Welch has also been Vice President of Operations at Vertex Innovations, Inc., from June 2015 to April 2017. Mr. Welch was Vice President and Chief Financial Officer of American Millennium Corporation, Inc., a provider of satellite-based asset tracking and reporting equipment, from April 2004 to September 2014. Mr. Welch was Vice President and Chief Financial Officer of Active Link Communications, a manufacturer of telecommunications equipment, from 1999 to 2002. Mr. Welch has held positions as Director of Management Information Systems and Chief Information Officer with Micromedex, Inc. and Language Management International from 1995 through 1998. Mr. Welch other directorships have been with AspenBio Pharma, Inc., from 2004 to 2017, PepperBall Technologies, Inc. from January 2007 to January 2009 and Advanced Nutraceuticals, Inc., from 2003 to 2006. Mr. Welch is a Certified Public Accountant licensed in the state of Colorado. He serves on iSign’s audit and compensation committees. Mr. Welch’s qualifications to serve on the Board of Directors include his significant accounting and financial expertise.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Exchange Act requires the Company’s officers, directors and persons who own more than ten percent of a registered class of the Company’s equity securities to file certain reports with the SEC regarding ownership of, and transactions in, the Company’s securities. These officers, directors and stockholders are also required by SEC rules to furnish the Company with copies of all Section 16(a) reports that are filed with the SEC. The following individuals Section 16 filings of Form 4’s dated August 11, 2020 were not timely filed for the year ended December 31, 2020: Messrs. Elenio, Engmann, Gilbert, Goren, Holtmeier, Sassower and Welch.\nCode of Business Conduct and Ethics\nWe have adopted a written code of business conduct and ethics, referred to as our Code of Business Conduct and Ethics, which applies to all of our directors, officers, and employees, including our principal executive officer, our principal financial and accounting officer, and our Chief Technology officer. A copy of the Code of Business Conduct and Ethics is posted on the Company’s web site, at www.isignnow.com.\nAudit Committee Financial Expert\nMr. Welch serves as the Audit Committee’s financial expert. Each member of the Audit Committee is independent as defined under the applicable rules and regulations of the SEC and the director independence standards of the NASDAQ Stock Market, as currently in effect.",
    "item_11": "Item 11. Executive Compensation\nSummary Compensation Table (in dollars)\nName and\nPrincipal\nPosition Year\nSalary\n($) Bonus\n($)\nStock\nAwards\n($)\nOption\nAwards\n($) (4)\nNon-Equity\nIncentive Plan\nCompensation\n($)\nChange in\nPension Value\nAnd\nNonqualified\nDeferred Compensation\nEarnings\n($)\nAll Other\nCompensation\n($)\nTotal\n($)\nPhilip S Sassower,\n- (1) -\n-\n$ 25,926\n-\n-\n-\nCo-Chairman and CEO\n- (1) -\n-\n-\n-\n-\n-\n-\nMichael Engmann,\n- (2) -\n-\n$ 25,926\n-\n-\n-\n$ 25,926\nPresident and COO\n- (2) -\n-\n-\n-\n-\n-\n-\nAndrea Goren,\n- (3) -\n-\n$ 25,926\n-\n-\n-\n$ 25,926\nCFO\n- (3) -\n-\n-\n-\n-\n-\n-\n1. Mr. Sassower was appointed Chairman of the Board and Chief Executive Officer on August 5, 2010, and Co-Chairman since October 2015. Mr. Sassower receives no compensation.\n2. Mr. Engmann was appointed President and Chief Operating Officer on May 15, 2017. Mr. Engmann receives no salary compensation from the Company.\n3. Mr. Goren was appointed Chief Financial Officer on December 7, 2010. Mr. Goren receives no compensation from the Company.\n4. The amounts, if any, provided in this column represent the aggregate grant date fair value of option awards granted to our officers, as calculated in accordance with FASB ASC Topic 718, Stock Compensation. In accordance with applicable regulations, the value of such options does not reflect an estimate for features related to service-based vesting used by the Company for financial statement purposes.\nMr. Engmann is retained by the Company without an agreement. Mr. Engmann’s service as Co-Chairman and Chief Operating Officer is month to month. Mr. Engmann is currently entitled to receive a cash sum payment of $5,000 per month. The Company has agreed to pay Mr. Engmann for reasonable and documented out of pocket expenses incurred for Services rendered by him, as long as he obtains written approval of the Company prior to incurring any significant expense.\nMr. Goren is retained by the Company through an Advisory Services Agreement (the “SGP Agreement”) with SG Phoenix LLC (“SGP”). Mr. Goren and Mr. Sassower are managing members of SGP. The initial term of the SGP Agreement was two years and it automatically renews for additional one year periods upon the same terms and conditions unless either party notifies the other in writing of its intent to terminate at least 90 days prior to the then-current term. SGP currently is entitled to receive a cash sum payment of $7,500 (“SGP Fee”) per month. In addition, SGP is eligible for, but not entitled to receive, an annual cash performance fee of up to thirty-five percent (35%) of the SGP Fee during a given year or prorated portion thereof. Such performance fee, if any, would be awarded based upon the sole discretion of the Company’s Board of Directors. No performance fee was paid to SGP in 2020. Under the SGP Agreement, SGP furnishes, at its own expense, all materials and equipment necessary to carry out the terms of the SGP Agreement. The Company has agreed to pay SGP for reasonable and documented out of pocket expenses incurred for services rendered by SGP during the term of the SGP Agreement, as long as SGP obtains written approval of the Company prior to incurring any significant expense.\nOutstanding Equity Awards at December 31, 2020\nThe following table summarizes the outstanding equity award holdings held by our named executive officers. The amounts are not stated in thousands.\nName and Principal Position Number of\nSecurities\nUnderlying\nUnexercised\nOptions\n(#)\nExercisable Number of\nSecurities\nUnderlying\nUnexercised\nOptions\n(#)\nUnexercisable Option\nExercise\nPrice ($) Option\nExpiration\nDate\nPhilip S. Sassower, Co-Chairman and CEO 81,010 (1) 26,990 $ 0.78 8/9/2025\n5,022 (2) 54,978 $ 0.50 8/10/2027\nMichael Engmann, President and COO 73,509 (3) 24,491 $ 0.78 8/9/2025\n5,022 (4) 57,144 $ 0.50 8/10/2027\nAndrea Goren, Chief Financial Officer 94,512 (5) 31,488 $ 0.78 8/9/2025\n5,022 (6) 54,978 $ 0.50 8/10/2027\n1. Mr. Sassower’s 108,000 options were issued on August 9, 2018. The options have a seven year life and vest quarterly over three years.\n2. Mr. Sassower’s 60,000 options were issued on August 11, 2020. The options have a seven year life and vest quarterly over three years.\n3. Mr. Engmann’s 98,000 options were issued on August 9, 2018. The options have a seven year life and vest quarterly over three years.\n4. Mr. Engmann’s 60,000 options were issued on August 11, 2020. The options have a seven year life and vest quarterly over three years.\n5. Mr. Goren’s 126,000 options were issued on August 9, 2018. The options have a seven year life and vest quarterly over three years.\n6. Mr. Goren’s 60,000 options were issued on August 11, 2020. The options have a seven year life and vest quarterly over three years.\nOption Exercises and Stock Vested\nThere were no stock options exercised during the twelve months ended December 31, 2020 and 2019.\nDirector Compensation\nThe following table provides information regarding the compensation of the Company’s non-employee directors for the year ended December 31, 2020:\nName Fees Earned or Paid in Cash Stock\nAwards\nOption Awards Non-Equity Incentive Plan Compensation Non-qualified Deferred Compensation Earnings All Other Compensation Total\nCurrent Directors\nFrancis J. Elenio $ - $ - $ 8,642 $ - $ - $ - $ 8,642\nStanley Gilbert $ - $ - $ 8,642 $ - $ - $ - $ 8,642\nJeffrey Holtmeier $ - $ - $ 8,642 $ - $ - $ - $ 8,642\nDavid Welch $ - $ - $ 8,642 $ - $ - $ - $ 8,642",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table sets forth information as of March 20, 2020, with respect to the beneficial ownership of (i) any person known to be the beneficial owner of more than 5% of any class of voting securities of the Company, (ii) each director and director nominee of the Company, (iii) each of the current executive officers of the Company named in the Summary Compensation Table under the heading “Executive Compensation” and (iv) all directors and executive officers of the Company as a group. Except as indicated in the footnotes to this table (i) each person has sole voting and investment power with respect to all shares attributable to such person and (ii) each person’s address is c/o iSign Solutions, Inc., 2033 Gateway Place, Suite 659, San Jose California 95110-1413. The amounts are not stated in thousands.\nCommon Stock\nName of Beneficial Owner Number of\nShares (1) Percent Of\nClass (1)\nPhilip S. Sassower (2) 2,153,452 31.6 %\nAndrea Goren (3) 2,197,749 32.1 %\nStanley Gilbert (4) 151,643 2.6 %\nJeffrey Holtmeier (5) 41,136 *\nDavid E. Welch (6) 38,208 *\nMichael W. Engmann (7) 1,015,513 16.3 %\nFrancis Elenio (8) 36,740 *\nAll directors and executive officers as a group (7 persons) (9) 3,635,216 47.9 %\n5% Shareholders\nPhoenix Venture Fund LLC (10) 1,999,225 29.8 %\n* Less than 1%.\n1. Shares of Common Stock beneficially owned and the respective percentages of beneficial ownership of Common Stock assumes the exercise or conversion of all options, warrants and other securities convertible into Common Stock, beneficially owned by such person or entity currently exercisable or exercisable within 60 days of March 20, 2021. Shares issuable pursuant to the exercise of stock options and warrants exercisable within 60 days of March 20, 2021 or securities convertible into Common Stock within 60 days of March 20, 2021 are deemed outstanding and held by the holder of such shares of Common Stock, options and warrants for purposes of computing the percentage of outstanding Common Stock beneficially owned by such person, but are not deemed outstanding for computing the percentage of outstanding Common Stock beneficially owned by any other person. The percentage of beneficial ownership of Common Stock beneficially owned is based on shares of Common Stock. The shares of Common Stock beneficially owned and the respective percentages of beneficial ownership of Common Stock stated in these columns assume conversion of all outstanding options and warrants into shares of Common Stock.\n2. Represents (a) 1,089,431 shares of Common Stock, (b) 114,021 shares of Common Stock issuable upon the exercise of options exercisable within 60 days of March 20, 2021, and (c) 950,000 shares of Common Stock issuable upon the exercise of warrants exercisable within 60 days of March 20, 2021 (see table below for details), including securities beneficially owned by Phoenix, SG Phoenix and Phoenix Enterprises Family Fund. Please see footnote 11 below for information concerning shares of Common Stock beneficially owned by Phoenix. Along with Mr. Goren, Mr. Sassower is the co-manager of SG Phoenix Ventures LLC, which has the shared power to vote and dispose of the shares of Common Stock held by Phoenix and, accordingly, Mr. Sassower may be deemed to be the beneficial owner of the shares owned by Phoenix Mr. Goren and Mr. Sassower each disclaim beneficial ownership of the shares owned by Phoenix, except to the extent of their respective pecuniary interests therein. Mr. Sassower’s address is 70 East 55th Street, 10th Floor, New York, NY 10022.\nPhilip\nSassower SG Phoenix\nLLC Phoenix\nVenture Fund Total\nCommon shares 40,206 2,234 1,046,991 1,089,431\nStock Options 114,021 - - 114,021\nWarrants - 950,000 - 950,000\nTotal 154,277 952,234 1,046,991 2,153,452\n3. Represents (a) 1,117,227 shares of Common Stock, (b) 130,522 shares of Common Stock issuable upon the exercise of options exercisable within 60 days of March 20, 2021, and (b) 950,000 shares of Common Stock issuable upon the exercise of warrants exercisable within 60 days of March 20, 2021 (see table below for details), including securities beneficially owned by Phoenix, SG Phoenix LLC, Andax LLC and Mr. Goren. Please see footnote 11 below for information concerning Phoenix’s beneficial ownership. Mr. Goren is managing member Andax LLC and disclaims beneficial ownership of the shares except to the extent of his pecuniary interest therein. Along with Mr. Sassower, Mr. Goren is the co-manager of SG Phoenix Ventures LLC, which has the power to vote and dispose of the shares held by Phoenix and accordingly, Mr. Goren may be deemed to be the beneficial owner of the shares owned by Phoenix. Mr. Goren and Mr. Sassower each disclaim beneficial ownership of the shares owned by Phoenix except to the extent of their respective pecuniary interests therein. Mr. Goren’s address is 70 East 55th Street, 10th Floor, New York, NY 10022.\nAndrea Goren Andax, LLC SG Phoenix\nLLC Phoenix\nVenture Fund Total\nCommon shares 38,177 29,825 2,234 1,046,991 1,117,227\nStock Options 130,522 - - - 130,522\nWarrants - - 950,000 - 950,000\nTotal 168,699 29,825 952,234 1,046,991 2,197,749\n4. Represents (a) 114,169 shares of Common Stock, and (b) 37,474 shares of Common Stock issuable upon the exercise of options exercisable within 60 days of March 20, 2021 (see table below for details). As manager of Galaxy LLC, Mr. Gilbert has the power to vote and dispose of the shares of Common Stock held by Galaxy LLC, and, accordingly, Mr. Gilbert may be deemed to be the beneficial owner of the shares owned by Galaxy LLC.\nStanley Gilbert Stanley Gilbert PC Galaxy LLC Mrs. Gilbert Total\nCommon shares 111,002 1,426 1,718 114,169\nStock options 37,474 - - - 37,474\nTotal 148,476 1,426 1,718 151,643\n5. Represents (a) 3,662 shares of Common Stock and (b) 37,474 shares of Common Stock issuable upon the exercise of options exercisable within 60 days of March 20, 2021. As manager of Genext, Mr. Holtmeier has the power to vote and dispose of the shares of Common Stock held by Genext, and, accordingly, Mr. Holtmeier may be deemed to be the beneficial owner of the shares owned by CUBD and Genext.\n6. Represents 38,208 shares of Common Stock issuable upon the exercise of options exercisable within 60 days of March 20, 2021.\n7. Represents (a) 535,659 shares of Common Stock beneficially owned by Mr. Engmann, (b) 104,854 shares of Common Stock issuable upon the exercise of options exercisable within 60 days of March 20, 2021 and (c) an aggregate of 375,000 shares of Common Stock issuable upon exercise of warrants exercisable within 60 days of March 20, 2021 beneficially owned by Mr. Engmann. See the following table for more detail. Mr. Engmann’s address is 220 Bush Street, No. 660, San Francisco, CA 94104.\nMichael Engmann MDNH Partners, LP KENDU Partners Company Total\nCommon shares 430,749 103,915 535,659\nStock Options 104,854 - - 104,854\nWarrants 375,000\n- 375,000\nTotal 910,603 103,915 1,015,513\n8. Represents 36,740 shares of Common Stock issuable upon the exercise of options exercisable within 60 days of March 20, 2020.\n9. Includes (a) 1,810,923 shares of Common Stock beneficially owned, (b) 499,293 shares of Common Stock issuable upon the exercise of options exercisable within 60 days of March 20, 2021 and (c) an aggregate of 1,360,695 shares of Common Stock issuable upon exercise of warrants exercisable within 60 days of March 20, 2021. The aforementioned includes 1,046,991 shares of Common Stock and 985,695 shares of Common Stock issuable upon exercise of warrants exercisable within 60 days of March 20, 2021 beneficially owned by Phoenix. Please see footnote 10 below for information concerning shares of Common Stock beneficially owned by Phoenix. Mr. Sassower and Mr. Goren are the co-managers of SG Phoenix Ventures LLC, which has the shared power to vote and dispose of the shares of Common Stock held by Phoenix and, accordingly, Mr. Sassower and Mr. Goren may be deemed to be the beneficial owner of the shares owned by Phoenix. SG Phoenix Ventures LLC, Mr. Sassower and Mr. Goren each disclaim beneficial ownership of the shares owned by Phoenix, except to the extent of their respective pecuniary interests therein.\n10. SG Phoenix Ventures LLC is the Managing Member of Phoenix, with the power to vote and dispose of the shares of Common Stock held by Phoenix. Accordingly, SG Phoenix Ventures LLC may be deemed to be the beneficial owner of such shares. Andrea Goren is the co-manager of SG Phoenix Ventures LLC, has the shared power to vote and dispose of the shares of Common Stock held by Phoenix and, as such, may be deemed to be the beneficial owner of the common shares owned by Phoenix and by SG Phoenix LLC, of which he is a member. Philip Sassower is the co-manager of SG Phoenix Ventures LLC, has the shared power to vote and dispose of the shares of Common Stock held by Phoenix and, as such, may be deemed to be the beneficial owner of the common shares owned by Phoenix and by SG Phoenix LLC, of which he is a member. SG Phoenix Ventures LLC, Mr. Goren and Mr. Sassower each disclaim beneficial ownership of the shares owned by Phoenix, and Mr. Goren and Mr. Sassower each disclaim beneficial ownership of the shares owned by SG Phoenix LLC, except to the extent of their respective pecuniary interests therein. The address of these stockholders is 70 East 55th Street, 10th Floor, New York, NY 10022.\nPhoenix\nVenture\nFund LLC SG Phoenix\nLLC Total\nCommon shares 1,046,991 2,234 1,049,225\nWarrants - 985,695 950,000\nTotal 1,046,991 987,929 1,999,225\nEquity Compensation Plan Information\nThe following table provides information as of December 31, 2020, regarding our compensation plans (including individual compensation arrangements) under which equity securities are authorized for issuance:\nNumber of Securities To Be Issued Upon Exercise of Outstanding Options and Rights Weighted-Average Exercise Price Of Outstanding Options and Rights Number of Securities Remaining Available For Future Issuance Under Equity Compensation Plans\nEquity Compensation Plans Approved by Security Holders\n2011 Stock Compensation Plan (1) 1,337,936 $ 0.86 412,014\n(1) There are 1,000 shares held in the 2011 Stock Compensation Plan not approved by the Security holders",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nProcedures for Approval of Related Person Transactions\nIn accordance with our Code of Business Conduct and Ethics, we submit all proposed transactions involving our officers and directors and related parties, and other transactions involving conflicts of interest, to the Board of Directors or the Audit Committee for approval. Each of the related party transactions listed below that were submitted to our board were approved by a disinterested majority of our Board of Directors after full disclosure of the interest of the related party in the transaction.\nDirector Independence\nThe Board of Directors has determined that Messrs. Gilbert, Holtmeier, Elenio and Welch are “independent,” as defined under the rules of the NASDAQ Stock Market relating to director independence, and Messrs. Sassower, Engmann and Goren are not independent under such rules. Messrs. Welch, Gilbert, and Holtmeier serve on the Compensation Committee of the Board of Directors. Each of the members of the Compensation Committee is independent under the rules of the NASDAQ Stock Market relating to director independence. Messrs. Welch, Elenio and Holtmeier serve on the Audit Committee of the Board of Directors. Under the applicable rules of the NASDAQ Stock Market and the SEC relating to independence of Audit Committee members, the Board of Directors has determined that Messrs. Welch, Holtmeier and Elenio are independent.\nRelated Party Transactions\nPhoenix is the beneficial owner of approximately 18.2% of the Common Stock of the Company when calculated in accordance with Rule 13d-3.\nIn January and March 2020, the Company received, from affiliates, advances aggregating $100 in cash against certain accounts receivable of the Company. Upon collection of an invoice, the Company agreed to repay the advance to the lenders on a pro rata basis together with a 5% advance fee. On March 25, 2020, the affiliates converted their advances into unsecured notes. The Company paid the advance fees of $5 in cash, and recorded them as interest expense in the quarter ended March 31, 2020. The unsecured notes are convertible by the holder into common stock at any time at a price per share of $0.50. Upon closing a new financing of at least $1,000 in aggregate proceeds, the Company can force conversion at a price equal to the lesser of $0.50 per share or the price per share of the new financing. The notes bear interest at the rate of 10% per annum and are due December 31, 2021.\nIn August and September 2020, the Company received, from two affiliates, advances aggregating $83 in cash against certain accounts receivable of the Company. Upon collection of an invoice, the Company agreed to repay the advance to the lenders on a pro rata basis together with a 5% advance fee. The Company has accrued the advance fees of $4 which is included in interest expense in the quarter ended September 30, 2020.\nDuring the three months from October to December 2020, the Company received from affiliate’s advances aggregating $40 in cash against certain accounts receivable. The Company agreed to repay the advance to the lenders on a pro rata basis together with a 5% advance fee. The Company has accrued the advance fees of $2 which is included in interest expense in the quarter ended December 31, 2020. In addition the Company accrued as interest expense an additional 2.5%, or $2, advance fee on any advances that remained outstanding as of December 31, 2020.\nThe table below reflects the August 11, 2020 stock option grants to the named affiliates of the Company. The options have a seven year life and vest quarterly over three years.\nName Number of\nOptions Exercise\nPrice\nFrancis J. Elenio $ 0.50\nStanley Gilbert $ 0.50\nJeffrey Holtmeier $ 0.50\nDavid E. Welch $ 0.50\nDebt discount amortization associated with the Company’s indebtedness for the years ended December 31, 2020 and 2019, was $3 and $36, respectively, of which $1 and $10, respectively, was related party expense.\nInterest expense associated with the Company’s indebtedness for the years ended December 31, 2020 and 2019, was $306 and $268, respectively, of which $104 and $74, respectively, was related party expense.",
    "item_14": "Item 14. Principal Accounting Fees and Services\nAudit and other Fees. M&K, PLLC has been the Company’s auditors since June 2020. Armanino LLP was the Company’s auditors since from August 2014. During fiscal years 2020 and 2019, the fees for audit and other services performed by Armanino LLP and M&K PLLC for the Company were as follows:\nNature of Service M&K PLLC Armanino LLP\nAudit Fees $ 6,000.00 38 % $ 66,000.00 74 % $ 63,000.00 55 %\nAudit-Related Fees $ 10,000.00 62 % $ 9,000.00 10 % $ 27,000.00 24 %\nTax Fees $ - - % $ 8,655.00 10 % $ 18,440.00 16 %\nAll Other Fees $ - - % $ 5,241.24 6 % $ 5,811.65 5 %\nTotal $ 16,000.00 100 % $ 88,896.24 100 % $ 114,251.65 100 %\nPre-Approval Policies.\nIt is the policy of the Company not to enter into any agreement with its auditors to provide any non-audit services unless (a) the agreement is approved in advance by the Audit Committee or (b) (i) the aggregate amount of all such non-audit services constitutes no more than 5% of the total amount the Company pays to the auditors during the fiscal year in which such services are rendered, (ii) such services were not recognized by the Company as constituting non-audit services at the time of the engagement of the non-audit services and (iii) such services are promptly brought to the attention of the Audit Committee and prior to the completion of the audit are approved by the Audit Committee or by one or more members of the Audit Committee who are members of the board of directors to whom authority to grant such approvals has been delegated by the Audit Committee. The Audit Committee will not approve any agreement in advance for non-audit services unless (x) the procedures and policies are detailed in advance as to such services, (y) the Audit Committee is informed of such services prior to commencement and (z) such policies and procedures do not constitute delegation of the Audit Committee’s responsibilities to management under the Exchange Act.\nThe Audit Committee has considered whether the provision of non-audit services has impaired the independence of M&K PLLC and Armanino LLP and has concluded that both M&K PLLC and Armanino LLP were independent under applicable SEC and NASDAQ rules and regulations.\nPART IV",
    "item_15": "Item 15. Exhibits, Financial Statement Schedules.\n(a) The following documents are filed as part of this Annual Report on Form 10-K:\n(1) Financial Statements\nPage\n(a)(1) Financial Statements\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets at December 31, 2020 and 2019\nConsolidated Statements of Operations for the years ended December 31, 2020 and 2019\nConsolidated Statements of Comprehensive Loss for the years ended December 31, 2020 and 2019\nConsolidated Statements of Changes in Deficit for the years ended December 31, 2020 and 2019\nConsolidated Statements of Cash Flows for the years ended December 31, 2020 and 2019\nNotes to Consolidated Financial Statements\n(2) Financial Statement Schedules\nAll schedules are omitted because they are not applicable or the required information is shown in the financial statements or the notes thereto.\n(3) Exhibits\nThe exhibits required by Item 601 of Regulation S-K are listed in paragraph (b) below.\n(b) Exhibits.\nThe following exhibits are filed herewith or are incorporated by reference to exhibits previously filed with the SEC as indicated below:\nExhibit\nNumber\nDocument\n3.1\nCertificate of Incorporation of the Company, as amended, incorporated herein by reference to Exhibits 3.1, 3.2, 3.3 and 3.4 to the Company’s Registration Statement on Form 10 (File No. 000-19301).\n3.2\nCertificate of Amendment to the Company’s Certificate of Incorporation (authorizing the reclassification of the Class A Common Stock and Class B Common Stock into one class of Common Stock) filed with the Delaware Secretary of State on November 1, 1991, incorporated herein by reference to Exhibit 3 to Amendment 1 on Form 8 to the Company’s Form 8-A (File No. 000-19301).\n3.3\nCertificate of Amendment to the Company’s Amended and Restated Certificate of Incorporation filed with the Delaware Secretary of State June 12, 1998, incorporated herein by reference to Exhibit 10.24 to the Company’s 1998 Form 10-K filed on April 6, 1999.\nExhibit\nNumber\nDocument\n3.4\nBy-laws of the Company adopted on October 6, 1986, incorporated herein by reference to Exhibit 3.5 to the Company’s Registration Statement on Form 10 (File No. 000-19301).\n3.5\nCertificate of Amendment to the Company’s Amended and Restated Certificate of Incorporation filed with the Delaware Secretary of State January 24, 2001, incorporated herein by reference to Exhibit 3.5 to the Company’s Registration Statement on Form S/1 filed on December 28, 2007.\n3.6\nCertificate of Elimination of the Company’s Certificate of Designation of the Series A Preferred Stock filed with the Delaware Secretary of State August 17, 2001, incorporated herein by reference to Exhibit 3.6 to the Company’s Registration Statement on Form S/1 filed on December 28, 2007.\n3.7\nCertificate of Amendment to the Company’s Amended and Restated Certificate of Incorporation filed with the Delaware Secretary of State August 17, 2007, incorporated herein by reference to Exhibit 3.7 to the Company’s Registration Statement on Form S/1 filed on December 28, 2007.\n3.8\nAmended and Restated Certificate of Incorporation of the Company filed with the Delaware Secretary of State on May 18, 1995, incorporated herein by reference to Exhibit 3.2 to the Company’s Quarterly Report on Form 10-Q filed on August 14, 2008.\n3.9\nCertificate of Designations, Powers, Preferences and Rights of the Series A Cumulative Convertible Preferred Stock filed with the Delaware Secretary of State on June 4, 2008, incorporated herein by reference to Exhibit 4.23 to the Company’s Quarterly Report on Form 10-Q filed on August 14, 2008.\n3.10\nCertificate of Amendment to the Company’s Amended and Restated Certificate of Incorporation filed with the Delaware Secretary of State on June 30, 2008, incorporated herein by reference to Exhibit 3.7 to the Company’s Quarterly Report on Form 10-Q filed on August 14, 2008.\n3.11\nCertificate of Designations, Powers, Preferences and Rights of the Series A-1 Cumulative Convertible Preferred Stock filed with the Delaware Secretary of State on October 30, 2008, incorporated herein by reference to Exhibit 3.11 to the Company’s Annual Report on Form 10-K filed on March 12, 2009.\n3.12\nCertificate of Elimination of the Company’s Series A Cumulative Convertible Preferred Stock filed with the Delaware Secretary of State on December 30, 2008, incorporated herein by reference to Exhibit 3.12 to the Company’s Annual Report on Form 10-K filed on March 31, 2009.\n3.13\nCertificate of Amendment to the Company’s Amended and Restated Certificate of Incorporation filed with the Delaware Secretary of State on June 30, 2009, incorporated herein by reference to Exhibit 3.13 to the Company’s Quarterly Report on Form 10-Q filed on August 14, 2009.\n3.14\nAmendment No. 1 to By-laws dated June 17, 2010, incorporated herein by reference to Exhibit 3.14 to the Company’s Quarterly Report on Form 10-Q filed on August 16, 2010.\n3.15\nCertificate of Amendment to the Company’s Amended and Restated Certificate of Incorporation filed with the Delaware Secretary of State on August 4, 2010, incorporated herein by reference to Exhibit 3.15 to the Company’s Quarterly Report on Form 10-Q filed on November 12, 2010.\n3.16\nAmended and Restated Certificate of Designation of Series A-1 Cumulative Convertible Preferred Stock filed with the Delaware Secretary of State on August 4, 2010, incorporated herein by reference to Exhibit 3.16 to the Company’s Quarterly Report on Form 10-Q filed on November 12, 2010.\n3.17\nCertificate of Designation of Series B Participating Convertible Preferred Stock filed with the Delaware Secretary of State on August 4, 2010, incorporated herein by reference to Exhibit 3.17 to the Company’s Quarterly Report on Form 10-Q filed on November 12, 2010.\n3.18\nCertificate of Amendment to Amended And Restated Certificate of Incorporation filed with the Delaware Secretary of State on December 31, 2010, incorporated herein by reference to Exhibit 3.18 to the Company’s Annual Report on Form 10-K filed on March 30, 2011.\n3.19\nSecond Amended and Restated Certificate of Designation of Series A-1 Cumulative Convertible Preferred Stock filed with the Delaware Secretary of State on December 31, 2010, incorporated herein by reference to Exhibit 3.19 to the Company’s Annual Report on Form 10-K filed on March 30, 2011.\n3.20\nAmended and Restated Certificate of Designation of Series B Participating Convertible Preferred Stock filed with the Delaware Secretary of State on December 31, 2010, incorporated herein by reference to Exhibit 3.20 to the Company’s Annual Report on Form 10-K filed on March 30, 2011.\nExhibit Number\nDocument\n3.21\nCertificate of Designation of Series C Participating Convertible Preferred Stock filed with the Delaware Secretary of State on December 31, 2010, incorporated herein by reference to Exhibit 3.21 to the Company’s Annual Report on Form 10-K filed on March 30, 2011.\n3.22\nAmendment to the Amended And Restated Certificate of Designation of the Series B Participating Convertible Preferred Stock, incorporated herein by reference to Exhibit 10.59 to the Company’s Current Report on Form 8-K filed March 31, 2011.\n3.23\nAmendment to the Amended And Restated Certificate of Designation of the Series C Participating Convertible Preferred Stock, incorporated herein by reference to Exhibit 10.60 to the Company’s Current Report on Form 8-K filed March 31, 2011.\n3.24\nCertificate of Amendment to Amended and Restated Certificate of Incorporation filed with the Delaware Secretary of State on November 13, 2012, incorporated herein by reference to Appendix A to the Company’s Definitive Proxy Statement filed on Schedule 14A on October 22, 2012.\n3.25\nThird Amended and Restated Certificate of Designation of Series A-1 Cumulative Convertible Preferred Stock filed with the Delaware Secretary of State on November 13, 2012, incorporated herein by reference to Exhibit 3.25 to the Company’s Form 10-K filed March 31, 2014.\n3.26\nSecond Amended and Restated Certificate of Designation of Series B Participating Convertible Preferred Stock filed with the Delaware Secretary of State on November 13, 2012, incorporated herein by reference to Exhibit 3.26 to the Company’s Form 10-K filed March 31, 2014.\n3.27\nAmended and Restated Certificate of Designation of Series C Participating Convertible Preferred Stock filed with the Delaware Secretary of State on November 13, incorporated herein by reference to Exhibit 3.27 to the Company’s Form 10-K filed March 31, 2014.\n3.28\nCertificate of Designation of Series D Convertible Preferred Stock filed with the Delaware Secretary of State on November 13, 2012, incorporated herein by reference to Exhibit 3.28 to the Company’s Form 10-K filed March 31, 2014.\n3.29\nCertificate of Amendment to Amended and Restated Certificate of Incorporation filed with the Delaware Secretary of State on December 10, 2013, incorporated herein by reference to Appendix A to the Company’s Definitive Proxy Statement filed on Schedule 14A on November 1, 2013.\n3.30\nCertificate of Amendment to Certificate of Designation of Series D Convertible Preferred Stock filed with the Delaware Secretary of State on December 31, 2013, incorporated herein by reference to Exhibit 3.30 to the Company’s Form 10-K filed March 31, 2014.\n3.31\nCertificate of Amendment to Amended and Restated Certificate of Incorporation filed with the Delaware Secretary of State on December 16, 2014, incorporated herein by reference to Appendix A to the Company’s Definitive Proxy Statement filed on Schedule 14A on October 17, 2014.\n3.32\nCertificate of Amendment to Certificate of Designation of Series D Convertible Preferred Stock filed with the Delaware Secretary of State on March 24, 2015, incorporated herein by reference to Exhibit 3.32 to the Company’s Quarterly Report on Form 10-Q filed May 15, 2015.\n3.33\nCertificate of Amendment to the Company’s Third Amended and Restated Certificate of Designation of Series A-1 Cumulative Convertible Preferred Stock filed with Secretary of State of the State of Delaware on May 18, 2016, incorporated herein by reference to Exhibit 3.1 to the Company’s Current Report on Form 8-K filed May 16, 2016.\n3.34\nCertificate of Amendment to the Company’s Second Amended and Restated Certificate of Designation of Series B Participating Convertible Preferred Stock filed with Secretary of State of the State of Delaware on May 18, 2016, incorporated herein by reference to Exhibit 3.2 to the Company’s Current Report on Form 8-K filed May 16, 2016.\n3.35\nCertificate of Amendment to the Company’s Amended and Restated Certificate of Designation of Series C Participating Convertible Preferred Stock filed with Secretary of State of the State of Delaware on May 18, 2016, incorporated herein by reference to Exhibit 3.3 to the Company’s Current Report on Form 8-K filed May 16, 2016.\n3.36\nCertificate of Amendment to the Company’s Certificate of Designation of Series D Convertible Preferred Stock filed with Secretary of State of the State of Delaware on May 18, 2016, incorporated herein by reference to Exhibit 3.4 to the Company’s Current Report on Form 8-K filed May 16, 2016.\nExhibit Number\nDocument\n3.37\nCertificate of Amendment to the Company’s Certificate of Designation of Series D Convertible Preferred Stock filed with Secretary of State of the State of Delaware on May 18, 2016, incorporated herein by reference to Exhibit 3.5 to the Company’s Current Report on Form 8-K filed May 16, 2016.\n†4.10\n1999 Stock Option Plan, as amended, incorporated herein by reference to Exhibit 4.2 to the Company’s Form S-8 filed on September 19, 2008.\n4.11\nForm of Convertible Promissory Note issued by the Company, incorporated herein by reference to Exhibit 10.3 to the Company’s Form 8-K filed on November 3, 2004.\n4.12\nForm of Warrant issued by the Company, incorporated herein by reference to Exhibit 10.4 to the Company’s Form 8-K filed on November 3, 2004.\n4.13\nForm of Promissory Note issued by the Company, incorporated herein by reference to Exhibit 10.36 to the Company’s Form 8-K filed on August 12, 2006.\n4.14\nForm of Warrant issued by the Company, incorporated herein by reference to Exhibit 10.37 to the Company’s Form 8-K filed on August 12, 2006.\n4.15\nForm of Promissory Note issued by the Company, incorporated herein by reference to Exhibit 10.36 to the Company’s Form 8-K filed on February 9, 2007.\n4.16\nForm of Warrant issued by the Company, incorporated herein by reference to Exhibit 10.37 to the Company’s Form 8-K filed on February 9, 2007.\n4.17\nForm of Promissory Note issued by the Company, incorporated herein by reference to Exhibit 10.36 to the Company’s Form 8-K filed on June 20, 2007.\n4.18\nForm of Warrant issued the Company, incorporated herein by reference to Exhibit 10.37 to the Company’s Form 8-K filed on June 20, 2007.\n4.19\nForm of Common Stock Purchase Warrant issued by the Company, incorporated herein by reference to Exhibit 4.19 to the Company’s Quarterly Report on Form 10-Q filed on August 14, 2008.\n4.20\nForm of Additional Common Stock Purchase Warrant, incorporated herein by reference to Exhibit 4.20 to the Company’s Quarterly Report on Form 10-Q filed on August 14, 2008.\n4.21\nForm of Secured Promissory Note issued by the Company dated June 5, 2008, incorporated herein by reference to Exhibit 4.21 to the Company’s Quarterly Report on Form 10-Q filed on August 14, 2008.\n4.22\nForm of Additional Secured Promissory Note, incorporated herein by reference to Exhibit 4.22 to the Company’s Quarterly Report on Form 10-Q filed on August 14, 2008.\n4.23\nCertificate of Designations, Powers, Preferences and Rights of the Series A-1 Cumulative Convertible Preferred Stock filed with the Delaware Secretary of State on October 30, 2008, incorporated herein by reference to Exhibit 4.23 to the Company’s Annual Report on Form 10-K filed on March 12, 2009.\n4.24\nForm of Secured Promissory Note issued by the Company dated May 28, 2009, incorporated herein by reference to Exhibit 4.24 to the Company’s Quarterly Report on Form 10-Q filed on August 14, 2009.\n4.25\nForm of Additional Secured Promissory Note, incorporated herein by reference to Exhibit 4.25 to the Company’s Quarterly Report on Form 10-Q filed on August 14, 2009.\n4.26\nForm of Common Stock Purchase Warrant issued by the Company, incorporated herein by reference to Exhibit 4.26 to the Company’s Quarterly Report on Form 10-Q filed on August 14, 2009.\n4.27\nForm of Additional Common Stock Purchase Warrant, incorporated herein by reference to Exhibit 4.27 to the Company’s Quarterly Report on Form 10-Q filed on August 14, 2009.\n10.24\nForm of Note and Warrant Purchase Agreement dated October 28, 2004, by and among the Company and the Purchasers identified therein, incorporated herein by reference to Exhibit 10.1 to the Company’s Form 8-K filed on November 3, 2004.\n10.25\nForm of Registration Rights Agreement dated October 28, 2004, by and among the Company and the parties identified therein, incorporated herein by reference to Exhibit 10.2 to the Company’s Form 8-K filed on November 3, 2004.\nExhibit Number\nDocument\n10.26\nForm of Note and Warrant Purchase Agreement dated August 10, 2006, by and among the Company and the Purchasers identified therein, incorporated herein by reference to Exhibit 10.34 to the Company’s Form 8-K filed on August 12, 2006.\n10.27\nForm of Registration Rights Agreement dated August 10, 2006, by and among the Company and the parties identified therein, incorporated herein by reference to Exhibit 10.35 to the Company’s Form 8-K filed on August 12, 2006.\n†††10.28\nAmendment dated May 31, 2005 to the License agreement dated December 22, 2000 between the Company and eCom Asia Pacific, Ltd., incorporated by reference to Exhibit 10.26 of the Company’s Form 10-K/A filed on September 15, 2005.\n10.36\nForm of Note and Warrant Purchase Agreement dated February 5, 2007, by and among the Company and the Purchasers identified therein, incorporated herein by reference to Exhibit 10.34 to the Company’s Form 8-K filed on February 5, 2007.\n10.37\nForm of Registration Rights Agreement dated February 5, 2007, by and among the Company and the parties identified therein, incorporated herein by reference to Exhibit 10.35 to the Company’s Form 8-K filed on February 5, 2007.\n10.38\nAmendment to the Note and Warrant Purchase Agreement dated February 5, 2007, by and among the Company and the parties identified therein, incorporated herein by reference to Exhibit 99.1 to the Company’s Form 8-K filed on March 15, 2007.\n10.39\nForm of Note and Warrant Purchase Agreement dated June 15, 2007, by and among the Company and the Purchasers identified therein, incorporated herein by reference to Exhibit 10.34 to the Company’s Form 8-K filed on June 15, 2007.\n10.40\nForm of Registration Rights Agreement dated June 15, 2007, by and among the Company and the parties identified therein, incorporated herein by reference to Exhibit 10.35 to the Company’s Form 8-K filed on June 15, 2007.\n10.41\nForm of Securities Purchase and Registration Rights Agreement dated August 24, 2007, by and among the Company and Phoenix Venture Fund LLC, incorporated herein by reference to Exhibit 10.36 to the Company’s Form 8-K filed on August 27, 2007.\n†10.42\nConsulting Agreement dated January 9, 2008 between the Company and GS Meyer & Associates LLC - Incorporated by reference to Exhibit 10.42 to the Company’s Annual Report on Form 10-K filed on March 31, 2007.\n10.43\nCredit Agreement dated June 5, 2008, by and among the Company and the Lenders Party Hereto and SG Phoenix as Collateral Agent, incorporated herein by reference to Exhibit 10.41 to the Company’s Quarterly Report on Form 10-Q filed on August 14, 2008.\n10.44\nPledge and Security Agreement dated June 5, 2008, by and among the Company and the parties identified therein, incorporated herein by reference to Exhibit 10.42 to the Company’s Quarterly Report on Form 10-Q filed on August 14, 2008.\n10.45\nSecurities Purchase Agreement dated June 5, 2008, by and among the Company and the parties identified therein, incorporated herein by reference to Exhibit 10.43 to the Company’s Quarterly Report on Form 10-Q filed on August 14, 2008.\n10.46\nAmendment No. 1 to Credit Agreement dated May 28, 2009, by and among the Company, the Lenders and Additional Lenders Parties Hereto and SG Phoenix as Collateral Agent, incorporated herein by reference to Exhibit 10.46 to the Company’s Quarterly Report on Form 10-Q filed on August 14, 2009.\n10.47\nAmendment No. 1 to Registration Rights Agreement dated May 28, 2009, by and among the Company and the parties identified therein, incorporated herein by reference to Exhibit 10.47 to the Company’s Quarterly Report on Form 10-Q filed on August 14, 2009.\n10.48\nSalary Reduction Plan for Executive Officers of Communication Intelligence Corporation under Amendment No. 1 to Credit Agreement dated May 28, 2009, incorporated herein by reference to Exhibit 10.48 to the Company’s Quarterly Report on Form 10-Q filed on August 14, 2009.\n10.53\nAmendment No. 3 to Credit Agreement dated July 22, 2010, by and among the Company, the Lenders and Additional Lenders Parties Hereto and SG Phoenix as Collateral Agent, incorporated herein by reference to Exhibit 10.53 to the Company’s Quarterly Report on Form 10-Q filed on November 12, 2010.\nExhibit Number\nDocument\n10.54\nAmendment No. 3 to Registration Rights Agreement dated July 22, 2010, by and among the Company and the parties identified therein, incorporated herein by reference to Exhibit 10.54 to the Company’s Quarterly Report on Form 10-Q filed on November 12, 2010.\n10.55\nRegistration Rights Agreement dated August 5, 2010, by and among the Company and the Persons Executing the Agreement as Investors, incorporated herein by reference to Exhibit 10.55 to the Company’s Quarterly Report on Form 10-Q filed on November 12, 2010.\n10.56\nInvestor Rights Agreement dated August 5, 2010, by and among the Company and Phoenix Venture Fund LLC, SG Phoenix LLC, Michael Engmann, Ronald Goodman, Kendu Partners Company and MDNH Partners L.P., incorporated herein by reference to Exhibit 10.56 to the Company’s Quarterly Report on Form 10-Q filed on November 12, 2010.\n10.57\nSecurities Purchase Agreement dated December 9, 2010, by and among the Company, Phoenix Venture Fund LLC, and the Investors signatory thereto, incorporated herein by reference to Exhibit 10.57 to the Company’s Current Report on Form 8-K filed on December 9, 2010.\n10.58\nRegistration Rights Agreement dated December 31, 2010, by and among the Company and the Persons Executing the Agreement as Investors, incorporated herein by reference to Exhibit 10.58 to the Company’s Current Report on Form 8-K filed on January 6, 2011.\n10.59\nForm of Subscription Agreement dated March 31, 2011, by and among the Company and the Person Executing the Agreement as Subscribers, incorporated herein by reference to Exhibit 10.61 to the Company’s Current Report on Form 8-K filed on April 4, 2011.\n10.60\nAmendment No. 1 to Registration Rights Agreement dated March 31, 2011, by and among the Company and the Persons Executing the Agreement as Required Holders, incorporated herein by reference to Exhibit 10.62 to the Company’s Current Report on Form 8-K filed on April 4, 2011.\n10.61\nNote and Warrant Purchase Agreement dated September 20, 2011, incorporated herein by reference to Exhibit 10.61 to the Company’s Quarterly Report on Form 10-Q filed on November 14, 2011.\n10.62\nNote and Warrant Purchase Agreement dated December 2, 2011, incorporated herein by reference to Exhibit 10.62 to the Company’s Annual Report on Form 10-K filed on March 30, 2012.\n10.63\nNote and Warrant Purchase Agreement dated April 23, 2012, incorporated herein by reference to Exhibit 10.63 to the Company’s Quarterly Report on Form 10-Q filed on August 14, 2012.\n10.64\nForm of Subscription Agreement dated September 14, 2012, incorporated herein by reference to Exhibit 10.64 to the Company’s Quarterly Report on Form 10-Q filed on November 14, 2012.\n10.65\nForm of Unsecured Convertible Promissory Note dated September 14, 2012, incorporated herein by reference to Exhibit 10.65 to the Company’s Quarterly Report on Form 10-Q filed on November 14, 2012.\n10.66\nForm of Subscription Agreement dated May 17, 2013, incorporated herein by reference to Exhibit 10.66 to the Company’s Quarterly Report on Form 10-Q filed on August 14, 2013.\n10.67\nForm of Subscription Agreement dated December 31, 2013, incorporated herein by reference to Exhibit 10.67 to the Company’s Form 10-K filed March 31, 2014.\n10.68\nCredit Agreement with Venture Champion Asia Limited dated May 6, 2014, incorporated herein by reference to Exhibit 10.68 to the Company’s Form 10-Q filed August 15, 2014.\n10.69\nForm of Subscription Agreement dated August 5, 2014, incorporated herein by reference to Exhibit 10.69 to the Company’s Form 10-K filed March 31, 2015.\n10.70\nForm of Subscription Agreement dated March 24, 2015, incorporated herein by reference to Exhibit 10.70 to the Company’s Quarterly Report on Form 10-Q filed May 15, 2015.\n10.71\nForm of Subscription Agreement dated July 23, 2015, incorporated herein by reference to Exhibit 10.71 to the Company’s Quarterly Report on Form 10-Q filed November 16, 2015.\n10.72\nNote and Warrant Purchase Agreement dated November 3, 2016, incorporated herein by reference to Exhibit 10.72 to the Company’s Quarterly Report on Form 10-Q filed August 14, 2017.\n10.73\nForm of Unsecured Convertible Promissory Note dated November 3, 2016, incorporated herein by reference to Exhibit 10.73 to the Company’s Quarterly Report on Form 10-Q filed August 14, 2017.\n10.74\nNote Purchase Agreement dated May 23, 2017, incorporated herein by reference to Exhibit 10.74 to the Company’s Quarterly Report on Form 10-Q filed August 14, 2017.\nExhibit Number\nDocument\n10.75\nForm of Secured Convertible Promissory Note dated May 23, 2017, incorporated herein by reference to Exhibit 10.75 to the Company’s Quarterly Report on Form 10-Q filed August 14, 2017.\n14.1\nCode of Ethics, incorporated by reference to Exhibit 14 to the Company’s Annual Report on Form 10-K filed on March 30, 2004.\n*21.1\nSchedule of Subsidiaries.\n*23.2\nConsent of Armanino LLP, Independent Registered Public Accounting Firm.\n*31.1\nCertification of Company’s Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n*31.2\nCertificate of Company’s Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n*32.1\nCertification of Chief Executive Officer pursuant to 18 USC Section 1750, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n*32.2\nCertification of Chief Financial Officer pursuant to 18 USC Section 1750, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS\nXBRL Instance Document\n101.SCH\nXBRL Taxonomy Extension Schema Document\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nXBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase Document\n* Filed herewith.\n† Indicates management contract or compensatory plan, contract or arrangement.\n†† Confidential treatment of certain portions of this exhibit have been requested from the SEC pursuant to a request for confidentiality dated March 30, 1999, filed pursuant to the Exchange Act.\n††† Confidential treatment of certain portions of this exhibit have been requested from the SEC pursuant to a request for confidentiality dated March 30, 2006 filed pursuant to the Exchange Act.\nThe exhibits listed above are filed as part of this Form 10-K other than Exhibits 32.1 and 32.2, which shall be deemed furnished.\n(c) Financial Statement Schedules\nAll financial statement schedules are omitted because the information is inapplicable or presented in the notes to the financial statements.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned; thereunto duly authorized, in the City of Redwood Shores, State of California.\niSign Solutions Inc.\nBy: /s/ Andrea Goren\nAndrea Goren\n(Principal Financial Officer and Officer Duly Authorized to Sign on Behalf of the Registrant)\nDate: April 7, 2021\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of Registrant and in the capacities indicated on March 31, 2021.\nDate\nSignature\nTitle\nApril 7, 2021\n/s/ Philip S. Sassower\nCo-Chairman and Chief Executive Officer\nPhilip S. Sassower\n(Principal Executive Officer)\nApril 7, 2021\n/s/ Michael Engmann\nCo-Chairman and Chief Operating Officer\nMichael Engmann\nApril 7, 2021\n/s/ Andrea Goren\nDirector, Chief Financial Officer\nAndrea Goren\n(Principal Financial and Accounting Officer)\nApril 7, 2021\n/s/ Francis J. Elenio\nDirector\nFrancis J. Elenio\nApril 7, 2021\n/s/ Stanly Gilbert\nDirector\nStanley Gilbert\nApril 7, 2021\n/s/ Jeffrey Holtmeier\nDirector\nJeffrey Holtmeier\nApril 7, 2021\n/s/ David Welch\nDirector\nDavid Welch\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nStockholders of iSign Solutions, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of iSign Solutions, Inc. (the Company) as of December 31, 2020, and the related consolidated statements of operations, comprehensive loss, stockholders’ deficit, and cash flows for the year ended December 31, 2020, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2020, and the results of its operations and its cash flows for the year ended December 31, 2020, in conformity with accounting principles generally accepted in the United States of America. The financial statements of iSign Solutions, Inc., as of December 31, 2019, were audited by other auditors whose report dated March 30, 2020, expressed an unqualified opinion on those financial statements.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provide a reasonable basis for our opinion.\nGoing Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the financial statements, the Company has suffered net losses from operations since inception and has an accumulated deficiency, which raises substantial doubt about its ability to continue as a going concern. Management’s plans regarding those matters are discussed in Note 1. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenue Recognition\nAs discussed in Note 1, the Company recognizes revenue upon transfer of control of promised services to customers in an amount that reflects the consideration the Company expects to receive in exchange for those products or services.\nAuditing management’s evaluation of agreements with customers involves significant judgment, given the fact that some agreements require management’s evaluation and allocation of the standalone transaction prices to the performance obligations.\nTo evaluate the appropriateness and accuracy of the assessment by management, we evaluated management’s assessment in relationship to the relevant agreements.\n/s/ M&K CPAS, PLLC\nWe have served as the Company’s auditor since 2020.\nHouston, TX\nApril 7, 2021\nReport of Independent Registered Public Accounting Firm\nThe Board of Directors and Stockholders of\niSign Solutions Inc.\nSan Jose, California\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of iSign Solutions Inc. and subsidiary (the “Company”) as of December 31, 2019, and the related consolidated statements of operations, comprehensive loss, changes in stockholders’ deficit, and cash flows for the year ended December 31, 2019, and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements referred to above present fairly, in all material respects, the consolidated financial position of the Company as of December 31, 2019, and the consolidated results of its operations and its cash flows for the year ended December 31, 2019, in conformity with U.S. generally accepted accounting principles.\nThe Company’s Ability to Continue as a Going Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the consolidated financial statements, the Company’s significant recurring losses and accumulated deficit raise substantial doubt about its ability to continue as a going concern. Management’s plans in regard to these matters are described in Note 1. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (“PCAOB”) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nArmaninoLLP\nWe had served as the Company’s auditor from 2014 to 2020.\nSan Ramon, California\nMarch 30, 2020\niSign Solutions Inc.\nConsolidated Balance Sheets\n(In thousands, except par value amounts)\nDecember 31,\nAssets\nCurrent assets:\nCash and cash equivalents $ 26 $ 25\nAccounts receivable, net of allowance of $0 and $1 at December 31, 2020 and 2019, respectively\nPrepaid expenses and other current assets\nTotal current assets\nProperty and equipment, net\nOther assets\nTotal assets $ 146 $ 121\nLiabilities and Stockholders’ Deficit\nCurrent liabilities:\nAccounts payable $ 353 $ 1,196\nShort-term debt - related party 1,065\nShort-term debt - other 1,807 1,405\nShort-term debt - Paycheck Protection Program -\nAccrued compensation\nDeferred compensation -\nOther accrued liabilities 1,141\nDeferred revenue\nTotal current liabilities 5,005 4,673\nLong-term debt - other -\nDeferred revenue long-term -\nOther long-term liabilities\nTotal liabilities 5,833 5,559\nCommitments and contingencies (Note 8)\nStockholders’ deficit:\nCommon stock, $0.01 par value; 2,000,000 shares authorized; 5,762 and 5,762 shares issued and outstanding at December 31, 2020 and 2019, respectively\nTreasury shares, 5 at December 31, 2020 and December 31, 2019, respectively (325 ) (325 )\nAdditional paid-in-capital 129,783 129,504\nAccumulated deficit (135,203 ) (134,675 )\nTotal stockholders’ deficit (5,687 ) (5,438 )\nTotal liabilities and stockholders’ deficit $ 146 $ 121\nSee accompanying notes to these Consolidated Financial Statements\niSign Solutions Inc\nConsolidated Statements of Operations\n(In thousands, except per share amounts)\nYears Ended December 31,\nRevenue:\nProduct $ 247 $ 195\nMaintenance\nOperating costs and expenses:\nCost of sales:\nProduct\nMaintenance\nResearch and development\nSales and marketing\nGeneral and administrative\n1,619 1,627\nLoss from operations (653 ) (783 )\nOther income, net\nInterest expense:\nRelated party (104 ) (74 )\nOther (202 ) (194 )\nAmortization of debt discount:\nRelated party (1 ) (10 )\nOther (2 ) (26 )\nLoss before income tax (527 ) (1,085 )\nIncome tax expense (1 ) (1 )\nNet loss $ (528 ) $ (1,086 )\nBasic and diluted loss per common share $ (0.09 ) $ (0.19 )\nWeighted average common shares outstanding, basic and diluted 5,762 5,762\nSee accompanying notes to these Consolidated Financial Statements\niSign Solutions Inc.\nConsolidated Statements of Comprehensive Loss\n(In thousands)\nYears Ended December 31,\nNet loss: $ (528 ) $ (1,086 )\nOther comprehensive income, net of tax - -\nForeign currency translation adjustment, net - -\nTotal comprehensive loss $ (528 ) $ (1,086 )\nSee accompanying notes to these Consolidated Financial Statements\niSign Solutions Inc.\nConsolidated Statement of Changes in Stockholders’ Deficit\n(In thousands)\nCommon Common\nAdditional\nTotal\nShares Stock Treasury Paid-In Accumulated Stockholders’\nOutstanding Amount Stock Capital Deficit Deficit\nBalance as of December 31, 2018 5,762 $ (325 ) $ 129,251 $ (133,589 ) $ (4,605 )\nStock-based compensation - - - -\nWarrants issued associated with long-term liabilities - - - -\nNet loss - - - - (1,086 ) (1,086 )\nBalance as of December 31, 2019 5,762 $ (325 ) $ 129,504 $ (134,675 ) $ (5,438 )\nStock-based compensation - - - -\nWarrants issued associated with long-term liabilities - - - -\nWarrants issued for services - - - -\nNet loss - - - - (528 ) (528 )\nBalance as of December 31, 2020 5,762 (325 ) 129,783 (135,203 ) (5,687 )\nSee accompanying notes to these Consolidated Financial Statements\niSign Solutions Inc.\nConsolidated Statements of Cash Flows\n(In thousands)\nDecember 31,\nCash flows from operating activities:\nNet loss $ (528 ) $ (1,086 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nDepreciation\nAmortization of debt discount\nStock based compensation associated with long-term liabilities\nWarrants issued for services -\nStock-based compensation\nForgiveness of debt (435 ) -\nChanges in operating assets and liabilities:\nAccounts receivable, net (39 )\nPrepaid expenses and other current assets\nAccounts payable (278 ) (84 )\nAccrued compensation (10 )\nOther accrued liabilities\nDeferred revenue (201 )\nNet cash used in operating activities (705 ) (301 )\nCash flows from investing activities:\nAcquisition of property and equipment - (9 )\nNet cash used in investing activities - (9 )\nCash flows from financing activities:\nProceeds from issuance of short term debt - related party -\nProceeds from issuance of short term debt - other -\nProceeds from Short-term-debt- Paycheck Protection Program -\nProceeds from advances on accounts receivable - related party\nProceeds from advances on accounts receivable - other -\nPayment of advances on accounts receivable - related party - (33 )\nPayment of advances on accounts receivable - other (20 ) -\nNet cash provided by financing activities -\nNet increase (decrease) in cash and cash equivalents (310 )\nCash and cash equivalents at beginning of period\nCash and cash equivalents at end of period $ 26 $ 25\nSee accompanying notes to these Consolidated Financial Statements\niSign Solutions Inc.\nConsolidated Statements of Cash Flows (continued)\n(In thousands)\nSupplemental disclosure of cash flow information:\nSupplementary disclosure of cash flow information\nInterest paid $ 6 $ 3\nIncome taxes paid $ 1 $ 1\nNon-cash financing and investing transactions\nValue of warrants issued $ 160 $ 64\nSettlement of accounts payable - issuance of short and long-term debt $ 130 $ -\nSee accompanying notes to these Consolidated Financial Statements\niSign Solutions Inc.\nNotes to Consolidated Financial Statements\n(In thousands except per share amounts)\n1. Nature of Business, Basis of Presentation and Summary of Significant Accounting Policies:\nThe Company:\nThe Company is a leading supplier of digital transaction management (DTM) software enabling the paperless, secure and cost-effective management of document-based transactions. iSign’s solutions encompass a wide array of functionality and services, including electronic signatures, biometric authentication and simple-to-complex workflow management. These solutions are available across virtually all enterprise, desktop and mobile environments as a seamlessly integrated platform for both ad-hoc and fully automated transactions. The Company’s products and services result in legally binding transactions that are compliant with applicable laws and regulations and that can provide a higher level of security than paper-based processes. The Company has been a leading supplier of enterprise software solutions within the financial services and insurance industries and has delivered significant expense reduction by enabling complete document and workflow automation and the resulting reduction in mailing, scanning, filing and other costs related to the use of paper.\nThe Company’s research and development activities have given rise to numerous technologies and products. The Company’s core DTM technologies include various forms of electronic signatures, such as handwritten biometric, click-to-sign and others, as well as signature verification, cryptography and the logging of audit trails to show signers’ intent. These technologies can enable secure, legal and regulatory compliant electronic transactions that can enhance customer experience at a fraction of the time and cost required by traditional, paper-based processes. The Company’s products include SignatureOne® Ceremony™ Server, Sign-it® and the iSign® family of products and services.\nGoing concern and management plans:\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. Except for 2004, the Company has incurred significant losses since its inception and, at December 31, 2020, the Company’s accumulated deficit was $135,203. The Company has primarily met its working capital needs through the sale of debt and equity securities. As of December 31, 2020, the Company’s cash balance was $26. These factors raise substantial doubt about the Company’s ability to continue as a going concern.\nThere can be no assurance that the Company will be successful in securing adequate capital resources to fund planned operations or that any additional funds will be available to the Company when needed, or if available, will be available on favorable terms or in amounts required by the Company. If the Company is unable to obtain adequate capital resources to fund operations, it may be required to delay, scale back or eliminate some or all of its operations, which may have a material adverse effect on the Company’s business, results of operations and ability to operate as a going concern. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nIn December 2019, an outbreak of a novel strain of coronavirus (COVID-19) originated in Wuhan, China and has since spread to a number of other countries, including the U.S. On March 11, 2020, the World Health Organization characterized COVID-19 as a pandemic. In addition, several states in the U.S., including California, where the Company is headquartered, have declared a state of emergency. The COVID-19 outbreak is disrupting supply chains and affecting production and sales across a wide range of industries. The extent of the impact of COVID-19 on our operational and financial performance will depend on certain developments, including the duration and spread of the outbreak, impact on our customers, employees and vendors all of which are uncertain and cannot be predicted. At this point, the extent to which COVID-19 may impact our financial condition or results of operations is uncertain.\nRevision to Financial Statements for the Year Ended December 31, 2019\nThe Company is revising its financial statements for the year ended December 31, 2019 to revise the reporting for certain warrants issued by the Company on February 6, 2019 to four consultants and one employee to purchase 985 shares of common stock and other miscellaneous reclassifications.\nBasis of consolidation:\nThe accompanying consolidated financial statements are prepared in accordance with generally accepted accounting principles in the United States of America. All amounts shown in the accompanying consolidated financial statements are in thousands of dollars except per share amounts.\niSign Solutions Inc.\nNotes to Consolidated Financial Statements\n(In thousands except per share amounts)\n1. Nature of Business, Basis of Presentation and Summary of Significant Accounting Policies (continued):\nUse of estimates:\nThe preparation of consolidated financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities, at the date of the consolidated financial statements, as well as the reported amounts of revenue and expenses during the reporting periods. Actual results could differ from these estimates.\nFair value measures:\nFair value is the price that would be received to sell an asset, or paid to transfer a liability, in the principal or most advantageous market for the asset or liability in an ordinary transaction between market participants on the measurement date. Our policy on fair value measures requires us to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. The policy establishes a fair value hierarchy based on the level of independent, objective evidence surrounding the inputs used to measure fair value. A financial instrument’s categorization within the fair value hierarchy is based upon the lowest level of input that is significant to the fair value measurement. The policy prioritizes the inputs into three levels that may be used to measure fair value:\nLevel 1: Applies to assets or liabilities for which there are quoted prices in active markets for identical assets or liabilities.\nLevel 2: Applies to assets or liabilities for which there are inputs other than quoted prices that are observable for the asset or liability such as quoted prices for similar assets or liabilities in active markets; quoted prices for identical assets or liabilities in markets with insufficient volume or infrequent transactions (less active markets); or model-derived valuations in which significant inputs are observable or can be derived principally from, or corroborated by, observable market data.\nLevel 3: Applies to assets or liabilities for which there are unobservable inputs to the valuation methodology that are significant to the measurement of the fair value of the assets or liabilities.\nThe Company’s assets and liabilities measured at fair value, whether recurring or non-recurring, at December 31, 2020 and December 31, 2019, and the fair value calculation input hierarchy level that we have determined applies to each asset and liability category.\nFair Value of Financial Instruments:\nThe Company carries financial instruments on the consolidated balance sheet at the fair value of the instruments as of the consolidated balance sheet date. At the end of each period, management assesses the fair value of each instrument and adjusts the carrying value to reflect its assessment. At December 31, 2020 and December 31, 2019, the carrying values of accounts receivable and accounts payable approximated their fair values.\niSign Solutions Inc.\nNotes to Consolidated Financial Statements\n(In thousands except per share amounts)\n1. Nature of Business, Basis of Presentation and Summary of Significant Accounting Policies (continued):\nTreasury Stock:\nShares of common stock returned to, or repurchased by, the Company are recorded at cost and are included as a separate component of stockholders’ equity (deficit). Under the cost method, the gross cost of the shares reacquired is charged to a contra equity account titled treasury stock. The equity accounts that were credited for the original share issuance (Common Stock, additional paid-in capital, etc.) remain intact. When the treasury shares are reissued, proceeds in excess of cost are credited to additional paid-in capital. Any deficiency is charged to accumulated deficit (unless additional paid-in capital from previous treasury share transactions exists, in which case the deficiency is charged to that account, with any excess charged to accumulated deficit).\nDerivatives:\nThe Company, from time to time, enters into transactions which contain conversion privileges, the settlement of which may entitle the holder or the Company to settle the obligation(s) by issuance of Company securities. The Company applies a two-step model in determining whether a financial instrument or an embedded feature is indexed to an issuer’s own stock and thus able to qualify for the scope exception. The fair value of each derivative is estimated each reporting period.\nThe conversion option included within the unsecured convertible promissory notes is accounted for as a derivative liability at its estimated fair value. The derivative is subject to re-measurement at the end of each reporting period, with changes in fair value recognized as a component of interest and other income, in the consolidated statements of operations. The Company will continue to adjust the liability for changes in fair value until the earlier of the conversion or maturity of the unsecured convertible promissory note purchase agreements.\nCash and cash equivalents:\nThe Company considers all highly liquid investments with maturities at the date of purchase of three months or less to be cash equivalents.\nThe Company’s cash and cash equivalents, at December 31, consisted of the following:\nCash in bank $ 26 $ 25\nCash and cash equivalents $ 26 $ 25\nConcentrations of credit risk:\nFinancial instruments that potentially subject the Company to significant concentrations of credit risk consist primarily of cash, cash equivalents, and accounts receivable. The Company maintains its cash and cash equivalents with various financial institutions. This diversification of risk is consistent with Company policy to maintain liquidity, and mitigate risk of loss as to principal.\nTo date, accounts receivable have been derived principally from revenue earned from end users, manufacturers, and distributors of computer products in North America. The Company performs periodic credit evaluations of its customers, and does not require collateral. The Company maintains reserves for potential credit losses; historically, such losses have been within management’s expectations.\nThe allowance for doubtful accounts is based on the Company’s assessment of the collectability of specific customer accounts and an assessment of international, political and economic risk as well as the aging of the accounts receivable. If there is a change in actual defaults from the Company’s historical experience, the Company’s estimates of recoverability of amounts due could be affected and the Company will adjust the allowance accordingly.\niSign Solutions Inc.\nNotes to Consolidated Financial Statements\n(In thousands except per share amounts)\n1. Nature of Business, Basis of Presentation and Summary of Significant Accounting Policies (continued):\nDeferred financing costs:\nDeferred financing costs include costs paid in cash, such as professional fees and commissions. The costs associated with equity financings, such as in the sale of Common or Preferred Stock, are netted against the proceeds of the offering. In the case of note financings, costs are amortized to interest expense over the life of the notes or upon early payment using the effective interest method.\nProperty and equipment, net:\nProperty and equipment are stated at cost. Depreciation is computed using the straight-line method over the estimated useful lives of the related assets, ranging from three to five years. Leasehold improvements are amortized over their estimated useful lives, not to exceed the term of the related lease. The cost of additions and improvements is capitalized while maintenance and repairs are charged to expense as incurred. Depreciation expense was $3 and $3 for the years ended December 31, 2020 and 2019, respectively.\nLong-lived assets:\nThe Company evaluates the recoverability of its long-lived assets at least annually or whenever circumstances or events indicate such assets might be impaired. The Company would recognize an impairment charge in the event the net book value of such assets exceeded the future undiscounted cash flows attributable to such assets. No such impairment charge was recorded during the years ended December 31, 2020 and 2019, respectively.\nShare-based payment:\nShare-based compensation expense is based on the estimated grant date fair value of the portion of share-based payment awards that is ultimately expected to vest during the period. The grant date fair value of share-based awards to employees and directors is calculated using the Black-Scholes-Merton valuation model. Forfeitures of share-based payment awards are estimated at the time of grant and revised, if necessary, in subsequent periods if actual forfeitures differ from those estimates and it is assumed no dividends will be declared. The estimated fair value of share-based compensation awards to employees is amortized over the vesting period of the options.\nRevenue from Contracts with Customers:\nThe Company’s principal sources of revenues are from the sale of software products, SOW (engineering services), annual software product, and software maintenance contracts. The Company also derives revenue from customers based on the numbers of signatures produced by the Company’s signature software solutions imbedded within the customer’s product.\nRevenue from contracts with customers is recognized using the following five steps:\na) Identify the contract(s) with a customer;\nb) Identify the performance obligations (a good or service) in the contract;\nc) Determine the transaction price; for each performance obligation within the contract\nd) Allocate the transaction price to the performance obligations in the contract; and\ne) Recognize revenue when (or as) the Company satisfies a performance obligation.\nContracts contain performance obligation(s) for the transfer goods or services to a customer. The performance obligations are a promise (or a group of promises) that are distinct. The transaction price is the amount of consideration a Company expects to receive from a customer in exchange for satisfying the performance obligations specified in the contract.\niSign Solutions Inc.\nNotes to Consolidated Financial Statements\n(In thousands except per share amounts)\n1. Nature of Business, Basis of Presentation and Summary of Significant Accounting Policies (continued):\nContracts may contain one or more performance obligations (a good or service). Performance obligations are accounted for separately if they are distinct. A good or service is distinct if the customer can benefit from the good or service either on its own or together with other resources readily available to the customer, and the good or service is distinct in the context of the contract. Otherwise performance obligations will be combined with other promised goods or services until the Company identifies a bundle of goods or services that is distinct.\nThe transaction price is allocated to all separate performance obligations within the contract based on their relative standalone selling prices (“SSP”). The best evidence for SSP is the price the Company would charge for that good or service when sold separately in similar circumstances to similar customers. If goods or services are not always sold separately, the Company would use the best estimate of SSP in the allocation of transaction price.\nThe transaction price reflects the amount of consideration to which the Company expects to be entitled in exchange for transferring goods or services, which may include an estimate of variable consideration to the extent that it is probable of not being subject to significant reversals in the future based on the Company’s experience with similar arrangements. The transaction price also reflects the impact of the time value of money if there is a significant financing component present in an arrangement. The transaction price excludes amounts collected on behalf of third parties, such as sales taxes.\nRevenue is recognized when the Company satisfies each performance obligation identified within the contract by transferring control of the promised goods or services to the customer. Goods or services can transfer at a point in time or over time depending on the nature of the arrangement.\nDeferred revenue represents the Company’s obligation to transfer goods or services to a customer for which the Company has received consideration from the customer. Our payment terms do not vary by the type of products or services offered. The term between invoicing and when payment is due is not significant. During the year ended December 31, 2020, the Company recognized $413 of revenue that was included in deferred revenue at the beginning of the period.\nContract assets exist when the Company has satisfied a performance obligation but does not have an unconditional right to consideration (e.g., because the entity first must satisfy another performance obligation in the contract before it is entitled to invoice the customer).\nThe Company transfers all of its goods and services electronically with the associated costs recorded in cost of sales in the Company’s Condensed Consolidated Statements of Operations.\nSoftware. Revenue from the sale of software products is recognized when the control is transferred. For most of the Company’s software product sales, the control is transferred at the time the product is electronically transferred because the customer has significant risks and rewards of ownership of the asset and the Company has a present right to payment at that time.\nStatement of Work (SOW). Revenue from SOW (engineering services) is recognized upon completion, transfer and satisfaction of the performance obligations identified with in the contract by the customer.\nTransactional revenue. For transactional type contracts, the Company’s performance obligations are met upon transfer of the software master to the customer. Revenue from transactional customers is recognized as the customer reports the number of units (signatures) rendered over the specified reporting period, generally three months.\nRecurring Product revenue. The company has revenue contracts that allow the customer to utilize the Company’s signature software on an annual basis. Maintenance and support costs are included in the annual price to the customer. The customer has the right to renew or cancel the contract on an annual basis. Recurring revenue is recognized on a straight line basis over the contract period, generally one year.\niSign Solutions Inc.\nNotes to Consolidated Financial Statements\n(In thousands except per share amounts)\n1. Nature of Business, Basis of Presentation and Summary of Significant Accounting Policies (continued):\nMaintenance and support. Maintenance and support services are satisfied ratably over time as the customer simultaneously receives and consumes the benefits of the services. As a result, support and maintenance revenue is recognized on a straight line basis over the period of the contract.\nArrangements with Multiple Performance Obligations. The Company has, from time to time, revenue arrangements that include multiple performance obligations. The Company allocates transaction price to all separate performance obligations based on their relative standalone selling prices (“SSP”). The Company’s best evidence for SSP is the price the Company would charge for that good or service when the Company sells it separately in similar circumstances to similar customers. If goods or services are not always sold separately, the Company uses the best estimate of SSP in the allocation of transaction price. The Company’s process for determining best estimate of SSP involves management’s judgment, and considers multiple factors including, but not limited to, major product groupings, gross margin objectives and pricing practices. Pricing practices may vary over time, depending upon the unique facts and circumstances related to each deliverable. If the facts and circumstances underlying the factors considered change or should future facts and circumstances lead the Company to consider additional factors, the Company’s best estimate of SSP may also change.\nContract costs. The incremental costs of obtaining a contract are capitalized if the costs are expected to be recovered. Costs that are recognized as assets are amortized straight-line over the period as the related goods or services transfer to the customer. Costs incurred to fulfill a contract are capitalized if they are not covered by other relevant guidance, relate directly to a contract, will be used to satisfy future performance obligations, and are expected to be recovered.\nSignificant Judgments. The Company may exercise significant judgment when determining whether products and services are considered distinct performance obligations that should be accounted for separately versus together.\nPractical Expedients and Exemptions. Under Topic 606, incremental costs of obtaining a contract, such as sales commissions, are capitalized if they are expected to be recovered. Expensing these costs as they are incurred is not permitted unless they qualify for the practical expedient. The Company elected the practical expedient to expense the costs to obtain a contract as incurred when the expected amortization period is one year or less.\nThe Company elected the practical expedient under Topic 606 to not disclose the transaction price allocated to remaining performance obligations, since the majority of the Company’s arrangements have original expected durations of one year or less, or the invoicing corresponds to the value of the Company’s performance completed to date.\nThe Company elected the practical expedient that allows the Company to not assess a contract for a significant financing component if the period between the customer’s payment and the transfer of the goods or services is one year or less.\nResearch and development:\nResearch and development costs are charged to expense as incurred.\nMarketing:\nThe Company expenses advertising (marketing) costs as incurred. These expenses are outbound marketing expenses associated with participation in industry events, related sales collateral and email campaigns aimed at generating customer participation in webinars. There were no advertising expenses for the years ended December 31, 2020 and 2019, respectively.\niSign Solutions Inc.\nNotes to Consolidated Financial Statements\n(In thousands except per share amounts)\n1. Nature of Business, Basis of Presentation and Summary of Significant Accounting Policies (continued):\nNet loss per share:\nThe Company calculates net loss per share under the provisions of the relevant accounting guidance. That guidance requires the disclosure of both basic net loss per share, which is based on the weighted average number of shares outstanding, and diluted loss per share, which is based on the weighted average number of shares and dilutive potential shares outstanding.\nThe number of shares of Common Stock subject to outstanding options and shares issuable upon exercise of warrants excluded from the calculation of loss per share as their inclusion would be anti-dilutive are as follows:\nDecember 31,\nDecember 31,\nCommon Stock subject to outstanding options 1,338 1,077\nCommon Stock subject to outstanding warrants 3,001 2,536\nCommon stock subject to outstanding convertible debt plus accrued interest 6,761 5,439\nForeign currency assets and liabilities are translated into U.S. dollars at the end-of-period exchange rates except for long-term assets and liabilities, which are translated at historical exchange rates. Revenue and expenses are translated at the average exchange rates in effect during each period except for those expenses related to consolidated balance sheet amounts which are translated at historical exchange rates.\nNet foreign currency transaction gains and losses are included in interest and other income, net in the accompanying consolidated statements of operations. Foreign currency transaction gains and losses in 2020 and 2019 were insignificant.\nIncome taxes:\nDeferred tax assets and liabilities are recognized for the expected tax consequences of temporary differences between the tax bases of assets and liabilities and their financial statement reported amounts and for tax loss and credit carry-forwards. A valuation allowance is provided against deferred tax assets when it is determined to be more likely than not that the deferred tax asset will not be realized.\nForeign currency translation:\nThere have been no unrecognized tax benefits and, accordingly, there has been no effect on the Company’s financial condition or results of operations.\nThe Company files income tax returns in the U.S. federal jurisdiction and various state and foreign jurisdictions. The Company is no longer subject to U.S. federal tax examinations for years before 2011, and state tax examinations for years before 2010.\nThe Company’s policy is to recognize interest and penalties accrued on any unrecognized tax benefits as a component of income tax expense.\niSign Solutions Inc.\nNotes to Consolidated Financial Statements\n(In thousands except per share amounts)\n1. Nature of Business, Basis of Presentation and Summary of Significant Accounting Policies (continued):\nRecently issued accounting pronouncements:\nAccounting Standards Update No. 2020-01, Investments-Equity Securities (Topic 321), Investments-Equity Method and Joint Ventures (Topic 323), and Derivatives and Hedging (Topic 815), Clarifying the Interaction between Topic 321, Topic 323 and Topic 815. The amended guidance in this update was issued to clarify the interaction of the accounting for equity securities under Topic 321, Investments-Equity Securities; investments accounted for under the equity method of accounting in Topic 323, Investments-Equity Method and Joint Ventures; and the accounting for certain forward contracts and purchased options accounted for under Topic 815, Derivatives and Hedging. The amendments are effective for fiscal years beginning after December 15, 2020, including interim periods within those fiscal years.\nThe Company will evaluate the effects of ASU 2020-01 on the Company’s financial statements.\nAccounting Standards Update No. 2020-03, Codification Improvements to Financial Instruments. The Board decided to issue a separate update to improve various financial instruments Topics in the Codification to increase stakeholder awareness of the amendments and to clarify and improve the understandability of the guidance of Topics. The amendments are effective immediately.\nThe Company will evaluate the effects of ASU 2020-03 and do not anticipate it having a material impact.\nOther Accounting Standards Updates issued in 2020 are not currently applicable to the Company, therefore implementation would not be expected to have a material impact on the Company’s financial position, results of operations and cash flows.\n2. Concentrations:\nThe following table summarizes accounts receivable and revenue concentrations:\nAccounts Receivable\nAs of December 31, Total Revenue for the year\nended December 31,\n2019\nCustomer #1 - - 10 % 12 %\nCustomer #2 - - 23 % 17 %\nCustomer #3 23 % - 23 % 22 %\nCustomer #4 20 % 33 % - -\nCustomer #5 57 % 52 % 25 % 21 %\nCustomer #6 - 13 %\nTotal concentration 100 % 98 % 81 % 72 %\nThe following table summarizes sales concentrations:\nDecember 31,\nDecember 31,\nSales within the United States 75 % 80 %\nSales outside of the United States 25 % 20 %\nTotal 100 % 100 %\n3. Property and equipment:\nProperty and equipment, net at December 31, consists of the following:\nComputer equipment and software $ 24 $ 24\nLess accumulated depreciation and amortization (19 ) (16 )\n$ 5 $ 8\niSign Solutions Inc.\nNotes to Consolidated Financial Statements\n(In thousands except per share amounts)\n4. Accounts Payable and Other accrued liabilities:\nDuring the year ended December 31, 2020 the Company entered into settlement agreements with several of its vendors whereby the Company paid $150 in cash in settlement of approximately $313 in outstanding accounts payable. The settlement agreements discussed above resulted in gain of $163 recorded as other income in the statement of operations.\nThe Company records other liabilities based on reasonable estimates for expenses, or payables that are known or estimated including deposits, taxes, rents and services.\nThe Company had the following other accrued liabilities at December 31:\nAccrued interest $ 849 $ 549\nDelaware Franchise tax\nOther\nTotal $ 1,141 $ 814\n5. Other accrued liabilities (continued)\nThe Company had the following other long-term accrued liabilities at December 31:\nManagement fees $ 912 $ 770\nCommissions and deferred compensation\nTotal $ 957 $ 816\n6. Debt:\nAdvances:\nIn October 2019, the Company received, from an investor, an advance in the amount of $33 in cash against certain accounts receivable of the Company. Upon collection of the invoice, the Company agree to repay the advance to the lenders on a prorata basis together with a 5% advance fee. The receivable was collected and $33 of the advances were repaid in November 2019, along with $2 in advance fees per the agreement. The advance fee was recorded as interest expense in the fourth quarter ended December 31, 2019.\nIn January and March 2020, the Company received, from related parties and others, advances aggregating $150 in cash against certain accounts receivable of the Company. Upon collection of an invoice, the Company agreed to repay the advance to the lenders on a pro rata basis together with a 5% advance fee. On March 25, 2020, the related parties and others converted their advances into unsecured notes. The Company paid the advance fees of $8 in cash, and recorded them as interest expense in the quarter ended March 31, 2020.\nIn August and September 2020, the Company received, from two related parties, advances aggregating $83 in cash against certain accounts receivable of the Company. Upon collection of an invoice, the Company agreed to repay the advance to the lenders on a pro rata basis together with a 5% advance fee. The Company has accrued the advance fees of $4 which is included in interest expense in the quarter ended September 30, 2020.\nDuring the three months from October to December 2020, the Company received from related parties and others advances aggregating $120 in cash against certain accounts receivable. The Company agreed to repay the advance to the lenders on a pro rata basis together with a 5% advance fee. The Company repaid $20 of the advances in December 2020. The Company has accrued the advance fees of $6 which is included in interest expense in the quarter ended December 31, 2020.\niSign Solutions Inc.\nNotes to Consolidated Financial Statements\n(In thousands except per share amounts)\n7. Debt:\nNotes payable\nIn November 2016, the Company issued long-term unsecured convertible promissory notes to investors and affiliates of the Company aggregating $760 in cash. The Company also issued the same long-term notes to affiliates in exchange for an aggregate of $200 in demand notes that had been issued earlier in September and October of 2016. The long-term notes are mandatorily convertible into Common Stock at a conversion rate of the lesser of $0.50 per share (initially, $1.30 per share and subsequently reduced in connection with the May 2017 described below) or the price per share of Common Stock, upon closing a new debt and or equity financing of at least $1,000 in aggregate proceeds. In December 2018, the Company increased the interest rate on its unsecured notes from 6% to 10% beginning January 1, 2019. In December of 2020 the note holders agreed to extend the due date of the notes from December 31, 2020 to December 31, 2021. The Company issued warrants to purchase 277 shares of Common Stock in connection with these long-term notes. The Company ascribed a value of $204 to the 277 warrants and recorded a discount to the long-term notes and a corresponding amount to additional paid-in capital. The discount is being amortized using the effective interest method over the term of the notes.\nIn May 2017, the Company issued secured convertible promissory notes to investors and affiliates of the Company aggregating $325 in cash. In addition, certain investors and affiliates of the Company that had taken part in the November 2016 financing, and that also participated in the May 2017 financing, exchanged $450 of unsecured convertible promissory notes received in the November 2016 financing for $250 in secured notes with the same terms as the secured notes issued in the May 2017 financing and $200 in unsecured notes with the same terms as the November 2016 financing. The unsecured notes are mandatorily convertible into Common Stock at a conversion rate of the lesser of $0.50 per share or the price per share of Common Stock upon closing a new financing of at least $1,000 in aggregate proceeds. The unsecured notes bear interest at the rate of 6% per annum. The secured notes are mandatorily convertible into Common Stock at a conversion rate of the lesser of $0.50 per share or the price per share of Common Stock, upon closing a new financing of at least $1,000 in aggregate proceeds. The secured notes bear interest at the rate of 10% per annum and are secured by an interest in all the Company’s rights, title and interest in, to and under its intellectual property. Should the secured notes remain outstanding following the maturity date an additional 30% of the note’s principal amount shall become due and payable. In December 2018, the Company increased the interest rate on its unsecured notes from 6% to 10% beginning January 1, 2019. In December of 2020, the note holders agreed to extend the due date of the notes from December 31, 2020 to December 31, 2021.\nIn December 2017, the Company issued additional secured convertible promissory notes to investors and affiliates of the Company aggregating $150 in cash. The secured notes have substantially the same terms as the secured notes issued in the May 2017 financing.\nIn August 2018, the Company issued secured convertible promissory notes to investors and affiliates of the Company aggregating $341, of which $205 was paid in cash, $75 was exchanged for the remaining advances described above and $61 was in the form of an Original Issue Discount (“OID”) on these amounts. The secured notes are mandatorily convertible into Common Stock at a conversion rate of the lesser of $0.50 per share or the price per share of Common Stock upon closing a new financing of at least $1,000 in aggregate proceeds. The secured notes bear interest at the rate of 10% per annum and are secured by an interest in all the Company’s rights, title and interest in, to and under its intellectual property. Should the secured notes remain outstanding following the maturity date an additional 30% of the note’s principal amount shall become due and payable. In December of 2020, the note holders agreed to extend the due date of the notes from December 31, 2020 to December 31, 2021.\nIn December 2018, the Company issued short-term unsecured convertible promissory notes to investors and affiliates of the Company aggregating $346 in cash. The short-term notes are mandatorily convertible into Common Stock at a conversion rate of the lesser of $0.50 per share or the price per share of Common Stock, upon closing a new debt and/or equity financing of at least $1,000 in aggregate proceeds. The notes bear interest at the rate of 10% per annum. In December of 2020, the note holders agreed to extend the due date of the notes from December 31, 2020 to December 31, 2021.\niSign Solutions Inc.\nNotes to Consolidated Financial Statements\n(In thousands except per share amounts)\n7. Debt (continued):\nNotes Payable (continued)\nOn March 25, 2020, the Company issued an aggregate of $150 in unsecured notes to related parties and other investors. The Company received $75 in cash and $75 in exchange for advances on certain accounts receivable. The unsecured notes are convertible by the holder into common stock at any time at a price per share of $0.50. Upon closing a new financing of at least $1,000 in aggregate proceeds, the Company can force conversion at a price equal to the lesser of $0.50 per share or the price per share of the new financing. The notes bear interest at the rate of 10%per annum and are due December 31, 2021.\nOn May 6, 2020, the Company received loan proceeds in the amount of approximately $123 under the Paycheck Protection Program (“PPP”). The PPP, established as part of the Coronavirus Aid, Relief and Economic Security Act (“CARES Act”), provides for loans to qualifying businesses for amounts up to 2.5 times of the average monthly payroll expenses of the qualifying business. The Companies may apply for the loans and accrued interest to be forgiven after a period of either eight or twenty-four weeks, as long as the borrower uses the loan proceeds for eligible purposes, including payroll, benefits, rent and utilities, and maintains its payroll levels. The amount of loan forgiveness may be reduced if the borrower terminates employees or reduces salaries during the period in question. Under the terms of the related promissory note, the unforgiven portion of the PPP loan is payable over two years at an interest rate of 1%, with a deferral of payments for the first six months. The Company used the proceeds for purposes consistent with the PPP. While the Company currently believes that its use of the loan proceeds meet the conditions for forgiveness of the loan, we cannot assure you that we did not take actions that caused the Company to be ineligible for forgiveness of the loan, in whole or in part.\nOn June 19, 2020, the Company issued an additional unsecured note for $250,000. The note has the same terms and maturity date as the Company’s other unsecured notes.\nOn July 1, 2020 the Company entered into a settlement agreement with one of its vendors whereby the Company paid $135 in cash and issued a promissory note in the amount of $130 in settlement of approximately $537 in outstanding accounts payable. The note bears interest at the rate of 4% per annum and is due in installments of $40, $45 and $45 on or before the anniversary date of the note over the next three years. The settlement agreement discussed above resulted in gain of $272 recorded as other income in the statement of operations.\nDuring the twelve months ended December 31, 2019, the Company accrued $306 of interest expense, $271 associated with the notes, of which $104 was to related parties and $167 was to other investors.\nThe Company recorded $3 in debt discount amortization for the twelve months ended December 31, 2020 related to the above debt financings, $1 was to related parties and $2 was to other investors.\n8. Stockholders’ deficit:\nCommon stock options\nAt December 31, 2020, the Company has one stock-based employee compensation plan, the 2011 Stock Compensation Plan. The Company may also grant options to employees, directors and consultants outside of the 2011 plan under individual plans.\nInformation with respect to the Stock Compensation Plan at December 31, 2020 is as follows:\n2011 Stock Compensation Plan\nShares authorized for issuance 1,750\nOption vesting period Immediate/Quarterly over 3 years\nDate adopted by shareholders November 2011\nOption term 7 Years\nOptions outstanding 1,338\nOptions exercisable\nWeighted average exercise price $0.73\niSign Solutions Inc.\nNotes to Consolidated Financial Statements\n(In thousands except per share amounts)\n8. Stockholders’ deficit (continued):\nCommon stock options\nValuation and Expense Information:\nThe weighted-average fair value of stock-based compensation is based on the Black Scholes Merton valuation model. Forfeitures are estimated and it is assumed no dividends will be declared. The estimated fair value of stock-based compensation awards to employees is amortized over the vesting period of the options.\nThe Company granted 290 stock options during 2020 at a weighted average exercise price of $0.50 per share. The Company granted 40 stock options during 2019 at a weighted average exercise price of $0.50 per share. The fair value calculations for the stock options granted are based on the following assumptions:\nYear Ended\nDecember 31, 2020 Year Ended\nDecember 31, 2019\nRisk free interest rate 0.18 % 2.30 %\nExpected life (years) 6.4 6.1\nExpected volatility 164.00 % 191.65 %\nExpected dividends None None\nEstimated average forfeiture rate 2.15 % 23.6 %\nThe following table summarizes the allocation of stock-based compensation expense for the years ended December 31, 2020 and 2019. There were no stock options exercised during the years ended December 31, 2020 and 2019.\nDecember 31,\nDecember 31,\nResearch and development $ 7 $ 28\nGeneral and administrative\nDirector options and consultants\nStock-based compensation expense included in operating expenses $ 103 $ 189\nAs of December 31, 2020, there was $87 of total unrecognized compensation cost related to non-vested share-based compensation arrangements. The unrecognized compensation cost is expected to be recognized over a weighted average period of 1.6 years.\nThe cash flows from tax benefits for deductions in excess of the compensation costs recognized for share-based payment awards would be classified as financing cash flows. Due to the Company’s loss position, there were no such tax benefits during the year ended December 31, 2020.\niSign Solutions Inc.\nNotes to Consolidated Financial Statements\n(In thousands except per share amounts)\n8. Stockholders’ deficit (continued):\nCommon stock options\nThe summary activity for the Company’s 2011 Stock Compensation Plans is as follows:\nDecember 31, 2020 December 31, 2019\nShares Weighted\nAverage\nExercise\nPrice per\nshare Aggregate\nIntrinsic\nValue Weighted\nAverage\nRemaining\nContractual\nLife (in years) Shares Weighted\nAverage\nExercise\nPrice per\nshare Aggregate\nIntrinsic\nValue Weighted\nAverage\nRemaining\nContractual\nLife (in years)\nOutstanding at beginning of period 1,077 $ 1.59 $ -\n1,037 $ 1.65 $ -\nGranted $ 0.50 $ -\n$ 0.50 $ -\nForfeited/ Cancelled (29 ) $ 23.63 $ -\n- $ - $ -\nOutstanding at period end 1,338 $ 0.86 $ - 4.97 1,077 $ 1.59 $ - 4.97\nOptions vested and exercisable at period end $ 0.97 $ - 4.75 $ 2.18 $ - 4.75\nWeighted average grant-date fair value of options granted during the period $ 0.43\n$ 0.40\nThe following table summarizes significant ranges of outstanding and exercisable options as of December 31, 2020:\nOptions Outstanding Options Exercisable\nRange of Exercise Prices Options\nOutstanding Weighted\nAverage\nRemaining\nContractual\nLife (in years) Weighted\nAverage\nExercise\nPrice per\nshare Number\nOutstanding Weighted\nAverage\nExercise\nPrice per\nshare\n$0.01 - $25.00 1,325 4.58 $ 0.61 1,050 $ 0.63\n$25 - $625 1.02 $ 28.12 $ 38.56\n1,338 4.59 $ 0.87 1,077 $ 1.59\nA summary of the status of the Company’s non-vested shares as of December 31, 2020 is as follows:\nNon-vested Shares Shares Weighted\nAverage\nGrant-Date\nFair Value per\nshare\nNon-vested at January 1, 2019\nGranted\nCanceled/Forfeited - -\nVested (326 ) (341 )\nNon-vested at December 31, 2020\nAn employee or consultant desiring to exercise or convert his or her stock options must provide a signed notice of exercise to the Chief Financial Officer. Once the exercise is approved an issue order is sent to the Company’s transfer agent and by certificate or through other means of conveyance, the shares are delivered to the employee or consultant, generally within three business days.\nThe Company expects to make additional option grants in future years. The options issued to employees and directors will be subject to the same provisions outlined above, which may have a material impact on the Company’s financial statements.\niSign Solutions Inc.\nNotes to Consolidated Financial Statements\n(In thousands except per share amounts)\n8. Stockholders’ deficit (continued):\nTreasury Stock\nIn January 2012, the Company received 5 shares of Common Stock from Phoenix in settlement of a 16b claim brought by a Company stockholder against Phoenix, certain affiliates and the Company, as a nominal defendant. The Common Stock was valued at $325. In settlement of an indemnification claim brought by Phoenix in March 2012,resulting from the settlement of the 16b claim in January 2012, the Company issued to Phoenix 278 shares of Series C Preferred Stock valued at $417. The Company booked a $417 accretion amount for the beneficial conversion feature on the 278 shares of Series C Preferred Stock.\nWarrants\nOn February 6, 2019, the Company issued warrants to purchase 985 shares of common stock to 4 consultants and an employee in connection with the accrued compensation owed by the Company to the employee and consultants. The Company ascribed a value of $64 to the warrants using Black Scholes Merton pricing model. The warrant value is recorded in general and administrative expense in the Statement of Operations. The warrants are exercisable for three years with an exercise price of $0.50 per share. The warrants may not be exercised for cash or on a cashless basis, and may solely be exercised using the holder’s outstanding accrued compensation on the date of exercise. There were no warrant exercises in 2020 and 2019.\nOn January 28, 2020, the Company issued 30 warrants to a consultant for services. The warrants are exercisable for three years with an exercise price of $0.50 per share. The Company ascribed a value of $13 to the warrants which is based on the Black-Scholes-Merton valuation model. The warrant cost was charged to general and administrative expense during the period.\nOn July 9, 2020, the Company entered into a settlement agreement with a vendor. In addition to a cash payment the Company issued 10 warrants to purchase 10 shares of common stock in settlement of the outstanding accounts payable balance. The warrants are exercisable for five years with an exercise price of $0.50 per share. The Company ascribed a value of $3 to the warrants based on the Black-Scholes-Merton valuation model. The warrant cost was charged to general and administrative expense during the period.\nOn August 11, 2020, the Company issued warrants to purchase 425 shares of common stock to 2 consultants in connection with the accrued compensation owed by the Company to the consultants. The Company ascribed a value of $160 to the warrants using Black Scholes Merton pricing model. The warrant value are recorded in general and administrative expense in the Statement of Operations. The warrants are exercisable for three years from the date of grant with an exercise price of $0.50 per share. The above warrants may not be exercised for cash or on a cashless basis, and may solely be exercised using the holder’s outstanding accrued compensation on the date of exercise. There were no warrant exercises in 2020 and 2019.\nA summary of the warrant activity is as follows:\nDecember 31, 2020 December 31, 2019\nShares Weighted\nAverage\nExercise Price\nper share Shares Weighted\nAverage\nExercise Price\nper share\nOutstanding at beginning of period 2,536 $ 1.52 1,828 $ 2.16\nIssued $ 0.50 $ 0.50\nExpired - $ - (277 ) $ 1.63\nOutstanding at end of period 3,001 $ 1.37 2,536 $ 1.52\nExercisable at end of period 3,001 $ 1.37 2,536 $ 1.52\niSign Solutions Inc.\nNotes to Consolidated Financial Statements\n(In thousands except per share amounts)\n9. Stockholders’ deficit (continued):\nWarrants (continued)\nA summary of the status of the warrants outstanding as of December 31, 2020 is as follows:\nNumber of Shares Outstanding\nand Exercisable Weighted Average\nRemaining Life (in years) Weighted Average\nExercise Price per share\n2,536 0.67 $ 1.52\n2.65 $ 0.50\n3,001 0.98 $ 1.37\nAs of December 31, 2020, 4,339 shares of Common Stock were reserved for issuance upon exercise of outstanding options and warrants.\n10. Commitments and Contingencies:\nLease commitments\nThe Company maintains no leases. The Company rents approximately 160 square feet of office space in San Jose California. The office space is on a month to month rental basis and can be surrendered at any time without penalty. Office rent expense was approximately $36 and $34 in 2020 and 2019, respectively.\nLegal Contingencies\nThere are no material pending legal proceedings to which we are a party or to which any of our property is subject, nor are there any such proceedings known to be contemplated by governmental authorities. None of our directors, officers or affiliates is involved in a proceeding adverse to our business or has a material interest adverse to our business.\n11. Income taxes:\nManagement regularly assesses the ability to realize deferred tax assets recorded based upon the weight of available evidence, including such factors as recent earnings history and expected future taxable income on a jurisdiction by jurisdiction basis. In the event that the Company changes its determination as to the amount of realizable deferred tax assets, the Company will adjust its valuation allowance with a corresponding impact to the provision for income taxes in the period in which such determination is made. The Company’s management believes that, based on a number of factors, it is more likely than not, that all or some portion of the deferred tax assets will not be realized; and accordingly, for the year ended December 31, 2020, the Company has provided a valuation allowance against the Company’s U.S. net deferred tax assets.\nAt December 31, 2020, the Company had net operating loss carryforwards of $65,121 for federal income tax purposes which will begin to expire in 2021 if unused. The Company had net operating loss carryforwards for state income tax purposes of approximately $37,318. These state net operating losses carryforwards will begin to expire in the year 2028 if unused.\niSign Solutions Inc.\nNotes to Consolidated Financial Statements\n(In thousands except per share amounts)\n11. Income taxes (continued):\nDeferred tax assets and liabilities at December 31 consist of the following:\nDeferred tax assets:\nNet operating loss carry-forwards $ 16,281 $ 15,884\nAccruals and reserves\nDeferred revenue\nIntangibles\nOther, net\nFixed assets - -\nGross tax assets 17,123 16,858\nValuation allowance (17,123 ) (16,858 )\nRealizable deferred tax asset - -\nThe Company’s provision for income taxes differs from the amount computed by applying the statutory U.S. federal income tax rate to loss before taxes as follows for the years ended December 31, 2020 and December 31, 2019:\nThe components of the net deferred tax assets and liabilities are as follows:\nIncome tax benefit at the federal statutory rate $ (142 ) $ (228 )\nState income tax benefit (47 ) (77 )\nNOL expiration -\nPrior year true-ups (79 )\nPermanent items and other\nChange in valuation allowance (689 )\nIncome tax expense $ (1 ) $ (1 )\nA full valuation allowance has been established for the Company’s net deferred tax assets since the realization of such assets through the generation of future taxable income is uncertain.\nCurrent tax laws impose substantial restrictions on the utilization of net operating losses and credit carryforwards in the event of an “ownership change”, as defined by the Internal Revenue Code (IRC). If there should be an ownership change, the Company’s ability to utilize its carryforwards could be limited.\nOn March 27, 2020, the Coronavirus Aid, Relief, and Economic Security Act (“CARES Act”) was passed into law. The CARES Act includes several significant business tax provisions including modification to the taxable income limitation for utilization of net operating losses (“NOLs”) incurred in 2019 and 2020 and the ability to carry back NOLs from those years for a period of up to five years, an increase to the limitation on deductibility of certain business interest expense, bonus depreciation for purchases of qualified improvement property and special deductions on certain corporate charitable contributions. We analyzed the provisions of the CARES Act and determined there was no net effect on our provision for the year ended December 31, 2020\niSign Solutions Inc.\nNotes to Consolidated Financial Statements\n(In thousands except per share amounts)\n12. Subsequent events:\nOn February 12, 2021, the Company entered into a Note Purchase Agreement (the “Purchase Agreement”) with certain investors (each an “Investor,” and, collectively, the “Investors”). Under the terms of the Purchase Agreement, the Company received loans in the aggregate amount of $75,000 (the “Loans”) from the Investors in exchange for the Company’s issuance to each of the Investors of an unsecured convertible promissory note equal to the amount of such Investor’s loan contribution to the Company (each a “Note,” and, collectively, the “Notes”). The Loans consisted of $60,000 in cash and of $15,000 due under certain advances on accounts receivable received by the Company during the current quarter and exchanged into Notes under the Purchase Agreement. The Notes bear interest at the rate of 10% per annum, and have a maturity date of December 31, 2021. The Notes may be converted by their terms at the option of Investors into shares of the Company’s common stock.\nIn February the Company repaid to two investors an aggregate of $64,417 of prior advances on accounts receivable. The payments to the investors included $4,000 in advance fees.\nOn March 15 and March 16, 2021, the Company received advances on accounts receivable from two affiliates aggregating $20,000, and on March 19 2021, the Company received additional advances on accounts receivable from two affiliates aggregating $5,000. Upon collection of an invoice, the Company agreed to repay the advance to the lenders on a pro rata basis together with a 5% advance fee.\nThe Company may use any funds received from the Investors for working capital and general corporate purposes, in the ordinary course of business, and to pay fees and expenses in connection with the Company’s entry into the Purchase Agreement."
}