{
    "cik": "736012",
    "company": "INTRUSION INC",
    "filing_type": "10-K",
    "filing_date": "2021-03-09",
    "period_of_report": "2020-12-31",
    "sic": "3576",
    "state_of_inc": "DE",
    "state_location": "TX",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/736012/0001683168-21-000836-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/736012/000168316821000836/intrusion_10k-123120.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/736012/0001683168-21-000836.txt",
    "filename": "736012_10K_2020_0001683168-21-000836.htm",
    "item_1": "Item 1. Description of Business.\nOur Corporate Information\nWe were organized in Texas in September 1983 and reincorporated in Delaware in October 1995. Our principal executive offices are located at 101 East Park Boulevard, Suite 1300, Plano, Texas 75074, and our telephone number is (972) 234-6400. Our website URL is www.intrusion.com. References to the “Company”, “we”, “us”, “our”, “Intrusion” or “Intrusion Inc.” refer to Intrusion Inc. and its subsidiaries. TraceCop and Savant are trademarks of Intrusion Inc..\nOur Business\nWe develop, sell and support products that protect any-sized company or government organization by fusing advanced threat intelligence with real-time artificial intelligence to neutralize cyberattacks as they occur - including Zero-Day attacks. We market and distribute our solutions through a direct sales force and value-added resellers. Our end-user customers include U.S. federal government entities, state and local government entities, and companies ranging in size from mid-market to large enterprises.\nOur Solutions\nINTRUSION Shield tm\nINTRUSION Shield, our cornerstone cybersecurity solution is a comprehensive, real-time AI-based Security-as-a-Service that inspects and kills all dangerous network connections before they can do damage. What makes our approach unique is that it inspects every packet of inbound and outbound traffic and analyzes the reputation of the IP addresses (source and destination), the domain and ports it is communicating on, along with many other fields in the packet to neutralize malicious connections.\nMost breaches today are caused by malware free compromises that trigger no alarms in a firewall or endpoint solution. The common denominator is network , which Shield monitors and analyses, allowing Shield to identify and stop all attacks, even malware-free attacks. Shield’s capabilities continuously evolve based on constant machine learning and neural networking technology. Unlike traditional industry approaches that rely heavily on human mitigation and defensive approaches, which malicious actors and nation states have learned to bypass. Shield’s proprietary architecture isolates and neutralizes malicious traffic and network flows that existing solutions cannot identify before they harm a corporation or government organization.\nShield is designed as a next generation Network Detection and Response solution. After 30 years of providing research, analysis, tools and services to the federal government and enterprise corporations, Intrusion possesses a comprehensive and proprietary data set of petabytes of Internet traffic, including information about the activities of malicious online actors. Shield integrates this rich TraceCop data set with artificial intelligence (AI) and Savant real-time process flow technology to provide our customers with a unique and affordable tool to detect, identify, and neutralize cyberattacks. In particular, the Shield AI has been specifically trained to identify and stop Zero-Day attacks and ransomware, the most prolific and crippling forms of malware today.\nINTRUSION TraceCop TM\nINTRUSION TraceCop is our big data tool with extensive IP intelligence canvassing the entire Internet. It contains largest repository of reputation information on known good and known bad active IP addresses (both IPv4 and IPv6). TraceCop contains an inventory of network selectors and enrichments useful to support forensic investigations. The data contains a history of IPv4 and IPv6 block allocations and transfers, historical mappings of IP addresses to Autonomous Systems (ASNs) as observed through BGP, and approximately one billion historically registered domain names and registration context. TraceCop contains tens of billions of historic DNS resolutions of Fully Qualified Domain Names (FQDNs or hostnames) on each of these domains. Together, this shows relationships, hosting, and attribution for Internet resources. TraceCop also contains web server content surveys of content, such as natural language and topic of the content on hundreds of millions of websites and servers and OS fingerprints of services showing applications running on an IP. This context allows Shield to assess the use and purpose of an Internet resource. TraceCop also contains a history of threat and reputation for each hostname and IP address over time. All this makes it a very effective network forensics and cybersecurity analysis tool to inform Shield.\nINTRUSION Savant TM\nINTRUSION Savant is a network monitoring solution that leverages the rich data available in TraceCop to identify suspicious traffic in real-time. Savant uses several original patents to uniquely characterize and record all network flows. Savant is a network reconnaissance and attack analysis tool used by forensic analysts in the DoD, Federal Government and corporations with in-house threat research teams. For example, Savant users can create various automated rules to inspect packets matching (or not) certain criteria such as creating a rule to ensure the Source MAC address field in the Ethernet header and Source IP address from the IP header are always the same, failing which could indicate MAC or IP Spoofing in progress. Similarly, threat investigators can create rules using regular expressions by combining multiple fields in the packet headers. Ultimately, the rich capabilities of Savant provides the real-time analysis that Shield uses to make decisions on whether or not a packet is malicious.\nOur Intellectual Property and Licenses\nOur success and our ability to compete are dependent, in part, upon our proprietary technology. We principally rely on a combination of contractual rights, trade secrets and copyright laws to establish and protect our proprietary rights in our solutions. In addition, we have received two patents, and we are in the process of applying for patents for our Shield family of solutions. We have also entered into non-disclosure agreements with our suppliers, resellers, and certain customers to limit access to and disclosure of proprietary information. There can be no assurance that the steps taken by us to protect our intellectual property will be adequate to prevent misappropriation of our technology or that our competitors will not independently develop technologies that are substantially equivalent or superior to our technology, although it would be extremely difficult to replicate the proprietary and comprehensive internet databases we have developed over the past 24 years.\nWe have entered into software and solution license agreements with various suppliers. These license agreements provide us with additional software and hardware components that add value to our cybersecurity solutions. These license agreements do not provide proprietary rights that are unique or exclusive to us and are generally available to other parties on the same or similar terms and conditions, subject to payment of applicable license fees and royalties. We do not consider any of the solution license, software or supplier agreements to be material to our business, but rather complementary to our business and offerings.\nOur Competition\nThe market for network and data protection security solutions is intensely competitive and subject to frequent introductions of new technologies, and potentially improved price and performance characteristics. Industry suppliers compete in areas such as conformity to existing and emerging industry standards, interoperability with networking and other cybersecurity solutions, management and security capabilities, performance, price, ease of use, scalability, reliability, flexibility, features and technical support. The market for identity identification and data mining is highly fragmented and thus allows more opportunities for companies to compete.\nThere are numerous companies competing in various segments of the data security markets. At this time, we have little or no competitors for TraceCop; however, we expect competitors could emerge in the future. These competitors currently perform only a portion of the functions that we are able to perform with TraceCop. We have been continuously collecting the TraceCop data for more than twenty years, and we believe that none of our current or future competitors will have the ability to provide and reference this extremely valuable historical data. In our newest market segment, data mining and advanced persistent threat detection, we compete with several companies including Niksun, NetScout, FireEye, and Darktrace.\nWe expect that our Shield solution, as well as the complementary offerings in the Shield family, will be novel and unique in our industry because of its plug-n-play installation, proprietary threat-enriched big data cloud, real-time AI and monthly contract, will complement our customer’s existing cybersecurity processes and third-party solutions. When Shield receives widespread acceptance in our market, we anticipate that other businesses will seek to compete with Shield; however, we believe our existing, mature, and proprietary database which are integral to the operation of Shield will be difficult, if not impossible, for other companies in our industry to replicate and will be a significant barrier to entry of competitors in the near- and long-term future of cyber security solutions.\nOur Customers: Government Sales\nSales to U.S. government customers accounted for 86.3% of our revenues for the year ended December 31, 2020, compared to 87.4% of our revenue in 2019. Adverse effects from the proliferation of the COVID-19 virus have resulted in decreased demand by some of our customers for our current product offerings and cybersecurity solutions, negatively affecting our 2020 revenue levels. We expect to continue to derive a substantial portion of our revenues from sales to governmental entities in the future as we continue to market our entity identification products and data mining products to the government. Sales to the government present risks in addition to those involved in sales to commercial customers that could adversely affect our revenues, including potential disruption due to irregularities in or interruptions to appropriation and spending patterns, delays in approving a federal budget and the government’s reservation of the right to cancel contracts and purchase orders for its convenience.\nGenerally, we make our sales under purchase orders and contracts. Our customers, including government customers, may cancel their orders or contracts with little or no prior notice and without penalty. Although we transact business with various government entities, we believe that the cancellation of any particular order in itself could have a material adverse effect on our financial results. Because we derive and expect to continue to derive a substantial portion of our revenue from sales to government entities, a large number of cancelled or renegotiated government orders or contracts could have a material adverse effect on our financial results. Currently, we are not aware of any proposed cancellation or renegotiation of any of our existing arrangements with government entities.\nThird-Party Products\nWe currently resell standard commercially available computers and servers from various vendors which we integrate with our different software products for implementation into our customer networks. We do not consider any of these third party relationships to be material to the Company’s business or results of operations.\nCustomer Services\nOur solution sales may include installation and threat data interpretation.\nManufacturing and Supplies\nOur internal manufacturing operations consist primarily of software, packaging, testing and quality control of finished units. The hardware we sell are standard off-the-shelf solutions.\nSales, Marketing and Customers\nField Sales Force. Our direct sales organization focuses on major account sales, channel partners including distributors, value added resellers (VARs) and integrators; promotes our solutions to current and potential customers; and monitors evolving customer requirements. The field sales and technical support force provides training and technical support to our resellers and end users and assists our customers in designing cyber secure data networking solutions. We currently conduct sales and marketing efforts from our principal office in Plano (Dallas), Texas. In addition, we have sales personnel, sales engineers or sales representatives located in several other states.\nResellers. Resellers such as domestic and international system integrators and VARs sell our solutions as stand-alone solutions to end users and integrate our solutions with products sold by other vendors into network security systems that are sold to end users. Our field sales force and technical support organization provide support to these resellers. Our agreements with resellers are non- exclusive, and our resellers generally sell other products and solutions that may compete with our solutions. Resellers may place higher priority on products or solutions of other suppliers who are larger and have more name recognition, and there can be no assurance that resellers will continue to sell and support our solutions.\nForeign Sales. Export sales did not account for any revenue in 2020 and 2019.\nMarketing. We have implemented several methods to market our solutions, including participation in trade shows and seminars, distribution of sales literature and solution specifications and ongoing communication with our resellers and installed base of end-user customers.\nCustomers. Our end-user customers include U.S. federal government, state and local government entities, large and diversified conglomerates and manufacturing entities. Sales to certain customers and groups of customers can be impacted by seasonal capital expenditure approval cycles, and sales to customers within certain geographic regions can be subject to seasonal fluctuations in demand.\nIn 2020, 86.3 % of our revenue was derived from a variety of U.S. government entities through direct sales and indirectly through system integrators and resellers. These sales are attributable to five U.S. Government customers through direct and indirect channels; three exceeded 10% of total revenue individually in 2020. Comparatively, sales to the U.S. Government through direct and indirect channels totaled 87.4% of total revenues for 2019. Those sales were attributable to ten U.S. Government customers through direct and indirect channels; three exceeded 10% of total revenue individually in 2019. A reduction in our sales to U.S. government entities could have a material adverse effect on our business and operating results if not replaced.\nBacklog. We believe that only a small portion of our order backlog is non-cancelable, and that the dollar amount associated with the non-cancelable portion is immaterial. We purchase, or contract for the purchase of, our inventory based upon our forecast of customer demand, and we maintain inventories in advance of receiving firm orders from customers. Commercial orders are generally fulfilled within two days to two weeks following receipt of an order. Certain orders may be scheduled over several months, generally not exceeding one year.\nCustomer Support, Service and Warranty. We service, repair, and provide technical support for our solutions. Our field sales and technical support force works closely with resellers and end-user customers on-site and by telephone to assist with pre- and post- sales support services such as network security design, system installation and technical consulting. By working closely with our customers, our employees increase their understanding of end-user requirements and are then able to provide specific input in our solution development process.\nWe warrant all of our solutions against defects in materials and workmanship for periods ranging from 90 days to 36 months. Before and after expiration of the solution warranty period, we offer both on-site and factory-based support, parts replacement, and repair services. Extended warranty services are separately invoiced on a time and materials basis or under an annual maintenance contract.\nEmployees\nAs of December 31, 2020, we employed a total of 63 full time persons, including 23 in sales, marketing and technical support, 32 in research, development, analysis and engineering, and 8 in administration and finance.\nNone of our employees are represented by a labor organization, and we are not a party to any collective bargaining agreement. We have not experienced any work stoppages and consider our relations with our employees to be good.\nCompetition in the recruiting of personnel in the networking and data security industry is intense. We believe that our future success will depend in part on our continued ability to hire, motivate and retain qualified management, sales, marketing, and technical personnel. To date, we have not experienced significant difficulties in attracting or retaining qualified employees.",
    "item_1A": "Item 1A. Risk Factors\nWe had a net loss of $6.5 million for the year ended December 31, 2020, and we have an accumulated deficit of $61.3 million as of December 31, 2020. To improve our financial performance, we must increase revenue levels.\nFor the year ended December 31, 2020, we had a net loss of $6.5 million and had an accumulated deficit of approximately $61.3 million as of December 31, 2020, compared to a net income of $4.5 million for the year ended December 31, 2019 and an accumulated deficit of approximately $54.8 million at December 31, 2019. We need to increase current revenue levels from the sales of our solutions if we are to regain profitability. If we are unable to increase revenue levels, losses could continue for the near term and possibly longer, and we may not regain profitability or generate positive cash flow from operations in the future.\nWe may be unable to successfully market, promote, and sell our new commercial solution, INTRUSION Shield, and market it through new sales channels to a new set of prospective customers.\nWe anticipate significant resources will be required in order to succeed in launching our new Shield solution, including the time, attention, and focus of our senior management and our research and development team, coordination of new marketing strategies highlighting this new offering and promoting it through new and expanded sales channels to a wider audience of prospective customers than we have historically marketed and sold our solutions and services. In addition, significant financial resources will be required to successfully manage the implementation of this new solution. This could result in diversion of those resources from critical areas of our company operations and a potential strain on our liquidity and ability to meet our current and these anticipated increases in our cash-flow needs.\nWe could experience damage to our reputation in the cybersecurity industry in the event that our Shield solution fails to meet our customers’ needs or to achieve market acceptance.\nOur reputation in the industry as a provider of entity identification, data mining, and advanced persistent threat detection solutions may be harmed, perhaps significantly, in the event that Shield fails to perform as we expect it to. If Shield does not perform as we expect, if we experience delivery delays, or if our customers do not perceive the benefits of purchasing and using Shield as part of their comprehensive cybersecurity solution, our position as a leader in this technology space may be damaged and could affect the willingness of our customers, as well as potential customers, to purchase our other solutions that function separately from Shield. Any reputational damage could result in a decrease in orders for all of our solutions, the loss of current customers, and a decrease in our overall revenues which could in turn have a material adverse effect on our results of operation.\nThe effect of the coronavirus, particularly in the diversion of time and resources of the federal, state, and local governmental entities which make up a significant concentration of our customer base, have and may continue to cause material adverse effects on our operations and our financial results.\nA significant concentration of our federal, state, and local governmental customers have been forced to allocate scarce and competing resources and balance budgetary demands placed upon them as a result of the effects of the coronavirus, mandatory quarantines, decreased travel, interruptions in workforce populations, scarcity of commodities, and similar economic and operational effects of the virus upon their own constituencies. Considerable uncertainties continue with respect to the spread and containment of the pandemic, including, without limitation, the effects of mutations in the virus and the efficacy of vaccination efforts throughout the country and the world. These adverse effects have resulted in decreased demand by some of our customers for our current product offerings and cybersecurity solutions, negatively affecting historic revenue levels for the Company. In turn, we are continuing to adapt our operations and the efficiency of our own staff, employees, and strategic partners, including increased reliance on remote workplace solutions during 2020 and continuing indefinitely into 2021. A continued decrease in orders for our solutions by our government customers and losses of efficiency or diversions of resources in our own operations may continue to cause material adverse effect on our operations and financial results, which may not be offset even with the successful introduction of Shield solution into the marketplace.\nWe must expend time and resources addressing potential cybersecurity risk, and any breach of our information security safeguards could have a material adverse effect on the Company.\nThe threat of cyber-attacks requires additional time and money to be expended in efforts to prevent any breaches of our information security protocols. However, we can provide no assurances that we can prevent all such attempts from being successful, which could result in expenses to address and remediate such breaches as well as potentially losing the confidence of our customers who depend upon our services to prevent and mitigate such attacks on their respective business. Should a material breach of our information security systems occur, it would likely have a material adverse impact on our business operations, our customer relations, and our current and future sales prospects, resulting in a significant loss of revenue.\nFluctuations in our quarterly revenues may cause the price of our common stock to decline.\nOur operating results have varied significantly from quarter to quarter in the past, and we expect our operating results to vary from quarter to quarter in the future due to a variety of factors, many of which are outside of our control. Therefore, if revenues are below our expectations, this shortfall is likely to adversely and disproportionately affect our operating results. Accordingly, we may not attain positive operating margins in future quarters. Any of these factors could cause our operating results to be below the expectations of securities analysts and investors, which likely would negatively affect the price of our common stock.\nA large percentage of our current revenues are received from U.S. government entities, and the loss of these customers or our failure to widen the scope of our customer base to include general commercial enterprises could negatively affect our revenues.\nA large percentage of our current revenues result from sales to U.S. government entities. If we were to lose one or more of these customers, our revenues could decline and our business and prospects may be materially harmed. Further, sales to the government present risks in addition to those involved in sales to commercial customers, including potential disruption due to appropriation and spending patterns, delays in approving a federal budget and the government’s right to cancel contracts and purchase orders for its convenience. While we expect that developing relationships with non-governmental customers will mitigate or eliminate this dependence on, and risk from, serving governmental entities, we can offer no assurances that we will be able to sufficiently diversify our customer portfolio in a time and manner to adequately mitigate this risk.\nAlmost all of our existing revenues are currently from one family of solutions with a limited number of customers, and the decrease of revenue from sales of this family of solutions could materially harm our business and prospects. Timeliness of orders from customers may cause volatility in growth.\nAlmost all of our existing revenues result from sales of one cybersecurity solution. TraceCop revenues were $6.2 million for the year ended December 31, 2020, compared to $13.4 million for the year ended December 31, 2019. While we anticipate the introduction of our new Shield solution will reduce our dependence on this single solution, we can offer no assurances as such, and in the absence of a shift in solution mix, we may continue to face risks in the event that sales of this key solution to these limited customers were to decrease.\nWe are highly dependent on sales of our current solutions through indirect channels, the loss of which would materially adversely affect our operations.\nFor the years ended December 31, 2019 and 2020, we derived 70.3% and 49.3% of our revenues from sales through indirect sales channels, such as distributors, value-added resellers, system integrators, original equipment manufacturers and managed service providers. We must expand sales of our current solutions as well as any new solutions, such as Shield, through these indirect channels in order to increase our revenues. We cannot assure you that our current solutions or future solutions will gain market acceptance in these indirect sales channels or that sales through these indirect sales channels will increase our revenues. Further, many of our competitors are also trying to sell their products and solutions through these indirect sales channels, which could result in lower prices and reduced profit margins for sales of our solutions.\nYou will experience substantial dilution upon the exercise of certain stock options currently outstanding.\nOn February 12, 2021, we had 17,538,779 shares of common stock outstanding. Upon the exercising of current options exercisable at or below the exercise price of $4.75, we would have approximately 18,014,116 shares of common stock outstanding, a 2.71% increase in the number of shares of our common stock outstanding.\nWe resemble a developmental stage company and our business strategy may not be successful.\nWe depend exclusively on revenues generated from the sale of our current network security/advanced persistent threat detection solution (Savant), which has received limited market acceptance, and our entity identification, data mining and analytic solution (TraceCop). We can provide no assurances that these solutions or our newly developed Shield solution will ever achieve widespread market acceptance or that an adequate market for these solutions will ever emerge. Consequently, we resemble a developmental stage company and will face the following inherent risks and uncertainties:\n· the need for our current and in-development solutions to achieve market acceptance and produce a sustainable revenue stream;\n· our ability to manage costs and expenses;\n· our dependence on key personnel;\n· our ability to obtain financing on acceptable terms; and\n· our ability to offer greater value than our competitors.\nOur business strategy may not successfully address these risks. If we fail to recognize significant revenues from the sales of our current and in-development solutions, our business, financial condition and operating results would be materially adversely affected.\nIf we fail to respond to rapid technological changes in the network security industry, we may lose customers or our solutions may become obsolete.\nThe network security industry is characterized by frequent product and service introductions, rapidly changing technology and continued evolution of new industry standards. We have and must continue to introduce upgrades to our current solutions rapidly in response to customer needs such as new computer viruses or other novel external attacks on computer networks. Further, our new Shield solution represents our efforts to continue to provide state-of-the art first-in-time innovation for our customer’s cybersecurity solutions. As a result, our success depends upon our ability to develop and introduce timely upgrades, enhancements, and new solutions to meet evolving customer requirements and industry standards. The development of technologically advanced network security products and solutions is a complex and uncertain process requiring high levels of innovation, rapid response, and accurate anticipation of technological and market trends. We cannot assure you that we will be able to identify, develop, manufacture, market or support new or enhanced solutions successfully in a timely manner. Further, we or our competitors may introduce new solutions or enhancements that shorten the life cycle of our existing solutions or cause our existing solutions to become obsolete.\nWe face intense competition from both start-up and established companies that may have significant advantages over us and our solutions.\nThe market for our solutions is intensely competitive. There are numerous companies competing with us in various segments of the data security markets, and their products or solutions may have advantages over our solutions in areas such as conformity to existing and emerging industry standards, interoperability with networking and other cybersecurity products, management and security capabilities, performance, price, ease of use, scalability, reliability, flexibility, features, and technical support.\nOur principal competitors in the data mining and advanced persistent threat market include Niksun, NetScout, FireEye, and Darktrace. Our current and potential competitors may have one or more of the following significant advantages over us:\n· greater financial, technical and marketing resources;\n· better name recognition;\n· more comprehensive security solutions;\n· better or more extensive cooperative relationships; and\n· larger customer base.\nWe cannot assure you that we will be able to compete successfully with our existing or new competitors. Some of our competitors may have, in relation to us, one or more of the following:\n· longer operating histories;\n· longer-standing relationships with OEM and end-user customers; and\n· greater customer service, public relations and other resources.\nAs a result, these competitors may be able to more quickly develop or adapt to new or emerging technologies and changes in customer requirements, or devote greater resources to the development, promotion and sale of their products or solutions. Additionally, it is likely that new competitors or alliances among existing competitors could emerge and rapidly acquire significant market share.\nOur management and larger stockholders currently exercise significant control over our Company and such influence may be in conflict to your interests.\nAs of February 12, 2021, our executive officers and directors beneficially own approximately 8.7% of our voting power. In addition, other related affiliate parties control approximately 47.5% of voting power. As a result, these stockholders have been able to exercise significant control over all matters requiring stockholder approval, including the election of directors and approval of significant corporate transactions. Although we follow our policies regarding related party transactions, we cannot entirely eliminate the influence of these stockholders as long as they hold such a concentration of the voting power of our common stock.\nOur solutions are highly technical and if they contain undetected errors, our business could be adversely affected and we might have to defend lawsuits or pay damages in connection with any alleged or actual failure of our solutions and services.\nOur solutions are highly technical and complex, are critical to the operation of many networks and, in the case of ours, provide and monitor network security and may protect valuable information. Our solutions have contained and may contain one or more undetected errors, defects or security vulnerabilities. Some errors in our solutions may only be discovered after a solution has been installed and used by end customers. Any errors or security vulnerabilities discovered in our solutions after commercial release could result in loss of revenues or delay in revenue recognition, loss of customers and increased service and warranty cost, any of which could adversely affect our business and results of operations. In addition, we could face claims for product liability, tort, or breach of warranty. Defending a lawsuit, regardless of its merit, is costly and may divert management’s attention. In addition, if our business liability insurance coverage is inadequate or future coverage is unavailable on acceptable terms or at all, our financial condition could be harmed.\nA breach of network security could harm public perception of our cybersecurity solutions, which could cause us to lose revenues.\nIf an actual or perceived breach of network security occurs in the network of a customer of our cybersecurity solutions, regardless of whether the breach is attributable to our solutions, the market perception of the effectiveness of our solutions could be harmed. This could cause us to lose current and potential end customers or cause us to lose current and potential value-added resellers and distributors. Because the techniques used by computer hackers to access or sabotage networks change frequently and generally are not recognized until launched against a target, we may be unable to anticipate these techniques.\nIf our solutions do not interoperate with our customers’ networks, installations will be delayed or cancelled and could harm our business.\nOur solutions are designed to interface with our customers’ existing networks, each of which have different specifications and utilize multiple protocol standards and products or solutions from other vendors. Many of our customers’ networks contain multiple generations of products that have been added over time as these networks have grown and evolved. Our solutions will be required to interoperate with many products and solutions within these networks as well as future products or solutions in order to meet our customers’ requirements. If we find errors in the existing software or defects in the hardware used in our customers’ networks, we may have to modify our software or hardware to fix or overcome these errors so that our solutions will interoperate and scale with the existing software and hardware, which could be costly and negatively impact our operating results. In addition, if our solutions do not interoperate with those of our customers’ networks, demand for our solutions could be adversely affected, orders for our solutions could be cancelled, or our solutions could be returned. This could hurt our operating results, damage our reputation and seriously harm our business and prospects.\nWe must adequately protect our intellectual property in order to prevent loss of valuable proprietary information.\nWe rely primarily on a combination of patent, copyright, trademark and trade secret laws, confidentiality procedures, and non-disclosure agreements to protect our proprietary technology. However, unauthorized parties may attempt to copy or reverse- engineer aspects of our solutions or to obtain and use information that we regard as proprietary. Policing unauthorized use of our solutions is difficult, and we cannot be certain that the steps we have taken will prevent misappropriation of our intellectual property. This is particularly true in foreign countries whose laws may not protect proprietary rights to the same extent as the laws of the United States and may not provide us with an effective remedy against unauthorized use. If protection of our intellectual property proves to be inadequate or unenforceable, others may be able to use our proprietary developments without compensation to us, resulting in potential cost advantages to our competitors.\nWe may incur substantial expenses defending ourselves against claims of infringement.\nThere are numerous patents held by many companies relating to the design and manufacture of network security systems. Third parties may claim that our solutions infringe on their intellectual property rights. Any claim, with or without merit, could consume our management’s time, result in costly litigation, cause delays in sales or implementations of our solutions or require us to enter into royalty or licensing agreements. Royalty and licensing agreements, if required and available, may be on terms unacceptable to us or detrimental to our business. Moreover, a successful claim of product infringement against us or our failure or inability to license the infringed or similar technology on commercially reasonable terms could seriously harm our business.\nThe price of our common stock has been volatile in the past and may continue to be volatile in the future due to factors outside of our control.\nThe market price of our common stock has been highly volatile in the past and may continue to be volatile in the future. Our common stock was traded on the OTCQB until October 9, 2020, when it began trading on the Nasdaq Capital Market. For the twelve months ended December 31, 2020, the market price of our common stock fluctuated between $2.70 and $19.09. The market value of our common stock may fluctuate significantly in the future in response to a number of factors, some of which are outside our control, including:\n· variations in our quarterly operating results;\n· changes in estimates of our financial performance by securities analysts;\n· changes in market valuations of our competitors;\n· thinly traded common stock;\n· our ability to successfully produce, market, and sell our new Shield solution through new and broader sales channels to an expanded potential client market;\n· announcements by us or our competitors of new products or solutions, significant contracts, acquisitions, strategic relationships, joint ventures or capital commitments;\n· product or design flaws, product recalls or similar occurrences;\n· additions or departures of key personnel;\n· sales of common stock in the future; and\n· fluctuations in stock market prices and volume, which are relatively typical for high technology companies.",
    "item_1B": "",
    "item_2": "Item 2. Properties\nOur corporate headquarters are currently located in 8,331 square feet of space at 101 East Park Blvd, Suite 1300, Plano Texas. This facility houses our corporate administration, sales and marketing. The lease for this facility extends until September 2023. The Company vacated its previous space in Richardson, Texas beginning in the fourth quarter of 2020. The lease for this 23,000 square foot facility extends through November 2024 and is the subject of a lawsuit the Company filed against the landlord on February 16, 2021. We have charged this landlord with breach of contract, constructive eviction, and we have requested a declaratory judgment relieving us of any further payment obligations under this lease.\nFor a variety of reasons, the Company encouraged its Texas based engineers and analysts to work remotely beginning in fourth quarter 2020. Approximately 13 percent of our security software research and development and engineering staff are currently working remotely from home offices in California. We have one small facility in San Marcos, California under a lease and expiring in March 2021. We have one engineer working from home in New Mexico.\nWe believe that the existing facilities will be adequate to meet our operational requirements through 2021, although we periodically review our leased space to in order to ensure such space is secure and suitable for our current and future needs. We believe that all such facilities are adequately covered by appropriate property insurance. See Note 4 to our Consolidated Financial Statements for additional information regarding our obligations under leases.",
    "item_3": "Item 3. Legal Proceedings.\nOn February 16, 2021, Intrusion Inc. instituted legal proceedings in the District Court of Dallas County, Texas, 14th Judicial District against Purple Plaza LLC, the landlord for the facilities we previously occupied in Richardson, Texas. This lawsuit claims damages for breach of contract for, among other things, failure to maintain and repair the leased facilities and to provide adequate heating, air conditioning, and ventilation on the premises, resulting in a constructive eviction. Intrusion is seeking damages in excess of $1,000,000 together with a declaratory judgment that any of Intrusion’s remaining obligations under the lease have terminated. The landlord filed a general denial on March 5, 2021.\nIn addition to this pending litigation, we are subject to various other legal proceedings and claims that may arise in the ordinary course of business. We do not believe that any claims exist where the outcome of such matters would have a material adverse effect on our consolidated financial position, operating results or cash flows. However, there can be no assurance such legal proceedings will not have a material impact on future results.\nPART II",
    "item_4": "",
    "item_5": "Item 5. Market for Common Equity and Related Stockholder Matters and Business Issuer Purchases of Equity Securities. - Intrusion Equity Accounting\nOur common stock trades on the Nasdaq Capital Market, where it is currently listed under the symbol “INTZ.” As of February 12, 2021, there were approximately 105 registered holders of record of our common stock. Quotations on the OTCQB reflect inter-dealer prices, without retail mark-up, mark-down or commission and may not represent actual transactions.\nAll stock option plans under which our common stock is reserved for issuance have previously been approved by our stockholders. The following table provides summary information as of December 31, 2020 for all of our equity compensation plans (in thousands, except per share data). See Note 9 to our consolidated financial statements for additional discussion.\nNumber of shares of\ncommon stock to be\nissued upon exercise\nof outstanding\noptions Weighted average\nexercise price of\noutstanding options No. of shares of\ncommon stock\nremaining available\nfor future issuance\nunder equity\ncompensation plans\nEquity compensation plans approved by security holders 1 1,035 2.87\nEquity compensation plans not approved by security holders - - -\nTotal 1,035 2.87\n__________________\n(1) Included in the outstanding options are 526,000 from the 2005 Stock Incentive Plan and 509,000 from the 2015 Stock Option Plan.",
    "item_6": "",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nOur Business\nWe develop, sell and support products that protect any-sized company or government organization by fusing advanced threat intelligence with real-time artificial intelligence to neutralize cyberattacks as they occur - including Zero-Day attacks. We market and distribute our solutions through a direct sales force and value-added resellers. Our end-user customers include U.S. federal government entities, state and local government entities, and companies ranging in size from mid-market to large enterprises.\nOur Solutions\nINTRUSION Shield\nINTRUSION Shield, our cornerstone cybersecurity solution is a comprehensive, real-time AI-based Security-as-a-Service that inspects and kills all dangerous network connections before they can do damage. What makes our approach unique is that it inspects every packet of inbound and outbound traffic and analyzes the reputation of the IP addresses (source and destination), the domain and ports it is communicating on, along with many other fields in the packet to neutralize malicious connections.\nMost breaches today are caused by malware free compromises that trigger no alarms in a firewall or endpoint solution. The common denominator is network communications, which Shield monitors and analyses, allowing Shield to identify and stop all attacks, even malware-free attacks. Shield’s capabilities continuously evolve based on constant machine learning and neural networking technology. Unlike traditional industry approaches that rely heavily on human mitigation and defensive approaches, which malicious actors and nation states have learned to bypass, Shield’s proprietary architecture isolates and neutralizes malicious traffic and network flows that existing solutions cannot identify before they harm a corporation or government organization.\nShield is designed as a next generation Network Detection and Response solution. After 30 years of providing research, analysis, tools and services to the federal government and enterprise corporations, Intrusion possesses a comprehensive and proprietary data set of petabytes of Internet traffic, including information about the activities of malicious online actors. Shield integrates this rich TraceCop data set with artificial intelligence (AI) and Savant real-time process flow technology to provide our customers with a unique and affordable tool to detect, identify, and neutralize cyberattacks. In particular, the Shield AI has been specifically trained to identify and stop Zero-Day attacks and ransomware, the most prolific and crippling forms of malware today.\nINTRUSION TraceCop\nINTRUSION TraceCop is our big data tool with extensive IP intelligence canvassing the entire Internet. It contains largest repository of reputation information on known good and known bad active IP addresses (both IPv4 and IPv6). TraceCop contains an inventory of network selectors and enrichments useful to support forensic investigations. The data contains a history of IPv4 and IPv6 block allocations and transfers, historical mappings of IP addresses to Autonomous Systems (ASNs) as observed through BGP, and approximately one billion historically registered domain names and registration context. TraceCop contains tens of billions of historic DNS resolutions of Fully Qualified Domain Names (FQDNs or hostnames) on each of these domains. Together, this shows relationships, hosting, and attribution for Internet resources. TraceCop also contains web server content surveys of content, such as natural language and topic of the content on hundreds of millions of websites and servers and OS fingerprints of services showing applications running on an IP. This context allows Shield to assess the use and purpose of an Internet resource. TraceCop also contains a history of threat and reputation for each hostname and IP address over time. All this makes it a very effective network forensics and cybersecurity analysis tool to inform Shield.\nINTRUSION Savant\nINTRUSION Savant is a network monitoring solution that leverages the rich data available in TraceCop to identify suspicious traffic in real-time. Savant uses several original patents to uniquely characterize and record all network flows. Savant is a network reconnaissance and attack analysis tool used by forensic analysts in the DoD, Federal Government and corporations with in-house threat research teams. For example, Savant users can create various automated rules to inspect packets matching (or not) certain criteria such as creating a rule to ensure the Source MAC address field in the Ethernet header and Source IP address from the IP header are always the same, failing which could indicate MAC or IP Spoofing in progress. Similarly, threat investigators can create rules using regular expressions by combining multiple fields in the packet headers. Ultimately, the rich capabilities of Savant provides the real-time analysis that Shield uses to make decisions on whether or not a packet is malicious.\nCritical Accounting Policies and Estimates\nManagement’s discussion and analysis of financial condition and results of operations are based upon our consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States. The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. On an on-going basis, we evaluate our estimates, including those related to product returns, bad debts, inventories, income taxes, warranty obligations, maintenance contracts and contingencies. We base our estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nWe believe the following critical accounting policies affect our more significant judgments and estimates used in the preparation of our consolidated financial statements.\nRevenue Recognition\nWe generally recognize product revenue upon shipment or after meeting certain performance obligations. These products can include hardware, perpetual software licenses and data sets. Data set updates are the majority of sales. We do not currently offer software on a subscription basis. Warranty costs and sales returns for our current products have not been material.\nWe recognize sales of our data sets in accordance with FASB ASC Topic 606 whereby revenue from contracts with customers is not recognized until all five of the following have been met:\n· identify the contract with a customer;\n· identify the performance obligations in the contract;\n· determine the transaction price;\n· allocate the transaction price to the separate performance obligations; and\n· recognize revenue upon satisfaction of a performance obligation.\nData updates are typically done monthly, and revenue will be matched accordingly. Product sales may include maintenance and customer support allocated revenue in an arrangement using estimated selling prices of the delivered goods and services based on a selling price hierarchy using the relative selling price method. All of our solution offering and service offering market values are readily determined based on current and prior stand-alone sales. We may defer and recognize maintenance, updates and support revenue over the term of the contract period, which is generally one year.\nService revenue, primarily including maintenance, training and installation, are recognized upon delivery of the service and typically are unrelated to product sales. To date, maintenance, training and installation revenue has not been material. Our normal payment terms offered to customers, distributors and resellers are net 30 days domestically and net 45 days internationally. We do not offer payment terms that extend beyond one year and rarely do we extend payment terms beyond our normal terms. If certain customers do not meet our credit standards, we do require payment in advance to limit our credit exposure.\nShipping and handling costs are billed to the customer and included in product revenue. Shipping and handling expenses are included in cost of product revenue.\nAllowances for Doubtful Accounts\nWe maintain allowances for doubtful accounts for estimated losses resulting from the inability of our customers to make required payments. Our receivables are uncollateralized, and we expect to continue this policy in the future. If the financial condition of our customers were to deteriorate, resulting in an impairment of their ability to make payments, increased allowances may be required. Historically, our estimates for sales returns and doubtful accounts have not differed materially from actual results.\nFair Value of Financial Instruments\nWe calculate the fair value of our assets and liabilities which qualify as financial instruments and include additional information in the notes to consolidated financial statements when the fair value is different than the carrying value of these financial instruments. The estimated fair value of accounts receivable, accounts payable and accrued expenses, and dividends payable approximate their carrying amounts due to the relatively short maturity of these instruments. Financing leases and PPP loan approximate fair value as they bear market rates of interest.\nResults of Operations\nThe following tables set forth, for the periods indicated, certain financial data as a percentage of net revenue.\nYear Ended December 31,\nNet product revenue 100.0 % 100.0 %\nTotal cost of revenue 40.9 39.2\nGross profit 59.1 60.8\nOperating expenses:\nSales and marketing 57.7 9.5\nResearch and development 57.4 9.6\nGeneral and administrative 42.5 8.7\nOperating income (loss) (98.5 ) 33.0\nInterest expense (0.1 ) (0.3 )\nInterest income 0.1 -\nIncome (loss) from operations before income taxes (98.5 ) 32.7\nIncome tax provision - -\nNet income (loss) (98.5 ) 32.7\nPreferred stock dividends accrued (1.2 ) (1.0 )\nNet income (loss) attributable to common stockholders (99.7 )% 31.7 %\n2020 compared with 2019\nNet Revenue\nTotal revenue decreased 51.5% to $6.6 million in 2020 from $13.6 million in 2019. We did not meet sales projections for our TraceCop product line. We expect our product revenues to increase in the future if we can increase sales to existing customers and add new customers.\nThere were no export sales in 2020 and 2019 primarily due to our focus on domestic revenue sales. Sales of our products internationally may be subject to currency exchange risk, which may cause our products to effectively increase in price, if the exchange rate moves significantly and the dollar gains value over the foreign currency.\nHistorically, due to the timing of our sales cycle, a significant portion of our monthly sales occurs in the second half of the month. Accordingly, our receivables increase at the end of each month, which causes a higher accounts receivable balance at month end. This monthly trend also causes an inflated comparative relationship between revenue and accounts receivable. We believe that this monthly trend will continue because monthly sales forecast and planning meetings are held in the first week of every month, the middle of the month is focused on sales calls to customers and the latter half of the month on closing sales.\nGross Profit\nGross profit decreased 52.9% to $3.9 million in 2020 from $8.3 million in 2019. As a percentage of net revenue, gross profit decreased from 60.8% in 2019 to 59.1% in 2020. Gross profit as a percentage of revenue, decreased in 2020 compared to 2019 because of higher labor costs related to certain projects.\nGross profit as a percentage of net revenue is impacted by several factors, including shifts in product mix, changes in channels of distribution, sales volume, fluctuations in manufacturing costs, labor costs, pricing strategies, and fluctuations in sales of integrated third-party products.\nSales and Marketing\nSales and marketing expenses increased to $3.8 million or 57.7% of net revenue in 2020, compared to $1.3 million or 9.5% of net revenue in 2019. The increase in sales and marketing expense was primarily two activities: building, training, and preparing a sales department to sell our new commercial product in 2021; and applying a dedicated $1.2 million marketing and promotion budget. Sales and marketing expenses may vary in the future. We expect sales and marketing expenses to increase if net revenue levels increase in 2021.\nResearch and Development\nResearch and development expenses increased to $3.8 million or 57.4% of net revenue in 2020 compared to $1.3 million or 9.6% of net revenue in 2019. The increase in research and development expense was due to less labor expense shifted to direct labor costs. Our research and development costs are expensed in the period in which they are incurred. We expect research and development expenses to increase if we are able to increase net revenue levels in 2021. Research and development expense levels may fluctuate due to labor expense shifting to direct labor.\nGeneral and Administrative\nGeneral and administrative expenses increased to $2.8 million, or 42.5% of net revenue in 2020 compared to $1.2 million or 8.7% of net revenue in 2019. This was primarily a result of a non-cash write off for a $1.1 million abandoned operating lease asset. Other contributing expenses were related to increases in administrative and Human Resources. Excluding the $1.1 million non-cash write off for the abandonment of prior office lease, we expect general and administration expenses to remain constant but increase if net revenue levels increase in 2021.\nInterest Expense\nInterest expense decreased to $6 thousand in 2020, compared to $46 thousand in 2019. Interest expense decreased due to a combination of a zero balance under an unsecured revolving promissory note to borrow up to $3,700,000 from G. Ward Paxton, the Company’s former Chief Executive Officer (the “CEO Note”) and declining balances in financial leases and remained steady for operating leases. Interest expense will vary in the future based on our cash flow and borrowing needs.\nInterest Income\nInterest income earned on bank deposits was $11 thousand in 2020 compared to $4 thousand in 2019.\nIncome Taxes\nOur effective income tax rate was 0% in 2020 and 2019 as valuation allowances have been recorded for the entire amount of the net deferred tax assets due to uncertainty of realization. On December 22, 2017, the U.S. enacted the Tax Cuts and Jobs Act (“the Tax Act”) which significantly changed U.S. tax law. The Tax Act lowered the Company’s statutory federal income tax rate from a maximum of 39% to a rate of 21% effective January 1, 2018.\nLiquidity and Capital Resources\nOur principal source of liquidity at December 31, 2020 was $16.7 million of cash and cash equivalents. As of December 31, 2020, we did not hold investments with a stated maturity beyond one year. Working capital at December 31, 2020 was $16.2 million, while at December 31, 2019, it was $3.1 million.\nNet cash used in operations for the twelve months ended December 31, 2020, was $5.2 million due primarily to a net loss of $6.5 million and the following uses of cash: a $339 thousand decrease in deferred revenue, a $258 thousand increase in prepaid expenses and other assets, and a $334 thousand decrease in accounts payable and accrued expenses. This was partially offset by these sources of cash and non-cash items: a $1.1 million non-cash write-off for an abandoned operating lease asset, a $333 thousand decrease in accounts receivable, $322 thousand in stock-based compensation, $231 thousand in depreciation expense and amortization expense, and $294 thousand in noncash lease costs.\nNet cash provided by operations for the twelve months ended December 31, 2019, was $4.3 million due primarily to a net income of $4.5 million and the following sources of cash and non-cash items: $232 thousand in noncash lease costs, a $401 thousand decrease in accounts receivable, $184 thousand in depreciation expense and amortization expense, $47 thousand in stock-based compensation, and $6 thousand in waived penalties on dividends. This was partially offset by a $496 thousand decrease in accounts payable and accrued expenses, a $488 thousand decrease in deferred revenue, and a $61 thousand increase in prepaid expenses and other assets. Future fluctuations in accounts receivable, inventory balances and accounts payable will be dependent upon several factors, including quarterly sales, timely collection of accounts receivable, and the accuracy of our forecasts of product demand and component requirements.\nNet cash used in investing activities in 2020 was $320 thousand for purchases of property and equipment. Net cash used in investing activities in 2019 was $260 thousand for purchases of property and equipment.\nNet cash provided by financing activities in 2020 was $18.9 million with proceeds of $18.2 million from a stock offering, $629 thousand from a PPP loan, and proceeds from exercise of stock options of $209 thousand. This was directly offset by the following uses of cash: payments for preferred stock dividends of $99 thousand and payment on principal of finance right-of-use leases of $43 thousand. Net cash used in financing activities in 2019 was $2.3 million primarily due to payments on the loan by an officer of $1.8 million, $714 thousand payment of dividends on preferred stock, and $58 thousand payments on principal on financing leases. This was directly offset by a provision of cash of $239 thousand from the exercise of stock options.\nAt December 31, 2020, we had a commitment of $21 thousand for future finance lease liabilities. Operating lease commitments of $2.6 million are detailed in the Contractual Obligations section below. At December 31, 2019, we had a commitment of $66 thousand for future finance lease liabilities, while operating lease commitments were $1.8 million. During 2020, we funded our operations through the use of available cash and cash equivalents.\nAs of December 31, 2020, we had cash and cash equivalents of approximately $16.7 million, up from approximately $3.3 million as of December 31, 2019. We generated a net loss of $6.5 million for the year ended December 31, 2020 compared to a net income of $4.5 million for the year ended December 31, 2019.\nWe expect to fund our operations through anticipated Company profits together with the approximately $18 million in net proceeds we received from our Secondary Public Offering, which we believe will be sufficient to finance our operations, the additional expenses of marketing, promoting, and selling our new Shield solution and the development of its follow-on solutions, as well as other expected capital expenditures for the next twelve months.\nWe may explore the possible acquisitions of businesses, products and technologies that are complementary to our existing business. We are continuing to identify and prioritize additional security technologies, which we may wish to develop, either internally or through the licensing, or acquisition of products from third parties. While we may engage from time to time in discussions with respect to potential acquisitions, there can be no assurances that any such acquisitions will be made or that we will be able to successfully integrate any acquired business. In order to finance such acquisitions and working capital it may be necessary for us to raise additional funds through public or private financings. Any equity or debt financings, if available at all, may be on terms, which are not favorable to us and, in the case of equity financings, may result in dilution to our stockholders.\nContractual Obligations\nThe following table sets forth certain information concerning the future contractual obligations under our leases at December 31, 2020. We had no other significant contractual obligations at December 31, 2020.\nFuture minimum lease obligations consisted of the following at December 31, 2020 (in thousands):\nOperating Finance\nPeriod ending December 31, ROU Leases ROU Leases Total\n$ 584 $ 21 $ 605\n-\n-\n-\n-\n$ 2,584 $ 21 $ 2,605\nLess Interest* (230 ) -\n$ 2,354 $ 21\n*Interest is imputed for operating ROU leases and classified as lease expense and is included in operating expenses in the accompanying condensed consolidated statement of operations.\nOff-Balance Sheet Arrangements\nAs of December 31, 2020, we did not have any significant off-balance sheet arrangements, as defined in Item 303(a)(4)(ii) of Regulation S-K.\nRecent Accounting Pronouncements\nSee Note 2 Consolidated Financial Statements",
    "item_7A": "",
    "item_8": "Item 8. Financial Statements\nThe information required by this Item 8 begins on page of this Annual Report on Form 10-K.",
    "item_9": "",
    "item_9A": "Item 9A. Controls and Procedures\nEvaluation of Effectiveness of Disclosure Controls and Procedures\nThe Company’s management, under the supervision and with the participation of our Chief Executive Officer and our Chief Financial Officer, conducted an evaluation of the effectiveness of the design and operation of the Company’s disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the “Exchange Act”). Based on this evaluation, the Chief Executive Officer and Chief Financial Officer concluded that, as of the end of the period covered by this report, the Company’s disclosure controls and procedures are effective to provide reasonable assurance that information required to be disclosed by the Company in reports that it files or submits under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the rules and forms of the Securities and Exchange Commission, and is accumulated and communicated to management, including the Company’s principal executive officer and principal financial officer, as appropriate, to allow timely decisions regarding required disclosure.\nManagement Report on Internal Control over Financial Reporting\nThe Company’s management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) to provide reasonable assurance regarding the reliability of the Company’s financial reporting and the preparation of consolidated financial statements for external purposes in accordance with U.S. generally accepted accounting principles.\nThe Company’s management, under the supervision and with the participation of our Chief Executive Officer and our Chief Financial Officer , conducted an evaluation of the effectiveness of the Company’s internal control over financial reporting based on criteria established in 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission. Management’s evaluation included an assessment of elements such as the design and operating effectiveness of key financial reporting controls, process documentation, accounting policies, and the Company’s overall control environment. Based on its evaluation, management concluded that the Company’s internal control over financial reporting was effective as of the year ended December 31, 2020 to provide reasonable assurance regarding the reliability of the Company’s financial reporting and the preparation of consolidated financial statements for external reporting purposes in accordance with U.S. generally accepted accounting principles. The Company reviewed the results of management’s assessment with the Audit Committee of the Board of Directors.\nThis Annual Report does not include an attestation report of the Company’s registered public accounting firm regarding internal control over financial reporting. Management’s report was not subject to attestation by the Company’s registered public accounting firm pursuant to rules of the Securities and Exchange Commission that permit the Company to provide only management’s report in this Annual Report. This report shall not be deemed to be filed for purposes of Section 18 of the Exchange Act or otherwise subject to the liabilities of that section, and is not incorporated by reference into any filing of the Company, whether made before or after the date hereof, regardless of any general incorporation language in such filing.\nInherent Limitations on Effectiveness of Controls\nThe Company’s management, including our Chief Executive Officer and our Chief Financial Officer, does not expect that the Company’s disclosure controls or internal control over financial reporting will prevent or detect all errors and all fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the control system’s objectives will be met. The design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Further, because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that misstatements due to error or fraud will not occur or that all control issues and instances of fraud, if any, have been detected. The design of any system of controls is based in part on certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Projections of any evaluation of the effectiveness of controls to future periods are subject to risks. Over time, controls may become inadequate because of changes in conditions or deterioration in the degree of compliance with policies or procedures.\nChanges in Internal Control over Financial Reporting\nDuring the quarter ended December 31, 2020, there were no changes in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nPART III\nCertain information required by Part III is omitted from this Form 10-K because we will file a definitive Proxy Statement for our 2021 annual meeting of stockholders pursuant to Regulation 14A (the “Proxy Statement”) no later than 120 days after the end of the fiscal year covered by this Annual Report on Form 10-K, and certain information to be included therein is incorporated herein by reference.",
    "item_9B": "",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance.\nThe information called for by this item is incorporated herein by reference to the Proxy Statement.",
    "item_11": "Item 11. Executive Compensation.\nThe information called for by this item is incorporated herein by reference to the Proxy Statement.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe information called for by this item is incorporated herein by reference to the Proxy Statement.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence.\nThe information called for by this item is incorporated herein by reference to the Proxy Statement.",
    "item_14": "Item 14. Principal Accounting Fees and Services.\nThe information called for by this item is incorporated herein by reference to the Proxy Statement.\nPART IV",
    "item_15": "Item 15. Exhibits and Financial Statement Schedules.\n(a) 1. Consolidated Financial Statements.\nThe following consolidated financial statements of Intrusion Inc. and subsidiaries, are submitted as a separate section of this report (See F-pages):\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets at December 31, 2020 and 2019\nConsolidated Statements of Operations for the years ended December 31, 2020 and 2019\nConsolidated Statements of Changes in Stockholders’ Equity for the years ended December 31, 2020 and 2019\nConsolidated Statements of Cash Flows for the years ended December 31, 2020 and 2019\nNotes to Consolidated Financial Statements\nExhibit Number\nDescription of Exhibit\n3.1(3)\nRestated Certificate of Incorporation of the Registrant\n3.2(5)\nCertificate of Amendment to Certificate of Incorporation of Registrant\n3.6(2)\nBylaws of the Registrant\n4.1(6)\nSpecimen Common Stock Certificate\n10.1(6)\nLease Agreement between CalWest Industrial Holdings Texas, L.P. and Intrusion Inc.\n10.2(13)\nFourth Amendment to Lease, executed on September 27, 2019, by and between Intrusion Inc. and JP-CORPORATE PLACE, LP.\n10.3(1)\nSublease Agreement between the Registrant and CliftonLarsonAllen LLP dated September 28, 2020\n10.4(1)\nLease between the Registrant and JBA Portfolio, LLC, executed as of February 3, 2021\n10.5(2)\nAmended and Restated 401(k) Savings Plan of the Registrant\n10.6(4)\nIntrusion Inc. 401(k) Savings Plan Summary of Material Modifications\n10.7(7)\nAmended 2005 Stock Incentive Plan of the Registrant\n10.8(9)\n2015 Stock Incentive Plan of the Registrant\n10.9(10)\nForm of Notice of Grant of Stock Option\n10.10(10)\nForm of Stock Option Agreement\n10.11(10)\nForm of Notice of Grant of Non-Employee Director Automatic Stock Option (Initial Grant)\n10.12(10)\nForm of Notice of Grant of Non-Employee Director Automatic Stock Option (Annual Grant)\n10.13(10)\nForm of Automatic Stock Option Agreement\n21(8)\nList of Subsidiaries of Registrant\n23.1(1)\nConsent of Whitley Penn LLP, Independent Registered Public Accounting Firm\n31.1(1)\nCertification of Chief Executive Officer Pursuant to Rule 13a-14(a) of the Exchange Act\n31.2(1)\nCertification of Chief Financial Officer Pursuant to Rule 13a-14(a) of the Exchange Act\n32.1(1)\nCertification of Chief Executive Officer Pursuant to Rule 13a-14(b) of the Exchange Act and 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2(1)\nCertification of Chief Financial Officer Pursuant to Rule 13a-14(b) of the Exchange Act and 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS(1)\nXBRL Instance Document.\n101.SCH(1)\nXBRL Taxonomy Extension Schema Document.\n101.CAL(1)\nXBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF(1)\nXBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB(1)\nXBRL Taxonomy Extension Label Linkbase Document.\n101.PRE(1)\nXBRL Taxonomy Extension Presentation Linkbase Document.\n(1) Filed herewith\n(2) Filed as an Exhibit to the Registrant’s Annual Report on Form 10-K, for the fiscal year ended December 31, 2000, which Exhibit is incorporated herein by reference.\n(3) Filed as an Exhibit to the Registrant’s Current Report on Form 8-K dated June 15, 2010, which Exhibit is incorporated herein by reference.\n(4) Filed as an Exhibit to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2002, which Exhibit is incorporated herein by reference.\n(5) Filed as an Exhibit to the Registrant’s Annual Report on Form 10-K for the fiscal year ended December 31, 2001 (as amended), which Exhibit is incorporated herein by reference.\n(6) Filed as an Exhibit to the Registrant’s Annual Report on Form 10-K for the fiscal year ended December 31, 2003 (as amended), which Exhibit is incorporated herein by reference.\n(7) Filed as an Exhibit to the Registrant’s Current Report on Form 8-K dated June 15, 2005, which Exhibit is incorporated herein by reference.\n(8) Filed as an Exhibit to the Registrant’s Annual Report on Form 10-K for the fiscal year ended December 31, 2017 (as amended), which Exhibit is incorporated herein by reference.\n(9) Filed as an Exhibit to the Registrant’s Definitive Proxy Statement on Schedule 14A in connection with the solicitation of proxies for its Annual Meeting of Stockholders held May 14, 2015, which Exhibit is incorporated herein by reference.\n(10) Filed as an Exhibit to the Registrant’s Annual Report on Form 10-K for the fiscal year ended December 31, 2019 (as amended), which Exhibit is incorporated herein by reference.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDated: March 9, 2021 INTRUSION INC.\n(Registrant)\nBy: /s/ Jack B. Blount\nJack B. Blount\nPresident, Chief Executive Officer, Director\n(Principal Executive Officer)\nBy: /s/ B. Franklin Byrd\nB. Franklin Byrd\nChief Financial Officer\n(Principal Financial and Accounting Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Jack B. Blount\nPresident, Chief Executive Officer, and Director\nMarch 9, 2021\nJack B. Blount\n(Principal Executive Officer)\n/s/ B. Franklin Byrd\nChief Financial Officer\nMarch 9, 2021\nB. Franklin Byrd\nPrincipal Financial and Accounting Officer\n/s/ Anthony LeVecchio\nChairman, Director\nMarch 9, 2021\nAnthony LeVecchio\n/s/ T. Joe Head\nVice Chairman, Vice President, Director\nMarch 9, 2021\nT. Joe Head\n/s/ James F. Gero\nDirector\nMarch 9, 2021\nJames F. Gero\n/s/ Dale Booth\nDirector\nMarch 9, 2021\nDale Booth\n/s/ Donald M. Johnston\nDirector\nMarch 9, 2021\nDonald M. Johnston\n/S/ Katrinka B. McCallum\nDirector\nMarch 9, 2021\nKatrinka B. McCallum\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nBoard of Directors and Shareholders\nIntrusion Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Intrusion Inc. and subsidiaries (the “Company”) as of December 31, 2020 and 2019, and the related consolidated statements of operations, changes in stockholders’ equity, and cash flows for the years then ended, and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2020 and 2019, and the results of their operations and their cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on these financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (“PCAOB”) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the entity’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\nWe have served as the Company’s auditor since 2009.\n/s/ Whitley Penn LLP\nPlano, Texas\nMarch 9, 2021\nINTRUSION INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(In thousands, except par value amounts)\nDecember 31,\nAssets\nCurrent Assets:\nCash and cash equivalents $ 16,704 $ 3,334\nAccounts receivable 1,233 1,566\nPrepaid expenses\nTotal current assets 18,307 5,052\nProperty and Equipment:\nEquipment 1,453 1,138\nFurniture and fixtures\nLeasehold improvements\n1,563 1,244\nAccumulated depreciation and amortization (1,097 ) (909 )\nFinance leases, right-of-use assets, net\nOperating leases, right-of-use assets, net 1,010 1,348\nOther assets\nTOTAL ASSETS $ 19,882 $ 6,835\nLiabilities and Stockholders’ Equity\nCurrent Liabilities:\nAccounts payable, trade $ 408 $ 252\nAccrued expenses\nDividends payable -\nFinance leases liabilities, current portion\nOperating leases liabilities, current portion\nPPP loan payable, current portion -\nDeferred revenue\nTotal current liabilities 2,142 1,943\nFinance leases liability, noncurrent portion -\nPPP loan payable, noncurrent portion -\nOperating leases liability, noncurrent portion 1,867 1,315\nCommitments and contingencies\nStockholders’ Equity:\nPreferred stock, $0.01 par value:\nAuthorized shares - 5,000\nSeries 1 shares issued and outstanding - 200 Liquidation preference of $1,013 in 2019 -\nSeries 2 shares issued and outstanding - 460 Liquidation preference of $1,155 in 2019 -\nSeries 3 shares issued and outstanding - 289 Liquidation preference of $634 in 2019 -\nCommon stock, $0.01 par value:\nAuthorized shares - 80,000\nIssued shares - 17,428 in 2020 and 13,552 in 2019\nOutstanding shares - 17,418 in 2020 and 13,542 in 2019\nCommon stock held in treasury, at cost-10 shares (362 ) (362 )\nAdditional paid-in-capital 77,187 56,759\nAccumulated deficit (61,295 ) (54,777 )\nAccumulated other comprehensive loss (43 ) (43 )\nTotal stockholders’ equity 15,661 3,556\nTOTAL LIABILITIES AND STOCKHOLDERS’ EQUITY $ 19,882 $ 6,835\nSee accompanying notes.\nINTRUSION INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(In thousands, except per share amounts)\nYear Ended December 31,\nNet product revenue $ 6,619 $ 13,643\nCost of revenue 2,709 5,342\nGross profit 3,910 8,301\nOperating expenses:\nSales and marketing 3,821 1,298\nResearch and development 3,797 1,314\nGeneral and administrative 2,815 1,182\nOperating income (loss) (6,523 ) 4,507\nInterest expense (6 ) (46 )\nInterest income\nIncome (loss) from operations before income taxes (6,518 ) 4,465\nIncome tax provision - -\nNet income (loss) (6,518 ) 4,465\nPreferred stock dividends accrued (79 ) (139 )\nNet income (loss) attributable to common stockholders $ (6,597 ) $ 4,326\nNet income (loss) per share attributable to common stockholders, basic $ (0.45 ) $ 0.32\nNet income (loss) per share attributable to common stockholders, diluted $ (0.45 ) $ 0.28\nWeighted average common shares outstanding:\nBasic 14,678 13,502\nDiluted 14,678 15,352\nSee accompanying notes.\nINTRUSION INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS’ EQUITY\n(In thousands)\nYear Ended December 31,\nNUMBER OF PREFERRED SHARES-ISSUED AND OUTSTANDING\nBalance, beginning of year\nConversion of preferred shares to common shares (949 ) -\nBalance, end of year -\nPREFERRED STOCK\nBalance, beginning of year $ 1,843 $ 1,843\nConversion of preferred shares to common shares (1,843 ) -\nBalance, end of year $ - $ 1,843\nNUMBER OF COMMON SHARES-ISSUED\nBalance, beginning of year 13,552 13,259\nExercise of stock options\nConversion of preferred shares to common shares 1,068 -\nPublic offering 2,465 -\nBalance, end of year 17,428 13,552\nCOMMON STOCK\nBalance, beginning of year $ 136 $ 133\nExercise of stock options\nConversion of preferred shares to common shares -\nPublic offering -\nBalance, end of year $ 174 $ 136\nTREASURY SHARES\nBalance, beginning of year and end of year $ (362 ) $ (362 )\nADDITIONAL PAID-IN-CAPITAL\nBalance, beginning of year $ 56,759 $ 56,609\nStock-based compensation\nExercise of stock options\nConversion of preferred shares to common shares 1,833 -\nPublic offering 18,146 -\nPreferred stock dividends declared, net of waived penalties by shareholders (79 ) (133 )\nBalance, end of year $ 77,187 $ 56,759\nACCUMULATED DEFICIT\nBalance, beginning of year $ (54,777 ) $ (59,242 )\nNet income (loss) (6,518 ) 4,465\nBalance, end of year $ (61,295 ) $ (54,777 )\nACCUMULATED OTHER COMPREHENSIVE LOSS\nBalance, beginning of year and end of year $ (43 ) $ (43 )\nTOTAL STOCKHOLDERS’ EQUITY $ 15,661 $ 3,556\nSee accompanying notes.\nINTRUSION INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In thousands)\nYear Ended December 31,\nOperating Activities:\nNet income (loss) $ (6,518 ) $ 4,465\nAdjustments to reconcile net income (loss) to net cash provided by (used in) operating activities:\nDepreciation and amortization\nNoncash lease costs\nStock-based compensation\nLoss on abandoned real estate operating lease 1,092 -\nPenalties and waived penalties on dividends -\nChanges in operating assets and liabilities:\nAccounts receivable\nPrepaid expenses and other assets (258 ) (61 )\nAccounts payable and accrued expenses (334 ) (496 )\nDeferred revenue (339 ) (488 )\nNet cash provided by (used in) operating activities (5,177 ) 4,290\nInvesting Activities:\nPurchases of property and equipment (320 ) (260 )\nNet cash used in investing activities (320 ) (260 )\nFinancing Activities:\nPayments on loan from officer - (1,815 )\nProceeds from PPP loan payable -\nPayments of dividends (99 ) (714 )\nPrincipal payments on financing lease equipment (43 ) (58 )\nProceeds from public stock offering 18,171 -\nProceeds from stock options exercised\nNet cash provided by (used in) financing activities 18,867 (2,348 )\nNet increase in cash and cash equivalents 13,370 1,682\nCash and cash equivalents at beginning of year 3,334 1,652\nCash and cash equivalents at end of year $ 16,704 $ 3,334\nSUPPLEMENTAL CASH FLOW INFORMATION:\nInterest paid on leased assets $ 2 $ 4\nInterest paid on loan from officer $ - $ 513\nIncome taxes paid $ - $ -\nSUPPLEMENTAL DISCLOSURE OF NON CASH FINANCING ACTIVITIES:\nPreferred stock dividends accrued $ 79 $ 139\nConversion of preferred shares to common shares $ 1,843 $ -\nSee accompanying notes.\nINTRUSION INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1. Description of Business\nWe develop, sell and support products that protect any-sized company or government organization by fusing advanced threat intelligence with real-time artificial intelligence to kill cyberattacks as they occur - including Zero-Days. We market and distribute our solutions through a direct sales force and value-added resellers. Our end-user customers include U.S. federal government entities, state and local government entities, and companies ranging in size from mid-market to large enterprises.\nReferences to the “Company”, “we”, “us”, “our”, “Intrusion” or “Intrusion Inc.” refer to Intrusion Inc. and its subsidiaries. Savant™ and TraceCop™ are registered trademarks of Intrusion Inc.\nAs of December 31, 2020, we had cash and cash equivalents of approximately $16,704,000, up from approximately $3,334,000 as of December 31, 2019. We generated a net loss of $6,518,000 for the year ended December 31, 2020 compared to a net income of $4,465,000 for the year ended December 31, 2019. Based on the current forecast for the year 2021, we believe that we will have sufficient cash resources to finance our operations and expected capital expenditures through March 31, 2022. As of October 24, 2019, our funding available terminated under an unsecured revolving promissory note to borrow up to $3,700,000 from G. Ward Paxton, the Company’s former Chief Executive Officer (the “CEO Note”). Our management will be assessing whether to replace this borrowing base and assessing what terms may be available to the Company, including whether any such terms available are acceptable to the Company, if at all (the “Potential Replacement Facility”). Any equity or debt financings, if available at all, may be on terms which are not favorable to us and, in the case of equity financings, may result in dilution to our stockholders. We expect to fund our operations through anticipated Company profits, possibly additional investments of private equity and debt, which, if we are able to obtain, will have the effect of diluting our existing common stockholders, perhaps significantly, and a possible Potential Replacement Facility. If our operations do not generate positive cash flow in the upcoming year, or if we are not able to obtain additional debt or equity financing on terms and conditions acceptable to us, if at all, we may be unable to implement our business plan, fund our liquidity needs or even continue our operations.\n2. Summary of Significant Accounting Policies\nPrinciples of Consolidation\nOur consolidated financial statements include our accounts and those of our wholly owned subsidiaries, and are prepared in accordance with accounting principles generally accepted in the United States of America. Intercompany balances and transactions have been eliminated in consolidation.\nCash and Cash Equivalents\nCash and all highly liquid investments purchased with an original maturity of less than three months are considered to be cash and cash equivalents. As of December 31, 2020, the Company had approximately $16,204,000 of uninsured cash balances in excess of Federal Depository Insurance Company limits.\nRisk Concentration\nFinancial instruments, which potentially subject us to concentrations of credit risk, are primarily cash and cash equivalents, investments and accounts receivable. Cash and cash equivalent deposits are at risk to the extent that they exceed Federal Deposit Insurance Corporation insured amounts. To minimize risk, we place our investments in U.S. government obligations, corporate securities and money market funds. Substantially all of our cash, cash equivalents and investments are maintained with two major U.S. financial institutions. We do not believe that we are subject to any unusual financial risk with our banking arrangements. We have not experienced any significant losses on our cash and cash equivalents.\nWe sell our products to customers primarily in the United States. In the future, we may sale our products internationally. Fluctuations in currency exchange rates and adverse economic developments in foreign countries could adversely affect the Company’s operating results. We perform ongoing credit evaluations of our customers’ financial condition and generally require no collateral. We maintain reserves for potential credit losses, and such losses, in the aggregate, have historically been minimal.\nAccounts Receivable and Allowance for Doubtful Accounts\nTrade accounts receivable are stated at the amount we expect to collect. We maintain allowances for doubtful accounts for estimated losses resulting from the inability of our customers to make required payments. Management considers the following factors when determining the collectability of specific customer accounts: customer creditworthiness, past transaction history with the customer, current economic industry trends, and changes in customer payment terms. If the financial condition of our customers were to deteriorate, adversely affecting their ability to make payments, additional allowances would be required. Based on management’s assessment, we provide for estimated uncollectible amounts through a charge to earnings and an increase to a valuation allowance. Balances that remain outstanding after we have used reasonable collection efforts are written off through a charge to the valuation allowance. There was no allowance at December 31, 2020 and 2019.\nProperty and Equipment\nEquipment and furniture and fixtures are stated at cost less accumulated depreciation and depreciated on a straight-line basis over the estimated useful lives of the assets. Such lives vary from 1 to 5 years. Leasehold improvements are stated at cost less accumulated amortization and are amortized on a straight-line basis over the shorter of estimated useful lives of the assets or the remaining terms of the leases. Such lives vary from 2 to 5 years. Expenditures for major renewals and betterments that extend the useful lives of property and equipment are capitalized. Repair and maintenance costs are expensed as incurred. Depreciation and amortization expense totaled approximately $231,000 and $184,000 for the years ended December 31, 2020 and 2019, respectively.\nAdvertising Expenses\nThe cost of advertising is expensed as incurred or deferred until first use of advertising and expensed ratably over the applicable periods. Advertising expense was $1.3 million and $10,000 for 2020 and 2019, respectively. The increase in 2020 was primarily due to the Company’s establishing a Marketing department and allocating a dedicated budget for marketing, advertising, promotion, and public relations.\nLong-Lived Assets\nWe review long-lived assets, including property and equipment for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Recoverability of assets to be held and used is measured by a comparison of the carrying amount of an asset to future undiscounted cash flows to be generated by the asset. If the carrying value exceeds the future undiscounted cash flows, the assets are written down to fair value. During the years ended December 31, 2020 and 2019, there was no impairment of long-lived assets.\nForeign Currency\nAll assets and liabilities in the balance sheets of foreign subsidiaries whose functional currency is other than the U.S. dollar are translated at year-end exchange rates. All revenues and expenses in the statement of operations of these foreign subsidiaries are translated at average exchange rates for the year. Translation gains and losses are not included in determining net income but are shown in accumulated other comprehensive loss in the stockholders’ deficit section of the consolidated balance sheet. Foreign currency transaction gains and losses are included in determining net loss and were not significant.\nAccounting for Stock Options\nWe account for stock options using the guidance in Financial Accounting Standards Board Accounting Standards Codification (“FASB ASC”) Topic 718. FASB ASC Topic 718 requires all share-based payments to employees, including grants of employee stock options, to be recognized in the financial statements based on their fair values.\nStock-based compensation expense recognized in the statements of operations for the years ended 2020 and 2019 is based on awards ultimately expected to vest, reduced by estimated forfeitures. FASB ASC Topic 718 requires forfeitures to be estimated at the time of grant and revised, if necessary, in subsequent periods if actual forfeitures differ from those estimates.\nValuation Assumptions\nThe fair values of option awards were estimated at the date of grant using a Black-Scholes option-pricing model with the following assumptions for fiscal years ended December 31, 2020 and 2019, respectively:\nWeighted average grant date fair value $ 3.50 $ 3.69\nWeighted average assumptions used:\nExpected dividend yield 0.00% 0.00%\nRisk-free interest rate 0.41% 2.00%\nExpected volatility 75.70% 124.58%\nExpected life (in years) 5.93 5.00\nExpected volatility is based on historical volatility and in part on implied volatility. The expected term considers the contractual term of the option as well as historical exercise and forfeiture behavior. The risk-free interest rate is based on the rates in effect on the grant date for U.S. Treasury instruments with maturities matching the relevant expected term of the award.\nNet Income (Loss) Per Share\nWe report two separate net income (loss) per share numbers, basic and diluted. Basic net income (loss) attributable to common stockholders per share is computed by dividing net income (loss) attributable to common stockholders for the year by the weighted average number of common shares outstanding for the year. Diluted net income (loss) attributable to common stockholders per share is computed by dividing the net income (loss) attributable to common stockholders for the year by the weighted average number of common shares and dilutive common stock equivalents outstanding for the year. Our common stock equivalents include all common stock issuable upon conversion of convertible preferred stock and the exercise of outstanding options. Common stock equivalents are included in the diluted income (loss) per share for the years ended December 31, 2020 and 2019 except in cases where the issuance would be anti-dilutive. The aggregate number of common stock equivalents excluded from the diluted income (loss) per share calculation for the years ended December 31, 2020 and 2019 totaled 976,284 and 30,630 respectively.\nRevenue Recognition\nWe generally recognize product revenue upon shipment or after meeting certain performance obligations. These products can include hardware, perpetual software licenses and data sets. Data set updates are the majority of our sales. We do not currently offer software on a subscription basis. Warranty costs and sales returns have not been material.\nWe recognize sales of our data sets in accordance with FASB ASC Topic 606 whereby revenue from contracts with customers is not recognized until all five of the following have been met:\ni) identify the contract with a customer;\nii) identify the performance obligations in the contract;\niii) determine the transaction price;\niv) allocate the transaction price to the separate performance obligations; and\nv) recognize revenue upon satisfaction of a performance obligation.\nData updates are typically done monthly and revenue will be matched accordingly. Product sales may include maintenance and customer support allocated revenue in an arrangement using estimated selling prices of the delivered goods and services based on a selling price hierarchy using the relative selling price method. All of our product offering and service offering market values are readily determined based on current and prior stand-alone sales. We may defer and recognize maintenance, updates and support revenue over the term of the contract period, which is generally one year.\nService revenue, primarily including maintenance, training and installation are recognized upon delivery of the service and typically are unrelated to product sales. To date, training and installation revenue has not been material. These revenues are included in net customer support and maintenance revenues in the statement of operations.\nOur normal payment terms offered to customers, distributors and resellers are net 30 days domestically and net 45 days internationally. We do not offer payment terms that extend beyond one year and rarely do we extend payment terms beyond our normal terms. If certain customers do not meet our credit standards, we do require payment in advance to limit our credit exposure.\nShipping and handling costs are billed to the customer and included in product revenue. Shipping and handling expenses are included in cost of product revenue. We have elected to account for shipping and handling costs as fulfillment costs after the customer obtains control of the goods.\nResearch and Development Costs\nWe incur research and development costs that relate primarily to the development of new security software, appliances and integrated solutions, and major enhancements to existing services and products. Research and development costs are comprised primarily of salaries and related benefits expenses, contract labor and prototype and other related expenses.\nSoftware development costs are included in research and development and are expensed as incurred. FASB ASC Topic 985 Software requires that software development costs incurred subsequent to reaching technological feasibility be capitalized, if material. If the process of developing a new product or major enhancement does not include a detailed program design, technological feasibility is determined only after completion of a working model. To date, the period between achieving technological feasibility and the general availability of such software has been short, and the software development costs qualifying for capitalization have been insignificant.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. Estimates are used for, but not limited to, the accounting for doubtful accounts, sales discounts, sales returns, revenue recognition, warranty costs, inventory obsolescence, depreciation, income taxes and stock based compensation. Actual results could differ from these estimates.\nFair Value of Financial Instruments\nWe calculate the fair value of our assets and liabilities which qualify as financial instruments and include additional information in the notes to consolidated financial statements when the fair value is different than the carrying value of these financial instruments. The estimated fair value of accounts receivable, accounts payable and accrued expenses, and dividends payable approximate their carrying amounts due to the relatively short maturity of these instruments. Financing leases and PPP loan approximate fair value as they bear market rates of interest. None of these instruments are held for trading purposes.\nIncome Taxes\nDeferred income taxes are determined using the liability method in accordance with FASB ASC 740, Accounting for Income Taxes. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. In addition, a valuation allowance is established to reduce any deferred tax asset for which it is determined that it is more likely than not that some portion of the deferred tax asset will not be realized.\nFASB ASC 740 creates a single model to address accounting for uncertainty in tax positions by prescribing a minimum recognition threshold that a tax position is required to meet before being recognized in the financial statements. FASB ASC 740 also provides guidance on derecognition, measurement, classification, interest and penalties, accounting in interim periods, disclosure and transition. There are no unrecognized tax benefits to disclose in the notes to the consolidated financial statements.\nWe file income tax returns in the United States federal jurisdiction. At December 31, 2020, tax returns related to fiscal years ended December 31, 2017 through December 31, 2019 remain open to possible examination by the tax authorities. No tax returns are currently under examination by any tax authorities.\nRecent Accounting Pronouncements\nOn January 1, 2019 we adopted ASU No. 2016-02, Leases (topic 842). At the date of adoption there was no impact on the statement of operations, while the balance sheet reflects recording both assets and liabilities applicable to the operating right-of-use asset lease identified. ASU No. 2016-02 did not have a material effect on the Company’s results of operations or cash flows for the year ended December 31, 2019.\n3. Accrued Expenses (in thousands)\nAccrued expenses are made up of the following as of December 31:\nDecember 31,\nAccrued payroll $ 228 $ 193\nAccrued vacation\nAccrued bonus -\nEmployee benefits payable -\nOther\n$ 628 $ 828\n4. Commitments and Contingencies\nRight-of-use Asset and Leasing Liabilities\nUnder the new lease accounting standard, we have determined that we have leases for right-of-use (ROU) assets. We have both finance right-of-use assets and operating right-of-use assets with a related lease liability. Our finance lease right-of-use assets consist of computer hardware and a copying machine. Our operating lease right-of-use assets include our rental agreements for our offices in Plano, TX, Allen, TX and San Marcos, CA. Both types of lease liabilities are determined by the net present value of total payments and are amortized over the life of the lease. Both types of lease obligations are designed to terminate with the last scheduled payment. All of the finance lease right-of-use assets have a three-year life and are in various stages of completion. The Richardson operating lease liability has a life of three years and eleven months as of December 31, 2020. The San Marcos operating lease liability has a life of three months as of December 31, 2020. The adoption of the lease accounting standard resulted in the recognition of an operating ROU asset of $1,580 thousand and a related lease liability of $1,771 thousand on January 1, 2019. The Plano operating lease liability has a life of two years and nine months as of December 31, 2020 and had an initial recognition of an operating ROU asset and related lease liability of $225 thousand during the year ended December 31, 2020. The Allen operating lease liability has a life of four years and ten months as of December 31, 2020 and had an initial recognition of an operating ROU asset and related lease liability of $824 thousand during the year ended December 31, 2020.\nAdditional qualitative and quantitative disclosures regarding the Company's leasing arrangements are also required. The Company adopted ASC 842 prospectively and elected the package of transition practical expedients that does not require reassessment of: (1) whether any existing or expired contracts are or contain leases, (2) lease classification and (3) initial direct costs. In addition, the Company has elected other available practical expedients to not separate lease and non-lease components, which consist principally of common area maintenance charges, for all classes of underlying assets and to exclude leases with an initial term of 12 months or less.\nAs the implicit rate is not readily determinable for the Company's lease agreement, the Company uses an estimated incremental borrowing rate to determine the initial present value of lease payments. This discount rate for the lease approximates SVB's prime rate.\nSupplemental cash flow information includes operating cash flows related to operating leases. For the years ended December 31, 2020 and 2019, the Company had approximately $380,000 and $294,000, respectively, in operating cash flows related to operating leases.\nLease Abandonment\nBecause of the breach of contract mentioned in the following Legal Proceedings section, management decided to abandon our offices subject to the Richardson ROU operating lease. The final move out of employees, applicable furnishings and server datacenter was in early December 2020. We have applied the abandonment guidance in ASC 360-10-35. We believe “abandonment” means ceasing to use the underlying asset and lacking either the intent or the ability to sublease the underlying asset. Accordingly, lease abandonment charges incurred for this ROU asset for the year ended December 31, 2020 totaled $1.1 million.\nSchedule of Items Appearing on the Statement of Operations:\nYear Ended\nDecember 30, 2020 December 31, 2019\nOperating expense:\nAmortization expense - Finance ROU\nLease expense - Operating ROU\nOther expense:\nInterest expense - Finance ROU\nFuture minimum lease obligations consisted of the following at December 31, 2020 (in thousands):\nOperating Finance\nPeriod ending December 31, ROU Leases ROU Leases Total\n$ 584 $ 21 $ 605\n-\n-\n-\n-\n$ 2,584 $ 21 $ 2,605\nLess Interest* (230 ) -\n$ 2,354 $ 21\n*Interest is imputed for operating ROU leases and classified as lease expense and is included in operating expenses in the accompanying condensed consolidated statement of operations.\nLegal Proceedings\nOn February 16, 2021, Intrusion Inc. instituted legal proceedings in the District Court of Dallas County, Texas, 14th Judicial District against Purple Plaza LLC, the landlord for the facilities we previously occupied in Richardson, Texas. This lawsuit claims damages for breach of contract for, among other things, failure to maintain and repair the leased facilities and to provide adequate heating, air conditioning, and ventilation on the premises, resulting in a constructive eviction. Intrusion is seeking damages in excess of $1,000,000 together with a declaratory judgment that any of Intrusion’s remaining obligations under the lease have terminated. The landlord filed a general denial on March 5, 2021.\nIn addition to this pending litigation, we are subject to various other legal proceedings and claims that may arise in the ordinary course of business. We do not believe that any claims exist where the outcome of such matters would have a material adverse effect on our consolidated financial position, operating results or cash flows. However, there can be no assurance such legal proceedings will not have a material impact on future results.\nWe are not aware of any material claims outstanding or pending against Intrusion Inc. at December 31, 2020.\n5. Employee Benefit Plan\nEmployee 401(k) Plan\nWe have a plan known as the Intrusion Inc. 401(k) Savings Plan (the “Plan”) to provide retirement and incidental benefits for our employees. The Plan covers substantially all employees who meet minimum age and service requirements. As allowed under Section 401(k) of the Internal Revenue Code, the Plan provides tax deferred salary deductions for eligible employees.\nEmployees may contribute from 1% to 25% of their annual compensation to the Plan, limited to a maximum amount as set by the Internal Revenue Service. Participants who are over the age of 50 may contribute an additional amount of their salary per year, as defined annually by the Internal Revenue Service. We match employee contributions at the rate of $0.25 per each $1.00 of contribution on the first 4% of compensation. Matching contributions to the Plan were approximately $36,000 and $32,000, respectively, for the years ended December 31, 2020 and 2019.\n6. PPP Loan\nOn March 27, 2020, the U.S. federal government enacted the Coronavirus Aid, Relief, and Economic Security Act (“CARES Act”), which includes provision for a Paycheck Protection Program (“PPP”) administered by the U.S. Small Business Administration (“SBA”). The PPP allows qualifying businesses to borrow up to $10 million calculated based on qualifying payroll costs. The loan is guaranteed by the federal government and does not require collateral. On April 30, 2020 we entered into a PPP Loan with Silicon Valley Bank, pursuant to the PPP under CARES for $629,000. The PPP Loan matures on April 30, 2022 and bears interest at a rate of 1.0% per annum. The PPP Loan funds were received on April 30, 2020. The PPP Loan contains events of default and other provisions customary for a loan of this type. The PPP provides that (1) the use of PPP Loan amount shall be limited to certain qualifying expenses, (2) 100 percent of the principal amount of the loan is guaranteed by the SBA and (3) an amount up to the full principal amount plus accrued interest may qualify for loan forgiveness in accordance with the terms of CARES. As of December 31, 2020, the Company was in full compliance with all covenants with respect to the PPP Loan. The Company expects to use the full proceeds of the PPP loan in accordance with the provisions of CARES. As of December 31, 2020, the balance of the PPP Loan was $629,000, along with $4,000 in accrued interest. We have submitted the PPP Loan Forgiveness Application and expect full forgiveness as we have met all stated requirements.\n7. Borrowings from Officer\nOn February 8, 2018, the Company entered into an unsecured revolving promissory note to borrow up to $3,700,000 from G. Ward Paxton, the Company’s former Chief Executive Officer (the “CEO Note”). Under the terms of the CEO Note, the Company had the ability to borrow, repay and reborrow on the loan as needed up to an outstanding principal balance due of $3,700,000 at any given time through March 2020.\nOn February 7, 2019, the Company amended the unsecured revolving promissory note to borrow up to $2,700,000 from G. Ward Paxton, the Company’s former Chief Executive Officer. Amounts borrowed under the CEO Note accrued interest at a floating rate per annum equal to Silicon Valley Bank’s (“SVB”) prime rate plus 1%. Under the terms of the note, the Company had the ability to borrow, repay and reborrow on the loan as needed up to an outstanding principal balance due of $2,700,000 at any given time through March 2021. We reduced our borrowing under this note to zero as of May 2019.\nAs of October 24, 2019, G. Ward Paxton passed away, terminating the CEO Note with the result that future borrowings thereunder will no longer be available to the Company. Our management will be assessing whether to replace this borrowing base and assessing what terms may be available to the Company, including whether any such terms are acceptable to the Company, if at all.\n8. Income Taxes\nDeferred income taxes reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. Significant components of our deferred tax assets (liabilities) as of December 31, 2020 and 2019 are as follows (in thousands):\nDecember 31\nNet operating loss carryforwards $ 19,965 $ 18,771\nNet operating loss carryforwards of foreign subsidiaries\nDepreciation expense (99 ) (77 )\nStock-based compensation expense\nOther\nNet deferred tax assets 20,597 19,172\nValuation allowance for net deferred tax assets (20,597 ) (19,172 )\nNet deferred tax assets, net of allowance $ - $ -\nDeferred tax assets are required to be reduced by a valuation allowance if it is more likely than not that some portion or all of the deferred tax assets will not be realized. Realization of the future benefits related to the deferred tax assets is dependent on many factors, including the Company’s ability to generate taxable income within the near to medium term. Management has considered these factors in determining the valuation allowance for 2020 and 2019.\nThe differences between the provision for income taxes and income taxes computed using the federal statutory rate for the years ended December 31, 2020 and 2019 are as follows (in thousands):\nReconciliation of income tax benefit to statutory rate:\nIncome benefit at statutory rate $ (1,369 ) $ 938\nState income taxes (benefit), net of federal income tax benefit (121 ) 1,066\nPermanent differences\nChange in valuation allowance 1,425 (2,030 )\nOther\n$ - $ -\nAt December 31, 2020, we had federal net operating loss carryforwards of approximately $86.9 million for income tax purposes that begin to expire in 2022 and are subject to the ownership change limitations under Internal Revenue Code Section 382.\n9. Stock Options\nAt December 31, 2020, we had two stock-based compensation plans, which are described below. These plans were developed to retain and attract key employees and directors.\nOn March 17, 2005, the Board approved the 2005 Stock Incentive Plan (the “2005 Plan”), which was approved by the stockholders on June 14, 2005. The 2005 Plan provided for the issuance of up to 750,000 shares of common stock upon exercise of options granted pursuant to the 2005 Plan. On May 30, 2007, the stockholders approved an Amendment to the 2005 Plan that increased this amount by 750,000 for a total of 1,500,000 shares of common stock that may be issued upon the exercise of options granted pursuant to the 2005 Plan. On May 29, 2008 and May 21, 2009, the stockholders approved an increase of 500,000 shares, respectively, of common stock that may be issued pursuant to the 2005 Plan for a total of 2,500,000 shares. On May 20, 2010, the stockholders approved an additional increase of 500,000 shares of common stock that may be issued pursuant to the 2005 Plan for a total of 3,000,000 shares. On May 19, 2011, the stockholders approved an additional increase of 400,000 shares of common stock that may be issued pursuant to the 2005 Plan for a total of 3,400,000 shares. Finally, on May 17, 2012, the stockholders approved an additional increase of 300,000 shares of common stock that may be issued pursuant to the 2005 Plan for a total of 3,700,000 shares. At December 31, 2020, 1,861,335 had been exercised and options to purchase a total of 526,000 shares of common stock were outstanding. A total of 3,892,000 options had been granted under the 2005 Plan, of which 1,504,665 have been cancelled. The 2005 Plan expired on June 14, 2015, and no options remain for grant.\nOn March 19, 2015, the Board approved the 2015 Stock Incentive Plan (the “2015 Plan”), which was approved by the stockholders on May 14, 2015. The 2015 Plan serves as a replacement for the 2005 Plan which expired by its terms on June 14, 2015. The approval of the 2015 Plan had no effect on the 2005 Plan or any options granted pursuant to the plan. All options will continue with their existing terms and will be subject to the 2005 Plan. Further, the Company will not be able to re-issue any option which is cancelled or terminated under the 2005 Plan. The 2015 Plan provided for the issuance of up to 600,000 shares of common stock upon exercise of options granted pursuant to the 2015 Plan.\nThe 2015 Plan consists of three separate equity incentive programs: the Discretionary Option Grant Program; the Stock Issuance Program; and the Automatic Option Grant Program for non-employee Board members. Officers and employees, non-employee Board members and independent contractors are eligible to participate in the Discretionary Option Grant and Stock Issuance Programs. Participation in the Automatic Option Grant Program is limited to non-employee members of the Board. Each non-employee Board member will receive an option grant for 10,000 shares of common stock upon initial election or appointment to the Board, provided that such individual has not previously been employed by the Company in the preceding three (3) months. In addition, on the date of each annual stockholders meeting, each Board member will automatically be granted an option to purchase 10,000 shares of common stock, provided he or she has served as a non-employee Board member for at least three months. At December 31, 2020, 45,000 options had been exercised and options to purchase a total of 509,000 shares of common stock were outstanding. A total of 557,000 options had been granted under the 2015 Plan, 3,000 options have been cancelled, and options for 46,000 shares remained available for future grant. No shares have been issued pursuant to the Stock Issuance Program.\nCommon shares reserved for future issuance, including outstanding options and options available for future grant under all of the stock option plans totaled 1,081,000 shares at December 31, 2020 as follows, in thousands:\n(In thousands) Common Shares\nReserved for Future\nIssuance\n2015 Plan\n2005 Plan\nTotal 1,081\nThe Compensation Committee of our Board of Directors determines for all employee options, the term of each option, option exercise price within limits set forth in the plans, number of shares for which each option is granted and the rate at which each option is exercisable (generally ratably over one, three or five years from grant date). However, the exercise price of any incentive stock option may not be less than the fair market value of the shares on the date granted (or less than 110% of the fair market value in the case of optionees holding more than 10% of our voting stock of the Company), and the term cannot exceed ten years (five years for incentive stock options granted to holders of more than 10% of our voting stock).\nStock Incentive Plan Summary\nA summary of our stock option activity and related information for the years ended December 31, 2020 and 2019 is as follows:\nNumber of\nOptions (in\nthousands) Weighted\nAverage\nExercise\nPrice Number of\nOptions (in\nthousands) Weighted\nAverage\nExercise\nPrice\nOutstanding at beginning of year $ 0.96 1,235 $ 0.83\nGranted at price = market value 5.56 4.40\nGranted at price > market value - - - -\nExercised (343 ) 0.61 (294 ) 0.81\nForfeited - - - -\nExpired - - - -\nOutstanding at end of year 1,035 $ 2.87 $ 0.96\nOptions exercisable at end of year $ 1.03 $ 0.84\nStock Options Outstanding and Exercisable\nInformation related to stock options outstanding at December 31, 2020, is summarized below:\nOptions Outstanding Options Exercisable\nRange of Exercise Prices Outstanding at\n12/31/20 (in\nthousands) Weighted\nAverage\nRemaining\nContractual Life (years) Weighted\nAverage\nExercise\nPrice Exercisable at\n12/31/20 (in\nthousands) Weighted\nAverage\nExercise\nPrice\n$0.40 - $1.00 1.66 $ 0.58 $ 0.58\n$1.01 - 2.00 3.83 1.69 1.72\n$2.01 - 4.25 5.54 2.89 2.50\n$4.26 - $8.72 9.46 5.54 4.75\n1,035 5.33 $ 2.87 $ 1.03\nSummarized information about outstanding stock options as of December 31, 2020, that are fully vested and those that are expected to vest in the future as well as stock options that are fully vested and currently exercisable, are as follows:\nOutstanding Stock\nOptions (Fully Vested\nand Expected to Vest)* Options that are\nExercisable\nAs of December 31, 2020\nNumber of outstanding options (in thousands)\nWeighted average remaining contractual life 5.14 2.41\nWeighted average exercise price per share $ 2.76 $1.03\nIntrinsic value (in thousands) $ 14,670 $9,976\n* Includes effects of expected forfeitures\nAs of December 31, 2020, the total unrecognized compensation cost related to non-vested options not yet recognized in the statement of operations totaled approximately $1,023 thousand (including expected forfeitures) and the weighted average period over which these awards are expected to vest was 2.30 years.\n10. Secondary Public Offering of Common Stock\nIn October of 2020, the Company completed a secondary public offering of 3,565,000 shares of common stock at a price to the public of $8.00 per share, including 2,000,000 shares of common stock to be issued and sold by Intrusion and 1,100,000 shares of common stock to be offered by the group of selling shareholders, together with 465,000 shares purchased when the underwriter exercised its option to purchase all of the available shares under the underwriter’s overallotment option (the “Secondary Public Offering”). Gross proceeds of the offering to the company, before deducting underwriting discounts, commissions and estimated offering expenses, were approximately $19,720,000. Net proceeds to Intrusion of approximately $18,171,000 are intended to fund several growth initiatives, including the commercialization of its new Intrusion Shield solutions designed for the enterprise market.\nOn October 9, 2020 and in connection with the closing of our Secondary Public Offering, our stock began trading on the Nasdaq Capital Market (“Nasdaq”) under the symbol “INTZ”.\n11. Preferred Stock\nIn August 2020, all current shares of issued and outstanding preferred stock were voluntarily converted, resulting in the issuance of a total of 1,004,249 newly issued shares of the Company’s common stock. The addition of these newly issued shares has resulted in the dilution of each share of issued and outstanding common stock by a factor of 7.28% at that date.\nDividends Payable\nDuring the year ended December 31, 2020, we accrued $30,000 in dividends to the holders of our 5% Preferred Stock, $32,000 in dividends to the holders of our Series 2 5% Preferred Stock and $17,000 in dividends to the holders of our Series 3 5% Preferred Stock. We paid these in full in August 2020, at the same time as the voluntary conversion of all preferred stocks.\nAs of December 31, 2019, we had $20,000 in accrued and unpaid dividends included in other current liabilities. We paid these in full during the year ended December 31, 2020.\n12. Concentrations\nOur operations are concentrated in one area-security software/entity identification. Sales to the U.S. Government through direct and indirect channels totaled 86.3% of total revenues for 2020 and 87.4% of total revenues for 2019. During 2020 approximately 76.5% of total revenues were attributable to three government customers. During 2019 approximately 68.1% of total revenues are attributable to three government customers. One individual government customer at December 31, 2020 and three at December 31, 2019 exceeded 10% of total accounts receivable balance at respective year ends, comprising 52.8% and 78.8% of the respective total accounts receivable balance. During 2020 no commercial customer exceeded 10.0% of total revenues, and during 2019, 10.4% of total revenues were attributable to one commercial customer. Only one individual commercial customer at December 31, 2020 and 2019 exceeded 10% of total accounts receivable balance. Our similar product and service offerings are not viewed as individual segments, as our management analyzes the business as a whole and expenses are not allocated to each product offering.\n13. Contract Assets and Contract Liabilities\nContract assets represent contract billings for sales per contracts with customers and are classified as current. Our contract assets include our accounts receivables. For the year ended December 31, 2020, the Company had contract assets balance of $1,233,000, a decrease of $333,000 from the prior year due to cash receipts exceeding new contract assets. For the year ended December 31, 2019, the Company had contract assets balance of $1,566,000.\nContract liabilities consist of cash payments in advance of the Company satisfying performance obligations and recognizing revenue. The Company currently classifies deferred revenue as a contract liability. For the year ended December 31, 2020, the Company had contract liabilities balance of $177,000. For the year ended December 31, 2019, the Company had contract liabilities balance of $516,000.\n14. Coronavirus Outbreak in the United States\nA significant concentration of our federal, state, and local governmental customers were forced to allocate scarce and competing resources and balance budgetary demands placed upon them as a result of the effects of the coronavirus, mandatory quarantines, decreased travel, interruptions in workforce populations, scarcity of commodities, and similar economic and operational effects of the virus upon their own constituencies. These adverse effects resulted in decreased demand by many of our customers for our product offerings and cybersecurity solutions, negatively affecting historic revenue levels for the Company."
}