{
    "cik": "78749",
    "company": "AGILYSYS INC",
    "filing_type": "10-K",
    "filing_date": "2021-05-21",
    "period_of_report": "2021-03-31",
    "sic": "7373",
    "state_of_inc": "OH",
    "state_location": "GA",
    "fiscal_year_end": "0331",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/78749/0001564590-21-029319-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/78749/000156459021029319/agys-10k_20210331.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/78749/0001564590-21-029319.txt",
    "filename": "78749_10K_2021_0001564590-21-029319.htm",
    "item_1": "Item 1. Business.\nOverview\nAgilysys has been a leader in hospitality software for more than 40 years, delivering innovative guest-centric cloud-native and on-premises technology solutions for casinos, hotels, resorts, cruise ships, managed foodservice providers, sports and entertainment, and healthcare. Agilysys offers the most comprehensive solutions in the industry, including point-of-sale (POS), property management (PMS), inventory and procurement, payment solutions, and related hospitality applications, to manage the entire guest journey. Agilysys is known for its leadership in hospitality, its broad product offerings and its customer-centric service. Some of the largest hospitality companies around the world use Agilysys solutions to help improve guest loyalty, drive revenue growth and increase operational efficiencies.\nThe Company has just one reportable segment serving the global hospitality industry. Agilysys operates across North America, Europe, Asia-Pacific, and India with headquarters located in Alpharetta, GA.\nOur principal executive offices are located at 1000 Windward Concourse, Suite 250, Alpharetta, Georgia, 30005.\nReference herein to any particular year or quarter refers to periods within our fiscal year ended March 31. For example, fiscal 2021 refers to the fiscal year ended March 31, 2021.\nHistory and Significant Events\nOrganized in 1963 as Pioneer-Standard Electronics, Inc., an Ohio corporation, we began operations as a distributor of electronic components and, later, enterprise computer solutions. Exiting the former business in fiscal 2003 with the sale of our Industrial Electronic Division, we used the proceeds to reduce debt and fund growth of our enterprise solutions business. This included acquiring businesses focused on higher-margin and more specialized solutions for the hospitality and retail industries. At the same time, we changed our name to Agilysys, Inc.\nIn fiscal 2004, we acquired Inter-American Data, Inc., which allowed us to become the leading developer and provider of technology solutions for hotel property management and inventory management in the casino and resort industries.\nIn fiscal 2007, we exited the enterprise computer distribution business. We used the proceeds from that sale to return cash to shareholders and fund a number of acquisitions that broadened our solutions and capabilities portfolios. We acquired InfoGenesis, Inc., Visual One Systems Corp. and Eatec Corporation in fiscal 2008, significantly expanding our specialized offerings to the hospitality industry through enterprise-class POS, PMS and inventory and procurement software solutions tailored for a variety of applications in cruise, golf, spa, gaming, lodging, resort and catering. These offerings feature highly intuitive, secure and robust solutions, easily scalable across multiple departments or property locations.\nIn fiscal 2012, we sold our IT solutions business and restructured our business model to focus on higher-margin, profitable growth opportunities in the hospitality and retail sectors. We also reduced our real-estate footprint and lowered overhead costs by relocating corporate services from Solon, Ohio to Alpharetta, Georgia, thus moving our senior management team closer to our remaining operating units.\nIn fiscal 2014, we sold our retail solutions and services business to Kyrus Solutions, Inc. (Kyrus), an affiliate of Clearlake Capital Group, L.P. Following completion of the transaction, our business focused exclusively on hospitality solutions and the growth opportunities in the hospitality market.\nIn fiscal 2018, we opened a software development center in Chennai, India, to supplement our product development efforts.\nToday, we are focused on providing state-of-the-art, end-to-end solutions that enhance guest experiences and allow our customers to promote their brands. We help our customers win the guest recruitment battle and, in turn, grow revenue, reduce costs and increase efficiency. This is accomplished by developing and deploying innovative solutions that increase data speed and accuracy, integrate with other enterprise systems and create a common infrastructure for managing guest data thereby enabling more effective management, intelligent upselling, reduced shrinkage, improved brand recognition and better control of the guest relationship.\nOur strategy is to increase the proportion of revenue we derive from subscription services, cloud applications, ongoing support and maintenance agreements, and professional services.\nProducts, Support and Professional Services\nWe are a leading developer and marketer of software enabled solutions and services to the hospitality industry, including software solutions fully integrated with third party hardware and operating systems; support, maintenance and subscription services; and, professional services. Areas of specialization are point of sale, property management, and a broad range of solutions that support the ecosystem of these core solutions.\nWe present revenue and costs of goods sold in three categories:\n•\nProducts (hardware and software)\n•\nSupport, maintenance and subscription services\n•\nProfessional services\nTotal revenue for these three specific areas is as follows:\nYear ended March 31,\n(In thousands)\nProducts\n$\n26,714\n$\n44,230\n$\n39,003\nSupport, maintenance and subscription services\n88,565\n83,680\n75,496\nProfessional services\n21,897\n32,847\n26,343\nTotal\n$\n137,176\n$\n160,757\n$\n140,842\nProducts: Products revenue is comprised of revenue from the sale of software along with third party hardware and operating systems. Software sales include up front revenue for licensing our solutions on a perpetual basis. Software sales are driven by our solutions’ ability to help customers meet the demands of their guests and improve operating efficiencies. Our software revenue is also driven by the ability of our customers to configure our solutions for their specific needs and the robust catalog of integrations we offer to third party solutions. Our software solutions require varying form factors of third party hardware and operating systems to operate, such as staff facing terminals, kiosk solutions, mobile tablets or servers. Third party hardware and operating system revenue is typically driven by new customer wins and existing customer hardware refresh purchases.\nSupport, Maintenance and Subscription Services: Technical software support, software maintenance and software subscription services are a significant portion of our consolidated revenue and typically generate higher profit margins than products revenue. Growth has been driven by a strategic focus on developing and promoting end to end solutions while market demand for innovative new products addressing specific hospitality needs continues to reinforce this trend. Our commitment to exceptional service has enabled us to become a trusted partner with customers who wish to optimize the level of service they provide to their guests and maximize commerce opportunities both on premise and in the cloud.\nProfessional Services: We have industry-leading expertise in designing, implementing, integrating and installing customized solutions into both traditional and newly created platforms. For existing enterprises, we seamlessly integrate new systems and for start-ups and fast-growing customers, we become a partner that can manage large-scale rollouts and tight construction schedules. Our extensive experience ranges from staging equipment to phased rollouts as well as training staff to provide operational expertise to help achieve maximum effectiveness and efficiencies in a manner that saves our customers time and money.\nOur portfolio of hospitality software solutions:\nThe hospitality industry has long been focused on operating end-to-end businesses, but the technology vendors that service the industry have been focused on product-centric solutions that make use of a high number of software modules and operating silos. To resolve this disconnect and more effectively align with the business operations of our customers, we have evolved our approach to be focused on delivering integrated “platform-centric” solutions for Lodging and Food & Beverage functions, including the applications necessary to support this ecosystem.\nOur technology platform is aimed at transitioning our product and services offerings to better address the needs of hospitality operators as they focus on building better connections with guests before, during and post-visit. We offer an end-to-end solution that helps our customers improve the guest experience, increase top-line performance and reduce operating costs, which leads to opportunities for higher profitability. Our integrated yet modular products allow hospitality operators to recruit and retain customers into their facilities, increase their wallet share from each guest and improve the overall experience throughout the entire guest journey - from the initial customer touch point through post-visit interactions.\nWith our omni-channel suite of software products, we are uniquely positioned to offer solutions that allow customers to adhere to social distancing guidelines, offer contactless solutions at every point of the guest journey, and maximize operational efficiency all while providing an improved guest experience.\nPoint of Sale (POS) Solutions:\nAgilysys POS solution suite allows customers to provide their guests with an omni-channel experience within their property. Guests are empowered to create their own experiences through ordering from a mobile device or walking up to a self-service kiosk, but also providing for a more traditional experience with staff by interacting with a cashier or bar, or having a server come to them. Irrespective of the channel of interaction for the guest, our POS suite provides a single integrated enterprise grade back office management system with robust reporting capabilities. This allows our customers to manage menus, price changes, purchasing trends, inventory management and sales reporting from a single integrated source providing for increased efficiency as well as providing a richer guest profile.\nAgilysys InfoGenesis® POS is an award-winning point of sale solution that combines a fast, intuitive and highly customizable terminal application with powerful, flexible reporting and configuration capabilities in the back office management portal. The system is easy to set up, and its scalable architecture enables customers to add workstations without having to build out expensive infrastructure. The system’s detailed and high-quality reporting capabilities provide insight into sales data and guest purchasing trends. Engineered for all regions of the world, the InfoGensis POS solution suite offers a multinational set of features, including language, currency and fiscal technology, coupled with a robust enterprise management capability enabling the largest global customers to run their business efficiently. With a modern integration platform of APIs, the solution is also capable of integrating with a variety of ancillary applications allowing our customers to keep their entire technology estate. InfoGenesis POS is available as a cloud-based or on-premise solution.\nAgilysys IG Flex is a mobility solution that offers full point of sale functionality on a Windows tablet in 6, 8, or 10” form factors. It provides a sleek, modern alternative to traditional point of sale installations and can be used as a slim fixed terminal or as a convertible mobile POS simply by removing the tablet from its base.\nAgilysys IG KDS is a digital kitchen management solution that integrates with InfoGenesis, rGuest Buy® Kiosk and rGuest Buy OnDemand to deliver staff and customer originated orders to the kitchen for preparation. Custom attributes such as guest phone number, name, guest location or packaging instructions can be provided on each incoming order so the order can be fulfilled promptly to guests. Guests can optionally be notified of order completion via an order status monitor (OSM) or via text message.\nAgilysys IG Buy is an enterprise-class self-service, customer-facing kiosk point of sale solution for the hospitality industry. It is ideal for food & beverage venues such as buffets, grab ‘n go, corporate cafeterias and food courts. Its flexibility supports a variety of operational workflows, such as “order and pay”, “order only”, “pay at cashier” and “self check-out,” and integrates with a variety of property management, casino management and loyalty systems. rGuest Buy Kiosk is currently deployed at more than 270 customer sites across the country, including corporate cafeterias at a top five U.S. bank, a top 40 U.S. law firm, one of the nation’s largest technology manufacturers, and at a national financial services firm.\nAgilysys IG Buy’s intuitive guest-facing order and pay experiences transfer the control and convenience to the end user. The self-service components reduce on-site labor needed to manage venue operations, while improving guest throughput, check size, order accuracy, guest experience and satisfaction. The platform-driven and cloud-based solution allows for easy deployments and management at scale resulting in a lowered overall cost of ownership.\nAgilysys IG OnDemand provides a visual, interactive food and beverage ordering experience to any mobile device - phone, tablet, laptop - with a browser-based self-service experience. Using a simple, intuitive interface, guests can easily order and reorder from anywhere across the property, driving order velocity and volume.\nAgilysys IG OnDemand allows our customers to immediately offer an online ordering platform that is natively integrated with their physical location operations. Menus and price updates can be done in one place and automatically updated across all channels - online web store, digital menus and app ordering as well as POS terminals. Orders placed online are routed automatically to the appropriate kitchen for preparation. Orders placed from all channels are automatically available on the POS terminal at the physical location.\nAgilysys IG OnDemand Full Service ia a complete contactless self-service F&B ordering solution that offers an intuitive guest-facing order and pay experience. IG OnDemand allows guests to place and pay for orders using their own device - phone, tablet, laptop - for pick-up or delivery orders, as well as for a tableside order and pay experience. It supports ordering for multiple guests at a table over the course of a meal using their own devices making the ordering process touchless while freeing up staff to spend more time with guests. The result is dramatically increased revenue opportunities and more chances to enhance guest service.\nAgilysys IG Quick Pay allows guests to use their own mobile device, scan a QR code on the InfoGenesis check, review a digital copy of the check, add a tip & initiate payment, maintaining a fully touchless guest payment experience. The product can be sold as a standalone payment solution or can be bundled with IG OnDemand for a complete order and pay experience.\nAgilysys IG Smart Menu provides a touchless menu display on a guest’s own mobile device - phone, tablet, laptop. Simply scan a QR code to access a venue menu that is linked directly to the actual items available in the IG OnDemand system, not a pdf or a website link. The product can be sold as a standalone menu solution or can be bundled with IG OnDemand for a complete menu, order and pay experience.\nAgilysys IG Digital Menu Board provides large screen menu and image display on commercial television monitors. It will display a venue menu that is linked directly to the actual items available in the IG OnDemand system, not a pdf or a website link, so it can easily reflect the latest items and pricing.\nProperty Management Systems (PMS):\nAgilysys offers the most comprehensive suite of property management applications to serve the needs of our integrated resort and hospitality customers. Our platforms enable our customers to provide a seamless experience to their guests while driving operational efficiencies throughout the value chain. Our PMS suite of applications consists of the core property management system, a commission free booking engine, self-service check in and check out solutions, spa, golf, retail, accounting, sales and catering, service request optimization and condo management applications.\nAgilysys LMS™ is an on-premise or hosted, web and mobile-enabled, PMS solution targeting the operator with large, complex operations. It runs 24/7 to automate every aspect of hotel operations in properties from 100 to over 7,000 rooms, and has interfaces to a wide array of industry applications including but not limited to all core casino management systems and leading global distribution systems. Its foundation expands to incorporate modules for activities scheduling, attraction ticketing and more.\nAgilysys Visual One® PMS is installed in hotels and resorts ranging from 50-1,500 rooms. It is a complete hospitality solution expanding beyond traditional PMS solutions enabling the resort to run its end-to-end operations, including front desk, housekeeping, sales & catering, maintenance, accounting, condo owner management, golf, retail POS, and activities. Visual One provides an integrated solution with interfaces to leading global distribution systems, casino management systems, hospitality automation and our other products.\nAgilysys Stay PMS is the company’s cloud-native SaaS property management system that optimizes operational efficiency, increases revenue and enhances guest service. Agilysys Stay is currently generally available for all hotels and chains, as well as for select service casino hotels. The guest-centric PMS leverages an open architecture with restful APIs to enable richly integrated applications delivered from Agilysys, its partners and customers. Agilysys Stay offers powerful capabilities for multi-property operations, allowing managers to view guest profiles, history and reservations, as well as room availability and operational reports, seamlessly across multiple properties.\nFocused on improving revenue and streamlining operations, Agilysys Stay is designed to enable hotels to gather and analyze guest information across properties that can be used to create loyalty-generating offers and increase guest wallet share. In addition, running natively in a browser on both desktop and tablet devices, it delivers real-time operating metrics so that hotels can more accurately forecast demand and scale guest services accordingly.\nVirtual Check-in and Check-out Solutions\nToday’s hotels cater to guests with high expectations when it comes to technological efficiency. An emerging trend in the hotel industry that has accelerated in the COVID-19 environment, where social distancing is now the norm, is the ability for guests to check themselves in or out of their room without interacting with the front desk. To that end, we offer software modules that enable this approach and are fully integrated with our core PMS solutions.\nrGuest Express - Kiosk simplifies check-in and check-out, optimizes staff productivity and enhances the guest experience by enabling a seamless self-service option for guests to use in the hotel lobby at a kiosk. More properties are turning to kiosks to reduce overhead and offer more self-service options. With rGuest Express - Kiosk, it’s easy to elevate service levels without adding front-line staff. rGuest Express - Kiosk provides ID verification to allow for hotels to enforce security standards efficiently and to allow the guest to bypass the front desk and observe social distancing guidelines.\nrGuest Express - Mobile simplifies check-in and check-out even further and at the same time allows operators to offer mobile keys, concurrent dining reservations or room upsells, all on a personal mobile device such as a smart phone or tablet. Properties are turning to mobility at an ever-increasing pace to improve efficiency. With rGuest Express - Mobile, it’s easy to reduce wait times and empower guests by putting the power of choice in the palm of their hand. rGuest - Express Mobile allows for digital ID verification before securely delivering the digital room key to the guest phone allowing operators to maintain security standards while allowing the guest to bypass the front desk.\nPoint of Sale and Property Management Ecosystem Offerings:\nThe following solutions integrate with and are complementary to our point of sale or property management systems, or both. These solutions, for the most part, can stand alone and do not require POS or PMS to be functional. However, we lead with our core POS and PMS solutions discussed above and focus on selling these complimentary ecosystem solutions into our customer base.\nAgilysys Pay payment processing solution is our innovative payment gateway. Agilysys Pay protects guests’ financial data and reduces risk by leveraging point-to-point encryption (P2PE) and tokenization with every credit card transaction. Agilysys Pay Complete leverages one of the first payment gateways in the world to receive official PCI-P2PE validation, allowing us to offer PCI cost and scope reduction that other providers cannot. These security benefits are built on top of a full-featured, enterprise-grade gateway that offers broad support for U.S., Canadian, European and certain Asian countries’ credit card processors and a wide variety of payment device options for every use-case, including countertop, pay-at-table, EMV, mobile tablet, and signature capture scenarios.\nAgilysys Pay offers contactless payment options on all markets as well as supporting various wallet payment options like Apple Pay®, Google Pay®, AliPay®, and WeChat®.\nAgilysys Spa software covers all aspects of running a spa, from scheduling guests for services to managing staff schedules. With this guest-centric technology, spas have more time to focus on creating personalized experiences in places of quiet tranquility. Agilysys Spa is a single solution that connects effortlessly to our other software solutions. The solution includes real-time integration, simplifies the appointment booking process, enhances the guest experience, and maximizes the value of the spa as a revenue center.\nIntegrated with our booking engine, rGuest Book, customers can book both their hotel room and their spa appointments from a single place giving operators additional opportunities to upsell and cross sell various amenities that they can offer.\nrGuest Golf is a guest centric golf management software that offers golf property managers complete pro shop management with tee time scheduling, member profile/billing, tournament management and Web and e-mail access bundled into one solution. Customers are given the option of using our robust built in retail POS module or they may choose to leverage the power of InfoGenesis. Staff can easily schedule and personalize reservations for guests which then appear on itineraries, confirmations, and folios. Resort operations with multiple amenities can integrate with rGuest Book and allow patrons to book both their resort reservation and their golf tee time simultaneously.\nrGuest Book is a commission-free, easy-to-use reservation system that’s designed to move guests effortlessly through the booking process of hotel rooms, spa appointments and golf tee times. The solution allows booking of one or more rooms and is seamlessly connected with our core PMS solutions to provide a flawless experience for guests and hotel operators. rGuest Book is the only booking engine in the market that seamlessly integrates with the core primary gaming system and allows for casino operators to enable their patrons to self-book their entitlements resulting in increased guest satisfaction and reduced operational expenses. The solution also allows operators to capture increased revenue through add-ons and upsells of premium rooms.\nrGuest Service is our new integrated service optimization platform that allows our customers to provide an integrated hospitality experience for their guests while driving greater operational efficiency by connecting departments across the hotel - front desk, house-keeping, concierge, maintenance, bell desk, food runners, wait staff, etc. The rGuest service platform provides a unified communication and messaging service for guest and staff interaction as well as internal staff interaction. Apart from providing the functionality for managing back of house operations like house-keeping, engineering and maintenance, the rGuest service platform proactively tracks events and exceptions that take place in the hotel or resort and drive targeted action to ensure high level of guest satisfaction at all times.\nAgilysys authorize provides support for fully-automated and secure online payments for any room deposits, 3rd party guarantees and folio charges - while eliminating the need for manual credit card authorization forms. Payment is seamlessly authorized and posted appropriately in real-time.\nAgilysys’ Eatec® solution provides core purchasing, inventory, recipe, forecasting, production and sales analysis functions and is unique in offering catering, restaurant, buffet management and nutrition modules in a single web-enabled solution. Agilysys’ Eatec Mobile is an optional app that can be downloaded from Google Play and Apple app stores and provides users with access to Eatec application from any Android® and iOS® device. Users can provide inventory receiving and transfer operations seamlessly from any mobile device even when they are offline using Eatec’s innovative store and forward capabilities.\nAgilysys Stratton Warren System (SWS) integrates with all leading financial and POS software products. The software manages the entire procurement process via e-commerce, from business development to the management of enterprise-wide backend systems and daily operations. Agilysys SWS Direct is an add-on module for SWS that provides a convenient, efficient and intuitive shopping cart experience to SWS users. SWS Direct streamlines operations, provides enhanced bidding and request for pricing services, and offers supplier registration tools and self-service maintenance capabilities.\nAgilysys DataMagine™ document management solution is a U.S.-patented imaging module and archiving solution that allows users to securely capture and retrieve documents and system-generated information. DataMagine integrates with other Agilysys products, adding functionality and providing seamless workflows that cross functional areas. DataMagine helps drive the Go Green initiative at a number of our customer sites by enabling a completely paperless experience through all facets of the customers operations - from signature capture at the front desk to automated routing of PO’s and requisition orders for approvals. DataMagine provides robust indexing and archiving features to allows easy contextual based document retrieval.\nAgilysys Seat solution is a guest-centric reservation and wait list management solution that helps operators to book any location. The solution allows operators to manage restaurant, cabana and auditorium reservations. With an innovative doll house view approach, patrons have the ability to select and book a specific seat in a restaurant or a specific cabana on a pool deck online. With built in price yielding capabilities, rGuest Seat allows operators to maximize revenue opportunities for various locations. Using the built-in guest management system, operators can build guest profiles and provide a superior experience while driving repeat guests.\nAgilysys Analyze is a cloud-based data analytic platform focused on the needs of the hospitality industry. It is a full business intelligence solution that collects data from Agilysys point of sale and property management solutions and helps food & beverage and property operators gain critical insight into business operations and performance. Out-of-the-box analysis helps hospitality operators manage costs, minimize loss due to fraud, boost item sales, increase server productivity, occupancy, room revenue, and other profit enhancing capabilities.\nRepresentative Agilysys clients include:\n7 Cedars Casino\nDickies Arena\nPinehurst Resort\nAVI Foodsystems, Inc.\nDrury Hotels\nPrairie Band Casino & Resort\nBanner Health\nEllis Island Hotel, Casino and Brewery\nResorts World Bimini\nBoyd Gaming Corporation\nGolden Nugget Lake Charles\nRosen Hotels & Resorts\nCaesars Entertainment\nGrand Central Hotel in Belfast\nRosewood Castiglion Del Bosco\nCal Dining at UC Berkeley\nGrand Sierra Resort and Casino\nRoyal Caribbean Group\nCamelback Lodge & Waterpark\nHialeah Park\nSeaport District - NYC\nCarnival UK\nHilton Worldwide\nSpooky Nook Sports\nCartoon Network Hotel\nIntercontinental Hotel Group\nStations Casino\nCasino del Sol Resort\nKiawah\nThe Venetian Resort Hotel Casino\nCatholic Charities\nKimpton Hotels\nThe Kessler Collection\nChukchansi Gold Resort & Casino\nLongwood University\nTreehouse - London\nCompass Group North America\nMaryland Live! Casino\nVail Resorts\nComanche Nation of Oklahoma\nMGM\nValley View Casino & Hotel\nCosta Pacifica\nOxford Casino\nVanderbilt University\nThe Cosmopolitan of Las Vegas\nPalm Garden Hotel\nWendover Resorts\nCrystal Springs Resort\nIndustry and Markets\nWe are a technology software solutions company exclusively focused on the hospitality industry. Our products have been enabling mission-critical core hospitality operations for more than four decades. Our software solutions are required to run the operations of the hospitality business and designed to drive substantial customer benefits through increased revenue, improved operational efficiency, enhanced guest experience and improved employee morale. In addition, many of our solutions enable social distancing capabilities for our customers. Our innovative software solutions described above have been purpose-built to serve the unique needs of the following hospitality sectors: casinos, hotels, resorts, cruise ships, managed foodservice providers, sports and entertainment, and healthcare. We operate across North America, Europe, Asia-Pacific and India with headquarters located in Alpharetta, GA.\nThe sectors we serve are going through unprecedented and uncertain times with the COVID-19 pandemic. As more people receive vaccinations and pandemic-related restrictions begin to ease, we are seeing the initial signs of recovery and re-opening in the markets we serve. Therefore, the long-term outlook remains strong and we expect the momentum from the three years preceding the pandemic to eventually pick back up with a focus on social distancing and mobile applications. Prior to COVID-19, we estimated our total addressable market to be approximately $4.8 billion in annual recurring revenue opportunity. While the size of the opportunity might face pressure in an economic downturn, we feel it is still in the billions of dollars and we are only a fraction of that size. We continue to feel good about our opportunity to win market share given our relative competitive strength in the industry.\nCustomers\nOur customers include large, medium-sized and boutique hospitality providers, both owned and franchised, as well as divisions or departments of large corporations in the hospitality industry. We concentrate on serving the needs of customers in a range of customer-focused settings where brand differentiation is important and guest recruitment is intense. Our customer base is highly fragmented.\nHuman Capital\nAs of March 31, 2021, we employed approximately 1,350 employees, with approximately 68%, 28%, 3%, and 1% of our employees located in India, the United States, APAC, and EMEA, respectively. We consider our relationship with our employees to be good and a critical factor in our success.\nOur senior management team is responsible for developing and executing our human capital strategy. We seek employees who share a passion for technology and its ability to improve our customers’ businesses in hospitality. We believe we offer fair, competitive compensation and benefits that support our employees’ overall well-being and foster their growth and development. We offer our employees pay and benefits packages that we believe are competitive with others throughout our industry, as well as within the local markets in which we operate, and align individual performance with our success.\nWe encourage our employees to embrace different ideas, strengths, interests and cultural backgrounds. We are committed to providing our employees with an environment free of discrimination, harassment and workplace violence. We make all benefit and employment-related decisions in compliance with established equal employment opportunity statutes and without regard to religion, national origin, age, gender, race, color, ancestry, sexual orientation, disability, marital status, citizenship, pregnancy, medical condition or any other protected class status, as defined by local, state or federal laws. All employees, directors, independent contractors, and other parties who work with Agilysys are expected to create a working environment where everyone is respected, regardless of individual differences. Valuing each person’s character, virtues, and individual experiences will leverage our ability to attract and retain quality employees, customers, and suppliers.\nIn response to the COVID-19 pandemic, we implemented significant changes that we determined were in the best interest of our employees as well as the communities in which we operate. These changes include having most of our employees work from home until the pandemic eases while implementing additional safety measures for employees continuing critical on-site work at our customers’ locations. We have taken, and will continue to take, actions in accordance with the applicable local guidance, such as the guidance provided by the Centers for Disease Control and Prevention in the United States, to protect our employees so they can more safely and effectively perform their work.\nSeasonality\nOccasionally, the timing of large one-time orders, such as those associated with significant remarketed product sales around large customer refresh cycles or significant volume rollouts, creates variability in our quarterly results.\nCompetition\nOur solutions face a highly competitive market. Competition exists with respect to developing and maintaining relationships with customers, pricing for products and solutions, and customer support and service.\nWe compete with other full-service providers that sell and service bundled POS and PMS solutions comprised of hardware, software, support and services. These companies, some of which are much larger than we are, include Oracle Corp., Shiji, Amadeus IT Group and Infor. We also compete with smaller software companies like POSitouch, Northwind and Appetize Technologies. In addition, we compete with PMS systems that are designed and maintained in-house by large hotel chains.\nEnvironmental Matters\nWe believe we are compliant in all material respects with all applicable environmental laws. Presently, we do not anticipate that such compliance will have a material effect on capital expenditures, earnings or competitive position with respect to any of our operations.\nAccess to Information\nOur annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and any amendments to these reports are available free of charge through our corporate website, http://www.agilysys.com, as soon as reasonably practicable after such material is electronically filed with, or furnished to, the Securities and Exchange Commission (SEC). The information posted on our website is not incorporated into this Annual Report. Reports, proxy and information statements, and other information regarding issuers that file electronically, are maintained on the SEC website, http://www.sec.gov.",
    "item_1A": "Item 1A. Risk Factors.\nRisks Relating to Our Business\nCOVID-19 has adversely impacted our business and may further impact our business, financial results and liquidity for an unknown period of time.\nThe global spread and unprecedented impact of COVID-19 has resulted in disruption to our business, the hospitality industry and the global economy. The COVID-19 pandemic has led government and other authorities around the world to impose measures intended to control its spread, including restrictions on freedom of movement, gatherings of large numbers of people, and business operations such as travel bans, border closings, business closures, quarantines, shelter-in-place orders, and social distancing measures. Even as these restrictions have been relaxed in some parts of the world, such as many areas of the United States, they remain effective in other parts of the world and have frequently been reimposed in many locations after having been relaxed as a result of additional outbreaks. As a result, the COVID-19 pandemic and its consequences have significantly reduced demand for gaming, hotels, resorts, cruises, corporate foodservice, restaurants, university cafeterias, and stadia and have had a material detrimental impact on global commercial activity across these hospitality industries that we serve, and in some cases, has caused the closure of our customers’ businesses. Business closures have resulted in our inability to complete certain implementations and negatively impacted our ability to recognize revenue.\nThe extent to which COVID-19 continues to adversely impact our business, operations, and financial results significantly depends on the effect upon the demand for our customers’ hospitality services, which may be affected by, among other things, the duration and scope of COVID-19 (including whether and to what extent a resurgence of the virus could occur after the pandemic initially subsides); the negative impact it has on global regional economies and economic activity, including its impact on unemployment rates and consumer confidence and discretionary spending; its short and longer-term impact on the demand for hospitality businesses; the ability of our customers to successfully navigate the impacts of COVID-19; actions governments, businesses and individuals take in response to the pandemic; and how quickly economies, travel activity, businesses, universities and demand for lodging, destination resorts, cruises and stadia events recovers after the pandemic subsides. To the extent that our hospitality customers’ businesses continue to be impacted, it may have the following effects on our business:\n•\nEffect on Revenue and Liquidity: If our hospitality customers suffer delayed recovery in their revenues, they could be unable to continue to pay for our services, and potentially even go out of business. If our customers are unable or unwilling to continue to pay for our services on a timely basis or at all, our revenue and liquidity would be adversely affected.\n•\nEffect on Growth: As a result of the material sustained reduction in our hospitality customers’ revenue, our customers and prospective customers have substantially curtailed new technology purchases. Customers may also have difficulty obtaining new financing or drawing on existing credit facilities, resulting in them having diminished capital to spend on new technology purchases. Finally, customers or prospective customers may delay, terminate or not go forward with projects in development, for which we may have sold or software.\nIn response to COVID-19, we took steps to reduce operating costs and improve efficiency, including furloughing approximately 24% of our employees in the United States, APAC and EMEA during the year. As of May 17, 2021, less than 10 employees remain on furlough. However, the steps we took, and further changes we may make in the future to control our costs, may negatively impact our ability to attract and retain employees. If this were to occur, we may experience operational challenges that result in a negative impact on our customer services and ultimately, loss of market share, which could limit our ability to grow and expand our business.\nOur business is impacted by changes in macroeconomic and/or global conditions.\nWe conduct our business internationally, changes in global, national, or regional economies, governmental policies (including in areas such as trade, travel, immigration, healthcare, and related issues), geopolitical conditions (such as political unrest and armed conflicts), natural disasters, or outbreaks of disease (such as COVID-19 pandemic) may impact our business. Any general weakening of, and related declining corporate confidence in, the global economy or the curtailment in corporate spending could cause current or potential customers to reduce or eliminate their information technology budgets and spending, which could cause customers to delay, decrease or cancel purchases of our products and services; cause customers not to pay us; or to delay payment for previously purchased products and services.\nFor example, our business is impacted by decreases in travel and leisure activities resulting from weak economic conditions, increases in energy prices and changes in currency values, political instability, heightened travel security measures, travel advisories, disruptions in air travel, and concerns over disease, violence, war, or terrorism. As discussed above under “COVID-19 has adversely impacted our business and may further impact our business, financial results and liquidity for an unknown period of time,” our performance has been affected by these conditions associated with COVID-19 and could be further materially affected going forward if these conditions continue for an additional extended period or in other circumstances that we are unable to foresee or mitigate. Even after COVID-19 subsides, our business, markets, growth prospects and business model could be materially impacted or altered as a result of adverse changes in travel and leisure activities.\nSimilarly, increases in energy prices can result in higher ingredient and food costs for our customers with restaurant operations, which may adversely affect demand for our customers’ restaurant businesses, and in turn, our business, financial results and liquidity.\nOur business may be adversely impacted by international trade disputes.\nWe depend on third-party manufacturers and suppliers located outside of the United States, including in China, in connection with the supply of certain of our hardware products and related components. Accordingly, our business is subject to risks associated with international supply. For example, in recent years the United States has imposed and extended greater restrictions on international trade and significant increases in tariffs on goods imported into the United States from China and other countries. Increased tariffs, including on goods imported from China, or the institution of additional protectionist trade measures could adversely affect our supply costs, and in turn, our business, financial results and liquidity.\nOur future success will depend on our ability to develop new products, product upgrades and services that achieve market acceptance.\nOur business is characterized by rapid and continual changes in technology and evolving industry standards. We believe that in order to remain competitive in the future we need to continue to develop new products, product upgrades and services, requiring the investment of significant financial resources. If we fail to accurately anticipate our customer’s needs and technological trends, or are otherwise unable to complete the development of a product or product upgrade on a timely basis, we will be unable to introduce new products or product upgrades into the market that are demanded by our customers and prospective customers on a timely basis, if at all, and our business and operating results would be materially and adversely affected.\nThe development process for most new products and product upgrades is complicated, involves a significant commitment of time and resources and is subject to a number of risks and challenges including:\n•\nManaging the length of the development cycle for new products and product enhancements;\n•\nAdapting to emerging and evolving industry standards and to technological developments by our competitors and customers; and\n•\nExtending the operation of our products and services to new and evolving platforms, operating systems and hardware products, such as mobile devices.\nOur product development activities are costly and recovering our investment in product development may take a significant amount of time, if it occurs at all. We anticipate continuing to make significant investments in software research and development and related product opportunities because we believe it is necessary to compete successfully. We cannot estimate with any certainty when we will, if ever, receive significant revenues from these investments.\nIf we are not successful in managing these risks and challenges, or if our new products, product upgrades, and services are not technologically competitive or do not achieve market acceptance, our business and operating results could be adversely affected.\nIf we fail to meet our customers’ performance expectations, our reputation may be harmed, and we may be exposed to legal liability.\nOur ability to attract and retain customers depends to a large extent on our relationships with our customers and our reputation for high quality services and solutions. As a result, if a customer is not satisfied with our products and services, our reputation may be damaged. Moreover, if we fail to meet our customers’ performance expectations or if customers experience service disruptions,\nbreaches or other quality issues, we may lose customers and be subject to legal liability, particularly if such failure, service disruptions or breaches adversely impact our customers’ businesses.\nIn addition, many of our projects are critical to the operations of our customers’ businesses. While our contracts typically include provisions designed to limit our exposure to legal claims relating to our products and services, these provisions may not adequately protect us or may not be enforceable in all cases. The general liability insurance coverage that we maintain, including coverage for errors and omissions, is subject to important exclusions and limitations. We cannot be certain that this coverage will continue to be available on reasonable terms or will be available in sufficient amounts to cover one or more large claims, or that the insurer will not disclaim coverage as to any future claim. A successful assertion of one or more large claims against us that exceeds our available insurance coverage or changes in our insurance policies, including premium increases or the imposition of large deductible or co-insurance requirements, could adversely affect our profitability.\nWe face extensive competition in the markets in which we operate, and our failure to compete effectively could result in price reductions and/or decreased demand for our products and services.\nSeveral companies offer products and services similar to ours. The rapid rate of technological change in the hospitality market makes it likely we will face competition from new products designed by companies not currently competing with us. We believe our competitive ability depends on our product offerings, our experience in the hospitality industry, our product development and systems integration capability, and our customer service organization. There is no assurance, however, that we will be able to compete effectively in the hospitality technology market in the future.\nWe compete for customers based on several factors, including price. The competitive markets in which we operate may oblige us to reduce our prices in order to contend with the pricing models of our competitors. If our competitors discount certain products or services, we may have to lower prices on certain products or services in order to attract or retain customers. Any such price modifications would likely reduce margins and could have adverse effects. In addition, if we fail to reduce our prices in order to contend with the pricing models of our competitors, we may not be able to retain customers or grow our business, which could adversely affect our revenues and liquidity.\nCyber-attacks involving our systems and data could expose us to liability or harm our reputation and have a material adverse effect on our business.\nWe have implemented security measures and controls intended to protect our IT infrastructure, data centers and other systems and data against cyber-attacks. Despite our implementation of security measures and controls, our systems and those of third parties upon whom we rely are vulnerable to attack from numerous threat actors, including sophisticated nation-state and nation-state-supported actors. Threat actors have and may in the future be able to compromise our security measures or otherwise exploit vulnerabilities in our systems, including vulnerabilities that may have been introduced through the actions of our employees or contractors or defects in the design or manufacture of our products and systems or the products and systems that we procure from third parties. Our systems, and those of our third-party providers, have and could in the future become subject to cyber-attacks, including using computer viruses, credential harvesting, dedicated denial of services attacks, malware, social engineering, and other means for obtaining unauthorized access to, or disrupting the operation of, our systems and those of our third-party providers.\nThe number and scale of cyberattacks have continued to increase and the methods and techniques used by threat actors, including sophisticated “supply-chain” attacks, continue to evolve at a rapid pace. As a result, we may be unable to identify current attacks, anticipate future attacks or implement adequate security measures. We may also experience security breaches that may remain undetected for an extended period and, therefore, have a greater impact on our systems, our products, the proprietary data contained therein, our customers and ultimately, our business.\nThese events, and any related operational disruptions, unauthorized access, or misappropriation of information (including personally identifiable information or personal data), could create costly litigation, significant financial liability, and a loss of confidence in our ability to serve customers and cause current or potential customers to choose another provider, all of which could have a material adverse effect on our business, financial condition, reputation, and results of operations.\nWe are subject to laws and regulations governing the protection of personally identifiable information. A failure to comply with applicable privacy or data protection laws could harm our reputation and have a material adverse effect on our business.\nWe collect, process, transmit, and/or store (on our systems and those of third-party providers) customer transactional data, as well as their and our customers’ and employees’ personally identifiable information and/or other data and information. Personally identifiable information is increasingly subject to legislation and regulations in numerous jurisdictions with regard to privacy and data security such as such as the California Consumer Privacy Act and the European Union’s General Data Protection Regulation. Moreover, what constitutes personally identifiable information and what other data and/or information is subject to the privacy laws varies by jurisdiction and continues to evolve, and the laws that do reference data privacy continue to be interpreted by the courts and their applicability and reach are therefore uncertain. Our failure and/or the failure of our customers, vendors, and service providers to comply with applicable privacy and data protection laws and regulations could damage our reputation, discourage current and/or\npotential customers from using our products and services, and result in fines, governmental investigations and/or enforcement actions, complaints by private individuals, and/or the payment of penalties to consumers.\nActual or perceived security vulnerabilities in our software products may result in reduced sales or liabilities.\nOur software may be used in connection with processing personal data and other sensitive data (e.g., credit card numbers). It may be possible for the data to be compromised if our customer does not maintain appropriate security procedures. In those instances, the customer may attempt to seek damages from us. While we believe that all of our current software complies with applicable industry security requirements and that we take appropriate measures to reduce the possibility of breach through our development and implementation processes, we cannot assure that our customers’ systems will not be breached, or that all unauthorized access to our software can be prevented. If a customer, or any other person, seeks redress from us as a result of a security breach of our software, our business could be adversely affected.\nWe have incurred losses in each of the last several years, and we may continue to incur losses in the future.\nWe have incurred operating losses in each of the last several years, including the year ended March 31, 2021, and we may continue to incur losses in the future as we continue to invest in our products. Our lack of profitability limits the resources available to us to invest in developing new products, product upgrades and services and otherwise in improving business operations.\nWe may incur goodwill and intangible asset impairment charges that adversely affect our operating results.\nAs of March 31, 2021, we had $19.6 million and $8.4 million of goodwill and intangible assets (including capitalized software development costs), net, respectively, on our Consolidated Balance Sheet. We review our goodwill and intangible assets for impairment on at least an annual basis. As of March 31, 2020, we determined the net realizable value of intangible assets consisting of capitalized software development costs for certain solutions within our rGuest suite of products no longer exceeded their carrying value, and as a result, recorded non-cash impairment charges of $22.0 million. The impact of the COVID-19 pandemic on the hospitality industry resulted in significantly lower sales and cash flow projections for the related rGuest solutions after evaluating the Company’s strategy for market development and continued costs to support the software. As a result, we recorded impairment charges to reduce the net realizable value of the related assets to zero. Our future operating results and the market price of our common stock could be materially adversely affected if we are required to write down the carrying value of goodwill or other intangible assets in the future.\nIf we fail to attract, retain and motivate key employees, our business may be harmed.\nOur success depends on the skill, experience and dedication of our employees. There can be no assurance that we will be able to successfully attract, retain and motivate the personnel that we need. If we are unable to attract, retain and motivate sufficiently experienced and capable personnel, especially in product development, customer services and support, operations, sales and management, our business and financial results may suffer. For example, if we are unable to attract and retain a sufficient number of skilled technical personnel, our ability to develop high quality products and provide high quality customer service may be impaired. Experienced and capable personnel in the technology industry remain in high demand, and there is continual competition for their talents. Although we believe our compensation, benefits and other employment amenities are competitive in the markets in which we compete for talent, we may have difficulty attracting sufficiently experienced and capable personnel or retaining and motivating talented employees, and in such events our business may suffer.\nAdditionally, in response to COVID-19, we furloughed approximately 24% of our employees in the United States, APAC and EMEA to reduce operating costs and improve efficiency. If this action negatively impacts our ability to attract employees or if employees we desire to return to work do not resume their employment at the end of the furlough, we may experience operational challenges that result in a negative impact on our customer services and ultimately, loss of market share, which could limit our ability to grow and expand our business. See “COVID-19 has adversely impacted our business and may further impact our business, financial results and liquidity for an unknown period of time” above for additional information regarding this risk.\nOur international operations have many associated risks.\nWe continue to strategically manage our presence in international markets, and these efforts require significant management attention and financial resources. We may not be able to successfully penetrate international markets, or, if we do, there can be no assurance that we will grow our business in these markets at the same rate as in North America. Because of these inherent complexities and challenges, lack of success in international markets could adversely affect our business, results of operations, cash flow, and financial condition.\nWe have international offices in the United Kingdom, China, Hong Kong, Malaysia, the Philippines, Singapore, and India. We have committed resources to maintaining and further expanding, where appropriate, our sales offices and sales and support channels in key\ninternational markets. However, our efforts may not be successful. International sales are subject to many risks and difficulties, including those arising from the following: building and maintaining a competitive presence in new markets; staffing and managing foreign operations; complying with a variety of foreign laws; producing localized versions of our products; developing integrations between our products and other locally-used products; import and export restrictions and tariffs, enforcing contracts and collecting accounts receivable; unexpected changes in regulatory requirements; reduced protection for intellectual property rights in some countries; potential adverse tax treatment; language and cultural barriers; currency fluctuations; and political and economic instability abroad.\nNatural disasters or other catastrophic events affecting our principal facilities could cripple our business.\nNatural disasters or other catastrophic events, particularly those affecting employees in our Alpharetta headquarters or India research and development center, may cause damage or disruption to our operations, and thus could have a negative effect on us. Most of our administrative functions are concentrated in our Alpharetta headquarters and most of our software development activity is concentrated in our India research and development center. We maintain crisis management and disaster response plans, and during the COVID-19 pandemic, substantially all of our employees throughout the world have been capable of working from home for months at a time without significantly impacting our business. However, a natural disaster, fire, power shortage, pandemic, act of terrorism or other catastrophic event occurring in either geographic location that prevents or substantially impairs our employees’ ability to work, either in the office or from home, could make it difficult or impossible for us to deliver our products and services to customers.\nWe may not be able to enforce or protect our intellectual property rights.\nWe rely on a combination of copyright, patent, trademark and trade secret laws and restrictions on disclosure to protect our intellectual property rights. We cannot be certain that the steps we have taken will prevent unauthorized use of our technology. Any failure to protect our intellectual property rights would diminish or eliminate the competitive advantages that we derive from our proprietary technology.\nWe may be subject to claims of infringement of third-party intellectual property rights.\nThird parties may assert claims that our software or technology infringe, misappropriate, or otherwise violate their intellectual property or other proprietary rights. Such claims may be made by our competitors seeking to obtain a competitive advantage or by other parties. The risk of claims may increase as the number of software products that we offer and competitors in our market increase and overlaps occur. Any such claims, regardless of merit, that result in litigation could result in substantial expenses, divert the attention of management, cause significant delays in introducing new or enhanced services or technology, materially disrupt the conduct of our business, and have a material adverse effect on our business, financial condition, and results of operations.\nWhile we do not believe that our products and services infringe any patents or other intellectual property rights, from time to time, we receive claims that we have infringed the intellectual property rights of others. For example, on April 6, 2012, Ameranth, Inc. filed a complaint against us in the U.S. District Court for the Southern District of California, alleging that certain of our products infringe patents owned by Ameranth directed to configuring and transmitting hospitality menus (e.g., restaurant menus) for display on electronic devices, and synchronizing the menu content between the devices. This lawsuit remains pending.\nIf we fail to maintain our data centers and other systems, the demand for our subscription services and our ability to operate our business efficiently could diminish, which could have a material adverse effect on our business.\nWe currently utilize data center hosting facilities, some of which are managed by third-parties, to provide cloud-based products and hosting services to our customers and to support our internal business operations. If these data center facilities fail or encounter any damage, it could result in interruptions in services to our customers or disruption of our business operations. This could result in unanticipated downtime for our customers, and in turn, our reputation and business could be adversely affected. Similarly, any significant disruption or deficiency in the operation of our internal systems could have a material adverse effect on our ability to fulfill and invoice customer orders, apply cash receipts, place purchase orders with suppliers, and make cash disbursements, which may have a material adverse effect on our business, financial condition, or results of operations.\nIf we fail to maintain an effective system of internal controls, we may not be able to detect fraud, which could have a material adverse impact on our business.\nWhile we believe our internal control over financial reporting is effective, a controls system cannot provide absolute assurance that the objectives of the controls system are met, and no evaluation of controls can provide absolute assurance that control issues and instances of fraud, if any, within our company have been detected.\nWe have encountered risks associated with maintaining large cash balances.\nWhile we have attempted to invest our cash balances in investments we considered to be relatively safe, we nevertheless confront credit and liquidity risks. Bank failures could result in reduced liquidity or the actual loss of money held in deposit accounts in excess of federally insured amounts, if any.\nIf we acquire new businesses, we may not be able to successfully integrate them or attain the anticipated benefits.\nAs part of our operating history and growth strategy, we have acquired other businesses. In the future, we may continue to seek acquisitions. We can provide no assurance that we will be able to identify and acquire targeted businesses or obtain financing for such acquisitions on satisfactory terms. The process of integrating acquired businesses into our operations may result in unforeseen difficulties and may require a disproportionate amount of resources and management attention. If integration of our acquired businesses is not successful, we may not realize the potential benefits of an acquisition or suffer other adverse effects.\nWe may have exposure to greater than anticipated tax liabilities.\nSome of our products and services may be subject to sales taxes in states where we have not collected and remitted such taxes from our customers. We have reserves for certain state sales tax contingencies based on the likelihood of obligation. These contingencies are included in “Other non-current liabilities” in our Consolidated Balance Sheets. We believe we have appropriately accrued for these contingencies. In the event that actual results differ from these reserves, we may need to make adjustments, which could materially impact our financial condition and results of operations.\nWe are subject to litigation, which may be costly.\nAs a company that does business with many customers, employees and suppliers, we are subject to litigation. The results of such litigation are difficult to predict, and we may incur significant legal expenses if any such claim were filed. While we generally take steps to reduce the likelihood that disputes will result in litigation, litigation is very commonplace and could have an adverse impact on our business.\nOur dependence on certain strategic partners makes us vulnerable to the extent we rely on them.\nWe rely on a concentrated number of vendors for the majority of our hardware and for certain software and related services needs. We do not have long term agreements with many of these vendors. If we can no longer obtain these hardware, software or services needs from our major suppliers due to mergers, acquisitions or consolidation within the marketplace, material changes in their partner programs, their refusal to continue to supply to us on reasonable terms or at all, and we cannot find suitable replacement suppliers, it may have a material adverse impact on our future operating results and gross margins.\nRisks Relating to the Industries We Serve\nOur business depends to a significant degree on the hospitality industry and instability and downturns in the hospitality industry could adversely affect our business and results of operations.\nBecause our customer base is concentrated in the hospitality industry, our business is largely dependent on the health of that industry. Our sales are dependent in large part on the health of the hospitality industry, which in turn is dependent on the domestic and international economy. Instabilities or downturns in the hospitality industry, such as those resulting from the impact of COVID-19, as discussed above, could disproportionately impact our revenue, as customers may exit the industry or delay, cancel or reduce planned expenditures for our products. For additional information regarding the potential impact of COVID-19 on our business, see “COVID-19 has adversely impacted our business and may further impact our business, financial results and liquidity for an unknown period of time” above for additional information.\nConsolidation in the gaming and other hospitality industries could adversely affect our business.\nCustomers that we serve may seek to achieve economies of scale and other synergies by combining with or acquiring other companies. The hospitality industry has experienced recent consolidations, including the hotel and gaming sectors of the industry. Although recent consolidations in the hospitality industry have not materially adversely affected our business, there is no assurance that future consolidations will not have such affect. For example, if one of our current customers merges or consolidates with a company that relies on another provider’s products or services, it could decide to reduce or cease its purchases of products or services from us, which could have an adverse effect our business.\nInsolvencies in the hospitality industry could adversely affect our business.\nCustomers that we serve may be or become insolvent. Most of our customers have been significantly affected by the COVID-19 pandemic. Loss of revenue and other operating challenges may cause some of our customers to declare bankruptcy or cause their lenders to declare a default, accelerate the related debt, or foreclose on their property. Customers in bankruptcy may not have sufficient assets to pay us unpaid fees or reimbursements we are owed under their agreements with us. If a significant number of customers file for bankruptcy or otherwise fail to pay amounts owed to us, our revenues and liquidity could be adversely affected.\nRisks Relating to Our Stock\nOur stock has been volatile and we expect that it will continue to be volatile.\nOur stock price has been volatile, and we expect it will continue to be volatile. For example, during the year ended March 31, 2021, the trading price of our common stock ranged from a high close of $62.91 to a low close of $14.13. The market price for our common stock could be subject to wide fluctuations in response to many risk factors listed in this section, and others beyond our control. Factors affecting the trading price of our common stock may include:\n•\nuncertainties the COVID-19 pandemic has caused for the global economy;\n•\neconomic news or other events generally causing volatility in the trading markets;\n•\nour operating results failing to meet the expectation of securities analysts or investors in a particular period or failure of securities analysts to publish reports about us or our business;\n•\nannouncements by us or our competitors of acquisitions, new offerings or improvements, significant contracts, commercial relationships or capital commitments;\n•\nour ability to market new and enhanced solutions on a timely basis;\n•\nany major change in our board or management; general economic and political conditions such as recessions, interest rates, fuel prices, international currency fluctuations and acts of war or terrorism.\nOn May 22, 2020, we sold $35 million of preferred stock with a 5.25% cumulative dividend and convertible into common stock at a conversion price of $20.1676 per share. Until converted, the preferred stock may impede stock price increases above the conversion price.\nAdditionally, our ownership base has been and may continue to be concentrated in a few shareholders, which could increase the volatility of our common share price over time.",
    "item_1B": "Item 1B. Unresolved Staff Comments.\nNone.",
    "item_2": "Item 2. Properties.\nOur corporate headquarters are located in Alpharetta, Georgia where we lease approximately 33,000 square feet of office space. In addition, we lease approximately 33,000 square feet of office space in Las Vegas, Nevada, 30,000 square feet of office space in Bellevue, Washington, of which we sublease 22,000 square feet to a third party, 12,000 square feet of office space in Santa Barbara, California, and 6,000 square feet of warehouse space in Roswell, Georgia. Internationally, we lease approximately 102,000 square feet of office space in Chennai, India and lease several other smaller office locations throughout Europe and Asia. Our major leases contain renewal options for periods of up to 10 years. We believe that our current facilities and office space are sufficient to meet our needs and do not anticipate any difficulty securing additional space as needed.",
    "item_3": "Item 3. Legal Proceedings.\nWe are involved in legal actions that arise in the ordinary course of business. It is the opinion of management that the resolution of any current pending litigation will not have a material adverse effect on our financial position or results of operations.\nOn April 6, 2012, Ameranth, Inc. filed a complaint against us in the U.S. District Court for the Southern District of California alleging that certain of our products infringe patents owned by Ameranth directed to configuring and transmitting hospitality menus (e.g., restaurant menus) for display on electronic devices, and synchronizing the menu content between devices. The case against us was consolidated with similar cases brought by Ameranth against more than 30 other defendants. All but one of the patents at issue in the case were invalidated by the U.S. Court of Appeals for the Federal Circuit in 2016. In September 2018, the District Court found the one surviving Ameranth patent invalid, and granted summary judgment in favor of the movant co-defendants. In November 2019, the U.S. Court of Appeals for the Federal Circuit affirmed the lower court’s summary judgement with respect to all claims except for two, which were not asserted against Agilysys. Ameranth’s writ of certiorari to the United States Supreme Court was denied in October\n2020. Subsequently, Ameranth filed further pleading amendments and discovery requests with the District Court, which were opposed by the defendants.\nWe were not a party to the appeal, and it is currently unclear what impact the summary judgment ruling or writ of certiorari may have on our case. Ameranth seeks monetary damages, injunctive relief, costs and attorneys’ fees from us. At this time, we are not able to predict the outcome of the remaining claims in the lawsuit, or any possible monetary exposure associated with the lawsuit. However, we dispute the allegations of wrongdoing and are vigorously defending ourselves in this matter.",
    "item_4": "Item 4. Mine Safety Disclosures.\nNot applicable.\nPart II",
    "item_5": "Item 5. Market for Registrant’s Common Equity, Related Shareholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nOur common shares, without par value, are traded on the NASDAQ Stock Market LLC under the symbol “AGYS”. As of May 14, 2021, there were 1,505 registered holders of our common shares, without par value.\nDividends\nWe did not pay dividends in fiscal 2021 or 2020 on our common stock and are unlikely to do so in the foreseeable future. We pay preferred stock dividends as described in Note 14, Preferred Stock, to our Consolidated Financial Statements under Item 8 of this Annual Report. The current policy of the Board of Directors is to retain any available earnings for use in the operations of our business.\nShareholder Return Performance Presentation\nThe following chart compares the value of $100 invested in our common shares, including reinvestment of dividends, with a similar investment in the Russell 2000 Index (the “Russell 2000”) and with the companies listed in the SIC Code 7373-Computer Integrated Systems Design for the period March 31, 2016 through March 31, 2021. The stock price performance in this graph is not necessarily indicative of the future performance of our common shares.\nComparison of 5 Year Cumulative Total Return\nINDEXED RETURNS\nFiscal Years Ended March 31,\nBase Period\nCompany Name / Index\nAgilysys, Inc.\n$\n100.00\n$\n92.56\n$\n116.75\n$\n207.35\n$\n163.57\n$\n469.74\nRussell 2000\n$\n100.00\n$\n126.22\n$\n141.10\n$\n143.99\n$\n109.45\n$\n213.26\nPeer Group\n$\n100.00\n$\n122.79\n$\n141.63\n$\n147.27\n$\n141.34\n$\n187.01\nThis performance graph shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended or incorporated by reference into any of our filings under the Securities Act of 1933, as amended, of the Exchange Act, except as shall be expressly set forth by specific reference in such filing.",
    "item_6": "",
    "item_7": "Item 7. Managements’ Discussion and Analysis of Financial Condition and Results of Operations.\nIn “Management’s Discussion and Analysis of Financial Condition and Results of Operations” (“MD&A”), management explains the general financial condition and results of operations for Agilysys and subsidiaries including:\n- what factors affect our business;\n- what our earnings and costs were;\n- why those earnings and costs were different from the year before;\n- where the earnings came from;\n- how our financial condition was affected; and\n- where the cash will come from to fund future operations.\nThe MD&A analyzes changes in specific line items in the Consolidated Statements of Operations and Consolidated Statements of Cash Flows and provides information that management believes is important to assessing and understanding our consolidated financial condition and results of operations. This discussion should be read in conjunction with the Consolidated Financial Statements and related Notes that appear in Item 8 of this Annual Report titled, “Financial Statements and Supplementary Data.” Information provided in the MD&A may include forward-looking statements that involve risks and uncertainties. Many factors could cause actual results to be materially different from those contained in the forward-looking statements. See “Forward-Looking Information” on page 3 of this Annual Report and Item 1A “Risk Factors” in Part I of this Annual Report for additional information concerning these items. Management believes that this information, discussion, and disclosure is important in making decisions about investing in Agilysys.\nOverview\nRecent Developments\nCOVID-19 Pandemic\nThe World Health Organization declared COVID-19 a pandemic on March 11, 2020. COVID-19 has had a significant impact on our business during the year ended March 31, 2021. The extent to which COVID-19 will continue impacting our financial condition and results of operations remains uncertain and depends on various factors, including the ongoing or recurring impact on our customers, partners, and vendors and on the operation of the global markets in general. Because an increasing portion of our business is based on a subscription model, the effect of COVID-19 on our results of operations may also not be fully reflected for some time.\nWe have taken actions to mitigate the impact on our business. We continue to conduct business with substantial modifications to employee travel, employee work locations, virtualization or cancellation of customer and employee events, and remote sales, implementation, and support activities, among other modifications. These modifications may continue to delay or reduce sales and harm productivity and collaboration. The pandemic could have an ongoing adverse impact on demand for our customers’ products and services, which in turn could continue to negatively impact the willingness of our customers to enter into or renew contracts with us. The pandemic has impacted our ability to complete certain implementations, negatively impacting our ability to recognize revenue, and could also negatively impact the ongoing collection of accounts receivable from our customers.\nDuring our fiscal 2021, we reduced discretionary costs through actions including hiring freezes on non-essential positions, layoffs, employee furloughs, employee retirement benefit limitations, and salary decreases for executive team members and certain other employees of the Company.\nWhile we have eased certain cost reduction measures recently, we may take further actions that alter our business operations as the situation continues to evolve. As a result, the ultimate impact of the COVID-19 pandemic and the effects of the operational alterations we have made in response on our business, financial condition, liquidity, and financial results cannot be predicted at this time.\nOur Business\nAgilysys has been a leader in hospitality software for more than 40 years, delivering innovative cloud-native SaaS and on-premise guest-centric technology solutions for gaming, hotels, resorts and cruise, corporate foodservice management, restaurants, universities, stadia and healthcare. Agilysys offers the most comprehensive software solutions in the industry, including point-of-sale (POS), property management (PMS), inventory and procurement, payments, and related applications, to manage the entire guest journey. Agilysys is known for its leadership in hospitality, its broad product offerings and its customer-centric service. Some of the largest hospitality companies around the world use Agilysys solutions to help improve guest loyalty, drive revenue growth and increase operational efficiencies.\nThe Company has just one reportable segment serving the global hospitality industry. Agilysys operates across North America, Europe, Asia-Pacific, and India with headquarters located in Alpharetta, Georgia.\nOur top priority is increasing shareholder value by improving operating and financial performance and profitably growing the business through superior products and services. To that end, we expect to invest a certain portion of our cash on hand to fund enhancements to\nexisting software products, to develop and market new software products, and to expand our customer breadth, both vertically and geographically.\nOur strategic plan specifically focuses on:\n•\nPutting the customer first\n•\nFocusing on product innovation and development\n•\nImproving our liquidity\n•\nIncreasing organizational efficiency and teamwork\n•\nDeveloping our employees and leaders\n•\nGrowing revenue by improving the breadth and depth of our product set across both point-of-sale and property management applications\n•\nGrowing revenue through international expansion\nThe primary objective of our ongoing strategic planning process is to create shareholder value by capitalizing on growth opportunities, turning profitable and strengthening our competitive position within the specific technology solutions and end markets we serve. Profitability and industry leading growth will be achieved through tighter management of operating expenses and sharpening the focus of our investments to concentrate on growth opportunities that offer the highest returns.\nRevenue - Defined\nAs required by the SEC, we separately present revenue earned as products revenue, support, maintenance and subscription services revenue or professional services revenue in our Consolidated Statements of Operations. In addition to the SEC requirements, we may, at times, also refer to revenue as defined below. The terminology, definitions, and applications of terms we use to describe our revenue may be different from those used by other companies and caution should be used when comparing these financial measures to those of other companies. We use the following terms to describe revenue:\n•\nRevenue - We present revenue net of sales returns and allowances.\n•\nProducts revenue - Revenue earned from the sales of software licenses, third party hardware and operating systems.\n•\nSupport, maintenance and subscription services revenue - Revenue earned from the sale of proprietary and remarketed ongoing support, maintenance and subscription services.\n•\nProfessional services revenue - Revenue earned from the delivery of implementation, integration and installation services for proprietary and remarketed products.\nResults of Operations\nFiscal 2021 Compared with Fiscal 2020\nNet Revenue and Operating Loss\nThe following table presents our consolidated revenue and operating results for the fiscal years ended March 31, 2021 and 2020:\nYear ended March 31,\nIncrease (decrease)\n(Dollars in thousands)\n$\n%\nNet revenue:\nProducts\n$\n26,714\n$\n44,230\n$\n(17,516\n)\n(39.6\n)%\nSupport, maintenance and subscription services\n88,565\n83,680\n4,885\n5.8\n%\nProfessional services\n21,897\n32,847\n(10,950\n)\n(33.3\n)%\nTotal net revenue\n137,176\n160,757\n(23,581\n)\n(14.7\n)%\nCost of goods sold:\nProducts (inclusive of developed technology amortization)\n13,506\n36,427\n(22,921\n)\n(62.9\n)%\nSupport, maintenance and subscription services\n17,985\n19,248\n(1,263\n)\n(6.6\n)%\nProfessional services\n16,309\n24,130\n(7,821\n)\n(32.4\n)%\nTotal cost of goods sold\n47,800\n79,805\n(32,005\n)\n(40.1\n)%\nGross profit\n89,376\n80,952\n8,424\n10.4\n%\nGross profit margin\n65.2\n%\n50.4\n%\nOperating expenses:\nProduct development\n55,345\n41,463\n13,882\n33.5\n%\nSales and marketing\n14,196\n19,864\n(5,668\n)\n(28.5\n)%\nGeneral and administrative\n33,273\n24,374\n8,899\n36.5\n%\nDepreciation of fixed assets\n2,832\n2,574\n10.0\n%\nAmortization of intangibles\n1,959\n2,541\n(582\n)\n(22.9\n)%\nImpairments\n-\n23,740\n(23,740\n)\n(100.0\n)%\nSeverance and other charges, net\n2,529\n1,947\n334.5\n%\nLegal settlements, net\n(125\n)\n260.0\n%\nOperating loss\n$\n(20,958\n)\n$\n(34,061\n)\n$\n13,103\n(38.5\n)%\nOperating loss percentage\n(15.3\n)%\n(21.2\n)%\nThe following table presents the percentage relationship of our Consolidated Statement of Operations line items to our consolidated net revenues for the periods presented:\nYear ended March 31,\nNet revenue:\nProducts\n19.5\n%\n27.5\n%\nSupport, maintenance and subscription services\n64.6\n52.1\nProfessional services\n15.9\n20.4\nTotal net revenue\n100.0\n100.0\nCost of goods sold:\nProducts, inclusive of developed technology amortization\n9.8\n22.6\nSupport, maintenance and subscription services\n13.1\n12.0\nProfessional services\n11.9\n15.0\nTotal net cost of goods sold\n34.8\n49.6\nGross profit\n65.2\n50.4\nOperating expenses:\nProduct development\n40.4\n25.8\nSales and marketing\n10.3\n12.4\nGeneral and administrative\n24.4\n15.2\nDepreciation of fixed assets\n2.1\n1.6\nAmortization of intangibles\n1.4\n1.6\nImpairments\n-\n14.8\nSeverance and other charges, net\n1.8\n0.4\nLegal settlements, net\n0.1\n(0.1\n)\nOperating loss\n(15.3\n)%\n(21.2\n)%\nNet revenue. Total revenue decreased $23.6 million, or 14.7%, in fiscal 2021 compared to fiscal 2020. Products revenue decreased $17.5 million, or 39.6%, due to delayed customer purchasing decisions as the timing of the hospitality recovery from the COVID-19 pandemic remains unclear. Support, maintenance and subscription services revenue increased $4.9 million, or 5.8%, driven by continued growth in subscription-based revenue, which increased 15.5% in fiscal 2021 compared to fiscal 2020. Subscription revenue sales were led by our add on software modules, including modules enabling social distancing and contactless capabilities. Professional services revenue decreased $11.0 million, or 33.3%, due to delays in implementation services due to customer property restrictions, property closures and lower sales from delayed customer purchasing decisions as the timing of the hospitality recovery from the COVID-19 pandemic remains unclear.\nGross profit and gross profit margin. Our total gross profit increased $8.4 million, or 10.4%, in fiscal 2021 and total gross profit margin increased from 50.4% to 65.2%. Products gross profit increased $5.4 million and gross profit margin increased from 17.6% to 49.4% driven mostly by the absence of software development cost amortization during fiscal 2021. Support, maintenance and subscription services gross profit increased $6.1 million and gross profit margin increased 269 basis points to 79.7% due to increased subscription revenue on a relatively flat cost base. Professional services gross profit decreased $3.1 million and gross profit margin decreased slightly from 26.5% to 25.5% due to the delay in professional service projects and the fixed costs of maintaining a minimum required professional services team as customers continued to work towards re-opening their locations and accept implementations and installations.\nOperating expenses\nOperating expenses, excluding the charges for legal settlements, impairments, severance and other charges, increased $16.8 million, or 18.5%, in fiscal 2021 compared with fiscal 2020. As a percent of total revenue, operating expenses have increased 22.0% in fiscal 2021 compared with fiscal 2020.\nProduct development. Product development includes all expenses associated with research and development. Product development increased $13.9 million, or 33.5%, during fiscal 2021 as compared to fiscal 2020 due to the continued expansion of our R&D teams and significant share-based compensation charges resulting from the accelerated vesting of stock-settled appreciation rights (SSARs) upon their market condition satisfaction in February 2021.\nSales and marketing. Sales and marketing decreased $5.7 million, or 28.5%, in fiscal 2021 compared with fiscal 2020 due to reduced commission expense as a result of lower sales levels, significantly reduced travel, layoffs, temporary reductions in employee benefits, and the absence of in-person trade shows and conference activity. The decrease was slightly offset by an increase in stock-based compensation charges resulting from the accelerated vesting of SSARs.\nGeneral and administrative. General and administrative increased $9.0 million, or 37.0%, in fiscal 2021 compared to fiscal 2020. The change is due primarily to significant share-based compensation charges resulting from the accelerated vesting of SSARs.\nDepreciation of fixed assets. Depreciation of fixed assets increased $0.3 million or 10.0% in fiscal 2021 as compared to fiscal 2020 due to an increased level of assets with shorter useful lives.\nAmortization of intangibles. Amortization of intangibles decreased $0.6 million or 22.9% in fiscal 2021 as compared to fiscal 2020 due to a lower unamortized cost base following the impairment of intangibles in fiscal 2020.\nImpairments. There were no impairments in fiscal 2021. Impairments totaled $23.7 million in fiscal 2020. The impairments resulted from specific capitalized software development costs supporting certain software applications. The impact of the COVID-19 pandemic on the hospitality industry resulted in economic conditions which made it difficult to project future sales and revenue accurately for the impacted solutions at the time of impairment determination. After evaluating the Company’s strategy for market development and continued costs to support the software, an impairment charge was required. We recorded impairment charges to reduce the net realizable value of the related assets to zero during the 2020 fiscal year.\nSeverance and other charges. Severance and other charges increased $1.9 million due to an increase in non-restructuring severance activity during fiscal 2021 compared to fiscal 2020.\nLegal settlements. Legal settlements consist of settlements of employment and other business-related matters.\nOther (Income) Expenses\nYear ended March 31,\n(Unfavorable) favorable\n(Dollars in thousands)\n$\n%\nOther (income) expense:\nInterest (income)\n$\n(107\n)\n$\n(380\n)\n$\n(273\n)\n71.8\n%\nInterest expense\n(11\n)\nnm\nOther expense, net\n(162\n)\n(92.0\n)%\nTotal other expense (income), net\n$\n$\n(195\n)\n$\n(446\n)\n228.7\n%\nnm - not meaningful\nInterest income. Interest income consists of interest earned on short-term investments in certificates of deposit, commercial paper, money market funds, corporate-owned life insurance policies and interest-bearing bank accounts.\nInterest expense. Interest expense consists of costs associated with finance leases.\nOther expense, net. Other expense, net consists mainly of the impact of foreign currency due to movement of European and Asian currencies against the US dollar.\nIncome Taxes\nYear ended March 31,\n(Unfavorable) favorable\n(Dollars in thousands)\n$\n%\nIncome tax expense (benefit)\n$\n(208\n)\n$\n$\n203.5\n%\nEffective tax rate\n1.0\n%\n(0.6\n)%\nFor fiscal 2021, the effective tax rate was different than the statutory rate due primarily to adjustments to deferred tax assets including increases in valuation allowances that reduce deferred tax assets and to the recording of net operating losses in a number of foreign jurisdictions offset by current year expense in other foreign jurisdictions.\nAlthough the timing and outcome of tax settlements are uncertain, it is reasonably possible that during the next 12 months an immaterial reduction in unrecognized tax benefits may occur as a result of the expiration of various statutes of limitations. We are consistently subject to tax audits; due to the nature of examinations in multiple jurisdictions, changes could occur in the amount of gross unrecognized tax benefits during the next 12 months which cannot be estimated at this time.\nBecause of our losses in prior periods, we have recorded a valuation allowance offsetting substantially all of our deferred tax assets. The ultimate realization of deferred tax assets depends on the generation of future taxable income during the periods in which those temporary differences are deductible. Because of our losses in prior periods, management believes that it is more-likely-than-not that we will not realize the benefits of these deductible differences. At March 31, 2021, we had $199.1 million of federal net operating loss carryforwards that expire, if unused, in fiscal years 2031 to 2038, and $46.8 million of federal net operating loss carryforwards that can be carried forward indefinitely. We also had $165.6 million of state net operating loss carryforwards that expire, if unused, in fiscal years 2022 through 2041.\nFiscal 2020 Compared to Fiscal 2019\nNet Revenue and Operating Loss\nThe following table presents our consolidated revenue and operating results for the fiscal years ended March 31, 2020 and 2019:\nYear ended March 31,\nIncrease (decrease)\n(Dollars in thousands)\n$\n%\nNet revenue:\nProducts\n$\n44,230\n$\n39,003\n$\n5,227\n13.4\n%\nSupport, maintenance and subscription services\n83,680\n75,496\n8,184\n10.8\n%\nProfessional services\n32,847\n26,343\n6,504\n24.7\n%\nTotal net revenue\n160,757\n140,842\n19,915\n14.1\n%\nCost of goods sold:\nProducts (inclusive of developed technology amortization)\n36,427\n31,811\n4,616\n14.5\n%\nSupport, maintenance and subscription services\n19,248\n15,895\n3,353\n21.1\n%\nProfessional services\n24,130\n19,256\n4,874\n25.3\n%\nTotal cost of goods sold\n79,805\n66,962\n12,843\n19.2\n%\nGross profit\n80,952\n73,880\n7,072\n9.6\n%\nGross profit margin\n50.4\n%\n52.5\n%\nOperating expenses:\nProduct development\n41,463\n37,817\n3,646\n9.6\n%\nSales and marketing\n19,864\n19,646\n1.1\n%\nGeneral and administrative\n24,374\n23,118\n1,256\n5.4\n%\nDepreciation of fixed assets\n2,574\n2,504\n2.8\n%\nAmortization of intangibles\n2,541\n2,567\n(26\n)\n(1.0\n)%\nImpairments\n23,740\n-\n23,740\n100.0\n%\nSeverance and other charges, net\n1,168\n(586\n)\n(50.2\n)%\nLegal settlements, net\n(125\n)\n(266\n)\n(188.7\n)%\nOperating loss\n$\n(34,061\n)\n$\n(13,081\n)\n$\n(20,980\n)\n160.4\n%\nOperating loss percentage\n(21.2\n)%\n(9.3\n)%\nThe following table presents the percentage relationship of our Consolidated Statement of Operations line items to our consolidated net revenues for the periods presented:\nYear ended March 31,\nNet revenue:\nProducts\n27.5\n%\n27.7\n%\nSupport, maintenance and subscription services\n52.1\n53.6\nProfessional services\n20.4\n18.7\nTotal net revenue\n100.0\n100.0\nCost of goods sold:\nProducts (inclusive of developed technology amortization)\n22.6\n22.6\nSupport, maintenance and subscription services\n12.0\n11.3\nProfessional services\n15.0\n13.6\nTotal cost of goods sold\n49.6\n47.5\nGross profit\n50.4\n52.5\nOperating expenses:\nProduct development\n25.8\n26.9\nSales and marketing\n12.4\n13.9\nGeneral and administrative\n15.2\n16.4\nDepreciation of fixed assets\n1.6\n1.8\nAmortization of intangibles\n1.6\n1.8\nImpairments\n14.8\n-\nSeverance and other charges, net\n0.4\n0.8\nLegal settlements, net\n(0.1\n)\n0.1\nOperating loss\n(21.2\n)%\n(9.3\n)%\nNet revenue. Total revenue increased $19.9 million, or 14.1%, in fiscal 2020 compared to fiscal 2019. Products revenue increased $5.2 million, or 13.4%, due to increased sales in third-party hardware sales including new customers and expansion with existing customers. Support, maintenance and subscription services revenue increased $8.2 million, or 10.8%, driven by continued growth in subscription-based service revenue, which increased 24.3% in fiscal 2020 compared to fiscal 2019. Professional services revenue increased $6.5 million, or 24.7%, due to ongoing installations and integration of our software solutions for our growing customer base.\nGross profit and gross profit margin. Our total gross profit increased $7.1 million, or 9.6%, in fiscal 2020 and total gross profit margin decreased from 52.5% to 50.4%. Products gross profit increased $0.6 million and gross profit margin decreased slightly from 18.4% to 17.6% due to a higher mix of third party hardware and software and due to certain allowances established against revenues earned in March 2020 related to products that have been or could be returned from customer locations closed in response to COVID-19 guidelines. Support, maintenance and subscription services gross profit increased $4.8 million and gross profit margin decreased 195 basis points to 77.0% due to increased costs associated with hosting our customers. Professional services gross profit increased $1.6 million and gross profit margin decreased slightly from 26.9% to 26.5% after we established allowances against revenues earned in March 2020 due to uncertainties related to COVID-19 conditions.\nOperating expenses\nOperating expenses, excluding the charges for legal settlements, impairments and restructuring, severance and other charges, increased $5.2 million, or 6.0%, in fiscal 2020 compared with fiscal 2019. As a percent of total revenue, operating expenses have decreased 4.3% in fiscal 2020 compared with fiscal 2019.\nProduct development. Product development includes all expenses associated with research and development. Product development increased $3.6 million, or 9.6%, during fiscal 2020 as compared to fiscal 2019 primarily due to the reduction of cost capitalization. Certain software applications for which we had capitalized costs reached general availability by the beginning of the second quarter of fiscal 2019. These products joined our well-established products with the application of agile development practices in a more dynamic development process that involves higher frequency releases of product features and functions. We capitalized $2.0 million of external use software development costs, and $0.3 million of internal use software development costs during fiscal 2019, with the full balance capitalized in Q1 fiscal 2019. We did not capitalize any costs associated with product development during fiscal 2020. Total product development costs, including operating expenses and capitalized amounts, were $41.5 million during fiscal 2020 compared to $40.1 million in fiscal 2019. The $1.4 million increase is mostly due to continued expansion of our R&D teams and infrastructure.\nSales and marketing. Sales and marketing increased $0.2 million, or 1.1%, in fiscal 2020 compared with fiscal 2019. The change is due primarily to an increase in our allowance for doubtful accounts due to an increase collection risk of our accounts receivable as of March 31, 2020 as a result of the negative impacts of the COVID-19 pandemic on the operations of our customers, partially offset by a decrease in costs associated with our annual bonus incentive plan that has declined in value due to a significant decrease in target achievements after reduced fourth quarter revenue activity with concentration in March 2020.\nGeneral and administrative. General and administrative increased $1.3 million, or 5.4%, in fiscal 2020 compared to fiscal 2019. The change is due primarily to software investments in third-party applications to host our network and infrastructure.\nDepreciation of fixed assets. Depreciation of fixed assets increased $0.1 million or 2.8% in fiscal 2020 as compared to fiscal 2019.\nAmortization of intangibles. Amortization of intangibles remained consistent in fiscal 2020 as compared to fiscal 2019.\nImpairments. Impairments totaled $23.7 million in fiscal 2020. There were no impairments in fiscal 2019. The impairments result from specific capitalized software development costs supporting certain software applications. The impact of the COVID-19 pandemic on the hospitality industry resulted in economic conditions which make it difficult to project future sales and revenue accurately for the impacted solutions. After evaluating the Company’s strategy for market development and continued costs to support the software, an impairment charge was required. We have recorded impairment charges to reduce the net realizable value of the related assets to zero.\nSeverance and other charges. Severance, and other charges decreased $0.6 million due to a reduction in non-restructuring severance activity during fiscal 2020 compared to fiscal 2019.\nLegal settlements, net. Legal settlements consist of settlements of employment and other business-related matters.\nOther (Income) Expenses\nYear ended March 31,\n(Unfavorable) favorable\n(Dollars in thousands)\n$\n%\nOther (income) expenses\nInterest (income)\n$\n(380\n)\n$\n(339\n)\n$\n12.1\n%\nInterest expense\n-\n-\n%\nOther expense, net\nnm\nTotal other (income), net\n$\n(195\n)\n$\n(138\n)\n$\nnm\nnm - not meaningful\nInterest income. Interest income consists of interest earned on short-term investments in certificates of deposit, commercial paper, money market funds and corporate-owned life insurance policies.\nInterest expense. Interest expense consists of costs associated with finance leases.\nOther expense, net. Other expense, net consists mainly of the impact of foreign currency due to movement of European and Asian currencies against the US dollar.\nIncome Taxes\nYear ended March 31,\n(Unfavorable) favorable\n(Dollars in thousands)\n$\n%\nIncome tax expense\n$\n$\n$\nnm\nEffective tax rate\n(0.6\n)%\n(1.7\n)%\nnm - not meaningful\nFor fiscal 2020, the effective tax rate was different than the statutory rate due primarily to the recognition of net operating losses as deferred tax assets, which were offset by increases in the valuation allowance, state taxes and other U.S. permanent book to tax differences.\nAlthough the timing and outcome of tax settlements are uncertain, it is reasonably possible that during the next 12 months an immaterial reduction in unrecognized tax benefits may occur as a result of the expiration of various statutes of limitations. We are consistently subject to tax audits; due to the nature of examinations in multiple jurisdictions, changes could occur in the amount of gross unrecognized tax benefits during the next 12 months which cannot be estimated at this time.\nBecause of our losses in prior periods, we have recorded a valuation allowance offsetting substantially all of our deferred tax assets. The ultimate realization of deferred tax assets depends on the generation of future taxable income during the periods in which those temporary differences are deductible. Because of our losses in prior periods, management believes that it is more-likely-than-not that we will not realize the benefits of these deductible differences. At March 31, 2020, we had $199.1 million of federal net operating loss carryforwards that expire, if unused, in fiscal years 2031 to 2038, and $24.7 million of federal net operating loss carryforwards that can be carried forward indefinitely. We also had $141.6 million of state net operating loss carryforwards that expire, if unused, in fiscal years 2021 through 2040.\nLiquidity and Capital Resources\nOverview\nOur cash requirements consist primarily of working capital needs, capital expenditures, payments of preferred stock dividends, and operating expenses including payments of lease obligations.\nAt March 31, 2021, all $99.2 million of our cash on hand was deposited in bank accounts, of which 96% are located in the United States. We believe there is limited credit risk with respect to our cash balances.\nWhile the COVID-19 pandemic has had a significant adverse impact on our results of operations during our entire fiscal 2021, we cannot presently estimate its ongoing financial impact, which will be highly dependent on the severity and duration of the pandemic. As such, due to the ongoing uncertainties associated with the COVID-19 pandemic and the indeterminate length of time it will affect the hospitality industry, we have maintained certain proactive measures to secure our liquidity position to be able to meet our requirements for the foreseeable future. These measures have included strict cost management actions, such as halting and altering our marketing programs, eliminating non-essential expenses including capital expenditures and reducing payroll and related costs through layoffs and furloughs as well as salary and retirement benefit reductions.\nWe believe that cash flow from operating activities, cash on hand of $99.2 million as of March 31, 2021, and access to capital markets will provide adequate funds to meet our short-and long-term liquidity requirements.\nAs of March 31, 2021 and March 31, 2020, our total debt was approximately $0.1 million, comprised of finance lease obligations in both periods.\nCash Flow\nYear ended March 31,\n(In thousands)\nNet cash provided by (used in):\nOperating activities\n$\n28,407\n$\n10,575\n$\n7,241\nInvesting activities\n(1,391\n)\n(3,447\n)\n(5,534\n)\nFinancing activities\n25,316\n(1,116\n)\n(767\n)\nEffect of exchange rate changes on cash\n(130\n)\n(112\n)\nIncrease in cash\n$\n52,527\n$\n5,882\n$\nCash flow provided by operating activities. Cash flows provided by operating activities were $28.4 million in fiscal 2021. The provision of cash was due primarily to our operating loss of $21.0 million adjusted for $44.0 million in non-cash expense including depreciation, amortization, and share-based compensation and an increase of approximately $5.4 million from the changes in operating assets and liabilities.\nCash flows provided by operating activities were $10.6 million in fiscal 2020. The provision of cash was due primarily to our operating loss of $34.1 million adjusted for $46.2 million in non-cash expense including impairment charges, depreciation, amortization, and share-based compensation and a decrease of approximately $1.5 million in net operating assets and liabilities.\nCash flows provided by operating activities were $7.2 million in fiscal 2019. The provision of cash was due primarily to our operating loss of $13.2 million adjusted for $22.4 million in non-cash expense including depreciation, amortization, and share-based compensation and an increase of approximately $2 million in net operating assets and liabilities.\nCash flow used in investing activities. Cash flows used in investing activities in fiscal 2021 were $1.4 million due primarily to the purchase of property and equipment, including internal use software.\nCash flows used in investing activities in fiscal 2020 were $3.4 million due primarily to the purchase of property and equipment, including internal use software.\nCash flows used in investing activities in fiscal 2019 were $5.5 million. This is primarily attributed to $2.2 million in capitalized development costs of proprietary software and $3.3 million for purchase of property and equipment, including internal use software.\nCash flow provided by (used in) financing activities. During fiscal 2021, the $25.3 million provided by financing activities consisted primarily of $34.0 million in preferred stock issuance proceeds from the MAK Capital investment, net of issuance costs, offset by $7.5 million for the repurchase of shares to satisfy employee tax withholding on share-based compensation and $1.1 million in preferred stock dividends.\nCash flows used in financing activities of $1.1 million and $0.8 million, respectively, in fiscal 2020 and 2019 were primarily comprised of share repurchases to satisfy employee tax withholding on share-based compensation.\nInvestments\nInvestments in Corporate-Owned Life Insurance Policies\nAgilysys invests in corporate-owned life insurance policies for certain former executives, for which some are endorsement split-dollar life insurance arrangements. We entered into agreements with each of the former executives, whereby we must maintain the life insurance policy for a specified amount and split a portion of the policy benefits with their designated beneficiary. Our investment in these corporate-owned life insurance policies were recorded at their cash surrender value, which approximates fair value at the balance sheet date. In the Consolidated Balance Sheets at the balance sheet date, the cash surrender value of $1.0 million for the remaining policies were held in “Other non-current assets,” and the present value of future proceeds owed to those executives’ designated beneficiary of $0.1 million, which approximates fair value, were recorded within “Other non-current liabilities” in the Consolidated Balance Sheets at the balance sheet date.\nOff-Balance Sheet Arrangements\nWe have not entered into any off-balance sheet arrangements that have had or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures, or capital resources.\nContractual Obligations\nOur contractual obligations consist primarily of operating leases for office space and preferred stock dividends. We disclose our lease obligations in Note 6, Leases, and preferred stock dividends in Note 14, Preferred Stock, to our Consolidated Financial Statements included under Item 8 of this Annual Report.\nWe believe our cash on hand, funds from operations, and access to capital markets will provide adequate funds to finance capital spending and working capital needs and to service our obligations and other commitments arising during the foreseeable future.\nCritical Accounting Policies\nManagements’ Discussion and Analysis is based upon our Consolidated Financial Statements, which have been prepared in accordance with U.S. generally accepted accounting principles. The preparation of these financial statements requires us to make significant estimates and judgments that affect the reported amounts of assets, liabilities, revenue, and expenses and related disclosure of contingent assets and liabilities. We regularly evaluate our estimates, including those related to bad debts, inventories, investments, intangible assets, income taxes, restructuring, contingencies and litigation. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources.\nOur most significant accounting policies relate to the sale, purchase, and promotion of our products and services. The policies discussed below are considered by management to be critical to an understanding of our Consolidated Financial Statements because their application places the most significant demands on management’s judgment, with financial reporting results relying on estimation about the effect of matters that are inherently uncertain. Specific risks for these critical accounting policies are described in the following paragraphs.\nFor all of these policies, management cautions that future events rarely develop exactly as forecasted, and the best estimates routinely require adjustment.\nRevenue recognition. On April 1, 2018, we adopted ASU No. 2014-09, Revenue from Contracts with Customers (Topic 606), using the modified retrospective method applied to those contracts that were not completed as of the adoption date.\nOur customary business practice is to enter into legally enforceable written contracts with our customers. The majority of our contracts are governed by a master service agreement between us and the customer, which sets forth the general terms and conditions of any individual contract between the parties, which is then supplemented by a customer order to specify the different goods and services, the associated prices, and any additional terms for an individual contract. Performance obligations specific to each individual contract are defined within the terms of each order. Each performance obligation is identified based on the goods and services that will be transferred to our customer that are both capable of being distinct and are distinct within the context of the contract. The transaction price is determined based on the consideration to which we will be entitled and expect to receive in exchange for transferring goods or services to the customer. Typically, our contracts do not provide our customer with any right of return or refund; we do not constrain the contract price as it is probable that there will not be a significant revenue reversal due to a return or refund.\nTypically our customer contracts contain one or more of the following goods or services which constitute performance obligations.\nOur software licenses typically provide for a perpetual right to use our software. Generally, our contracts do not provide significant services of integration and customization and installation services are not required to be purchased directly from us. The software is delivered before related services are provided and is functional without professional services, updates and technical support. We have concluded that the software license is distinct as the customer can benefit from the software on its own. Software revenue is typically recognized when the software is delivered or made available for download to the customer.\nRevenue for hardware sales is recognized when the product is shipped to the customer and when obligations that affect the customer’s final acceptance of the arrangement have been fulfilled. Hardware is purchased from suppliers and provided to the end-user customers via drop-ship or from inventory. We are responsible for negotiating the price both with the supplier and the customer, payment to the supplier, establishing payment terms and product returns with the customer, and bearing the credit risk if the customer does not pay for the goods. As the principal contact with the customer, we recognize revenue and cost of goods sold when we are notified by the supplier that the product has been shipped. In certain limited instances, as shipping terms dictate, revenue is recognized upon receipt at the point of destination or upon installation at the customer site.\nSupport and maintenance revenue is derived from providing telephone and on-line technical support services, bug fixes, and unspecified software updates and upgrades to customers on a when-and-if-available basis. These services represent a stand-ready obligation that is concurrently delivered and has the same pattern of transfer to the customer; we account for these support and maintenance services as a single performance obligation recognized over the term of the maintenance agreement.\nOur subscription service revenue is comprised of fees for contracts that provide customers a right to access our software for a subscribed period. We do not provide the customer the contractual right to license the software at any time outside of the subscription period under these contracts. The customer can only benefit from the software and software maintenance when provided the right to access the software. Accordingly, each of the rights to access the software, the maintenance services, and any hosting services is not considered a distinct performance obligation in the context of the contract and should be combined into a single performance obligation to be recognized over the contract period. The Company recognizes subscription revenue over a one-month period based on the typical monthly invoicing and renewal cycle in accordance with our customer agreement terms.\nProfessional services revenues primarily consist of fees for consulting, installation, integration and training and are generally recognized over time as the customer simultaneously receives and consumes the benefits of the professional services as the services are being performed. Professional services can be provided by internal or external providers, do not significantly affect the customer’s ability to access or use other provided goods or services, and provide a measure of benefit beyond that of other promised goods or services in the contract. As a result, professional services are considered distinct in the context of the contract and represent a separate performance obligation. Professional services that are billed on a time and materials basis are recognized over time as the services are performed. For contracts billed on a fixed price basis, revenue is recognized over time using an input method based on labor hours expended to date relative to the total labor hours expected to be required to satisfy the related performance obligation.\nWe use the market approach to drive standalone selling price (“SSP”) by maximizing observable data points (in the form of recently executed customer contracts) to determine the price customers are willing to pay for the goods and services transferred. If the contract contains a single performance obligation, the entire transaction price is allocated to that performance obligation. Contracts that contain multiple performance obligations require an allocation of the transaction price to each performance obligation based on a relative SSP basis.\nAllowance for expected credit losses. We maintain allowances for expected credit losses for estimated losses resulting from the inability or unwillingness of our customers to make required payments. We base our expected credit loss model on historical experience, adjusted for current conditions and reasonable and supportable forecasts. To help mitigate the associated credit risk we perform periodic credit evaluations of our customers.\nCustomer credit allowance. We maintain allowances for estimated customer credits. Credits are typically due to the timing or amount of customer invoices processed for specific services, including professional and subscription, and maintenance coverage. In many cases, there has not been clear or timely communication of the need to adjust coverage or service at a location in advance of when we invoice for the associated coverage or service. We will issue a credit after agreeing to the service or coverage adjustment as requested by the customer within the terms of our contract. During fiscal 2021, we have included allowances for various one-time recurring revenue related and other concessions we have given to customers to help them while they deal with the impact of the COVID-19 pandemic on their operational priorities.\nShare-based compensation. We have a stock incentive plan under which we may grant non-qualified stock options, incentive stock options, stock-settled stock appreciation rights, time-vested restricted shares, restricted share units, performance-vested restricted shares, and performance shares. Shares issued pursuant to awards under this plan may be made out of treasury or authorized but unissued shares.\nWe record compensation expense related to stock options, stock-settled stock appreciation rights, restricted shares, and performance shares granted to certain employees and non-employee directors based on the fair value of the awards on the grant date. The fair value of restricted share and performance share awards is based on the closing price of our common shares on the grant date. The fair value of stock option and stock-settled appreciation right awards is estimated on the grant date using the Black-Scholes-Merton option pricing model, which includes assumptions regarding the risk-free interest rate, dividend yield, life of the award, and the volatility of our common shares. The fair value for stock-settled appreciation rights with a market condition are estimated using a Lattice option pricing model which utilizes a binomial tree to forecast option pricing. Forfeitures of awards are recognized as they occur. Additional information regarding the assumptions used to value share-based compensation awards is provided in Note 13, Share-Based Compensation.\nAdopted and Recently Issued Accounting Pronouncements\nSee Note 2, Summary of Significant Accounting Policies, to our Consolidated Financial Statements included under Item 8 of this Annual Report for additional information about recent accounting pronouncements recently adopted and those not yet effective.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nWe have assets, liabilities, and cash flows in foreign currencies creating foreign exchange risk. We sell products and services internationally and enter into transactions denominated in foreign currencies. As a result, we are subject to the variability that arises from exchange rate movements. For the fiscal years 2021, 2020 and 2019, revenue from international operations was 8%, 9% and 9%, respectively of total revenue. The effects of foreign currency on operating results did not have a material impact on our results of operations for the 2021, 2020 and 2019 fiscal years. Fluctuations in the value of other currencies could materially impact our revenue, expenses, operating profit and net income.",
    "item_8": "Item 8. Financial Statements and Supplementary Data.\nAgilysys, Inc. and Subsidiaries\nANNUAL REPORT ON FORM 10-K\nYear Ended March 31, 2021\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nReports of Independent Registered Public Accounting Firm - Grant Thornton LLP\nConsolidated Balance Sheets as of March 31, 2021 and 2020\nConsolidated Statements of Operations for the years ended March 31, 2021, 2020, and 2019\nConsolidated Statements of Comprehensive Loss for the years ended March 31, 2021, 2020, and 2019\nConsolidated Statements of Cash Flows for the years ended March 31, 2021, 2020, and 2019\nConsolidated Statements of Shareholders’ Equity for the years ended March 31, 2021, 2020, and 2019\nNotes to Consolidated Financial Statements\nSchedule II - Valuation and Qualifying Accounts for the years ended March 31, 2021, 2020, and 2019\nReport of Independent Registered Public Accounting Firm\nBoard of Directors and Shareholders\nAgilysys, Inc.\nOpinion on the financial statements\nWe have audited the accompanying consolidated balance sheets of Agilysys, Inc. (an Ohio corporation) and subsidiaries (the “Company”) as of March 31, 2021 and 2020, the related consolidated statements of operations, comprehensive loss, shareholders’ equity, and cash flows for each of the three years in the period ended March 31, 2021, and the related notes and financial statement schedule included under Item 15(a) (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of March 31, 2021 and 2020, and the results of its operations and its cash flows for each of the three years in the period ended March 31, 2021, in conformity with accounting principles generally accepted in the United States of America.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (“PCAOB”), the Company’s internal control over financial reporting as of March 31, 2021, based on criteria established in the 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”), and our report dated May 21, 2021 expressed an unqualified opinion.\nBasis for opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical audit matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ GRANT THORNTON LLP\nWe have served as the Company’s auditor since 2016.\nAtlanta, Georgia\nMay 21, 2021\nReport of Independent Registered Public Accounting Firm\nBoard of Directors and Shareholders\nAgilysys, Inc.\nOpinion on internal control over financial reporting\nWe have audited the internal control over financial reporting of Agilysys, Inc. (an Ohio corporation) and subsidiaries (the “Company”) as of March 31, 2021, based on criteria established in the 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of March 31, 2021, based on criteria established in the 2013 Internal Control-Integrated Framework issued by COSO.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (“PCAOB”), the consolidated financial statements of the Company as of and for the year ended March 31, 2021, and our report dated May 21, 2021 expressed an unqualified opinion on those financial statements.\nBasis for opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and limitations of internal control over financial reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ GRANT THORNTON LLP\nAtlanta, Georgia\nMay 21, 2021\nAGILYSYS, INC.\nCONSOLIDATED BALANCE SHEETS\nAs of March 31,\n(In thousands, except share data)\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n99,180\n$\n46,653\nAccounts receivable, net of allowance for expected credit losses of $1,220\nand for doubtful accounts of $1,634, respectively\n25,732\n35,869\nContract assets\n2,364\n2,125\nInventories\n1,177\n3,887\nPrepaid expenses and other current assets\n4,797\n4,874\nTotal current assets\n133,250\n93,408\nProperty and equipment, net\n8,789\n12,230\nOperating lease right-of-use assets\n12,210\n13,829\nGoodwill\n19,622\n19,622\nIntangible assets, net\n8,400\n8,400\nDeferred income taxes, non-current\n1,802\nOther non-current assets\n5,800\n6,309\nTotal assets\n$\n189,873\n$\n154,562\nLIABILITIES AND SHAREHOLDERS' EQUITY\nCurrent liabilities:\nAccounts payable\n$\n6,346\n$\n13,403\nContract liabilities\n38,394\n42,244\nAccrued liabilities\n11,233\n9,033\nOperating lease liabilities, current\n5,009\n4,719\nFinance lease obligations, current\nTotal current liabilities\n61,001\n69,423\nDeferred income taxes, non-current\nOperating lease liabilities, non-current\n8,597\n10,617\nFinance lease obligations, non-current\nOther non-current liabilities\n4,011\n1,860\nCommitments and contingencies (see Note 11)\nSeries A convertible preferred stock, no par value\n35,459\n-\nShareholders' equity:\nCommon shares, without par value, at $0.30 stated value; 80,000,000\nshares authorized; 31,606,831 shares issued; and 24,010,727\nand 23,609,398 shares outstanding at March 31, 2021\nand March 31, 2020, respectively\n9,482\n9,482\nTreasury shares, 7,596,104 and 7,997,433 at March 31, 2021\nand March 31, 2020, respectively\n(2,278\n)\n(2,401\n)\nCapital in excess of stated value\n37,257\n5,491\nRetained earnings\n35,376\n58,984\nAccumulated other comprehensive income\nTotal shareholders' equity\n79,876\n71,757\nTotal liabilities and shareholders' equity\n$\n189,873\n$\n154,562\nSee accompanying notes to consolidated financial statements.\nAGILYSYS, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYear Ended\nMarch 31,\n(In thousands, except per share data)\nNet revenue:\nProducts\n$\n26,714\n$\n44,230\n$\n39,003\nSupport, maintenance and subscription services\n88,565\n83,680\n75,496\nProfessional services\n21,897\n32,847\n26,343\nTotal net revenue\n137,176\n160,757\n140,842\nCost of goods sold:\nProducts (inclusive of developed technology amortization)\n13,506\n36,427\n31,811\nSupport, maintenance and subscription services\n17,985\n19,248\n15,895\nProfessional services\n16,309\n24,130\n19,256\nTotal cost of goods sold\n47,800\n79,805\n66,962\nGross profit\n89,376\n80,952\n73,880\nGross profit margin\n65.2\n%\n50.4\n%\n52.5\n%\nOperating expenses:\nProduct development\n55,345\n41,463\n37,817\nSales and marketing\n14,196\n19,864\n19,646\nGeneral and administrative\n33,273\n24,374\n23,118\nDepreciation of fixed assets\n2,832\n2,574\n2,504\nAmortization of intangibles\n1,959\n2,541\n2,567\nImpairments\n-\n23,740\n-\nSeverance and other charges, net\n2,529\n1,168\nLegal settlements, net\n(125\n)\nTotal operating expense\n110,334\n115,013\n86,961\nOperating loss\n(20,958\n)\n(34,061\n)\n(13,081\n)\nOther (income) expense:\nInterest income\n(107\n)\n(380\n)\n(339\n)\nInterest expense\nOther expense, net\nLoss before taxes\n(21,209\n)\n(33,866\n)\n(12,943\n)\nIncome tax expense (benefit)\n(208\n)\nNet loss\n$\n(21,001\n)\n$\n(34,067\n)\n$\n(13,164\n)\nSeries A convertible preferred stock issuance costs\n(1,031\n)\n-\n-\nSeries A convertible preferred stock dividends\n(1,576\n)\n-\n-\nNet loss attributable to common shareholders\n$\n(23,608\n)\n$\n(34,067\n)\n$\n(13,164\n)\nWeighted average shares outstanding - basic and diluted\n23,458\n23,233\n23,037\nNet loss per share - basic and diluted:\n$\n(1.01\n)\n$\n(1.47\n)\n$\n(0.57\n)\nSee accompanying notes to consolidated financial statements.\nAGILYSYS, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE LOSS\nYear Ended\nMarch 31,\n(In thousands)\nNet loss\n$\n(21,001\n)\n$\n(34,067\n)\n$\n(13,164\n)\nOther comprehensive income (loss), net of tax:\nUnrealized foreign currency translation adjustments\n(162\n)\n(4\n)\nTotal comprehensive loss\n$\n(21,163\n)\n$\n(33,607\n)\n$\n(13,168\n)\nSee accompanying notes to consolidated financial statements.\nAGILYSYS, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYear Ended\nMarch 31,\n(In thousands)\nOperating activities\nNet loss\n$\n(21,001\n)\n$\n(34,067\n)\n$\n(13,164\n)\nAdjustments to reconcile net loss to net cash provided by operating activities:\nImpairments\n-\n23,740\n-\nLoss (gain) on disposal of property & equipment\n(5\n)\nDepreciation\n2,832\n2,574\n2,504\nAmortization of intangibles\n1,959\n2,541\n2,567\nAmortization of developed technology\n-\n12,561\n12,602\nDeferred income taxes\n(959\n)\n(356\n)\nShare-based compensation\n40,093\n5,205\n4,376\nChanges in operating assets and liabilities:\nAccounts receivable\n10,363\n(8,974\n)\n(7,536\n)\nContract assets\n(228\n)\n1,662\nInventories\n2,746\n(1,830\n)\n(50\n)\nPrepaid expense and other current assets\n(201\n)\n1,545\n(1,158\n)\nAccounts payable\n(7,016\n)\n8,585\n(3,512\n)\nContract liabilities\n(3,971\n)\n3,563\n4,845\nAccrued liabilities\n1,187\n(4,227\n)\n5,029\nIncome taxes payable\n(153\n)\n(564\n)\nOther changes, net\n2,219\n(921\n)\n(686\n)\nNet cash provided by operating activities\n28,407\n10,575\n7,241\nInvesting activities\nCapital expenditures\n(1,389\n)\n(3,420\n)\n(3,318\n)\nCapitalized software development costs\n-\n-\n(2,189\n)\nAdditional (investments in) corporate-owned life insurance policies\n(2\n)\n(27\n)\n(27\n)\nNet cash used in investing activities\n(1,391\n)\n(3,447\n)\n(5,534\n)\nFinancing activities\nPreferred stock issuance proceeds, net of issuance costs\n33,969\n-\n-\nPayment of preferred stock dividends\n(1,117\n)\n-\n-\nRepurchase of common shares to satisfy employee tax withholding\n(7,512\n)\n(1,092\n)\n(647\n)\nPrincipal payments under long-term obligations\n(24\n)\n(24\n)\n(120\n)\nNet cash provided by (used in) financing activities\n25,316\n(1,116\n)\n(767\n)\nEffect of exchange rate changes on cash\n(130\n)\n(112\n)\nNet increase in cash and cash equivalents\n52,527\n5,882\nCash and cash equivalents at beginning of period\n46,653\n40,771\n39,943\nCash and cash equivalents at end of period\n$\n99,180\n$\n46,653\n$\n40,771\nSee accompanying notes to consolidated financial statements.\nAGILYSYS, INC.\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS’ EQUITY\nCommon Shares\nCapital in\nAccumulated\nIssued\nIn Treasury\nexcess of\nother\n(In thousands, except share data)\nShares\nStated\nvalue\nShares\nStated\nvalue\nstated\nvalue\nRetained\nearnings\ncomprehensive\nincome (loss)\nTotal\nBalance at March 31, 2018\n31,607\n$\n9,482\n(8,283\n)\n$\n(2,486\n)\n$\n(1,911\n)\n$\n103,601\n$\n(255\n)\n$\n108,431\nCumulative effect of change in\naccounting policy\n-\n-\n-\n-\n-\n2,614\n-\n2,614\nShare-based compensation\n-\n-\n-\n-\n3,971\n-\n-\n3,971\nRestricted shares issued, net\n-\n-\n(54\n)\n-\n-\n-\nShares issued upon exercise of\nstock options and SSARs\n-\n-\n(18\n)\n-\n-\n-\nShares withheld for taxes upon\nexercise of stock options, SSARs\nor vesting of restricted shares\n-\n-\n(62\n)\n(19\n)\n(1,207\n)\n-\n-\n(1,226\n)\nNet loss\n-\n-\n-\n-\n-\n(13,164\n)\n-\n(13,164\n)\nUnrealized translation adjustments\n-\n-\n-\n-\n-\n-\n(4\n)\n(4\n)\nBalance at March 31, 2019\n31,607\n$\n9,482\n(8,105\n)\n$\n(2,433\n)\n$\n$\n93,051\n$\n(259\n)\n$\n100,622\nCumulative effect of change in\naccounting policy\n-\n-\n-\n-\n-\n-\n-\n-\nShare-based compensation\n-\n-\n-\n-\n5,682\n-\n-\n5,682\nRestricted shares issued, net\n-\n-\n(41\n)\n-\n-\n-\nShares issued upon exercise of\nstock options and SSARs\n-\n-\n(6\n)\n-\n-\n-\nShares withheld for taxes upon\nexercise of stock options, SSARs\nor vesting of restricted shares\n-\n-\n(53\n)\n(15\n)\n(925\n)\n-\n-\n(940\n)\nNet loss\n-\n-\n-\n-\n-\n(34,067\n)\n-\n(34,067\n)\nUnrealized translation adjustments\n-\n-\n-\n-\n-\n-\nBalance at March 31, 2020\n31,607\n$\n9,482\n(7,997\n)\n$\n(2,401\n)\n$\n5,491\n$\n58,984\n$\n$\n71,757\nShare-based compensation\n-\n-\n-\n-\n40,066\n-\n-\n40,066\nRestricted shares issued, net\n-\n-\n(28\n)\n-\n-\n-\nShares issued upon exercise of SSARs\n-\n-\n(141\n)\n-\n-\n-\nShares withheld for taxes upon\nexercise of stock options, SSARs\nor vesting of restricted shares\n-\n-\n(156\n)\n(46\n)\n(8,131\n)\n-\n-\n(8,177\n)\nNet loss\n-\n-\n-\n-\n-\n(21,001\n)\n-\n(21,001\n)\nSeries A convertible preferred stock issuance costs\n-\n-\n-\n-\n-\n(1,031\n)\n-\n(1,031\n)\nSeries A convertible preferred stock dividends\n-\n-\n-\n-\n-\n(1,576\n)\n-\n(1,576\n)\nUnrealized translation adjustments\n-\n-\n-\n-\n-\n-\n(162\n)\n(162\n)\nBalance at March 31, 2021\n31,607\n$\n9,482\n(7,596\n)\n$\n(2,278\n)\n$\n37,257\n$\n35,376\n$\n$\n79,876\nSee accompanying notes to consolidated financial statements.\nAgilysys, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n(Table amounts in thousands, except per share data)\n1. Nature of Operations\nAgilysys has been a leader in hospitality software for more than 40 years, delivering innovative guest-centric technology solutions for gaming, hotels, resorts and cruise, corporate foodservice management, restaurants, universities, stadia, airport foodservice and healthcare. Agilysys offers the most comprehensive solutions in the industry, including point of sale (POS), property management systems (PMS), inventory and procurement, payments, and related applications, to manage the entire guest journey.\nThe Company has just one reportable segment serving the global hospitality industry. Agilysys operates across North America, Europe, Asia-Pacific, and India with headquarters located in Alpharetta, GA.\nReference herein to any particular year or quarter refers to periods within the fiscal year ended March 31. For example, fiscal 2021 refers to the fiscal year ended March 31, 2021.\nCOVID-19 Pandemic\nThe World Health Organization declared novel coronavirus (“COVID-19”) a pandemic on March 11, 2020. COVID-19 has had a significant impact on our business during the year ended March 31, 2021. The extent to which COVID-19 will continue impacting our financial condition and results of operations remains uncertain and depends on various factors, including the ongoing or recurring impact on our customers, partners, and suppliers and on the operation of the global markets in general. Because an increasing portion of our business is based on a subscription model, the effect of COVID-19 on our results of operations may also not be fully reflected for some time.\n2. Summary of Significant Accounting Policies\nPrinciples of consolidation. The consolidated financial statements include the accounts of Agilysys, Inc. and subsidiaries. Investments in affiliated companies are accounted for by the equity or cost method, as appropriate. All inter-company accounts have been eliminated.\nUse of estimates. Preparation of consolidated financial statements in conformity with U.S. generally accepted accounting principles (“GAAP”) requires management to make estimates and assumptions. These estimates and assumptions affect the reported amounts of assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reported periods. Actual results could differ from those estimates. In particular, the economic disruption related to the COVID-19 pandemic had a material adverse impact on our results for the year ended March 31, 2021, and we expect it to continue to have a material adverse impact on our results. As such, this annual period, as well as upcoming interim periods, are unlikely to be comparable to past performance or indicative of future performance.\nCash and cash equivalents. We consider all highly liquid investments purchased with an original maturity from date of acquisition of three months or less to be cash equivalents. Other highly liquid investments considered cash equivalents with no established maturity date are fully redeemable on demand (without penalty) with settlement of principal and accrued interest on the following business day after instruction to redeem. Such investments are readily convertible to cash with no penalty and can include certificates of deposit, commercial paper, treasury bills, money market funds and other investments.\nAllowance for expected credit losses. We maintain allowances for expected credit losses for estimated losses resulting from the inability or unwillingness of our customers to make required payments. We base our expected credit loss model on historical experience, adjusted for current conditions and reasonable and supportable forecasts. To help mitigate the associated credit risk we perform periodic credit evaluations of our customers.\nCustomer credit allowance. We maintain allowances for estimated customer credits. Credits are typically due to the timing or amount of customer invoices processed for specific services, including professional and subscription, and maintenance coverage. In many cases, there has not been clear or timely communication of the need to adjust coverage or service at a location in advance of when we invoice for the associated coverage or service. We will issue a credit after agreeing to the service or coverage adjustment as requested by the customer within the terms of our contract. During fiscal 2021, we have included allowances for various one-time recurring revenue related and other concessions we have given to customers to help them while they deal with the impact of the COVID-19 pandemic on their operational priorities.\nInventories. Our inventories are comprised of finished goods. Inventories are stated at the lower of cost or net realizable value, net of related reserves. The cost of inventory is computed using a weighted-average method. Our inventory is monitored to ensure appropriate valuation. Adjustments of inventories to the lower of cost or net realizable value, if necessary, are based upon contractual provisions such as turnover and assumptions about future demand and market conditions. If assumptions about future demand change and/or actual market conditions are less favorable than those projected by management, additional adjustments to inventory valuations may be required. We provide a reserve for obsolescence, which is calculated based on several factors, including an analysis of historical sales of products and the age of the inventory. Actual amounts could be different from those estimated.\nLeases. We determine if an arrangement is or contains a lease at inception. Operating leases are presented as Right-of-Use (“ROU”) assets and the corresponding lease liabilities are included in operating lease liabilities - current and operating lease liabilities - non-current on our Consolidated Balance Sheet. Finance leases are included in property and equipment, net and corresponding liabilities are included in finance lease obligations - current and non-current on our Consolidated Balance Sheet. ROU assets represent our right to use the underlying asset, and lease liabilities represent our obligation for lease payments in exchange for the ability to use the asset for the duration of the lease term.\nROU assets and lease liabilities are recognized at commencement date and determined using the present value of the remaining lease payments over the lease term. We use an incremental borrowing rate based on estimated rate of interest for collateralized borrowing since our leases do not include an implicit interest rate. The estimated incremental borrowing rate considers market data, actual lease economic environment, and actual lease term at commencement date. The lease term may include options to extend when it is reasonably certain that we will exercise that option. ROU assets include lease payments made in advance, and excludes any incentives received or initial direct costs incurred. We recognize lease expense on a straight-line basis over the lease term and sublease income on a straight-line basis over the sublease term.\nWe have lease agreements with lease and non-lease components which we account for as a single lease component. We also have leases which include variable lease payments, which are expensed as incurred. Our variable lease payments are not based on an index or rate and therefore are excluded from the calculation of lease liabilities. We have elected to not recognize short term leases that have a term of twelve months or less as ROU assets or lease liabilities. Our short-term leases are not material and do not have a material impact on our ROU assets or lease liabilities. Additionally, we do not have any covenants, residual value guarantees, or related party transactions associated with our lease agreements.\nGoodwill and other indefinite-lived intangible assets. Goodwill represents the excess purchase price paid over the fair value of the net assets of acquired companies. The carrying amount of goodwill was $19.6 million as of March 31, 2021 and 2020. Goodwill is tested for impairment on an annual basis, or in interim periods if indicators of potential impairment exist. The Company evaluates whether goodwill is impaired by comparing its market capitalization based on its closing stock price (Level 1 input) to the book value of its equity on the annual evaluation date. Based on testing performed, the Company concluded that no impairment of its goodwill has occurred for the years ended March 31, 2021, 2020 and 2019.\nThe Company is also required to compare the fair values of other indefinite-lived intangible assets to their carrying amounts at least annually, or when current events and circumstances require an interim assessment. If the carrying amount of an indefinite-lived intangible asset exceeds its fair value, an impairment loss is recognized.\nLong-lived assets. Property and equipment are recorded at cost. Major renewals and improvements are capitalized. Minor replacements, maintenance, repairs, and reengineering costs are expensed as incurred. When assets are sold or otherwise disposed of, the cost and related accumulated depreciation are eliminated from the accounts and any resulting gain or loss is recognized.\nDepreciation and amortization are provided in amounts sufficient to amortize the cost of the assets, including assets recorded under finance leases, which make up less than one percent of total assets, over their estimated useful lives using the straight-line method. The estimated useful lives for depreciation and amortization are as follows: buildings and building improvements - 7 to 30 years; furniture - 7 to 10 years; equipment - 3 to 10 years; software - 3 to 10 years; and leasehold improvements over the shorter of the economic life or the lease term. Internal use software costs are expensed or capitalized depending on the project stage. Amounts capitalized are amortized over the estimated useful lives of the software, ranging from 3 to 10 years, beginning with the project’s completion. Depreciation for capitalized project expenditures does not begin until the underlying project is completed.\nWe evaluate the recoverability of our long-lived assets whenever changes in circumstances or events may indicate that the carrying amounts may not be recoverable. An impairment loss is recognized in the event the carrying value of the assets exceeds the future undiscounted cash flows attributable to such assets. Our long-lived assets and impairments considerations are discussed further in Note 4, Property and Equipment, Net.\nForeign currency translation. The financial statements of our foreign operations are translated into U.S. dollars for financial reporting purposes. The assets and liabilities of foreign operations whose functional currencies are not in U.S. dollars are translated at the period-end exchange rates, while revenue and expenses are translated at weighted-average exchange rates during the fiscal year. The cumulative translation effects are reflected as a component of “Accumulated other comprehensive loss” within shareholders’ equity in the Consolidated Balance Sheets. Gains and losses on monetary transactions denominated in other than the functional currency of an\noperation are reflected within “Other (income) expenses, net” in the Consolidated Statements of Operations. Foreign currency gains and losses from changes in exchange rates have not been material to our consolidated operating results.\nRevenue recognition. We derive revenue from the sale of products (i.e., software, third party hardware and operating systems), support, maintenance and subscription services and professional services. For the fiscal years 2021, 2020 and 2019, revenue from international operations was 8%, 9% and 9%, respectively of total revenue. Our customer base is highly fragmented.\nOn April 1, 2018, we adopted ASU No. 2014-09, Revenue from Contracts with Customers (Topic 606), using the modified retrospective method applied to those contracts that were not completed as of the adoption date.\nOur customary business practice is to enter into legally enforceable written contracts with our customers. The majority of our contracts are governed by a master service agreement between us and the customer, which sets forth the general terms and conditions of any individual contract between the parties, which is then supplemented by a customer order to specify the different goods and services, the associated prices, and any additional terms for an individual contract. Performance obligations specific to each individual contract are defined within the terms of each order. Each performance obligation is identified based on the goods and services that will be transferred to our customer that are both capable of being distinct and are distinct within the context of the contract. The transaction price is determined based on the consideration to which we will be entitled and expect to receive in exchange for transferring goods or services to the customer. Typically, our contracts do not provide our customer with any right of return or refund; we do not constrain the contract price as it is probable that there will not be a significant revenue reversal due to a return or refund.\nTypically, our customer contracts contain one or more of the following goods or services which constitute performance obligations.\nOur software licenses typically provide for a perpetual right to use our software. Generally, our contracts do not provide significant services of integration and customization and installation services are not required to be purchased directly from us. The software is delivered before related services are provided and is functional without professional services, updates and technical support. We have concluded that the software license is distinct as the customer can benefit from the software on its own. Software revenue is typically recognized when the software is delivered or made available for download to the customer.\nRevenue for hardware sales is recognized when the product is shipped to the customer and when obligations that affect the customer’s final acceptance of the arrangement have been fulfilled. Hardware is purchased from suppliers and provided to the end-user customers via drop-ship or from inventory. We are responsible for negotiating price both with the supplier and the customer, payment to the supplier, establishing payment terms and product returns with the customer, and we bear the credit risk if the customer does not pay for the goods. As the principal contact with the customer, we recognize revenue and cost of goods sold when we ship or are notified by the supplier that the product has been shipped. In certain limited instances, as shipping terms dictate, revenue is recognized upon receipt at the point of destination or upon installation at the customer site.\nSupport and maintenance revenue is derived from providing telephone and on-line technical support services, bug fixes, and unspecified software updates and upgrades to customers on a when-and-if-available basis. These services represent a stand-ready obligation that is concurrently delivered and has the same pattern of transfer to the customer; we account for these support and maintenance services as a single performance obligation recognized over the term of the maintenance agreement.\nOur subscription service revenue is comprised of fees for contracts that provide customers a right to access our software for a subscribed period. We do not provide the customer the contractual right to license the software at any time outside of the subscription period under these contracts. The customer can only benefit from the software and software maintenance when provided the right to access the software. Accordingly, each of the rights to access the software, the maintenance services, and any hosting services is not considered a distinct performance obligation in the context of the contract and should be combined into a single performance obligation to be recognized over the contract period. The Company recognizes subscription revenue over a one-month period based on the typical monthly invoicing and renewal cycle in accordance with our customer agreement terms.\nProfessional services revenues primarily consist of fees for consulting, installation, integration and training and are generally recognized over time as the customer simultaneously receives and consumes the benefits of the professional services as the services are being performed. Professional services can be provided by internal or external providers, do not significantly affect the customer’s ability to access or use other provided goods or services, and provide a measure of benefit beyond that of other promised goods or services in the contract. As a result, professional services are considered distinct in the context of the contract and represent a separate performance obligation. Professional services that are billed on a time and materials basis are recognized over time as the services are performed. For contracts billed on a fixed price basis, revenue is recognized over time using an input method based on labor hours expended to date relative to the total labor hours expected to be required to satisfy the related performance obligation.\nWe use the market approach to derive standalone selling price (“SSP”) by maximizing observable data points (in the form of recently executed customer contracts) to determine the price customers are willing to pay for the goods and services transferred. If the contract contains a single performance obligation, the entire transaction price is allocated to that performance obligation. Contracts that contain\nmultiple performance obligations require an allocation of the transaction price to each performance obligation based on a relative SSP basis.\nShipping and handling fees billed to customers are recognized as revenue and the related costs are recognized in cost of goods sold. Revenue is recorded net of any applicable taxes collected and remitted to governmental agencies.\nComprehensive (loss) income. Comprehensive (loss) income is the total of net (loss) income, as currently reported under GAAP, plus other comprehensive (loss) income. Other comprehensive (loss) income considers the effects of additional transactions and economic events that are not required to be recorded in determining net (loss) income, but rather are reported as a separate statement of comprehensive (loss) income.\nFair value measurements. We measure the fair value of financial assets and liabilities on a recurring or non-recurring basis. Financial assets and liabilities measured on a recurring basis are those that are adjusted to fair value each time a financial statement is prepared. Financial assets and liabilities measured on a non-recurring basis are those that are adjusted to fair value when a significant event occurs. In determining fair value of financial assets and liabilities, we use various valuation techniques.\nInvestments in corporate-owned life insurance policies. Agilysys invests in corporate-owned life insurance policies, for which some are endorsement split-dollar life insurance arrangements. We entered into agreements with certain former executives, whereby we must maintain the life insurance policy for a specified amount and split a portion of the policy benefits with their respective designated beneficiary. Our investment in these corporate-owned life insurance policies were recorded at their cash surrender value, which approximates fair value at the balance sheet date. In the Consolidated Balance Sheets at the balance sheet date, the cash surrender value of $1.0 million for the remaining policies were held in “Other non-current assets,” and the present value of future proceeds owed to those executives’ designated beneficiary of $0.1 million, which approximates fair value, were recorded within “Other non-current liabilities.” Additional information regarding the investments in corporate-owned life insurance policies is provided in Note 10, Employee Benefit Plans.\nIncome Taxes. Income tax expense includes U.S. and foreign income taxes and is based on reported income before income taxes. We recognize deferred tax assets and liabilities based on the differences between the financial statement carrying amounts and the tax basis of assets and liabilities. The deferred tax assets and liabilities are determined based on the enacted tax rates expected to apply in the periods in which the deferred tax assets or liabilities are anticipated to be settled or realized.\nWe regularly review our deferred tax assets for recoverability and establish a valuation allowance if it is more likely than not that some portion, or all, of a deferred tax asset will not be realized. The determination as to whether a deferred tax asset will be realized is made on a jurisdictional basis and is based on the evaluation of positive and negative evidence. This evidence includes historical taxable income, projected future taxable income, the expected timing of the reversal of existing temporary differences and the implementation of tax planning strategies.\nWe recognize the tax benefit from uncertain tax positions only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized from uncertain tax positions are measured at the largest amount of benefit that is greater than fifty percent likely of being realized upon ultimate settlement. No tax benefits are recognized for positions that do not meet this threshold. Interest related to uncertain tax positions is recognized as part of the provision for income taxes and is accrued beginning in the period that such interest would be applicable under relevant tax law until such time that the related tax benefits are recognized. Our income taxes are described further in Note 9, Income Taxes.\nCapitalized Software Development Costs. The capitalization of software development cost for external use begins when a product’s technological feasibility has been established. Capitalization ends when the resulting product is available for general market release. Amortization of the capitalized software is classified within products cost of goods sold in the Consolidated Statements of Operations. For each capitalized software product, the annual amortization is equal to the greater of: (i) the amount computed using the ratio that the software product’s current fiscal year gross revenue bears to the total current fiscal year and anticipated future gross revenues for that product or (ii) the amount computed based on straight-line method over the remaining estimated economic life of the product, which is a range between three and eight years. Annually, or more frequent as required by triggering events, an analysis of the net realizable value of the capitalized software is completed and the amount by which unamortized software costs exceeds the net realizable value, if any, is recognized as a charge to income in the period it is determined. See further discussion regarding our capitalized software development costs in Note 5, Intangible Assets and Software Development Costs.\nAdvertising and Promotion Expense. We expense advertising and promotion expense as incurred. Advertising and promotion expense was $0.4 million, $2.7 million and $2.0 million in fiscal 2021, 2020 and 2019, respectively.\nAdopted and Recently Issued Accounting Pronouncements\nIn August 2020, the FASB issued ASU No. 2020-06, Debt-Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging- Contracts in Entity’s Own Equity (Subtopic 815-40): Accounting for Convertible Instruments and\nContracts in an Entity’s Own Equity, which simplifies the accounting for convertible instruments by eliminating the requirement to separate embedded conversion features from the host contract when the conversion features are not required to be accounted for as derivatives under Topic 815, Derivatives and Hedging, or that do not result in substantial premiums accounted for as paid-in capital. By removing the separation model, a convertible debt instrument will be reported as a single liability instrument with no separate accounting for embedded conversion features. This new standard also removes certain settlement conditions that are required for contracts to qualify for equity classification and simplifies the diluted earnings per share calculations by requiring that an entity use the if-converted method and that the effect of potential share settlement be included in diluted earnings per share calculations. The new standard will be effective for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. Early adoption is permitted, but no earlier than fiscal years beginning after December 15, 2020. We are currently assessing the impact of adopting this standard on our consolidated financial statements.\nIn December 2019, the FASB issued ASU No. 2019-12, Income Taxes (Topic 740) Simplifying the Accounting for Income Taxes, which affects general principles within Topic 740, Income Taxes, and is meant to simplify and reduce the cost of accounting for income taxes. The new standard will be effective for fiscal years beginning after December 15, 2020, including interim periods within those fiscal years. We are currently reviewing this standard but do not expect it will have a material impact on our consolidated financial statements.\nIn August 2018, the FASB issued ASU No. 2018-15, Intangibles - Goodwill and Other - Internal-Use Software (Subtopic 350-40): Customer's Accounting for Implementation Costs Incurred in a Cloud Computing Arrangement That Is a Service Contract. ASU 2018-15 addresses the treatment of implementation costs incurred in a hosting arrangement that is a service contract. The update does not impact the accounting for the service element of a hosting arrangement that is a service contract. We adopted ASU 2018-15 as of April 1, 2020 with no impact on our consolidated financial statements.\nIn August 2018, the FASB issued ASU No. 2018-13, Fair Value Measurement (Topic 820): Disclosure Framework - Changes to the Disclosure Requirements for Fair Value Measurement. ASU 2018-13 addresses the required disclosures around fair value measurement. The disclosure requirements of the reasons for transfers between Level 1 and Level 2, the policy for timing transfers between levels, and the valuation process for Level 3 measurements have been removed. Certain modifications were made to required disclosures and additional requirements were established. We adopted ASU 2018-13 as of April 1, 2020 with no impact on our consolidated financial statements.\nIn January 2017, the FASB issued ASU No. 2017-04, Intangibles- Goodwill and Other (Topic 350) - Simplifying the Test for Goodwill Impairment. ASU No. 2017-04 eliminates Step 2 of the goodwill impairment test and requires goodwill impairment to be measured as the amount by which a reporting unit’s carrying amount exceeds its fair value, not to exceed the carrying amount of its goodwill. We adopted ASU 2017-04 as of April 1, 2020 with no impact on our consolidated financial statements.\nIn June 2016, the FASB issued ASU No. 2016-13, Financial Instruments-Credit Losses (Topic 326). This new standard requires entities to measure expected credit losses for certain financial assets held at the reporting date using a current expected credit loss model, which is based on historical experience, adjusted for current conditions and reasonable and supportable forecasts. The Company’s financial instruments within the scope of this guidance primarily includes accounts receivable and contract assets. We adopted ASU 2016-13 as of April 1, 2020 under the modified retrospective approach. As a result, comparative information has not been restated and continues to be reported under accounting standards applicable for those periods. The adoption of ASU 2016-13 did not have a material impact on our consolidated financial statements.\nManagement continually evaluates the potential impact, if any, of all recent accounting pronouncements on our consolidated financial statements or related disclosures and, if significant, makes the appropriate disclosures required by such new accounting pronouncements.\n3. Revenue Recognition\nOn April 1, 2018, we adopted ASU No. 2014-09, Revenue from Contracts with Customers (Topic 606), using the modified retrospective method applied to those contracts that were not completed as of the adoption date. The cumulative impact of applying the new guidance to all contracts with customers that were not completed as of April 1, 2018 was recorded as an adjustment to retained earnings as of the adoption date. As a result of applying the modified retrospective method to adopt the new standard, we also impacted accounts receivable, net, contract assets, prepaid expenses and other current assets, other non-current assets, contract liabilities and retained earnings on our Consolidated Balance Sheet as of April 1, 2018.\nFor in depth discussion regarding our revenue recognition procedures for our revenue streams, see Note 2, Summary of Significant Accounting Policies.\nDisaggregation of Revenue\nWe derive and report our revenue from the sale of products (software licenses, third party hardware and operating systems), support, maintenance and subscription services and professional services. Revenue recognized at a point in time (products) totaled $26.7 million, $44.2 million, and $39.0 million during fiscal 2021, 2020 and 2019. Revenue recognized over time (support, maintenance and subscription services and professional services) totaled $110.5 million, $116.5 million, and $101.8 million during fiscal 2021, 2020 and 2019.\nContract Balances\nContract assets are rights to consideration in exchange for goods or services that we have transferred to a customer when that right is conditional on something other than the passage of time. The majority of our contract assets represent unbilled amounts related to products and professional services. We expect billing and collection of our contract assets to occur within the next twelve months. We receive payments from customers based upon contractual billing schedules and accounts receivable are recorded when the right to consideration becomes unconditional. Contract liabilities represent consideration received or consideration which is unconditionally due from customers prior to transferring goods or services to the customer under the terms of the contract.\nRevenue recognized from amounts included in contract liabilities at the beginning of the period was $40.9 million and $37.0 million during fiscal 2021 and 2020. During fiscal 2021 and 2020, we transferred from contract assets at the beginning of the period, $2.0 million and $2.8 million, respectively, to accounts receivable because the right to the transaction became unconditional.\nOur arrangements are for a period of one year or less. As a result, unsatisfied performance obligations as of March 31, 2021 are expected to be satisfied and the allocated transaction price recognized in revenue within a period of 12 months or less.\nAssets Recognized from Costs to Obtain a Contract\nSales commission expenses that would not have occurred absent the customer contracts are considered incremental costs to obtain a contract. We have elected to take the practical expedient available to expense the incremental costs to obtain a contract as incurred when the expected benefit and amortization period is one year or less. For subscription contracts that are renewed monthly based on an agreement term, we capitalize commission expenses and amortize as we satisfy the underlying performance obligations, generally based on the contract terms and anticipated renewals. For first year support and maintenance service contracts, commission expenses are immaterial and therefore expenses as incurred. Other sales commission expenses are not material or have a period of benefit of one year or less, and are therefore expensed as incurred in line with the practical expedient elected.\nWe had $2.9 million and $3.2 million of capitalized sales incentive costs as of March 31, 2021 and 2020, respectively. These balances are included in other non-current assets on our Consolidated Balance Sheets. During fiscal 2021 and 2020, we expensed $2.8 million and $4.7 million, respectively, of sales commissions, which included amortization of capitalized amounts of $1.4 million and $1.4 million, respectively. These expenses are included in operating expenses - sales and marketing in our Consolidated Statement of Operations. All other costs to obtain a contract are not considered incremental and therefore are expensed as incurred.\n4. Property and Equipment, Net\nProperty and equipment at March 31, 2021 and 2020 is as follows:\nYear ended March 31,\n(In thousands)\nFurniture and equipment\n$\n14,899\n$\n14,358\nSoftware\n16,891\n17,136\nLeasehold improvements\n7,097\n7,012\nProject expenditures not yet in use\n39,097\n38,556\nAccumulated depreciation and amortization\n(30,308\n)\n(24,592\n)\nAccumulated impairment\n-\n(1,734\n)\nProperty and equipment, net\n$\n8,789\n$\n12,230\nTotal depreciation expense on property and equipment was $2.8 million, $2.6 million, and $2.5 million during fiscal 2021, 2020 and 2019, respectively.\nThe Company capitalizes internal-use software, including software used exclusively in providing services or that is only made available to customers as a software service, as property and equipment under ASC 350-40, Internal-Use Software. Total amortization expense on capitalized internal-use software was $2.0 million, $2.5 million and $2.5 million during fiscal 2021, 2020, and 2019, respectively. The global economic impact of the COVID-19 pandemic triggered management to review property and equipment held by the Company for indicators of impairment. The carrying value of our capitalized costs for internal-use software related to our rGuest Seat solution did not exceed the estimated undiscounted cash flows, and utilizing a market approach, was determined to be fully impaired, resulting in $1.7 million of asset impairment charges in the Consolidated Statement of Operations during the fiscal year ended March 31, 2020.\nAssets under financing leases are included in property and equipment categories above and further disclosed with Note 6. Leases.\n5. Intangible Assets and Software Development Costs\nThe following table summarizes our intangible assets and software development costs at March 31, 2021, and 2020:\nMarch 31, 2021 and 2020\nGross\nNet\ncarrying\nAccumulated\nAccumulated\ncarrying\n(In thousands)\namount\namortization\nImpairment\namount\nAmortized intangible assets:\nCustomer relationships\n$\n10,775\n$\n(10,775\n)\n$\n-\n$\n-\nNon-competition agreements\n2,700\n(2,700\n)\n-\n-\nDeveloped technology\n10,398\n(10,398\n)\n-\n-\nTrade names\n(230\n)\n-\n-\nPatented technology\n(80\n)\n-\n-\n24,183\n(24,183\n)\n-\n-\nTrade names\n8,400\nN/A\n-\n8,400\nTotal intangible assets\n$\n32,583\n$\n(24,183\n)\n$\n-\n$\n8,400\n(In thousands)\nSoftware development costs\n$\n67,541\n$\n(45,535\n)\n$\n(22,006\n)\n$\n-\nIndefinite-lived intangible assets, comprised of our purchased trade name InfoGenesis™ as of March 31, 2021 and 2020 are tested for impairment upon identification of impairment indicators or at least annually. An impairment loss is recognized if the carrying amount is greater than fair value. The InfoGenesis™ indefinite-lived purchased trade name impairment testing resulted in a fair value exceeding the carrying amount for the years ending March 31, 2021, 2020 and 2019.\nManagement compares the unamortized capitalized software development costs for each external use product to its net realizable value by analyzing critical inputs such as costs necessary to bring the software to market, costs necessary to maintain the software, life of the software, and market capacity. As of March 31, 2020, management determined the net realizable value of the remaining\ncapitalized software development costs for certain solutions within out rGuest suite of products no longer exceeded their carrying value, and as a result, recorded non-cash impairment charges of $22.0 million. The impact of the COVID-19 pandemic on the hospitality industry resulted in economic conditions which make it difficult to project future sales and revenue accurately for the related rGuest solutions. After evaluating the Company’s strategy for market development and continued costs to support the software, an impairment charge was required. The amount of impairment recognized during the period reduced the carrying value of capitalized software development costs to zero with no remaining amortization expense to be recognized in future periods.\nAmortization expense related to software development costs related to assets to be sold, leased, or otherwise marketed was $12.6 million for each of the fiscal years ended March 31, 2020 and 2019. These charges are included as Products cost of goods sold within the Consolidated Statements of Operations.\n6. Leases\nThe majority of our leases are comprised of real estate leases for our respective offices around the globe. Our finance leases consist of office equipment. We have no residual value guarantees or restrictions or covenants imposed by or associated with our active leases.\nAs of March 31, 2021, we do not have any leases which have not yet commenced. We do not have any related party leases. We have variable payments for expenses such as common area maintenance and taxes. We do not have variable payments that are based on an index or rate. As a result, we do not include variable payments in the calculation of the lease liability. Any variable costs are expensed as incurred.\nWe sublease one of our office leases located in Bellevue, Washington with a lease term that will expire during fiscal year 2024.\nThe components of lease expenses, which are included in operating expenses in our Consolidated Statements of Operations, were as follows:\nYear ended March 31,\n(in thousands)\nOperating leases expense\n$\n4,440\n$\n4,193\nFinance lease expense:\nAmortization of ROU assets\nInterest on lease liabilities\nTotal finance lease expense\nVariable lease costs\nShort term lease expense\nSublease income\n(129\n)\n-\nTotal lease expense\n$\n4,905\n$\n4,581\nOther information related to leases for fiscal 2021 and 2020 was as follows:\nYear ended March 31,\nSupplemental cash flow information\nCash paid for amounts included in the measurement of lease liabilities\n(in thousands):\nOperating cash flows for operating leases\n$\n5,987\n$\n4,873\nOperating cash flows for finance leases\nFinancing cash flows for finance leases\nROU assets obtained in exchange for lease obligations (in thousands):\nOperating leases\n$\n1,573\n$\n2,734\nFinance leases\n-\nWeighted average remaining lease terms\nOperating leases\n4.39\n5.04\nFinance leases\n1.44\n2.16\nWeighted average discount rates\nOperating leases\n10.51\n%\n10.37\n%\nFinance leases\n4.46\n%\n4.38\n%\nThe table below reconciles the undiscounted future minimum lease payments (displayed by year and in the aggregate) under non-cancelable leases with terms of more than one year to the total lease liabilities recognized on the Consolidated Balance Sheet as of March 31, 2021:\nYear ending (in thousands)\nOperating leases (1)\nFinance leases\n$\n5,211\n$\n3,494\n2,859\n2,144\n-\n1,584\n-\nThereafter\n2,431\n-\nTotal undiscounted future minimum lease payments\n17,724\nLess: difference between undiscounted lease payments and discounted lease\nliabilities\n(4,119\n)\n(3\n)\nTotal lease liabilities\n$\n13,606\n$\n(1)\nNon-cancellable sublease proceeds for the fiscal years ending March 31, 2022, 2023, and 2024 of $0.7 million, $0.8 million, and $0.7 million, respectively, are not included in the table above.\n7. Supplemental Disclosures of Cash Flow Information\nAdditional information related to the Consolidated Statements of Cash Flows is as follows:\nYear ended March 31,\n(In thousands)\nCash (receipts) for interest, net\n$\n(87\n)\n$\n(371\n)\n$\n(329\n)\nCash payments for income tax, net\nAcquisition of property and equipment under lease obligations\n-\n-\nAccrued capital expenditures\nLeasehold improvements acquired under operating lease arrangement\n-\n-\n8. Additional Balance Sheet Information\nAdditional information related to the Consolidated Balance Sheets is as follows:\n(In thousands)\nMarch 31, 2021\nMarch 31, 2020\nAccrued liabilities:\nSalaries, wages, and related benefits\n$\n8,454\n$\n6,945\nOther taxes payable\n1,796\n1,649\nAccrued legal settlements\n-\nSeverance liabilities\nProfessional fees\nOther\nTotal\n$\n11,233\n$\n9,033\nOther non-current liabilities:\nUncertain tax positions\n$\n1,129\n$\n1,103\nDeferred rent and asset retirement obligations\nEmployee benefit obligations\n2,639\nOther\nTotal\n$\n4,011\n$\n1,860\n9. Income Taxes\nFor the year ended March 31, loss before income taxes consisted of the following:\n(In thousands)\nIncome (loss) before income taxes\nUnited States\n$\n(26,272\n)\n$\n(36,373\n)\n$\n(13,621\n)\nForeign\n5,063\n2,507\nTotal loss before income taxes\n$\n(21,209\n)\n$\n(33,866\n)\n$\n(12,943\n)\nFor the year ended March 31, income tax expense (benefit) consisted of the following:\n(In thousands)\nIncome tax expense (benefit)\nCurrent:\nFederal\n$\n$\n$\nState and local\n(383\n)\nForeign\nDeferred:\nFederal\nState and local\nForeign\n(1,022\n)\n(360\n)\n(320\n)\nTotal income tax expense (benefit)\n$\n(208\n)\n$\n$\nThe following table presents the principal components of the difference between the effective tax rate to the U.S. federal statutory income tax rate for the years ended March 31:\n(In thousands)\nIncome tax benefit at the US Federal statutory rate\n$\n(4,454\n)\n$\n(7,112\n)\n$\n(2,718\n)\nBenefit for state taxes\n(803\n)\n(856\n)\n(304\n)\nImpact of foreign operations\n(841\n)\n(514\n)\n(310\n)\nIndefinite life assets\nChange in valuation allowance\n7,271\n8,406\n3,302\nChange in liability for unrecognized tax benefits\n(400\n)\nImpact of Tax Act, net\n-\n-\nShare-based compensation\n(2,232\n)\n(312\n)\nGlobal intangible low-taxed income\nDeferred adjustments\n(478\n)\n-\n-\nProvision to return\n(35\n)\nOther\n(3\n)\nTotal income tax expense (benefit)\n$\n(208\n)\n$\n$\nWe have elected to account for global intangible low-taxed income (GILTI) inclusions in the period in which they are incurred.\nOur tax provision includes a provision for income taxes in certain foreign jurisdictions where subsidiaries are profitable, but only a minimal benefit is reflected related to U.S. and certain foreign tax losses due to the uncertainty of the ultimate realization of future benefits from these losses. The fiscal 2021 tax provision results primarily from foreign tax benefit. The fiscal 2021 tax provision differs from the statutory rate primarily due to adjustments to deferred tax assets and the recording of net operating losses in a number of foreign jurisdictions offset by current year expense in other foreign jurisdictions.\nThe fiscal 2020 tax provision results primarily from foreign tax expense. The fiscal 2020 tax provision differs from the statutory rate primarily due to the recognition of net operating losses as deferred tax assets, which were offset by increases in the valuation allowance, state taxes and other U.S. permanent book to tax differences.\nDeferred tax assets and liabilities as of March 31, are as follows:\n(In thousands)\nDeferred tax assets:\nAccrued liabilities\n$\n9,141\n$\n3,059\nAllowance for expected credit losses and doubtful accounts\nFederal losses and credit carryforwards\n51,856\n47,218\nForeign losses and credit carryforwards\n2,103\n1,523\nState losses and credit carryforwards\n11,642\n10,911\nDeferred revenue\nProperty and equipment and software amortization\nOperating lease liabilities\n2,694\n1,297\nGoodwill and other intangible assets\n1,889\n4,914\nOther\n80,329\n70,086\nLess: valuation allowance\n(74,631\n)\n(66,819\n)\nTotal\n5,698\n3,267\nDeferred tax liabilities:\nOperating lease right-of-use assets\n(2,312\n)\n(948\n)\nGoodwill and other intangible assets\n(2,514\n)\n(2,426\n)\nOther\n(9\n)\nTotal\n(4,819\n)\n(3,383\n)\nTotal deferred tax assets (liabilities)\n$\n$\n(116\n)\nAt March 31, 2021, we had $199.1 million of federal net operating loss carryforwards that expire, if unused, in fiscal years 2031 to 2038, and $46.8 million of federal net operating loss carryforwards that can be carried forward indefinitely. Our Hong Kong, Malaysia, and Singapore subsidiaries have $0.4 million, $0.1 million, and $0.2 million of net operating loss carryforwards, respectively. The losses for Hong Kong, Malaysia and Singapore can be carried forward indefinitely. Our India subsidiary operates in a “Special Economic Zone (“SEZ”)”. One of the benefits associated with the SEZ is that the India subsidiary is not subject to regular India income taxes during its first 5 years of operations which includes fiscal 2018 through fiscal 2022. The India subsidiary is then subject to 50% of regular India income taxes during the second five years of operations which includes fiscal 2023 through fiscal 2027. The aggregate value of the benefit of the SEZ during the current fiscal year is $1.4 million as of March 31, 2021. The Company has paid minimum alternative taxes during the period of regular tax relief resulting in a credit of $1.4 million as of March 31, 2021.\nAt March 31, 2021 we also had $165.6 million of state net operating loss carryforwards that expire, if unused, in fiscal years 2022 through 2041.\nWe recorded valuation allowances related to certain deferred income tax assets due to the uncertainty of the ultimate realization of the future benefits from those assets. At March 31, 2021, the total valuation allowance against deferred tax assets of $74.6 million was comprised of $73.7 million for federal and state deferred tax assets, and $0.9 million associated with deferred tax assets in Hong Kong, Malaysia, Singapore and the Philippines. In assessing the realizability of deferred tax assets, management considers whether it is more-likely-than-not that some, or all, of the deferred tax assets will not be realized. We have recorded a valuation allowance offsetting substantially all of our deferred tax assets. The ultimate realization of deferred tax assets depends on the generation of future taxable income during the periods in which those temporary differences are deductible. Management considers the scheduled reversal of deferred tax liabilities (including the impact of available carryback and carryforward periods), projected taxable income, and tax planning strategies in making this assessment. In order to fully realize the deferred tax assets, we will need to generate future taxable income before the expiration of the deferred tax assets governed by the tax code. Because of our losses in current and prior periods, management believes that it is more-likely-than-not that we will not realize the benefits of these deductible differences. The amount of the valuation allowance, however, could be reduced in the near term. The exact timing will be based on the level of profitability that we are able to achieve and our visibility into future results. Our recorded tax rate may increase in subsequent periods following a valuation release. Any valuation allowance release will not affect the amount of cash paid for income taxes.\nThe undistributed earnings of our foreign subsidiaries are not subject to U.S. federal and state income taxes unless such earnings are distributed in the form of dividends or otherwise to the extent of current and accumulated earnings and profits. The undistributed earnings of foreign subsidiaries are permanently reinvested and totaled $8.4 million and $6.3 million as of March 31, 2021 and 2020, respectively. We made the determination of permanent reinvestment on the basis of sufficient evidence that demonstrates we will invest the undistributed earnings overseas indefinitely for use in working capital, as well as foreign acquisitions and expansion. The determination of the amount of the unrecognized deferred U.S. income tax liability related to the undistributed earnings is not practicable.\nWe recorded a liability for uncertain tax positions. The aggregate changes in the balance of our uncertain tax positions were as follows for the years ended March 31:\n(In thousands)\nBalance at April 1\n$\n$\n$\nReductions relating to lapse in statute\n-\n(5\n)\n(107\n)\nBalance at March 31\n$\n$\n$\nAs of March 31, 2021, we had a liability of $0.6 million related to uncertain tax positions, the recognition of which would affect our effective income tax rate.\nAlthough the timing and outcome of tax settlements are uncertain, it is reasonably possible that during the next 12 months an immaterial reduction in unrecognized tax benefits may occur as a result of the expiration of various statutes of limitations. We are consistently subject to tax audits; due to the nature of examinations in multiple jurisdictions, changes could occur in the amount of gross unrecognized tax benefits during the next 12 months which cannot be estimated at this time.\nWe recognize interest accrued on any uncertain tax positions as a component of income tax expense. Penalties are recognized as a component of general and administrative expenses. We recognized interest and penalty expense of less than $0.1 million for the years ended March 31, 2021, 2020 and 2019. As of March 31, 2021 and 2020, we had approximately $0.5 million and $0.5 million, respectively, of interest and penalties accrued in other non-current liabilities on our Consolidated Balance Sheets.\nIn the U.S. we file consolidated federal and state income tax returns where statutes of limitations generally range from three to five years. Although we have resolved examinations with the IRS through tax year ended March 31, 2010, U.S. federal tax years are open from 2006 forward due to attribute carryforwards. The statute of limitations is open from fiscal year 2014 forward in certain state jurisdictions. We also file income tax returns in international jurisdictions where statutes of limitations generally range from three to seven years. Years beginning after 2010 are open for examination by certain foreign taxing authorities.\nThe Coronavirus Aid, Relief, and Economic Security Act (“CARES Act”)\nOn March 27, 2020, President Trump signed into law the CARES Act. The CARES Act includes provisions addressing the carryback of net operating losses for specific periods, refunds of alternative minimum tax credits, temporary modification to the limitation placed on the tax deductibility of net interest expenses, and technical amendments for qualified improvement property. Additionally, the CARES Act provides, among other provisions, for the deferral of the employer-paid portion of social security taxes through the end of 2020, with 50% of the deferred amount due December 31, 2021 and the remaining 50% due December 31, 2022; the CARES Act also provides for certain employee retention tax credits.\nAs of March 31, 2021, these provisions are expected to provide us with approximately $0.1 million of additional liquidity due to the ability to accelerate outstanding alternative minimum tax credit refunds. Due to the net loss position of the Company, we do not anticipate impacts from net loss carryback or deductibility provisions. We deferred the employer-paid portion of social security taxes through December 31, 2020, but do not anticipate qualifying for employee retention tax credits.\nAs of March 31, 2021, significant uncertainty continues to exist regarding the magnitude and duration of the impact of the COVID-19 pandemic; therefore, we cannot predict at this time the ultimate extent of its impact on our business operations, financial results and resulting effects to income taxes in future periods. See Part II, Item 1A. of this Annual Report for further discussion regarding risks associated with the COVID-19 pandemic.\n10. Employee Benefit Plans\nDefined Contribution Plans\nWe maintain 401(k) plans for employees located in the United States meeting certain service requirements. Generally, the plans allow eligible employees to contribute a portion of their compensation, and we match 100% of the first 1% of the employee's pre-tax contributions and 50% of the next 5% of the employee's pre-tax contributions. We may also make discretionary contributions each year for the benefit of all eligible employees under the plans. During fiscal 2021, we suspended matching contributions as part of the\ncost reduction measures we have taken in response to uncertainties about the impact COVID-19 will have on our results of operations. Agilysys matching contributions were $0.1 million, $1.8 million, and $1.6 million in fiscal 2021, 2020, and 2019, respectively.\nWe also maintain defined contribution retirement plans for employees located in the United Kingdom and in the Asia Pacific region in accordance with local statutory requirements and business practices.\nDefined Benefit Plan\nWe maintain a defined benefit retirement plan (the “Gratuity Plan”) covering eligible employees of our India subsidiary in accordance with local statutory requirements and business practices. The Gratuity Plan provides a lump-sum payment to vested employees at retirement, death, incapacitation, or termination of employment, of an amount based on the respective employee’s salary and the tenure of employment with the Company. The Gratuity Plan is unfunded with obligation amounts recorded in the Consolidated Balance Sheets as “Employee benefit obligations” within “Other non-current liabilities.”\nEndorsement Split-Dollar Life Insurance\nAgilysys provides certain former executives with life insurance benefits through endorsement split-dollar life insurance arrangements. We entered into agreements with each of the former executives, whereby we must maintain the life insurance policy for a specified amount and split a portion of the policy benefits with their designated beneficiary.\nOur investment in these corporate-owned life insurance policies were recorded at their cash surrender value, which approximates fair value at the balance sheet date. In the Consolidated Balance Sheets as of March 31, 2021 and 2020, the cash surrender value of $1.0 million for the remaining policies were held in “Other non-current assets,” and the present value of future proceeds owed to those executives' designated beneficiaries of $0.1 million, which approximates fair value, were recorded within \"Other non-current liabilities.\"\nChanges in the cash surrender value of these policies related to gains and losses incurred on these investments are classified within “Other (income) expenses, net” in the accompanying Consolidated Statements of Operations. We recorded a gain of $31,000, $14,000 and $15,000 in fiscal 2021, 2020, and 2019, respectively, related to the corporate-owned life insurance policies.\n11. Commitments and Contingencies\nLegal Contingencies\nWe are involved in legal actions that arise in the ordinary course of business. It is the opinion of management that the resolution of any current pending litigation will not have a material adverse effect on our financial position or results of operations.\nOn April 6, 2012, Ameranth, Inc. filed a complaint against us in the U.S. District Court for the Southern District of California alleging that certain of our products infringe patents owned by Ameranth directed to configuring and transmitting hospitality menus (e.g., restaurant menus) for display on electronic devices, and synchronizing the menu content between devices. The case against us was consolidated with similar cases brought by Ameranth against more than 30 other defendants. All but one of the patents at issue in the case were invalidated by the U.S. Court of Appeals for the Federal Circuit in 2016. In September 2018, the District Court found the one surviving Ameranth patent invalid, and granted summary judgment in favor of the movant co-defendants. In November 2019, the U.S. Court of Appeals for the Federal Circuit affirmed the lower court’s summary judgement with respect to all claims except for two, which were not asserted against Agilysys. Ameranth’s writ of certiorari to the United States Supreme Court was denied in October 2020. Subsequently, Ameranth filed further pleading amendments and discovery requests with the District Court, which were opposed by the defendants.\nWe were not a party to the appeal, and it is currently unclear what impact the summary judgment ruling or writ of certiorari may have on our case. Ameranth seeks monetary damages, injunctive relief, costs and attorneys’ fees from us. At this time, we are not able to predict the outcome of the remaining claims in the lawsuit, or any possible monetary exposure associated with the lawsuit. However, we dispute the allegations of wrongdoing and are vigorously defending ourselves in this matter.\n12. Loss per Share\nThe following data shows the amounts used in computing loss per share and the effect on earnings and the weighted average number of shares of dilutive potential common shares.\nYear Ended March 31,\n(In thousands, except per share data)\nNumerator:\nNet loss\n$\n(21,001\n)\n$\n(34,067\n)\n$\n(13,164\n)\nSeries A convertible preferred stock issuance costs\n(1,031\n)\n-\n-\nSeries A convertible preferred stock dividends\n(1,576\n)\n-\n-\nNet loss attributable to common shareholders\n$\n(23,608\n)\n$\n(34,067\n)\n$\n(13,164\n)\nDenominator:\nWeighted average shares outstanding - basic and diluted\n23,458\n23,233\n23,037\nLoss per share - basic and diluted:\n$\n(1.01\n)\n$\n(1.47\n)\n$\n(0.57\n)\nAnti-dilutive stock options, SSARs, restricted shares,\nperformance shares and preferred shares\n4,228\n1,510\n1,433\nBasic earnings (loss) per share is computed as net income available to common shareholders divided by the weighted average basic shares outstanding. The outstanding shares used to calculate the weighted average basic shares excludes 132,198, 208,581 and 300,437 of restricted shares and performance shares at March 31, 2021, 2020 and 2019, respectively, as these shares were issued but were not vested and, therefore, not considered outstanding for purposes of computing basic earnings per share at the balance sheet dates.\nDiluted earnings (loss) per share includes the effect of all potentially dilutive securities on earnings per share. We have stock-settled appreciation rights (\"SSARs\") and unvested restricted shares that are potentially dilutive securities. When a loss is reported, the denominator of diluted earnings per share cannot be adjusted for the dilutive impact of share-based compensation awards because doing so would be anti-dilutive. In addition, when a net loss is reported, adjusting the denominator of diluted earnings per share would also be anti-dilutive to the loss per share, even if the entity has net income after adjusting for a discontinued operation. Therefore, for all periods presented, basic weighted-average shares outstanding were used in calculating the diluted net loss per share.\n13. Share-based Compensation\nWe may grant non-qualified stock options, incentive stock options, SSARs, restricted shares, and restricted share units under our shareholder-approved 2020 Stock Incentive Plan (the 2020 Plan) for up to 2.25 million common shares, plus 868,864 common shares, the number of shares that were remaining for grant under the 2016 Stock Incentive Plan (the 2016 Plan) as of the effective date of the 2020 Plan, plus the number of shares remaining for grant under the 2016 Plan that are forfeited, settled in cash, canceled or expired. The maximum aggregate number of restricted shares or restricted share units that may be granted under the 2020 Plan is 3.1 million.\nWe may distribute authorized but unissued shares or treasury shares to satisfy share option and appreciation right exercises or restricted share and performance share awards.\nFor SSARs, the exercise price must be set at least equal to the closing market price of our common shares on the date of grant. The maximum term of SSARs is seven years from the date of grant. The Compensation Committee of the Board of Directors establishes the period over which SSARs subject to a service condition vest and the vesting criteria for SSARs subject to a market condition.\nRestricted shares and restricted share units, whether time-vested or performance-based, may be issued at no cost or at a purchase price that may be below their fair market value, but are subject to forfeiture and restrictions on their sale or other transfer. Performance-based awards may be conditioned upon the attainment of specified performance objectives and other conditions, restrictions, and contingencies. Restricted shares and restricted share units have the right to receive dividends, or dividend equivalents in the case of restricted share units, if any, upon vesting, subject to the same forfeiture provisions that apply to the underlying awards.\nWe record compensation expense related to SSARs, restricted shares, and performance shares granted to certain employees and non-employee directors based on the fair value of the awards on the grant date. The fair value of restricted shares is based on the closing price of our common shares on the grant date. Under the 2020 Plan, the fair value of performance shares is based on the closing price of our common shares on the settlement date of the performance award, which is consistent with our annual bonus incentive plan as approved by the Compensation Committee of the Board of Directors. The fair value of SSARs subject to a service condition is estimated on the grant date using the Black-Scholes-Merton option pricing model, which includes assumptions regarding the risk-free interest rate, dividend yield, life of the award, and the volatility of our common shares. The fair value of SSARs subject to a market condition is estimated using a Lattice option pricing model that utilizes a binary tree and includes multiple assumptions including the volatility and life of the award to determine an appropriate fair value based on the award grant date.\nThe following table summarizes the share-based compensation expense for options, SSARs, restricted and performance awards included in the Consolidated Statements of Operations for fiscal 2021, 2020 and 2019:\nYear Ended March 31,\n(In thousands)\nProduct development\n21,634\n2,241\n1,478\nSales and marketing\n4,254\nGeneral and administrative\n14,206\n2,643\n2,429\nTotal share-based compensation expense\n40,093\n5,205\n4,376\nStock-Settled Stock Appreciation Rights\nSSARs are rights granted to an employee to receive value equal to the difference in the price of our common shares on the date of the grant and on the date of exercise. This value is settled only in common shares of Agilysys.\nWe use a Black-Scholes-Merton option pricing model to estimate the fair value of service condition SSARs. The following table summarizes the principal assumptions utilized in valuing service condition SSARs granted in fiscal 2021, 2020 and 2019:\nRisk-free interest rate\n0.31\n%\n1.38%-1.74%\n2.68\n%\nExpected life (in years)\n4.5-5\nExpected volatility\n42.99\n%\n31.7%-32.42%\n32.42\n%\nWeighted-average grant date fair value\n$\n22.57\n$\n10.01\n$\n4.72\nThe risk-free interest rate is based on the yield of a zero coupon U.S. Treasury bond whose maturity period approximates the expected life of the SSARs. The expected life is estimated using historical data representing the period of time the awards are expected to be outstanding. The estimated fair value of the SSARs granted is recognized over the vesting period of the awards utilizing the graded vesting method. Under this method, the compensation cost related to unvested amounts begins to be recognized as of the grant date.\nWe use a Lattice option pricing model to estimate the fair value of market condition SSARs. The following table summarizes the principal assumptions utilized in valuing market condition SSARs granted in fiscal 2021 and 2020:\nRisk-free interest rate over contractual term\n0.60\n%\n1.40\n%\nExpected volatility\n40.00\n%\n31.70\n%\nSuboptimal exercise factor\n2.50x\n3.0x\nWeighted-average grant date fair value\n$\n19.55\n$\n9.60\nThe following table summarizes the activity during fiscal 2021 for SSARs awarded under the 2020 and 2016 Plans:\n(In thousands, except share and per share data)\nNumber\nof Rights\nWeighted-\nAverage\nExercise\nPrice\nRemaining\nContractual\nTerm\nAggregate\nIntrinsic\nValue\n(per right)\n(in years)\nOutstanding at April 1, 2020\n1,644,888\n$\n21.07\nGranted\n2,234,858\n20.02\nExercised\n(736,778\n)\n18.75\nForfeited\n(72,207\n)\n19.80\nCancelled/expired\n(2,508\n)\n14.22\nOutstanding at March 31, 2021\n3,068,253\n$\n20.90\n5.1\n$\n83,038\nExercisable at March 31, 2021\n1,913,692\n$\n17.74\n4.6\n$\n57,829\nVested and expected to vest at March 31, 2021\n3,068,253\n$\n20.90\n5.1\n$\n83,038\nThe following table presents additional information related to SSARs activity during fiscal 2021, 2020 and 2019:\n(In thousands)\nCompensation expense\n$\n35,808\n$\n1,666\n$\nTotal intrinsic value of SSARs exercised\n$\n25,153\n$\n$\nTotal fair value of SSARs vesting\n$\n31,380\n$\n1,328\n$\n1,165\nAs of March 31, 2021, total unrecognized share-based compensation expense related to non-vested service condition SSARs was $15.1 million, which is expected to be recognized over the weighted-average vesting period of 2.0 years.\nA total of 466,471 shares, net of 127,047 shares withheld to cover the employee’s minimum applicable income taxes, were issued from treasury shares to settle SSARs exercised during the twelve months ended March 31, 2021. The shares withheld were returned to treasury shares.\nRestricted Shares\nWe granted shares to certain of our Directors, executives and key employees under the 2020 and 2016 Plans, the vesting of which is service-based. The following table summarizes the activity during the twelve months ended March 31, 2021 for restricted shares awarded under the 2020 and 2016 Plans:\nNumber\nof Shares\nWeighted-\nAverage\nGrant-\nDate Fair\nValue\n(per share)\nOutstanding at April 1, 2020\n178,462\n$\n19.89\nGranted\n145,210\n45.97\nVested\n(159,905\n)\n28.72\nForfeited\n(31,569\n)\n20.68\nOutstanding at March 31, 2021\n132,198\n$\n37.67\nThe weighted-average grant date fair value of the restricted shares is determined based upon the closing price of our common shares on the grant date. During fiscal 2021, a total of 132,444 shares, net of 28,330 shares withheld from the vested restricted shares to cover the employee's minimum applicable income taxes, were issued from treasury. The shares withheld were returned to treasury shares.\nThe following table presents additional information related to restricted stock activity during fiscal years 2021, 2020, and 2019:\n(In thousands)\nCompensation expense\n$\n4,285\n$\n3,385\n$\n2,803\nTotal fair value of restricted share vesting\n$\n7,669\n$\n4,004\n$\n4,383\nAs of March 31, 2021, total unrecognized share-based compensation expense related to non-vested restricted stock was $4.0 million, which is expected to be recognized over a weighted-average vesting period of 1.9 years. We do not include restricted stock in the calculation of earnings per share until the shares are vested.\nPerformance Shares\nThe following table summarizes the activity during fiscal 2021 for performance shares awarded under the 2016 Plan:\nNumber\nof\nShares\nWeighted-\nAverage\nGrant-\nDate Fair\nValue\n(per share)\nOutstanding at April 1, 2020\n30,120\n$\n22.41\nGranted\n-\n-\nVested\n(6,714\n)\n22.41\nForfeited\n(23,406\n)\n22.41\nOutstanding at March 31, 2021\n-\n$\n-\nBased on the performance goals, management estimates a liability of $180,000 to be settled through the granting of performance shares under the 2020 plan after March 31, 2021. The number of shares granted will be based on the closing price of our common shares on the settlement date. As of March 31, 2021, total share-based compensation expense related to performance shares has been fully recognized.\nThe following table presents additional information related to performance share activity during fiscal 2021, 2020 and 2019:\n(In thousands)\nCompensation expense\n$\n$\n$\nTotal fair value of performance share vesting\n$\n$\nOnce attainment of the performance goals becomes probable, compensation expense related to performance share awards is recognized ratably over the vesting period based upon the closing market price of our common shares on the grant date.\n14. Preferred Stock\nSeries A Convertible Preferred Stock\nOn May 22, 2020, we completed the sale of 1,735,457 shares of our preferred stock, without par value, designated as “Series A Convertible Preferred Stock” (the “Convertible Preferred Stock”) to MAK Capital Fund L.P. and MAK Capital Distressed Debt Fund I, LP (the “Holders”) each, in its capacity as a designee of MAK Capital One LLC (the “Purchaser”), pursuant to the terms of the Investment Agreement, dated as of May 11, 2020, between the Company and the Purchaser, for an aggregate purchase price of $35 million. We incurred issuance costs of $1.0 million. We added all issuance costs that were netted against the proceeds upon issuance of the Convertible Preferred Stock to its redemption value. As disclosed in our Annual Report for the fiscal year ended March 31, 2020, Michael Kaufman, the Chairman of the Company’s Board of Directors, is the Chief Executive Officer of MAK Capital One LLC.\nAccounting Policy\nWe classify convertible preferred stock as temporary equity in the consolidated balance sheets due to certain contingent redemption clauses that are at the election of the Holders. We increase the carrying value of the convertible preferred stock to its redemption value (described below) for all undeclared dividends using the interest method.\nThe Convertible Preferred Stock has the following rights, preferences and restrictions (the Certificate of Amendment included as Exhibit 3.1 to our Current Report on Form 8-K, filed on May 26, 2020, defines all terms not otherwise defined below):\nVoting\nThe Holders will be entitled to one vote for each share of Convertible Preferred Stock upon all matters presented to the common shareholders of the Company, and except as otherwise provided by the Amended Articles of Incorporation of the Company or required\nby law, the Holders and common shareholders will vote together as one class on all matters. Additionally, certain matters specific to the Convertible Preferred Stock will require the approval of two-thirds of the outstanding Convertible Preferred Stock, voting as a separate class.\nLiquidation Preference\nUpon a liquidation, dissolution or winding up of the Company, each share of Convertible Preferred Stock will be entitled to receive an amount per share equal to the greater of (i) the purchase price paid by the Purchaser, plus all accrued and unpaid dividends (the “Liquidation Preference”) and (ii) the amount that the Holder would have been entitled to receive at such time if the Convertible Preferred Stock were converted into common stock.\nRedemption\nOn and after the fifth anniversary of the date the Convertible Preferred Stock is initially issued, the Company will have the right, and the Holders will have the right to require the Company, in each case, at the initiating party’s election, to redeem all, but not less than all, of the then-outstanding Convertible Preferred Stock for an amount equal to the Liquidation Preference.\nConversion\nEach Holder will have the right, at its option, to convert its Convertible Preferred Stock, in whole or in part, into fully paid and non-assessable shares of common stock at a conversion price equal to $20.1676 per share (as may be adjusted from time to time, as described in the Certificate of Amendment).\nSubject to certain conditions, the Company may, at its option, require conversion of all of the outstanding shares of Convertible Preferred Stock to common stock if, at any time after November 22, 2023, the daily volume-weighted average price of the Company’s common stock is at least 150% of the conversion price for at least 20 trading days during the 30 consecutive trading days immediately preceding the date the Company notifies the Holders of the election to convert.\nDividends\nThe Holders are entitled to dividends on the Liquidation Preference at the rate of 5.25% per annum, payable semi-annually either (i) 50% in cash and 50% in kind as an increase in the then-current Liquidation Preference or (ii) 100% in cash, at the option of the Company. The Holders are not entitled to participate in dividends declared or paid on the common stock on an as-converted basis; however, certain anti-dilution adjustments to the Convertible Preferred Stock may be made in the event of such dividends.\nThe Convertible Preferred Stock ranks senior to the Company’s common stock with respect to dividends and distributions on liquidation, winding-up and dissolution. Upon a liquidation, dissolution or winding up of the Company, each share of Convertible Preferred Stock will be entitled to receive an amount per share equal to the greater of (i) the Liquidation Preference and (ii) the amount that the Holder would have been entitled to receive at such time if the Convertible Preferred Stock were converted into common stock.\nChange in Control Events\nUpon certain change of control events involving the Company, the Company has the right, and each Holder has the right, in each case, at the initiating party’s election, to require the Company to repurchase all or a portion of its then-outstanding shares of Convertible Preferred Stock for cash consideration equal to (i) 150% of the then-current Liquidation Preference for a change of control occurring prior to the third anniversary of the date the Convertible Preferred Stock is initially issued, (ii) 125% of the then-current Liquidation Preference for a change of control occurring on or following the third anniversary and prior to the fifth anniversary of the date the Convertible Preferred Stock is initially issued and (iii) 100% of the then-current Liquidation Preference for a change of control occurring on or following the fifth anniversary of the date the Convertible Preferred Stock is initially issued.\nStandstill Restrictions\nThe Purchaser and its affiliates are subject to certain customary standstill provisions that restrict them from, among other actions, acquiring additional securities of the Company if such acquisition would result in the Purchaser beneficially owning in excess of 25% of the outstanding shares of common stock of the Company until the later of the third anniversary of the date the Convertible Preferred\nStock is initially issued and the date on which the Purchaser no longer has record or beneficial ownership of common stock and Convertible Preferred Stock that constitute at least 10% of the outstanding common stock.\n15. Subsequent Events\nNone.\n16. Related Party Transaction\nSee Note 14. Preferred Stock, for description of the MAK Capital investment in the Company. Michael Kaufman, the Chairman of the Company’s Board of Directors, is the Chief Executive Officer of MAK Capital.\nSchedule II - Valuation and Qualifying Accounts Years ended March 31, 2021, 2020 and 2019\n(In thousands)\nBalance at\nbeginning of\nyear\nCharged to\ncosts and\nexpenses\nDeductions\nBalance at\nend of\nyear\nDeferred tax valuation allowance\n$\n66,819\n$\n7,812\n$\n-\n$\n74,631\nAllowance for expected credit losses\n$\n1,634\n$\n$\n(922\n)\n$\n1,220\nDeferred tax valuation allowance\n$\n57,852\n$\n8,967\n$\n-\n$\n66,819\nAllowance for doubtful accounts\n$\n$\n1,434\n$\n(588\n)\n$\n1,634\nDeferred tax valuation allowance\n$\n54,260\n$\n3,592\n.\n$\n57,852\nAllowance for doubtful accounts\n$\n$\n$\n(651\n)\n$",
    "item_9": "Item 9. Change in and Disagreements With Accountants on Accounting and Financial Disclosures.\nNone.",
    "item_9A": "Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nOur management, with the participation of our Chief Executive Officer (“CEO”) and Chief Financial Officer (“CFO”), evaluated the effectiveness of our disclosure controls and procedures as of the end of the period covered by this report. Based on that evaluation, the CEO and CFO concluded that our disclosure controls and procedures as of the end of the period covered by this report are effective to ensure that information required to be disclosed by us in reports filed under the Exchange Act of 1934 is (i) recorded, processed, summarized, and reported within the time periods specified in the SEC's rules and forms and (ii) is accumulated and communicated to our management, including the CEO and CFO, as appropriate to allow for timely decisions regarding required disclosure. A controls system cannot provide absolute assurance, however, that the objectives of the controls system are met, and no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within a company have been detected.\nManagement's Report on Internal Control Over Financial Reporting\nThe management of Agilysys, under the supervision of the CEO and CFO, is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rules 13a-15(f) and 15d-15(f). Under the supervision of our CEO and CFO, management conducted an evaluation of the effectiveness of our internal control over financial reporting as of March 31, 2021 based on the framework in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”). Based on that evaluation, management concluded that Agilysys maintained effective internal control over financial reporting as of March 31, 2021.\nGrant Thornton LLP, our independent registered public accounting firm, issued their report regarding Agilysys' internal control over financial reporting as of March 31, 2021, which is included elsewhere in this annual report.\nChange in Internal Control over Financial Reporting\nNo changes in our internal control over financial reporting occurred during the last quarter of fiscal 2021 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. In response to the COVID-19 pandemic, our workforce began working remotely in March 2020. Our established internal controls continued to operate as they have historically, and the change in the work environment for our employees did not have a material adverse effect on our internal control over financial reporting during the quarter ended March 31, 2021.",
    "item_9B": "Item 9B. Other Information\nNone.\nPart III",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance.\nInformation required by this Item as to the Directors of Agilysys, Executive Officers, the Audit Committee, Agilysys' Code of Business Conduct, and the procedures by which shareholders may recommend nominations appearing under the headings “Election of Directors,” “Executive Officers” and “Corporate Governance” in our Proxy Statement to be used in connection with Agilysys' 2021 Annual Meeting of Shareholders (the “2021 Proxy Statement”) is incorporated herein by reference. Information with respect to compliance with Section 16(a) of the Securities Exchange Act of 1934 by our Directors, executive officers, and holders of more than five percent of Agilysys' equity securities will be set forth in the 2021 Proxy Statement under the heading “Section 16(a) Beneficial Ownership Reporting Compliance.”\nWe adopted a Code of Business Conduct that applies to all Directors and employees of Agilysys, including the Chief Executive Officer and Chief Financial Officer. The Code is available on our website at http://www.agilysys.com .",
    "item_11": "Item 11. Executive Compensation.\nThe information required by this Item is set forth in our 2021 Proxy Statement under the headings, “Executive Compensation,” “Director Compensation,” “Compensation Committee Report,” and “Corporate Governance,” which is incorporated herein by reference.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Shareholder Matters.\nThe information required by this Item is set forth in our 2021 Proxy Statement under the headings “Beneficial Ownership of Common Shares,” and “Equity Compensation Plan Information,” which information is incorporated herein by reference.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence.\nThe information required by this item is set forth in our 2021 Proxy Statement under the headings “Corporate Governance” and “Related Person Transactions,” which information is incorporated herein by reference.",
    "item_14": "Item 14. Principal Accountant Fees and Services.\nThe information required by this Item is set forth in our 2021 Proxy Statement under the heading “Ratification of Appointment of Independent Registered Public Accounting Firm,” which information is incorporated herein by reference.\nPART IV",
    "item_15": "Item 15. Exhibits and Financial Statement Schedules.\n(a)(1) Financial statements. The following consolidated financial statements are included herein and are incorporated by reference in Part II, Item 8 of this Annual Report:\nReport of Grant Thornton LLP, Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of March 31, 2021 and 2020\nConsolidated Statements of Operations for the years ended March 31, 2021, 2020, and 2019\nConsolidated Statements of Comprehensive Loss for the years ended March 31, 2021, 2020, and 2019\nConsolidated Statements of Cash Flows for the years ended March 31, 2021, 2020, and 2019\nConsolidated Statements of Shareholders' Equity for the years ended March 31, 2021, 2020, and 2019\nNotes to Consolidated Financial Statements\n(a)(2) Financial statement schedule. The following financial statement schedule is included herein and is incorporated by reference in Part II, Item 8 of this Annual Report:\nSchedule II - Valuation and Qualifying Accounts\nAll other schedules have been omitted since they are not applicable or the required information is included in the consolidated financial statements or notes thereto.\n(a)(3) Exhibits. Exhibits included herein and those incorporated by reference are listed in the Exhibit Index of this Annual Report.\nItem 16. Form 10-K Summary.\nNone.\nAgilysys, Inc.\nExhibit Index\nExhibit No.\nDescription\n3.1\nAmended Articles of Incorporation of Agilysys, Inc., which is incorporated by reference to Exhibit 3.1 to Agilysys, Inc.'s Amendment to Annual Report on Form 10-K/A filed July 29, 2020 (File No. 000-05734).\n3.2\nAmended Code of Regulations of Agilysys, Inc., which is incorporated by reference to Exhibit 3.1 to Agilysys, Inc.'s Quarterly Report on Form 10-Q for the quarter ended September 30, 2020 (File No. 000-05734).\nDescription of Registrant’s Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934, which is incorporated by reference to Exhibit 4 to Agilysys, Inc.'s Amendment to Annual Report on Form 10-K/A filed July 29, 2020 (File No. 000-05734).\n*10.1\nThe Company's Annual Incentive Plan, which is incorporated herein by reference to Exhibit 10(b) to Agilysys, Inc.'s Definitive Proxy Statement on Schedule 14A filed June 28, 2011 (File No. 000-05734).\n*10.2\nIndemnification Agreement entered into by and between Agilysys, Inc. and each of its Directors, which is incorporated herein by reference to Exhibit 10(e) to Agilysys, Inc.'s Annual Report on Form 10-K for the year ended March 31, 2018 (File No. 000-05734).\n*10.3\nAgilysys, Inc. 2011 Stock Incentive Plan, which is incorporated herein by reference to Exhibit 10(a) to Agilysys, Inc.'s Definitive Proxy Statement on Schedule 14A filed June 28, 2011 (File No. 000-05734).\n*10.4\nAgilysys, Inc. 2016 Stock Incentive Plan, which is incorporated herein by reference to Appendix B to Agilysys, Inc.'s Definitive Proxy Statement on Schedule 14A filed August 15, 2016 (File No. 000-05734).\n*10.5\nForm of Stock Appreciation Right Agreement under the Agilysys, Inc. 2016 Stock Incentive Plan, which is incorporated herein by reference to Exhibit 10.3 to Agilysys, Inc.'s Quarterly Report on Form 10-Q for the quarter ended September 30, 2018 (File No. 000-05734).\n*10.6\nForm of Directors Restricted Stock Award Agreement under the Agilysys, Inc. 2016 Stock Incentive Plan, which is incorporated herein by reference to Exhibit 10.1 to Agilysys, Inc.'s Quarterly Report on Form 10-Q for the quarter ended September 30, 2018 (File No. 000-05734).\n*10.7\nForm of Restricted Stock Award Agreement under the Agilysys, Inc. 2016 Stock Incentive Plan, which is incorporated herein by reference to Exhibit 10.2 to Agilysys, Inc.'s Quarterly Report on Form 10-Q for the quarter ended September 30, 2018 (File No. 000-05734).\n*10.8\nForm of Executive Employment Agreement, which is incorporated herein by reference to Exhibit 10.1 to Agilysys, Inc.'s Current Report on Form 8-K filed January 31, 2018 (File No. 000-05734).\n*10.9\nEmployment Agreement dated February 10, 2020 by and between Agilysys, Inc. and Ramesh Srinivasan, which is incorporated by reference to Exhibit 10.1 to Agilysys, Inc.’s Current Report on Form 8-K filed February 13, 2020 (File No. 000-05734).\n*10.10\nSSAR Agreement dated January 3, 2017, by and between Agilysys, Inc. and Ramesh Srinivasan, which is incorporated herein by reference to Exhibit 10(s) to Agilysys, Inc.'s. Annual Report on Form 10-K for the year ended March 31, 2017 (File No. 000-05734).\n*10.11\nSSAR Agreement dated February 10, 2020, by and between Agilysys, Inc. and Ramesh Srinivasan, which is incorporated by reference to Exhibit 10.11 to Agilysys, Inc.'s Amendment to Annual Report on Form 10-K/A filed July 29, 2020 (File No. 000-05734).\n*10.12\nAgilysys, Inc. 2020 Equity Incentive Plan, which is incorporated by reference to Exhibit 10.1 to Agilysys, Inc.'s Quarterly Report on Form 10-Q for the quarter ended December 31, 2020 (File No. 000-05734).\n*10.13\nAgilysys, Inc. Employee Stock Purchase Plan, which is incorporated by reference to Exhibit 10.2 to Agilysys, Inc.'s Quarterly Report on Form 10-Q for the quarter ended December 31, 2020 (File No. 000-05734).\n*10.14\nForm of SARs Award Agreement (Time Vesting), which is incorporated by reference to Exhibit 10.3 to Agilysys, Inc.'s Quarterly Report on Form 10-Q for the quarter ended December 31, 2020 (File No. 000-05734).\n*10.15\nForm SARs Award Agreement (Performance Vesting), which is incorporated by reference to Exhibit 10.4 to Agilysys, Inc.'s Quarterly Report on Form 10-Q for the quarter ended December 31, 2020 (File No. 000-05734).\n*10.16\nForm of Restricted Stock Award Agreement, which is incorporated by reference to Exhibit 10.5 to Agilysys, Inc.'s Quarterly Report on Form 10-Q for the quarter ended December 31, 2020 (File No. 000-05734).\n*10.17\nForm of Restricted Stock Award Agreement for Non-Employee Directors, which is incorporated by reference to Exhibit 10.6 to Agilysys, Inc.'s Quarterly Report on Form 10-Q for the quarter ended December 31, 2020 (File No. 000-05734).\n*10.18\nInvestment Agreement, dated May 11, 2020, by and between Agilysys, Inc. and MAK Capital One L.L.C., which is incorporated by reference to Exhibit 10.1 to Agilysys, Inc.'s Current Report on Form 8-K filed May 13, 2020 (File No. 000-05734).\n*10.19\nRegistration Rights Agreement, dated May 22, 2020, by and among Agilysys, Inc., MAK Capital Fund L.P. and MAK Capital Distressed Debt Fund I, LP, which is incorporated by reference to Exhibit 10.1 to Agilysys, Inc.'s Current Report on Form 8-K filed May 26, 2020 (File No. 000-05734).\n*10.20\nPost-Employment Restrictive Covenants Agreement dated July 2, 2020, by and between Agilysys, Inc. and Tony Pritchett, which is incorporated by reference to Exhibit 10.1 to Agilysys, Inc.'s Current Report on Form 8-K filed July 8, 2020 (File No. 000-05734).\n**21\nSubsidiaries of the Registrant.\n**23.1\nConsent of Independent Registered Public Accounting Firm.\n**24.1\nPower of Attorney.\n**31.1\nCertification of Chief Executive Officer Pursuant to Section 302 of Sarbanes-Oxley Act of 2002.\n**31.2\nCertification of Chief Financial Officer Pursuant to Section 302 of Sarbanes-Oxley Act of 2002.\n**31.3\nCertification of Corporate Controller and Treasurer Pursuant to Section 302 of Sarbanes-Oxley Act of 2002.\n**32\nCertification of Chief Executive Officer, Chief Financial Officer and Corporate Controller and Treasurer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of Sarbanes-Oxley Act of 2002.\n101.INS\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because XBRL tags are embedded within the Inline XBRL document.\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n*\nDenotes a management contract or compensatory plan or arrangement.\n**\nFiled herewith\nSignatures\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, in the City of Alpharetta, State of Georgia, on May 21, 2021.\nAGILYSYS, INC.\n/s/ Ramesh Srinivasan\nRamesh Srinivasan\nPresident, Chief Executive Officer and Director\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities indicated on May 21, 2021.\nSignature\nTitle\n/s/ Ramesh Srinivasan\nPresident, Chief Executive Officer and Director\nRamesh Srinivasan\n(Principal Executive Officer)\n/s/ William David Wood III\nChief Financial Officer,\nWilliam David Wood III\n(Principal Financial Officer)\n/s/ Chris J. Robertson\nCorporate Controller and Treasurer\nChris J. Robertson\n(Principal Accounting Officer)\n/s/ Michael A. Kaufman\nChairman and Director\nMichael A. Kaufman\n/s/ Donald A. Colvin\nDirector\nDonald A. Colvin\n/s/ Gerald C. Jones\nDirector\nGerald C. Jones\n/s/ John Mutch\nDirector\nJohn Mutch\n/s/ Melvin L. Keating\nDirector\nMelvin L. Keating\n/s/ Dana Jones\nDirector\nDana Jones"
}