{
    "cik": "807882",
    "company": "JACK IN THE BOX INC /NEW/",
    "filing_type": "10-K",
    "filing_date": "2021-11-23",
    "period_of_report": "2021-10-03",
    "sic": "5812",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "1003",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/807882/0000807882-21-000016-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/807882/000080788221000016/jack-20211003.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/807882/0000807882-21-000016.txt",
    "filename": "807882_10K_2021_0000807882-21-000016.htm",
    "item_1": "ITEM 1. BUSINESS\nGeneral\nJack in the Box Inc., based in San Diego, California, operates and franchises Jack in the Box® quick-service restaurants (“QSRs”). We opened our first restaurant in 1951 and have since become one of the nation’s largest hamburger chains. Based on number of restaurants, our top 10 major markets comprise approximately 70% of the total system, and Jack in the Box is at least the second largest QSR hamburger chain in seven of those major markets.\nAs of October 3, 2021, we operated and franchised 2,218 Jack in the Box quick-service restaurants, primarily in the western and southern United States, including one in Guam. Of the 2,218 restaurants at fiscal year-end, 2,055, or 93%, were franchised.\nThe Company operates as a single segment for reporting purposes. Our revenue is derived from sales by company-operated restaurants and by charging royalties, rent, advertising fees, and franchise and other fees to our franchisees.\nStrategy\nIn June 2021, we held a virtual Investor Day and provided an overview of our growth strategy, including detail on plans for unit growth, transparency on unit economics, debut of our new store prototype, and focus on future investments in digital.\nOur strategies are rooted in two foundational principles:\n•Shape a High-Performance Culture - When we serve our people and our franchisees well, we will maximize the guest experience for all who interact with the brand.\n•Leverage Innovation and Technology Platforms - Taking our history of strong innovation on menu and operations, and placing that same forward thinking on digital and technology development.\nWe use these principles as a guide while executing on our four strategic pillars:\n•Build Brand Loyalty by transforming our restaurant design, improving the image of existing restaurants, and enhancing the digital experience for our guests.\n•Drive Operations Excellence by evolving training efforts in our restaurants, execution of our brand standard systems, and improving speed and consistency.\n•Grow Restaurant Profits by developing and implementing financial fundamentals, influencing pricing with a dynamic model, and building our data advantage.\n•Expand Jack’s Reach by creating modular and flexible restaurant designs, building company-operated stores to help seed growth, fostering growth capital, and increasing franchise candidate and restaurant site lead generations.\nThis strategy builds on our historical strengths as a differentiated, challenger brand. Those strengths include our uniquely broad menu, operational capabilities, passionate and loyal guests, committed team members and franchisees, and ability to invest in development and innovation that will deliver long term growth.\nOur Brand\nJack in the Box restaurants offer a broad selection of distinctive products including classic burgers like our Jumbo Jack® and innovative product lines such as Buttery Jack® burgers. We also offer quality products such as breakfast sandwiches with freshly cracked eggs, as well as craveable favorites such as tacos, curly fries, egg rolls, specialty sandwiches and real ice cream shakes, among many other items. We allow our guests to customize meals to their tastes and order any product on the menu when they want it, including breakfast at night, or burgers and chicken in the morning. Our trademark of variety and innovation has led to the development of five true dayparts: breakfast, lunch, snack, dinner, and late night.\nDuring our 70 years as a brand, we were the first restaurant and burger chain to develop and expand the concept of drive-thru restaurants. In addition to drive-thru windows, most of our restaurants have seating capacities ranging from 20 to 100 people and are open 18-24 hours a day.\nFranchising Program\nThe franchise agreement generally provides for an initial franchise fee of $50,000 per restaurant for a 20-year term, and royalty and marketing payments generally set at 5.0% of gross sales. Royalty rates are typically 5.0% of gross sales but may range as high as 10.0% of gross sales. Some existing agreements provide for lower royalties for a limited time and may have variable rates. We may offer development agreements to franchisees (referred to in this context as “Developers”) for construction of one or more new restaurants over a defined period of time and in a defined geographic area. Developers may be required to pay fees for certain company-sourced new sites. Developers may lose their rights to future development if they do not maintain the required opening schedule. To stimulate growth, we have offered a waiver of development fees for new sites, in addition to lower royalty rates or a development loan, to franchisees who open restaurants within a specified timeframe.\nIn addition, franchisees who lease an existing restaurant location from us, which primarily relate to when we have refranchised a restaurant, will pay monthly minimum rent, as well as percentage rent based on each month’s gross sales, if applicable. The typical percentage rent is 9.5% of gross sales.\nSite Selection, Design, and Construction\nSite selection for all new restaurants is made after an economic analysis and a review of demographic data and other information relating to population density, traffic, competition, restaurant visibility and access, available parking, surrounding businesses, and opportunities for market penetration. New restaurants developed by franchisees are constructed to brand standards and specifications using brand approved plans on properties that we have approved.\nJack in the Box offers multiple new restaurant prototype designs that feature different configurations and dining room sizes to provide maximum flexibility when considering properties for development. This flexibility enables the Company and franchisees to optimize the layout and configuration of a new restaurant with the property’s specific economic, demographic, geographic, or physical characteristics.\nBased on a potential property’s geographical location, physical characteristics, local requirements, and size, as well as the prototype building selected for use, typical costs to develop a traditional restaurant, range from approximately $1.4 million to $2.0 million, excluding the land value. The majority of new Company restaurants are constructed on leased land or on land that is purchased and subsequently sold, along with the improvements, in sale and leaseback transactions. Upon completion of a sale and leaseback transaction, the Company’s initial cash investment is reduced to the cost of equipment, which typically ranges from approximately $0.3 million to $0.5 million.\nRestaurant Management and Operations\nJack in the Box restaurants are operated by a company manager or franchise operator who is directly responsible for the operations of the restaurant, including product quality, service, food safety, cleanliness, inventory, cash control, and the conduct and appearance of employees. We focus on attracting, selecting, engaging, and retaining employees and franchisees who share our passion for creating long-lasting, successful restaurants.\nManagers of company-operated restaurant are supervised by district managers, who are overseen by directors of operations, who report to the vice president of company operations. Under our performance system, the vice president is eligible for annual incentive compensation based on achievement of goals related to company-wide performance and restaurant level margin. Directors are eligible for an annual incentive compensation based on achievement of goals related to the sales and profit of their assigned region, and a company-wide performance goal. District managers and restaurant managers are eligible for quarterly incentives based on growth in restaurant sales and profit and certain other operational performance standards.\nCompany-operated restaurant managers are required to complete an extensive management training program involving a combination of in-restaurant instruction and on-the-job training in specially designated training restaurants. Restaurant managers and supervisory personnel train other restaurant employees in accordance with detailed procedures and guidelines using training aids available at each location.\nCustomer Satisfaction\nCompany-operated and franchise-operated restaurants devote significant resources toward offering quality food and excellent service at all of our restaurants. One tool we have used to help us maintain a high level of customer satisfaction is our Voice of Guest program, which provides restaurant managers, district managers, and franchise operators with ongoing feedback from guests who complete a short satisfaction survey via an invitation typically provided on the register receipt. In these surveys, guests rate their satisfaction with key elements of their restaurant experience, including friendliness, food quality, cleanliness, speed of service, and order accuracy. Our Guest Relations Department receives feedback that guests provide via phone and our website and communicates that feedback to restaurant managers and franchise operators. We also collect and respond to guest feedback through social media, restaurant reviews and other feedback sources.\nFood Safety\nOur “farm-to-fork” food safety program is designed to maintain high standards for the food products and food preparation procedures used by our vendors and in our restaurants. We maintain product specifications for our ingredients and our Food Safety and Regulatory Compliance Department must approve all suppliers of food products to our restaurants. We use third-party and internal audits to review the food safety management programs of our vendors. We manage food safety in our restaurants through a comprehensive food safety management program that is based on the Food and Drug Administration (“FDA”) Food Code requirements. The food safety management program includes employee training, ingredient testing, documented restaurant practices, and attention to product safety at each stage of the food preparation cycle. In addition, our food safety management program uses American National Standards Institute certified food safety training programs to train our company and franchise restaurant management employees on food safety practices for our restaurants.\nSupply Chain\nAll of our company-operated and franchisee restaurants have a long-term contract with a third-party distributor. Under this contract, the distributor will provide distribution services to our Jack in the Box restaurants through August 2022 through seven distribution centers in the continental United States.\nThe primary commodities purchased by our restaurants are beef, poultry, pork, cheese, and produce. We monitor and purchase commodities in order to minimize the impact of fluctuations in price and supply. Contracts are entered into and commodity market positions may be secured when we consider them to be advantageous. However, certain commodities remain subject to price fluctuations. Most, if not all essential food and beverage products are available or can be made available upon short notice from alternative qualified suppliers.\nInformation Systems\nOur restaurant software allows for daily polling of sales, inventory, and other data from the restaurants directly. Our company restaurants and traditional-site franchise restaurants use standardized Windows-based touch screen point-of-sale (“POS”) platforms. These platforms allow the restaurants to accept cash, credit cards, and our re-loadable gift cards. The single POS system for all restaurants helps franchisees and brand managers adapt more quickly to meet consumer demands and introduce new products, pricing, promotions, and technologies such as the Jack in the Box mobile app, third party delivery, or any other business-driving initiative while maintaining a secure, PCI-compliant payment system.\nWe have business intelligence systems that provide us with visibility to the key metrics in the operation of company and franchise restaurants. These systems play an integral role in enabling us to accumulate and analyze market information. Our company restaurants use labor scheduling systems to assist managers in managing labor hours based on forecasted sales volumes. We also have inventory management systems that enable timely and accurate deliveries of food and packaging to our restaurants. To support order accuracy and speed of service, our drive-thru restaurants use order confirmation screens.\nAdvertising and Promotion\nWe build brand awareness and drive sales through our marketing and advertising programs. These activities are supported primarily by financial contributions to a marketing fund from all company and franchise restaurants based on a percentage of gross sales. Activities to build brand equity, advertise products, and attract customers include, but are not limited to, system-wide and regional campaigns on television, digital and social media, radio, and print media, as well as reaching consumers through our branded mobile app and delivery partnerships.\nCompetition and Markets\nThe restaurant business is highly competitive and is affected by local and national economic conditions, including unemployment levels, population and socioeconomic trends, traffic patterns, local and national competitive changes, changes in consumer dining habits and preferences, and new information regarding diet, nutrition, and health, all of which may affect consumer spending habits. Key elements of competition in the industry are the quality and innovation in the food products offered, price and perceived value, quality of service experience (including technological and other innovations), speed of service, personnel, advertising and other marketing efforts, name identification, restaurant location, and image and attractiveness of the facilities.\nEach restaurant competes directly and indirectly with a large number of national and regional restaurant chains, some of which have significantly greater financial resources, as well as with locally-owned or independent restaurants in the quick-service and the fast-casual segments, and with other consumer options including grocery and specialty stores, catering, and delivery services. In selling franchises, we compete with many other restaurant franchisors and franchisors generally, some of whom have substantially greater financial resources than we do.\nHuman Capital Management\nJack in the Box recognizes and takes care of its employees by offering a wide range of competitive pay, recognition, and benefit programs. We are proud to provide our employees, many who begin their career at Jack in the Box with their first entry-level job, the opportunity to grow and advance as we invest in their education and career development.\nAs of October 3, 2021, we had approximately 5,300 employees, of whom 4,900 were restaurant employees, 350 were corporate management and staff, and 40 were field operations management. Most of our employees are paid on an hourly basis, except manager, field operations management, and certain corporate positions. We employ both full-time and part-time restaurant employees in order to provide the flexibility necessary during peak periods of restaurant operations and meet the individual needs of our employees. As of the end of fiscal 2021, approximately 55% of our restaurant employees were part-time. We have not experienced any significant work stoppages.\nOur Total Rewards framework includes pay and recognition, health and wellness, financial well-being, work/life happiness, culture and community, and learning and development. We are committed to providing employees with market-competitive pay and benefits and flexibility with respect to benefit choices. For our company-operated restaurant positions nationwide, positions are assigned to a pay range that best reflects market pricing of similar jobs in the restaurant industry and in the geographic location, and employees receive an automatic pay increase each time they work a certain number of hours provided performance is satisfactory. All corporate positions, field operations management, and restaurant management positions, including hourly assistant managers and team leaders, are eligible for performance-based cash incentives. Each incentive plan reinforces and rewards individuals for achievement of specific company and/or restaurant business goals.\nWe strive to ensure pay equity between our female employees and male employees performing equal or substantially similar work. Each year, we review the median pay of our male and female employees, share the results with the Board of Directors, and take remedial action as appropriate to ensure that male and female employees are paid equally.\nWe are committed to providing market-competitive, high-quality, and affordable benefits to meet the changing needs of our employees. We offer a robust benefits package that includes medical, dental, and vision insurance with health savings account (HSA) employer contributions and an HMO plan; company-paid basic term life insurance; wellness programs; an employee assistance program (EAP); disability insurance; a flexible spending account (FSA); legal services; pet insurance; and a 401(k) with company matching contributions. In addition, we recognize and support the growth and development of our employees and offer opportunities to participate in internal and external learning programs. We also hold regular restaurant level talent and development planning reviews to assist us with growing our internal restaurant teams.\nWe recognize our responsibility to take the steps necessary to create and maintain a safe and healthy work environment. All of our corporate and restaurant employees may report safety and security issues either through our risk management department or anonymously through our asset protection helpline. Reports are reviewed by our asset protection manager and are addressed appropriately by corporate partners and OSHA, if necessary. All of our corporate and restaurant employees may also report any ethics issues to our ethics hotline. We take every incident and report seriously and have detailed protocols regarding investigation, assessment and correction, safety communications, employee training, and record keeping.\nTrademarks and Service Marks\nThe JACK IN THE BOX® name and logos are of material importance to us and are registered trademarks and service marks in the United States and elsewhere. In addition, we have registered or applied to register numerous service marks and trade names for use in our businesses, including the Jack in the Box design marks and various product names and designs. Our policy is to pursue registration of our important service marks and trademarks and to vigorously oppose any infringement of them. Generally, with the appropriate renewal and use, the registration of our service marks and trademarks will continue indefinitely.\nSeasonality\nRestaurant sales and profitability are subject to seasonal fluctuations because of factors such as vacation and holiday travel, seasonal weather conditions, and weather crises, all of which affect the public’s dining habits.\nGovernment Regulation\nEach restaurant is subject to regulation by federal agencies, as well as licensing and regulation by state and local health, sanitation, safety, fire, zoning, building, consumer protection, taxing, and other agencies and departments. Restaurants are also subject to rules and regulations imposed by owners and operators of shopping centers, airports, or other locations where a restaurant is located. Difficulties or failures in obtaining and maintaining any required permits, licenses or approvals, or difficulties in complying with applicable rules and regulations, could result in restricted operations, closures of existing restaurants, delays or cancellations in the opening of new restaurants, increased cost of operations, or the imposition of fines and other penalties.\nWe are subject to federal, state, and local laws governing restaurant menu labeling, as well as laws restricting the use of, or requiring disclosures about, certain ingredients used in food sold at our restaurants. We are also subject to federal, state, and local laws governing packaging and service ware.\nWe are also subject to federal and state laws regulating the offer and sale of franchises, as well as judicial and administrative interpretations of such laws. Such laws impose registration and disclosure requirements on franchisors in the offer and sale of franchises and may also apply substantive standards to the relationship between franchisor and franchisee, including limitations on the ability of franchisors to terminate franchises and alter franchise arrangements.\nWe are subject to the federal Fair Labor Standards Act and various state laws governing such matters as minimum wages, exempt status classification, overtime, breaks and other working conditions for company employees. Our franchisees are subject to these same laws. Many of our food service personnel are paid at rates set in relation to the federal and state minimum wage laws and, accordingly, changes in the minimum wage requirements may increase labor costs for us and our franchisees. Federal and state laws may also require us to provide paid and unpaid leave, or healthcare or other employee benefits to our employees, which could result in significant additional expense to us and our franchisees. We are also subject to federal immigration laws requiring compliance with work authorization documentation and verification procedures.\nWe are subject to certain guidelines under the Americans with Disabilities Act of 1990 and various state codes and regulations, which require restaurants and our brand to provide full and equal access to persons with physical disabilities.\nOur collection or use of personal information about our employees or our guests is regulated at the federal and state levels, including the California Consumer Privacy Act.\nOur marketing, advertising, and promotional programs are governed by various federal, state, and local laws and regulations concerning consumer protection, including the Telephone Consumer Protection Act.\nWe are also subject to various federal, state, and local laws regulating the discharge of materials into the environment. The cost of complying with these laws increases the cost of operating existing restaurants and developing new restaurants. Additional costs relate primarily to the necessity of obtaining more land, landscaping, storm drainage control, and the cost of more expensive equipment necessary to decrease the amount of effluent emitted into the air, ground, and surface waters.\nIn addition to laws and regulations governing restaurant businesses directly, there are also regulations, such as the Food Safety Modernization Act, that govern the practices of food manufacturers and distributors, including our suppliers.\nWe have processes in place to monitor compliance with all applicable laws and regulations governing our company operations.\nAvailable Information\nThe Company’s corporate website can be found at www.jackintheboxinc.com. We make available free of charge at this website (under the caption “Investors - SEC Filings”) all of our reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, including our Annual Report on Form 10-K, our Quarterly Reports on Form 10-Q, our Current Reports on Form 8-K, and amendments to those reports. These reports are made available on the website as soon as reasonably practicable after their filing with, or furnishing to, the Securities and Exchange Commission (“SEC”). The SEC also maintains a website with the address of www.sec.gov that contains our reports, proxy and information statements, and other information.",
    "item_1A": "ITEM 1A. RISK FACTORS\nWe caution you that our business and operations are subject to a number of risks and uncertainties. The factors listed below are important factors that could cause our actual results to differ materially from our historical results and from projections in the forward-looking statements contained in this report, in our other filings with the SEC, in our news releases, and in oral statements by our representatives. However, other factors that we do not anticipate or that we do not consider material based on currently available information may also have an adverse effect on our results.\nRisks Related to the COVID-19 Pandemic\nThe COVID-19 pandemic has disrupted and may continue to disrupt our business, which has affected and could continue to materially affect our operations, financial condition, and results of operations for an extended period of time.\nThe COVID-19 pandemic outbreak, federal, state and local government responses to COVID-19 and our responses to the outbreak have all disrupted and may continue to disrupt our business.\nOur operating results substantially depend upon our sales volumes, restaurant profitability, and financial stability, and to the extent we and/or our franchisees experience financial distress due to the COVID-19 pandemic, our operating results may be adversely impacted, potentially materially affecting our liquidity, financial condition, or results of operations.\nOur business could be further disrupted if any of our company or franchised restaurant employees are diagnosed with COVID-19 since this could require us or our franchisees to quarantine some or all of a restaurant’s employees, disinfect the restaurant’s facilities, and/or reduce restaurant operating hours. If a significant percentage of our or our franchisees’ workforce is unable to work, whether because of illness, quarantine, limitations on travel or other government regulations or restrictions in connection with COVID-19, our results may be adversely impacted, potentially materially affecting our liquidity, financial condition, or results of operations. The impending federal vaccine mandate may also materially impact our results if we or our franchised restaurants were to lose employees and/or incur additional costs for testing as a result of the mandate.\nOur business has been disrupted and could be further disrupted to the extent our suppliers, distributors, and/or third-party delivery partners are adversely impacted by the COVID-19 pandemic. If our suppliers, distributors, and/or third-party delivery partners experience labor shortages or their employees are unable to work, whether because of illness, quarantine, limitations on travel or other government restrictions in connection with COVID-19, we could face cost increases, shortages of food items, shortages of delivery services, and/or shortages of other supplies across our restaurants, and our results could be adversely impacted by such interruptions.\nThe COVID-19 outbreak also may have the effect of heightening many other risks disclosed herein, including, but not limited to, those related to consumer confidence, increase in food and commodity costs, supply chain interruptions, labor availability and cost, cybersecurity incidents, increased indebtedness, regulatory and legal complexity, governmental regulations, and our stock price.\nRisks Related to Operating in the Restaurant Industry\nWe face significant competition in the food service industry and our inability to compete may adversely affect our business.\nThe food service industry is highly competitive with respect to price, service, location, product offering, image and attractiveness of the facilities, personnel, advertising, brand identification, and food quality. Our competition includes a large number of national and regional restaurant chains, as well as locally owned and independent businesses. In particular, we operate in the quick service restaurant chain segment, in which we face a number of established competitors, as well as frequent new entrants to the segment nationally and in regional markets. Some of our competitors have significantly greater financial, marketing, technological, personnel, and other resources than we do. In addition, many of our competitors have greater name recognition nationally or in some of the local or regional markets in which we have restaurants.\nAdditionally, the trend toward convergence in grocery, deli, delivery, and restaurant services is increasing the number of our competitors. For example, competitive pressures can come from deli sections and in-store cafes of major grocery store chains, including those targeted at customers who desire high-quality food and convenience, as well as from convenience stores and other dining outlets. These competitors may have, among other things, a more diverse menu, lower operating costs and prices, better locations, better facilities, more effective marketing, and more efficient operations than we do. Such increased competition could decrease the demand for our products and negatively affect our sales, operating results, profits, business and financial position, and prospects (collectively, our “financial results”).\nWhile we continue to make improvements to our facilities, to implement new service, technology, and training initiatives, and to introduce new products, there can be no assurance that such efforts will generate increased sales or sufficient customer interest. Many of our competitors are remodeling their facilities, implementing service improvements, introducing a variety of new products and service offerings, and advertising that their ingredients are healthier or locally sourced. Such competing products and health- or environmental-focused claims may hurt our competitive positioning as existing or potential customers could seek out other dining options.\nChanges in demographic trends and in customer tastes and preferences could cause sales and the royalties that we receive from franchisees to decline.\nChanges in customer preferences, demographic trends, and the number, type, and location of competing restaurants have great impact in the restaurant industry. Our sales and the revenue that we receive from franchisees could be impacted by changes in customer preferences related to dietary concerns, such as preferences regarding calories, sodium content, carbohydrates, fat, additives, and sourcing, or in response to environmental and animal welfare concerns. Such preference changes could result in customers favoring other foods to the exclusion of our menu items. If we fail to adapt to changes in customer preferences and trends, we may lose customers and our sales and the rents, royalties, and marketing fees we receive from franchisees may deteriorate.\nChanges in consumer confidence and declines in general economic conditions could negatively impact our financial results.\nThe restaurant industry depends on consumer discretionary spending. We are impacted by consumer confidence, which is, in turn, influenced by general economic conditions and discretionary income levels. A material decline in consumer confidence or a decline in family “food away from home” spending could cause our financial results to decline. If economic conditions worsen, customer traffic could be adversely impacted if our customers choose to dine out less frequently or reduce the amount they spend on meals while dining out, which could cause our company and our franchised average restaurant sales to decline. An economic downturn may be caused by a variety of factors, such as macro-economic changes, increased unemployment rates, increased taxes, interest rates, or other changes in government fiscal policy. High gasoline prices, increased healthcare costs, declining home prices, and political unrest, foreign or domestic, may potentially contribute to an economic downturn, as may regional or local events, including natural disasters or local regulation. The impact of these factors may be exacerbated by the geographic profile of our brand. Specifically, nearly 70% of our restaurants are located in the states of California and Texas. Economic conditions, state and local laws, or government regulations affecting those states may therefore more greatly impact our results than would similar occurrences in other locations.\nIncreases in food and commodity costs could decrease our profit margins or result in a modified menu, which could adversely affect our financial results.\nWe and our franchisees are subject to volatility in food and commodity costs and availability. Accordingly, our profitability depends in part on our ability to anticipate and react to changes in food costs and availability. As is true of all companies in the restaurant industry, we are susceptible to increases in food costs that are outside of our control. Factors that can impact food and commodity costs include general economic conditions, inflation, labor shortages, seasonal fluctuations, weather and climate conditions, energy costs, global demand, trade protections and subsidies, food safety issues, infectious diseases, possible terrorist activity, cyberattacks, transportation issues, currency fluctuations, product recalls, and government regulatory schemes. Additionally, some of our produce, meats, and restaurant supplies are sourced from outside the United States. Any new or increased import duties, tariffs, or taxes, or other changes in U.S. trade or tax policy, could result in higher food and commodity costs that would adversely impact our financial results.\nWeather and climate related issues, such as freezes or drought, may lead to temporary or even longer-term spikes in the prices of some ingredients such as produce and meats, or of livestock feed. Increasing weather volatility or other long-term changes in global weather patterns, including any changes associated with global climate change, could have a significant impact on the price or availability of some of our ingredients. Any increase in the prices of the ingredients most critical to our menu, such as beef, chicken, pork, tomatoes, lettuce, dairy products, and potatoes could adversely affect our financial results. In the event of cost increases with respect to one or more of our raw ingredients, we may choose to change our pricing or suspend serving a menu item rather than paying the increased cost for the particular ingredient.\nWe seek to manage food and commodity costs, including through extended fixed price contracts, strong category and commodity management, and purchasing fundamentals. However, certain commodities such as beef and pork, which currently represent approximately 16% and 6% respectively, of our commodity spend, do not lend themselves to fixed price contracts. We cannot assure you that we will successfully enter into fixed price contracts on a timely basis or on commercially favorable pricing terms. In addition, although our produce contracts contain predetermined price limits, we are subject to force majeure clauses resulting from weather or acts of God that may result in temporary spikes in costs.\nFurther, we cannot assure you that we or our franchisees will be able to successfully anticipate and react effectively to changing food and commodity costs by adjusting purchasing practices or menu offerings. We and our franchisees also may not be able to pass along price increases to our customers as a result of adverse economic conditions, competitive pricing, or other factors. Therefore, variability of food and other commodity costs could adversely affect our profitability and results of operations.\nFailure to receive scheduled deliveries of high-quality food ingredients and other supplies could harm our operations and reputation.\nDependence on frequent deliveries of fresh produce and other food products subjects food service businesses such as ours to the risk that shortages or interruptions in supply could adversely affect the availability, quality or cost of ingredients or require us to incur additional costs to obtain adequate supplies. Deliveries of supplies may be affected by adverse weather conditions, natural disasters, labor shortages, or financial or solvency issues of our distributors or suppliers, product recalls, production disruptions such as mechanical failures, or other issues. Further, increases in fuel prices could result in increased distribution costs. In addition, if any of our distributors, suppliers, vendors, or other contractors fail to meet our quality or safety standards or otherwise do not perform adequately, or if any one or more of them seeks to terminate its agreement or fails to perform as anticipated, or if there is any disruption in any of our distribution or supply relationships or operations for any reason, our business reputation, financial condition, and results of operations may be materially affected.\nWe have a limited number of suppliers for our major products and rely on a distribution network with a limited number of distribution partners for the majority of our national distribution program. If our suppliers or distributors are unable to fulfill their obligations under their contracts, it could harm our operations.\nWe contract with a distribution network with a limited number of distribution partners located throughout the nation to provide the majority of our food distribution services. Through these arrangements, our food supplies are largely distributed through several primary distributors. If any of these relationships are interrupted or terminated, or if one or more supply or distribution partners are unable or unwilling to fulfill their obligations for whatever reasons, product availability to our restaurants may be interrupted, and business and financial results may be negatively impacted. Although we believe that alternative supply and distribution sources are available, there can be no assurance that we will be able to identify or negotiate with such sources on terms that are commercially reasonable to us.\nFood safety and food-borne illness concerns may have an adverse effect on our business by reducing demand and increasing costs.\nFood safety is a top priority for our company, and we expend significant resources on food safety programs to ensure that our customers are able to enjoy safe and high-quality food products. These include a daily, structured food safety assessment and documentation process at our restaurants, and periodic third-party and internal audits to review the food safety performance of our vendors, distributors, and restaurants. Nonetheless, food safety risks cannot be completely eliminated, and food safety and food-borne illness issues do occur in the food service industry. Any report or publicity linking us to instances of food-borne illness or other food safety issues, including issues involving food tampering, natural or foreign objects, or other contaminants or adulterants in our food, could adversely affect our reputation, as well as our financial results. Furthermore, our reliance on food suppliers and distributors increases the risk that food-borne illness incidents could be introduced by third-party vendors outside our direct control. Although we test and audit these activities, we cannot guarantee that all food items are safely and properly maintained during transport or distribution throughout the supply chain.\nAdditionally, past reports linking nationwide or regional incidents of food-borne illnesses such as salmonella, E. coli, and listeria to certain products such as produce and proteins, or human-influenced illness such as hepatitis A or norovirus, have resulted in consumers avoiding certain products and restaurant concepts for a period of time. Similarly, reaction to media-influenced reports of avian flu, incidents of “mad cow” disease, or similar concerns have also caused some consumers to avoid products that are, or are suspected of being, affected and could have an adverse effect on the price and availability of affected ingredients. Further, if we react to these problems by changing our menu or other key aspects of the brand experience, we may lose customers who do not accept those changes, and we may not be able to attract enough new customers to generate sufficient revenue to make our restaurants profitable.\nOur restaurants currently have an ingredient mix that can be exposed to one or more food allergens, such as eggs, wheat, milk, fish, shellfish, tree nuts, peanuts, and soy. We employ precautionary allergen training steps for food handlers in order to minimize risk of allergen cross contamination and we post allergen information on nutritional posters in our restaurants or otherwise make such information available to guests upon request. Even with such precautionary measures, the potential risk of allergen cross contamination exists in a restaurant environment. A potentially serious allergic reaction by a guest may result in adverse public communication, media coverage, a decline in restaurant sales, and a material decline in our financial results.\nNegative publicity relating to our business or industry could adversely impact our reputation.\nOur business can be materially and adversely affected by widespread negative publicity of any type, particularly regarding food quality, food safety, nutritional content, safety or public health issues (such as outbreaks, pandemics, epidemics, or the prospect of any of these), obesity or other health concerns, animal welfare issues, and employee relations issues, among other things. Adverse publicity in these areas could damage the trust customers place in our brand. The increasingly widespread use of mobile devices and social media platforms has amplified the speed and scope of adverse publicity and could hamper our ability to promptly correct misrepresentations or otherwise respond effectively to negative publicity, whether or not accurate. Any widespread negative publicity regarding the Company, our brand, our vendors and suppliers, and our franchisees, or negative publicity about the restaurant industry in general, whether or not accurate, could cause a decline in restaurant sales, and could have a material adverse effect on our financial results.\nAdditionally, employee or customer claims against us or our franchisees based on, among other things, wage and hour violations, discrimination, harassment, or wrongful termination may also create negative publicity that could adversely affect us and divert financial and management resources that would otherwise be focused on the future performance of our operations. Consumer demand for our products could decrease significantly if any such incidents or other matters create negative publicity or otherwise erode consumer confidence in us, our brand or our products, or in the restaurant industry in general.\nWe are also subject to the risk of negative publicity associated with animal welfare regulations and campaigns. Our restaurants utilize ingredients manufactured from beef, poultry, and pork. Our policies require that our approved food suppliers and their raw material providers engage in proper animal welfare practices. Despite our policies and efforts, media reports and portrayals of inhumane acts toward animals by participants in the food supply chain, whether by our suppliers or not, can create a negative opinion or perception of the food industry’s animal welfare efforts. Such media reports and negative publicity could impact guest perception of our brand or industry and can have a material adverse effect on our financial results.\nOur business could be adversely affected by increased labor costs.\nLabor is a primary component of our operating costs. Increased labor costs due to factors such as competition for workers, labor shortages, labor market pressures, increased minimum wage requirements, paid sick leave or vacation accrual mandates, or other legal or regulatory changes, such as predictive scheduling, may adversely impact operating costs for us and our franchisees. Additional taxes or requirements to incur additional employee benefit costs, including the requirements of the Patient Protection and Affordable Care Act (the “Affordable Care Act”) or any new or replacement healthcare requirements, could also adversely impact our operating costs.\nThe enactment of additional state or local minimum wage increases above federal wage rates or regulations related to non-exempt employees has increased and could continue to increase labor costs for employees across our system-wide operations, especially considering our concentration of restaurants in California.\nInability to attract, train and retain top-performing personnel could adversely impact our financial results or business.\nWe believe that our continued success will depend, in part, on our ability to attract and retain the services of skilled personnel. The loss of the services of, or our inability to attract and retain, such personnel could have a material adverse effect on our business, including reduced restaurant operating hours. We believe good managers and crew are a key part of our success, and we devote significant resources to recruiting and training our restaurant managers and crew. We aim to reduce turnover among our restaurant crews and managers in an effort to retain top performing employees and better realize our investment in training new employees. Any failure to do so may adversely impact our operating results by increasing training costs and making it more difficult to deliver outstanding customer service, which could have a material adverse effect on our financial results.\nWe may not have the same resources as our competitors for marketing, advertising, and promotion.\nSome of our competitors have greater financial resources, which enable them to: invest significantly more than us in advertising, particularly television and radio ads, as well as endorsements and sponsorships; have a presence across more media channels; and support multiple system and regional product launches at one time. Should our competitors increase spending on marketing, advertising, and promotion, or should the cost of advertising increase or our advertising funds decrease for any reason (including reduced sales, implementation of reduced spending strategies, or a decrease in the percentage contribution to the marketing fund for any reason), our results of operations and financial condition may be materially impacted.\nIn addition, our financial results may be harmed if our marketing, advertising, and promotional programs are less effective than those of our competitors. The growing prevalence and importance of social media platforms, behavioral advertising, and mobile technology also pose challenges and risks for our marketing, advertising, and promotional strategies; and failure to effectively use and gain traction on these platforms or technologies could cause our advertising to be less effective than our competitors. Moreover, improper or damaging use of social media or mobile technology, including by our employees, franchisees, or guests could increase our costs, lead to litigation, or result in negative publicity, all of which could have a material adverse effect on our financial results.\nWe may be adversely impacted by severe weather conditions, natural disasters, terrorist acts, or civil unrest that could result in property damage, injury to employees and staff, and lost restaurant sales.\nFood service businesses such as ours can be materially and adversely affected by severe weather conditions, such as severe storms, hurricanes, flooding, prolonged drought, or protracted heat or cold waves, and by natural disasters, such as earthquakes and wildfires, or “man-made” calamities such as terrorist incidents or civil unrest, and their aftermath. Such occurrences could result in lost restaurant sales, property damage, lost products, interruptions in supply, and increased costs.\nIf systemic or widespread adverse changes in climate or weather patterns occur, we could experience more severe impact, which could have a material adverse effect on our financial results. The impact of these factors may be exacerbated by our geographic profile, as nearly 70% of our restaurants are located in the states of California and Texas.\nRisks Related to Our Business Strategy\nWe may not achieve our development goals.\nWe intend to grow the brand primarily through new restaurant development by franchisees, both in existing markets and in new markets. Development involves substantial risks, including the risk of:\n•the inability to identify suitable franchisees;\n•limited availability of financing for the Company and for franchisees at acceptable rates and terms;\n•development costs exceeding budgeted or contracted amounts;\n•the negative impact of any re-imaging strategy if not adopted by franchisees or embraced by guests;\n•delays in completion of construction or shortages of any equipment or construction materials;\n•the inability to identify, or the unavailability of suitable sites at acceptable cost and other leasing or purchase terms;\n•developed properties not achieving desired revenue or cash flow levels once opened;\n•the negative impact of a new restaurant upon sales at nearby existing restaurants;\n•the challenge of developing in areas where competitors are more established or have greater penetration or access to suitable development sites;\n•incurring substantial unrecoverable costs in the event a development project is abandoned prior to completion;\n•impairment charges resulting from underperforming restaurants or decisions to curtail or cease investment in certain locations or markets;\n•in new geographic markets where we have limited or no existing locations, the inability to successfully expand or acquire critical market presence for our brand, acquire name recognition, successfully market our products, or attract new customers;\n•operating cost levels that reduce the demand for, or raise the cost of, developing new restaurants;\n•the challenge of identifying, recruiting, and training qualified franchisees or company restaurant management;\nAlthough we manage our growth and development activities to help reduce such risks, we cannot assure that our present or future growth and development activities will perform in accordance with our expectations. Our inability to expand in accordance with our plans or to manage the risks associated with our growth could have a material adverse effect on our results of operations and financial condition.\nOur highly-franchised business model presents a number of risks, and the failure of our franchisees to operate successful and profitable restaurants could negatively impact our business.\nAs of October 3, 2021, approximately 93% of our operating restaurant properties were franchised restaurants; therefore, our success increasingly relies on the financial success and cooperation of our franchisees, yet we have limited influence over their operations. Our income arises from two sources: fees from franchised restaurants (e.g., rent and royalties based on a percentage of sales) and, to a lesser degree, profit from our remaining Company-operated restaurants. Our franchisees manage their businesses independently, and therefore are responsible for the day-to-day operation of their restaurants. The revenues we realize from franchised restaurants are largely dependent on the ability of our franchisees to grow their sales. If our franchisees do not experience sales growth, our revenues and margins could be negatively affected as a result. Also, if sales trends worsen for franchisees, their financial results may deteriorate, which could result in, among other things, franchisee bankruptcies, restaurant closures, or delayed or reduced payments to us. Our success also increasingly depends on the willingness and ability of our independent franchisees to implement shared strategies and major initiatives, which may include financial investment, and to remain aligned with us on operating and promotional plans. Franchisees’ ability to contribute to the achievement of our plans is dependent in large part on the availability to them of funding at reasonable interest rates and may be negatively impacted by the financial markets in general or by the credit worthiness of our franchisees or the Company. As small businesses, some of our franchise operators may be negatively and disproportionately impacted by strategic initiatives, capital requirements, inflation, labor costs, employee relations issues, or other causes. In addition, franchisees’ business obligations may not be limited to the operation of Jack in the Box restaurants, making them subject to business and financial risks unrelated to the operation of our restaurants. These unrelated risks could adversely affect a franchisee’s ability to make payments to us or to make payments on a timely basis. We cannot assure you that our franchisees will successfully participate in our strategic or marketing initiatives or operate their restaurants in a manner consistent with our requirements, standards, and expectations. As compared to some of our competitors, our brand has relatively fewer franchisees who, on average, operate more restaurants per franchisee. There are significant risks to our business if a franchisee, particularly one who operates a large number of restaurants, encounters financial difficulties, including bankruptcy, or fails to adhere to our standards, projecting an image inconsistent with our brand or negatively impacting our financial results.\nWe are subject to financial and regulatory risks associated with our owned and leased properties and real estate development projects.\nWe own or lease the real properties on which most of our restaurants are located and lease or sublease to the franchisee a majority of our franchised restaurant sites. We have engaged and continue to engage in real estate development projects. As is the case with any owner or operator of real property, we are subject to eminent domain proceedings that can impact the value of investments we have made in real property, and we are subject to other potential liabilities, cost and damages arising out of owning, operating, leasing, or otherwise having interests in real property.\nIf we close a restaurant in a leased location, we may remain committed to perform our obligations under the applicable lease, which would include, among other things, payment of the base rent for the balance of the lease term. Additionally, the potential losses associated with our inability to cancel leases may result in our keeping open restaurant locations that are performing significantly below targeted levels. As a result, ongoing lease obligations at closed or underperforming restaurant locations could unfavorably impact our results of operations. In addition, at the end of the lease term and expiration of all renewal periods, we may be unable to renew the lease without substantial additional cost, if at all. As a result, we may be required to close or relocate a restaurant, which could subject us to construction and other costs and risks and may have an adverse effect on our operating performance.\nInformation and Technology Related Risks\nWe are subject to the risk of cybersecurity breaches, intrusions, data loss, or other data security incidents.\nWe and our franchisees rely on computer systems and information technology to conduct our business. We have instituted controls, including information security governance controls that are intended to protect our computer systems, our point of sale (“POS”) systems, and our information technology systems and networks; and adhere to payment card industry data security standards and limit third party access for vendors that require access to our restaurant networks. We also have business continuity plans that attempt to anticipate and mitigate failures. However, we cannot control or prevent every cybersecurity risk.\nA material failure or interruption of service, or a breach in the security of our computer systems caused by malware, ransomware or other attack, could cause reduced efficiency in operations, or other business interruptions; could negatively impact delivery of food to restaurants, or financial functions such as vendor payment, employee payroll and scheduling, franchise operations reporting, or our ability to receive customer payments through our POS or other systems, or could result in the loss or misappropriation of customer or employee data. Such events could negatively impact cash flows or require significant capital investment to rectify; result in damage to our business or reputation or loss of consumer or employee confidence; and lead to potential costs, fines, and litigation. Damage to our business or reputation or loss of consumer confidence may also result from any failure by our franchisees to implement standard computer systems and information technology, as we are dependent on our franchisees to adopt appropriate safeguards. These risks may be magnified by increased and changing regulations. The costs of compliance and risk mitigation planning, including increased investment in technology or personnel in order to protect valuable business or consumer information, have increased significantly in recent years, and may also negatively impact our financial results.\nRestaurants and other retailers have faced, and we could in the future become subject to, claims for purportedly fraudulent transactions arising out of the actual or alleged theft of credit or debit card information or the loss of personally identifiable information, and we may also be subject to lawsuits or other proceedings in the future relating to these types of incidents. Any such proceedings could distract our management from running our business and cause us to incur significant unplanned losses and expenses. Consumer perception of our brand could also be negatively affected by these events, which could further adversely affect our financial results.\nWe collect and maintain personal information about our employees and our guests and are seeking to provide our guests with new digital experiences. These digital experiences will require us to open up access into our POS systems to allow for capabilities like mobile order and pay, third party delivery, and digital menu boards. The collection and use of personal information are regulated at the federal and state levels; such regulations include the California Consumer Privacy Act. We increasingly rely on cloud computing and other technologies that result in third parties holding significant amounts of customer, employee, and franchisee information on our behalf. There has been an increase over the past several years in the frequency and sophistication of attempts to compromise the security of these types of systems. If the security and information systems that we or our outsourced third-party providers use to store or process such information are compromised or if we, or such third parties, otherwise fail to comply with applicable laws and regulations, we could face litigation and the imposition of penalties that could adversely affect our financial performance. Our reputation as a brand or as an employer could also be adversely affected by these types of security breaches or regulatory violations, which could impair our ability to attract and retain qualified employees.\nWe are subject to risks associated with our increasing dependence on digital commerce platforms and technologies to maintain and grow sales, and we cannot predict the impact that these digital commerce platforms and technologies, other new or improved technologies or alternative methods of delivery may have on consumer behavior and our financial results.\nAdvances in technologies, including advances in digital food order and delivery technologies, and changes in consumer behavior driven by such advances could have a negative effect on our business. Technology and consumer offerings continue to develop, and we expect that new and enhanced technologies and consumer offerings will be available in the future, including those with a focus on restaurant modernization, restaurant technology and digital engagement and ordering. We may pursue certain of those technologies and consumer offerings if we believe they offer a sustainable guest proposition and can be successfully integrated into our business model. However, we cannot predict consumer acceptance or our success in implementing these digital platforms, delivery channels or systems or other technologies or their impact on our business.\nWe are dependent on information technology and digital service providers and any material failure, misuse or interruption of our computer systems, supporting infrastructure, consumer-facing digital capabilities or social media platforms could adversely affect our business.\nWe are dependent upon information technology and digital service providers to properly conduct our business, including point-of-sale processing in our restaurants, order processing through digital channels, management of our supply chain, collection of cash, payment of obligations and various other processes and procedures. Our ability to efficiently manage our business, service our customers and process digital orders through our mobile application and third-party delivery partnerships depends significantly on the reliability and performance of our systems and those managed by our service providers. The failure of these systems and processes to operate effectively, including an interruption or degradation in such systems or services, could be harmful and cause delays in customer service, loss of digital sales, reduce efficiency or cause delays in operations. Significant capital investments may be required to remediate any such problems. Additionally, the success of certain of our strategic initiatives, including to expand our consumer-facing digital capabilities to connect with customers and drive growth, is highly dependent on our technology systems and digital service providers.\nGeneral Business Risks\nIf we fail to maintain an effective system of internal controls, we may not be able to accurately determine our financial results or prevent fraud. As a result, the Company’s stockholders could lose confidence in our financial results, which could harm our business and the value of the Company’s common shares.\nEffective internal controls are necessary for us to provide reliable financial reports and effectively prevent fraud. Section 404 of the Sarbanes-Oxley Act of 2002 requires us to evaluate and report on our internal controls over financial reporting. We cannot be certain that we will be successful in maintaining adequate internal controls over our financial reporting and financial processes in the future. We may in the future discover areas of our internal controls that need improvement. Furthermore, to the extent our business grows or significantly changes, our internal controls may become more complex, and we would require significantly more resources to ensure our internal controls remain effective. If we or our independent auditors discover a material weakness, the disclosure of that fact, even if quickly remedied, could reduce the market value of the Company’s common stock. Additionally, the existence of any material weakness may require management to devote significant time and incur significant expense to remediate any such material weaknesses and management may not be able to remediate any such material weaknesses in a timely manner.\nWe may not be able to adequately protect our intellectual property, which could harm the value of our brand and adversely affect our business.\nOur ability to successfully implement our business strategy depends, in part, on our ability to further build brand recognition using our trademarks, service marks, trade dress, and other proprietary intellectual property, including our name and logos, our strategy, and the ambiance of our restaurants. If our efforts to protect our intellectual property are inadequate, or if any third party misappropriates or infringes our intellectual property, either in print or on the Internet or a social media platform, the value of our brand may be harmed, which could have a material adverse effect on our business and might prevent our brand from achieving or maintaining market acceptance.\nWe franchise our brand to various franchisees. While we try to ensure that the quality of our brand is maintained by all franchisees, we cannot assure that all franchisees will uphold brand standards so as not to harm the value of our intellectual property or our reputation.\nJack in the Box may be subject to risk associated with disagreements with key stakeholders, such as franchisees.\nIn addition to its shareholders, Jack in the Box has several key stakeholders, including its independent franchise operators. Third parties such as franchisees are not subject to the control of the Company and may take actions or behave in ways that are adverse to the Company. Because the ultimate interests of franchisees and the Company are largely aligned around maximizing restaurant profits, the Company does not believe that any areas of disagreement between the company and franchisees are likely to create material risk to the Company or its shareholders. Nevertheless, it is possible that conflict and disagreements with these or other critical stakeholders could distract management or otherwise have a material adverse effect on the Company’s business.\nThe securitized debt instruments issued by certain of our wholly-owned subsidiaries have restrictive terms, and any failure to comply with such terms could result in default, which could harm the value of our brand and adversely affect our business.\nThe Series 2019-1 Senior Notes are subject to a series of covenants and restrictions customary for transactions of this type, including (i) that the Master Issuer maintains specified reserve accounts to be used to make required payments in respect of the Series 2019-1 Senior Notes, (ii) provisions relating to optional and mandatory prepayments and the related payment of specified amounts, including specified make-whole payments in the case of the Series 2019-1 Class A-2 Notes under certain circumstances, (iii) certain indemnification payments in the event, among other things, the assets pledged as collateral for the Series 2019-1 Senior Notes are in stated ways defective or ineffective and (iv) covenants relating to record keeping, access to information and similar matters. The Series 2019-1 Senior Notes are also subject to customary rapid amortization events provided for in the Indenture, including events tied to failure to maintain stated debt service coverage ratios, the sum of gross sales for specified restaurants being below certain levels on certain measurement dates, certain manager termination events, an event of default, and the failure to repay or refinance the Series 2019-1 Class A-2 Notes on the applicable scheduled maturity date. The Series 2019-1 Senior Notes are also subject to certain customary events of default, including events relating to non-payment of required interest, principal, or other amounts due on or with respect to the Series 2019-1 Senior Notes, failure to comply with covenants within certain time frames, certain bankruptcy events, breaches of specified representations and warranties, failure of security interests to be effective, and certain judgments.\nIn the event that a rapid amortization event occurs under the Indenture (including, without limitation, upon an event of default under the Indenture or the failure to repay the securitized debt at the end of the applicable term) which would require repayment of the Series 2019-1 Senior Notes, the funds available to us would be reduced or eliminated, which would in turn reduce our ability to operate and/or grow our business. If our subsidiaries are not able to generate sufficient cash flow to service their debt obligations, they may need to refinance or restructure debt, sell assets, reduce or delay capital investments, or seek to raise additional capital. If our subsidiaries are unable to implement one or more of these alternatives, they may not be able to meet debt payment and other obligations which could have a material adverse effect on our financial condition.\nWe have a significant amount of debt outstanding. Such indebtedness, along with the other contractual commitments of our Company or its subsidiaries, could adversely affect our business, financial condition and results of operations, as well as the ability of certain of our subsidiaries to meet debt payment obligations.\nUnder the Indenture, the Master Issuer has approximately $1.3 billion of outstanding debt as of October 3, 2021.\nThis level of debt could have certain material adverse effects on the Company, including but not limited to:\n•our available cash flow in the future to fund working capital, capital expenditures, acquisitions, and general corporate or other purposes could be impaired, and our ability to obtain additional financing for such purposes is limited;\n•a substantial portion of our cash flows could be required for debt service and, as a result, might not be available for our operations or other purposes;\n•any substantial decrease in net operating cash flows or any substantial increase in expenses could make it difficult for us to meet our debt service requirements or could force us to modify our operations or sell assets;\n•our ability to operate our business and our ability to repurchase stock or pay cash dividends to our stockholders may be restricted by the financial and other covenants set forth in the Indenture.\n•our ability to withstand competitive pressures may be decreased; and\n•our level of indebtedness may make us more vulnerable to economic downturns and reduce our flexibility in responding to changing business, regulatory, and economic conditions.\nIn addition, we may incur additional indebtedness in the future. If new debt or other liabilities are added to our current consolidated debt levels, the related risks that it now faces could intensify.\nThe securitization transaction documents impose certain restrictions on our activities or the activities of our subsidiaries, and the failure to comply with such restrictions could adversely affect our business.\nThe Indenture and the management agreement entered into between certain of our subsidiaries and the Indenture trustee (the “Management Agreement”) contain various covenants that limit our and our subsidiaries’ ability to engage in specified types of transactions. For example, the Indenture and the Management Agreement contain covenants that, among other things, restrict, subject to certain exceptions, the ability of certain subsidiaries to:\n•incur or guarantee additional indebtedness;\n•sell certain assets;\n•alter the business conducted by our subsidiaries;\n•create or incur liens on certain assets; or\n•consolidate, merge, sell or otherwise dispose of all or substantially all of the assets held within the securitization entities.\nAs a result of these restrictions, we may not have adequate resources or the flexibility to continue to manage the business and provide for growth of the Jack in the Box system, including product development and marketing for the Jack in the Box brand, which could adversely affect our future growth prospects, financial condition, results of operations and liquidity.\nWe are subject to increasing legal complexity and may be subject to claims or lawsuits that are costly to defend and could result in our payment of substantial damages or settlement costs.\nWe are subject to complaints or litigation brought by current or former employees, customers, current or former franchisees, vendors, landlords, shareholders, competitors (e.g., intellectual property related claims), government agencies, or others. A judgment that is not covered by insurance or that is significantly in excess of our insurance coverage for any claims could materially adversely affect our financial results. In addition, regardless of whether any claims against us are valid or whether we are found to be liable, claims may be expensive to defend, and may divert management’s attention away from our operations and hurt our performance. Further, adverse publicity resulting from claims against us or our franchisees may harm our business or that of our franchisees.\nUnionization activities or labor disputes may disrupt our operations and affect our profitability.\nSome or all of our employees or our franchisees’ employees may elect to be represented by labor unions in the future. If a significant number of these employees were to become unionized and collective bargaining agreement terms were significantly different from current compensation arrangements, this could adversely affect our business and financial results or the business and financial results of our franchisees. In addition, a labor dispute or organizing effort involving some or all of our employees or our franchisees’ employees may harm our brand and reputation. Resolution of such disputes may be costly and time-consuming, and thus increase our costs and distract management resources.\nOur insurance may not provide adequate levels of coverage against claims.\nWe believe that we maintain insurance policies customary for businesses of our size, type, and experience. Historically, through the use of deductibles or self-insurance retentions, we retained a portion of expected losses for our workers’ compensation, general liability, certain employee medical and dental, employment, property, and other claims. However, there are types of losses that we may incur that cannot be insured against or that we believe are not economically reasonable to insure. Such losses could have a material adverse effect on our business and results of operations.\nChanges in tax laws, interpretations of existing tax law, or adverse determinations by tax authorities could adversely affect our income tax expense and income tax payments.\nWe are subject to income taxation at the federal, state, and local levels in the U.S. Any significant changes in income tax laws, including, but not limited to, income tax rate increases, authoritative interpretations of the tax laws, and/or comprehensive tax reform measures could adversely affect our financial condition or results of operations.\nRisks Related to Government Regulations\nIncreasing regulatory and legal complexity may adversely affect restaurant operations and our financial results.\nOur regulatory environment exposes us to complex compliance and similar risks that could affect our operations and results in material ways. In many of our markets, we are subject to increasing regulation, which has increased our cost of doing business. We are affected by the cost, compliance and other risks associated with the often conflicting and highly prescriptive regulations, including where inconsistent standards imposed by multiple governmental authorities can adversely affect our business and increase our exposure to litigation or governmental investigations or proceedings.\nOur success depends in part on our ability to manage the impact of new, potential or changing regulations that can affect our business plans and operations. These include regulations affecting product packaging, marketing, the nutritional content and safety of our food and other products, labeling and other disclosure practices. Compliance efforts with those regulations may be affected by the need to comply with different, potentially conflicting laws in different jurisdictions, and the need to rely on the accuracy and completeness of information from third-party suppliers (particularly given varying requirements and practices for testing and disclosure).\nRegulatory bodies may enact new laws or promulgate new regulations that are adverse to our business, or they may view matters or interpret laws and regulations differently than they have in the past or in a manner adverse to our business. For example, a recently enacted law in California purports to codify an employment classification test set forth by the California Supreme Court that established a new standard for determining employee or independent contractor status. Although we would argue that the law does not change the status of franchisees or their employees, it has been suggested that the law could be read to, for example, make franchisors legally liable for the conduct of franchisee employees. Acceptance of this or similar arguments by the courts in California or elsewhere could impact our financial results or affect restaurant operations.\nGovernmental regulation, including in one or more of the following areas, may adversely affect our existing and future operations and results, including by harming our ability to profitably operate our restaurants.\nAmericans with Disabilities Act and Similar State Laws\nWe are subject to the Americans with Disabilities Act (“ADA”) and similar state laws that give civil rights protections to individuals with disabilities in the context of employment, public accommodations, and other areas. The expenses associated with any modifications we may be required to undertake with respect to our restaurants or services, or any damages, legal fees, and costs associated with litigating or resolving claims under the ADA or similar state laws, could be material.\nConsumer Protection and Privacy Laws\nWe are subject to various federal, state, and local laws and regulations concerning consumer protection and privacy as it relates to our marketing, advertising, and promotional programs, including, but not limited to, the California Consumer Privacy Act and the Telephone Consumer Protection Act. Any damages, legal fees, or costs associated with litigating or resolving claims under any such law could be material.\nFood Regulation\nThe Food Safety Modernization Act granted the FDA new authority regarding the safety of the entire food system, including through increased inspections and mandatory food recalls. Although restaurants are not directly implicated by these requirements, our suppliers may initiate or otherwise be subject to food recalls or other consequences impacting the availability of certain products, which could result in adverse publicity, or require us to take actions that could be costly for us or otherwise impact our business and financial results.\nLocal Licensure, Zoning, and Other Regulation\nEach of our restaurants is subject to state and local licensing and regulation by health, sanitation, food, and workplace safety and other agencies. We may experience material difficulties, delays, or failures in obtaining the necessary licenses or approvals for new restaurants, which could delay planned restaurant openings. In addition, stringent and varied requirements of local regulators with respect to zoning, land use, and environmental factors could delay or prevent development of new restaurants in particular locations.\nEnvironmental Laws\nWe are subject to federal, state, and local environmental laws and regulations concerning the discharge, storage, handling, release, and disposal of hazardous or toxic substances, as well as local ordinances restricting the types of packaging we can use in our restaurants. If and to the extent any hazardous or toxic substances are present on or adjacent to any of our restaurant locations, we believe any such contamination would be the responsibility of one or more third parties and would have been or should be addressed by the responsible party. If the relevant third parties have not or do not address the identified contamination properly or completely, then under certain environmental laws, we could be held liable as an owner or operator to address any remaining contamination, sometimes without regard to whether we knew of, or were responsible for, the release or presence of hazardous or toxic substances. Any such liability could be material. Further, we may not have identified all of the potential environmental liabilities at our properties, and any such liabilities could have a material adverse effect on our financial results. We also cannot predict what environmental laws or laws regarding packaging will be enacted in the future, how existing or future environmental or packaging laws will be administered or interpreted, or the amount of future expenditures that we may need to make to comply with, or to satisfy claims relating to, such laws.\nEmployment and Immigration Laws\nWe and our franchisees are subject to the federal labor laws, including the Fair Labor Standards Act, as well as various state and local laws governing such matters as minimum wages, exempt status classification, overtime, breaks, schedules, and other working conditions for employees. Federal, state, and local laws may also require us to provide paid and unpaid leave, healthcare, or other benefits to our employees. Changes in the law, or penalties associated with any failure on our part to comply with legal requirements, could increase our labor costs or result in significant additional expense to us and our franchisees.\nStates in which we operate may adopt new immigration laws or enforcement programs, and the U.S. Congress and the Department of Homeland Security from time to time consider and may implement changes to federal immigration laws, regulations, or enforcement programs. Such changes and enforcement programs may increase our obligations for compliance and oversight, which could subject us to additional costs and make our hiring process more cumbersome. Although we require all workers to provide us with government-specified documentation evidencing their employment eligibility, some of our employees may, without our knowledge, be unauthorized workers. All of our Company employees currently participate in the “E-Verify” program, an Internet-based, free program run by the United States government to verify employment eligibility. However, use of the “E-Verify” program does not guarantee that we will successfully identify all applicants who are ineligible for employment. Unauthorized workers are subject to deportation and may subject us to fines or penalties, and if any of our employees or our franchisees’ employees are found to be unauthorized, we could experience adverse publicity that negatively impacts our brand and may make it more difficult to hire and keep qualified employees. Termination of a significant number of employees who are found to be unauthorized workers may disrupt operations, cause temporary increases in labor costs to train new employees, and result in additional adverse publicity. We could also become subject to fines, penalties, and other costs related to claims that we did not fully comply with all record keeping obligations of federal and state immigration compliance laws. These factors could materially adversely affect our financial results.\nFranchising Activities\nOur franchising activities are subject to federal regulations administered by the U.S. Federal Trade Commission, laws enacted by a number of states, and rules and regulations promulgated by the U.S. Federal Trade Commission. In particular, we are subject to federal and state laws regulating the offer and sale of franchises, as well as judicial and administrative interpretations of such laws. Such laws impose registration and disclosure requirements on franchisors in the offer and sale of franchises and may also apply substantive standards to the relationship between franchisor and franchisee, including limitations on the ability of franchisors to terminate franchises and alter franchise arrangements. Failure to comply with new or existing franchise laws, rules, and regulations in any jurisdiction or to obtain required government approvals could negatively affect our ability to grow or expand our franchise business and sell franchises.\nThe proliferation of federal, state, and local regulations increases our compliance risks, which in turn could adversely affect our business.\nThe restaurant and retail industries are subject to extensive federal, state, and local laws and regulations, including regulations relating to:\n•the preparation, ingredients, labeling, packaging, advertising, and sale of food and beverages;\n•building and zoning requirements;\n•sanitation and safety standards;\n•employee healthcare, including the implementation and legal, regulatory, and cost implications of the Affordable Care Act;\n•labor and employment, including minimum wage adjustments, overtime, working conditions, employment eligibility and documentation, sick leave, and other employee benefit and fringe benefit requirements, and changing judicial, administrative, or regulatory interpretations of federal or state labor laws;\n•the registration, offer, sale, termination, and renewal of franchises;\n•Americans with Disabilities Act;\n•payment cards;\n•climate change, including regulations related to the potential impact of greenhouse gases, water consumption, or taxes on carbon emissions; and\n•consumer protection and privacy obligations, including the California Consumer Privacy Act, the Telephone Consumer Protection Act, and other new or proposed federal and state regulations.\nThe increasing amount and complexity of regulations and their interpretation may increase the costs to us and our franchisees of labor and compliance and increase our exposure to legal and regulatory claims which, in turn, could have a material adverse effect on our business. While we strive to comply with all applicable existing rules and regulations, we cannot predict the effect on our operations from modifications to the language or interpretations of existing requirements, or to the issuance of new or additional requirements in the future.\nLegislation and regulations regarding our products and ingredients, including the nutritional content of our products, could impact customer preferences and negatively impact our financial results.\nChanges in government regulation and consumer eating habits may impact the ingredients and nutritional content of our menu offerings or require us to disclose the nutritional content of our menu offerings. For example, a number of states, counties, and cities have enacted menu labeling laws requiring multi-unit restaurant operators to disclose certain nutritional information to customers or have enacted legislation restricting the use of certain types of ingredients in restaurants. Furthermore, the Affordable Care Act requires chain restaurants to publish calorie information on their menus and menu boards. These and other requirements may increase our expenses, slow customers’ ordering process, or negatively influence the demand for our offerings; all of which can impact sales and profitability.\nCompliance with current and future laws and regulations in a number of areas, including with respect to ingredients, nutritional content of our products, and packaging and service ware may be costly and time-consuming. Additionally, if consumer health regulations change significantly, we may be required to modify our menu offerings or packaging, and as a result, may experience higher costs or reduced demand associated with such changes. Some government authorities are increasing regulations regarding trans-fats and sodium. While we have removed all artificial or “added during manufacturing” trans fats from our ingredients, some ingredients have naturally occurring trans-fats. Future requirements limiting trans-fats or sodium content may require us to change our menu offerings or switch to higher cost ingredients. These actions may hinder our ability to operate in some markets or to offer our full menu in these markets, which could have a material adverse effect on our business. If we fail to comply with such laws and regulations, our business could also experience a material adverse effect.\nRisks Related to Our Common Stock\nOur quarterly results and, as a result, the price of our common stock, may fluctuate significantly and could fall below the expectations of securities analysts and investors due to various factors.\nOur quarterly results and the price of our common stock may each fluctuate significantly and could fail to meet the expectations of securities analysts and investors because of factors including:\n•actual or anticipated fluctuations in our operating results;\n•changes in earnings estimated by securities analysts or our ability to meet those estimates;\n•the operating and stock price performance of comparable companies;\n•changes in our stockholder base;\n•volatility of the stock market in general;\n•changes to the regulatory and legal environment in which we operate; and\n•general domestic and worldwide economic conditions.\nAs a result of these factors, results for any one quarter are not necessarily indicative of results to be expected for any other quarter or for any year. Same-store sales, system-wide sales, and earnings from continuing operations per share in any particular future period may decrease, or commodity, labor, or other operating costs and selling, general, and administrative expenses may increase. In the future, operating results may fall below the expectations of securities analysts and investors, which could cause the price of our common stock to fall. In addition, the stock market has historically experienced significant price and volume fluctuations. These fluctuations may be unrelated to the operating performance of particular companies. These broad market fluctuations may cause declines in the price of our common stock. The price of our common stock could fluctuate based upon factors that have little or nothing to do with our financial results, and those fluctuations could materially reduce the price of our common stock.\nActions of activist stockholders could cause us to incur substantial costs, divert management’s attention and resources, and have an adverse effect on our business.\nFrom time to time, we may be subject to proposals by stockholders urging us to take certain corporate actions. If activist stockholder activities ensue, our business could be adversely affected because responding to proxy contests and reacting to other actions by activist stockholders can be costly and time-consuming, disrupt our operations and divert the attention of management and our employees. For example, we may be required to retain the services of various professionals to advise us on activist stockholder matters, including legal, financial, and communications advisers, the costs of which may negatively impact our future financial results. In addition, perceived uncertainties as to our future direction, strategy or leadership created as a consequence of activist stockholder initiatives may result in the loss of potential business opportunities, harm our ability to attract new investors, customers, employees, and joint venture partners, and cause our stock price to experience periods of volatility or stagnation.",
    "item_1B": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item_2": "ITEM 2. PROPERTIES\nThe following table sets forth information about our restaurant locations (by state) for all restaurants in operation as of October 3, 2021:\nCompany-\nOperated Franchise Total\nArizona 5 168 173\nCalifornia 107 835 942\nColorado - 17 17\nHawaii - 30 30\nIdaho - 33 33\nIllinois - 12 12\nIndiana - 3 3\nKansas 3 2 5\nLouisiana - 16 16\nMissouri 1 54 55\nNevada - 77 77\nNew Mexico - 8 8\nNorth Carolina - 18 18\nOhio - 2 2\nOklahoma 8 8 16\nOregon 16 34 50\nSouth Carolina - 9 9\nTennessee - 9 9\nTexas 23 569 592\nUtah - 3 3\nWashington - 147 147\nGuam - 1 1\n163 2,055 2,218\nOf the total 2,218 restaurants, our interest in restaurant properties consists of the following:\nCompany-\nOperated Franchise Total\nCompany-owned restaurant buildings:\nOn company-owned land 10 196 206\nOn leased land 57 555 612\nSubtotal 67 751 818\nCompany-leased restaurant buildings on leased land 96 1,011 1,107\nFranchise directly-owned or directly-leased restaurant buildings - 293 293\nTotal restaurant buildings 163 2,055 2,218\nOur restaurant leases generally provide for fixed rental payments (with cost-of-living index adjustments) plus real estate taxes, insurance, and other expenses. In addition, approximately 14% of our leases provide for contingent rental payments between 1% and 12% of the restaurant’s gross sales once certain thresholds are met. We have generally been able to renew our restaurant leases as they expire at then-current market rates.\nIn addition to the restaurant locations, we own our corporate headquarters located in San Diego, California, which consists of approximately 70,000 square feet and approximately four acres of undeveloped land directly adjacent to it.",
    "item_3": "ITEM 3. LEGAL PROCEEDINGS\nSee Note 16, Commitments and Contingencies, of the notes to the consolidated financial statements for a discussion of our legal proceedings.",
    "item_4": "ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nInformation about our Executive Officers\nThe following table sets forth the name, age, position, and years with the Company of each person who is an executive officer of Jack in the Box Inc. as of October 3, 2021:\nName Age Positions Years with the\nCompany\nDarin Harris 52 Chief Executive Officer 1\nTim Mullany 46 Executive Vice President, Chief Financial Officer -\nRyan Ostrom 46 Executive Vice President, Chief Marketing Officer -\nTony Darden 51 Senior Vice President, Chief Operating Officer -\nDean Gordon 59 Senior Vice President, Chief Supply Chain Officer 12\nTim Linderman 52 Senior Vice President, Chief Franchise and Corporate Development -\nSteven Piano 56 Senior Vice President, Chief People Officer -\nSarah Super 45 Senior Vice President, Chief Legal and Risk Officer 8\nThe following sets forth the business experience of each executive officer for at least the last five years:\nMr. Harris has been Chief Executive Officer since June 2020. He was previously Chief Executive Officer of North America for flexible working company, IWG PLC, Regus, North America, from April 2018 to May 2020. Prior to that, from August 2013 to January 2018, Mr. Harris served as Chief Executive Officer of CiCi’s Enterprises LP. For just under five years, Mr. Harris also served as Chief Operating Officer for Primrose Schools from November 2008 to July 2013. He previously held franchise leadership roles as Senior Vice President at Arby’s Restaurant Group, Inc, from June 2005 to October 2008 and Vice President, Franchise and Corporate Development at Captain D’s Seafood, Inc., from May 2000 to January 2004. He was also a prior franchise operator of multiple Papa John’s Pizza and Qdoba Mexican Grill restaurants from November 2002 to June 2005. Mr. Harris has more than 25 years of leadership experience in the restaurant industry encompassing operations, franchising, brand strategy and restaurant development.\nMr. Mullany has been Executive Vice President and Chief Financial Officer since January 2021. Mr. Mullany has more than 20 years of experience leading large companies as well as hyper-growth concepts, both public and private. He served as Chief Financial Officer of Body Firm Aerobics Inc d/b/a VASA Fitness from August 2018 until December 2020. Prior to that, Mr. Mullany served as the Chief Financial Officer of RAVE Restaurant Group, Inc., which owns, operates, franchises, and/or licenses Pie Five Pizza Co. and Pizza Inn restaurants and Pizza Inn Express kiosks domestically and internationally, from May 2014 to July 2018. Previously, from October 2011 to April 2014, Mr. Mullany held the Chief Financial Officer role at Restaurants Unlimited, Inc, an American food and beverage firm, and from April 2009 to February 2011, he held the Chief Financial Officer role at Consumer Capital Partners, a private investment, concept development, and strategic advisory firm that franchises and operates Smashburger and Quizno brands, among others. Mr. Mullany received a Master of Business Administration from Columbia Business School and holds a Bachelor of Science from Villanova University.\nMr. Ostrom has been Executive Vice President and Chief Marketing Officer since February 2021. Mr. Ostrom has over 15 years of marketing and branding experience. Previously, from June 2019 until February 2021, he served as the Chief Brand Officer for GNC Holdings, LLC, a health, wellness, and nutrition brand. Prior to that, from June 2015 to June 2019, he served as the Chief Digital Officer of Yum Brands Inc. Mr. Ostrom also has held roles at Kenmore, Craftsman & DieHard at Sears Holding Corporation, and Reebok.\nMr. Darden has been Senior Vice President and Chief Operating Officer since June 2021. He has more than 20 years of cross functional executive leadership experience. Most recently, he served as the President of Mooyah, LLC, a privately held American fast casual hamburger restaurant chain headquartered in Plano, TX from April 2019 until June 2021. Prior to that, from May 2017 until April 2019, Mr. Darden served as the Chief Operating Officer of Taco Bueno Restaurants, L.P. (“Taco Bueno”), a privately held quick serve restaurant chain headquartered in Farmers Branch, TX that operates Tex-Mex style restaurants throughout the American South and Southwest. Through its acquisition of Taco Bueno, from December 2018 until April 2019, Mr. Darden also served as the Chief Operating Officer of Sun Holdings, Inc., a multi-concept franchisee based in Dallas, TX which owns and operates restaurants across eight states among different brands including Arby’s, Burger King, CiCi’s Pizza, Golden Corral, Krispy Kreme, Popeyes, and Taco Bueno. From February 2011 to May 2017, he served as the Vice President of Operation of Panera, LLC, an American chain store of bakery-café casual restaurants. Mr. Darden received his Bachelor of Arts, Interpersonal Communications from Azusa Pacific University.\nMr. Gordon has been Senior Vice President, Chief Supply Chain Officer since November 2019. He previously served as its Vice President and Chief Supply Chain Officer from July 2017 to November 2019. He was previously Vice President of Supply Chain Services since October 2012, and Division Vice President of Purchasing from February 2009 to October 2012. Prior to joining the Company in February 2009, Mr. Gordon was Vice President of Supply Chain Management for Potbelly Sandwich Works from December 2005 to February 2009, and he held various positions with Applebee’s International from August 2000 to December 2005, most recently as Executive Director of Procurement. Mr. Gordon also held a number of positions at Prandium, Inc., an operator of multiple restaurant concepts, from October 1994 to August 2000. Mr. Gordon has over 25 years of Supply Chain Management experience.\nMr. Piano has been Senior Vice President, Chief People Officer since April 2021. He has over ten years of experience in leadership roles as Chief People Officer and Human Resource Officer. He most recently served as the Chief Human Resources Officer at GNC Holdings, LLC, a health, wellness, and nutrition brand, from January 2018 to April 2021. Prior to that, Mr. Piano was the Chief Human Resource Officer for MoneyGram International Inc., an American cross-border P2P payments and money transfer company, from August 2009 until April 2017. Mr. Piano has also held leadership positions with Lehman Brothers, Citibank, and others.\nMr. Linderman has been Senior Vice President, Chief Franchise and Corporate Development Officer since August 2021, and previously held the position of SVP, Franchise and Corporate Development since October 2020. He has over 18 years of experience in the franchise industry. He most recently served as Chief Development Officer of Ascent Hospitality Management, LLC, a restaurant management company, from July 2019 to October 2020. Prior to that, from January 2014 until July 2019, he was the Chief Development Officer at Global Franchise Group, LLC, where he oversaw franchise sales, real estate, and construction for Great American Cookies, Marble Slab Creamery, Pretzelmaker, MaggieMoo’s Ice Cream and Treatery and Hot Dog on a Stick. Before that, he was the Director of Franchise Development for Primrose School Franchising Company, and held that same position at Arby’s.\nMs. Super has been Senior Vice President, Chief Legal and Risk Officer since March 2020, served as Senior Vice President, General Counsel since November 2019, and previously served as Vice President and Associate General Counsel from May 2018 until November 2019. Prior to joining the Company in December 2013, she was a partner at the law firm of Gordon & Rees. Ms. Super has more than 15 years of legal experience.\nPART II",
    "item_5": "ITEM 5. MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS, AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information. Our common stock is traded on the NASDAQ Global Select Market under the symbol “JACK.”\nDividends. In fiscal 2021, the Board of Directors declared four cash dividends of $0.40, $0.40, $0.44, and $0.44, respectively. Our dividend is subject to the discretion and approval of our Board of Directors and our compliance with applicable law, and depends upon, among other things, our results of operations, financial condition, level of indebtedness, capital requirements, contractual restrictions, and other factors that our Board of Directors may deem relevant.\nStock Repurchases. The following table sets forth information on our share repurchases of our common stock during the fourth quarter of 2021 (dollars in thousands, except per share data).\n(a)\nTotal number of shares purchased (b)\nAverage price paid per share (c)\nTotal number of shares purchased as part of publicly announced programs (d)\nMaximum dollar value that may yet be purchased under these programs (1)\n$ 70,032\nJuly 5, 2021 - August 1, 2021 18,453 $ 110.14 18,453 $ 68,000\nAugust 2, 2021 - August 29, 2021 489,464 $ 102.43 489,464 $ 17,863\nAugust 30, 2021 - October 3, 2021 169,211 $ 105.57 169,211 $ -\nTotal 677,128 677,128\n_____________________\n(1)On November 19, 2021, the Board of Directors authorized an additional $200.0 million stock buy-back program that expires on November 20, 2023.\nStockholders. As of November 17, 2021, there were 517 stockholders of record.\nSecurities Authorized for Issuance Under Equity Compensation Plans. The following table summarizes the equity compensation plans under which Company common stock may be issued as of October 3, 2021. Stockholders of the Company have approved all plans requiring such approval.\n(a) Number of securities to be issued upon exercise of outstanding options, warrants and rights (1) (b) Weighted-average exercise price of outstanding options (1) (c) Number of securities remaining for future issuance under equity compensation plans (excluding securities reflected in column (a))\nEquity compensation plans approved by security holders (2) 318,874 $92.44 1,898,901\n________________________\n(1)Includes shares issuable in connection with our outstanding stock options, performance share awards, nonvested stock units, and non-management director deferred stock equivalents. The weighted-average exercise price in column (b) includes the weighted-average exercise price of stock options.\n(2)For a description of our equity compensation plans, refer to Note 13, Share-Based Employee Compensation, of the notes to the consolidated financial statements.\nPerformance Graph. The following graph compares the cumulative return to holders of the Company’s common stock at September 30th of each year to the yearly weighted cumulative return of a Peer Group Index and to the Standard & Poor’s (“S&P”) 500 Index for the same period. The below comparison assumes $100 was invested on September 30, 2016 in the Company’s common stock and in the comparison groups and assumes reinvestment of dividends. The Company uses a Peer Group to assess the competitive pay levels of our senior executives, and to evaluate program design elements. In its annual review of the Peer Group Index used to benchmark executive compensation for our executive officers, the Compensation Committee of the Board of Directors, in consultation with its independent compensation consultant, approved changes to the Peer Group Index to include companies that more closely aligned with our financial selection criteria and are highly-franchised.\n2016 2017 2018 2019 2020 2021\nJack in the Box Inc. $100 $108 $90 $100 $89 $110\nS&P 500 Index $100 $119 $140 $146 $168 $218\n2020 Peer Group (1) $100 $100 $133 $155 $203 $275\n2021 Peer Group (2) $100 $116 $154 $148 $176 $220\n________________________\n(1)The 2020 Peer Group Index comprises the following companies: BJ’s Restaurants, Inc.; Bloomin’ Brands, Inc.; Brinker International, Inc.; The Cheesecake Factory Inc.; Chipotle Mexican Grill Inc.; Cracker Barrel Old Country Store, Inc.; Denny’s Corp.; Dine Brands Global Inc.; Domino’s Pizza, Inc.; Papa John's Int'l, Inc.; Red Robin Gourmet Burgers, Inc.; Texas Roadhouse, Inc.; and The Wendy’s Company.\n(2)The 2021 Peer Group Index comprises the following companies: BJ's Restaurants Inc.; The Cheesecake Factory Inc.; Chuy's Holdings Inc.; Cracker Barrel Old Country Store, Inc.; Del Taco Restaurants Inc.; Denny's Corp.; Dine Brands Global Inc.; Domino's Pizza, Inc.; El Pollo Loco Holdings Inc.; Noodles & Co; Papa John's Int’l Inc.; Red Robin Gourmet Burgers, Inc.; Ruth's Hospitality Group Inc.; Shake Shack Inc.; Texas Roadhouse, Inc.; The Wendy’s Company; and Wingstop Inc.",
    "item_6": "ITEM 6. RESERVED.",
    "item_7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nGENERAL\nFor an understanding of the significant factors that influenced our performance during the fiscal year, we believe our Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) should be read in conjunction with the consolidated financial statements and related notes included in this annual report as indexed on page.\nComparisons under this heading refer to the 53-week period ended October 3, 2021 and 52-week period ended September 27, 2020 for fiscal 2021 and fiscal 2020, respectively. A comparison of our results of operations and cash flows for fiscal 2020 compared to fiscal 2019 can be found under Part II, “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our Annual Report on Form 10-K for the fiscal year ended September 27, 2020.\nOur MD&A consists of the following sections:\n•Overview - a general description of our business and fiscal 2021 highlights.\n•Results of Operations - an analysis of our consolidated statements of earnings for fiscal 2021 compared to fiscal 2020.\n•Liquidity and Capital Resources - an analysis of our cash flows, including capital expenditures, share repurchase activity, dividends, and known trends that may impact liquidity.\n•Critical Accounting Estimates - a discussion of accounting policies that require critical judgments and estimates.\nWe have included in our MD&A certain performance metrics that management uses to assess company performance and which we believe will be useful in analyzing and understanding our results of operations. These metrics include:\n•Changes in sales at restaurants open more than one year (“same-store sales”), system restaurant sales, franchised restaurant sales, and average unit volumes (“AUVs”). Same-store sales, restaurant sales, and AUVs are presented for franchised restaurants. Franchise sales represent sales at franchise restaurants and are revenues of our franchisees. We do not record franchise sales as revenues; however, our royalty revenues and percentage rent revenues are calculated based on a percentage of franchise sales. We believe franchise and system same-store sales, franchised and system-wide sales, and AUV information are useful to investors as they have a direct effect on the Company’s profitability.\n•Adjusted EBITDA represents net earnings on a generally accepted accounting principles (“GAAP”) basis excluding gains or losses from discontinued operations, income taxes, interest expense, net, gains on the sale of company-operated restaurants, impairment and other (gains) charges, net, depreciation and amortization, amortization of tenant improvement allowances and other, and pension settlement charges. We are presenting Adjusted EBITDA because we believe that it provides a meaningful supplement to net earnings of the Company's core business operating results, as well as a comparison to those of other similar companies. Management believes that Adjusted EBITDA, when viewed with the Company's results of operations in accordance with GAAP and the accompanying reconciliations within MD&A, provides useful information about operating performance and period-over-period change, and provides additional information that is useful for evaluating the operating performance of the Company's core business without regard to potential distortions. Additionally, management believes that Adjusted EBITDA permits investors to gain an understanding of the factors and trends affecting our ongoing cash earnings, from which capital investments are made and debt is serviced.\nSame-store sales, system restaurant sales, franchised restaurant sales, AUVs, and Adjusted EBITDA are not measurements determined in accordance with GAAP and should not be considered in isolation, or as an alternative to earnings from operations, or other similarly titled measures of other companies.\nOVERVIEW\nOur Business\nAs of October 3, 2021, we operated and franchised 2,218 Jack in the Box quick-service restaurants, primarily in the western and southern United States, including one in Guam.\nWe derive revenue from retail sales at Jack in the Box company-operated restaurants and rental revenue, royalties (based upon a percent of sales), franchise fees and contributions for advertising and other services from franchisees. In addition, we recognize gains or losses from the sale of company-operated restaurants to franchisees, which are included as a line item within operating costs and expenses, net, in the accompanying consolidated statements of earnings.\nImpact of COVID-19\nThe COVID-19 pandemic has continued to have varying degrees of disruption on our business. Throughout the pandemic substantially all of our restaurants have remained open, with the majority of our dining rooms closed and locations operating in an off-premise capacity, leveraging our drive-thru, carryout and delivery capabilities. We have continued to follow the guidance of expert health authorities to ensure precautionary steps are taken to protect the health and safety of our employees and guests.\nOur drive-thru, carryout, and delivery capabilities have positioned us to continue our strong systemwide sales growth in 2021; however, our business has been challenged by COVID-19 related labor availability and wage inflation. As a result of labor challenges, we and our franchisees have had to reduce hours of operations and keep dining rooms closed at certain locations.\nWhile we have not had significant disruptions in our supply chain, we have experienced some product shortages and higher costs and inflationary pressures.\nThe pandemic has affected consumer behavior with increased focus on digital sales. We have seen significant growth in our digital sales and continue to support enhancements of our digital ordering and off-premise channels, such as delivery.\nWhile we do not know the future impact COVID-19 will have on our business, we expect labor and supply chain challenges and inflation to continue into at least fiscal 2022.\nOther Developments\nAs previously announced, a franchisee that operated 68 restaurants in the Midwest filed for chapter 11 bankruptcy in February 2021. Of the 68 restaurants, we sublease 50 of the locations to the franchisee and own the land and building for the remaining 18 locations. Through the bankruptcy proceedings, the franchisee may reject the franchise agreements and leases for a number of these locations, resulting in potential impairment costs related to future lease obligations.\nOn May 5, 2021 the franchisee filed a motion with the court rejecting three of the locations, two of which were permanently closed in fiscal 2020. On August 26, 2021, in response to a subsequent motion to reject two additional locations, the court authorized such rejections as of the dates previously agreed upon by the parties. On November 15, 2021, the franchisee filed an additional motion with the court rejected a total of 5 more locations. The franchisee’s remaining restaurants continue to operate with the franchisee remaining current with their obligations to us. The Company does not expect to acquire and operate any restaurants as part of the sale of these restaurants and our current expectation is the remaining restaurants will be transferred to one or more other franchise partners.\nFinancial Highlights for Fiscal 2021\n•Systemwide sales for the year increased 13.1% as compared to 2020. The increase is inclusive of the favorable 53rd week in the fourth quarter of 2021, which resulted in incremental systemwide sales of $77.9 million. Excluding the 53rd week, systemwide sales in fiscal 2021 increased 11.0%.\n•System same-store sales for the year increased 10.3%.\n•Total revenues for the year increased 12.0%. The increase is inclusive of the favorable 53rd week in the fourth quarter of 2021, which resulted in incremental revenue of approximately $21.3 million.\n•Earnings from operations for the year increased 25.7%.\n•Net earnings and Diluted EPS increased 84.7% and 90.9%, respectively.\n•Adjusted EBITDA increased in 2021 to $331.4 million from $274.2 million, or 21%. The increase is inclusive of the favorable 53rd week in the fourth quarter of 2021, which resulted in incremental Adjusted EBITDA of $5.6 million.\n•Net units down 1.0% with 37 closures and 14 store openings during the year.\nRESULTS OF OPERATIONS FOR FISCAL 2021 AND 2020\nThe following table presents certain income and expense items included in our consolidated statements of earnings as a percentage of total revenues, unless otherwise indicated. Percentages may not add due to rounding.\n2021 2020\nRevenues:\nCompany restaurant sales 33.9 % 34.2 %\nFranchise rental revenues 30.3 % 31.4 %\nFranchise royalties and other 17.9 % 17.5 %\nFranchise contributions for advertising and other services 17.9 % 17.0 %\n100.0 % 100.0 %\nOperating costs and expenses, net:\nFood and packaging (1) 29.1 % 29.4 %\nPayroll and employee benefits (1) 30.7 % 30.5 %\nOccupancy and other (1) 15.9 % 15.5 %\nFranchise occupancy expenses (2) 62.0 % 65.5 %\nFranchise support and other costs (3) 6.4 % 7.3 %\nFranchise advertising and other services expenses (4) 102.8 % 104.2 %\nSelling, general and administrative expenses 7.2 % 7.9 %\nDepreciation and amortization 4.1 % 5.2 %\nImpairment and other gains, net (0.3) % (0.6) %\nGains on the sale of company-operated restaurants (0.4) % (0.3) %\nEarnings from operations 25.4 % 22.6 %\nIncome tax rate (5) 25.2 % 26.8 %\n________________________\n(1)As a percentage of company restaurant sales.\n(2)As a percentage of franchise rental revenues.\n(3)As a percentage of franchise royalties and other.\n(4)As a percentage of franchise contributions for advertising and other services.\n(5)As a percentage of earnings from continuing operations and before income taxes.\nThe following table summarizes changes in same-store sales for company-operated, franchised, and system restaurants:\n2021 2020\nCompany 6.1 % 3.1 %\nFranchise 10.7 % 4.0 %\nSystem 10.3 % 4.0 %\nThe following table summarizes the changes in the number and mix of company and franchise restaurants:\n2021 2020\nCompany Franchise Total Company Franchise Total\nBeginning of year 144 2,097 2,241 137 2,106 2,243\nNew - 14 14 - 27 27\nAcquired from franchisees 20 (20) - 8 (8) -\nClosed (1) (36) (37) (1) (28) (29)\nEnd of year 163 2,055 2,218 144 2,097 2,241\n% of system 7 % 93 % 100 % 6 % 94 % 100 %\nThe following table summarizes the restaurant sales for company-operated, franchised, and total systemwide restaurants (in thousands):\n2021 2020\nCompany-operated restaurant sales $ 387,766 $ 348,987\nFranchised restaurant sales (1) 3,767,574 3,323,745\nSystemwide sales (1) $ 4,155,340 $ 3,672,732\n________________________\n(1)Franchised restaurant sales represent sales at franchised restaurants and are revenues of our franchisees. System sales include company and franchised restaurant sales. We do not record franchised sales as revenues; however, our royalty revenues, marketing fees and percentage rent revenues are calculated based on a percentage of franchised sales. We believe franchised and system restaurant sales information is useful to investors as they have a direct effect on the Company's profitability.\nBelow is a reconciliation of Non-GAAP Adjusted EBITDA to the most directly comparable GAAP measure, net earnings (in thousands):\n2021 2020\nNet earnings - GAAP $ 165,755 $ 89,764\nEarnings from discontinued operations, net of income taxes - (370)\nIncome taxes 55,852 32,727\nInterest expense, net 67,458 66,743\nPension settlement charges - 39,218\nGains on the sale of company-operated restaurants (4,203) (3,261)\nImpairment and other gains, net (3,382) (6,493)\nDepreciation and amortization 46,500 52,798\nAmortization of franchise tenant improvement allowances and other 3,450 3,028\nAdjusted EBITDA - Non-GAAP $ 331,430 $ 274,154\nCompany Restaurant Operations\nThe following table presents company restaurant sales and costs as a percentage of the related sales (dollars in thousands):\n2021 2020\nCompany restaurant sales $ 387,766 $ 348,987\nCompany restaurant costs:\nFood and packaging $ 113,006 29.1 % $ 102,449 29.4 %\nPayroll and employee benefits $ 119,033 30.7 % $ 106,540 30.5 %\nOccupancy and other $ 61,743 15.9 % $ 54,157 15.5 %\nCompany restaurant sales increased $38.8 million, or 11.1%, in 2021 as compared with the prior year. In 2021, the increase was primarily driven by average check growth, menu price increases, an increase in the average number of restaurants and the impact of the 53rd week, partially offset by a decline in traffic. The following table presents the approximate impact of these items on company restaurant sales in 2021 (in millions):\n2021 vs 2020\nAUV increase $ 24.0\nIncrease in the average number of restaurants 7.5\n53rd week 7.3\nTotal change in company restaurant sales $ 38.8\nSame-store sales at company-operated restaurants increased 6.1% in 2021 compared to a year ago. The following table summarizes the increases (decreases) in company-operated same-store sales:\n2021 vs. 2020\nTransactions (6.3) %\nAverage check (1) 12.4 %\nChange in same-store sales 6.1 %\n________________________\n(1)Includes price increases of 3.5% in 2021.\nFood and packaging costs as a percentage of company restaurant sales decreased by 0.3% to 29.1% in 2021 from 29.4% a year ago, primarily due to favorable sales mix of 0.8% and menu price increases of 0.9%, partially offset by a 1.3% increase in commodities. Commodity costs increased in the current fiscal year by approximately 5.1% primarily due to increases in pork and beverages. For fiscal 2022, we expect annual commodity cost inflation to be up 6% to 7% compared with fiscal 2021.\nPayroll and employee benefit costs as a percentage of company restaurant sales increased to 30.7% in 2021 compared with 30.5% a year ago primarily due to labor inflation, higher incentive compensation costs and a change in the mix of restaurants due to franchisee acquisitions. Labor inflation was approximately 7.2% in the current fiscal year. For fiscal 2022, we expect annual wage inflation to be up 8% to 10% compared with fiscal 2021.\nOccupancy and other costs as a percentage of company restaurant sales increased to 15.9% in 2021 from 15.5% a year ago due primarily to higher costs for delivery fees as we grow our delivery sales mix, higher costs for utilities and the acquisition of 20 restaurants with lower than average sales volumes; partially offset by leverage from higher same-store sales.\nFranchise Operations\nThe following table presents franchise revenues and costs in each fiscal year and other information we believe is useful in analyzing the change in franchise operating results (dollars in thousands):\n2021 2020\nFranchise rental revenues $ 346,634 $ 320,647\nRoyalties 193,908 171,407\nFranchise fees and other 10,817 6,912\nFranchise royalties and other 204,725 178,319\nFranchise contributions for advertising and other services 204,545 173,553\nTotal franchise revenues $ 755,904 $ 672,519\nFranchise occupancy expenses $ 214,913 $ 210,038\nFranchise support and other costs 13,052 13,059\nFranchise advertising and other services expenses 210,328 180,794\nTotal franchise costs $ 438,293 $ 403,891\nFranchise costs as a percentage of total franchise revenues 58.0 % 60.1 %\nAverage number of franchise restaurants 2,066 2,084\nFranchised restaurant sales $ 3,767,574 $ 3,323,745\nFranchise restaurant AUV (1) $ 1,790 $ 1,595\nRoyalties as a percentage of total franchise restaurant sales 5.1 % 5.2 %\n________________________\n(1) 2021 AUV is adjusted to exclude the 53rd week for the purpose of comparison to prior year.\nFranchise rental revenues increased $26.0 million, or 8.1%, in 2021 compared to the prior year, primarily due to higher AUVs resulting in an increase in revenues from percentage rent. In 2021, additional rent revenue of approximately $6.5 million from a 53rd week also contributed to the increase.\nFranchise royalties and other increased $26.4 million, or 14.8%, primarily due to higher royalties of $22.5 million as a result of higher AUVs and additional royalties of approximately $3.6 million from a 53rd week. Additionally, fees received in connection with the early termination of franchise agreements increased by $3.3 million.\nFranchise contributions for advertising and other services increased $31.0 million, or 17.9%, primarily due to higher marketing contributions of $29.9 million, as a result of higher AUVs, additional contributions of approximately $3.5 million from a 53rd week, and a reduction in contribution percentages for March 2020 and April 2020 marketing fees in response to the pandemic which contributed to lower fees of $7.9 million in the prior year.\nFranchise occupancy expenses, primarily rent, increased $4.9 million in 2021, primarily due to additional costs of approximately $4.0 million from a 53rd week.\nFranchise support and other costs remained flat in 2021, primarily to lower bad debt expense of $1.7 million related to specific franchise situations that occurred in the prior year, offset by higher costs related to a franchise business conference and brand standard audits.\nFranchise advertising and other service expenses increased $29.5 million, or 16.3% in 2021 primarily due to an increase in marketing contributions of $29.9 million.\nDepreciation and Amortization\nDepreciation and amortization decreased $6.3 million in 2021 as compared with the prior year, primarily due to certain of our franchise building assets becoming fully depreciated.\nSelling, General and Administrative (“SG&A”) Expenses\nThe following table presents the increase (decrease) in SG&A expenses in 2021 compared with the prior year (in thousands):\n2021 vs. 2020\nAdvertising (excluding 53rd week) $ 2,083\nIncentive compensation (including share-based compensation and related payroll taxes) 2,585\nCash surrender value of COLI policies, net (6,206)\nLitigation matters 1,162\nInsurance (1,351)\n53rd week 1,844\nOther 1,776\n$ 1,893\nAdvertising costs represent company contributions to our marketing fund and are generally determined as a percentage of company-operated restaurant sales. Advertising costs, on a comparable 52-week basis, increased $2.1 million primarily due to higher company-operated restaurant sales and a decrease in the contribution percentage in the prior year.\nIncentive compensation increased by $2.6 million in 2021 primarily due to higher achievement levels compared to the prior year for the Company’s annual incentive plan, partially offset by a $0.3 million decrease in stock-based compensation as a result of turnover at the executive level in the prior year.\nThe cash surrender value of our Company-owned life insurance (“COLI”) policies, net of changes in our non-qualified deferred compensation obligation supported by these policies, are subject to market fluctuations. The changes in market values had a positive impact of $6.2 million versus the prior year as a result of $9.1 million of gains recognized in the year compared to $2.9 million of gains in the prior year.\nLitigation matters increased by $1.2 million in 2021 primarily due to a $3.8 million favorable settlement received in the prior year from a class action lawsuit related to credit card interchange fees, partially offset by $2.6 million lower costs on certain employee and other litigation matters. Refer to Note 16, Commitments and Contingencies, of the notes to the consolidated financial statements for additional information.\nInsurance costs decreased $1.4 million in 2021 versus the prior year primarily due to more favorable trends in the current year related to expected losses associated with workers’ compensation claims.\nImpairment and Other Gains, Net\nImpairment and other gains, net is comprised of the following (in thousands):\n2021 2020\nGains on disposition of property and equipment, net (6,888) (9,768)\nCosts of closed restaurants and other 1,907 1,872\nAccelerated depreciation 1,592 235\nRestructuring costs 7 1,168\n$ (3,382) $ (6,493)\nImpairment and other gains, net decreased $3.1 million in 2021 versus the prior year primarily due to lower gains on the disposition of property and equipment of $2.9 million. In 2021, gains related to the sale of restaurant properties versus a gain on the sale of one of our corporate office buildings in the prior year. Refer to Note 9, Impairment and Other (Gains) Charges, Net, of the notes to the consolidated financial statements for additional information.\nGains on the Sale of Company-Operated Restaurants\nIn 2021 and 2020, no company-operated restaurants were sold to franchisees. Gains on the sale of company-operated restaurants in both periods pertain to meeting certain contingent consideration provisions included in restaurants sold in previous years.\nOther Pension and Post-Retirement Expenses, Net\nOther pension and post-retirement expenses, net decreased by $40.8 million in 2021 versus the prior year, primarily due to non-cash pension settlement charges of $39.2 million in the prior year. Refer to Note 12, Retirement Plans, of the notes to the consolidated financial statements for additional information regarding these charges.\nInterest Expense, Net\nInterest expense, net, is comprised of the following (in thousands):\n2021 2020\nInterest expense $ 67,600 $ 67,273\nInterest income (142) (530)\nInterest expense, net $ 67,458 $ 66,743\nInterest expense, net, increased $0.7 million in 2021 primarily due to interest from the 53rd contributing an additional $1.2 million and lower interest income of $0.4 million; partially offset by lower average borrowings as a result of paying down our Variable Funding Notes in 2021.\nIncome Taxes\nThe income tax provisions reflect effective tax rates of 25.2% and 26.8% in fiscal years 2021 and 2020, respectively. The major components of the year-over-year change in tax rates were a decrease in the impact of non-deductible compensation for certain officers, a decrease in nondeductible costs resulting from a California Private Attorney General Act lawsuit settled in the prior year, and an increase in non-taxable gains from the market performance of insurance products used to fund certain non-qualified retirement plans, partially offset by an adjustment to state taxes recorded in the second quarter of fiscal year 2021.\nLIQUIDITY AND CAPITAL RESOURCES\nGeneral\nOur primary sources of liquidity and capital resources are cash flows from operations and borrowings available under our securitized financing facility. Our cash requirements consist principally of working capital, general corporate needs, capital expenditures, income tax payments, debt service requirements, franchise tenant improvement allowance distributions, dividend payments, and obligations related to our benefit plans. We generally reinvest available cash flows from operations to invest in our business, service our debt obligations, pay dividends and repurchase shares of our common stock.\nOur primary sources of short-term and long-term liquidity are expected to be cash flows from operations and available borrowings under our Variable Funding Notes. As of October 3, 2021, the Company had $73.6 million of cash and restricted cash on its balance sheet and $110.5 million of borrowing availability under its Variable Funding Notes.\nBased upon current levels of operations and anticipated growth, we expect that cash flows from operations, combined with our securitized financing facility including our Variable Funding Notes, will be sufficient to meet our capital expenditure, working capital and debt service requirements for at least the next twelve months and the foreseeable future.\nCash Flows\nThe table below summarizes our cash flows from continuing operations activities for each of the last two fiscal years (in thousands):\n2021 2020\nTotal cash provided by (used in):\nOperating activities $ 201,122 $ 143,525\nInvesting activities (20,929) 29,123\nFinancing activities (343,545) (87,289)\nNet cash flows $ (163,352) $ 85,359\nOperating Activities. Operating cash flows increased $57.6 million compared with a year ago, primarily due to an increase in net income adjusted for non-cash items of $27.4 million and favorable changes in working capital of $30.2 million, primarily due to a favorable change in accounts receivable of $32.9 million, as a result of the repayment of franchise marketing and rent deferrals provided in the prior year, a favorable change in accrued liabilities of $24.8 million mainly from an increase in deferred rent income driven by collections of October rent in the 53rd week in fiscal 2021; partially offset by an unfavorable change in operating lease right-of-use assets and lease liabilities of $25.3 million due to payment of October rent in the 53rd week and the repayment of deferrals we received from our landlords in the prior year.\nPension and Postretirement Contributions - Our policy is to fund our pension plans at or above the minimum required by law. As of the date of our last actuarial funding valuation for our qualified pension plan, there was no minimum contribution funding requirement. In 2021 and 2020, we contributed $6.1 million and $6.2 million, respectively, to our pension and postretirement plans. We do not anticipate making any contributions to our qualified defined benefit pension plan in fiscal 2022. For additional information, refer to Note 12, Retirement Plans, of the notes to the consolidated financial statements.\nInvesting Activities. Cash flows used in investing activities increased $50.1 million in 2021 compared to 2020, primarily due to $21.5 million higher capital expenditures, $15.9 million lower proceeds on sale and leaseback transactions, and $11.0 million lower proceeds received on the sale of property and equipment, primarily due to proceeds received on the sale of a corporate office building in the prior year.\nCapital Expenditures - The composition of capital expenditures in each fiscal year is summarized in the table below (in thousands):\n2021 2020\nRestaurants:\nRemodel / refresh programs $ 9,018 $ 6,000\nRestaurant facility expenditures 7,491 3,495\nPurchases of assets intended for sale and leaseback 15,538 440\nRestaurant information technology 3,503 4,417\n35,550 14,352\nCorporate Services:\nInformation technology 1,485 3,506\nCorporate facilities 3,973 1,670\n5,458 5,176\nTotal capital expenditures $ 41,008 $ 19,528\nIn 2021, capital expenditures increased by $21.5 million compared to a year ago primarily due to a $15.1 million increase in purchases of assets intended for sale and leaseback. In 2021 and 2020, we exercised our right of first refusal related to six and one leased restaurant properties, respectively.\nWe use sale and leaseback financing to lower the initial cash investment in our restaurants to the cost of the equipment, whenever possible. The following table summarizes the cash flow activity related to these transactions in each fiscal year (dollars in thousands):\n2021 2020\nNumber of restaurants sold and leased back 2 2\nProceeds from sale and leaseback of assets $ 3,884 $ 19,828\nFinancing Activities. Cash flows used in financing activities increased by $256.3 million compared with a year ago, primarily due to our repayment during the second quarter of $107.9 million of 2020 borrowings on our Variable Funding Notes and an increase in stock repurchases of $44.4 million.\nRepurchases of Common Stock - In fiscal 2021, the Company purchased 1.9 million shares of its common stock for an aggregate cost of $200.0 million. As of October 3, 2021, there was no remaining amount under share repurchase programs authorized by the Board of Directors.\nOn November 19, 2021, the Board of Directors authorized an additional $200.0 million stock buy-back program that expires on November 20, 2023.\nDividends - In fiscal 2021, the Board of Directors declared four quarterly cash dividends of $0.40 per share in the first and second quarter and $0.44 per share in the third and fourth quarter, totaling $37.6 million. Future dividends are subject to approval by our Board of Directors.\nLong-Term Debt - As of October 3, 2021, our long-term debt consists of $1,290.3 million of total principal outstanding on the Class A-2 Notes (as defined below). Given the uncertainty arising from COVID-19, we took a precautionary measure and borrowed $107.9 under the Variable Funding Notes during the second quarter of 2020, which was fully repaid in the second quarter of 2021. As of October 3, 2021, we had no outstanding borrowings and $110.5 million of available borrowing capacity under our Variable Funding Notes, net of letters of credit issued of $39.5 million.\nOn July 8, 2019, Jack in the Box Funding, LLC (the “Master Issuer”), a limited-purpose, bankruptcy-remote, wholly owned indirect subsidiary of the Company, completed its securitization transaction and issued $575.0 million of its Series 2019-1 3.982% Fixed Rate Senior Secured Notes, Class A-2-I (the “Class A-2-I Notes”), $275.0 million of its Series 2019-1 4.476% Fixed Rate Senior Secured Notes, Class A-2-II (the “Class A-2-II Notes”) and $450.0 million of its Series 2019-1 4.970% Fixed Rate Senior Secured Notes, Class A-2-III (the “Class A-2-III Notes”) and together with the Class A-2-I Notes and the Class A-2-II Notes, (the “Class A-2 Notes”), in an offering exempt from registration under the Securities Act of 1933, as amended. In connection with the issuance of the Class A-2 Notes, the Master Issuer also entered into a revolving financing facility of Series 2019-1 Variable Funding Senior Secured Notes, Class A-1 (the “Variable Funding Notes”), which allows for the drawing of up to $150.0 million under the Variable Funding Notes and the issuance of letters of credit. The Class A-2 Notes and the Variable Funding Notes are referred to collectively as the “Notes.”\nInterest and principal payments on the Class A-2 Notes are payable on a quarterly basis. The quarterly principal payment of $3.25 million on the Class A-2 Notes may be suspended when the specified leverage ratio, which is a measure of outstanding debt to earnings before interest, taxes, depreciation, and amortization, adjusted for certain items (as defined in the Indenture), is less than or equal to 5.0x. Exceeding the leverage ratio of 5.0x does not violate any covenant related to the Class A-2 Notes. In 2021, the Company’s actual leverage ratio was under 5.0x, and as a result, quarterly principal payments were not required.\nThe legal final maturity date of the Class A-2 Notes is in August 2049, but it is expected that, unless earlier prepaid to the extent permitted under the Indenture, the anticipated repayment dates of the Class A-2-I Notes, the Class A-2-II Notes and the Class A-2-III Notes will be August 2023, August 2026, and August 2029, respectively (the “Anticipated Repayment Dates”). If the Master Issuer has not repaid or refinanced the Class A-2 Notes prior to the respective anticipated repayment date, additional interest will accrue pursuant to the Indenture.\nRestricted Cash - In accordance with the terms of the Indenture, certain cash accounts have been established with the Indenture trustee for the benefit of the note holders and are restricted in their use. As of October 3, 2021, the Master Issuer had restricted cash of $18.2 million, which primarily represented cash collections and cash reserves held by the trustee to be used for payments of interest and commitment fees required for the Class A-1 and A-2 Notes.\nCovenants and Restrictions - The Notes are subject to a series of covenants and restrictions customary for transactions of this type, including (i) that the Master Issuer maintains specified reserve accounts to be used to make required payments in respect of the Notes, (ii) provisions relating to optional and mandatory prepayments and the related payment of specified amounts, including specified make-whole payments in the case of the Class A-2 Notes under certain circumstances, (iii) certain indemnification payments in the event, among other things, the assets pledged as collateral for the Notes are in stated ways defective or ineffective and (iv) covenants relating to recordkeeping, access to information and similar matters. The Notes are also subject to customary rapid amortization events provided for in the Indenture, including events tied to failure to maintain stated debt service coverage ratios, the sum of gross sales for specified restaurants being below certain levels on certain measurement dates, certain manager termination events, an event of default, and the failure to repay or refinance the Class A-2 Notes on the applicable scheduled maturity date. The Notes are also subject to certain customary events of default, including events relating to non-payment of required interest, principal, or other amounts due on or with respect to the Notes, failure to comply with covenants within certain time frames, certain bankruptcy events, breaches of specified representations and warranties, failure of security interests to be effective, and certain judgments. As of October 3, 2021, we were in compliance with all of our debt covenant requirements and were not subject to any rapid amortization events.\nContractual Obligations\nOur cash requirements greater than twelve months from contractual obligations and commitments include:\nDebt Obligations and Interest Payments - Refer to Note 7, Indebtedness, of the notes to the consolidated financial statements for further information of our obligations and the timing of expected payments.\nOperating and Finance Leases - Refer to Note 8, Leases, of the notes to the consolidated financial statements for further information of our obligations and the timing of expected payments.\nPurchase Commitments - Purchase obligations includes non-cancelable purchase commitments related to information technology agreements and volume commitments for beverage products. Refer to Note 16, Commitments and Contingencies, for further detail of our obligations and the timing of expected future payments.\nBenefit Obligations - Refer to Note 12, Retirement Plans, of the notes to the consolidated financial statements for further information regarding our obligations and the timing of expected payments under our non-qualified defined benefit plan and postretirement healthcare plans.\nDISCUSSION OF CRITICAL ACCOUNTING ESTIMATES\nWe have identified the following as our most critical accounting estimates, which are those that are most important to the portrayal of the Company’s financial condition and results, and that require management’s most subjective and complex judgments. Information regarding our other significant accounting estimates and policies are disclosed in Note 1, Nature of Operations and Summary of Significant Accounting Policies, of the notes to the consolidated financial statements.\nLong-lived Assets - We review our long-lived assets, such as property and equipment and operating lease right-of-use assets, for impairment whenever events or changes in circumstances indicate that their carrying value may not be recoverable. Factors that we consider important individually or in combination trigger an impairment review include, but are not limited to, bankruptcy proceedings or other significant financial distress of a lessee, significant underperformance relative to historical or projected operating results, significant changes in our business and/or negative industry or economic trends, or our expectation to dispose of long-lived assets before the end of their estimated useful lives. Long-lived assets are grouped for recognition and measurement of impairment at the lowest level for which identifiable cash flows are largely independent of the cash flows of other assets. The impairment test for long-lived assets requires us to assess the recoverability of long-lived asset groups by comparing their net carrying value to the sum of undiscounted estimated future cash flows expected to be generated through leases and/or subleases or by our individual company-operated restaurants. If the carrying amount of a long-lived asset group exceeds the sum of related undiscounted future cash flows, we recognize an impairment loss by the amount that the carrying value of the assets exceeds fair value. Our estimates of cash flows used to assess impairment are subject to a high degree of judgment and may differ from actual cash flows due to, among other things, changes in our business plans, operating performance, and economic conditions.\nSelf-Insurance - We are self-insured for a portion of our losses related to workers’ compensation, general liability and other legal claims, and health benefits. In estimating our self-insurance accruals, we utilize independent actuarial estimates of expected losses and assumptions related to the loss development factors, which are based on statistical analysis of historical data. These assumptions are closely monitored and adjusted when warranted by changing circumstances. Should a greater number of claims occur compared to what was estimated, or should medical costs increase beyond what was expected, accruals might not be sufficient, and additional expense may be recorded.\nLegal Accruals - The Company is subject to claims and lawsuits in the ordinary course of its business. A determination of the amount accrued, if any, for these contingencies is made after analysis of each matter. We continually evaluate such accruals and may increase or decrease accrued amounts as we deem appropriate. Because lawsuits are inherently unpredictable, and unfavorable resolutions could occur, assessing contingencies is highly subjective and requires judgment about future events. As a result, the amount of ultimate loss may differ from those estimates.\nNEW ACCOUNTING PRONOUNCEMENTS\nSee Note 1, Nature of Operations and Summary of Significant Accounting Policies, of the notes to the consolidated financial statements for a discussion of the impact of new accounting pronouncements on our consolidated financial statements.",
    "item_7A": "ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nInterest Rate Risk - The Company is exposed to interest rate increases under its $150.0 million Variable Funding Notes; however, the Company had no outstanding borrowings under its Variable Funding Notes as of October 3, 2021.\nCommodity Price Risk -The Company is also exposed to the impact of commodity and utility price fluctuations. Many of the ingredients we use are commodities or ingredients that are affected by the price of other commodities, weather, seasonality, production, availability, and various other factors outside our control. In order to minimize the impact of fluctuations in price and availability, we monitor the primary commodities we purchase and may enter into purchasing contracts and pricing arrangements when considered to be advantageous. However, certain commodities remain subject to price fluctuations. We are exposed to the impact of utility price fluctuations related to unpredictable factors such as weather and various other market conditions outside our control. Our ability to recover increased costs for commodities and utilities through higher prices is limited by the competitive environment in which we operate.",
    "item_8": "ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe consolidated financial statements, related financial information, and the Report of Independent Registered Public Accounting Firm required to be filed are indexed on page and are incorporated herein.",
    "item_9": "ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.",
    "item_9A": "ITEM 9A. CONTROLS AND PROCEDURES\na.Conclusion Regarding the Effectiveness of Disclosure Controls and Procedures\nBased on an evaluation of the Company’s disclosure controls and procedures (as defined in Rule 13(a)-15(e) of the Securities Exchange Act of 1934, as amended), as of the end of the Company’s fiscal year ended October 3, 2021, the Company’s Chief Executive Officer and Chief Financial Officer (its principal executive officer and principal financial officer, respectively) have concluded that the Company’s disclosure controls and procedures were effective.\nb.Changes in Internal Control Over Financial Reporting\nThere have been no significant changes in the Company’s internal control over financial reporting that occurred during the Company’s fiscal quarter ended October 3, 2021 that have materially affected, or are reasonably likely to materially affect, the Company’s internal control over financial reporting.\nc.Management’s Report on Internal Control Over Financial Reporting\nManagement, including our principal executive officer and principal financial officer, is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act). The Company’s internal control over financial reporting is designed to provide reasonable assurance regarding the preparation and fair presentation of published financial statements in accordance with U.S. GAAP and includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect our transactions; (2) provide reasonable assurance that our transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made in accordance with appropriate authorizations; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of our assets that could have a material effect on our financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\nManagement, under the oversight of our principal executive officer, principal financial officer, and Audit Committee, assessed the effectiveness of the Company’s internal control over financial reporting as of October 3, 2021. In making this assessment, management used the criteria set forth in 2013 by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”) in Internal Control-Integrated Framework. Management has concluded that, as of October 3, 2021, the Company’s internal control over financial reporting was effective, at a reasonable assurance level, based on these criteria.\nThe Company’s independent registered public accounting firm, KPMG LLP, has issued an audit report on the effectiveness of our internal control over financial reporting, which follows.\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nJack in the Box Inc.:\nOpinion on Internal Control Over Financial Reporting\nWe have audited Jack in the Box Inc. and subsidiaries’ (the Company) internal control over financial reporting as of October 3, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of October 3, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of October 3, 2021 and September 27, 2020, the related consolidated statements of earnings, comprehensive income, stockholders’ deficit, and cash flows for the fifty-three week period ended October 3, 2021, and for each of the fifty-two week periods ended September 27, 2020, and September 29, 2019, and the related notes (collectively, the consolidated financial statements), and our report dated November 23, 2021 expressed an unqualified opinion on those consolidated financial statements.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ KPMG LLP\nSan Diego, California\nNovember 23, 2021",
    "item_9B": "ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III",
    "item_10": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThat portion of our definitive Proxy Statement appearing under the captions “Election of Directors,” “Director Qualifications and Biographical Information,” and “Committees of the Board” to be filed with the Commission pursuant to Regulation 14A within 120 days after October 3, 2021 and to be used in connection with our 2022 Annual Meeting of Stockholders is hereby incorporated by reference.\nInformation regarding our executive officers is set forth in Part I of this Report under the caption “Information about our Executive Officers.”\nThat portion of our definitive Proxy Statement appearing under the caption “Committees of the Board - Audit Committee,” relating to the members of the Company’s Audit Committee and the members of the Audit Committee who qualify as financial experts, is also incorporated herein by reference.\nThat portion of our definitive Proxy Statement appearing under the caption “Stockholder Recommendations and Board Nominations,” relating to the procedures by which stockholders may recommend candidates for director to the Nominating and Governance Committee of the Board of Directors, is also incorporated herein by reference.\nWe have adopted a Code of Ethics, which applies to all Jack in the Box Inc. directors, officers, and employees, including the Chief Executive Officer, Chief Financial Officer, Controller, and all of the financial team. The Code of Ethics is posted on the Company’s corporate website, www.jackintheboxinc.com (under the “Investors - Governance - Governance Documents - Code of Conduct” caption) and is available in print free of charge to any stockholder upon request. We intend to satisfy the disclosure requirement regarding any amendment to, or waiver of, a provision of the Code of Ethics for the Chief Executive Officer, Chief Financial Officer, and Controller or persons performing similar functions, by posting such information on our corporate website. No such waivers have been issued during fiscal 2021.\nWe have also adopted a set of Corporate Governance Principles and Practices for our Board of Directors and charters for all of our Board Committees, including the Audit, Compensation, and Nominating and Governance Committees. The Corporate Governance Principles and Practices and committee charters are available on our corporate website at www.jackintheboxinc.com and in print free of charge to any shareholder who requests them. Written requests for our Code of Business Conduct and Ethics, Corporate Governance Principles and Practices and committee charters should be addressed to Jack in the Box Inc., 9357 Spectrum Center Blvd., San Diego, California 92123, Attention: Corporate Secretary.",
    "item_11": "ITEM 11. EXECUTIVE COMPENSATION\nThat portion of our definitive Proxy Statement appearing under the caption “Executive Compensation,” “Director Compensation and Stock Ownership Requirements,” “Compensation Committee Interlocks and Insider Participation,” and “Compensation Committee Report” to be filed with the Commission pursuant to Regulation 14A within 120 days after October 3, 2021 and to be used in connection with our 2022 Annual Meeting of Stockholders is hereby incorporated by reference.",
    "item_12": "ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThat portion of our definitive Proxy Statement appearing under the caption “Security Ownership of Certain Beneficial Owners and Management” to be filed with the Commission pursuant to Regulation 14A within 120 days after October 3, 2021 and to be used in connection with our 2022 Annual Meeting of Stockholders is hereby incorporated by reference. Information regarding equity compensation plans under which Company common stock may be issued as of October 3, 2021 is set forth in Item 5 of this Report.",
    "item_13": "ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThat portion of our definitive Proxy Statement appearing under the caption “Certain Relationships and Related Transactions” and “Directors’ Independence,” if any, to be filed with the Commission pursuant to Regulation 14A within 120 days after October 3, 2021 and to be used in connection with our 2022 Annual Meeting of Stockholders is hereby incorporated by reference.",
    "item_14": "ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThat portion of our definitive Proxy Statement appearing under the caption “Independent Registered Public Accountants Fees and Services” to be filed with the Commission pursuant to Regulation 14A within 120 days after October 3, 2021 and to be used in connection with our 2022 Annual Meeting of Stockholders is hereby incorporated by reference.\nPART IV",
    "item_15": "ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\nITEM 15(a) (1) Financial Statements. See Index to Consolidated Financial Statements on page of this Report.\nITEM 15(a) (2) Financial Statement Schedules. None.\nITEM 15(a) (3) Exhibits.\nNumber Description Form Filed with SEC\n3.1 Certificate of Amendment of Restated Certificate of Incorporation dated September 21, 2007\n8-K 9/24/2007\n3.1.1 Restated Certificate of Incorporation, dated March 6, 1992\n10-Q 5/14/2020\n3.3 Amended and Restated Bylaws, dated May 8, 2020\n10-Q 5/14/2020\n4.1 Base Indenture, dated as of July 8, 2019, by and between Jack in the Box Funding, LLC, as Master Issuer, and Citibank, N.A., as Trustee and Securities Intermediary.\n8-K 7/8/2019\n4.2 Series 2019-1 Supplement to Base Indenture, dated as of July 8, 2019, by and between Jack in the Box Funding, LLC, as Master Issuer of the Series 2019-1 fixed rate senior secured notes, Class A-2, and Series 2019-1 variable funding senior notes, Class A-1, and Citibank, N.A., as Trustee and Series 2019-1 Securities Intermediary.\n8-K 7/8/2019\n10.1.20 Class A-1 Note Purchase Agreement, dated as of July 8, 2019, by and among Jack in the Box Funding, LLC, as Master Issuer, each of Different Rules, LLC, Jack in the Box Properties, LLC and Jack in the Box SPV Guarantor, LLC, as Guarantors, Jack in the Box Inc. as Manager, the conduit investors party thereto, the financial institutions party thereto, certain funding agents, and Coöperatieve Rabobank, U.A., New York Branch, as L/C Provider, Swingline Lender and Administrative Agent\n8-K 7/8/2019\n10.1.21 The Guarantee and Collateral Agreement, dated July 8, 2019, by and among Jack in the Box SPV Guarantor, LLC, Different Rules, LLC, and Jack in the Box Properties, LLC, each as a Guarantor and Citibank, N.A., as Trustee.\n8-K 7/8/2019\n10.1.22 Management Agreement, dated as of July 8, 2019, by and among Jack in the Box Funding, LLC, as Master Issuer, certain subsidiaries of Jack in the Box Funding, LLC party thereto, Jack in the Box Inc., as Manager, and Citibank, N.A., as Trustee.\n8-K 7/8/2019\n10.2* Form of Compensation and Benefits Assurance Agreement for Executives\n10-Q 2/20/2008\n10.2.1* Form of Revised Compensation and Benefits Assurance Agreement for certain officers\n10-Q 5/17/2012\n10.2.2* Form of Revised Compensation and Benefits Assurance Agreement for certain officers, dated May 8, 2014\n10-K 11/21/2014\n10.2.3* Form of Revised Compensation and Benefits Assurance Agreement for certain officers, dated June 15, 2020\n10-K 11/18/2020\n10.2.19* Jennifer Kennedy Separation and Release Agreement, dated November 13, 2020\n10-K 11/18/2020\n10.2.20* Offer Letter by and between Tim Mullany and Jack in the Box Inc., dated December 11, 2020\n8-K 12/17/2020\n10.2.21* Offer Letter by and between Ryan Ostrom and Jack in the Box Inc., dated December 30, 2020\n10-Q 2/17/2021\nNumber Description Form Filed with SEC\n10.2.22* Offer Letter by and between Steven Piano and Jack in the Box Inc., dated March 23, 2021\n10-Q 5/12/2021\n10.2.23* Offer Letter by and between Carlson Choi and Jack in the Box Inc., dated March 30, 2021\n10-Q 5/12/2021\n10.2.24* Melissa Corrigan Separation and Release Agreement, dated May 7, 2021\n10-Q 5/12/2021\n10.2.25* Andrew Martin Separation and Release Agreement, dated May 10, 2021\n10-Q 5/12/2021\n10.2.26* Offer Letter by and between Tony Darden and Jack in the Box Inc., dated May 11, 2021\n8-K 5/17/2021\n10.2.27* Adrienne Ingoldt Separation and Release Agreement, dated September 24, 2021\n10-K Filed herewith\n10.3* Amended and Restated Supplemental Executive Retirement Plan\n10-Q 2/18/2009\n10.3.1 * First Amendment to Jack in the Box Inc. Supplemental Executive Retirement Plan, As Amended and Restated Effective January 1, 2009\n8-K 9/22/2015\n10.4* Amended and Restated Executive Deferred Compensation Plan\n10-Q 2/18/2009\n10.4.1 * Jack in the Box Inc. Executive Deferred Compensation Plan, As Amended and Restated Effective January 1, 2016\n8-K 9/22/2015\n10.5* Amended and Restated Deferred Compensation Plan for Non-Management Directors\n10-K 11/22/2006\n10.8* Jack in the Box Inc. 2004 Stock Incentive Plan, Amended and Restated Effective February 17, 2012\nDEF 14A 1/25/2017\n10.8.1* Form of Restricted Stock Award for officers and certain members of management under the 2004 Stock Incentive Plan\n10-Q 8/5/2009\n10.8.3* Jack in the Box Inc. Non-Employee Director Stock Option Award Agreement under the 2004 Stock Incentive Plan\n8-K 11/15/2005\n10.8.4* Form of Restricted Stock Unit Award Agreement for Non-Employee Director under the 2004 Stock Incentive Plan\n10-K 11/20/2009\n10.8.6* Form of Restricted Stock Unit Grant Agreement for Non-Employee Directors under the 2004 Stock Incentive Plan\n10-Q 5/14/2015\n10.8.9* Form of Stock Option and Performance Share Awards Agreement under the 2004 Stock Incentive Plan\n10-K 11/22/2013\n10.8.10* Form of Time-Vested Restricted Stock Unit Award Agreement under the 2004 Stock Incentive Plan\n10-K 11/22/2013\n10.8.11* Form of Time-Vesting Restricted Stock Unit Award Agreement under the 2004 Stock Incentive Plan\n10-Q 2/19/2015\n10.8.12* Form of Stock Option and Performance Share Award Agreement under the 2004 Stock Incentive Plan\n10-Q 2/19/2015\n10.8.13* Form of Time-Vesting Restricted Stock Unit Award Agreement under the 2004 Stock Incentive Plan\n10-Q 2/18/2016\n10.8.14* Form of Stock Option and Performance Share Award Agreement under the 2004 Stock Incentive Plan\n10-Q 2/18/2016\n10.8.15* Form of Restricted Stock Unit Grant Agreement for Non-Employee Directors under the 2004 Stock Incentive Plan\n10-Q 5/12/2016\n10.8.16* Form of Time-Vesting Restricted Stock Unit Award Agreement under the 2004 Stock Incentive Plan\n10-Q 2/21/2019\n10.8.17* Jack in the Box Inc. Special Time-Vesting Restricted Stock Unit Award Agreement Under the 2004 Stock Incentive Plan\n10-Q 2/20/2020\n10.8.18* Jack in the Box Inc. Performance Share Award Agreement under the 2004 Stock Incentive Plan\n10-K Filed herewith\n10.8.19* Jack in the Box Inc. Time-Vesting Restricted Stock Unit Award Agreement under the 2004 Stock Incentive Plan\n10-K Filed herewith\n10.10.2* Jack in the Box Inc. Performance Incentive Plan, Effective February 13, 2016\nDEF 14A 1/11/2016\n10.11* Form of Amended and Restated Indemnification Agreement between the registrant and individual directors, officers and key employees\n10-Q 8/10/2012\n21.1 Subsidiaries of the Registrant\n_____ Filed herewith\n23.1 Consent of Independent Registered Public Accounting Firm\n_____ Filed herewith\n31.1 Certification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n_____ Filed herewith\nNumber Description Form Filed with SEC\n31.2 Certification of Principal Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n_____ Filed herewith\n32.1 Certification of Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n_____ Filed herewith\n32.2 Certification of Principal Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n_____ Filed herewith\n101.INS iXBRL Instance Document\n101.SCH iXBRL Taxonomy Extension Schema Document\n101.CAL iXBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF iXBRL Taxonomy Extension Definition Linkbase Document\n101.LAB iXBRL Taxonomy Extension Label Linkbase Document\n101.PRE iXBRL Taxonomy Extension Presentation Linkbase Document\n104 Cover Page Interactive Data File formatted in iXBRL\n* Management contract or compensatory plan.\nITEM 15(b) All required exhibits are filed herein or incorporated by reference as described in Item 15(a)(3).\nITEM 15(c) All schedules have been omitted as the required information is inapplicable, immaterial or the information is presented in the consolidated financial statements or related notes.\nITEM 16. FORM 10-K SUMMARY\nNot applicable.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nJACK IN THE BOX INC.\nBy: /s/ TIM MULLANY\nTim Mullany\nExecutive Vice President and Chief Financial Officer (principal financial officer)\nNovember 23, 2021\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nEach person whose signature appears below constitutes and appoints Darin Harris and Tim Mullany, jointly and severally, his or her attorneys-in-fact, each with the power of substitution, for him or her in any and all capacities, to sign any amendments to this report, and to file the same, with exhibits thereto and other documents in connection therewith with the Securities and Exchange Commission, hereby ratifying and confirming all that each of said attorneys-in-fact, or his substitute or substitutes may do or cause to be done by virtue hereof.\nSignature Title Date\n/s/ DARIN HARRIS Chief Executive Officer and Director (principal executive officer) November 23, 2021\nDarin Harris\n/s/ TIM MULLANY Executive Vice President and Chief Financial Officer (principal financial officer and principal accounting officer) November 23, 2021\nTim Mullany\n/s/ DAVID L. GOEBEL Director and Chairman of the Board November 23, 2021\nDavid L. Goebel\n/s/ SHARON P. JOHN Director November 23, 2021\nSharon P. John\n/s/ MADELEINE A. KLEINER Director November 23, 2021\nMadeleine A. Kleiner\n/s/ MICHAEL W. MURPHY Director November 23, 2021\nMichael W. Murphy\n/s/ JAMES M. MYERS Director November 23, 2021\nJames M. Myers\n/s/ DAVID M. TEHLE Director November 23, 2021\nDavid M. Tehle\n/s/ VIVIEN M. YEUNG Director November 23, 2021\nVivien M. Yeung\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets\nConsolidated Statements of Earnings\nConsolidated Statements of Comprehensive Income\nConsolidated Statements of Cash Flows\nConsolidated Statements of Stockholders’ Deficit\nNotes to Consolidated Financial Statements\nSchedules not filed: All schedules have been omitted as the required information is inapplicable, immaterial, or the information is presented in the consolidated financial statements or related notes.\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nJack in the Box Inc.:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Jack in the Box Inc. and subsidiaries (the Company) as of October 3, 2021 and September 27, 2020, the related consolidated statements of earnings, comprehensive income, stockholders’ deficit, and cash flows for the fifty-three week period ended October 3, 2021, and for each of the fifty-two week periods ended September 27, 2020, and September 29, 2019 and the related notes (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of October 3, 2021 and September 27, 2020, and the results of its operations and its cash flows for the fifty-three week period ended October 3, 2021, and for each of the fifty-two week periods ended September 27, 2020, and September 29, 2019, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of October 3, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission, and our report dated November 23, 2021 expressed an unqualified opinion on the effectiveness of the Company’s internal control over financial reporting.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nAssessment of self-insurance liabilities related to workers’ compensation and general liability\nAs discussed in Note 1 to the consolidated financial statements, the Company establishes its undiscounted insurance liability and reserves using independent actuarial estimates of expected losses based on a statistical analysis of historical claims data. As of October 3, 2021, the Company has recorded an estimated self-insurance liability of $20.8 million.\nWe identified the assessment of self-insurance liabilities related to workers’ compensation and general liability as a critical audit matter. Evaluating the Company’s judgments regarding the use of actuarial estimates and assumptions related to the loss development factors and the expected loss rates involved a high degree of complex and subjective auditor judgment. Changes in the loss development factors and expected loss rates could have a significant impact on the liability recognized.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls over the Company’s process to develop the estimate of self-insurance liabilities, with the involvement of actuarial professionals when appropriate. This included a control related to the review of the loss development factors and expected loss rates applied in the actuarial report and controls related to the completeness and accuracy of claims data. We agreed the claims paid and claims reported (not paid) data used in the actuarial models with the actual claims paid and claims reported (not paid) records of the Company, which is used in the development of the loss development factors and expected loss rates. We involved actuarial professionals with specialized skills and knowledge, who assisted in evaluating the Company’s actuarial estimates and assumptions related to the loss development factors and expected loss rates, by comparing them to generally accepted actuarial methodologies and the Company’s historical data.\n/s/ KPMG LLP\nWe have served as the Company’s auditor since 1986.\nSan Diego, California\nNovember 23, 2021\nJACK IN THE BOX INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(In thousands, except share and per share data)\nOctober 3,\n2021 September 27,\nASSETS\nCurrent assets:\nCash $ 55,346 $ 199,662\nRestricted cash 18,222 37,258\nAccounts and other receivables, net 74,335 78,417\nInventories 2,335 1,808\nPrepaid expenses 12,682 10,114\nCurrent assets held for sale 1,692 4,598\nOther current assets 4,346 3,724\nTotal current assets 168,958 335,581\nProperty and equipment, at cost:\nLand 105,393 100,460\nBuildings 907,792 914,311\nRestaurant and other equipment 112,959 112,675\nConstruction in progress 6,894 4,984\n1,133,038 1,132,430\nLess accumulated depreciation and amortization (810,124) (796,448)\nProperty and equipment, net 322,914 335,982\nOther assets:\nOperating lease right-of-use assets 934,066 904,548\nIntangible assets, net 470 277\nGoodwill 47,774 47,161\nDeferred tax assets 51,517 72,322\nOther assets, net 224,438 210,623\nTotal other assets 1,258,265 1,234,931\n$ 1,750,137 $ 1,906,494\nLIABILITIES AND STOCKHOLDERS’ DEFICIT\nCurrent liabilities:\nCurrent maturities of long-term debt $ 894 $ 818\nCurrent operating lease liabilities 150,636 179,000\nAccounts payable 29,119 31,105\nAccrued liabilities 148,417 129,431\nTotal current liabilities 329,066 340,354\nLong-term liabilities:\nLong-term debt, net of current maturities 1,273,420 1,376,913\nLong-term operating lease liabilities, net of current portion 809,191 776,094\nOther long-term liabilities 156,342 206,494\nTotal long-term liabilities 2,238,953 2,359,501\nStockholders’ deficit:\nPreferred stock $0.01 par value, 15,000,000 shares authorized, none issued\n- -\nCommon stock $0.01 par value, 175,000,000 shares authorized, 82,536,059 and 82,369,714 issued, respectively\n825 824\nCapital in excess of par value 500,441 489,515\nRetained earnings 1,764,412 1,636,211\nAccumulated other comprehensive loss (74,254) (110,605)\nTreasury stock, at cost, 61,523,475 and 59,646,773 shares, respectively\n(3,009,306) (2,809,306)\nTotal stockholders’ deficit (817,882) (793,361)\n$ 1,750,137 $ 1,906,494\nSee accompanying notes to consolidated financial statements.\nJACK IN THE BOX INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF EARNINGS\n(In thousands, except per share data)\nFiscal Year\n2021 2020 2019\nRevenues:\nCompany restaurant sales $ 387,766 $ 348,987 $ 336,807\nFranchise rental revenues 346,634 320,647 272,815\nFranchise royalties and other 204,725 178,319 169,811\nFranchise contributions for advertising and other services 204,545 173,553 170,674\n1,143,670 1,021,506 950,107\nOperating costs and expenses, net:\nFood and packaging 113,006 102,449 97,699\nPayroll and employee benefits 119,033 106,540 100,158\nOccupancy and other 61,743 54,157 50,613\nFranchise occupancy expenses 214,913 210,038 166,584\nFranchise support and other costs 13,052 13,059 12,110\nFranchise advertising and other services expenses 210,328 180,794 178,093\nSelling, general, and administrative expenses 82,734 80,841 76,357\nDepreciation and amortization 46,500 52,798 55,181\nImpairment and other (gains) charges, net (3,382) (6,493) 12,455\nGains on the sale of company-operated restaurants (4,203) (3,261) (1,366)\n853,724 790,922 747,884\nEarnings from operations 289,946 230,584 202,223\nOther pension and post-retirement expenses, net 881 41,720 1,484\nInterest expense, net 67,458 66,743 84,967\nEarnings from continuing operations and before income taxes 221,607 122,121 115,772\nIncome taxes 55,852 32,727 24,025\nEarnings from continuing operations 165,755 89,394 91,747\nEarnings from discontinued operations, net of income taxes - 370 2,690\nNet earnings $ 165,755 $ 89,764 $ 94,437\nNet earnings per share - basic:\nEarnings from continuing operations $ 7.40 $ 3.87 $ 3.55\nEarnings from discontinued operations - 0.02 0.10\nNet earnings per share (1) $ 7.40 $ 3.88 $ 3.66\nNet earnings per share - diluted:\nEarnings from continuing operations $ 7.37 $ 3.84 $ 3.52\nEarnings from discontinued operations - 0.02 0.10\nNet earnings per share (1) $ 7.37 $ 3.86 $ 3.62\nCash dividends declared per common share $ 1.68 $ 1.20 $ 1.60\n________________________\n(1) Earnings per share may not add due to rounding.\nSee accompanying notes to consolidated financial statements.\nJACK IN THE BOX INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(In thousands)\nFiscal Year\n2021 2020 2019\nNet earnings $ 165,755 $ 89,764 $ 94,437\nUnrecognized periodic benefit costs:\nActuarial gains (losses) arising during the period 44,134 (4,875) (62,377)\nActuarial losses and prior service cost reclassified to earnings 4,931 44,616 3,917\n49,065 39,741 (58,460)\nTax effect (12,714) (10,340) 15,176\n36,351 29,401 (43,284)\nCash flow hedges:\nNet change in fair value of derivatives - - (23,625)\nNet loss reclassified to earnings - - 24,328\n- - 703\nTax effect - - (3,165)\n- - (2,462)\nOther comprehensive income (loss), net of taxes 36,351 29,401 (45,746)\nComprehensive income $ 202,106 $ 119,165 $ 48,691\nSee accompanying notes to consolidated financial statements.\nJACK IN THE BOX INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In thousands)\nFiscal Year\n2021 2020 2019\nCash flows from operating activities:\nNet earnings $ 165,755 $ 89,764 $ 94,437\nEarnings from discontinued operations - 370 2,690\nEarnings from continuing operations 165,755 89,394 91,747\nAdjustments to reconcile net earnings to net cash provided by operating activities:\nDepreciation and amortization 46,500 52,798 55,181\nAmortization of franchise tenant improvement allowances and incentives 3,450 3,028 1,983\nAmortization of debt issuance costs 5,595 5,628 3,121\nLoss on extinguishment of debt - - 2,757\nLoss on interest rate swap termination - - 23,551\nExcess tax benefits from share-based compensation arrangements (1,160) (449) (113)\nDeferred income taxes 8,008 5,162 4,100\nShare-based compensation expense 4,048 4,394 8,074\nPension and postretirement expense 881 41,720 1,484\nGains on cash surrender value of company-owned life insurance\n(12,753) (4,262) (4,475)\nGains on the sale of company-operated restaurants\n(4,203) (3,261) (1,366)\nGains on the disposition of property and equipment (6,888) (9,768) (6,244)\nImpairment charges and other 2,889 322 5,414\nChanges in assets and liabilities, excluding acquisitions and dispositions:\nAccounts and other receivables 5,072 (27,865) 4,131\nInventories (269) 41 82\nPrepaid expenses and other current assets (2,766) (2,780) 8,728\nOperating lease right-of-use assets and lease liabilities (24,784) 490 -\nAccounts payable (3,091) 2,018 6,537\nAccrued liabilities 28,990 4,222 (7,505)\nPension and postretirement contributions (6,084) (6,243) (6,194)\nFranchise tenant improvement allowance and incentive disbursements (8,568) (10,239) (13,233)\nOther 500 (825) (9,355)\nCash flows provided by operating activities 201,122 143,525 168,405\nCash flows from investing activities:\nPurchases of property and equipment (41,008) (19,528) (47,649)\nProceeds from the sale and leaseback of assets 3,884 19,828 4,447\nProceeds from the sale of company-operated restaurants 1,827 3,395 1,280\nCollections on notes receivable - - 16,759\nProceeds from the sale of property and equipment 11,742 22,774 9,714\nOther 2,626 2,654 1,630\nCash flows (used in) provided by investing activities (20,929) 29,123 (13,819)\nCash flows from financing activities:\nBorrowings on revolving credit facilities - 114,376 229,798\nRepayments of borrowings on revolving credit facilities (107,875) (6,500) (960,220)\nProceeds from issuance of debt - - 1,300,000\nPrincipal repayments on debt (829) (10,536) (337,150)\nDebt issuance costs - (216) (34,122)\nPayments related to termination of interest rate swaps - - (23,551)\nDividends paid on common stock (37,322) (27,538) (41,179)\nProceeds from issuance of common stock 6,647 4,647 1,231\nRepurchases of common stock (200,000) (155,576) (137,654)\nPayroll tax payments for equity award issuances (4,166) (5,946) (2,883)\nCash flows used in financing activities (343,545) (87,289) (5,730)\nNet (decrease) increase in cash and restricted cash (163,352) 85,359 148,856\nCash and restricted cash at beginning of year 236,920 151,561 2,705\nCash and restricted cash at end of year $ 73,568 $ 236,920 $ 151,561\nSee accompanying notes to consolidated financial statements.\nJACK IN THE BOX INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ DEFICIT\n(Dollars in thousands)\nNumber\nof Shares Amount Capital in\nExcess of\nPar Value Retained\nEarnings Accumulated\nOther\nComprehensive\nLoss Treasury\nStock Total\nBalance at September 30, 2018 82,061,661 $ 821 $ 470,826 $ 1,561,353 $ (94,260) $ (2,530,439) $ (591,699)\nShares issued under stock plans, including tax benefit 97,341 1 1,231 - - - 1,232\nShare-based compensation - - 8,074 - - - 8,074\nDividends declared - - 191 (41,426) - - (41,235)\nPurchases of treasury stock - - - - - (125,317) (125,317)\nNet earnings - - - 94,437 - - 94,437\nOther comprehensive loss - - - - (45,746) - (45,746)\nCumulative-effect from a change in accounting principle - - - (37,330) - - (37,330)\nBalance at September 29, 2019 82,159,002 822 480,322 1,577,034 (140,006) (2,655,756) (737,584)\nShares issued under stock plans, including tax benefit 210,712 2 4,645 - - - 4,647\nShare-based compensation - - 4,394 - - - 4,394\nDividends declared - - 154 (27,717) - - (27,563)\nPurchases of treasury stock - - - - - (153,550) (153,550)\nNet earnings - - - 89,764 - - 89,764\nOther comprehensive income - - - - 29,401 - 29,401\nCumulative-effect from a change in accounting principle - - - (2,870) - - (2,870)\nBalance at September 27, 2020 82,369,714 824 489,515 1,636,211 (110,605) (2,809,306) (793,361)\nShares issued under stock plans, including tax benefit 166,345 1 6,646 - - - 6,647\nShare-based compensation - - 4,048 - - - 4,048\nDividends declared - - 232 (37,554) - - (37,322)\nPurchases of treasury stock - - - - - (200,000) (200,000)\nNet earnings - - - 165,755 - - 165,755\nOther comprehensive income - - - - 36,351 - 36,351\nBalance at October 3, 2021 82,536,059 $ 825 $ 500,441 $ 1,764,412 $ (74,254) $ (3,009,306) $ (817,882)\nSee accompanying notes to consolidated financial statements.\nJACK IN THE BOX INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1. NATURE OF OPERATIONS AND SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nNature of operations - Founded in 1951, Jack in the Box Inc. (the “Company”) operates and franchises Jack in the Box® quick-service restaurants. The Company operates as a single segment for reporting purposes. The following table summarizes the number of restaurants as of the end of each fiscal year:\n2021 2020 2019\nCompany-operated 163 144 137\nFranchise 2,055 2,097 2,106\nTotal system 2,218 2,241 2,243\nReferences to the Company throughout these notes to the consolidated financial statements are made using the first-person notations of “we,” “us,” and “our.”\nBasis of presentation - The accompanying consolidated financial statements have been prepared in accordance with U.S. generally accepted accounting principles (“U.S. GAAP”) and the rules and regulations of the Securities and Exchange Commission (“SEC”).\nCertain prior period information on the consolidated statement of cash flows has been reclassified to conform to the current year presentation.\nFiscal year - Our fiscal year is 52 or 53 weeks ending the Sunday closest to September 30. Comparisons throughout these notes to the consolidated financial statements refer to the 53-week period ended October 3, 2021 for the fiscal year 2021 and 52-week periods ended September 27, 2020 and September 29, 2019 for fiscal years 2020 and 2019, respectively.\nPrinciples of consolidation - The accompanying consolidated financial statements include the accounts of Jack in the Box Inc. and its wholly-owned subsidiaries. All intercompany accounts and transactions have been eliminated upon consolidation.\nUse of estimates - In preparing the consolidated financial statements in conformity with U.S. GAAP, management is required to make certain assumptions and estimates that affect reported amounts of assets, liabilities, revenues, expenses, and the disclosure of contingencies. In making these assumptions and estimates, management may from time to time seek advice and consider information provided by actuaries and other experts in a particular area. Actual amounts could differ materially from these estimates.\nRestricted cash - In accordance with the terms of our securitized financing facility, certain cash balances are required to be held in trust. Such restricted cash primarily represents cash collections and cash reserves held by the trustee to be used for payments of quarterly interest and commitment fees required for the Class A-1 and Class A-2 Notes. Starting in the second quarter of 2020, with uncertainty surrounding COVID-19 events, we voluntarily elected to fund cash held in trust for one additional quarterly interest and commitment fee payment. This voluntary election was discontinued in the second quarter of 2021. As of October 3, 2021 and September 27, 2020, restricted cash balances were $18.2 million and $37.3 million, respectively.\nAccounts and other receivables, net - Our accounts and other receivables, net is primarily comprised of receivables from franchisees, tenants, credit card processors, and insurance receivables. Franchisee receivables primarily include rents, property taxes, royalties, marketing, sourcing and technology support fees associated with lease and franchise agreements, and notes from certain of our franchisees. Tenant receivables relate to subleased properties where we are on the master lease agreement. We accrue interest on notes receivable based on the contractual terms. The allowance for doubtful accounts is based on historical experience and a review of existing receivables.\nInventories - Our inventories consist principally of food, packaging, and supplies, and are valued at the lower of cost or market on a first-in, first-out basis.\nAssets held for sale - Our assets held for sale typically includes property we plan to sell within the next year. If the determination is made that we no longer expect to sell an asset within the next year, the asset is reclassified out of assets held for sale. Long-lived assets that meet the held for sale criteria are reported at the lower of their carrying value or fair value, less estimated costs to sell.\nProperty and equipment, net - Expenditures for new facilities and equipment, and those that substantially increase the useful lives of the property, are capitalized. Facilities leased under finance leases are stated at the present value of minimum lease payments at the beginning of the lease term, not to exceed fair value. Maintenance and repairs are expensed as incurred. When property and equipment are retired or otherwise disposed of, the related cost and accumulated depreciation are removed from the accounts, and gains or losses on the dispositions are included in “Impairment and other (gains) charges, net” in the accompanying consolidated statements of earnings.\nBuildings, equipment, and leasehold improvements are generally depreciated using the straight-line method based on the estimated useful lives of the assets, over the initial lease term for certain assets acquired in conjunction with the lease commencement for leased properties, or the remaining lease term for certain assets acquired after the commencement of the lease for leased properties. In certain situations, one or more option periods may be used in determining the depreciable life of assets related to leased properties if we deem that an economic penalty would be incurred otherwise. In either circumstance, our policy requires lease term consistency when calculating the depreciation period, in classifying the lease and in computing straight-line rent expense. Building, leasehold improvement assets and equipment are assigned lives that range from 1 to 35 years. Depreciation expense related to property and equipment was $46.5 million, $52.8 million, and $55.2 million in fiscal year 2021, 2020, and 2019, respectively.\nImpairment of long-lived assets - We evaluate long-lived assets, such as property and equipment and operating lease right-of-use assets, for impairment whenever events or changes in circumstances indicate that their carrying value may not be recoverable. Long-lived assets are grouped for recognition and measurement of impairment at the lowest level for which identifiable cash flows are largely independent of the cash flows of other assets. The impairment test for long-lived assets requires us to assess the recoverability of long-lived assets by comparing their net carrying value to the sum of undiscounted estimated future cash flows directly associated with and arising from our use and eventual disposition of the assets. If the carrying amount of a long-lived asset group exceeds the sum of related undiscounted future cash flows, we recognize an impairment loss by the amount that the carrying value of the assets exceeds fair value. Refer to Note 9, Impairment and Other (Gains) Charges, Net, for additional information.\nGoodwill and intangible assets - Goodwill is the excess of the purchase price over the fair value of identifiable net assets acquired, if any. We generally record goodwill in connection with the acquisition of restaurants from franchisees. Likewise, upon the sale of restaurants to franchisees, goodwill is decremented. The amount of goodwill written-off is determined as the fair value of the business disposed of as a percentage of the fair value of the reporting unit retained. If the business disposed of was never fully integrated into the reporting unit after its acquisition, and thus the benefits of the acquired goodwill were never realized, the current carrying amount of the acquired goodwill is written off. Goodwill is evaluated for impairment annually during the fourth quarter, or more frequently if indicators of impairment are present. We first assess qualitative factors to determine whether the existence of events or circumstances lead to a determination that it is more likely than not that the fair value of a reporting unit or indefinite-lived asset is less than its carrying amount. If the qualitative factors indicate that it is more likely than not that the fair value is less than the carrying amount, we perform a single-step impairment test. To perform our impairment analysis, we estimate the fair value of the reporting unit and compare it to the carrying value. If the carrying value exceeds the fair value, an impairment loss is recognized equal to the excess. Refer to Note 4, Goodwill, for additional information.\nReacquired franchise rights are recorded in connection with our acquisition of franchised restaurants and are amortized over the remaining contractual period of the franchise contract in which the right was granted. As of October 3, 2021 and September 27, 2020, the carrying value of our intangible assets was $0.5 million and $0.3 million, respectively, and are included in “Intangible assets, net” in the accompanying consolidated balance sheets.\nCompany-owned life insurance - We have purchased company-owned life insurance (“COLI”) policies to support our non-qualified benefit plans. The cash surrender values of these policies were $123.6 million and $113.8 million as of October 3, 2021 and September 27, 2020, respectively, and are included in “Other assets, net”, in the accompanying consolidated balance sheets. Changes in cash surrender values are included in “Selling, general and administrative expenses” in the accompanying consolidated statements of earnings. These policies reside in an umbrella trust for use only to pay plan benefits to participants or to pay creditors if the Company becomes insolvent.\nLeases - We evaluate the contracts entered into by the Company to determine whether such contracts contain leases. A contract contains a lease if the contract conveys the right to control the use of identified property, plant, and equipment for a period of time in exchange for consideration. At commencement, contracts containing a lease are further evaluated for classification as an operating or finance lease where the Company is a lessee, or as an operating, sales-type, or direct financing lease where the Company is a lessor, based on their terms.\nThe lease term and incremental borrowing rate for each lease requires judgement by management and can impact the classification of our leases as well as the value of our lease assets and liabilities. When determining the lease term, we consider option periods available, and include option periods in the measurement of the lease right-of-use (“ROU”) asset and lease\nliability where the exercise is reasonably certain to occur. As our leases do not provide an implicit discount rate, we have determined it is appropriate to use our estimated collateralized incremental borrowing rate, based on the yield curve for the respective lease terms, in calculating our lease liabilities.\nRevenue recognition - “Company restaurant sales” include revenue recognized upon delivery of food and beverages to the customer at company-operated restaurants, which is when our obligation to perform is satisfied. Company restaurant sales exclude taxes collected from the Company’s customers. Gift cards, upon customer purchase, are recorded as deferred income and are recognized in revenue as they are redeemed.\n“Franchise rental revenues” received from franchised restaurants based on fixed rental payments are recognized as revenue over the term of the lease. Rental revenue from properties owned and leased by the Company and leased or subleased to franchisees is recognized on a straight-line basis over the respective term of the lease. Certain franchise rents, which are contingent upon sales levels, are recognized in the period in which the contingency is met.\n“Franchise royalties and other” primarily includes royalties and franchise fees received from our franchisees. Royalties are based upon a percentage of sales of the franchised restaurant and are recognized as earned. Franchise royalties are billed on a monthly basis. Franchise fees when a new restaurant opens or at the start of a new franchise term are recorded as deferred revenue when received and recognized as revenue over the term of the franchise agreement.\n“Franchise contributions for advertising and other services” includes franchisee contributions to our marketing fund billed on a monthly basis and sourcing and technology fees, as required under the franchise agreements. Contributions to our marketing fund are based on a percentage of sales and recognized as earned. Sourcing and technology services are recognized when the goods or services are transferred to the franchisee.\nGift cards - We sell gift cards to our customers in our restaurants and through selected third parties. The gift cards sold to our customers have no stated expiration dates and are subject to actual or potential escheatment rights in several of the jurisdictions in which we operate. We recognize income from gift cards when redeemed by the customer.\nWhile we will continue to honor all gift cards presented for payment, we may determine the likelihood of redemption to be remote for certain card balances due to, among other things, long periods of inactivity. In these circumstances, to the extent we determine there is no requirement for remitting balances to government agencies under unclaimed property laws, card balances may be recognized as income in our statement of earnings. Amounts recognized on unredeemed gift card balances were $0.6 million, $0.5 million, and $0.5 million in fiscal 2021, 2020, and 2019, respectively.\nPre-opening costs - Pre-opening costs associated with the opening of a new restaurant or the remodeling of an existing restaurant consist primarily of property rent and employee training costs. Pre-opening costs associated with the opening of a restaurant that was closed upon acquisition consist of labor costs, maintenance and repair costs, and property rent. Pre-opening costs are included in “Selling, general and administrative expenses” in the accompanying consolidated statements of earnings.\nSelf-insurance - We are self-insured for a portion of our workers’ compensation, general liability, employee medical and dental, and automotive claims. We utilize a paid-loss plan for our workers’ compensation, general liability, and automotive programs, which have predetermined loss limits per occurrence and in the aggregate. We establish our insurance liability (undiscounted) and reserves using independent actuarial estimates of expected losses for determining reported claims and as the basis for estimating claims incurred, but not reported. As of October 3, 2021 and September 27, 2020, our estimated liability for general liability and workers’ compensation claims exceeded our self-insurance retention limits by $1.8 million and $1.9 million, respectively, which we expect our insurance providers to pay on our behalf in accordance with the contractual terms of our insurance policies.\nAdvertising costs - We administer a marketing fund that includes contractual contributions. In 2021, 2020 and 2019, marketing fund contributions from franchise and company-operated restaurants were approximately 5.0% of gross revenues with the exception of our March 2020 and April 2020 marketing fees. In response to the economic burden associated with the COVID-19 pandemic, the Company reduced March 2020 marketing fees to 4.0% and postponed the collection of these fees over the course of 24 months. April 2020 marketing fees ranged from 2% to 4% based on annualized sales volumes, and these fees will be collected over three months beginning October 2020. As of October 3, 2021, postponed marketing fees which remain uncollected were $4.3 million which is included within “Accounts and other receivables, net” in our consolidated balance sheet.\nProduction costs of commercials, programming, and other marketing activities are charged to the marketing funds when the advertising is first used for its intended purpose, and the costs of advertising are charged to operations as incurred. When contributions to the marketing fund exceed the related advertising expenses, advertising costs are accrued up to the amount of revenues on an annual basis since we are contractually obligated to spend these funds. As of October 3, 2021 and September 27, 2020, additional amounts accrued were $9.5 million and $8.3 million, respectively, for this requirement. There have been no incremental contributions to the marketing fund made in 2021 or 2020. In 2019, incremental contributions to the marketing fund were $2.0 million. Total contributions made by the Company, including incremental contributions, are included in “Selling, general, and administrative expenses” in the accompanying consolidated statements of earnings. In fiscal 2021, 2020, and 2019 advertising costs were $19.6 million, $17.1 million, and $19.0 million, respectively.\nShare-based compensation - We account for our share-based compensation under the Financial Accounting Standards Board (“FASB”) authoritative guidance on stock compensation, which generally requires, among other things, that all employee share-based compensation be measured using a fair value method and that the resulting compensation cost be recognized in the financial statements. Compensation expense for our share-based compensation awards is generally recognized on a straight-line basis over the shorter of the vesting period or the period from the date of grant to the date the employee becomes eligible to retire. Refer to Note 13, Share-based Employee Compensation, for additional information.\nIncome taxes - Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases, as well as tax loss and credit carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. We recognize interest and, when applicable, penalties related to unrecognized tax benefits as a component of our income tax provision.\nAuthoritative guidance issued by the FASB prescribes a minimum probability threshold that a tax position must meet before a financial statement benefit is recognized. The minimum threshold is defined as a tax position that is more likely than not to be sustained upon examination by the applicable taxing authority, including resolution of any related appeals or litigation processes, based on the technical merits of the position. Refer to Note 11, Income Taxes, for additional information.\nDerivative instruments - We have historically used interest rate swaps to hedge interest rate volatility under our senior credit facility. On July 2, 2019, we terminated all interest rate swap agreements in anticipation of the securitization transaction. Prior to terminating the agreements, all derivatives were recognized on the consolidated balance sheets at fair value based upon quoted market prices. Changes in the fair values of derivatives were recorded in earnings or other comprehensive income (“OCI”), based on whether or not the instrument is designated as a hedge transaction. Gains or losses on derivative instruments that qualify for hedge designation were reported in OCI and reclassified to earnings in the period the hedged item affected earnings. When the underlying hedge transaction ceased to exist, the associated amount reported in OCI was reclassified to earnings at that time. Refer to Note 6, Derivative Instruments, for additional information.\nContingencies - We recognize liabilities for contingencies when we have an exposure that indicates it is probable that an asset has been impaired or that a liability has been incurred and the amount of impairment or loss can be reasonably estimated. Our ultimate legal and financial liability with respect to such matters cannot be estimated with certainty and requires the use of estimates. When the reasonable estimate is a range, the recorded loss will be the best estimate within the range. We record legal settlement costs when those costs are probable and reasonably estimable. Refer to Note 16, Commitments and Contingencies, for additional information.\nEffect of new accounting pronouncements adopted in fiscal 2021 - In June 2016, the FASB issued ASU 2016-13, Financial Instruments-Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments, that requires measurement and recognition of expected versus incurred credit losses for financial assets held, including trade receivables. The Company adopted the new guidance in the first quarter of 2021 using the modified retrospective method. The adoption did not have a material impact to our consolidated financial statements.\nThe Company closely monitors the financial condition of our franchisees and estimates the allowance for credit losses based on the lifetime expected loss on receivables. These estimates are based on historical collection experience with our franchisees as well as other factors, including current market conditions and events. Credit quality is monitored through the timing of payments compared to predefined aging criteria and known facts regarding the financial condition of the franchisee or customer. Account balances are charged off against the allowance after recovery efforts have ceased. The Company’s allowance for receivables have not historically been material.\nThe following table summarizes the activity in our allowance for doubtful accounts (in thousands):\nBalance as of September 27, 2020 $ (5,541)\nProvision for expected credit losses (770)\nWrite-offs charged against the allowance 19\nBalance as of October 3, 2021 $ (6,292)\nIn August 2018, the FASB issued ASU 2018-15, Intangibles-Goodwill and Other-Internal-Use Software (Subtopic 350-40): Customer’s Accounting for Implementation Costs Incurred in a Cloud Computing Arrangement That Is a Service Contract, which aligns the requirements for capitalizing implementation costs in cloud computing arrangements with the requirements for capitalizing implementation costs incurred to develop or obtain internal-use software. The Company adopted the standard in the first quarter of 2021. The adoption of this standard did not have a material impact to our consolidated financial statements.\nEffect of new accounting pronouncements to be adopted in future periods - We reviewed all other recently issued accounting pronouncements and concluded that they were either not applicable or not expected to have a significant impact on our consolidated financial statements.\n2. REVENUE\nNature of products and services - We derive revenue from retail sales at Jack in the Box company-operated restaurants and rental revenue, royalties, advertising, and franchise and other fees from franchise-operated restaurants.\nOur franchise arrangements generally provide for an initial franchise fee of $50,000 per restaurant and generally require that franchisees pay royalty and marketing fees at 5% of gross sales. The agreement also requires franchisees to pay sourcing, technology support and other miscellaneous fees.\nDisaggregation of revenue - The following table disaggregates revenue by primary source for the fiscal years ended October 3, 2021, September 27, 2020, and September 29, 2019 (in thousands):\n2021 2020 2019\nSources of revenue:\nCompany restaurant sales $ 387,766 $ 348,987 $ 336,807\nFranchise rental revenues 346,634 320,647 272,815\nFranchise royalties 193,908 171,407 163,047\nMarketing fees 188,184 158,258 157,969\nTechnology and sourcing fees 16,361 15,295 12,705\nFranchise fees and other services 10,817 6,912 6,764\nTotal revenue $ 1,143,670 $ 1,021,506 $ 950,107\nContract liabilities - Our contract liabilities consist of deferred revenue resulting from initial fees received from franchisees for new restaurant openings or new franchise terms, which are generally recognized over the franchise term. We classify these contract liabilities within “Accrued liabilities” and “Other long-term liabilities” in our consolidated balance sheets.\nA summary of significant changes in our contract liabilities is presented below (in thousands):\n2021 2020 2019\nDeferred franchise fees at beginning of period $ 43,541 $ 46,273 $ 50,018\nRevenue recognized during the period (6,014) (5,440) (5,173)\nAdditions during the period 2,905 2,708 1,428\nDeferred franchise fees at end of period $ 40,432 $ 43,541 $ 46,273\nThe following table reflects the estimated franchise fees to be recognized in the future related to performance obligations that are unsatisfied at the end of the period (in thousands):\n2022 $ 4,842\n2023 4,690\n2024 4,502\n2025 4,274\n2026 3,953\nThereafter 18,171\n$ 40,432\nWe have applied the optional exemption, as provided for under ASC Topic 606, Revenue from Contracts with Customers, which allows us to not disclose the transaction price allocated to unsatisfied performance obligations when the transaction price is a sales-based royalty.\n3. SUMMARY OF REFRANCHISINGS AND FRANCHISE ACQUISITIONS\nRefranchisings - In 2021, 2020, and 2019, no company-operated restaurants were sold to franchisees. Amounts included in “Gains on the sale of company-operated restaurants” in all periods related to resolutions of certain contingencies from the sale of restaurants in prior years.\nFranchise acquisitions - In 2021 and 2020, we acquired 20 and 8 franchise restaurants, respectively. In 2019 we did not acquire any franchise restaurants. Of the 20 restaurants acquired in 2021, we took over 16 restaurants as a result of an agreement with an underperforming franchisee who was in violation of franchise and lease agreements with the Company. Under this agreement, the franchisee voluntarily agreed to turn over the restaurants. The acquisition of the additional 4 restaurants in 2021 was the result of exercising our right of first refusal.\nWe account for the acquisition of franchised restaurants using the acquisition method of accounting for business combinations. The purchase price allocations were based on fair value estimates determined using significant unobservable inputs (Level 3). The goodwill recorded primarily relates to the sales growth potential of the market acquired and is expected to be deductible for income tax purposes.\nThe following table provides detail of the combined acquisitions in 2021 and 2020 (dollars in thousands):\n2021 2020\nRestaurants acquired from franchisees 20 8\nInventory $ 258 $ 73\nProperty and equipment 1,136 903\nIntangible assets 245 263\nOther assets 10 6\nGoodwill 613 414\nGains on the acquisition of franchise-operated restaurants (340) -\nLiabilities assumed (277) (800)\nTotal consideration $ 1,645 $ 859\nOf the 2021 total consideration, $1.3 million is non-cash consideration and is comprised of $0.3 million receivables that were eliminated in acquisition accounting and $1.0 million of accounts payable that was recorded in acquisition accounting. The accounts payable recorded is primarily related to estimated settlements with third parties to waive their liens and security interests on certain assets acquired and are subject to change based on final settlement amounts.\n4. GOODWILL\nThe changes in the carrying amount of goodwill during fiscal 2021 and 2020 were as follows (in thousands):\nBalance at September 29, 2019 $ 46,747\nAcquisition of franchise-operated restaurants 414\nBalance at September 27, 2020 47,161\nAcquisition of franchise-operated restaurants 613\nBalance at October 3, 2021 $ 47,774\n5. FAIR VALUE MEASUREMENTS\nFinancial assets and liabilities - The following table presents the financial assets and liabilities measured at fair value on a recurring basis (in thousands):\nTotal Quoted\nPrices\nin Active\nMarkets for\nIdentical\nAssets (2)\n(Level 1) Significant\nOther\nObservable\nInputs (2)\n(Level 2) Significant\nUnobservable\nInputs (2)\n(Level 3)\nFair value measurements as of October 3, 2021:\nNon-qualified deferred compensation plan (1) $ 18,555 $ 18,555 $ - $ -\nTotal liabilities at fair value $ 18,555 $ 18,555 $ - $ -\nFair value measurements as of September 27, 2020:\nNon-qualified deferred compensation plan (1) $ 25,071 $ 25,071 $ - $ -\nTotal liabilities at fair value $ 25,071 $ 25,071 $ - $ -\n________________________\n(1)We maintain an unfunded defined contribution plan for key executives and other members of management. The fair value of this obligation is based on the closing market prices of the participants’ elected investments. The obligation is included in “Accrued liabilities” and “Other long-term liabilities” on our consolidated balance sheets.\n(2)We did not have any transfers in or out of Level 1, 2, or 3.\nThe following table presents the carrying value and estimated fair value of our Class A-2 Notes as of October 3, 2021 and September 27, 2020 (in thousands):\nOctober 3,\n2021 September 27,\nCarrying Amount Fair Value Carrying Amount Fair Value\nClass A-2 Notes $ 1,290,251 $ 1,351,057 $ 1,290,251 $ 1,354,241\nThe fair value of the Class A-2 Notes was estimated using Level 2 inputs based on quoted market prices in markets that are not considered active markets.\nNon-financial assets and liabilities - Our non-financial instruments, which primarily consist of property and equipment, operating lease right-of-use assets, goodwill, and intangible assets, are reported at carrying value and are not required to be measured at fair value on a recurring basis. However, on an annual basis, or whenever events or changes in circumstances indicate that their carrying value may not be recoverable, non-financial instruments are assessed for impairment. If applicable, the carrying values are written down to fair value.\nIn connection with our impairment reviews performed during 2021, no material fair value adjustments were required.\n6. DERIVATIVE INSTRUMENTS\nInterest rate swaps - We have used interest rate swaps to mitigate interest rate volatility with regard to variable rate borrowings under our senior credit facility. In June 2015, we entered into forward-starting interest rate swap agreements that effectively converted $500.0 million of our variable rate borrowings to a fixed rate from October 2018 through October 2022. These agreements were designated as cash flow hedges under the terms of the FASB authoritative guidance for derivatives and hedging. Since they were effective in offsetting the variability of the hedged cash flows, changes in the fair values of the derivatives are not included in earnings but were included in OCI. These changes in fair value were subsequently reclassified into net earnings as a component of interest expense as the hedged interest payments were made on our variable rate debt.\nEffective July 2, 2019, the Company terminated all interest rate swap agreements in anticipation of the securitization transaction and related retirement of our senior credit facility. The fair value of the interest rate swaps at the termination date was $23.6 million, which was required to be paid in full on July 8, 2019. As a result of the decision to extinguish the senior credit facility, forecasted cash flows associated with the variable-rate debt interest payments were no longer considered to be probable. Consequently, unrealized losses in other comprehensive income at the termination date were immediately reclassified to “Interest expense, net” in the accompanying consolidated statement of earnings.\nFinancial performance - The following table summarizes the OCI activity related to our interest rate swap derivative instruments and the amounts reclassified from accumulated OCI (in thousands):\nLocation in Income 2019\nLoss recognized in OCI N/A $ (23,625)\nLoss reclassified from accumulated OCI into net earnings Interest expense, net $ 24,328\nAmounts reclassified from accumulated OCI into interest expense represent payments made to the counterparty for the effective portions of the interest rate swaps. During the fiscal year presented, our interest rate swaps had no hedge ineffectiveness.\n7. INDEBTEDNESS\nThe detail of our long-term debt at the end of each fiscal year is as follows (in thousands):\n2021 2020\nClass A-2-I Notes $ 570,688 $ 570,688\nClass A-2-II Notes 272,938 272,938\nClass A-2-III Notes 446,625 446,625\nClass A-1 Variable Funding Notes - 107,876\nFinance lease obligations 2,275 2,934\nTotal debt 1,292,526 1,401,061\nLess current maturities of long-term debt (894) (818)\nLess unamortized debt issuance costs (18,212) (23,330)\nLong-term debt $ 1,273,420 $ 1,376,913\nSecuritized financing transaction - On July 8, 2019, Jack in the Box Funding, LLC (the “Master Issuer”), a limited-purpose, bankruptcy-remote, wholly owned indirect subsidiary of the Company, completed its securitization transaction and issued $575.0 million of its Series 2019-1 3.982% Fixed Rate Senior Secured Notes, Class A-2-I (the “Class A-2-I Notes”), $275.0 million of its Series 2019-1 4.476% Fixed Rate Senior Secured Notes, Class A-2-II (the “Class A-2-II Notes”) and $450.0 million of its Series 2019-1 4.970% Fixed Rate Senior Secured Notes, Class A-2-III (the “Class A-2-III Notes”) and together with the Class A-2-I Notes and the Class A-2-II Notes, (the “Class A-2 Notes”), in an offering exempt from registration under the Securities Act of 1933, as amended. In connection with the issuance of the Class A-2 Notes, the Master Issuer also entered into a revolving financing facility of Series 2019-1 Variable Funding Senior Secured Notes, Class A-1 (the “Variable Funding Notes”), which allows for the drawing of up to $150.0 million under the Variable Funding Notes and the issuance of letters of credit. The Class A-2 Notes and the Variable Funding Notes are referred to collectively as the “Notes.”\nThe Notes were issued in a privately placed securitization transaction pursuant to which certain of the Company’s revenue-generating assets, consisting principally of franchise-related agreements, real estate assets, and intellectual property and license agreements for the use of intellectual property, are held by the Master Issuer and certain other limited-purpose, bankruptcy remote, wholly owned indirect subsidiaries of the Company that act as Guarantors (as defined below) of the Notes and that have pledged substantially all of their assets, excluding certain real estate assets and subject to certain limitations, to secure the Notes.\nThe proceeds from the issuance of the Class A-2 Notes, were used to repay the remaining principal outstanding on the term loans and revolving credit facility. As a result, a loss on early extinguishment of debt of $2.8 million was recorded in fiscal 2019, primarily consisting of the write-off of unamortized deferred financing costs related to the Credit Agreement, and is reflected in “Interest expense, net” in the consolidated statement of earnings.\nClass A-2 Notes - Interest and principal payments on the Class A-2 Notes are payable on a quarterly basis. The quarterly principal payment of $3.25 million on the Class A-2 Notes may be suspended when the specified leverage ratio, which is a measure of outstanding debt to earnings before interest, taxes, depreciation, and amortization, adjusted for certain items (as defined in the Indenture), is less than or equal to 5.0x. Exceeding the leverage ratio of 5.0x does not violate any covenant related to the Class A-2 Notes. As of October 3, 2021, the Company’s actual leverage ratio was under 5.0x, and as a result, quarterly principal payments are not required. Accordingly, the entire outstanding balance of the Class A-2 Notes has been classified as long-term debt.\nThe legal final maturity date of the Class A-2 Notes is in August 2049, but it is expected that, unless earlier prepaid to the extent permitted under the Indenture, the anticipated repayment dates of the Class A-2-I Notes, the Class A-2-II Notes and the Class A-2-III Notes will be August 2023, August 2026 and August 2029, respectively (the “Anticipated Repayment Dates”). If the Master Issuer has not repaid or refinanced the Class A-2 Notes prior to the respective anticipated repayment date, additional interest will accrue pursuant to the Indenture. The Class A-2 Notes are secured by the collateral described below under “Guarantees and Collateral.”\nVariable Funding Notes - The Variable Funding Notes were issued under the Indenture and allow for drawings on a revolving basis and the issuance of letters of credit. Depending on the type of borrowing under the Variable Funding Notes, interest on the Variable Funding Notes will be based on (i) the prime rate, (ii) overnight federal funds rates, (iii) the London interbank offered rate for U.S. Dollars or (iv) the lenders’ commercial paper funding rate plus any applicable margin, as set forth in the Variable Funding Note Purchase Agreement. There is a scaled commitment fee on the unused portion of the Variable Funding Notes facility of between 50 and 100 basis points. It is anticipated that the principal and interest on the Variable Funding Notes will be repaid in full on or prior to August 2024, subject to two one-year extensions at the option of the Company. Following the anticipated repayment date (and any extensions thereof), additional interest will accrue equal to 5.00% per annum. As of October 3, 2021 and September 27, 2020, $39.5 million of letters of credit were outstanding against the Variable Funding Notes, which relate primarily to interest reserves required under the Indenture. During the second quarter of 2020, to secure our liquidity position and provide financial flexibility given the uncertain market conditions, we borrowed $107.9 million under the Variable Funding Notes. During the second quarter of 2021, the Company fully paid down its outstanding borrowings on its Variable Funding Notes. As of October 3, 2021, unused borrowing capacity under our Variable Funding Notes was $110.5 million.\nGuarantees and collateral - Pursuant to the Guarantee and Collateral Agreement, dated July 8, 2019 (the “Guarantee and Collateral Agreement”), among the Guarantors, in favor of the trustee, the Guarantors guarantee the obligations of the Master Issuer under the Indenture and related documents and secure the guarantee by granting a security interest in substantially all of their assets. The Notes are secured by a security interest in substantially all of the assets of the Master Issuer and the Guarantors (collectively, the “Securitization Entities”). The assets of the Securitization Entities include most of the revenue-generating assets of the Company and its subsidiaries, which principally consist of franchise-related agreements, certain company-operated restaurants, intellectual property and license agreements for the use of intellectual property. Upon certain trigger events, mortgages will be required to be prepared and recorded on the real estate assets.\nCovenants and restrictions - The Notes are subject to a series of covenants and restrictions customary for transactions of this type, including (i) that the Master Issuer maintains specified reserve accounts to be used to make required payments in respect of the Notes, (ii) provisions relating to optional and mandatory prepayments and the related payment of specified amounts, including specified make-whole payments in the case of the Class A-2 Notes under certain circumstances, (iii) certain indemnification payments in the event, among other things, the assets pledged as collateral for the Notes are in stated ways defective or ineffective and (iv) covenants relating to recordkeeping, access to information and similar matters. The Notes are also subject to customary rapid amortization events provided for in the Indenture, including events tied to failure to maintain stated debt service coverage ratios, the sum of gross sales for specified restaurants being below certain levels on certain measurement dates, certain manager termination events, an event of default, and the failure to repay or refinance the Class A-2 Notes in full by the applicable anticipated repayment date. The Notes are also subject to certain customary events of default, including events relating to non-payment of required interest, principal, or other amounts due on or with respect to the Notes, failure to comply with covenants within certain time frames, certain bankruptcy events, breaches of specified representations and warranties, failure of security interests to be effective, and certain judgments.\nDeferred financing costs - In 2019, the Company incurred costs of approximately $33.0 million in connection with the securitization transaction. The costs related to our Class A-2 Notes are presented as a reduction in “Long-term debt, net of current maturities” and are being amortized over the Anticipated Repayment Dates, utilizing the effective interest rate method. The costs related to our Variable Funding Notes are presented within “Other assets, net” and are being amortized over the Anticipated Repayment Date of August 2026 using the straight-line method. As of October 3, 2021, the effective interest rates, including the amortization of debt issuance costs, were 4.545%, 4.800%, and 5.198% for the Class A-2-I Notes, Class A-2-II Notes and Class A-2-III Notes, respectively.\nMaturities of long-term debt - Assuming repayment by the Anticipated Repayment Dates and based on the leverage ratio as of October 3, 2021, principal payments on our long-term debt outstanding at October 3, 2021 for each of the next five fiscal years and thereafter are as follows (in thousands):\n2022 $ 894\n2023 571,610\n2024 372\n2025 38\n2026 272,964\nThereafter 446,648\n$ 1,292,526\n8. LEASES\nNature of leases - We own restaurant sites and we also lease restaurant sites from third parties. Some of these owned or leased sites are leased and/or subleased to franchisees. Initial terms of our real estate leases are generally 20 years, exclusive of options to renew, which are generally exercisable at our sole discretion for 1 to 20 years. In some instances, our leases have provisions for contingent rentals based upon a percentage of defined revenues. Many of our restaurants also have rent escalation clauses and require the payment of property taxes, insurance, and maintenance costs. Variable lease costs include contingent rent, cost-of-living index adjustments, and payments for additional rent such as real estate taxes, insurance, and common area maintenance, which are excluded from the measurement of the lease liability. We also lease certain restaurant and office equipment with initial terms generally ranging from 3 to 8 years. Our lease agreements do not contain any material residual value guarantees or material restrictive covenants.\nAs lessor, our leases and subleases primarily consist of restaurants that have been leased to franchisees subsequent to refranchising transactions. The lease descriptions, terms, variable lease payments and renewal options are generally the same as the lessee leases described above. Revenues from leasing arrangements with our franchisees are presented in “Franchise rental revenues” in the accompanying consolidated statements of earnings, and the related expenses are presented in “Franchise occupancy expenses.”\nCompany as lessee - Leased assets and liabilities consisted of the following as of October 3, 2021 and September 27, 2020 (in thousands):\nOctober 3,\n2021 September 27,\nAssets:\nOperating lease ROU assets $ 934,066 $ 904,548\nFinance lease ROU assets (1) 1,698 2,333\nTotal ROU assets $ 935,764 $ 906,881\nLiabilities:\nCurrent operating lease liabilities $ 150,636 $ 179,000\nCurrent finance lease liabilities (2) 894 818\nLong-term operating lease liabilities 809,191 776,094\nLong-term finance lease liabilities (2) 1,381 2,116\nTotal lease liabilities $ 962,102 $ 958,028\n________________________\n(1)Included in “Property and equipment, net” on our consolidated balance sheets.\n(2)Included in “Current maturities of long-term debt” and “Long-term debt, net of current maturities” on our consolidated balance sheets.\nThe following table presents the components of our lease costs in fiscal 2021 and 2020 (in thousands):\n2021 2020\nLease costs:\nFinance lease cost:\nAmortization of ROU assets (1) $ 807 $ 767\nInterest on lease liabilities (2) 89 110\nOperating lease cost (3) 194,149 190,461\nShort-term lease cost (3) 427 175\nVariable lease cost (3)(4) 43,498 40,798\n$ 238,970 $ 232,311\n____________________________\n(1)Included in “Depreciation and amortization” in our consolidated statement of earnings.\n(2)Included in “Interest expense, net” in our consolidated statement of earnings.\n(3)Operating lease, short-term and variable lease costs associated with franchisees and company-operated restaurants are included in “Franchise occupancy expenses” and “Occupancy and other,” respectively, in our consolidated statement of earnings. For our closed restaurants, these costs are included in “Impairment and other (gains) charges, net” and all other costs are included in “Selling, general and administrative expenses.”\n(4)Includes $38.0 million and $37.4 million in 2021 and 2020, respectively, of property taxes and common area maintenance costs which are reimbursed by sub-lessees.\nThe following table summarizes the components of rent expense in fiscal 2019, as accounted for under previous guidance (in thousands):\nMinimum rentals 184,587\nContingent rentals 2,255\nTotal rent expense 186,842\nThe following table presents supplemental information related to leases:\nOctober 3,\n2021 September 27,\nWeighted-average remaining lease term (in years):\nFinance leases 2.4 3.3\nOperating leases 9.0 8.3\nWeighted-average discount rate:\nFinance leases 3.6 % 3.5 %\nOperating leases 4.1 % 4.2 %\nThe following table presents as of October 3, 2021, the annual maturities of our lease liabilities (in thousands):\nFinance Leases Operating Leases\nFiscal year:\n2022 $ 961 $ 186,717\n2023 944 161,788\n2024 413 128,816\n2025 50 122,114\n2026 25 106,582\nThereafter 27 460,138\nTotal future lease payments (1) $ 2,420 $ 1,166,155\nLess: imputed interest (145) (206,328)\nPresent value of lease liabilities $ 2,275 $ 959,827\nLess current portion (894) (150,636)\nLong-term lease obligations $ 1,381 $ 809,191\n________________________\n(1)Total future lease payments include non-cancellable commitments of $2.4 million for finance leases and $1,000.0 million for operating leases.\nAssets recorded under finance leases are included in property and equipment, and consisted of the following at each fiscal year-end (in thousands):\n2021 2020\nBuildings 1,342 1,342\nEquipment 5,869 5,631\nLess accumulated amortization (5,513) (4,640)\n1,698 2,333\nThe following table includes supplemental cash flow and non-cash information related to our lessee leases (in thousands):\n2021 2020\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from operating leases $ 218,570 $ 190,303\nOperating cash flows from financing leases $ 89 $ 110\nFinancing cash flows from financing leases $ 829 $ 785\nSupplemental noncash information on lease liabilities arising from obtaining right-of-use assets:\nRight-of-use assets obtained in exchange for new operating lease obligations $ 186,621 $ 181,532\nRight-of-use assets obtained in exchange for new financing lease obligations $ 184 $ 132\nSale and leaseback transactions - In fiscal 2021, we sold two restaurant properties in sale and leaseback transactions for net proceeds of $3.9 million and recorded total gains of less than $0.1 million. The leases have been accounted for as operating leases and contain an initial term of 20 years.\nIn fiscal 2020, we completed two sale and leaseback transactions of our restaurant properties with one occurring during the first quarter of 2020 and the other occurring during the third quarter of 2020. In the first quarter of 2020, we completed a sale leaseback transaction of a multi-tenant commercial property in Los Angeles, California and leased back the parcel on which a company-operated restaurant is located. The Company received net proceeds of $17.4 million and recognized a $0.2 million loss on the sale. The initial term on the lease is 20 years and the lease has been accounted for as an operating lease. Under the other arrangement, we received net proceeds of $2.4 million on a restaurant property sold and recognized a loss of less than $0.1 million on the sale. The initial term of the lease is 17 years and has been accounted for as an operating lease.\nIn fiscal 2020, we also completed the sale of one of our corporate office buildings as we moved forward with our previously announced consolidation of our headquarters. We entered into a lease with the buyer to leaseback the property for up to 18 months with an option to terminate earlier without penalty, upon providing a 90-day notice. The net proceeds received on the sale were $20.6 million and the lease has been accounted for as an operating lease. A gain on the sale of $10.8 million was recognized and is presented within “Impairment and other (gains) charges, net” in our consolidated statement of earnings.\nCompany as lessor - The following table presents rental income (in thousands):\n2021 2020\nOwned Properties Leased Properties Total Owned Properties Leased Properties Total\nOperating lease income - franchise $ 20,132 $ 218,028 $ 238,160 $ 19,785 $ 216,015 $ 235,800\nVariable lease income - franchise 12,363 96,111 108,474 9,960 74,887 84,847\nFranchise rental revenues $ 32,495 $ 314,139 $ 346,634 $ 29,745 $ 290,902 $ 320,647\nOperating lease income - closed restaurants and other (1) $ - $ 6,027 $ 6,027 $ - $ 6,370 $ 6,370\n________________________\n(1)Primarily relates to closed restaurant properties included in “Impairment and other (gains) charges, net” in our consolidated statement of earnings.\nThe following table presents as of October 3, 2021, future minimum rental receipts for non-cancellable leases and subleases (in thousands):\nOctober 3,\nFiscal year:\n2022 $ 238,021\n2023 231,342\n2024 205,740\n2025 214,526\n2026 199,906\nThereafter 939,239\nTotal minimum rental receipts $ 2,028,774\nAssets held for lease and included in property and equipment consisted of the following at each fiscal year-end (in thousands):\nOctober 3,\n2021 September 27,\nLand $ 89,791 $ 88,187\nBuildings 782,450 801,730\nEquipment 223 589\n872,464 890,506\nLess accumulated depreciation (657,030) (650,812)\n$ 215,434 $ 239,694\n9. IMPAIRMENT AND OTHER (GAINS) CHARGES, NET\nImpairment and other (gains) charges, net, in the accompanying consolidated statements of earnings is comprised of the following in each fiscal year (in thousands):\n2021 2020 2019\nGains on disposition of property and equipment, net (1) (6,888) (9,768) (6,244)\nCosts of closed restaurants and other (2) 1,907 1,872 8,628\nAccelerated depreciation (3) 1,592 235 1,616\nRestructuring costs (4) 7 1,168 8,455\n$ (3,382) $ (6,493) $ 12,455\n________________________\n(1)In 2021, 2020 and 2019 gains on disposition of property and equipment primarily related to the sales of restaurant properties, in addition to the sale of one of our corporate office buildings in 2020.\n(2)In 2021, 2020 and 2019 costs of closed restaurants primarily include lease termination and impairment charges on future lease commitments and expected ancillary cost, net of anticipated sublease rentals, as a result of our decision to close restaurants, ongoing costs associated with closed restaurants, and canceled project costs.\n(3)In 2021, 2020, and 2019 accelerated depreciation primarily related to facility improvements, restaurant remodels, and information technology assets.\n(4)In 2020 and 2019 restructuring costs include charges resulting from a plan that management initiated to reduce our general and administrative costs, which was completed in the third quarter of 2020. In fiscal 2019, charges also include costs resulting from the exploration of strategic alternatives, which was concluded in the third quarter of 2019.\n10. DISCONTINUED OPERATIONS\nQdoba - In December 2017, we entered into a stock purchase agreement (the “Qdoba Purchase Agreement”) with the Buyer to sell all issued and outstanding shares of Qdoba. The Buyer completed the acquisition of Qdoba on March 21, 2018 (the “Qdoba Sale”).\nWe also entered into a Transition Services Agreement with the Buyer pursuant to which the Buyer received certain services (the “Services”) to enable it to operate the Qdoba business after the closing of the Qdoba Sale. The Services included information technology, finance and accounting, human resources, supply chain and other corporate support services. Under the Agreement, the Services were provided at cost for a period of up to 12 months, with two 3-month extensions available for certain services. As of September 21, 2019, we are no longer providing transition services to Qdoba. In 2019, we recorded $7.0 million in income related to the Services as a reduction of “Selling, general, and administrative expenses” in the consolidated statements of earnings.\nThe following table presents results of operations in periods which have been included in discontinued operations (in thousands):\n2020 2019\nTotal revenues $ - $ -\nTotal cost and (income) expense (1) (514) 173\nEarnings (losses) before income taxes 514 (173)\nIncome tax expense (benefit) (2) 144 (2,863)\nEarnings from discontinued operations, net of income taxes $ 370 $ 2,690\n________________________\n(1)Amounts in 2020 and 2019 include resolutions of certain contingencies that existed at the date of sale which were insignificant in nature.\n(2) In fiscal 2019, the Company entered into a bilateral California election with Quidditch Acquisition, Inc. to retroactively treat the divestment of Qdoba Restaurant Corporation on March 21, 2018 as a sale of assets instead of a stock sale for income tax purposes. This election reduced the Company’s fiscal year 2018 California tax liability on the divestment by $2.8 million.\n11. INCOME TAXES\nIncome taxes consist of the following in each fiscal year (in thousands):\n2021 2020 2019\nCurrent:\nFederal $ 36,051 $ 19,721 $ 14,683\nState 11,793 7,844 5,242\n47,844 27,565 19,925\nDeferred:\nFederal 4,440 4,625 3,750\nState 3,568 537 350\n8,008 5,162 4,100\nIncome tax expense from continuing operations $ 55,852 $ 32,727 $ 24,025\nIncome tax expense (benefit) from discontinued operations $ - $ 144 $ (2,863)\nA reconciliation of the federal statutory income tax rate to our effective tax rate for continuing operations is as follows:\n2021 2020 2019\nIncome tax expense at federal statutory rate 21.0 % 21.0 % 21.0 %\nState income taxes, net of federal tax benefit 5.1 % 5.3 % 5.3 %\nStock compensation excess tax benefit (0.5) % (0.4) % (0.1) %\nBenefit of jobs tax credits, net of valuation allowance (0.1) % (0.5) % (0.3) %\nRelease of federal tax liability - % - % (0.6) %\nAdjustment to state tax provision 0.7 % - % (0.9) %\nBenefit related to COLIs (1.5) % (0.9) % (1.0) %\nTermination of interest rate swaps - % - % (2.6) %\nOfficers’ compensation limitation 0.5 % 2.2 % 1.1 %\nOther, net - % 0.1 % (1.1) %\n25.2 % 26.8 % 20.8 %\nThe tax effects of temporary differences that give rise to significant portions of deferred tax assets and deferred tax liabilities at each fiscal year-end are presented below (in thousands):\n2021 2020\nDeferred tax assets:\nOperating and finance lease liabilities $ 237,509 $ 234,926\nAccrued defined benefit pension and postretirement benefits 28,837 44,436\nDeferred income 12,083 12,921\nImpairment 6,957 8,895\nAccrued insurance 5,389 6,500\nOther reserves and allowances 4,050 2,440\nShare-based compensation 4,039 4,143\nAccrued incentive compensation 3,455 2,585\nTax loss and tax credit carryforwards 3,129 4,273\nAccrued compensation expense 710 672\nOther, net 3,424 2,364\nTotal gross deferred tax assets 309,582 324,155\nValuation allowance (1,349) (2,104)\nTotal net deferred tax assets 308,233 322,051\nDeferred tax liabilities:\nOperating and finance lease ROU assets (242,038) (235,373)\nIntangible assets (11,349) (11,437)\nProperty and equipment, principally due to differences in depreciation (1,036) (1,781)\nOther (2,293) (1,138)\nTotal gross deferred tax liabilities (256,716) (249,729)\nNet deferred tax assets $ 51,517 $ 72,322\nDeferred tax assets as of October 3, 2021 include state net operating loss carryforwards of approximately $16.6 million, of which $12.1 million has an indefinite carryforward. The remainder will expire at various times between 2022 and 2038. At October 3, 2021, we recorded a valuation allowance of $1.3 million related to state tax credits, which decreased from the $2.1 million at September 27, 2020 due to the release of the valuation allowance on California Enterprise Zone Credits and state net operating loss carryforwards. We believe it is more likely than not that these credit carryforwards will not be realized and that all other deferred tax assets will be realized through future taxable income or alternative tax strategies.\nThe major jurisdictions in which the Company files income tax returns include the United States and states in which we operate that impose an income tax. The federal statutes of limitations have not expired for fiscal years 2018 and forward. The statutes of limitations for California and Texas, which constitute the Company’s major state tax jurisdictions, have not expired for fiscal years 2017 and forward.\n12. RETIREMENT PLANS\nWe sponsor programs that provide retirement benefits to our employees. These programs include defined contribution plans, defined benefit pension plans, and postretirement healthcare plans.\nDefined contribution plans - We maintain a qualified savings plan pursuant to Section 401(k) of the Internal Revenue Code (“IRC”). The plan allows all employees who have satisfied the service requirements and reached age 21 to defer a percentage of their pay on a pre-tax basis. Beginning January 1, 2016, we match 100% of the first 4% of compensation deferred by the participant. A participant’s right to Company contributions vest immediately. Our contributions under this plan were $1.6 million in fiscal 2021, and $1.6 million and $1.7 million in fiscal 2020 and 2019, respectively.\nWe also maintain an unfunded, non-qualified deferred compensation plan for key executives and other members of management whose compensation deferrals or company matching contributions to the qualified savings plan are limited due to IRC rules. Effective January 1, 2016, this non-qualified plan was amended to replace the company matching contribution with an annual restoration match that is intended to “restore” up to the full match for participants whose elective deferrals (and related company matching contributions) to the qualified savings plan were limited due to IRC rules. A participant’s right to the Company restoration match vests immediately. This plan allows participants to defer up to 50% of their salary and 85% of their bonus, on a pre-tax basis. Our contributions under the non-qualified deferred compensation plan were less than $0.1 million in fiscal 2021, $0.3 million and $0.2 million in fiscal 2020 and 2019, respectively.\nDefined benefit pension plans - We sponsor two defined benefit pension plans, a “Qualified Plan” covering substantially all full-time employees hired prior to January 1, 2011, and an unfunded supplemental executive retirement plan (“SERP”) which provides certain employees additional pension benefits and was closed to new participants effective January 1, 2007. In fiscal 2011, the Board of Directors approved changes to our Qualified Plan whereby participants will no longer accrue benefits effective December 31, 2015. Benefits under both plans are based on the employees’ years of service and compensation over defined periods of employment.\nIn the fiscal fourth quarter of 2019, the Company amended its Qualified Plan to add a limited lump sum payment window whereby certain terminated participants with a vested pension benefit could elect to receive either an immediate lump sum or a monthly annuity payment of their accrued benefit. The offering period began September 16, 2019 and ended October 31, 2019. The participants that elected a lump sum benefit under the program were paid in December 2019, which triggered settlement accounting. As a result of the offering, the Company’s Qualified Plan paid $122.3 million from its plan assets to those who accepted the offer, thereby reducing the plan’s pension benefit obligation (“PBO”). The transaction had no cash impact to the Company but did result in a non-cash settlement charge of $38.6 million in the first quarter of fiscal 2020. Routine lump sum payments made in the second, third and fourth quarters of fiscal 2020 resulted in additional non-cash settlement charges totaling $0.6 million.\nPostretirement healthcare plans - We also sponsor two healthcare plans, closed to new participants, that provide postretirement medical benefits to certain employees who have met minimum age and service requirements. The plans are contributory, with retiree contributions adjusted annually, and contain other cost-sharing features such as deductibles and coinsurance.\nObligations and funded status - The following table provides a reconciliation of the changes in benefit obligations, plan assets, and funded status of our retirement plans for each fiscal year (in thousands):\nQualified Plan SERP Postretirement Health Plans\n2021 2020 2021 2020 2021 2020\nChange in benefit obligation:\nObligation at beginning of year $ 412,573 $ 521,931 $ 78,971 $ 79,893 $ 20,965 $ 25,632\nInterest cost 12,558 13,377 2,169 2,499 563 807\nParticipant contributions - - - - 112 106\nActuarial (gain) loss (785) 14,498 (672) 1,739 (3,525) (4,391)\nBenefits paid (14,293) (12,980) (5,243) (5,160) (1,044) (1,246)\nSettlements - (124,253) - - - -\nOther - - - - 91 57\nObligation at end of year $ 410,053 $ 412,573 $ 75,225 $ 78,971 $ 17,162 $ 20,965\nChange in plan assets:\nFair value at beginning of year $ 365,510 $ 476,194 $ - $ - $ - $ -\nActual return on plan assets 58,491 26,549 - - - -\nParticipant contributions - - - - 112 106\nEmployer contributions - - 5,243 5,160 841 1,083\nBenefits paid (14,293) (12,980) (5,243) (5,160) (1,044) (1,246)\nSettlements - (124,253) - - - -\nOther - - - - 91 57\nFair value at end of year $ 409,708 $ 365,510 $ - $ - $ - $ -\nUnfunded status at end of year $ (345) $ (47,063) $ (75,225) $ (78,971) $ (17,162) $ (20,965)\nAmounts recognized on the balance sheet:\nCurrent liabilities $ - $ - $ (5,216) $ (5,223) $ (1,115) $ (1,243)\nNoncurrent liabilities (345) (47,063) (70,009) (73,748) (16,047) (19,722)\nTotal liability recognized $ (345) $ (47,063) $ (75,225) $ (78,971) $ (17,162) $ (20,965)\nAmounts in AOCI not yet reflected in net periodic benefit cost:\nUnamortized actuarial loss (gain), net $ 108,922 $ 152,370 $ 32,475 $ 34,890 $ (7,359) $ (4,174)\nUnamortized prior service cost - - 53 72 - -\nTotal $ 108,922 $ 152,370 $ 32,528 $ 34,962 $ (7,359) $ (4,174)\nOther changes in plan assets and benefit obligations recognized in OCI:\nNet actuarial (gain) loss $ (39,936) $ 7,527 $ (672) $ 1,739 $ (3,526) $ (4,391)\nPension settlement costs - (39,218) - - - -\nAmortization of actuarial (loss) gain (3,510) (3,644) (1,743) (1,652) 341 (18)\nAmortization of prior service cost - - (19) (85) - -\nTotal recognized in OCI (43,446) (35,335) (2,434) 2 (3,185) (4,409)\nNet periodic benefit (credit) cost and other losses (3,272) 36,661 3,931 4,236 222 825\nTotal recognized in comprehensive income $ (46,718) $ 1,326 $ 1,497 $ 4,238 $ (2,963) $ (3,584)\nAmounts in AOCI expected to be amortized in fiscal 2022 net periodic benefit cost:\nNet actuarial loss (gain) $ 2,193 $ 1,666 $ (640)\nPrior service cost - 19 -\nTotal $ 2,193 $ 1,685 $ (640)\nAdditional year-end pension plan information - The PBO is the actuarial present value of benefits attributable to employee service rendered to date, including the effects of estimated future pay increases. The accumulated benefit obligation (“ABO”) also reflects the actuarial present value of benefits attributable to employee service rendered to date but does not include the effects of estimated future pay increases. Therefore, the ABO as compared to plan assets is an indication of the assets currently available to fund vested and nonvested benefits accrued through the end of the fiscal year. The funded status is measured as the difference between the fair value of a plan’s assets and its PBO.\nAs of October 3, 2021 and September 27, 2020, the Qualified Plan’s ABO exceeded the fair value of its plan assets. The SERP is an unfunded plan and, as such, had no plan assets as of October 3, 2021 and September 27, 2020. The following sets forth the PBO, ABO, and fair value of plan assets of our pension plans as of the measurement date in each fiscal year (in thousands):\n2021 2020\nQualified Plan:\nProjected benefit obligation $ 410,053 $ 412,573\nAccumulated benefit obligation $ 410,053 $ 412,573\nFair value of plan assets $ 409,708 $ 365,510\nSERP:\nProjected benefit obligation $ 75,225 $ 78,971\nAccumulated benefit obligation $ 75,225 $ 78,971\nFair value of plan assets $ - $ -\nNet periodic benefit cost - The components of the fiscal year net periodic benefit cost were as follows (in thousands):\n2021 2020 2019\nQualified Plan:\nInterest cost $ 12,558 $ 13,377 $ 19,825\nExpected return on plan assets (19,340) (19,578) (26,334)\nPension settlements - 39,218 -\nActuarial loss 3,510 3,644 2,754\nNet periodic benefit (credit) cost $ (3,272) $ 36,661 $ (3,755)\nSERP:\nInterest cost $ 2,169 $ 2,499 $ 3,080\nActuarial loss 1,743 1,652 1,207\nAmortization of unrecognized prior service cost 19 85 115\nNet periodic benefit cost $ 3,931 $ 4,236 $ 4,402\nPostretirement health plans:\nInterest cost $ 563 $ 807 $ 997\nActuarial (gain) loss (341) 18 (159)\nNet periodic benefit cost $ 222 $ 825 $ 838\nPrior service costs are amortized on a straight-line basis from date of participation to full eligibility. Unrecognized gains or losses are amortized using the “corridor approach” under which the net gain or loss in excess of 10% of the greater of the PBO or the market-related value of the assets, if applicable, is amortized. For our Qualified Plan, actuarial losses are amortized over the average future expected lifetime of all participants expected to receive benefits. For our SERP, actuarial losses are amortized over the expected remaining future lifetime for inactive participants, and for our postretirement health plans, actuarial losses are amortized over the expected remaining future lifetime of inactive participants expected to receive benefits.\nAssumptions - We determine our actuarial assumptions on an annual basis. In determining the present values of our benefit obligations and net periodic benefit costs as of and for the fiscal years ended October 3, 2021, September 27, 2020, and September 29, 2019, we used the following weighted-average assumptions:\n2021 2020 2019\nAssumptions used to determine benefit obligations (1):\nQualified Plan:\nDiscount rate 3.11% 3.10% 3.36%\nSERP:\nDiscount rate 2.99% 2.84% 3.24%\nRate of future pay increases (2) N/A N/A 3.50%\nPostretirement health plans:\nDiscount rate 2.95% 2.77% 3.24%\nAssumptions used to determine net periodic benefit cost (3):\nQualified Plan:\nDiscount rate (4) 3.10% 3.36% 4.40%\nLong-term rate of return on assets (5) 5.40% 5.80% 5.85%\nSERP:\nDiscount rate 2.84% 3.24% 4.37%\nRate of future pay increases (2) N/A 3.50% 3.50%\nPostretirement health plans:\nDiscount rate 2.77% 3.24% 4.38%\n________________________\n(1)Determined as of end of year.\n(2)Rate is not applicable as there are no active employees as of fiscal year end 2020 and 2021.\n(3)Determined as of beginning of year.\n(4)Remeasurements were performed in the first, second, and third quarters of fiscal 2020 using 3.61%, 3.38%, and 3.13% respectively.\n(5)Remeasurements were performed in the first, second, and third quarters of fiscal 2020 using 5.9%, 5.2%, and 5.4% respectively.\nThe assumed discount rates were determined by considering the average of pension yield curves constructed of a population of high-quality bonds with a Moody’s or Standard and Poor’s rating of “AA” or better whose cash flow from coupons and maturities match the year-by-year projected benefit payments from the plans. As benefit payments typically extend beyond the date of the longest maturing bond, cash flows beyond 30 years were discounted back to the 30th year and then matched like any other payment.\nThe assumed expected long-term rate of return on assets is the weighted-average rate of earnings expected on the funds invested or to be invested to provide for the pension obligations. The long-term rate of return on assets was determined taking into consideration our projected asset allocation and economic forecasts prepared with the assistance of our actuarial consultants.\nThe assumed discount rate and expected long-term rate of return on assets have a significant effect on amounts reported for our pension and postretirement plans. If the discount rate and long-term rate of return used were decreased by a quarter percentage point, fiscal 2021 earnings before income taxes would have decreased by less than $0.1 million and increased by $0.9 million, respectively.\nThe assumed average rate of compensation increase is the average annual compensation increase expected over the remaining employment periods for the participating employees. For our Qualified Plan, no future pay increases were included in our benefit obligation assumptions as, effective December 31, 2015, our plan participants no longer accrue benefits.\nFor measurement purposes, the weighted-average assumed health care cost trend rates for our postretirement health plans were as follows for each fiscal year:\n2021 2020 2019\nHealthcare cost trend rate for next year:\nParticipants under age 65 6.50% 6.75% 7.00%\nParticipants age 65 or older 6.00% 6.25% 6.50%\nRate to which the cost trend rate is assumed to decline:\nParticipants under age 65 4.50% 4.50% 4.50%\nParticipants age 65 or older 4.50% 4.50% 4.50%\nYear the rate reaches the ultimate trend rate:\nParticipants under age 65 2030 2030 2030\nParticipants age 65 or older 2028 2028 2028\nThe assumed healthcare cost trend rate represents our estimate of the annual rates of change in the costs of the healthcare benefits currently provided by our postretirement plans. The healthcare cost trend rate implicitly considers estimates of healthcare inflation, changes in healthcare utilization and delivery patterns, technological advances and changes in the health status of the plan participants. The healthcare cost trend rate assumption has a significant effect on the amounts reported. For example, a 1.0% change in the assumed healthcare cost trend rate would have the following effect on the fiscal 2021 net periodic benefit cost and end of year PBO (in thousands):\n1% Point\nIncrease 1% Point\nDecrease\nTotal interest and service cost $ 53 $ (46)\nPostretirement benefit obligation $ 1,604 $ (1,405)\nPlan assets - Our investment philosophy is to (1) protect the corpus of the fund; (2) establish investment objectives that will allow the market value to exceed the present value of the vested and unvested liabilities over time; while (3) obtaining adequate investment returns to protect benefits promised to the participants and their beneficiaries. Our asset allocation strategy utilizes multiple investment managers in order to maximize the plan’s return while minimizing risk. We regularly monitor our asset allocation, and senior financial management and the Finance Committee of the Board of Directors review performance results quarterly. We continually review our target asset allocation for our Qualified Plan and when changes are made, we reallocate our plan assets over a period of time, as deemed appropriate by senior financial management, to achieve our target asset allocation. Our plan asset allocation at the end of fiscal 2021 and target allocations were as follows:\n2021 Target Minimum Maximum\nCash & cash equivalents 1% 1% -% -%\nDomestic equities 16% 16% 8% 24%\nInternational equities 15% 16% 8% 24%\nCore fixed funds 49% 48% 43% 53%\nHigh yield 2% 3% -% 6%\nAlternative investments 7% 6% -% 12%\nReal estate 5% 5% -% 10%\nReal return bonds 5% 5% -% 12%\n100% 100%\nThe Company measures its defined benefit plan assets and obligations as of the month-end date closest to its fiscal year end, which is a practical expedient under FASB authoritative guidance. The fair values of the Qualified Plan’s assets by asset category are as follows (in thousands):\nTotal Quoted Prices\nin Active\nMarkets for\nIdentical\n(Level 1) Significant\nOther\nObservable\nInputs\n(Level 2) Significant\nUnobservable\nInputs\n(Level 3)\nItems Measured at Fair Value at September 30, 2021:\nAsset Category:\nCash and cash equivalents (1) $ 1,969 $ - $ 1,969 $ -\nEquity:\nU.S. (2) 66,921 66,921 - -\nInternational (3),(4) 63,087 31,128 - -\nFixed income:\nInvestment grade (5) 219,295 20,701 198,594 -\nHigh yield (6) 10,156 10,156 - -\nAlternatives (4),(7) 26,519 - - -\nReal estate (4),(8) 21,761 - - -\n$ 409,708 $ 128,906 $ 200,563 $ -\nItems Measured at Fair Value at September 30, 2020:\nAsset Category:\nCash and cash equivalents (1) $ 3,665 $ - $ 3,665 $ -\nEquity:\nU.S. (2) 83,676 83,676 - -\nInternational (3),(4) 81,228 40,319 - -\nFixed income:\nInvestment grade (5) 126,630 3,006 123,624 -\nHigh yield (6) 9,270 9,270 - -\nAlternatives (4),(7) 29,375 - - -\nReal estate (4),(8) 31,666 - - -\n$ 365,510 $ 136,271 $ 127,289 $ -\n________________________\n(1)Cash and cash equivalents are comprised of commercial paper, short-term bills and notes, and short-term investment funds, which are valued at quoted prices in active markets for similar securities.\n(2)U.S. equity securities are comprised of investments in common stock of U.S. companies for total return purposes. These investments are valued by the trustee at closing prices from national exchanges on the valuation date.\n(3)International equity securities are comprised of investments in common stock of companies located outside of the U.S. for total return purposes. These investments are valued by the trustee at closing prices from national exchanges on the valuation date, or the values are adjusted as a result of market movements following the close of local trading using inputs to models that are observable either directly or indirectly. The portion of these investments that are measured at fair value using the net asset value per share practical expedient (see note 4 below) can be redeemed on a monthly basis.\n(4)Certain investments that are measured at fair value using the net asset value per share (or its equivalent) practical expedient have not been categorized in the fair value hierarchy. The fair value amounts presented in this table are intended to permit reconciliation of the fair value hierarchy to the amounts presented in the statement of financial position.\n(5)Investment grade fixed income consists of debt obligations either issued by the U.S. government or have a rating of BBB- / Baa or higher assigned by a major credit rating agency. These investments are valued based on unadjusted quoted market prices (Level 1), or based on quoted prices in inactive markets, or whose values are based on models, but the inputs to those models are observable either directly or indirectly (Level 2).\n(6)High yield fixed income consists primarily of debt obligations that have a rating of below BBB- / Baa or lower assigned by a major credit rating agency. These investments are valued based on unadjusted quoted market prices.\n(7)Alternative investments consist primarily of an investment in asset classes other than stocks, bonds, and cash. Alternative investments can include commodities, hedge funds, private equity, managed futures, and derivatives. These investments are valued based on unadjusted quoted market prices and can be redeemed on a bi-monthly basis.\n(8)Real estate is investments in a real estate collective trust for purposes of total return. These investments are valued based on prices or valuation techniques that require inputs that are both unobservable and significant to the overall fair value measurement. These investments can be redeemed on a quarterly basis.\nFuture cash flows - Our policy is to fund our plans at or above the minimum required by law. As of the date of our last actuarial funding valuation, there was no minimum requirement. We do not anticipate making any contributions to our Qualified Plan in fiscal 2022. Contributions expected to be paid in the next fiscal year, the projected benefit payments for each of the next five fiscal years, and the total aggregate amount for the subsequent five fiscal years are as follows (in thousands):\nDefined Benefit Plans Postretirement\nHealth Plans\nEstimated net contributions during fiscal 2022 $ 5,216 $ 1,132\nEstimated future year benefit payments during fiscal years:\n2022 $ 20,051 $ 1,132\n2023 $ 20,092 $ 1,152\n2024 $ 20,302 $ 1,168\n2025 $ 20,746 $ 1,179\n2026 $ 21,295 $ 1,182\n2027-2031 $ 114,002 $ 5,708\nWe will continue to evaluate contributions to our Qualified Plan based on changes in pension assets as a result of asset performance in the current market and economic environment. Expected benefit payments are based on the same assumptions used to measure our benefit obligations at October 3, 2021 and include estimated future employee service, if applicable.\n13. SHARE-BASED EMPLOYEE COMPENSATION\nStock incentive plans - We offer share-based compensation plans to attract, retain, and motivate key officers, employees, and non-employee directors to work toward the financial success of the Company.\nOur stock incentive plans are administered by the Compensation Committee of the Board of Directors and have been approved by the stockholders of the Company. The terms and conditions of our share-based awards are determined by the Compensation Committee for each award date and may include provisions for the exercise price, expirations, vesting, restriction on sales, and forfeitures, as applicable. We issue new shares to satisfy stock issuances under our stock incentive plans.\nOur Amended and Restated 2004 Stock Incentive Plan authorizes the issuance of up to 11,600,000 common shares in connection with the granting of stock options, stock appreciation rights, restricted stock purchase rights, restricted stock bonuses, restricted stock units, or performance units to our employees and directors. There were 1,755,983 shares of common stock available for future issuance under this plan as of October 3, 2021.\nWe also maintain a deferred compensation plan for non-management directors under which those who are eligible to receive fees or retainers may choose to defer receipt of their compensation. The deferred amounts are converted to stock equivalents. The plan requires settlement in shares of our common stock based on the number of stock equivalents and dividend equivalents at the time of a participant’s separation from the Board of Directors. This plan provides for the issuance of up to 350,000 shares of common stock in connection with the crediting of stock equivalents. There were 142,918 shares of common stock available for future issuance under this plan as of October 3, 2021.\nCompensation expense - The components of share-based compensation expense, included within “Selling, general, and administrative expenses” in our consolidated statement of earnings, in each fiscal year are as follows (in thousands):\n2021 2020 2019\nNonvested stock units $ 2,969 $ 3,526 $ 5,458\nStock options 25 351 936\nPerformance share awards 830 254 1,417\nNon-management directors’ deferred compensation 224 263 263\nTotal share-based compensation expense $ 4,048 $ 4,394 $ 8,074\nNonvested restricted stock units - Nonvested restricted stock units (“RSUs”) are generally issued to employees and non-employee directors. Grants to executive officers of time-vesting RSUs vest ratably over four years and are subject to a stock holding requirement of 50% of after-tax net shares resulting from the vesting of RSUs and must be held until termination of service. There were 38,650 of such RSUs outstanding as of October 3, 2021. RSUs issued to non-management directors vest 12 months from the date of grant, or upon termination of board service, including RSUs for which the director elected to defer receipt until termination of board service, and totaled 66,250 units outstanding as of October 3, 2021. RSUs issued to certain other employees either cliff vest or vest ratably over three years and totaled 36,297 units outstanding as of October 3, 2021. These awards are amortized to compensation expense over the estimated vesting period based upon the fair value of our common stock on the award date discounted by the present value of the expected dividend stream over the vesting period.\nThe following is a summary of RSU activity for fiscal 2021:\nShares Weighted-\nAverage Grant\nDate Fair\nValue\nRSUs outstanding at September 27, 2020 175,141 $ 59.65\nGranted 66,811 $ 95.44\nReleased (81,968) $ 52.77\nForfeited (18,787) $ 87.70\nRSUs outstanding at October 3, 2021 141,197 $ 76.84\nAs of October 3, 2021, there was approximately $4.4 million of total unrecognized compensation cost related to RSUs, which is expected to be recognized over a weighted-average period of 2.3 years. The weighted-average grant date fair value of awards granted was $95.44, $73.94, and $86.08 in fiscal years 2021, 2020, and 2019, respectively. In fiscal years 2021, 2020, and 2019, the total fair value of RSUs that vested and were released was $4.3 million, $8.7 million, and $4.7 million, respectively.\nModification of RSU awards - On April 16, 2020, we entered into a Retention, Transition and Separation Agreement with our former Chairman and Chief Executive Officer, which sets forth the terms of his transition and certain benefits he is eligible to receive, pro-rated through the duration of the transition period, which included vesting of his final tranche of unvested restricted stock units remaining under his November 2015 restricted stock unit award scheduled to vest in November 2020. Consequently, 23,128 shares vested on his last day of employment on July 31, 2020. This was accounted for as an equity award modification under ASC Topic 718, and as the fair value of the modified award was less than previously recognized compensation, no incremental compensation costs were recorded by the Company.\nStock options - Option grants have contractual terms of seven years and employee options vest over a three-year period. Options may vest sooner upon retirement from the Company for employees meeting certain age and years of service thresholds. All option grants provide for an option exercise price equal to the closing market value of the common stock on the date of grant.\nThe following is a summary of stock option activity for fiscal 2021:\nShares Weighted-\nAverage\nExercise\nPrice Weighted-\nAverage\nRemaining\nContractual\nTerm (Years) Aggregate\nIntrinsic\nValue\n(in thousands)\nOptions outstanding at September 27, 2020 207,463 $ 91.85\nGranted - N/A\nExercised (75,028) $ 88.60\nForfeited (15,100) $ 76.29\nExpired (84,218) $ 97.31\nOptions outstanding at October 3, 2021 33,117 $ 92.44 3.27 $ 315\nOptions exercisable at October 3, 2021 27,109 $ 96.26 2.84 $ 169\nThe aggregate intrinsic value in the table above is the amount by which the current market price of our stock on October 3, 2021 exceeds the weighted-average exercise price.\nWe use a valuation model to determine the fair value of options granted that requires the input of highly subjective assumptions, including the expected volatility of the stock price. The following table presents the weighted-average assumptions used for stock option grants in each fiscal year, along with the related weighted-average grant date fair value:\n2021 (1)\n2020 2019 (1)\nRisk-free interest rate N/A 1.7% N/A\nExpected dividends yield N/A 2.1% N/A\nExpected stock price volatility N/A 28.1% N/A\nExpected life of options (in years) N/A 3.47 N/A\nWeighted-average grant date fair value N/A $13.97 N/A\n________________________\n(1)No stock option awards were granted in fiscal 2021 or fiscal 2019.\nThe risk-free interest rate was determined by a yield curve of risk-free rates based on published U.S. Treasury spot rates in effect at the time of grant and has a term equal to the expected life of the related options. The dividend yield assumption is based on the Company’s history and expectations of dividend payouts at the grant date. The expected stock price volatility in all years represents the Company’s historical volatility. The expected life of the options represents the period of time the options are expected to be outstanding and is based on historical trends.\nAs of October 3, 2021, there was less than $0.1 million of total unrecognized compensation cost related to stock options grants that is expected to be recognized over a weighted-average period of 1.2 years. The total intrinsic value of stock options exercised was $1.6 million, $0.7 million, and $0.5 million in fiscal years 2021, 2020, and 2019, respectively.\nPerformance share awards - Performance share awards, granted in the form of stock units, represent a right to receive a certain number of shares of common stock based on the achievement of corporate performance goals and continued employment during the vesting period. Performance share awards issued to executives vest at the end of a three-year period and vested amounts may range from 0% to a maximum of 150% of targeted amounts depending on the achievement of performance measures at the end of a three-year period. If the awardee ceases to be employed by the Company prior to the last day of the performance period due to retirement, disability, or death, the performance share awards become vested pro-rata based on the number of full accounting periods the awardee was continuously employed by the Company during the performance period. The expected cost of the shares is based on the fair value of our stock on the date of grant and is reflected over the vesting period with a reduction for estimated forfeitures. These awards may be settled in cash or shares of common stock at the election of the Company on the date of grant. It is our intent to settle these awards with shares of common stock.\nThe following is a summary of performance share award activity for fiscal 2021:\nShares Weighted-\nAverage Grant\nDate Fair\nValue\nPerformance share awards outstanding at September 27, 2020 25,042 $ 63.59\nGranted 28,166 $ 88.88\nIssued (8,717) $ 63.61\nForfeited (11,026) $ 82.49\nPerformance adjustments 1,632 $ 82.80\nPerformance share awards outstanding at October 3, 2021 35,097 $ 79.92\nAs of October 3, 2021, there was approximately $1.4 million of total unrecognized compensation cost related to performance share awards, which is expected to be recognized over a weighted-average period of 2.0 years. The weighted-average grant date fair value of awards granted was $88.88, $81.02, and $84.60 in fiscal years 2021, 2020, and 2019, respectively. The total fair value of awards that became fully vested during fiscal years 2021, 2020, and 2019 was $0.6 million, $0.5 million, and $2.1 million, respectively.\nNon-management directors’ deferred compensation - All awards outstanding under our directors’ deferred compensation plan are accounted for as equity-based awards and deferred amounts are converted into stock equivalents based on a per share price equal to the average of the closing price of our common stock for the 10 trading days immediately preceding the date the deferred compensation is credited to the director’s account. During fiscal 2021 and 2019, no shares of common stock were issued in connection with director retirements. During fiscal 2020, 204 shares of common stock were issued in connection with director retirements with a fair value of less than $0.1 million.\nThe following is a summary of the stock equivalent activity for fiscal 2021:\nStock\nEquivalents Weighted-\nAverage Grant\nDate Fair\nValue\nStock equivalents outstanding at September 27, 2020 105,876 $ 40.96\nDeferred directors’ compensation 1,334 $ 108.70\nDividend equivalents 2,253 $ 102.80\nStock equivalents outstanding at October 3, 2021 109,463 $ 43.06\n14. STOCKHOLDERS’ DEFICIT\nRepurchases of common stock - In fiscal 2021, the Company purchased 1.9 million shares of its common stock for an aggregate cost of $200.0 million. As of October 3, 2021, there was no remaining amount under share repurchase programs authorized by the Board of Directors.\nDividends - In fiscal 2021, the Board of Directors declared four cash dividends of $0.40, $0.40, $0.44, and $0.44, respectively, totaling $37.6 million. Future dividends are subject to approval by our Board of Directors.\n15. AVERAGE SHARES OUTSTANDING\nOur basic earnings per share calculation is computed based on the weighted-average number of common shares outstanding. Our diluted earnings per share calculation is computed based on the weighted-average number of common shares outstanding adjusted by the number of additional shares that would have been outstanding had the potentially dilutive common shares been issued. Potentially dilutive common shares include nonvested stock awards and units, stock options, and non-management director stock equivalents. Performance share awards are included in the average diluted shares outstanding each period if the performance criteria have been met at the end of the respective periods.\nThe following table reconciles basic weighted-average shares outstanding to diluted weighted-average shares outstanding in each fiscal year (in thousands):\n2021 2020 2019\nWeighted-average shares outstanding - basic 22,402 23,125 25,823\nEffect of potentially dilutive securities:\nNonvested stock awards and units 62 137 211\nStock options 9 - 10\nPerformance share awards 5 7 24\nWeighted-average shares outstanding - diluted 22,478 23,269 26,068\nExcluded from diluted weighted-average shares outstanding:\nAntidilutive 29 318 186\nPerformance conditions not satisfied at the end of the period 25 14 65\n16. COMMITMENTS AND CONTINGENCIES\nPurchase commitments - We have entered into long-term beverage agreements with The Coca-Cola Company and Dr. Pepper / Seven Up, Inc., which provide fountain products and certain marketing support funding to the Company and its franchisees. These agreements require minimum purchases of fountain beverage syrup, by the Company and its franchisees at agreed upon prices until the total volume commitments have been reached. The volume commitments are not subject to any time limit. As of October 3, 2021, we estimate that it will take approximately four years to complete the Coca-Cola purchase commitment and approximately five years to complete the Dr. Pepper purchase commitment. The Company estimates future annual purchases under these agreements to be approximately $51.3 million as of October 3, 2021 based on the expected ratio of usage at company-operated to franchise restaurants.\nWe also have entered into various arrangements with vendors providing information technology services with no early termination fees. The Company’s unconditional purchase obligations on these contracts total approximately $7.3 million over the next two years.\nLegal matters - We assess contingencies, including litigation contingencies, to determine the degree of probability and range of possible loss for potential accrual in our financial statements. An estimated loss contingency is accrued in the financial statements if it is probable that a liability has been incurred and the amount of the loss can be reasonably estimated. Because litigation is inherently unpredictable, assessing contingencies is highly subjective and requires judgments about future events. When evaluating litigation contingencies, we may be unable to provide a meaningful estimate due to a number of factors, including the procedural status of the matter in question, the availability of appellate remedies, insurance coverage related to the claim or claims in question, the presence of complex or novel legal theories, and the ongoing discovery and development of information important to the matter. In addition, damage amounts claimed in litigation against us may be unsupported, exaggerated, or unrelated to possible outcomes, and as such are not meaningful indicators of our potential liability or financial exposure. We regularly review contingencies to determine the adequacy of the accruals and related disclosures. The ultimate amount of loss may differ from these estimates. As of October 3, 2021 and September 27, 2020, the Company had recorded aggregate liabilities of $7.5 million and $3.8 million, respectively, within “Accrued liabilities” on our consolidated balance sheets for all matters including those described below, that were probable and reasonably estimable. We believe that the ultimate determination of liability in connection with legal claims pending against us, if any, in excess of amounts already provided for such matters in the consolidated financial statements, will not have a material adverse effect on our business, our annual results of operations, liquidity or financial position.\nGessele v. Jack in the Box Inc. - In August 2010, five former employees instituted litigation in federal court in Oregon alleging claims under the federal Fair Labor Standards Act and Oregon wage and hour laws. The plaintiffs alleged that the Company failed to pay non-exempt employees for certain meal breaks and improperly made payroll deductions for shoe purchases and for workers’ compensation expenses, and later added additional claims relating to timing of final pay and related wage and hour claims involving employees of a franchisee. In 2016, the court dismissed the federal claims and those relating to franchise employees. In June 2017, the court granted class certification with respect to state law claims of improper deductions and late payment of final wages. The parties participated in a voluntary mediation on March 16, 2020, but the matter did not settle. The plaintiffs recently filed a motion for reconsideration of the court’s prior denial of class certification regarding meal and rest break claims, which remains pending before the court. The Company continues to dispute liability and the plaintiffs’ damages calculations and will continue to vigorously defend against the lawsuit.\nOther legal matters - In addition to the matter described above, we are subject to normal and routine litigation brought by former or current employees, customers, franchisees, vendors, landlords, shareholders, or others. We intend to defend ourselves in any such matters. Some of these matters may be covered, at least in part, by insurance or other third-party indemnity obligation. We record receivables from third party insurers when recovery has been determined to be probable.\nLease guarantees - We remain contingently liable for certain leases relating to our former Qdoba business which we sold in fiscal 2018. Under the Qdoba Purchase Agreement, the buyer has indemnified the Company of all claims related to these guarantees. As of October 3, 2021, the maximum potential liability of future undiscounted payments under these leases is approximately $26.7 million. The lease terms extend for a maximum of approximately 16 more years and we would remain a guarantor of the leases in the event the leases are extended for any established renewal periods. In the event of default, we believe the exposure is limited due to contractual protections and recourse available in the lease agreements, as well as the Qdoba Purchase Agreement, including a requirement of the landlord to mitigate damages by re-letting the properties in default, and indemnity from the Buyer. The Company has not recorded a liability for these guarantees as we believe the likelihood of making any future payments is remote.\n17. SUPPLEMENTAL CONSOLIDATED CASH FLOW INFORMATION (in thousands)\n2021 2020 2019\nCash paid during the year for:\nIncome tax payments $ 48,200 $ 29,360 $ 14,906\nInterest, net of amounts capitalized $ 60,413 $ 68,612 $ 46,227\nNon-cash investing and financing transactions:\nIncrease in dividends accrued or converted to common stock equivalents $ 232 $ 117 $ 247\nConsideration for franchise acquisitions $ 1,305 $ 859 $ -\nIncrease (decrease) in obligations for purchases of property and equipment $ 1,755 $ (2,696) $ (2,117)\nDecrease in obligations for treasury stock repurchases $ - $ (2,025) $ (12,337)\n18. SUPPLEMENTAL CONSOLIDATED FINANCIAL STATEMENT INFORMATION (in thousands)\nOctober 3,\n2021 September 27,\nAccounts and other receivables, net:\nTrade $ 75,273 $ 77,082\nNotes receivable, current portion 1,467 1,193\nIncome tax receivable 1,157 1,591\nOther 2,730 4,092\nAllowance for doubtful accounts (6,292) (5,541)\n$ 74,335 $ 78,417\nOther assets, net:\nCompany-owned life insurance policies $ 123,566 $ 113,767\nDeferred rent receivable 46,234 48,604\nFranchise tenant improvement allowances 34,124 29,437\nNotes receivable, less current portion 4,544 1,851\nOther 15,970 16,964\n$ 224,438 $ 210,623\nAccrued liabilities:\nPayroll and related taxes $ 34,649 $ 34,475\nSales and property taxes 23,174 22,038\nInsurance 21,218 25,310\nDeferred rent income 17,892 1,687\nAdvertising 13,097 9,861\nDeferred franchise fees 4,824 4,934\nOther 33,563 31,126\n$ 148,417 $ 129,431\nOther long-term liabilities:\nDefined benefit pension plans $ 70,354 $ 120,811\nDeferred franchise fees 35,608 38,607\nOther 50,380 47,076\n$ 156,342 $ 206,494\n19. SUBSEQUENT EVENTS\nOn November 19, 2021, the Board of Directors declared a cash dividend of $0.44 per share, to be paid on December 23, 2021 to shareholders of record as of the close of business on December 9, 2021. Future dividends will be subject to approval by our Board of Directors.\nOn November 19, 2021, the Board of Directors authorized an additional $200.0 million stock buy-back program that expires on November 20, 2023."
}