{
    "cik": "816761",
    "company": "TERADATA CORP /DE/",
    "filing_type": "10-K",
    "filing_date": "2021-02-26",
    "period_of_report": "2020-12-31",
    "sic": "7372",
    "state_of_inc": null,
    "state_location": "CA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/816761/0000816761-21-000009-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/816761/000081676121000009/tdc-20201231.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/816761/0000816761-21-000009.txt",
    "filename": "816761_10K_2020_0000816761-21-000009.htm",
    "item_1": "Item 1. BUSINESS\nOverview. Teradata Corporation (\"we,\" \"us,\" \"Teradata,\" or the \"Company\") is a multi-cloud enterprise data warehouse platform provider focused on helping companies leverage all their data across an enterprise to uncover real-time intelligence, at scale. In doing so, we help companies to find answers to their toughest business challenges. All efforts we perform are in support of our purpose of transforming how businesses work and people live through the power of data.\nTeradata has broadened its market opportunity by evolving from an on-premises only, enterprise data warehouse company to a multi-cloud, enterprise data warehouse platform provider. We help our customers integrate and simplify their data and analytics ecosystem, streamline access and management of data, and use analytics to derive business value from diverse data types. Our target market focuses on organizations that are the world's most demanding, large-scale users of data.\nThe largest companies in the world have spent decades building mission-critical, complex, and large-scale on-premises data environments. However, these companies face significant challenges from ecosystems that have grown over time, including siloed data and conflicting and duplicative solutions, resulting in environments that are highly complex and expensive to maintain and manage. Despite these companies investing heavily in technology, people, and infrastructure, their employees are unable to effectively access the data they need to efficiently run their businesses or activate data to make intelligent and innovative business decisions. In addition, most of these organizations are also experiencing a dramatic increase in data volumes and complexity due to digital transformation.\nAs companies seek greater agility and flexibility demanded by today’s digitalized and highly disruptive economy, they are turning to cloud infrastructures. By accessing a data warehouse platform integrated within a cloud-based ecosystem, companies can flexibly access and pay for capabilities on demand integrated with the elasticity of cloud. This provides companies the ability to deploy projects and initiatives, with agility and as needed. Given the petabytes of data and the millions of queries executed daily on-premises, we know that the journey to cloud will be a significant endeavor for our customers leading to ecosystems spanning on-premises and cloud for the foreseeable future. With companies pivoting to invest in the cloud, we believe it is essential for these businesses to be able to integrate ecosystems across on-premises and across multi-cloud environments, simplify access to data wherever it resides and accommodate analytics at massive scale and speed. As a result, we believe that the market for our solutions and services is large and growing.\nOur solution, Teradata Vantage™, is our data warehouse platform that allows companies to leverage all of their data across an enterprise, whether in public or private clouds, on-premises, or in a multi-cloud environment. It connects multiple sources of data to drive ecosystem simplification, delivers multi-dimensional scale and integration, and it supports customers on their journey to cloud through an integrated migration. Teradata is a leader in enabling the migration of a company's data to a cloud based ecosystem by running the same software platform in all deployments (on-premises or public cloud), providing software license portability, data and workload automation tools, as well as associated services.\nTeradata Vantage also contains a secure, highly concurrent and resilient analytics engine that addresses the scalability demands of our target market, the largest companies in the world. Vantage is an open platform offering full integration of datasets, tools, analytical languages and functions within one platform, including leading commercial and open source technologies. Teradata has also made it easier for customers to purchase our solution via subscription offerings, and flexible, \"pay for what you use\" consumption pricing. These combined capabilities enable companies to reduce complexity, risk, and cost, while leveraging data as an asset in solving their business challenges and driving business outcomes, which can include, among other things:\n•Improving customer experience and profitability,\n•Improving operational efficiency,\n•Driving financial transformation with accurate and timely data,\n•Creating a single integrated view of customers across digital and physical channels, and\n•Creating more efficient utilization of assets through machine learning of sensor data.\nOur business consulting services include a broad range of offerings, including support for organizations to establish a data and analytics vision, enable a multi-cloud ecosystem architecture and identify and operationalize analytical opportunities to ensure their ecosystem investments deliver significant value. In addition, we offer robust support and maintenance services for our offerings.\nTeradata operates from numerous locations within the United States with the primary locations being San Diego, California, and Atlanta, Georgia. In addition, we have sales, services, research and development, and administrative offices located in 35 countries.\nFor the calendar year ended December 31, 2020, we had total revenues of $1.836 billion, of which approximately 56% was derived from the Americas region (North America and Latin America) and 44% from the International regions (Europe, Middle East, Africa, Asia Pacific and Japan). For financial information about our segments and geographic information, see \"Note 14-Segment, Other Supplemental Information and Concentrations\" in the Notes to Consolidated Financial Statements elsewhere in this Annual Report.\nHistory. Teradata originated as a startup in a garage in Brentwood, California, and was incorporated in 1979 as a Delaware corporation, driven by the need for robust computing power to harness the value of aggregated data. In 1991, Teradata was acquired and operated as a division until it was spun off as an independent, publicly-traded company named Teradata Corporation (NYSE: TDC) on September 30, 2007.\nIndustry and Market Opportunity. Our view is that data and analytics continue to be a management priority for industry-leading companies. We believe that companies are facing significant ongoing increases in data volumes and proliferation of data silos. Furthermore, the agility provided by cloud-based technologies provides significant benefit, but also creates additional complexity, with the rise of and ecosystems that must span multiple cloud and on-premises environments. These factors all contribute to the increased complexity, cost, and risk associated with managing data and analytic environments. This is particularly true for our target market of global enterprise companies, and we believe that these companies require tightly integrated solutions that can accommodate significant scale and speed. We are focused on both new customer acquisition as well as growth of software consumption within our large and established customer base.\nWe believe Teradata’s strategy positions us to address this large market opportunity within the growing multi-billion dollar data management and analytics markets. We believe our multi-cloud data warehouse software solution will lead to reduced risk and cost for enterprise companies while enabling data insights and outcomes driving meaningful business value. We also believe our experience positions us to support these companies with the design and implementation of next generation secure, multi-cloud data and analytics ecosystems. We have tailored Teradata's offerings to provide flexibility and choice of deployment environments, whether on-premises or in one of the top public clouds, alongside portability of licenses, allowing companies to de-risk their investments.\nOur Strategy. Teradata’s strategy is based on our differentiated value proposition for the top 10,000 largest enterprises in the world. Our strategy is to provide a multi-cloud data warehouse platform, Teradata Vantage. Teradata Vantage is a scalable, secure, highly concurrent and resilient data warehouse platform that is designed to help companies solve complex data challenges at scale. We enable enterprises with a data management solution to support their data and analytic ecosystems. Furthermore, as demand in the data warehouse market shifts to the cloud, we provide customers with the ability to migrate their data warehouse to a cloud-based platform.\nWe believe we are differentiated by providing our platform offering across a secure, multi-cloud ecosystem. This includes the ability to simplify the management of an ecosystem that spans on-premises or private cloud platform instances, alongside deployments in any of the top public cloud offerings including Amazon Web Services, Microsoft Azure, and Google Cloud. Furthermore, we augment these offerings with our \"pay as you go\" consumption pricing to provide flexibility for customers to expand capabilities on an as-needed basis. The multi-cloud capability and consumption pricing combine to enable our customers to de-risk their investments and buying decisions, as well as provide public cloud vendor flexibility. With cloud elasticity and our multi-dimensional scalability, we provide a fast path for customers to grow analytics to scale, delivering robust business outcomes.\nAs customers seek to increasingly grow their footprint in cloud, our strategy supports existing and new on-premises customers on that journey with the fastest path to migration that is enabled through license portability, same software enabled in all environments, as well as data and workload migration tools and services. Through this differentiated set of offerings for our target market, we help customers build for the future, now.\nBy prioritizing the fundamental capabilities of a modern multi-cloud data warehouse, we are resetting expectations and market perceptions. We are enabling a competitive and compelling total cost of ownership by building out best-in-class capabilities that provide an easy experience for ingestion, exploration, development, consumption and operationalization of data and analytics. With an outstanding user experience and the flexibility of cloud, we are attracting new customers to grow from demos and trials, to scale.\nFurthermore, with increasingly fragmented ecosystems consisting of best-of-breed tools, our strategy drives an open platform approach, enabling integration into cloud and partner ecosystems. This integration extends the data and analytical capabilities of our offerings, allowing our customers greater flexibility to leverage the tools of their choice, deployed on top of a scalable and robust data warehouse platform. By empowering customers and partners to build how they like, we enable hundreds of business outcomes and solutions.\nOur strategic objectives are to:\n•Strengthen our multi-cloud data warehouse offering by building out next generation cloud capabilities,\n•Reset market perceptions to establish Teradata’s position in the cloud market,\n•Enable end-to-end business outcomes through a seamless cloud user experience,\n•Expand our product capabilities through deeper integration with cloud ecosystems,\n•Focus on partner enablement to drive solution execution on Teradata Vantage,\n•Accelerate our transition to the cloud by supporting our customers on their migration journeys,\n•Expand strategic public Cloud Service Provider relationships,\n•Expand our go-to-market reach through new customer acquisition, vertical investments, expanding customer success programs and strengthening our partner relationships, and\n•Deliver operational excellence through efficient cost management and execution.\nOur strategy is further supported by various people initiatives to drive a growth-oriented culture, as well as an increased focus on diversity, equity and inclusiveness, to attract and support high performing, top talent, and diverse teams.\nCustomers. Teradata concentrates on enterprise companies, the 10,000 largest businesses in the world, which view data as a strategic asset, with focus on both business users and technology buyers. We have an additional focus on the following industries: Financial Services, Government, Healthcare, Manufacturing, Retail, Telecommunications, and Travel/Transportation. We believe that these industries provide a good fit for our analytic solutions and services as they typically have the greatest analytic potential with large and growing data volumes, as well as complex data management requirements, and large and varied groups of users. When looking at new customer acquisition, we aim to drive adoption of our Teradata Vantage software. In addition, we are targeting our existing customer base to increase the consumption of Teradata's software, and in particular, supporting our customers with their journeys to the cloud and to exploit new uses of data and analytics.\nThe extent to which any given customer contributes to our revenues has historically varied significantly from year to year and quarter to quarter, although we currently do not have any customer who represents 5% or more of our total revenue. We have been highly successful in converting customers from perpetual to subscription-based purchasing options, which results in more ratable revenue recognition and we believe this will increase the predictability of our revenue and the durability of our cash flows in the future. Due to the size and complexity of our sales transactions, the sales cycle can often be long.\nSeasonality. Historically, our deal volume is seasonal, in line with customer spending patterns, with lower volume typically in the first quarter and higher volume generally in the fourth quarter of each calendar year. Such seasonality causes our working capital cash flow requirements to vary from quarter to quarter depending on the variability in the volume, timing, and mix of platform sales. As we have transitioned the business to subscription-based transactions, the business is becoming less seasonal as subscription renewals are more evenly distributed throughout the year. This is impacting timing of cash collection and billings. However, typical of the enterprise software market, Teradata will continue to have significant deal volume seasonality that skews to the fourth quarter. Historically, cash provided by operating activities is higher in the first half of the year due to collections of the higher receivable balances at December 31 driven by the higher volumes in the fourth quarter and receipts from annual renewals of our maintenance support agreements. In addition, deal volume in the third month of each quarter\nhas historically been significantly higher than in the first and second months. These factors, among others as more fully described in Item 1A, Risk Factors, elsewhere in this Annual Report, make forecasting more difficult and may adversely affect our ability to accurately predict financial results.\nBacklog. Our backlog was approximately $2.9 billion at December 31, 2020, an increase from $2.7 billion on December 31, 2019. Approximately $1.5 billion of the backlog at December 31, 2020 is expected to be recognized as revenue in 2021. Backlog consists of firm contracts for work that has not yet been performed or goods that have not been delivered. Backlog includes $537 million at December 31, 2020 and $533 million at December 31, 2019 for backlog that had been invoiced, and therefore, was included in deferred revenue. Although we believe that the contract value included in backlog is firm, some contracts may provide that the Company is contractually obligated to perform but gives the customer the right to cancel for convenience by giving notice to Teradata.\nSales, Marketing and Partners\nSales and Marketing. We primarily sell and market our solutions and services through a direct sales force. We have greater than 80% of our employees in customer-facing and/or revenue-driving roles (including sales, marketing, consulting, customer service, and product engineering).\nWe support our sales force with marketing and training programs that are designed to:\n•Grow awareness and increase perception of Teradata as a multi-cloud leader, highlighting our technology leadership, differentiation, cloud and analytics expertise;\n•Lead customers on their cloud journeys with the benefits of multi-cloud and hybrid cloud capabilities;\n•Create demand for and adoption of our Teradata Vantage data warehouse platform;\n•Educate and enable the sales force with the skills and knowledge to deliver our value proposition; and\n•Provide a robust set of tools for use by our sales teams.\nTeradata focuses our brand messaging on the Company’s strength as a multi-cloud data warehouse platform provider. To support the Company’s growth objectives, we employ a broad range of marketing strategies, including programs to inform, educate and generate demand with customers and prospects, as well as keep our leading technology position at the forefront of the media, industry analysts, academics, and other influencers. These strategies include targeted account-based marketing, our global website, digital marketing, demos and trials of our software, webinars, virtual conferences and events now, and physical events when again safe to do so, post the global pandemic, public and media relations, social media, and an extensive customer reference program.\nStrategic Partnerships. We seek to extend our sales and marketing reach by partnering with cloud service providers, alliance partners (including independent software vendors and open-source software distributors), leading global and regional systems integrators, consultants, and universities that we believe complement our differentiated offerings. Strategic partnerships are a key element in our ability to leverage the value and expand the scope of our data warehouse offering in the marketplace.\n•Cloud Service Providers: Teradata has established partnerships with the top three global public cloud service providers: Amazon Web Services (\"AWS\"), Microsoft Azure, and Google Cloud, so that Teradata can provide companies around the globe access to Teradata’s Vantage offering in the public cloud, both in a Do-It-Yourself or As-A-Service mode to accommodate customer preferences.\n•Alliance Partners: Teradata has a focus on working collaboratively with independent software vendors in several areas, including tools, data and application integration solutions, data mining, analytics, business intelligence, and specific analytic and industry solutions. Our goal is to provide choices to our customers with partner offerings that are optimized and certified to work with Teradata Vantage to deliver end-to-end data warehouse analytic solutions and to provide comprehensive capabilities that support the customer’s analytic ecosystem.\n•Systems Integrators and Consultants: We also work with a range of systems integrators and consultants who engage in the design, implementation, and integration of data warehouse and analytic solutions and analytic applications for our joint customers. Our strategic partnerships with select global consulting and\nsystems integration firms provide broad industry and technology expertise in the design of business solutions that leverage Teradata technology to enable enterprise analytics.\nCompetition. We compete in a large and growing data management and analytics market that is attractive to both current and new competitors. Participants in our general market include traditional data warehouse competitors such as IBM, Oracle, SAP, as well as new cloud-only data warehouse vendors (such as Amazon, Google, Snowflake), and open-source providers. We believe our focus on multi-cloud ecosystem simplification, solving for the most scalable and complex workloads and delivering business outcomes enables us to successfully compete within our target market. We believe that our Teradata Vantage platform is highly differentiated, delivers substantive scale and integration, and is uniquely positioned to provide significant business value to our customers. Furthermore, we provide our customers with the opportunity to de-risk their buying decisions with access to deploy across the top public clouds, private cloud and on-premises, coupled with flexibility in purchasing and portable licensing. For more information on competition, see Item 1A, Risk Factors, in this Annual Report.\nWe believe that the principal competitive factors for our products and services include: data and analytics experience; business outcome delivery; multi-cloud offerings and experience; customer references; technology leadership; product quality; performance, scalability, availability, and manageability; support and consulting services capabilities; management of technologies in a complex analytical ecosystem; industry knowledge; and total cost of ownership. We believe we have a competitive advantage in providing complete, integrated, and optimized data warehouse platform capabilities and analytic services that address customers’ business, technical, and architectural requirements. Our differentiation is especially strong in our target market of the world’s leading enterprises and their mission-critical, complex, large-scale environments and requirements.\nResearch and Development (\"R&D\"). We remain focused on designing and developing data warehouse technologies that anticipate our customers' evolving needs and support our customers in solving their most complex business challenges. Our teams are focused on extending our Teradata Vantage data warehouse platform to have differentiated capabilities for our customers’ multi-cloud and hybrid ecosystems. This includes simplifying the journey to cloud, as well as enabling a transformative cloud experience. With a focus on opening up the platform, we are building out deep integration with cloud data and analytic ecosystems, including advanced analytics and artificial intelligence tools. Furthermore, with a strong focus on partnerships, our R&D team is extending our platform to enable deeper partner integration with a broader range of solution and services providers.\nWe believe our extensive and deeply talented R&D workforce is one of our core strengths. Our R&D team is located in multiple locations around the world to take advantage of global engineering talent. We anticipate that we will continue to have significant R&D expenditures, which may include complementary strategic acquisitions, to help support the flow of innovative, high-quality cloud-based offerings with a superior user experience, as well as services, which are vital to our leading competitive position. For information regarding the accounting and costs included in R&D activities, see \"Note 1-Description of Business, Basis of Presentation and Significant Accounting Policies\" in the Notes to Consolidated Financial Statements elsewhere in this Annual Report.\nIntellectual Property and Technology. The Company owns 648 patents in the United States and 6 patents in foreign countries. The foreign patents are generally counterparts of the Company’s United States patents. The Company also is the exclusive licensee of four additional patents in the United States and three additional patents in foreign countries. Many of the patents that we own are licensed to others, and we are licensed to use certain patents owned by others. While our portfolio of patents and patent applications in aggregate is of significant value to our Company, we do not believe that any individual patent is by itself of material importance to our business.\nIn addition, the Company owns copyrights and trade secrets in our code base that comprises all of the Teradata software offerings, including analytic data platforms and analytic applications. Teradata’s software offerings reflect the investment of hundreds of person-years of development work.\nThe source code versions of our offerings are protected as trade secrets and, in all major markets, as unpublished copyright works. We take great efforts to protect our rights in all software offerings and related intellectual property; however, there can be no assurance that these measures will be successful. The Company owns the Teradata® word and logo trademarks, which are registered in the United States and in many foreign countries, as well as other trade names, service marks, and trademarks.\nSources of Materials. Our hardware components are assembled and configured by Flex Ltd. (\"Flex\"). Our platform line is designed to leverage the components from manufacturers that we believe are industry leaders. Our data storage devices and memory components utilize industry-standard technologies but are selected and configured to work optimally with our software and hardware platform. Flex also procures a wide variety of components used in the assembly process on our behalf. Although many of these components are available from multiple sources, Teradata utilizes preferred supplier relationships to better ensure more consistent quality, cost and delivery. Typically, these preferred suppliers maintain alternative processes and/or facilities to ensure business continuity of supply. Given our strategy to outsource product assembly activities to Flex and to source certain components from single suppliers, a disruption in production at Flex or at a supplier, or a global shortage of components, could impact the timing or profitability of customer shipments. In addition, a significant change in the forecasts to any of these preferred suppliers could result in purchase obligations for components that may be in excess of demand. Although the Company has not experienced significant disruptions in its supplier relationships due to the COVID-19 pandemic, the ongoing pandemic continues to present potential supply chain uncertainty, and the Company has implemented programs to mitigate these potential risks. For more information, see",
    "item_1A": "Item 1A. RISK FACTORS\nYou should carefully consider each of the following risk factors and all other information set forth in this Annual Report. Based on the information currently known to us, we believe that the following information identifies the most significant risk factors affecting our company in each of these categories of risks. However, the risks and uncertainties our Company faces are not limited to those set forth in the risk factors described below. Additional risks and uncertainties not presently known to us or that we currently believe to be immaterial may also adversely affect our business.\nIn addition, past financial performance may not be a reliable indicator of future performance, and historical trends should not be used to anticipate results or trends in future periods.\nIf any of the following risks and uncertainties develops into actual events or occurrences, these events could have a material adverse effect on our business, financial condition or results of operations. In such case, the trading price of our common stock could decline.\nRISKS RELATED TO OUR BUSINESS AND OPERATIONS\nOur failure to successfully execute our cloud-first strategy and achieve the anticipated benefits of our business transformation could have a material adverse effect on our business, financial condition, results of operations and cash flows.\nThe successful implementation of our cloud-first strategy and completion of our business transformation presents organizational and infrastructure challenges. We may not be able to implement and realize some or all of the\nanticipated benefits from our strategy or our business transformation plan on a timely basis, or at all. Events and circumstances, such as financial or unforeseen difficulties, delays and unexpected costs, may occur that could result in our not realizing desired outcomes. Any failure to substantially implement the transformation of the Company in accordance with our expectations could have a material adverse effect on our financial results. Even if the anticipated benefits and savings are substantially realized, there may be unforeseen consequences, internal control issues, or business impacts. Additionally, because of our restructuring efforts in connection with our business transformation, we may experience a loss of continuity, loss of accumulated knowledge or loss of efficiency during transitional periods. Reorganization and restructuring may require a significant amount of management and other employees' time and focus, which may divert attention from operating activities and growing our business. Failure to achieve some or all of the expected benefits of these activities could have a material adverse effect on our competitive position, business, financial condition, results of operations and cash flows.\nA core component of our strategy is to expand and enhance our offerings for cloud environments. It is uncertain whether these new offerings and deployment models will prove successful or whether we will be able to develop the necessary business models, infrastructure and systems to support the business. This includes acquiring, retaining and developing the right human capital to execute our business strategy in a competitive job market. In addition, market acceptance of new product and service offerings will be dependent in part on our ability to include functionality and usability that address customer requirements, and to optimally price our offerings and services to meet customer demand and cover our costs. Our go-to-market, cloud and multi-cloud cloud strategies also must adjust to customers' changing buying preferences, and there can be no assurance that our go-to-market approach will adequately and completely address such preferences. New product and services offerings may increase our risk of liability and cause us to incur significant technical, legal or other costs. If we are unable to correctly respond to these issues, our business could be harmed.\nAs part of our business strategy, we also continue to dedicate a significant amount of resources to our research and development (\"R&D\") efforts in order to maintain and advance our competitive position, including our initiatives to provide and improve our offerings for cloud environments. However, we may not receive significant revenues from these investments for several years, if at all. R&D expenses represent a significant portion of our discretionary fixed costs. If we do not receive some or all of the expected benefits of our substantial investments in R&D, our results of operations could be adversely affected.\nOur success depends on our product innovation, particularly with respect to the advancement of our cloud-based technologies. If we are unable to successfully develop and launch cloud-based products and product enhancements and/or enable our data warehouse platform to operate effectively in cloud environments, our business, financial condition, and results of operations could be harmed.\nTo succeed in the intensely competitive IT industry, we must continually improve, refresh and expand our product and service offerings to include newer features, functionality, and deployment options and to keep pace with price-to-performance gains. This is particularly the case in the demand for analytic solutions in a cloud-based environment. The successful execution of our cloud-first strategy is dependent on the advancement of our cloud-based technologies. In furtherance of this strategy, we are focusing a significant amount of our R&D activities and resources to the development of cloud-based products and product enhancements and to enable our data warehouse platform to operate effectively in cloud environments. If we are unable to successfully develop and launch cloud-based products and product enhancements and/or enable our data warehouse platform to operate effectively in cloud environments, our business, financial condition, and results of operations could be harmed.\nShortened product life cycles due to customer demands and competitive pressures impact the pace at which we must introduce and implement new technology. This requires a high level of innovation by both our software developers and the suppliers of the third-party software components included in our solutions. In addition, bringing new offerings to the market entails a costly and lengthy process, and requires us to accurately anticipate customer needs and technology trends. If we are unable to respond to market demands, develop leading technologies, timely deliver offerings to the market, and maintain leadership in analytic data solutions performance and scalability, our business operations may be adversely affected.\nBecause of these and other factors, our ability to introduce new or improved solutions could be adversely impacted. There can be no assurance that our innovations will be profitable, and if we cannot successfully market and sell both existing and newly developed solutions, our business and operating results could be impacted.\nAs we develop new offerings with greater capacity, delivery and performance capabilities, the increased difficulty and complexity associated with producing these offerings may increase the likelihood of reliability, quality or operability issues.\nOur offerings may contain undetected errors or security flaws, which may be found after the offerings are introduced and delivered. This risk is enhanced when offerings are first introduced or when new versions are released, as well as when we develop offerings with more advanced technology, since the increased difficulty and complexity associated with producing these offerings may increase the likelihood of reliability, quality or operability issues. Due to such complexities, our products may also fail to perform to the full specifications and expectations of our customers. Additionally, third-party components that we integrate in our solutions may have undetected quality issues that may impact the performance of our offerings. The correction and detection of errors may cause delays, lost revenues, and incremental costs. Errors in our software offerings could also affect their ability to work with other components of our offerings, could delay the development or release of new offerings, and could adversely affect their market acceptance. We may not be able to detect or remedy all errors, including those that may be deemed critical by our customers, prior to release or deployment. Such reliability, quality and operability issues may negatively impact our ability to retain current customers, including due to customer cancellations or non-renewals, as well as our ability to obtain new customers.\nOur customers who rely on our solutions for business-critical uses are more sensitive to errors, which could expose us to liability, performance and warranty claims, as well as harm our reputation. These and other risks associated with new offerings may have a material adverse impact on our results of operations and future performance.\nIf our existing customers fail to renew, or cancel, their subscription license arrangements or support agreements, or if customers do not renew on terms favorable to us, our business could be adversely affected.\nTeradata’s platform offerings have been expanded to include a variety of subscription options, which impact the timing of when revenues are recognized and related cash flows are collected. In addition, due to the recent transition to subscription revenues, we currently derive a significant portion of our overall revenues from subscription services in which we have limited renewal experience, which carries additional risk. The IT industry generally has been experiencing increasing pricing pressure from customers when purchasing or renewing support agreements. Mergers and acquisitions in certain industries that we serve could result in a reduction of the software and hardware being supported and put pressure on our subscription and support terms with customers who have merged. Given these factors, there can be no assurance that our current customers will renew their subscription and/or support agreements or agree to the same terms when they renew, which could result in our reducing or losing subscription and/or support fees which could adversely impact operating results.\nUnanticipated delays or accelerations in our sales cycles makes accurate estimation of our revenues difficult and could result in significant fluctuations in our quarterly operating results.\nThe length of our sales cycle varies depending on several factors over which we may have little or no control, including the size and complexity of a potential transaction, the level of competition that we encounter in our selling activities and our current and potential customers’ internal budgeting and approval process, as well as overall macro-economic conditions. Because of a generally long sales cycle, we may expend significant effort over a long period of time in an attempt to obtain an order, but ultimately not complete the sale, or the order ultimately received may be smaller than anticipated. The long sales cycle for our products also makes it difficult to predict the quarter in which sales will occur. Delays in sales could cause significant variability in our results for any particular period.\nWe may experience variability in our operating results based on the purchasing behavior of our customers.\nAs part of our strategy, our business has substantially shifted from traditional, perpetual pricing and revenue model to a subscription-based model in which less revenue is recognized upfront at the time the customer enters into a transaction. The pace and extent to which customers will continue to purchase and renew our offerings on a subscription basis is variable and therefore has impacts on our results and operations. In addition, we have recently\nintroduced flexible pricing options for our cloud customers, including consumption-based, \"pay as you go\" pricing. Under such a pricing model, we generally recognize revenue based on consumption. To the extent that customers opt for such a flexible pricing model, we may not be able to accurately forecast the timing of customer consumption of our offerings. As a result, our actual results may differ from our projections. Furthermore, our on-premises subscription arrangements may provide the customers with the right to cancel our agreement upon certain notice periods, which we may change in the future. Such arrangements may impact the timing of revenue recognition for these customers and result in fluctuations in our quarterly operating results.\nDemand for the offerings and services we sell could decline if we fail to maintain positive brand perception and recognition.\nWe operate a portfolio of brands with a commitment to customer service and innovation. We believe that recognition and the reputation of our brands are key to our success, including our ability to retain our existing customers and attract new customers. Operational factors such as failure to deliver high quality offerings or services, uncompetitive pricing, failure to meet delivery or performance promises or business interruptions could damage our reputation.\nExternal factors, such as negative public remarks or accusations, could also be damaging. Damage to the perception or reputation of our brands could result in, among other things, declines in customer loyalty, customer cancellations or non-renewals, lower employee retention and productivity and vendor relationship issues, all of which could materially affect our revenue and profitability.In addition, given our history as an on-premises platform provider, one of our strategic objectives is to reset market perceptions to establish our position in the cloud market. A misperception in the market regarding our cloud capabilities could negatively impact our ability to migrate existing on-premises customers to our cloud-based solutions and/or acquire new customers for our cloud business.\nOur future results depend in part on our relationships with key suppliers, strategic partners and other third parties.\nOur development, marketing and distribution plans depend in part on our ability to form strategic alliances with third parties that have complementary offerings, software, services and skills. Our strategic partners include consultants and system integrators, software and technology providers, hardware support service providers, and indirect channel distributors in certain countries. These relationships involve risks, including our partners changing their business focus, entering strategic alliances with other companies, being acquired by our competitors, failing to meet performance criteria or improperly using our confidential information. If we fail to maintain or expand our relationships with strategic partners, or if we are forced to seek alternative technology, or technology for new solutions, that may not be available on commercially reasonable terms, our business may be adversely affected.\nThird-party vendors provide important elements to our solutions; if we do not maintain our relationships with these vendors or if these vendors cease to be going concerns, interruptions in the supply of our offerings may result. There are some components of our solutions that we purchase from single sources due to price, quality, technology or other reasons. For example, we rely on Flex as a key single source contract manufacturer for our on-premises hardware systems. In addition, we buy servers from Dell Technologies Inc. and storage disk systems from NetApp, Inc. Some components supplied by third parties may be critical to our solutions, and several of our suppliers may terminate their agreements with us without cause with 180-days notice. In addition, we rely on certain vendors for hardware support services and parts supply. If we were unable to purchase necessary services, parts, components or offerings from a particular vendor and had to find an alternative supplier, our shipments and deliveries could be delayed. Also, quality issues, a disruption in our supply chain or the need to find alternative suppliers could impact the costs and/or timing associated with procuring necessary offerings, components and services. In any case, our operations could be adversely impacted. Similarly, our suppliers’ offerings and services have certain dependencies with respect to their own supply chain networks, and supply issues among our suppliers’ suppliers may also adversely impact our business.\nAs part of our cloud-first strategy, the growth of our business is dependent on our relationships with public cloud service providers, Amazon, Google, and Microsoft. Our strategic partnerships with Amazon, Google and Microsoft for our cloud offerings on AWS, Google and Azure, respectively, require significant investments to ensure that our solutions are optimized in these cloud environments. In addition, these cloud service providers maintain\nrelationships with certain of our competitors, and may in the future establish relationships with additional competing cloud data warehouse platform providers. Any of these cloud service providers may decide to modify or terminate our business relationship, or may otherwise enter into preferred relationships with one or more competing cloud data warehouse platform providers. If we are unsuccessful in meeting performance requirements or obtaining future returns on these investments, or if we are otherwise unable to maintain adequate relationships with any of these cloud service providers, our financial results may be adversely impacted.\nThe Company's business, results of operations, and financial condition have been adversely affected, and could in the future be materially adversely affected, by the COVID-19 pandemic.\nAs more fully described elsewhere in this Annual Report on Form 10-K, our business, results of operations, and financial condition have been adversely affected by the COVID-19 pandemic. The degree to which the COVID-19 pandemic in the future affects our business, financial condition, and results of operations will depend on future developments, which are highly uncertain and cannot be predicted, including, but not limited to, the duration and spread of the unprecedented pandemic, its severity, the actions to contain the virus or respond to its impact, the successful distribution of vaccines and their effectiveness, and how quickly and to what extent normal economic and operating conditions can resume. The COVID-19 pandemic or any other adverse public health development could also inhibit our ability to execute our strategic initiatives including, without limitation, improving the experience of our customers, investing identified strategic growth platforms and shifting the mix of revenue in our business to cloud as well as subscription revenue.\nFurthermore, negative economic conditions related to the COVID-19 pandemic have impacted, and may in the future impact, our ability to close transactions and/or collect receivables from customers on a timely basis, or at all, and may also impact our customers' willingness to maintain or increase spending on data analytics, their ability to obtain adequate financing for the purchase of our products and services, or the amount of disposable income available to consumers, which may adversely impact the businesses of our customers in consumer-facing industries.\nAdditionally, governmental restrictions and public perceptions of the risks associated with the COVID-19 pandemic have caused, and may continue to cause, consumers to avoid or limit gatherings in public places or social interactions, which could adversely affect the businesses of our customers in certain industries, such as transportation, entertainment and hospitality. Such customers have experienced, and may continue to experience,\nsignificant near-term working capital and cash flow adverse impacts as a result of the COVID-19 pandemic, which, in turn, could adversely impact our ability to maintain or increase revenue from such customers. In addition, the global supply chain risks present a level of uncertainty due to the international and domestic pandemic recovery efforts. The uncertainty of an increase in the number of COVID-19 infections in areas where our suppliers source their parts could present sourcing challenges to our suppliers. Further, if countries in which we do business close their borders, it may impact the timing of closing sales transactions or the ability to service our customers in select geographies.\nAs a result of the COVID-19 pandemic, including related governmental guidance or directives, we have required most employees to work remotely. We may experience reductions in productivity and disruptions to our business routines while our remote work policy remains in place.\nGovernmental authorities in the United States and throughout the world may increase or impose new income taxes or indirect taxes, or revise interpretations of existing tax rules and regulations, as a means of financing the costs of stimulus and other measures enacted or taken, or that may be enacted or taken in the future, to protect populations and economies from the impact of the COVID-19 pandemic. Such actions could have an adverse effect on our results of operations and cash flows.\nWhile we have implemented programs to mitigate the impact of these risks on our results of operations, there can be no assurance that these programs will be successful and there are many aspects of this pandemic, particularly its impact on our customers, that are beyond our control. The spread of COVID-19 has caused us to modify our business practices, such as employee work locations, and we may take further actions as may be required by government authorities or that we determine is in the best interests of our employees, customers, distributors, suppliers and contractors. There is no certainty that such measures will be sufficient to mitigate the risks posed by the virus, and our ability to perform critical functions could be harmed. Moreover, these measures, and similar\nmeasures at our customers, have resulted in, and in the future may result in, installation and payment delays. In addition, we have experienced, and expect to continue to experience, delays and cancellations of consulting projects due to work from home and shelter-in-place orders and also because of the discretionary nature of consulting projects which may be delayed or suspended as a result of more conservative spending patterns by our customers in light of the economic impacts of the pandemic.\nEven after the COVID-19 pandemic has subsided, we may continue to experience adverse impacts to our business as a result of the economic recession that has occurred and any economic recession that may occur in the future. The COVID-19 pandemic could also exacerbate or trigger other risks, any of which could have a material adverse effect on our business, results of operations and financial condition.\nA breach of security, disruption, or failure of our information systems or those of our third-party providers could adversely impact our business and financial results.\nOur operations are dependent on our ability to protect our computer equipment and the information stored in our databases (and the computer equipment and database information of certain suppliers and other third parties) from damage by, among other things, earthquake, fire, natural disaster, cyber-attacks, power loss, telecommunications failures, unauthorized intrusions, malicious or unintended insider actions that cause loss of data or loss of systems, including phishing schemes, and other events. The occurrence of one or more of these events could result in system failures and other interruptions in our operations, which could have a material adverse effect on our business, financial condition or results of operations. Additionally as a result of the COVID-19 pandemic, including related governmental guidance or directives, we have required most employees to work remotely. This increases vulnerability to our systems as additional endpoints need to be managed.\nPrior to our transition to a subscription-based business, our customers generally purchased or leased on-premises hardware systems used in connection with our software solutions, which our customers deployed and operated. With respect to these types of customer on-premises solutions, the customer, directly or through its selected services providers, manages all aspects of the data controls and security with respect to any confidential, private or otherwise sensitive information stored or processed through these solutions, including any personally identifiable data or information, such as non-public data regarding our customers’ employees, customers' customers, consumers, data subjects, individuals’ identities, individual financial accounts and health information. By contrast, our software-as-a-service or cloud offerings generally require us to deploy or operate solutions for our customers, directly or through the use of third-party services providers, either on-premises at customer-selected data center facilities, or at third-party-hosted data center facilities. With respect to these cloud and software-as-a-service offerings, we and such service providers have increased roles, responsibilities and risk exposures regarding some or all aspects of the data controls and security with respect to any confidential, private or otherwise sensitive information stored or processed through these solutions on our systems or those of selected third-party providers. If unauthorized access to or use of such information or systems occurs, despite data security measures and third-party commitments to protect them, our results of operation, reputation, and relationships with our customers could be adversely impacted.\nExperienced computer programmers, Nation State Sponsored Advanced Persistent Code (\"NSSAPC\") attackers (from countries such as Iran, China, Russia and certain European Eastern Bloc countries) and hackers may be able to penetrate our network security or that of our third-party providers and misappropriate or compromise our intellectual property or other confidential information or that of our customers, create system disruptions or cause shutdowns. Computer programmers and hackers also may be able to develop and deploy viruses, worms, and other malicious software programs that attack our offerings or otherwise exploit any security vulnerabilities of our offerings. In addition, phishing-scheme-perpetrators may be able to lure employees or contractors into providing such perpetrators with information that may enable them to avoid some of our network security controls or those of third-party providers which could result in system disruptions or a loss of confidential and proprietary information.\nWe have been subject to actual and potential cyber-attacks, and there can be no assurance that our defensive measures will be adequate to prevent them in the future. There is risk that these types of activities will recur and persist, that one or more of them may be successful in the future, that one or more of them may have been or will be successful but not detected, prevented, remediated or mitigated by us, and the costs to us to eliminate, detect, prevent, remediate, mitigate or alleviate cyber or other security problems, viruses, worms, malicious software\nprograms, phishing schemes and security vulnerabilities could be significant, and our efforts to address these problems may not be successful and could adversely impact our future results of operations.\nInadequate internal control over financial reporting and accounting practices could lead to errors, which could adversely impact our ability to assure timely and accurate financial reporting.\nInternal control over financial reporting, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the control objectives will be met. These inherent limitations include system errors, the potential for human error and unauthorized actions of employees or contractors, inadequacy of controls, temporary lapses in controls due to shortfalls in transition planning and oversight or resources, and other factors. Consequently, such controls may not prevent or detect misstatements in our reported financial results as required under SEC and NYSE rules, which could increase our operating costs or impair our ability to operate our business. Controls may also become inadequate due to changes in circumstances, and it is necessary to replace, upgrade or modify our internal information systems from time to time. In addition, unforeseen risks may arise in connection with financial reporting systems due to inefficient business processes, business process reengineering projects, or changes in accounting standards.\nIf management is not successful in maintaining a strong internal control environment, material weaknesses could occur, causing investors to lose confidence in our reported financial information. This could lead to a decline in our stock price, limit our ability to access the capital markets in the future, and require us to incur additional costs to improve our internal control systems and procedures.\nOur business is affected by the global economies in which we operate and the economic climate of the industries we serve.\nOur business and results of operations are affected by international, national and regional economic conditions. In particular, the IT industry in which we operate is susceptible to significant changes in the strength of the economy and the financial health of companies and governmental entities that make spending commitments for new technologies. Accordingly, adverse global economic and market conditions, including in certain economic sectors in which many of our customers operate (such as retail, manufacturing, financial services or government), may adversely impact our business. For example, adverse changes to the economy could impact the timing of purchases by our current and potential customers or the ability of our customers to fulfill their obligations to us. In addition, decreased or more closely scrutinized spending in our customers’ businesses and in the industries we serve, may adversely impact our business. Uncertainty about future economic conditions may make it difficult for us to forecast operating results and to make decisions about future investments. The Company’s success in periods of economic uncertainty may also be dependent, in part, on our ability to reduce costs in response to changes in demand and other activity.\nGenerating substantial revenues from our international operations poses several risks.\nIn 2020, the percentage of our total revenues from outside of the United States was 50%. We have exposure to more than 30 functional currencies. The risks associated with the geographic scope of our business operations include, among other things the following:\n•Cultural and management challenges associated with operating in developing countries;\n•Longer payment cycles for sales in foreign countries and difficulties in enforcing contracts and collecting accounts receivable;\n•Fluctuations in the value of local currencies;\n•Tariffs or other restrictions on foreign trade or investment;\n•US-China trade disputes or other international trade disputes may adversely affect sales of our solutions and services and may result in longer sales cycles;\n•The continued economic and legal uncertainty around how the United Kingdom's exit from the European Union (known as Brexit) will impact the United Kingdom’s access to the EU Single Market, the related regulatory environment, the global economy and the resulting impact on our business; and\n•The impact of catastrophic weather or other negative effects of climate change and public health crises (such as the COVID-19 pandemic), on our facilities, operations and/or workforce, as well as those of our customers, supply chains and distribution channels, throughout the world, particularly those in coastal areas.\nAny of these events, among others, could materially and adversely affect our financial condition and operating results.\nOur offerings are subject to United States export controls and, when exported from the United States, or re-exported to another country, must be authorized under applicable United States export regulations. Changes in our offerings or changes in export regulations may create delays in the introduction of our offerings in international markets, prevent our customers with international operations from deploying our offerings throughout their global systems or, in some cases, prevent the export of our offerings to certain countries or customers altogether. Any change in export regulations or related legislation, shift in approach to the enforcement or scope of existing regulations, or change in the countries, persons or technologies targeted by these regulations could result in decreased use of our offerings by, or in our decreased ability to export or sell our offerings to, existing or potential customers with international operations.\nThere is active enforcement and ongoing focus by the SEC and other governmental authorities on the United States Foreign Corrupt Practices Act, the U.K. Bribery Act of 2010 and similar anti-bribery, anti-corruption laws in other countries. Given the breadth and scope of our international operations, we may not be able to detect improper or unlawful conduct by our international partners and employees, despite our high ethics, governance and compliance standards, which could put the Company at risk regarding possible violations of such laws and could result in various civil or criminal fines, penalties or administrative sanctions, and related costs, which could negatively impact the Company's business, results of operations or financial condition.\nRISKS RELATED TO OUR INDUSTRY\nThe IT industry is intensely competitive and evolving, and competitive pressures could adversely affect our pricing practices or demand for our offerings and services.\nWe operate in the intensely competitive IT industry, which is characterized by rapidly changing technology, evolving industry standards and models for consuming and delivering business and IT services, frequent new product introductions, and frequent price and cost reductions. In general, as a participant in the data analytic solutions market, we face:\n•Changes in customer IT spending preferences and other shifts in market demands, which drive changes in the Company's competition;\n•Changes in pricing, marketing and product strategies, such as potential aggressive price discounting and the use of different pricing models by our competitors;\n•Rapid changes in product delivery models, such as on-premises solutions versus cloud solutions;\n•Rapid changes in computing technology and capabilities that challenge our ability to maintain differentiation at the lower range of business intelligence analytic functions;\n•New and emerging analytic technologies, competitors, and business models;\n•Continued emergence of open source software that often rivals current technology offerings at a much lower cost despite its limited functionality;\n•Changing competitive requirements and deliverables in developing and emerging markets; and\n•Continuing trend toward consolidation of companies, which could adversely affect our ability to compete, including if our key partners merge or partner with our competitors.\nOur competitors include established companies within our industry, including Amazon, Google, IBM, Oracle, Microsoft, and SAP, which are well-capitalized companies with widespread distribution, brand recognition and penetration of platforms and service offerings. The significant purchasing and market power of these larger competitors, which have greater financial resources than we do, could allow them to surpass our market penetration and marketing efforts to promote and sell their offerings and services. In addition, many other companies participate in specific areas of our business, such as enterprise applications, analytic platforms and business intelligence software. In some cases, we may partner with a company in one area of our business and compete with them in another. In particular, in delivering our Vantage platform in a cloud environment to certain of our customers, we partner with each of Amazon, Google, and Microsoft, which are public cloud service providers. The status of our business relationships with these companies can influence our ability to compete for analytic data solutions opportunities in such areas. In addition, we see additional competition from both established and emerging companies such as Cloudera, MongoDB, Pivotal Software and Snowflake. Failure to compete successfully with new or existing competitors in these and other areas could have a material adverse impact on our ability to generate additional revenues or sustain existing revenue levels.\nPrivacy concerns and laws such as the European Union’s General Data Protection Regulation, evolving regulation of cloud computing, cross-border data transfer restrictions and other domestic or foreign regulations may limit the use and adoption of our solutions and services and adversely affect our business.\nRegulation related to the provision of services over the Internet is evolving, as federal, state and foreign governments continue to adopt new, or modify existing, laws and regulations addressing data privacy and the collection, processing, storage, transfer and use of data. In some cases, new data privacy laws and regulations, such as the European Union’s General Data Protection Regulation that took effect in May 2018, the California Consumer Privacy Act, which took effect in January 2020, and an amended Act on the Protection of Personal Information in Japan, expected to take effect in spring 2022, impose new obligations directly on the Company as both a data controller and a data processor, as well as on many of our customers. These new laws may require us to make changes to our solutions and services to enable Teradata and/or our customers to comply with the new legal requirements and may also increase our potential liability exposure through higher potential penalties for non-compliance. Further, laws such as the European Union’s proposed e-Privacy Regulation are increasingly aimed at the use of personal information for marketing purposes, and the tracking of individuals’ online activities. These new or proposed laws and regulations are subject to differing interpretations and may be inconsistent among jurisdictions. These and other requirements could reduce demand for our solutions and services, require us to take on more onerous obligations in our contracts, restrict our ability to store, transfer and process data or, in some cases, impact our ability to offer our solutions and services in certain locations or our customers' ability to deploy our solutions globally. For example, legal challenges in Europe regarding how companies transfer personal data from the European Economic Area to the United States could result in further limitations on the ability to transfer data across borders, particularly if governments are unable or unwilling to reach new or maintain existing agreements that support cross-border data transfers, such as renewing the EU-U.S. and Swiss-U.S. Privacy Shield framework. Additionally, certain countries have passed or are considering passing laws requiring local data residency. The costs of compliance with, and other burdens imposed by, privacy laws, regulations and standards may limit the use and adoption of our solutions and services, reduce overall demand for our solutions and services, make it more difficult to meet expectations from or commitments to customers, lead to significant fines, penalties or liabilities for noncompliance, or slow the pace at which we close sales transactions, any of which could harm our business.\nIn addition to government activity, privacy advocacy and other industry groups have established or may establish new self-regulatory standards that may place additional burdens on our ability to provide our solutions and services globally. Our customers expect us to meet voluntary certification and other standards established by third parties, such as related International Organization for Standardization (\"ISO\") standards. If we are unable to maintain these certifications or meet these standards, it could adversely affect our ability to provide our solutions to certain customers and could harm our business\nFurthermore, concerns regarding data privacy may cause our customers’ customers to resist providing the data necessary to allow our customers to use our solutions and services effectively. Even the perception that the privacy\nof personal information is not satisfactorily protected or does not meet regulatory requirements could inhibit sales of our offerings or services and could limit adoption of our cloud-based solutions.\nRISKS RELATED TO HUMAN CAPITAL\nWe depend on key employees and face competition in hiring and retaining qualified employees.\nOur employees and access to talent are critical to our success. Our future success depends on our ability to attract and retain the services of senior management and key personnel in all functional areas of our Company, including engineering and development, marketing and sales professionals, and consultants. Competition for highly skilled personnel and acquired talent in the IT industry is intense. Furthermore, to advance our cloud-first strategy, we are required to attract and retain talent with expertise in cloud-based technologies, particularly with respect to our engineering and development teams. No assurance can be made that key personnel will remain with us, and it may be difficult and costly to replace such employees and/or obtain qualified talent who are not employees. Our failure to hire, retain and replace our key personnel could have a material adverse impact on our business operations.\nRISKS RELATED TO LEGAL AND REGULATORY MATTERS\nWe face uncertainties regarding legal proceedings, complex and changing laws and regulations, and other related matters.\nIn the normal course of business, we are subject to proceedings, lawsuits, claims and other matters, including those that relate to the environment, health and safety, employee benefits, export compliance, intellectual property, a variety of local laws and regulations, and other regulatory compliance and general matters. See \"Note 10-Commitments and Contingencies\" in the Notes to Consolidated Financial Statements elsewhere in this Annual Report. Because such matters are subject to many uncertainties, their outcomes are not predictable. There can be no assurances that the amounts required to satisfy alleged liabilities from such matters will not impact future operating results.\nIn addition, we are subject to diverse and complex laws and regulations, including those relating to corporate governance, public disclosure and reporting, which are rapidly changing and subject to many possible changes in the future. From time to time, we may conduct internal investigations in connection with our efforts to ensure compliance with such laws and regulations, the costs or results of which could impact our financial results. In addition, we may be subject to unexpected costs in connection with new public disclosure or other regulatory requirements that are issued from time to time. Laws and regulations impacting our customers, such as those relating to privacy, data protection and digital marketing, could also impact our future business. Because we do business in the government sector, we are generally subject to audits and investigations which could result in various civil or criminal fines, penalties or administrative sanctions, including debarment from future government business, which could negatively impact the Company’s results of operations or financial condition.\nIn addition, our facilities and operations, including former facilities and former operations for which we may have liabilities, are subject to a wide range of environmental protection laws. There can be no assurances that the costs required to comply with applicable environmental laws will not adversely impact future operating results.\nManagement time and resources are spent to understand and comply with changing laws, regulations and standards relating to such matters as corporate governance, accounting principles, public disclosure, SEC regulations, Basel III and the rules of the New York Stock Exchange (\"NYSE\") where our shares are listed. Rapid changes in accounting standards, and federal securities laws and regulations, among others, may substantially increase costs to our organization, challenge our ability to timely comply with all of them and could have an impact on our future operating results.\nInadequate protection of Teradata’s intellectual property or infringement of intellectual property that is owned by others could impact our business and financial condition.\nAs a technology company, our intellectual property portfolio is crucial to our continuing ability to be a leading multi-cloud data warehouse platform provider. We strive to protect and enhance our proprietary intellectual property rights through patent, copyright, trademark and trade secret laws, as well as through technological\nsafeguards. These efforts include protection of the offerings and application, diagnostic and other software we develop.\nIf we are not successful in protecting our intellectual property, our business could be materially adversely impacted. We may be unable to prevent third parties from using our technology without our authorization or independently developing technology that is similar to ours, particularly in those countries where the laws do not protect our proprietary rights as fully as in the United States (such as Iran, China and certain European Eastern Bloc countries who may use NSSAPC to advance their own industries). With respect to our pending patent applications, we may not be successful in securing patents for these claims, and our competitors may already have applied for patents that, once issued, will prevail over our patent rights or otherwise limit our ability to sell our offerings.\nWhile we take steps to provide for confidentiality obligations of employees and third parties with whom we do business (including customers, suppliers and strategic partners), there is a risk that such parties will breach such obligations and jeopardize our intellectual property rights. Many customers have outsourced the administration and management of their data warehouses to third parties, including some of our competitors, who then have access to our confidential information. Although we have agreements in place to mitigate this risk, there can be no assurance that such protections will be sufficient. In addition, our ability to capture and re-use field-based developed intellectual property is important to future business opportunities and margins.\nWe have seen a trend towards aggressive enforcement of intellectual property rights as the functionality of offerings in our industry increasingly overlaps and the volume of issued software patents continues to grow. As a result, we have been, and in the future could be, subject to infringement claims which, regardless of their validity, could:\n•Be expensive, time consuming and divert management attention away from normal business operations;\n•Require us to pay monetary damages or enter into non-standard royalty and licensing agreements;\n•Require us to modify our product sales and development plans; or\n•Require us to satisfy indemnification obligations to our customers.\nRegardless of whether these claims have any merit, they can be burdensome to defend or settle and can harm our business, reputation, financial condition and results of operations.\nA change in our effective tax rate can have a significant adverse impact on our business.\nA number of factors may adversely impact our future effective tax rates, such as:\n•The jurisdictions in which our profits are determined to be earned and taxed;\n•The resolution of issues arising from tax audits with various tax authorities;\n•Changes in the valuation of our deferred tax assets and liabilities;\n•Adjustments to estimated taxes upon finalization of various tax returns; and\n•Changes in available tax credits, especially surrounding tax credits in the United States for our research and development activities.\nTax rules may change in a manner that adversely affects our future reported results of operations or the way we conduct our business. Further changes in the tax laws of foreign jurisdictions could arise as a result of the base erosion and profit shifting project that was undertaken by the Organization for Economic Co-operation and Development (\"OECD\"). The OECD, which represents a coalition of member countries, recommended changes to numerous long-standing tax principles related to transfer pricing. Our income tax obligations are based in part on our corporate structure and inter-company arrangements, including the manner in which we develop, value, and use our intellectual property and the valuations of our inter-company transactions. Tax authorities may disagree with certain positions we have taken and assess additional taxes. We regularly assess the likely outcomes of these audits to determine the appropriateness of our tax provision, however, there can be no assurance that we will accurately predict the outcomes of these audits, and the actual outcomes of these audits could have a material impact on our financial condition or results of operations.\nRISKS RELATED TO OUR FINANCIAL CONDITION\nOur indebtedness could adversely affect our financial condition and limit our financial flexibility.\nThe Company's indebtedness could:\n•Expose us to interest rate risk;\n•Increase our vulnerability to general adverse economic and industry conditions;\n•Limit our ability to obtain additional financing or refinancing at attractive rates;\n•Require the dedication of a substantial portion of our cash flow from operations to the payment of principal of, and interest on, our indebtedness, thereby reducing the availability of such cash flow to fund our growth strategy, working capital, capital expenditures, share repurchases and other general corporate purposes;\n•Limit our flexibility in planning for, or reacting to, changes in our business and the industry; and\n•Place us at a competitive disadvantage relative to our competitors with less debt.\nFurther, our outstanding indebtedness is subject to financial and other covenants, which may be affected by changes in economic or business conditions or other events that are beyond our control. If we fail to comply with the covenants under any of our indebtedness, we may be in default under the loan, which may entitle the lenders to accelerate the debt obligations. To avoid defaulting on our indebtedness, we may be required to take actions such as reducing or delaying capital expenditures, reducing or eliminating stock repurchases, selling assets, restructuring or refinancing all or part of our existing debt, or seeking additional equity capital, any of which may not be available on terms that are favorable to us, if at all.\nIn addition, the United Kingdom’s Financial Conduct Authority, which regulates the London Interbank Offered Rate (\"LIBOR\"), announced that it intends to phase out LIBOR by the end of 2021 or, for certain tenors of United States Dollar LIBOR, by the end of 2023. We have certain financial contracts, including our revolving credit agreement, term loan agreement, and interest rate swaps, that are indexed to LIBOR. The U.S. Federal Reserve has begun publishing a Secured Overnight Funding Rate, which is intended to replace U.S. dollar LIBOR. Plans for alternative reference rates for other currencies have also been announced. At this time, we cannot predict how markets will respond to these proposed alternative rates or the effect of any changes to LIBOR or the discontinuation of LIBOR. If LIBOR is no longer available or if our lenders have increased costs due to changes in LIBOR, we may experience potential increases in interest rates on our variable rate debt, which could adversely impact our interest expense, results of operations and cash flows.",
    "item_1B": "Item 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item_2": "Item 2. PROPERTIES\nAs of December 31, 2020, Teradata operated 79 facilities in 35 countries consisting of approximately 1.4 million square feet throughout the world. Approximately 33% of this square footage is owned and the rest is leased. Within the total facility portfolio, Teradata operates 11 research and development facilities totaling approximately 400 thousand square feet, of which approximately 54% is owned. The remaining approximately 1 million square feet of space includes office, repair, warehouse and other miscellaneous sites, and is 24% owned and 76% leased. Teradata believes its facilities are suitable and more than adequate to meet its current needs. Teradata’s corporate headquarters is in San Diego, California.",
    "item_3": "Item 3. LEGAL PROCEEDINGS\nThe information required to be set forth under this Item 3 is incorporated by reference to Note 10, Commitments and Contingencies-Legal Proceedings of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K.",
    "item_4": "Item 4. MINE SAFETY DISCLOSURES\nN/A.\nPART II",
    "item_5": "Item 5. MARKET FOR THE REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nTeradata common stock trades on the New York Stock Exchange under the symbol \"TDC.\" There were approximately 28,287 registered holders of Teradata common stock as of February 4, 2021.\nTeradata has not paid cash dividends and does not anticipate the payment of cash dividends to holders of Teradata common stock in the immediate future. The declaration of dividends in the future would be subject to the discretion of Teradata’s Board of Directors.\nThe information under the caption \"Stock Ownership\" and the caption \"Current Equity Compensation Plan Information\" in Part III, Item 12 of this Annual Report on Form 10-K is also incorporated by reference in this section.\nThe following graph compares the relative performance of Teradata stock, the Standard & Poor’s (\"S&P\") 500 Stock Index and the S&P Information Technology Index. This graph covers the five-year period from December 31, 2015 to December 31, 2020. In each case, assumes a $100 investment on December 31, 2015, and reinvestment of all dividends, if any.\nAs of December 31,\nCompany/Index 2015 2016 2017 2018 2019 2020\nTeradata Corporation $ 100 $ 103 $ 146 $ 145 $ 101 $ 85\nS&P 500 Index $ 100 $ 112 $ 136 $ 130 $ 171 $ 203\nS&P Information Technology Index $ 100 $ 114 $ 158 $ 158 $ 237 $ 341\nPurchases of Equity Securities by the Issuer and Affiliated Purchases\nSection 16 officers occasionally transfer vested shares earned under restricted stock awards to the Company at the current market price to cover their withholding taxes. For the year ended December 31, 2020, the total of these purchases was 200,685 shares at an average price of $23.32 per share.\nThe following table provides information relating to the Company’s repurchase of common stock for the year ended December 31, 2020:\nTotal\nNumber\nof Shares Purchased Average\nPrice\nPaid\nper Share Total\nNumber\nof Shares\nPurchased\nas Part of\nPublicly\nAnnounced\nDilution\nOffset Program (1) Total\nNumber\nof Shares\nPurchased\nas Part of\nPublicly\nAnnounced\nGeneral\nShare\nRepurchase Program (2) Maximum\nDollar\nValue\nthat May\nYet Be\nPurchased\nUnder the\nDilution\nOffset Program Maximum\nDollar\nValue\nthat May\nYet Be\nPurchased\nUnder the\nGeneral Share\nRepurchase Program\nPeriod\nFirst quarter total 3,656,766 $ 20.52 208,078 3,448,688 $ 1,317,522 $ 432,248,874\nSecond quarter total - $ - - - $ 4,374,148 $ 432,248,874\nThird quarter total - $ - - - $ 7,538,584 $ 432,248,874\nOctober 2020 - $ - - - $ 8,482,039 $ 432,248,874\nNovember 2020 662,619 $ 21.13 429,440 233,179 $ 366,961 $ 427,248,910\nDecember 2020 486,805 $ 22.59 - 486,805 $ 1,368,549 $ 416,253,939\nFourth quarter total 1,149,424 $ 21.75 429,440 719,984 $ 1,368,549 $ 416,253,939\n2020 Full year total 4,806,190 $ 20.81 637,518 4,168,672 $ 1,368,549 $ 416,253,939\n1.The dilution offset program allows the Company to repurchase Teradata common stock to the extent of cash received from the exercise of stock options and the ESPP to offset dilution from shares issued pursuant to these plans.\n2.The general share repurchase program authorized by the Board allows the Company to repurchase outstanding shares of Teradata common stock. Share repurchases made by the Company are reported on a trade date basis. On July 28, 2019, Teradata's Board of Directors authorized an additional $500 million to be utilized to repurchase Teradata common stock under this share repurchase program. The general share repurchase program expires on July 27, 2022.",
    "item_6": "Item 6. The Company has applied the amendment to Regulation S-K Item 301, which became effective on February 10, 2021.",
    "item_7": "Item 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (\"MD&A\")\nYou should read the following discussion in conjunction with the consolidated financial statements and the notes to those statements included elsewhere in this Annual Report on Form 10-K (\"Annual Report\"). This Annual Report contains certain statements that are forward-looking within the meaning of the Private Securities Litigation Reform Act of 1995. Certain statements contained in the MD&A are forward-looking statements that involve risks and uncertainties. The forward-looking statements are not historical facts, but rather are based on current expectations, estimates, assumptions and projections about our industry, business and future financial results. Our actual results could differ materially from the results contemplated by these forward-looking statements due to several factors, including those discussed in other sections of this Annual Report. See \"Risk Factors\" and \"Forward-looking Statements.\"\nOVERVIEW\nTeradata Corporation is a leading multi-cloud data warehouse platform provider focused on helping companies leverage their data across an enterprise to uncover real-time intelligence, at scale. In doing so, we enable companies to find answers to their toughest business challenges. Our platform enables customers to integrate and simplify their multi-cloud data and analytic ecosystems, streamline access and management of their data, and use analytics to derive business value from diverse data types. Our platform is composed of our data warehouse platform - Teradata Vantage - enabled to run across on-premises, private cloud and public cloud environments. This platform is supported by business consulting and support services that enable customers to extract insights from across a company’s entire data and analytics ecosystem. Teradata’s strategy is discussed under Part I, Item I of this Annual Report on Form 10-K.\nTo drive operational excellence within Teradata, we are in the process of realigning and streamlining our operations as we pursue our business transformation and strategy to become a cloud-first growth company. As part of these activities, on November 2, 2020, the Company approved a plan to realign and reduce its workforce and rationalize its real estate footprint. The workforce measures involved involuntary headcount reduction actions. Separately, in September 2020, we offered a voluntary separation program (\"VSP\") to specific tenured employees as part of our efforts to improve our cost structure. For more information regarding the VSP, see Note 16 to Notes to Consolidated Financial Statements. The rationalization of the Company’s real estate footprint involves terminating leases relating to certain of the Company’s offices globally and transitioning impacted employees to a permanent virtual working environment, co-working space or facility, depending on business need. This is also consistent with the industry trend of working from a home-hybrid model.\nWe are continuing to execute on our key priorities, including significant product expansion of our Teradata Vantage multi-cloud data warehouse platform offering, expanding our footprint with existing customers and adding net new customers, increasing our focus on diversity and inclusiveness, and driving operational excellence and agility across the company.\nTo allow for greater transparency regarding the progress we are making toward achieving our strategic objectives, we utilize the following financial and performance metrics:\n•Annual Recurring Revenue (\"ARR\") - annual contract value for all active and contractually binding term-based contracts at the end of a period. ARR includes maintenance, software upgrade rights, public cloud and on-premises subscription-based transactions and managed services.\n•Public cloud ARR (included within total ARR) - annual contract value for all active and contractually binding term based contracts at the end of a period that are operated in a public cloud environment; and\n•Remaining performance obligation (\"RPO\")/Backlog - the price of firm orders for which work has not been performed or goods have not been delivered and the Company is contractually required to perform.\nCOVID-19 Update\nDuring the twelve months ended December 31, 2020, the effects of the coronavirus disease 2019 (\"COVID-19\") pandemic and the related actions by governments around the world to attempt to contain the spread of the virus have impacted our business globally, and we expect our business will continue to be impacted for the foreseeable future. In particular, the outbreak and related preventive measures taken to contain COVID-19 beginning late in the first quarter of 2020 negatively impacted our ability to close transactions with customers and timely collect receivables in certain instances, which impacted our revenue and cash flow results for the first quarter. However, during the back half of 2020, we recovered from this impact, and as a result, we experienced a more favorable trend with meaningful ARR growth, strong cash flows and recurring revenue growth generated in these quarters, although we continued to see COVID-19 negatively impact our consulting business as described below.\nIn response to the pandemic, we have taken actions to manage expenses and costs appropriately in light of the uncertainty COVID-19 has created, which has had a positive impact on our operating performance. We continue to keep a watchful eye on COVID-19 impacts to our business and have undertaken additional expense management and cost measures to further drive our operating performance and provide agility in the event of an unforeseen reduction in demand should it occur. During 2020, we also experienced increased volatility in foreign currency exchange rates, in part related to the uncertainty from COVID-19, as well as actions taken by governments and\ncentral banks in response to COVID-19. Certain foreign currency rates have depreciated significantly against the U.S. dollar during this period. We expect continued volatility in foreign currency exchange rates in 2021.\nOur supply chain has been relatively stable with respect to manufacturing and distribution capabilities; however, our supply chain is susceptible to volatility due to ongoing uncertainty as a result of ongoing international and domestic pandemic response and recovery efforts. Operationally, we have been able to run our business without significant interruptions, with the vast majority of employees having shifted quickly as of mid-March 2020 to a work-from-home model, which remains in effect. However, our consulting business has been negatively impacted during the transition to work from home and shelter-in-place orders. Our customers’ reduction in discretionary spending in light of COVID-19 uncertainties has also impacted our consulting business, with consulting projects being delayed or suspended by our customers. We implemented several employee engagement and communication programs designed to support employees’ health and well-being while also enhancing their productivity during the pandemic.\nOur priorities in formulating and implementing our response to the COVID-19 pandemic and related business disruption include the following:\n•People - protecting the health and well-being of our employees,\n•Customers - proactively connecting with our customers to support their needs and meet our service level commitments, while continuing to help them gain real business value from their data assets,\n•Supply Chain - proactively working to monitor existing inventory, supplier availability and securing inventory for future quarters,\n•Financial - responsibly managing expenses and costs to provide financial agility during the extended period of global economic uncertainty,\n•Global Community - making our technology available to customers, partners and communities, particularly in healthcare and government, where collectively we can positively impact efforts in combating COVID-19, and\n•Future of Work - planning to best position the Company to emerge as strong as possible when the COVID-19 pandemic ends.\nAs of the date of this Annual Report on Form 10-K, we are continuing to execute our pandemic response plan, and the Teradata Pandemic Response Team is refining and executing return-to-office plans with \"safety first\" considerations. Customer-facing teams are also proactively working to identify ways to assist customers, meet service level commitments, and engage with customers via virtual events.\nDespite these efforts, there remains a fair degree of uncertainty regarding the potential impact of the pandemic on our business, from both a financial and operational perspective, and the scope and costs associated with additional measures that may be necessary in response to the pandemic going forward. We will continue our diligent efforts to monitor and respond as appropriate to the impacts of the pandemic on our business, including the status of our workforce, supply chain, customers, suppliers, and vendors, based on the priorities described above. Our actions will continue to be informed by the requirements and recommendations of the federal, state or local authorities. We will remain agile and have contingency plans in place to appropriately respond to conditions as they unfold. For more information, see \"Risk Factors\" under Part I, Item 1A of this Annual Report on Form 10-K.\n2020 FINANCIAL OVERVIEW\nAs more fully discussed in later sections of this MD&A, the following are the financial highlights for 2020:\n•Revenue of $1,836 million decreased by 3% in 2020 as compared to 2019, with an underlying 7% increase in recurring revenue primarily driven by our transition from perpetual to subscription-based transactions. The increase in recurring revenue was more than offset by a 31% decrease in perpetual software licenses and hardware revenue and a 28% decrease in consulting services revenue. The decline in consulting service revenue is in alignment with our strategy as well as due to the impact of COVID-19 as discussed above.\n•Gross margin was 55.5% in 2020, an increase from 50.3% in 2019, primarily due to a higher recurring revenue mix as compared to the prior year.\n•Operating expenses in 2020 increased by 6% as compared to 2019, primarily due to expenses related to the VSP offered to employees, an increase in investments in cloud transformation, and employee stock-based compensation expense.\n•Operating income was $16 million in 2020, up from $10 million in 2019.\n•Net income was $129 million in 2020 versus a net loss of $20 million in 2019, primarily due to discrete tax items. Net earnings per share was $1.16 in 2020 compared to net loss per share of $0.18 in 2019.\nRESULTS FROM OPERATIONS FOR THE YEARS ENDED DECEMBER 31, 2020, 2019 AND 2018\nIn July 2019, the Financial Accounting Standards Board (\"FASB\") issued Accounting Standards Update 2019-07, \"Codification Updates to SEC Sections-Amendments to SEC Paragraphs Pursuant to SEC Final Rule Releases No. 33-10532, Disclosure Update and Simplification\", which makes a number of changes meant to simplify certain disclosures in financial condition and results of operations, particularly by eliminating year-to-year comparisons between prior periods previously disclosed. In accordance with the relevant aspects of the rule covering the current year annual report, we now include disclosures on results of operations for fiscal year 2020 versus 2019 only. For discussion of fiscal year 2019 versus 2018 see \"Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\" in our Annual Report filed with the SEC for the fiscal year ended December 31, 2019.\nRevenue\n% of % of\nIn millions 2020 Revenue 2019 Revenue\nRecurring $ 1,451 79.0 % $ 1,362 71.7 %\nPerpetual software license and hardware 73 4.0 % 106 5.6 %\nConsulting services 312 17.0 % 431 22.7 %\nTotal revenue $ 1,836 100 % $ 1,899 100 %\n2020 compared to 2019 -Total revenue decreased $63 million, or 3%, in 2020. Recurring revenue grew 7%, primarily driven by our movement to subscription-based transactions from perpetual software licenses and hardware transactions, consistent with our strategy. Under subscription models, we recognize revenue over time as opposed to the upfront recognition under the perpetual model. Better than expected ARR growth also contributed to the increase in recurring revenue. For full year 2021, we expect ARR growth and recurring revenue growth at a mid- to high-single digit percentage increase as compared to 2020. Public cloud ARR is expected to increase by at least 100% year-over-year. Taking into consideration the growth in recurring revenue offset by reduced perpetual software licenses and hardware revenue and reduced consulting services revenue, we expect that total revenue is expected to grow at a low-single-digit percentage in 2021 as compared to 2020.\nRevenues from perpetual software licenses and hardware decreased 31% in 2020 as customers continue to transition to subscription-based offerings.\nConsulting services revenue decreased 28%, as we are realigning and focusing our consulting resources on higher-margin engagements that drive increased software consumption within our targeted customer base. Consulting revenue was also impacted by the transition to work from home and shelter-in-place orders that went in effect late in the first quarter of 2020 in response to COVID-19 as well as delays and/or cancellations of consulting projects due to customers’ reduced spending in light of COVID-19.\nAs a portion of the Company’s operations and revenue occur outside the United States, and in currencies other than the U.S. dollar, the Company is exposed to fluctuations in foreign currency exchange rates. Based on currency rates as of January 31, 2020, Teradata is expecting two percentage points of positive impact from currency translation on our 2021 full-year total revenues.\nIncluded below are financial and performance growth metrics for 2020:\n•ARR was $1.587 billion at the end of 2020, a 11% increase from $1.427 billion at the end of 2019\n•Public cloud ARR was $106 million at the end of 2020, a 165% increase from $40 million at the end of 2019\n•Total backlog grew 7% to $2.921 billion\nOur ARR is composed of three main categories: (1) ARR related to subscription and public cloud software licenses, (2) ARR related to our legacy perpetual maintenance and software upgrade rights, and (3) ARR related to subscription-based managed services. At December 31, 2020, our ARR consisted of:\n•$960 million of subscription and public cloud-related ARR, up 37%;\n•$508 million of perpetual license maintenance and software upgrade rights-related ARR, down 17%; and\n•$119 million of subscription-based managed services ARR, up 6%.\nThis decline in our maintenance and software upgrade-related ARR, compared to 2019 was expected as the Company completes its transition to a subscription model and customers increasingly purchase Teradata on a subscription and/or public cloud basis.\nThe rate of our transition to a recurring revenue model has been significantly faster than expected, and we believe it is reflective of the value our customers see in our subscription model and cloud offerings.\nTeradata will be realigning its ARR and revenue disclosures beginning the first quarter of 2021, removing managed services and third-party software from subscription-based ARR and recurring revenue. Managed services revenue will be included in \"Consulting services revenue\" in 2021 and third-party software will be moved to \"Perpetual software licenses, hardware and other revenue.\"\nGross Profit\nThe Company often uses specific terms and definitions to describe variances in gross profit. The terms and definitions most often used are as follows:\n•Revenue Mix - The proportion of recurring, consulting, and perpetual software licenses and hardware that generates the total revenue of the Company. Changes in revenue mix can have an impact on gross profit even if total revenue remains unchanged.\n•Recurring Revenue Mix - The proportion of various recurring revenue offerings that comprise the total of recurring revenue. For example, a higher mix of subscriptions including hardware rentals could have a negative impact on total recurring gross profit.\n•Deal Mix - Refers to the type of transactions closed within the period that generate the total perpetual software license and hardware revenue. For example, a higher mix of hardware versus software or the mix of Teradata versus third-party products can impact profitability.\nGross profit for the following years ended December 31 was as follows:\n% of % of\nIn millions 2020 Revenue 2019 Revenue\nGross profit\nRecurring $ 974 67.1 % $ 920 67.5 %\nPerpetual software licenses and hardware 34 46.6 % 22 20.8 %\nConsulting services 11 3.5 % 13 3.0 %\nTotal gross profit $ 1,019 55.5 % $ 955 50.3 %\n2020 compared to 2019 - The decrease in recurring gross profit as a percentage of revenue was primarily driven by a higher mix of subscription-based revenue as compared to the prior-year period. Subscription-based transactions\nare typically lower margin as compared to the recurring revenue from legacy software maintenance and software upgrade rights, due to the higher mix of rental hardware.\nThe increase in perpetual software licenses and hardware gross profit as a percentage of revenue was primarily driven by deal mix as compared to the prior year.\nConsulting services gross profit as a percentage of revenue increased as compared to the prior year primarily due to improved resource mix utilization as well as increased price realization and our continued strategic focus to improve consulting margins. The Company continues to refocus our consulting organization on Vantage-oriented offerings and reduce our footprint in non-core consulting engagements.\nAs part of our restructuring actions, we have moved to a more variable consulting cost structure starting in 2021, which is designed to improve the profitability of our consulting business.\nOperating Expenses\n% of % of\nIn millions 2020 Revenue 2019 Revenue\nOperating expenses\nSelling, general and administrative expenses $ 669 36.4 % $ 618 32.5 %\nResearch and development expenses 334 18.2 % 327 17.2 %\nTotal operating expenses $ 1,003 54.6 % $ 945 49.8 %\n2020 compared to 2019 - The SG&A expense increase was primarily driven by an increase in stock-based compensation expense, the VSP, amortization of capitalized sales compensation, as well as additional investments in our go-to-market and customer success teams.\nR&D expenses increased primarily due to the VSP and a re-prioritization of our R&D organization on strategic initiatives and reduced spending on de-prioritized initiatives, while increasing investments in Cloud transformations.\nOther Expense, net\nIn millions 2020 2019\nInterest income $ 4 $ 12\nInterest expense (27) (26)\nOther (17) (9)\nTotal Other Expense, net $ (40) $ (23)\nOther expense, net in 2020 and 2019 is comprised primarily of interest expense on long-term debt and finance leases, partially offset by interest income earned on our cash and cash equivalents as well as benefit costs for our pension and postemployment plans. Other expense, net increased compared to the prior year primarily due to lower interest income generated on investments due to lower invested balances and lower interest rates, increased benefit costs for our pension and postemployment plans, and losses resulting from foreign currency transactions.\nProvision for Income Taxes\nThe effective income tax rate for the following years ended December 31 was as follows:\n2020 2019\nEffective Tax Rate 637.5 % (53.8) %\nThe 2020 effective tax rate included a net $157 million of discrete tax benefit. Discrete tax benefit of $157 million, was recorded related to the transfer of foreign intellectual property as more fully described below. In addition, the Company recognized a net $13 million of tax benefit resulting from the CARES Act of 2020, which allows U.S.\ncorporations a one-time opportunity to claim income tax refunds by allowing a 5-year net operating loss (\"NOL\") carry-back for taxable losses incurred in the tax year 2020. Teradata intends to carry back its 2020 NOL to claim a refund for taxes it paid in 2015, which created a one-time income tax benefit for the difference between the 35% 2015 carry back tax rate and the current 21% federal statutory rate. These tax benefits were partially offset by $9 million tax expense related to stock-based compensation and $4 million of incremental global intangible low-taxed income (\"GILTI\") tax. These discrete net tax benefits resulted in full-year total income tax benefit in 2020 of $153 million, on a pre-tax net loss of $24 million, causing a tax rate of 637.5%.\nThe 2019 effective tax rate was impacted by $3 million tax expense related to stock-based compensation and $3 million of incremental GILTI tax, which resulted in a full-year income tax expense in 2019 of $7 million, on a pre-tax net loss of $13 million, causing a negative tax rate of 53.8%.\nThe Company is expecting its full-year effective tax rate for 2021 to be approximately 29%, which takes into consideration, among other things, the forecasted earnings mix by jurisdiction and the estimated discrete items to be recognized in 2021. The forecasted tax rate is based on the overseas profits being taxed at an overall effective tax rate of approximately 23%, as compared to the federal statutory tax rate of 21% in the U.S.\nRevenue and Gross Profit by Operating Segment\nTeradata manages its business under three geographic regions, which are also the Company’s operating segments: (1) Americas region (North America and Latin America); (2) EMEA region (Europe, Middle East, and Africa) and (3) APJ region (Asia Pacific and Japan). For purposes of discussing results by segment, management excludes the impact of certain items, consistent with the manner by which management evaluates the performance of each segment. This format is useful to investors because it allows analysis and comparability of operating trends. It also includes the same information that is used by Teradata management to make decisions regarding the segments and to assess financial performance. The chief operating decision maker, who is our President and Chief Executive Officer, evaluates the performance of the segments based on revenue and multiple profit measures, including segment gross profit. For management reporting purposes, assets are not allocated to the segments. Our segment results are reconciled to total company results reported under GAAP in Note 14 of Notes to Consolidated Financial Statements.\nThe following table presents revenue and operating performance by segment for the years ended December 31:\n% of % of\nIn millions 2020 Revenue 2019 Revenue\nSegment revenue\nAmericas $ 1,025 55.8 % $ 1,057 55.7 %\nEMEA 485 26.4 % 492 25.9 %\nAPJ 326 17.8 % 350 18.4 %\nTotal segment revenue $ 1,836 100 % $ 1,899 100 %\nSegment gross profit\nAmericas $ 631 61.6 % $ 626 59.2 %\nEMEA 273 56.3 % 239 48.6 %\nAPJ 168 51.5 % 148 42.3 %\nTotal segment gross profit $ 1,072 58.4 % $ 1,013 53.3 %\n2020 compared to 2019\nAmericas\nAmericas revenue decreased 3% and included a 1% negative impact from foreign currency fluctuations. An increase in recurring revenue of 1% was offset by a decrease of 5% in perpetual software licenses and hardware revenue and a decrease in consulting revenue of 27%. Segment gross profit as a percentage of revenues was higher primarily due to an overall higher mix of recurring revenue.\nEMEA\nEMEA revenue decreased 1%, which included a 1% favorable impact from foreign currency fluctuations. An increase of 19% in recurring revenue was offset by a decrease of 47% in perpetual software licenses and hardware revenue and a decrease in consulting revenue of 31%. Segment gross profit as a percentage of revenues was higher primarily due to a higher mix of recurring revenue.\nAPJ\nAPJ revenue decreased 7%, which included no impact from foreign currency fluctuations. An increase in recurring revenue of 11% was offset by a decrease of 44% in perpetual software licenses and hardware revenue and a decrease in consulting revenue of 24%. Segment gross profit as a percentage of revenues was higher primarily due to a higher mix of recurring revenue.\nFINANCIAL CONDITION, LIQUIDITY AND CAPITAL RESOURCES\nTeradata ended 2020 with $529 million in cash and cash equivalents, a $35 million increase from the December 31, 2019 balance, after using approximately $100 million for repurchases of Company common stock during the year. Cash provided by operating activities increased by $119 million to $267 million in 2020 compared to 2019. Teradata used approximately $58 million of cash in 2020 for reorganizing and restructuring its operations and go-to-market functions to align to its strategy, as compared to $63 million in 2019. The increase in cash provided by operating activities was primarily due to improved management of working capital. Although the COVID-19 pandemic did not have a significant adverse impact on our financial results for 2020, we have reviewed our capital projects to ensure that we are only spending on projects that are deemed to be essential in the current environment. We have taken steps to manage spending on travel, third-party services and other operating expenses, and we continue to focus on cash flow generation. Terms of payments have been extended for certain customers in impacted industries; however, these extensions are not significant in aggregate. We do not expect the pandemic to have a significant adverse effect on our liquidity, as we believe that operating cash flows and available liquidity are sufficient to support operational needs for at least the next 12 months.\nTeradata’s management uses a non-GAAP measure called \"free cash flow,\" which is not a measure defined under GAAP. We define free cash flow as net cash provided by operating activities less capital expenditures for property and equipment and additions to capitalized software. Free cash flow is one measure of assessing the financial performance of the Company, and this may differ from the definition used by other companies. The components that are used to calculate free cash flow are GAAP measures taken directly from the Consolidated Statements of Cash Flows. We believe that free cash flow information is useful for investors because it relates the operating cash flow of the Company to the capital that is spent to continue and improve business operations. In particular, free cash flow indicates the amount of cash available after capital expenditures for, among other things, investments in the Company’s existing businesses, strategic acquisitions and repurchase of Teradata common stock. Free cash flow does not represent the residual cash flow available for discretionary expenditures since there may be other non-discretionary expenditures that are not deducted from the measure. This non-GAAP measure should not be considered a substitute for, or superior to, cash flows from operating activities under GAAP.\nThe table below shows net cash provided by operating activities and capital expenditures for the following periods:\nIn millions 2020 2019\nNet cash provided by operating activities $ 267 $ 148\nLess:\nExpenditures for property and equipment (44) (54)\nAdditions to capitalized software (7) (5)\nFree cash flow $ 216 $ 89\nFinancing activities and certain other investing activities are not included in our calculation of free cash flow. There were no other investing activities in 2020 and 2019.\nTeradata’s financing activities for the year ended December 31, 2020 primarily consisted of cash outflows of $100 million for share repurchases, repayment of existing term loan of $25 million and $70 million of payments on finance leases, partially offset by $9 million net inflows from other financing activities.\nTeradata’s financing activities for the year ended December 31, 2019 primarily consisted of cash outflows of $300 million for share repurchases, repayment of existing term loan of $19 million and $33 million of payments on finance leases, partially offset by $44 million net inflows from other financing activities.\nThe Company purchased 4.8 million shares of its common stock at an average price per share of $20.81 in 2020 and 8.5 million shares of its common stock at an average price per share of $35.38 in 2019.\nShare repurchases were made under two share repurchase programs initially authorized by our Board of Directors in 2008. The first of these programs (the \"dilution offset program\") authorizes the Company to repurchase Teradata common stock to the extent of cash received from the exercise of stock options and the Teradata Employee Stock Purchase Plan (\"ESPP\") to offset dilution from shares issued pursuant to these plans. As of December 31, 2020, under the Company’s second share repurchase program (the \"general share repurchase program\"), the Company had approximately $416 million of authorization remaining to repurchase outstanding shares of Teradata common stock. Share repurchases made by the Company are reported on a trade date basis.\nProceeds from the ESPP and the exercise of stock options, net of tax paid for shares withheld upon equity award settlement, were $9 million in 2020 and $44 million in 2019. These proceeds are included in other financing activities, net in the Consolidated Statements of Cash Flows.\nOur total cash and cash equivalents held outside the United States in various foreign subsidiaries was $342 million as of December 31, 2020 and $344 million as of December 31, 2019. The remaining balance held in the United States was $191 million as of December 31, 2020 and $150 million as of December 31, 2019. Prior to the enactment of the 2017 Tax Act, the Company either reinvested or intended to reinvest its earnings outside of the United States. As a result of the 2017 Tax Act, the Company has changed its indefinite reinvestment assertion related to foreign earnings that have been taxed in the United States and now considers a majority of these earnings no longer indefinitely reinvested. Effective January 1, 2018, the United States moved to a territorial system of international taxation, and as such will generally not subject future foreign earnings to United States taxation upon repatriation in future years.\nManagement believes current cash, cash generated from operations and the $400 million available under the Credit Facility will be sufficient to satisfy future working capital, research and development activities, capital expenditures, pension contributions, and other financing requirements for at least the next twelve months. The Company principally holds its cash and cash equivalents in bank deposits and highly-rated money market funds.\nThe Company’s ability to generate positive cash flows from operations is dependent on general economic conditions, competitive pressures, and other business and risk factors described elsewhere in this Annual Report. If the Company is unable to generate sufficient cash flows from operations, or otherwise to comply with the terms of the credit facility and term loan agreement, the Company may be required to seek additional financing alternatives.\nLong-term Debt. Our long-term debt and minimum debt obligations as of December 31, 2020 are discussed in Note 12 of Notes to Consolidated Financial Statements.\nLeases. In the normal course of business, the Company enters into operating and finance leases that impact, or could impact, our liquidity. Leases and minimum lease obligations as of December 31, 2020 are described in detail in Note 13 of Notes to Consolidated Financial Statements.\nContractual and Other Commercial Commitments. In the normal course of business, we enter into various contractual obligations that impact, or could impact, our liquidity. The following table and discussion outline our material obligations at December 31, 2020, with projected cash payments in the periods shown:\nTotal 2022- 2024- 2026 and\nIn millions Amounts 2021 2023 2025 Thereafter\nTransition tax $ 82 $ - $ 28 $ 54 $ -\nPurchase obligations 255 95 160 - -\nTotal transition tax and purchase obligations $ 337 $ 95 $ 188 $ 54 $ -\nTransition tax is the remaining payable balance as of December 31, 2020 of the one-time tax on accumulated foreign earnings resulting from the Tax Act. The payments associated with this deemed repatriation will be paid over seven years ending in 2025. Purchase obligations are committed purchase orders and other contractual commitments for goods and services and include non-cancelable contractual payments for fixed or minimum amounts to be purchased in relation to service agreements with various vendors for ongoing telecommunications, information technology, hosting and other services.\nAdditionally, the Company had $39 million in total uncertain tax positions recorded on its balance sheet as of December 31, 2020, of which $18 million is recorded in non-current liabilities and $21 million is reflected as an offset to deferred tax assets related to certain tax attribute carryforwards. These items are not included in the table of obligations shown above. The settlement period for the non-current income tax liabilities cannot be reasonably estimated as the timing and the amount of the payments, if any, will depend on possible future tax examinations with the various tax authorities. However, it is not expected that any payments will be due within the next 12 months.\nWe also have product warranties and guarantees to third parties, as well as postemployment and international pension obligations that may affect future cash flow. These items are not included in the table of obligations shown above. The Company is also potentially subject to concentration of supplier risk. Our hardware components are assembled exclusively by Flex Ltd. (\"Flex\"). Flex procures a wide variety of components used in the manufacturing process on our behalf. Although many of these components are available from multiple sources, Teradata utilizes preferred supplier relationships to better ensure more consistent quality, cost, and delivery. Typically, these preferred suppliers maintain alternative processes and/or facilities to ensure continuity of supply. Given the Company’s strategy to outsource its manufacturing activities to Flex and to source certain components from single suppliers, a disruption in production at Flex or at a supplier could impact the timing of customer shipments and/or Teradata’s operating results. In addition, a significant change in the forecasts to any of these preferred suppliers could result in purchase obligations or components that may be in excess of demand. Product warranties and third-party guarantees are described in detail in \"Note 10-Commitments and Contingencies\" in the Notes to Consolidated Financial Statements. Postemployment and pension obligations are described in detail in \"Note 8-Employee Benefit Plans\" in the Notes to Consolidated Financial Statements.\nOff-Balance Sheet Arrangements. We do not participate in transactions that generate relationships with unconsolidated entities or financial partnerships, such as entities often referred to as structured finance or special purpose entities, which would have been established for the purpose of facilitating off-balance sheet arrangements or for other contractually narrow or limited purposes.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nOur financial statements are prepared in accordance with GAAP. In connection with the preparation of these financial statements, we are required to make assumptions, estimates and judgments that affect the reported amounts of assets, liabilities, revenues, expenses and the related disclosure of contingent liabilities. These assumptions, estimates and judgments are based on historical experience and assumptions that are believed to be reasonable at the time. However, because future events and their effects cannot be determined with certainty, the determination of estimates requires the exercise of judgment. Our critical accounting policies are those that require assumptions to be made about matters that are highly uncertain. Different estimates could have a material impact on our financial results. Judgments and uncertainties affecting the application of these policies and estimates may result in materially different amounts being reported under different conditions or circumstances. Our management periodically reviews these estimates and assumptions to ensure that our financial statements are presented fairly and are materially correct.\nIn many cases, the accounting treatment of a particular transaction is specifically dictated by GAAP and does not require significant management judgment in its application. There are also areas in which management’s judgment in selecting among available alternatives would not produce a materially different result. The significant accounting policies and estimates that we believe are the most critical to aid in fully understanding and evaluating our reported financial results are discussed in the paragraphs below. Teradata’s senior management has reviewed these critical accounting policies and related disclosures with the Audit Committee of Teradata’s Board of Directors. For additional information regarding our accounting policies and other disclosures required by GAAP, see \"Note 1-\nDescription of Business, Basis of Presentation and Significant Accounting Policies\" in the Notes to Consolidated Financial Statements.\nRevenue Recognition\nOn January 1, 2018, we adopted ASC Topic 606, Revenue from Contracts with Customers (\"ASC 606\"). This standard replaced existing revenue recognition rules with a comprehensive revenue measurement and recognition standard and expanded disclosure requirements. Refer to Notes 1 and 3, of our audited consolidated financial statements included elsewhere in this Annual Report on Form 10-K for discussion of our revenue recognition policies.\nRevenue recognition for complex contractual arrangements requires judgment, including a review of specific contracts, past experience, creditworthiness of customers, international laws and other factors. Specifically, complex arrangements with nonstandard terms and conditions may require significant contract interpretation to determine the appropriate accounting. We must also apply judgment in determining all performance obligations in the contract and in determining the standalone selling price of each performance obligation, considering the price charged for each product when sold on a standalone basis and applicable renewal rates for services and subscriptions. Changes in judgments about these factors could impact the timing and amount of revenue recognized between periods.\nThe Company reviews the standalone selling price on a periodic basis and updates it, when appropriate, to ensure that the practices employed reflect the Company’s recent pricing experience. The Company maintains internal controls over the establishment and updates of these estimates, which includes review and approval by the Company’s management. For the year ended December 31, 2020 there was no material impact to revenue resulting from changes in the standalone selling price, nor does the Company expect a material impact from such changes in the near term.\nIncome Taxes\nIn accounting for income taxes, we recognize deferred tax assets and liabilities based on the differences between the financial statement carrying amounts and the tax basis of assets and liabilities. The deferred tax assets and liabilities are determined based on the enacted tax rates expected to apply in the periods in which the deferred tax assets or liabilities are expected to be settled or realized. The Company made an accounting policy election in 2018 related to the Tax Act to provide for the tax expense related to GILTI in the year the tax is incurred.\nPrior to the enactment of the Tax Act in December 2017, the Company had not provided for taxes on the undistributed earnings of its foreign subsidiaries as the Company either reinvested or intended to reinvest those earnings outside of the United States. Because of the Tax Act, the Company has changed its indefinite reinvestment assertion related to foreign earnings that have been taxed in the United States and now considers a majority of these earnings no longer indefinitely reinvested. The Company has recorded $2 million of deferred foreign tax expense with respect to certain earnings that are not considered permanently reinvested. Deferred taxes have not been provided on earnings considered indefinitely reinvested.\nWe account for uncertainty in income taxes by prescribing thresholds and attributes for the financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return. We may recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. We record any interest and/or penalties related to uncertain tax positions in the income tax expense line on our Consolidated Statements of Income. As of December 31, 2020, the Company has a total of $39 million of unrecognized tax benefits, of which $18 million is included in the other liabilities section of the Company’s consolidated balance sheet as a non-current liability. The remaining balance of $21 million of uncertain tax positions relates to certain tax attributes generated by the Company which are netted against the underlying deferred tax assets recorded on the balance sheet.\nWe regularly review our deferred tax assets for recoverability and establish a valuation allowance if it is more likely than not that some portion or all of a deferred tax asset will not be realized. We have recorded $51 million in 2020 and $45 million in 2019 for valuation allowances, a majority of which offset our California R&D tax credit carryfoward, as the Company expects to continue to generate excess California R&D tax credits into the foreseeable future.\nOn January 1, 2020, we transferred certain of our intellectual property among our wholly-owned subsidiaries, which resulted in the recognition of deferred tax assets of $157 million. The recognition of deferred tax assets from intra-entity transfers of intellectual property required us to make significant estimates and assumptions to determine the fair value of such intellectual property. Significant assumptions in valuing the intellectual property include, but are not limited to, internal revenue and expense forecasts, and the discount rate. The sustainability of our future tax benefits is dependent upon the acceptance of these valuation estimates and assumptions by the taxing authorities.\nStock-based Compensation\nWe measure compensation cost for stock awards at fair value and recognize compensation expense over the service period. In addition, we issue performance-based awards that vest only if specific performance conditions are satisfied. The number of shares that will be earned can vary based on actual performance. No shares will vest if the threshold objectives are not met. In the event the objectives are exceeded, additional shares will vest up to a maximum payout. The cost of these awards is expensed over the performance period based upon management’s estimate and analysis of the probability of meeting the performance criteria. Because the actual number of shares to be awarded is not known until the end of the performance period, the actual compensation expense related to these awards could differ from our current expectations. We account for forfeitures as they occur instead of estimating forfeitures at the time of grant and revising those estimates in subsequent periods if actual forfeitures differ from our estimates.\nGoodwill and Acquired Intangible Assets\nThe Company reviews goodwill for impairment annually and whenever events or changes in circumstances indicate the carrying value of goodwill may not be recoverable. For 2019, the Company performed a quantitative impairment test. In this test, the Company compares the fair value of each reporting unit to its carrying value. The Company typically determines the fair value of its reporting units using a weighting of fair values derived from the income and market approaches. Under the income approach, the Company calculates the fair value of a reporting unit based on the present value of estimated future cash flows. The market approach estimates fair value based on market multiples of revenue and earnings derived from comparable companies with similar operating and investment characteristics as the reporting unit. If the fair value of the reporting unit exceeds the carrying value of the net assets assigned to that unit, goodwill is not impaired. If the carrying value of the net assets assigned to the reporting unit exceeds the fair value of the reporting unit, then the company records an impairment loss equal to the difference. In the fourth quarter of 2020, the Company performed its annual impairment test of goodwill and determined that no impairment to the carrying value of goodwill was necessary.\nDetermining the fair value of goodwill and acquired intangibles is judgmental in nature and involves the use of significant estimates and assumptions. These estimates and assumptions include revenue growth rates and operating margins used to calculate projected future cash flows, discount rates and future economic and market conditions. The company’s estimates are based upon assumptions believed to be reasonable, but which are inherently uncertain and unpredictable. These valuations require the use of management’s assumptions, which may not reflect unanticipated events and circumstances that may occur.\nLeases\nOn January 1, 2019, the Company adopted ASU No. 2016-02, \"Leases (Topic 842)\", which requires leases with durations greater than twelve months to be recognized on the balance sheet. We determine if a contract contains a lease at inception. Our material operating leases consist of automobiles in certain countries and real estate, including office, storage and parking space. Our operating leases generally have remaining terms of 2-6 years. Our finance leases primarily consist of equipment financed for the purpose of delivering services to our customers and generally have terms of 3 years.\nOperating lease assets and liabilities are recognized at the lease commencement date. Operating lease liabilities represent the present value of lease payments not yet paid. Operating lease assets represent our right to use an underlying asset and are based upon the operating lease liabilities adjusted for prepayments or accrued lease payments, initial direct costs, lease incentives, and impairment of operating lease assets. To determine the present value of lease payments not yet paid, when available, the we use the rate implicit in the lease. However, real estate\nleases do not typically provide a readily determinable implicit rate. Therefore, we estimate the incremental borrowing rate to discount the lease payments based on information available at lease commencement. The incremental borrowing rate used in the calculation of the lease liability is based on the secured rate associated with financed lease obligations for each location of leased property. Many of our leases include variable rental escalation clauses which are recognized when incurred. Some of our leases also include renewal options and/or termination options that are factored into the determination of lease payments and lease terms when it is reasonably certain that the Company will exercise these options. Lease agreements do not contain any material residual value guarantees or material restrictive covenants. Leases with an initial term of 12 months or less are not recorded on the balance sheet. Changes in judgments and estimates, such as the likelihood of renewal options, impairments, or the incremental borrowing rate could impact the amounts of assets or liabilities recorded or could impact the amount of cost or expense recognized between periods.\nPension and Postemployment Benefits\nWe measure pension and postemployment benefit costs and credits using actuarial valuations. Actuarial assumptions attempt to anticipate future events and are used in calculating the expense and liability relating to these plans. These factors include assumptions we make about interest rates, expected investment return on plan assets, total and involuntary turnover rates, and rates of future compensation increases. In addition, our actuarial consultants also use subjective factors such as withdrawal rates and mortality rates to develop our valuations. We review and update these assumptions on an annual basis at the beginning of each fiscal year. We are required to consider current market conditions, including changes in interest rates, in making these assumptions. The actuarial assumptions that we use may differ materially from actual results due to changing market and economic conditions, higher or lower withdrawal rates, or longer or shorter life spans of participants. These differences may result in a significant impact to the measurement of our pension and postemployment benefit obligations and to the amount of pension and postemployment benefits expense we have recorded or may record. For example, as of December 31, 2020, a one-half percent increase/decrease in the discount rate would change the projected benefit obligation of our pension plans by approximately $13 million, and a one-half percent increase/decrease in our involuntary turnover assumption would change our postemployment benefit obligation by approximately $9 million.\nRECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS\nA discussion of recently issued accounting pronouncements is described in \"Note 1-Description of Business, Basis of Presentation and Significant Accounting Policies\" in the Notes to Consolidated Financial Statements elsewhere in this Annual Report, and we incorporate such discussion by reference.",
    "item_7A": "Item 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nThe Company employs a foreign currency hedging strategy to limit potential losses in earnings or cash flows from adverse foreign currency exchange rate movements. Foreign currency exposures arise from transactions denominated in a currency other than the Company’s functional currency and from foreign denominated revenue and profit translated into U.S. dollars. The primary currencies to which the Company is exposed include the euro, the British pound, the Japanese yen, the Australian dollar, the Chinese yuan, the Canadian dollar and other Asian and South American currencies. Exposures are hedged with foreign currency forward contracts with maturity dates of twelve months or less. The potential loss in fair value at December 31, 2020, for such contracts resulting from a hypothetical 10% adverse change in all foreign currency exchange rates is approximately $3 million. This loss would be mitigated by corresponding gains on the underlying exposures.\nIn June 2018, Teradata executed a five-year interest rate swap with a $500 million initial notional amount to hedge the floating interest rate of its Term Loan, as more fully described in \"Note 12 - Debt\" in the Notes to Consolidated Financial Statements elsewhere in this Annual Report. The Company uses interest rate swaps to manage interest rate risks on future interest payments caused by interest rate changes on its variable rate term loan facility. The notional amount of the hedge will step-down according to the amortization schedule of the term loan. The fair value of these contracts and swaps are measured at the end of each reporting period using observable inputs other than quoted prices, specifically market spot and forward exchange rates. The fair value of interest rate swaps recorded in other\nliabilities at December 31, 2020 was $27 million. A hypothetical 50 basis point increase/decrease in interest rates would result in a increase/decrease to the fair value of the hedge of approximately $5 million.\nFor additional information regarding the Company’s foreign currency hedging strategy and interest rate swaps, see \"Note 9 - Derivative Instruments and Hedging Activities\" in the Notes to Consolidated Financial Statements elsewhere in this Annual Report.",
    "item_8": "Item 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Stockholders of Teradata Corporation\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Teradata Corporation and its subsidiaries (the “Company”) as of December 31, 2020 and 2019, and the related consolidated statements of income (loss), of comprehensive income (loss), of changes in stockholders’ equity and of cash flows for each of the three years in the period ended December 31, 2020, including the related notes and schedule of valuation and qualifying accounts for each of the three years in the period ended December 31, 2020 listed in the index appearing under Item 15(a)(2) (collectively referred to as the “consolidated financial statements”). We also have audited the Company's internal control over financial reporting as of December 31, 2020, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2020 and 2019, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2020 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2020, based on criteria established in Internal Control - Integrated Framework (2013) issued by the COSO.\nChanges in Accounting Principles\nAs discussed in Note 1 to the consolidated financial statements, the Company changed the manner in which it accounts for leases in 2019 and the manner in which it accounts for revenues from contracts with customers in 2018.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Management’s Annual Report on Internal Control Over Financial Reporting appearing under Item 9A. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that\nrespond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that (i) relate to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nRevenue Recognition - Evaluation of Nonstandard Terms and Conditions with Customers\nAs described in Notes 1 and 3 to the consolidated financial statements, the Company has $1,836 million of total revenue for the year ended December 31, 2020, of which a significant portion is generated from revenue with contracts which contain multiple performance obligations. When the Company enters into contracts with multiple performance obligations, management allocates the contract’s transaction price to each performance obligation using the relative standalone selling price of each distinct good or service in the contract. As disclosed by management, revenue recognition for complex contractual arrangements requires judgment, including a review of specific contracts and other factors. Specifically, complex arrangements with nonstandard terms and conditions may require significant contract interpretation to determine the appropriate accounting, including the determination whether promised goods or services are capable of being distinct and distinct within the context of the contract. If these criteria are not met, the promised goods or services are combined with other goods or services and accounted for as a combined performance obligation.\nThe principal considerations for our determination that performing procedures relating to revenue recognition, specifically related to the evaluation of nonstandard terms and conditions with customers, is a critical audit matter are the significant judgment by management in evaluating the impact of nonstandard terms and conditions with customers on revenue recognition and determining the appropriate revenue recognition. This in turn led to a high\ndegree of auditor judgment, subjectivity, and effort in performing procedures to evaluate the impact of nonstandard terms and conditions on revenue recognition.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to the revenue recognition process, including controls over the evaluation of the impact of nonstandard terms and conditions with customers on revenue recognition. These procedures also included, among others (i) evaluating and testing management’s process for determining whether the criteria for revenue recognition have been met based on the specific terms and performance under the arrangement, and (ii) examining revenue arrangements on a test basis, which included evaluating the impact of nonstandard terms and conditions with customers on revenue recognition.\nValuation of Intra-Entity Transferred Intellectual Property that Give Rise to Deferred Tax Assets\nAs described in Note 6 to the consolidated financial statements, on January 1, 2020, the Company transferred certain of its intellectual property among its wholly-owned subsidiaries, which resulted in the recognition of deferred tax assets of $157 million. The recognition of deferred tax assets from intra-entity transfers of intellectual property requires management to make significant estimates and assumptions to determine the fair value of such intellectual property, using a discounted cash flow model. Significant assumptions in valuing the intellectual property include, but are not limited to, internal revenue and expense forecasts and the discount rate.\nThe principal considerations for our determination that performing procedures relating to valuation of intra-entity transferred intellectual property that give rise to deferred tax assets is a critical audit matter are (i) the significant judgment by management in determining the fair value of the intellectual property transferred, which was used by management as the basis for recognizing the deferred tax assets, (ii) a high degree of auditor judgment, subjectivity, and effort in performing procedures and evaluating management’s significant assumptions related to internal revenue and expense forecasts and the discount rate, (iii) the evaluation of audit evidence available to support the fair value of the intellectual property transferred is complex and resulted in significant auditor judgment as the nature of the evidence is highly subjective, and (iv) the audit effort involved the use of professionals with specialized skill and knowledge.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to deferred tax assets, including controls over management’s valuation of the intellectual property transferred and controls over development of the internal revenue and expense forecasts and the discount rate used in the valuation of the intellectual property. These procedures also included, among others, (i) testing management’s process for developing the fair value estimate of the intellectual property transferred; (ii) evaluating the appropriateness of the discounted cash flow model used to estimate the fair value; (iii) testing the completeness and accuracy of data used in the model; and (iv) evaluating the significant assumptions used by management related to internal revenue and expense forecasts, and the discount rate. Evaluating management’s assumptions related to internal revenue and expense forecasts involved evaluating whether the assumptions used by management were reasonable considering current and past performance of the business and evaluating the accuracy of management’s historical forecasting, as well as industry results and projections. The discount rate was evaluated by considering the cost of capital of comparable businesses and other industry factors. Professionals with specialized skill and knowledge were used to assist in the evaluation of the Company’s model and the discount rate assumption.\n/s/ PricewaterhouseCoopers LLP\nAtlanta, GA\nFebruary 26, 2021\nWe have served as the Company’s auditor since 2007.\nTERADATA CORPORATION\nConsolidated Statements of Income (Loss)\nIn millions, except per share amounts\nFor the Years Ended December 31\n2020 2019 2018\nRevenue\nSubscription software licenses $ 224 $ 157 $ 71\nServices and other 1,227 1,205 1,183\nTotal recurring 1,451 1,362 1,254\nPerpetual software licenses and hardware 73 106 340\nConsulting services 312 431 570\nTotal revenue 1,836 1,899 2,164\nCost of revenue\nSubscription software licenses 35 34 17\nServices and other 442 408 357\nTotal recurring 477 442 374\nPerpetual software licenses and hardware 39 84 222\nConsulting services 301 418 542\nTotal cost of revenue 817 944 1,138\nGross profit 1,019 955 1,026\nOperating expenses\nSelling, general and administrative expenses 669 618 666\nResearch and development expenses 334 327 317\nTotal operating expenses 1,003 945 983\nIncome from operations 16 10 43\nOther expense, net\nInterest expense (27) (26) (22)\nInterest income 4 12 14\nOther expense (17) (9) (8)\nTotal other expense, net (40) (23) (16)\n(Loss) income before income taxes (24) (13) 27\nIncome tax (benefit) expense (153) 7 (3)\nNet income (loss) $ 129 $ (20) $ 30\nNet income (loss) per weighted average common share\nBasic $ 1.18 $ (0.18) $ 0.25\nDiluted $ 1.16 $ (0.18) $ 0.25\nWeighted average common shares outstanding\nBasic 109.3 114.2 119.2\nDiluted 111.6 114.2 121.2\nThe accompanying notes are an integral part of the consolidated financial statements.\nTERADATA CORPORATION\nConsolidated Statements of Comprehensive Income (Loss)\nIn millions\nFor the Years Ended December 31\n2020 2019 2018\nNet income (loss) $ 129 $ (20) $ 30\nOther comprehensive loss:\nForeign currency translation adjustments 7 (10) (13)\nDerivatives:\nUnrealized loss on derivatives, before tax (8) (12) (7)\nUnrealized loss on derivatives, tax portion 2 3 1\nUnrealized loss on derivatives, net of tax (6) (9) (6)\nDefined benefit plans:\nReclassification of loss to net income (loss) 9 6 5\nDefined benefit plan adjustment, before tax (15) (37) (14)\nDefined benefit plan adjustment, tax portion 3 10 1\nDefined benefit plan adjustment, net of tax (3) (21) (8)\nOther comprehensive loss (2) (40) (27)\nComprehensive income (loss) $ 127 $ (60) $ 3\nThe accompanying notes are an integral part of the consolidated financial statements.\nTERADATA CORPORATION\nConsolidated Balance Sheets\nIn millions, except per share amounts\nAt December 31\n2020 2019\nAssets\nCurrent assets\nCash and cash equivalents $ 529 $ 494\nAccounts receivable, net 331 398\nInventories 29 31\nOther current assets 155 91\nTotal current assets 1,044 1,014\nProperty and equipment, net 339 350\nRight of use assets - operating lease, net 38 51\nGoodwill 401 396\nCapitalized contract costs, net 98 91\nDeferred income taxes 222 87\nOther assets 51 68\nTotal assets $ 2,193 $ 2,057\nLiabilities and stockholders’ equity\nCurrent liabilities\nCurrent portion of long-term debt $ 44 $ 25\nCurrent portion of finance lease liability 75 55\nCurrent portion of operating lease liability 15 20\nAccounts payable 50 66\nPayroll and benefits liabilities 170 157\nDeferred revenue 499 472\nOther current liabilities 99 91\nTotal current liabilities 952 886\nLong-term debt 411 454\nFinance lease liability 70 75\nOperating lease liability 28 38\nPension and other postemployment plan liabilities 152 137\nLong-term deferred revenue 38 61\nDeferred tax liabilities 6 6\nOther liabilities 136 138\nTotal liabilities 1,793 1,795\nCommitments and contingencies (Note 10)\nStockholders’ equity\nPreferred stock: par value $0.01 per share, 100.0 shares authorized, no shares issued and outstanding at December 31, 2020 and 2019, respectively\n- -\nCommon stock: par value $0.01 per share, 500.0 shares authorized, 108.8 and 110.9 shares issued and outstanding at December 31, 2020 and 2019, respectively\n1 1\nPaid-in capital 1,656 1,545\nAccumulated deficit (1,114) (1,143)\nAccumulated other comprehensive loss (143) (141)\nTotal stockholders’ equity 400 262\nTotal liabilities and stockholders’ equity $ 2,193 $ 2,057\nThe accompanying notes are an integral part of the consolidated financial statements.\nTERADATA CORPORATION\nConsolidated Statements of Cash Flows\nIn millions\nFor the Years Ended December 31\n2020 2019 2018\nOperating activities\nNet income (loss) $ 129 $ (20) $ 30\nAdjustments to reconcile net income (loss) to net cash provided by operating activities:\nDepreciation and amortization 172 150 130\nStock-based compensation expense 101 83 65\nDeferred income taxes (118) (3) (18)\nChanges in assets and liabilities:\nReceivables 67 190 (34)\nInventories 2 (3) 2\nAccount payables and accrued expenses - (153) 108\nDeferred revenue 4 (62) 115\nOther assets and liabilities (90) (34) (34)\nNet cash provided by operating activities 267 148 364\nInvesting activities\nExpenditures for property and equipment (44) (54) (153)\nAdditions to capitalized software (7) (5) (7)\nOther investing activities, net - - (3)\nNet cash used in investing activities (51) (59) (163)\nFinancing activities\nRepayments of long-term borrowings (25) (19) (40)\nRepayments of credit-facility borrowings - - (240)\nRepurchases of common stock (100) (300) (300)\nPayments of finance leases (70) (33) (5)\nOther financing activities, net 9 44 31\nNet cash used in financing activities (186) (308) (554)\nEffect of exchange rate changes on cash and cash equivalents 7 (1) (20)\nIncrease (decrease) in cash, cash equivalents and restricted cash 37 (220) (373)\nCash, cash equivalents and restricted cash at beginning of year 496 716 1,089\nCash, cash equivalents and restricted cash at end of year $ 533 $ 496 $ 716\nReconciliation of cash, cash equivalents and restricted cash to the Consolidated Balance Sheets\nCash and cash equivalents $ 529 $ 494 $ 715\nRestricted cash 4 2 1\nTotal cash, cash equivalents and restricted cash $ 533 $ 496 $ 716\nNon-cash investing and financing activities:\nAssets acquired by finance lease $ 85 $ 115 $ 52\nAssets acquired by operating lease $ 8 $ 6 $ -\nCash paid during the year for:\nIncome taxes $ 39 $ 33 $ 33\nInterest $ 27 $ 26 $ 23\nThe accompanying notes are an integral part of the consolidated financial statements.\nTERADATA CORPORATION\nConsolidated Statements of Changes in Stockholders’ Equity\nIn millions\nCommon Stock Paid-in Retained Earnings (Accumulated Accumulated Other Comprehensive\nShares Amount Capital Deficit) (Loss) income Total\nDecember 31, 2017 122 $ 1 $ 1,320 $ (579) $ (74) $ 668\nNet income - - - 30 - 30\nEmployee stock compensation, employee stock purchase programs and option exercises, net of tax 2 - 98 - - 98\nRepurchases of common stock, retired (7) - - (300) - (300)\nPension and postemployment benefit plans, net of tax - - - - (8) (8)\nUnrealized loss on derivatives, net of tax - - - - (6) (6)\nAdoption of Topic 606 - - - 26 - 26\nCurrency translation adjustment - - - - (13) (13)\nDecember 31, 2018 117 $ 1 $ 1,418 $ (823) $ (101) $ 495\nNet loss - - - (20) - (20)\nEmployee stock compensation, employee stock purchase programs and option exercises, net of tax 2 - 127 - - 127\nRepurchases of common stock, retired (8) - - (300) - (300)\nPension and postemployment benefit plans, net of tax - - - - (21) (21)\nUnrealized loss on derivatives, net of tax - - - - (9) (9)\nCurrency translation adjustment - - - - (10) (10)\nDecember 31, 2019 111 $ 1 $ 1,545 $ (1,143) $ (141) $ 262\nNet income - - - 129 - 129\nEmployee stock compensation, employee stock purchase programs and option exercises, net of tax 2 - 111 - - 111\nRepurchases of common stock, retired (5) - - (100) - (100)\nPension and postemployment benefit plans, net of tax - - - - (3) (3)\nUnrealized loss on derivatives, net of tax - - - - (6) (6)\nCurrency translation adjustment - - - - 7 7\nDecember 31, 2020 108 $ 1 $ 1,656 $ (1,114) $ (143) $ 400\nThe accompanying notes are an integral part of the consolidated financial statements.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1 Description of Business, Basis of Presentation and Significant Accounting Policies\nDescription of the Business. Teradata Corporation (\"we,\" \"us,\" \"Teradata,\" or the \"Company\") is a leading multi-cloud data warehouse platform provider focused on helping companies leverage their data across an enterprise to uncover real-time intelligence, at scale. Our platform is comprised of software and hardware, and we provide related business consulting and support services to deliver analytics across a company’s entire analytical ecosystem.\nBasis of Presentation. The financial statements are presented on a consolidated basis and include the accounts of the Company and its wholly-owned subsidiaries in accordance with accounting principles generally accepted in the United States of America (\"GAAP\").\nRecurring revenue consists of our on-premises and cloud subscriptions, which have varying term lengths from one month to five years. Recurring revenue is intended to depict the revenue recognition model for these subscription transactions. The recurrence of these revenue streams in future periods depends on several factors, including contractual periods and customers' renewal decisions. Perpetual software licenses and hardware revenue consists of hardware and perpetual software licenses recognized upfront. Consulting services revenue consists of consulting, implementation and installation services.\nCertain prior period balances have been reclassified to conform to the current year presentation. Such reclassifications did not affect total revenues, operating income or net income.\nUse of Estimates. The preparation of financial statements in conformity with GAAP requires management to make estimates and judgments that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements, and revenues and expenses during the period reported. On an ongoing basis, management evaluates these estimates and judgments, including those related to allowances for doubtful accounts, the valuation of inventory to net realizable value, impairments of goodwill and other intangibles, stock-based compensation, leases, pension and other postemployment benefits, and income taxes and any changes will be accounted for on a prospective basis. Actual results could differ from those estimates.\nRevenue Recognition\nThe Company adopted Financial Accounting Standards Board (\"FASB\") Standards Update No. 2014-09, Revenue from Contracts with Customers (\"Topic 606\") as of January 1, 2018 for all contracts not completed as of the date of adoption. The core principle of Topic 606 is that an entity should recognize revenue to depict the transfer of promised goods or services to customers in an amount that reflects the consideration to which the Company expects to be entitled in exchange for those goods or services. To achieve that core principle, the Company performs the following five steps:\n1.identify the contract with a customer,\n2.identify the performance obligations in the contract,\n3.determine the transaction price,\n4.allocate the transaction price to the performance obligations in the contract, and\n5.recognize revenue when (or as) the Company satisfies a performance obligation.\nThe Company only applies the above five-step model to contracts when it is probable that the Company will collect the consideration it is entitled to in exchange for goods or services it transfers to the customer. The Company applies judgment in determining the customer’s ability and intention to pay, which is based on a variety of factors including the customer’s historical payment experience, published credit, and financial information pertaining to the customer.\nRevenue is measured based on consideration specified in a contract with a customer, and excludes any sales, value add, and other taxes the Company collects concurrent with revenue-producing activities. A performance obligation is a promise in a contract to transfer a distinct good or service to the customer. The Company recognizes revenue\nwhen it satisfies a performance obligation by transferring control over a good or service to a customer. Estimates of variable consideration are included in revenue to the extent that it is probable that a significant reversal of cumulative revenue will not occur once the uncertainty is resolved. The Company uses the expected value method or the most likely amount method depending on the nature of the variable consideration. Our estimates of variable consideration and determination of whether to include estimated amounts in the transaction price are based largely on an assessment of our anticipated performance and all information (historical, current and forecasted) that is reasonably available to us. If actual results in the future vary from the Company’s estimates, the Company adjusts these estimates in the period such variances become known. Typically, the amount of variable consideration is not material.\nFor contracts with multiple performance obligations, the Company allocates the contract’s transaction price to each performance obligation using the relative standalone selling price of each distinct good or service in the contract. The Company must apply judgment to determine whether promised goods or services are capable of being distinct and distinct within the context of the contract. If these criteria are not met, the promised goods or services are combined with other goods or services and accounted for as a combined performance obligation. Revenue is then recognized either at a point in time or over time depending on our evaluation of when the customer obtains control of the promised goods or services. This evaluation requires significant judgment and the decision to combine a group of contracts or separate the combined or single contract into multiple performance obligations could change the amount of revenue recorded in a given period. In addition, the Company has developed assumptions that require judgment to determine the standalone selling price for each performance obligation identified in the contract. The Company determines the standalone selling price for a good or service by considering multiple factors including, geographies, market conditions, product life cycles, competitive landscape, internal costs, gross margin objectives, purchase volumes and pricing practices. The Company reviews the standalone selling price for each of its performance obligations on a periodic basis and updates it, when appropriate, to ensure that the practices employed reflect the Company’s recent pricing experience. The Company maintains internal controls over the establishment and updates of these estimates, which includes review and approval by the Company’s management.\nTeradata delivers its platform and services primarily through direct sales channels, as well as through other independent software vendors and distributors and value-added resellers. Standard payment terms may vary based on the country in which the contract is executed, but are generally between 30 days and 90 days. The following is a description of the principal activities and performance obligations from which the Company generates its revenue:\n•Subscriptions - The Company sells on-premises and cloud subscriptions to our customers through our subscription licenses, cloud and hardware rental offerings. Teradata’s on-premises subscription licenses include a right-to-use license and revenue is recognized upfront at a point in time unless the customer has a contractual right to cancel, where revenue is generally recognized on a month-to-month basis. Subscription licenses are reported within the subscription software licenses caption on the Consolidated Statements of Income (Loss). The subscription software license support and unspecified software license upgrade rights on a when-an-if-available basis that are included in the subscription are reported within the recurring services and other caption and recognized ratably over the contract term. Cloud arrangements include a right-to-access software license on Teradata hosted or third party hosted hardware such as the public cloud. Revenue is recognized ratably, or as consumed, over the contract term and included within the recurring services and other caption. Cloud arrangements typically include a minimum fixed amount that is recognized ratably over the contract term and may include an elastic amount for usage above the minimum, which is recognized monthly based on actual utilization. For our hardware rental offering, the Company owns the hardware and typically finances the hardware to more closely align the use of cash with the expected cash inflows from contracts with customers. The revenue for these arrangements is generally recognized straight-line over the term of the contract and is included within the recurring services and other caption. Hardware rentals are generally accounted for as operating leases and considered outside the scope of Topic 606.\n•Perpetual maintenance and software upgrade rights - Revenue for maintenance and unspecified software upgrade rights on a when-and-if-available basis are recognized straight-line over the term of the contract and included within the recurring services and other caption.\n•Perpetual software licenses and hardware - Revenue for software is generally recognized when the customer has the ability to use and benefit from its right to use the license. Hardware is typically recognized upon delivery once title and risk of loss have been transferred (when control has passed).\n•Consulting services - The Company accounts for individual services as separate performance obligations if a service is separately identifiable from other items in a combined arrangement and if a customer can benefit from it on its own or with other resources that are readily available to the customer. Revenue for consulting, implementation and installation services is recognized as services are provided by measuring progress toward the complete satisfaction of the Company’s obligation. Progress for services that are contracted for at a fixed price is generally measured based on hours incurred as a portion of total estimated hours. Progress for services that are contracted for on a time and materials basis is generally based on hours expended. These input methods (e.g. hours incurred or expended) of revenue recognition are considered a faithful depiction of our efforts to satisfy services contracts and therefore reflect the transfer of services to a customer under such contracts.\nSignificant Accounting Policies and Practical Expedients\nThe following are the Company’s significant accounting policies not already disclosed elsewhere and practical expedients relating to revenue from contracts with customers:\n•Taxes assessed by a governmental authority that are both imposed on and concurrent with a specific revenue-producing transaction, that are collected by the Company from a customer, are excluded from revenue.\n•Shipping and handling costs associated with outbound freight after control over a product has transferred to a customer are accounted for as fulfillment cost and are included in cost of revenues.\n•The Company does not adjust for the effects of a significant financing component if the period between performance and customer payment is one year or less.\n•The Company expenses the costs to obtain a contract as incurred when the expected amortization period is one year or less.\nShipping and Handling. Product shipping and handling are included in cost in the Consolidated Statements of Income (Loss).\nCash and Cash Equivalents. All short-term, highly-liquid investments having original maturities of three months or less are considered to be cash equivalents.\nAllowance for Doubtful Accounts. Teradata establishes provisions for doubtful accounts using expected credit losses methodology and specific provisions for known issues.\nInventories. Inventories are stated at the lower of cost or market. Cost of service parts is determined using the average cost method. Finished goods inventory is determined using actual cost.\nLong-Lived Assets\nProperty and Equipment. Property and equipment, leasehold improvements and rental equipment are stated at cost less accumulated depreciation. Depreciation is computed over the estimated useful lives of the related assets primarily on a straight-line basis. Our estimate of depreciation expense incorporates management assumptions regarding the useful economic lives and residual values of our assets. Equipment is depreciated over 3 to 5 years and buildings over 25 to 45 years. Leasehold improvements are depreciated over the life of the lease or the asset, whichever is shorter. Total depreciation expense on the Company’s property and equipment for December 31 was as follows:\nIn millions 2020 2019 2018\nDepreciation expense $ 138 $ 104 $ 67\nCapitalized Software. Direct development costs associated with internal-use software are capitalized and amortized over the estimated useful lives of the resulting software. The costs are capitalized when both the preliminary project stage is completed and it is probable that computer software being developed will be completed and placed in service. Teradata typically amortizes capitalized internal-use software on a straight-line basis over three years beginning when the asset is substantially ready for use.\nCosts incurred for the development of analytic database software that will be sold, leased or otherwise marketed are expensed as incurred based on the frequency and agile nature of development. The Company uses agile development methodologies to help respond to new technologies and trends and rapidly changing customer needs. Agile development methodologies are characterized by a more dynamic development process with more frequent and iterative revisions to a product release features and functions as the software is being developed. Due to the shorter development cycle and focus on rapid production associated with agile development, the Company did not capitalize any amounts for external-use software development costs in 2020, 2019 and 2018 due to the relatively short duration between the completion of the working model and the point at which a product is ready for general release. Prior capitalized costs will continue to be amortized under the greater of revenue-based or straight-line method over the estimated useful life.\nThe following table identifies the activity relating to capitalized software for the following periods:\nInternal-use Software External-use Software\nIn millions 2020 2019 2018 2020 2019 2018\nBeginning balance at January 1 $ 13 $ 15 $ 16 $ 23 $ 57 $ 105\nCapitalized 7 5 6 - - -\nAmortization (7) (7) (7) (23) (34) (48)\nEnding balance at December 31 $ 13 $ 13 $ 15 $ - $ 23 $ 57\nThe aggregate amortization expense (actual and estimated) for internal-use and external-use software for the following periods is:\nActual For the years ended (estimated)\nIn millions 2020 2021 2022 2023 2024 2025\nInternal-use software amortization expense $ 7 $ 6 $ 6 $ 6 $ 6 $ 6\nExternal-use software amortization expense $ 23 $ - $ - $ - $ - $ -\nValuation of Long-Lived Assets. Long-lived assets such as property and equipment, acquired intangible assets and internal capitalized software are reviewed for impairment when events or changes in circumstances indicate that the carrying amount of the assets may not be recoverable. An impairment is calculated based on the present value of future cash flows and an impairment loss would be recognized when estimated future undiscounted cash flows expected to result from the use of the asset and its eventual disposition are less than the carrying amount. No impairment was recognized during 2020.\nGoodwill. Goodwill represents the excess of the purchase price in a business combination over the fair value of net tangible and intangible assets acquired. Goodwill amounts are not amortized, but rather are tested for impairment annually or upon occurrence of an event or change in circumstances that would more likely than not reduce the fair value of a reporting unit below its carrying amount. See Note 5 for additional information.\nWarranty. Provisions for product warranties are recorded in the period in which the related revenue is recognized. The Company accrues warranty reserves using percentages of revenue to reflect the Company’s historical average warranty claims.\nResearch and Development Costs. Research and development costs are expensed as incurred. Research and development costs primarily include labor-related costs, contractor fees, and overhead expenses directly related to research and development support.\nLeases. In February 2016, the FASB issued new guidance, which requires a lessee to account for leases as finance or operating leases. Both types of leases will result in the lessee recognizing a right-of-use asset and a corresponding\nlease liability on its balance sheet, with differing methodology for income statement and cash flow recognition. For lessors, the standard modifies the classification criteria and the accounting for sales-type and direct financing leases. Entities will classify leases to determine how to recognize lease-related revenue and expense. The Company adopted the new standard as of January 1, 2019 using the modified retrospective adoption approach utilizing the optional transition method with prior periods not recast and have elected certain of the practical expedients allowed under the standard. The Consolidated Financial Statements for the year ended December 31, 2019 and 2020 are presented under the new standard, while comparative years presented are not adjusted and continue to be reported in accordance with our historical accounting policy. See Note 13 for more information.\nPension and Postemployment Benefits. The Company accounts for its pension benefit and its non-U.S. postemployment benefit obligations using actuarial models. The measurement of plan obligations was made as of December 31, 2020. Liabilities are computed using the projected unit credit method. The objective under this method is to expense each participant’s benefits under the plan as they accrue, taking into consideration salary increases and the plan’s benefit allocation formula. Thus, the total pension or postemployment benefit to which each participant is expected to become entitled is broken down into units, each associated with a year of past or future credited service.\nThe Company recognizes the funded status of its pension and non-U.S. postemployment plan obligations in its consolidated balance sheet and records, in other comprehensive income, certain gains and losses that arise during the period, but are deferred under pension and postemployment accounting rules. See Note 8 for additional information.\nForeign Currency. Assets and liabilities of non-U.S. subsidiaries that operate in a local currency environment are translated into U.S. dollars at period-end exchange rates. Income and expense accounts are translated at daily exchange rates prevailing during the period. Adjustments arising from the translation are included in accumulated other comprehensive income, a separate component of stockholders’ equity. Gains and losses resulting from foreign currency transactions are included in determining net income.\nIncome Taxes. Income tax expense is provided based on income before income taxes in the various jurisdictions in which the Company conducts its business. Deferred income taxes reflect the impact of temporary differences between assets and liabilities recognized for financial reporting purposes and such amounts recognized for tax purposes. These deferred taxes are determined based on the enacted tax rates expected to apply in the periods in which the deferred assets or liabilities are expected to be settled or realized. The Company made an accounting policy election in 2018 related to the Tax Act to provide for the tax expense related to GILTI in the year the tax is incurred. Teradata recognizes tax benefits from uncertain tax positions only if it is more likely than not the tax position will be sustained on examination by taxing authorities, based on the technical merits of the position. The Company records valuation allowances related to its deferred income tax assets when it is more likely than not that some portion or all the deferred income tax assets will not be realized. See Note 6 for additional information.\nStock-based Compensation. Stock-based payments to employees, including restricted shares and restricted share units, are recognized in the financial statements based on their fair value. See Note 7 for additional information.\nEarnings (Loss) Per Share. Basic earnings (loss) per share is calculated by dividing net income (loss) by the weighted-average number of shares outstanding during the reported period. The calculation of diluted earnings per share is similar to basic earnings per share, except that the weighted-average number of shares outstanding includes the dilution from potential shares added from stock options, restricted share awards and other stock awards. Refer to Note 7 for share information on the Company’s stock compensation plans.\nThe components of basic and diluted earnings (loss) per share for the years ended December 31 are as follows:\nIn millions, except earnings (loss) per share 2020 2019 2018\nNet income (loss) attributable to common stockholders $ 129 $ (20) $ 30\nWeighted average outstanding shares of common stock 109.3 114.2 119.2\nDilutive effect of employee stock options, restricted shares and other stock awards 2.3 - 2.0\nCommon stock and common stock equivalents 111.6 114.2 121.2\nEarnings (loss) per share:\nBasic $ 1.18 $ (0.18) $ 0.25\nDiluted $ 1.16 $ (0.18) $ 0.25\nFor 2019 due to the net loss attributable to Teradata common stockholders, potential common shares that would cause dilution, such as employee stock options, restricted shares and other stock awards, have been excluded from the diluted share count because their effect would have been anti-dilutive. For 2019 the fully diluted shares would have been 115.5 million.\nOptions to purchase 2.0 million shares in 2020 and 2019 and 2.6 million shares in 2018 of common stock, were not included in the computation of diluted earnings per share because their exercise prices were greater than the average market price of the common shares and, therefore, the effect would have been anti-dilutive.\nRecently Issued Accounting Pronouncements\nAccounting for Income Taxes. In December 2019, the FASB issued new guidance to simplify the accounting for income taxes. The new guidance changes various subtopics of accounting for income taxes including, but not limited to, accounting for \"hybrid\" tax regimes, tax basis step-up in goodwill obtained in a transaction that is not a business combination, intraperiod tax allocation exception to incremental approach, ownership changes in investments, interim-period accounting for enacted changes in tax law, and year-to-date loss limitation in interim-period tax accounting. The guidance is effective for fiscal years beginning after December 15, 2020 with early adoption permitted, including interim periods within those years. The Company is currently evaluating this new guidance to determine the impact it may have on our financial position, results of operations or cash flows.\nReference Rate Reform. In March 2020, the FASB issued new guidance to provide relief to companies that will be impacted by the expected change in benchmark interest rates, as participating banks will no longer be required to submit London Interbank Offered Rate (\"LIBOR\") quotes by the UK Financial Conduct Authority. The new guidance allows companies to, provided the only change to existing contracts are a change to an approved benchmark interest rate, account for modifications as a continuance of the existing contract without additional analysis. For new and existing contracts, companies may elect to apply the amendments as of March 12, 2020 through December 31, 2022. The Company is currently evaluating this new guidance to determine the impact it may have on our financial statements and disclosures.\nRecently Adopted Guidance\nFair Value Measurement. In August 2018, the FASB issued new guidance that modifies disclosure requirements related to fair value measurement. The Company adopted this guidance on January 1, 2020, which did not have a material impact on our consolidated financial statements.\nCustomer’s Accounting for Implementation Costs Incurred in a Cloud Computing Arrangement That Is a Service Contract. In August 2018, the FASB issued new guidance that reduces complexity for the accounting for costs of implementing a cloud computing service arrangement and aligns the requirements for capitalizing implementation costs incurred in a hosting arrangement that is a service contract with the requirements for capitalizing implementation costs incurred to develop or obtain internal-use software (and hosting arrangements that include an internal-use software license). The Company adopted this guidance on January 1, 2020, which did not have a material impact on our consolidated financial statements.\nCodification Improvements to Financial Instruments-Credit Losses, Derivatives and Hedging, and Financial Instruments. In June 2016, the FASB issued Accounting Standards, Measurement of Credit Losses on Financial Instruments, which introduced the expected credit losses methodology for the measurement of credit losses on financial assets measured at amortized cost basis, replacing the previous incurred loss methodology. Since the\nissuance of this accounting standard, the FASB has identified certain areas that require clarification and improvement. In May 2019, the FASB issued guidance that allows entities to make an irrevocable one-time election upon adoption of the new credit losses standard to measure financial assets measured at amortized cost (except held-to-maturity securities) using the fair value option. The election is to be applied on an instrument-by-instrument basis. The Company adopted this guidance on January 1, 2020, which did not have a material impact on our consolidated financial statements.\nCompensation-Retirement Benefits-Defined Benefit Plans-General. In August 2018, the FASB issued new guidance that modifies the disclosure requirements for employers that sponsor defined benefit pension or other postretirement plans. This guidance is to be applied on a retrospective basis to all periods presented. The Company adopted this guidance on January 1, 2020, which did not have a material impact on our consolidated financial statements.\nNote 2 Supplemental Financial Information\nAt December 31\nIn millions 2020 2019\nAccounts receivable\nTrade $ 342 $ 407\nOther 3 8\nAccounts receivable, gross 345 415\nLess: allowance for doubtful accounts (14) (17)\nTotal accounts receivable, net $ 331 $ 398\nInventories\nFinished goods $ 18 $ 19\nService parts 11 12\nTotal inventories $ 29 $ 31\nOther current assets\nIncome tax receivable $ 74 $ 15\nOther 81 76\nTotal other current assets $ 155 $ 91\nProperty and equipment\nLand $ 8 $ 8\nBuildings and improvements 91 100\nFinance lease assets 252 167\nMachinery and other equipment 516 515\nProperty and equipment, gross 867 790\nLess: accumulated depreciation (528) (440)\nTotal property and equipment, net $ 339 $ 350\nOther current liabilities\nSales and value-added taxes $ 33 $ 31\nPension and other postemployment plan liabilities 12 11\nOther 54 49\nTotal other current liabilities $ 99 $ 91\nDeferred revenue\nDeferred revenue, current $ 499 $ 472\nLong-term deferred revenue 38 61\nTotal deferred revenue $ 537 $ 533\nOther long-term liabilities\nTransition tax $ 82 $ 92\nUncertain tax positions 18 19\nOther 36 27\nTotal other long-term liabilities $ 136 $ 138\nNote 3 Revenue from Contracts with Customers\nDisaggregation of Revenue from Contracts with Customers\nThe following table presents a disaggregation of revenue for the years ended December 31:\nIn millions 2020 2019 2018\nAmericas\nRecurring $ 883 $ 873 $ 801\nPerpetual software licenses and hardware 36 38 127\nConsulting services 106 146 198\nTotal Americas 1,025 1,057 1,126\nEMEA\nRecurring 362 305 282\nPerpetual software licenses and hardware 23 43 112\nConsulting services 100 144 193\nTotal EMEA 485 492 587\nAPJ\nRecurring 206 185 171\nPerpetual software licenses and hardware 14 25 101\nConsulting services 106 140 179\nTotal APJ 326 350 451\nTotal Revenue $ 1,836 $ 1,899 $ 2,164\nContract Balances\nThe timing of revenue recognition, billings and cash collections results in billed accounts receivable, contract assets, and customer advances and deposits (deferred revenue or contract liabilities) on the consolidated balance sheet. Accounts receivable include amounts due from customers that are unconditional. Contract assets relate to the Company’s rights to consideration for goods delivered or services completed and recognized as revenue but billing and the right to receive payment is conditional upon the completion of other performance obligations. Contract assets are included in other current assets on the balance sheet and are transferred to accounts receivable when the rights become unconditional. Deferred revenue consists of advance payments and billings in excess of revenue recognized. Deferred revenue is classified as either current or noncurrent based on the timing of when the Company expects to recognize revenue. These assets and liabilities are reported on a contract-by-contract basis at the end of each reporting period. The following table provides information about receivables, contract assets and deferred revenue from contracts with customers:\nIn millions December 31, 2020 December 31, 2019\nAccounts receivable, net $ 331 $ 398\nContract assets $ 11 $ 8\nCurrent deferred revenue $ 499 $ 472\nLong-term deferred revenue $ 38 $ 61\nRevenue recognized during the year ended December 31, 2020 from amounts included in deferred revenue at the beginning of the period was approximately $471 million.\nTransaction Price Allocated to Unsatisfied Obligations\nThe following table includes estimated revenue expected to be recognized in the future related to the Company's unsatisfied (or partially satisfied) obligations at December 31, 2020:\nIn millions Total at December 31, 2020 Year 1 Year 2 and Thereafter\nRemaining unsatisfied obligations $ 2,921 $ 1,538 $ 1,383\nThe amounts above represent the price of firm orders for which work has not been performed or goods have not been delivered and exclude unexercised contract options outside the stated contractual term that do not represent material rights to the customer. Although the Company believes that the contract value in the above table is firm, approximately $1,887 million of the amount includes customer-only general cancellation for convenience terms that the Company is contractually obligated to perform unless the customer notifies us. The Company expects to recognize revenue of approximately $412 million in the next year from contracts that are non-cancelable. The Company believes the inclusion of this information is important to understanding the obligations that the Company is contractually required to perform and provides useful information regarding remaining obligations related to these executed contracts.\nNote 4 Contract Costs\nThe Company capitalizes sales commissions and other contract costs that are incremental direct costs of obtaining customer contracts if the expected amortization period of the asset is greater than one year. These costs are recorded in Capitalized contract costs on the Company’s balance sheet. The capitalized amounts are calculated based on the sales commissions for individual multi-term contracts. The judgments made in determining the amount of costs incurred include whether the commissions are in fact incremental and would not have occurred absent the customer contract. Costs to obtain a contract are amortized as selling, general and administrative expenses on a straight-line basis over the expected period of benefit, which is typically four years. These costs are periodically reviewed for impairment. The following table identifies the activity relating to capitalized contract costs:\nIn millions December 31, 2019 Capitalized Amortization December 31, 2020\nCapitalized contract costs $ 91 $ 40 $ (33) $ 98\nIn millions December 31, 2018 Capitalized Amortization December 31, 2019\nCapitalized contract costs $ 54 $ 57 $ (20) $ 91\nNote 5 Goodwill\nThe following table identifies the activity relating to goodwill by operating segment:.\nIn millions Balance at December 31, 2019 Currency\nTranslation\nAdjustments Balance at December 31, 2020\nGoodwill\nAmericas $ 253 $ - $ 253\nEMEA 88 4 92\nAPJ 55 1 56\nTotal goodwill $ 396 $ 5 $ 401\nIn the fourth quarter of 2020, the Company performed its annual impairment test and determined that no impairment to the carrying value of goodwill was necessary. The Company reviewed three reporting units in its 2020 goodwill impairment assessment, as each of the geographic operating segments were considered separate reporting units for purposes of testing. Based on the Company's evaluation and weighting of the events and circumstances that have occurred since the most recent quantitative test, the Company concluded that it was not more likely than not that each reporting unit's fair value was below its carrying value. Therefore, the Company determined that it was not necessary to perform a quantitative goodwill impairment test for the reporting units in 2020.\nNote 6 Income Taxes\nFor the years ended December 31, income (loss) before income taxes consisted of the following:\nIn millions 2020 2019 2018\n(Loss) income before income taxes\nUnited States $ (41) $ (85) $ (79)\nForeign 17 72 106\nTotal (loss) income before income taxes $ (24) $ (13) $ 27\nFor the years ended December 31, income tax (benefit) expense consisted of the following:\nIn millions 2020 2019 2018\nIncome tax (benefit) expense\nCurrent\nFederal $ (45) $ (3) $ (10)\nState and local 1 - 6\nForeign 9 13 19\nDeferred\nFederal 34 (10) (20)\nState and local 6 (1) (4)\nForeign (158) 8 6\nTotal income tax (benefit) expense $ (153) $ 7 $ (3)\nEffective income tax rate 637.5 % (53.8 %) (11.1 %)\nThe following table presents the principal components of the difference between the effective tax rate and the United States federal statutory income tax rate for the years ended December 31:\n2020 2019 2018\nIncome tax expense at the U.S. federal tax rate 21.0 % 21.0 % 21.0 %\nForeign income tax differential (20.8) % (49.2) % 2.1 %\nU.S. tax on foreign earnings (16.7) % (8.4) % 2.0 %\nState and local income taxes 25.0 % 58.2 % (25.0) %\nU.S. permanent book/tax differences (4.2) % (17.0) % (2.7) %\nU.S. research and development tax credits 25.0 % 68.5 % (29.5) %\nChange in valuation allowance (25.0) % (49.1) % 27.7 %\nTax impact of NOL carry-back under the CARES act. 79.2 % - % - %\nTax impact of equity compensation (66.7) % (49.3) % (1.4) %\nDeferred tax impact from intra-entity IP transfer 654.2 % - % - %\nTax impact of U.S. Tax Reform/Transition Tax - % - % (23.9) %\nTax Impact of uncertain tax positions (29.2) % (24.6) % 20.2 %\nOther, net (4.3) % (3.9) % (1.6) %\nEffective income tax rate 637.5 % (53.8) % (11.1) %\nThe 2020 effective tax rate included $157 million of net discrete tax benefit. Discrete tax benefit of $157 million was recorded related to the transfer of foreign intellectual property as more fully described below. In addition, the Company recognized a net $13 million of tax benefit resulting from the CARES Act of 2020, which allows U.S. corporations a one-time opportunity to claim income tax refunds by allowing a 5-year NOL carry-back for taxable losses incurred in the tax year 2020. Teradata intends to carry back its 2020 NOL to claim a refund for taxes it paid in 2015, which created a one-time income tax benefit for the difference between the 35% 2015 carry back tax rate and the current 21% federal statutory rate. These tax benefits were partially offset by $9 million tax expense related to stock-based compensation and $4 million of incremental global intangible low-taxed income (\"GILTI\") tax.\nThese discrete net tax benefits resulted in full-year total income tax benefit in 2020 of $153 million, on a pre-tax net loss of $24 million, causing a tax rate of 637.5%.\nOn January 1, 2020, we transferred certain of our intellectual property among our wholly-owned subsidiaries, which resulted in the recognition of deferred tax assets of $157 million. The recognition of deferred tax assets from intra-entity transfers of intellectual property required us to make significant estimates and assumptions to determine the fair value of such intellectual property, using a discounted cash flow model. Significant assumptions in valuing the intellectual property include, but are not limited to, internal revenue and expense forecasts, and the discount rate. The sustainability of our future tax benefits is dependent upon the acceptance of these valuation estimates and assumptions by the taxing authorities.\nThe 2019 effective tax rate was impacted by $3 million tax expense related to stock-based compensation and $3 million of incremental GILTI tax, which resulted in full-year income tax expense in 2019 of $7 million, on a pre-tax net loss of $13 million, causing a negative tax rate of 53.8%.\nThe 2018 effective tax rates were impacted by the Tax Cuts and Jobs Act of 2017 (\"Tax Act\"), which was signed into law on December 22, 2017, making significant changes to the United States Internal Revenue Code. Changes include, but are not limited to:\n•A corporate tax rate decrease from 35% to 21% effective for tax years beginning after December 31, 2017,\n•The transition of United States international taxation from a worldwide tax system to a modified territorial tax system, and\n•A one-time transition tax on the mandatory deemed repatriation of cumulative foreign earnings as of December 31, 2017.\nOn December 22, 2017, Staff Accounting Bulletin No. 118 (\"SAB 118\") was issued to address the application of GAAP in situations when a registrant does not have the necessary information available, prepared, or analyzed (including computations) in reasonable detail to complete the accounting for certain income tax effects of the Tax Act.\nIn accordance with SAB 118, the Company completed its analysis of the impact of the Tax Act during the fourth quarter of 2018 in accordance with its understanding of the Tax Act and guidance available as of the date of this filing. For the year ended December 31, 2018, the Company recorded a $6 million tax benefit as an adjustment to the 2017 provisional estimate in accordance with SAB 118 because of additional regulatory guidance and changes in interpretations and assumptions the Company initially made as a result of the Tax Act. Effective in 2018, the Tax Act subjects United States shareholders to a tax on GILTI earned by certain foreign subsidiaries. The Company has elected to provide for the tax expense related to GILTI in the year the tax is incurred. The Company recorded tax expense of $3 million in 2019 and $1 million in 2018 for GILTI.\nDeferred income tax assets and liabilities included in the balance sheets at December 31 were as follows:\nIn millions 2020 2019\nDeferred income tax assets\nEmployee pensions and other liabilities $ 62 $ 63\nOther balance sheet reserves and allowances 13 18\nOperating lease liabilities 10 14\nTax loss and credit carryforwards 105 80\nDeferred revenue 7 12\nIntangibles and capitalized software 155 -\nTotal deferred income tax assets 352 187\nValuation allowance (51) (45)\nNet deferred income tax assets 301 142\nDeferred income tax liabilities\nIntangibles and capitalized software - 8\nRight of use assets - operating lease 9 13\nProperty and equipment 52 12\nOther 25 28\nTotal deferred income tax liabilities 86 61\nTotal net deferred income tax assets $ 215 $ 81\nAs of December 31, 2020, Teradata has net operating loss (\"NOL\") and tax credit carryforwards totaling $105 million (tax effected and before any valuation allowance offset and application of recognition criteria for uncertain tax positions). Of the total tax carryforwards, $17 million are NOL's in the United States and certain foreign jurisdictions, a small portion of which will begin to expire in 2021; $7 million are United States foreign tax credit carryforwards which expire in 2028, which have a $3 million valuation allowance offset; $16 million are federal R&D credits, which will begin to expire in 2038; and $65 million are California R&D tax credits that have an indefinite carryforward period, which have a $47 million valuation allowance offset and $17 million of FIN 48 reserve recorded.\nPrior to the enactment of the Tax Act, the Company had not provided for taxes on the undistributed earnings of its foreign subsidiaries as the Company either reinvested or intended to reinvest those earnings outside of the United States. Because of the Tax Act, the Company has changed its indefinite reinvestment assertion related to foreign earnings that have been taxed in the United States and now considers a majority of these earnings no longer indefinitely reinvested. Because of United States tax reform legislation, distributions of profits from non-U.S. subsidiaries are not expected to cause a significant United States tax impact in the future. However, these distributions may be subject to non-U.S. withholding taxes if profits are distributed from certain jurisdictions. The Company has recorded $2 million of deferred foreign withholding tax expense with respect to certain earnings which are not considered permanently reinvested as they would be taxable upon remittance. Deferred taxes have not been provided on earnings considered indefinitely reinvested.\nThe Company may recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The Company reflects any interest and penalties recorded in connection with its uncertain tax positions as a component of income tax expense.\nAs of December 31, 2020, the Company’s uncertain tax positions totaled approximately $39 million, of which $18 million is reflected in the other liabilities section of the Company’s balance sheet as a non-current liability. The remaining balance of $21 million of uncertain tax positions relates to certain tax attributes both generated by the Company and acquired in various acquisitions, which are netted against the underlying deferred tax assets recorded on the balance sheet. The entire balance of $39 million in uncertain tax positions would cause a decrease in the effective income tax rate upon recognition. Teradata has recorded $1 million of interest accruals related to its uncertain tax liabilities as of December 31, 2020.\nBelow is a roll-forward of the Company’s liability related to uncertain tax positions at December 31:\nIn millions 2020 2019\nBalance at January 1 $ 37 $ 34\nGross increases for prior period tax positions 6 4\nGross increases for current period tax positions 2 5\nDecreases due to the lapse of applicable statute of limitations (2) (6)\nDecreases relating to settlements with taxing authorities (4) -\nBalance at December 31 $ 39 $ 37\nThe Company and its subsidiaries file income tax returns in the United States and various state jurisdictions, as well as numerous foreign jurisdictions. As of December 31, 2020, the Company has ongoing tax audits in a limited number of state and foreign jurisdictions. However, no material adjustments have been proposed or made in any of these examinations to date, which would result in any incremental income tax expense in future periods to the Company. The Company's tax returns for years 2017-2020 are still open for assessment by tax authorities in its major jurisdictions.\nNote 7 Employee Stock-based Compensation Plans\nThe Company recorded stock-based compensation expense for the years ended December 31 as follows:\nIn millions 2020 2019 2018\nStock options $ 1 $ 3 $ 6\nRestricted shares 98 77 56\nEmployee share repurchase program 2 3 3\nTotal stock-based compensation before income taxes 101 83 65\nTax benefit (5) (10) (11)\nTotal stock-based compensation, net of tax $ 96 $ 73 $ 54\nThe Teradata Corporation 2007 Stock Incentive Plan (the \"2007 SIP\"), as amended, and the Teradata 2012 Stock Incentive Plan (the \"2012 SIP\"), as amended, provide for the grant of several different forms of stock-based compensation. The 2012 SIP was adopted and approved by stockholders in April 2012 and no further awards may be made under the 2007 SIP after that time. A total of approximately 27.5 million shares were authorized to be issued under the 2012 SIP. In May 2020, the Teradata Board of Directors adopted the Teradata New Employee Stock Inducement Plan (the \"NESIP\"), effective June 1, 2020. Pursuant to the NESIP, the Company may grant equity incentive compensation as a material inducement for certain individuals to commence employment with Teradata within the meaning of Rule 303A.08 of the NYSE Listed Company Manual. A total of 1.3 million shares are reserved for grant under the NESIP and new CEO award, subject to adjustment as provided in the NESIP. The NESIP is scheduled to terminate on June 1, 2023, or such earlier date that the Board shall determine.\nNew shares of the Company’s common stock are issued as a result of the vesting of restricted share units and stock option exercises and at the time of grant for restricted shares, for awards under all plans.\nAs of December 31, 2020, the Company’s primary types of stock-based compensation were stock options, restricted shares, restricted share units and the employee stock purchase program (the \"ESPP\").\nStock Options\nNo options were granted in 2020, 2019 and 2018. In addition, no options were exercised in 2020.\nRestricted Shares and Restricted Share Units\nThe Teradata SIP provides for the issuance of restricted shares, as well as restricted share units. These grants consist of both service-based and performance-based awards. Service-based awards typically vest over a three-year period beginning on the effective date of grant. These grants are not subject to future performance measures. The cost of these awards, determined to be the fair market value at the date of grant, is expensed ratably over the vesting period. For substantially all restricted share grants, at the date of grant, the recipient has all rights of a stockholder, subject to certain restrictions on transferability and a risk of forfeiture. A recipient of restricted share units does not have the rights of a stockholder and is subject to restrictions on transferability and risk of forfeiture. For both restricted share\ngrants and restricted share units, any potential dividend rights would be subject to the same vesting requirements as the underlying equity award. As a result, such rights are considered a contingent transfer of value and consequently these equity awards are not considered participating securities. Performance-based grants are subject to future performance measurements over a one-to three-year period. All performance-based shares that are earned in respect of an award will become vested at the end of the performance and/or service period provided the employee is continuously employed by the Company and applicable performance measures and other vesting conditions are met. The fair value of each performance-based award is determined on the grant date, based on the Company’s stock price, and assumes that performance targets will be achieved. Over the performance period, the number of shares of stock that will be issued is adjusted upward or downward based upon management’s assessment of the probability of achievement of performance targets. The ultimate number of shares issued and the related compensation cost recognized as expense will be based on a comparison of the final achievement of performance metrics to the specified targets.\nThe following table reports restricted shares and restricted share unit activity during the year ended December 31, 2020:\nShares in thousands Number of\nShares Weighted-\nAverage\nGrant\nDate Fair\nValue\nper Share\nUnvested shares at January 1, 2020 5,169 $ 40.95\nGranted 6,145 $ 20.74\nVested (2,100) $ 37.19\nForfeited/canceled (1,702) $ 31.74\nUnvested shares at December 31, 2020 7,512 $ 27.00\nThe following table summarizes the weighted-average fair value of restricted share units granted for Teradata equity awards and the total fair value of shares vested.\n2020 2019 2018\nWeighted-average fair value of restricted share units granted\n$ 20.74 $ 44.13 $ 37.98\nTotal fair value of shares vested (in millions)\n$ 80 $ 41 $ 53\nAs of December 31, 2020, there was $122 million of unrecognized compensation cost related to unvested restricted share grants. The unrecognized compensation cost is expected to be recognized over a remaining weighted-average period of 1.0 years.\nThe following table represents the composition of Teradata restricted share unit grants in 2020:\nShares in thousands Number of\nShares Weighted-\nAverage\nGrant\nDate Fair\nValue\nService-based shares 5,570 $ 20.75\nPerformance-based shares 575 $ 20.68\nTotal stock grants 6,145 $ 20.74\nEmployee Stock Purchase Program\nThe Company’s ESPP, effective on October 1, 2007, and as amended effective as of January 30, 2018, provides eligible employees of Teradata and its designated subsidiaries an opportunity to purchase the Company’s common stock at a discount to the average of the highest and lowest sale prices on the last trading day of each month. The ESPP discount is 15% of the average market price and is considered compensatory.\nEmployees may authorize payroll deductions of up to 10% of eligible compensation for common stock purchases. A total of 7 million shares were authorized to be issued under the ESPP, with approximately 1.3 million shares remaining under that authorization at December 31, 2020. The shares of Teradata common stock purchased by a participant on an exercise date (the last day of each month), for all purposes, are deemed to have been issued and sold at the close of business on such exercise date. Prior to that time, none of the rights or privileges of a stockholder exists with respect to such shares. Employee purchases and aggregate cost were as follows at December 31:\nIn millions 2020 2019 2018\nEmployee share purchases 0.7 0.6 0.5\nAggregate cost $ 14 $ 20 $ 17\nNote 8 Employee Benefit Plans\nPension and Postemployment Plans. Teradata currently sponsors defined benefit pension plans for certain of its international employees. For those international pension plans for which the Company holds asset balances, those assets are primarily invested in common/collective trust funds (which include publicly traded common stocks, corporate and government debt securities, real estate indirect investments, cash or cash equivalents) and insurance contracts.\nPostemployment obligations relate to benefits provided to involuntarily terminated employees and certain inactive employees after employment but before retirement. These benefits are paid in accordance with various foreign statutory laws and regulations, and Teradata’s established postemployment benefit practices and policies. Postemployment benefits may include disability benefits, supplemental unemployment benefits, severance, workers’ compensation benefits, continuation of health care benefits and life insurance coverage, and are funded on a pay-as-you-go basis.\nPension and postemployment benefit costs for the years ended December 31 were as follows:\n2020 2019 2018\nIn millions Pension Postemployment Pension Postemployment Pension Postemployment\nService cost $ 7 $ 11 $ 7 $ 11 $ 8 $ 8\nInterest cost 2 1 3 1 3 1\nExpected return on plan assets (2) - (2) - (2) -\nSettlement charge 1 - - - - -\nCurtailment charge - - - - (1) -\nAmortization of actuarial loss 2 7 1 5 1 4\nTotal costs $ 10 $ 19 $ 9 $ 17 $ 9 $ 13\nThe underfunded amount of pension and postemployment obligations is recorded as a liability in the Company’s consolidated balance sheet. The following tables present the changes in benefit obligations, plan assets, funded status and the reconciliation of the funded status to amounts recognized in the consolidated balance sheets and in accumulated other comprehensive income at December 31:\nPension Postemployment\nIn millions 2020 2019 2020 2019\nChange in benefit obligation\nBenefit obligation at January 1 $ 149 $ 132 $ 61 $ 54\nService cost 7 7 11 11\nInterest cost 2 3 1 1\nPlan participant contributions 1 1 - -\nActuarial loss 14 24 12 21\nBenefits paid (1) (10) (24) (26)\nCurtailment (5) (1) - -\nSettlement (11) (6) - -\nPlan Amendment - - 3 -\nCurrency translation adjustments 8 (1) - -\nBenefit obligation at December 31 $ 164 $ 149 $ 64 $ 61\nChange in plan assets\nFair value of plan assets at January 1 $ 69 $ 68 $ - $ -\nActual return on plan assets 4 10 - -\nCompany contributions 5 6 - -\nBenefits paid (1) (10) - -\nCurrency translation adjustments 5 - - -\nPlan participant contribution 1 1 - -\nSettlements (11) (6) - -\nFair value of plan assets at December 31 72 69 - -\nFunded status (underfunded) $ (92) $ (80) $ (64) $ (61)\nAmounts Recognized in the Consolidated Balance Sheet\nNon-current assets $ 8 $ 6 $ - $ -\nCurrent liabilities (2) (1) (10) (10)\nNon-current liabilities (98) (85) (54) (51)\nNet amounts recognized $ (92) $ (80) $ (64) $ (61)\nAmounts Recognized in Accumulated Other Comprehensive Income (Loss)\nUnrecognized Net actuarial loss $ 31 $ 30 $ 66 $ 61\nUnrecognized Prior service cost - - 5 2\nTotal $ 31 $ 30 $ 71 $ 63\nThe following table presents the accumulated pension benefit obligation at December 31:\nIn millions 2020 2019\nAccumulated pension benefit obligation $ 153 $ 137\nThe following table presents pension plans with accumulated benefit obligations in excess of plan assets at December 31:\nIn millions 2020 2019\nProjected benefit obligation $ 132 $ 119\nAccumulated benefit obligation $ 123 $ 109\nFair value of plan assets\n$ 33 $ 33\nThe following table presents the pre-tax net changes in projected benefit obligations recognized in other comprehensive income:\nPension Postemployment\nIn millions 2020 2019 2020 2019\nActuarial loss arising during the year $ 7 $ 15 $ 15 $ 21\nAmortization of loss included in net periodic benefit cost\n(2) (1) (7) (5)\nRecognition of loss due to curtailment\n(5) - - -\nRecognition of loss due to settlement\n(2) - - -\nForeign currency exchange 3 - - -\nTotal recognized in other comprehensive income (loss)\n$ 1 $ 14 $ 8 $ 16\nThe weighted-average rates and assumptions used to determine benefit obligations at December 31, and net periodic benefit cost for the years ended December 31, were as follows:\nPension Benefit Obligations Pension Benefit Cost\n2020 2019 2020 2019 2018\nDiscount rate 0.9% 1.2% 1.2% 2.2% 2.1%\nRate of compensation increase 2.8% 3.0% 3.0% 3.4% 3.3%\nExpected return on plan assets N/A N/A 3.5% 3.0% 2.8%\nInterest crediting rate assumption 0.9% 0.9% 0.9% 0.8% N/A\nPostemployment\nBenefit Obligations Postemployment\nBenefit Cost\n2020 2019 2020 2019 2018\nDiscount rate 1.6% 1.8% 1.8% 2.5% 2.6%\nRate of compensation increase 3.0% 3.0% 3.0% 3.0% 3.0%\nInvoluntary turnover rate 3.5% 3.0% 3.0% 2.5% 2.3%\nThe Company determines the expected return on assets based on individual plan asset allocations, historical capital market returns, and long-term interest rate assumptions, with input from its actuaries, investment managers, and independent investment advisors. The company emphasizes long-term expectations in its evaluation of return factors, discounting or ignoring short-term market fluctuations. Expected asset returns are reviewed annually, but are generally modified only when asset allocation strategies change or long-term economic trends are identified.\nInternational discount rates were determined by examining interest rate levels and trends within each country, particularly yields on high-quality long-term corporate bonds, relative to our future expected cash flows. The discount rate used for countries with individually insignificant benefit obligation at year-end was derived by matching the plans’ expected future cash flows to the corresponding yields from the Citigroup Pension Liability Index. This yield curve has been constructed to represent the available yields on high-quality fixed-income investments across a broad range of future maturities.\nGains and losses have resulted from changes in actuarial assumptions and from differences between assumed and actual experience, including, among other items, changes in discount rates and differences between actual and assumed asset returns. These gains and losses (except those differences being amortized to the market-related value) are only amortized to the extent that they exceed 10% of the higher of the market-related value of plan assets or the projected benefit obligation of each respective plan.\nPlan Assets. The weighted-average asset allocations at December 31, by asset category are as follows:\nActual Asset Allocation\nas of December 31 Target Asset\n2020 2019 Allocation\nEquity securities 34% 34% 32%\nDebt securities 44% 43% 49%\nInsurance (annuity) contracts 12% 12% 12%\nReal estate 8% 10% 4%\nOther 2% 1% 3%\nTotal 100% 100% 100%\nInvestment Strategy. Teradata employs several investment strategies across its various international pension plans. In some countries, particularly where Teradata does not have a large employee base, the Company may use insurance (annuity) contracts to satisfy its future pension payment obligations, whereby the Company makes pension plan contributions to an insurance company in exchange for which the pension plan benefits will be paid when the members reach a specified retirement age or on earlier exit of members from the plan. In other countries, the Company may employ local asset managers to manage investment portfolios according to the investment policies and guidelines established by the Company, and with consideration to individual plan liability structure and local market environment and risk tolerances. The Company’s investment policies and guidelines primarily emphasize diversification across and within asset classes to maximize long-term returns subject to prudent levels of risk, with the overall objective of enabling the plans to meet their future obligations. The investment portfolios contain a diversified blend of equity and fixed-income investments. Furthermore, equity investments are diversified across domestic and international stocks, small and large capitalization stocks, and growth and value stocks. Fixed-income assets are diversified across government and corporate bonds. Where applicable, real estate investments are made through real estate securities, partnership interests or direct investment, and are diversified by property type and location.\nFair Value. Fair value measurements are established utilizing a three-tier fair value hierarchy, which prioritizes the inputs used in measuring fair value. These tiers are more fully described in Note 11.\nThe following is a description of the valuation methodologies used for pension assets as of December 31, 2020.\nCommon/collective trust funds (which include money market funds, equity funds, bond funds, real estate indirect investments, etc.): Valued at the net asset value (\"NAV\") of shares held by the Plan at year end, as reported to the Plan by the trustee, which represents the fair value of shares held by the Plan. Because the NAV of the shares held in the common/collective trust funds are derived by the value of the underlying investments, the Company has classified these underlying investments as Level 2 fair value measurements.\nInsurance contracts: Valued by discounting the related future benefit payments using a current year-end market discount rate, which represents the fair value of the insurance contract. The Company has classified these contracts as Level 3 assets for fair value measurement purposes.\nThe following table sets forth by level, within the fair value hierarchy, the pension plan assets at fair value as of December 31, 2020:\nFair Value Measurements at Reporting Date Using\nQuoted Prices in Active Markets\nfor Identical\nAssets Significant\nOther\nObservable\nInputs Significant\nUnobservable\nInputs\nIn millions December 31, 2020 (Level 1) (Level 2) (Level 3)\nMoney market funds $ 1 $ - $ 1 $ -\nEquity funds 25 - 25 -\nBond/fixed-income funds 32 - 32 -\nReal estate indirect investments 6 - 6 -\nInsurance contracts 8 - - 8\nTotal assets at fair value $ 72 $ - $ 64 $ 8\nThe table below sets forth a summary of changes in the fair value of the pension plan level 3 assets for the year ended December 31, 2020:\nIn millions Insurance\nContracts\nBalance as of January 1, 2020 $ 8\nPurchases, sales and settlements, net -\nBalance as of December 31, 2020 $ 8\nThe following table sets forth by level, within the fair value hierarchy, the pension plan assets at fair value as of December 31, 2019:\nFair Value Measurements at Reporting Date Using\nQuoted Prices in Active\nMarkets\nfor Identical\nAssets Significant\nOther\nObservable\nInputs Significant\nUnobservable\nInputs\nIn millions December 31, 2019 (Level 1) (Level 2) (Level 3)\nMoney market funds $ 1 $ - $ 1 $ -\nEquity funds 23 - 23 -\nBond/fixed-income funds 30 - 30 -\nReal estate indirect investments 7 - 7 -\nInsurance contracts 8 - - 8\nTotal assets at fair value $ 69 $ - $ 61 $ 8\nThe table below sets forth a summary of changes in the fair value of the pension plan level 3 assets for the year ended December 31, 2019:\nIn millions Insurance\nContracts\nBalance as of January 1, 2019 $ 8\nPurchases, sales and settlements, net -\nDecember 31, 2019 $ 8\nCash Flows Related to Employee Benefit Plans\nCash Contributions. In 2021, the Company expects to contribute approximately $3 million to the international pension plans.\nEstimated Future Benefit Payments. The Company expects to make the following benefit payments, estimated based on the assumptions used to measure the company's benefit obligation at the end of the year, reflecting past and future service from its pension and postemployment plans:\nPension Postemployment\nIn millions Benefits Benefits\nYear\n2021 $ 8 $ 10\n2022 $ 6 $ 10\n2023 $ 6 $ 10\n2024 $ 6 $ 10\n2025 $ 7 $ 10\n2026 - 2030 $ 37 $ 52\nSavings Plans. United States employees and many international employees participate in defined contribution savings plans. These plans generally provide either a specified percent of pay or a matching contribution on participating employees’ voluntary elections. The Company’s matching contributions typically are subject to a maximum percentage or level of compensation. Employee contributions can be made pre-tax, after-tax or a combination thereof. The following table identifies the expense for the United States and International subsidiary savings plans for the years ended December 31:\nIn millions 2020 2019 2018\nU.S. savings plan $ 19 $ 21 $ 22\nInternational subsidiary savings plans $ 13 $ 16 $ 17\nNote 9 Derivative Instruments and Hedging Activities\nAs a portion of Teradata’s operations is conducted outside the United States and in currencies other than the U.S. dollar, the Company is exposed to potential gains and losses from changes in foreign currency exchange rates. In an attempt to mitigate the impact of currency fluctuations, the Company uses foreign exchange forward contracts to hedge transactional exposures resulting predominantly from foreign currency denominated inter-company receivables and payables. The forward contracts are designated as fair value hedges of specified foreign currency denominated inter-company receivables and payables and generally mature in three months or less. The fair values of foreign exchange contracts are based on market spot and forward exchange rates and represent estimates of possible value that may not be realized in the future. Across its portfolio of contracts, Teradata has both long and short positions relative to the U.S. dollar. As a result, Teradata’s net involvement is less than the total contract notional amount of the Company’s foreign exchange forward contracts.\nGains and losses from foreign exchange forward contracts are fully recognized each period and reported along with the offsetting gain or loss of the related hedged item, either in cost of revenues or in other income (expense), depending on the nature of the related hedged item.\nIn June 2018, Teradata executed a five-year interest rate swap with a $500 million initial notional amount to hedge the floating interest rate of its Term Loan, as more fully described in Note 12. The Company uses interest rate swaps to manage interest rate risks on future interest payments caused by interest rate changes on its variable rate term loan. The notional amount of the hedge will step-down according to the amortization schedule of the term loan. The notional amount of the hedge was $456 million as of December 31, 2020.\nThe Company performed an initial effectiveness assessment in the third quarter of 2018 on the interest rate swap, and the hedge was determined to be effective. The hedge is being evaluated qualitatively on a quarterly basis for effectiveness. Changes in fair value are recorded in Accumulated Other Comprehensive Loss and periodic settlements of the swap will be recorded in interest expense along with the interest on amounts outstanding under the term loan.\nThe following table identifies the contract notional amount of the Company’s hedging instruments at December 31:\nIn millions 2020 2019\nContract notional amount of foreign exchange forward contracts $ 90 $ 150\nNet contract notional amount of foreign exchange forward contracts $ 29 $ 41\nContract notional amount of interest rate swap $ 456 $ 482\nAll derivatives are recognized in the consolidated balance sheets at their fair value. The notional amounts represent agreed-upon amounts on which calculations of dollars to be exchanged are based and are an indication of the extent of Teradata’s involvement in such instruments. These notional amounts do not represent amounts exchanged by the parties and, therefore, are not a measure of the instruments. Refer to Note 11 for disclosures related to the fair value of all derivative assets and liabilities.\nThe Company does not hold or issue derivative financial instruments for trading purposes, nor does it hold or issue leveraged derivative instruments. By using derivative financial instruments to hedge exposures to changes in foreign exchange and interest rates, the Company exposes itself to credit risk. The Company manages exposure to counterparty credit risk by entering into derivative financial instruments with highly rated institutions that can be expected to fully perform under the terms of the applicable contracts.\nNote 10 Commitments and Contingencies\nLegal Proceedings\nIn the ordinary course of business, the Company is subject to proceedings, lawsuits, governmental investigations, claims and other matters, including those that relate to the environment, health and safety, employee benefits, export compliance, intellectual property, tax matters and other regulatory compliance and general matters. We are not currently a party to any litigation, nor are we aware of any pending or threatened litigation against us that we believe would materially affect our business, operating results, financial condition or cash flows, other than the following:\nOn June 19, 2018, the Company and certain of its subsidiaries filed a lawsuit in the U.S. District Court for the Northern District of California against SAP SE, SAP America, Inc., and SAP Labs, LLC (collectively, \"SAP\"). In the lawsuit, the Company alleges, among other things, that SAP misappropriated certain of the Company’s trade secrets within the Company’s enterprise data analytics and warehousing products and used them to help develop, improve, introduce, and sell one or more competing products. The Company further alleges that SAP has employed anticompetitive practices using its substantial market position in the enterprise resource planning applications market to pressure the Company’s customers and prospective customers to use SAP’s one or more competing products and reduce or eliminate customers' and prospective customers' use of the Company's offerings. The Company seeks an injunction barring SAP’s alleged conduct, monetary damages, and other available legal and equitable relief. In July 2019, SAP filed patent infringement counterclaims against Teradata based on five of SAP’s U.S. patents (one of which has since been dismissed from the suit), and we are vigorously defending against these counterclaims. On August 31, 2020, the Company filed a second lawsuit against SAP in the U.S. District Court for the Northern District of California. In this lawsuit as it currently stands, Teradata alleges infringement by SAP of four of Teradata’s U.S. patents and seeks an injunction barring SAP from further infringement, monetary damages, and other available legal and equitable relief. On February 16, 2021, SAP filed additional patent infringement counterclaims against Teradata based on six additional U.S. patents. On the same day, SAP also filed a lawsuit in Germany for infringement of a single German patent. Currently, it is not possible to determine the likelihood of a loss or a reasonably estimated range of loss, if any, pertaining to any of SAP’s patent counterclaims in the United States or its German lawsuit.\nGuarantees and Product Warranties.\nGuarantees associated with the Company’s business activities are reviewed for appropriateness and impact to the Company’s financial statements. Periodically, the Company’s customers enter into various leasing arrangements coordinated with a leasing company. In some instances, the Company guarantees the leasing company a minimum value at the end of the lease term on the leased equipment. As of December 31, 2020, the maximum future payment obligation of this guaranteed value and the associated liability balance was immaterial.\nFor customers that purchase hardware, the Company provides a standard manufacturer’s warranty and records, at the time of the sale, a corresponding estimated liability for potential warranty costs. The estimated liabilities for warranty costs are not material, given that most customers do not purchase hardware under the subscription model. The Company also offers extended and/or enhanced coverage to its customers in the form of maintenance contracts. Teradata accounts for these contracts by deferring the related maintenance revenue over the extended and/or enhanced coverage period. Costs associated with maintenance support are expensed as incurred.\nIn addition, the Company provides its customers with certain indemnification rights. In general, the Company agrees to indemnify the customer if a third party asserts patent or other infringement on the part of the customer for its use of the Company’s offerings. The Company has indemnification obligations under its charter and bylaws to its officers and directors, and has entered into indemnification agreements with the officers and directors of its subsidiaries. From time to time, the Company also enters into agreements in connection with its acquisition and divesture activities that include indemnification obligations by the Company. The fair value of these indemnification obligations is typically not readily determinable due to the conditional nature of the Company’s potential obligations and the specific facts and circumstances involved with each particular agreement. As such, the Company has generally not recorded a liability in connection with these indemnification arrangements. Historically, payments made by the Company under these types of agreements have not had a material effect on the Company’s consolidated financial condition, results of operations or cash flows.\nConcentrations of Risk. The Company is potentially subject to concentrations of credit risk on accounts receivable and financial instruments such as hedging instruments, and cash and cash equivalents. Credit risk includes the risk of nonperformance by counterparties. The maximum potential loss may exceed the amount recognized on the balance sheet. Exposure to credit risk is managed through credit approvals, credit limits, selecting major international financial institutions (as counterparties to hedging transactions) and monitoring procedures. Teradata’s business often involves large transactions with customers, and if one or more of those customers were to default in its obligations under applicable contractual arrangements, the Company could be exposed to potentially significant losses. However, management believes that the reserves for potential losses were adequate at December 31, 2020 and December 31, 2019.\nThe Company is also potentially subject to concentrations of supplier risk. Our hardware components are assembled exclusively by Flex Ltd. (\"Flex\"). Flex procures a wide variety of components used in the manufacturing process on behalf of the Company. Although many of these components are available from multiple sources, Teradata utilizes preferred supplier relationships to provide more consistent and optimal quality, cost and delivery. Typically, these preferred suppliers maintain alternative processes and/or facilities to ensure continuity of supply. Given the Company’s strategy to outsource its manufacturing activities to Flex and to source certain components from single suppliers, a disruption in production at Flex or at a supplier could impact the timing of customer shipments and/or Teradata’s operating results. In addition, a significant change in the forecasts to any of these preferred suppliers could result in purchase obligations for components that may be in excess of demand.\nNote 11 Fair Value Measurements\nFair value measurements are established utilizing a three-tier fair value hierarchy, which prioritizes the inputs used in measuring fair value. These tiers include: Level 1, defined as observable inputs such as quoted prices in active markets for identical assets or liabilities; Level 2, defined as significant other observable inputs, such as quoted prices in active markets for similar assets or liabilities, or quoted prices in less-active markets for identical assets; and Level 3, defined as unobservable inputs in which little or no market data exists, therefore requiring an entity to develop its own assumptions. Financial assets and liabilities are classified in their entirety based on the lowest level of input that is significant to the fair value measurement.\nThe Company’s assets and liabilities measured at fair value on a recurring basis include money market funds, interest rate swaps and foreign currency exchange contracts. A portion of the Company’s excess cash reserves are held in money market funds which generate interest income based on the prevailing market rates. Money market funds are included in cash and cash equivalents in the Company’s balance sheet. Money market fund holdings are measured at fair value using quoted market prices and are classified within Level 1 of the valuation hierarchy.\nWhen deemed appropriate, the Company minimizes its exposure to changes in foreign currency exchange rates using derivative financial instruments, specifically, foreign exchange forward contracts. Additionally, in June 2018, Teradata executed a five-year interest rate swap with a $500 million initial notional amount to hedge the floating interest rate on its term-loan. The fair value of these contracts and swaps are measured at the end of each interim reporting period using observable inputs other than quoted prices, specifically market spot and forward exchange rates. As such, these derivative instruments are classified within Level 2 of the valuation hierarchy. Fair value of unrealized gains for open contracts are recorded in other assets and the fair value of unrealized losses are recorded in other liabilities in the Company's balance sheet. The fair value of foreign exchange forward contracts recorded in other assets and other liabilities at December 31, 2020 and 2019 were not material. Realized gains and losses from the Company’s fair value hedges net of corresponding gains or losses on the underlying exposures were immaterial for years ended December 31, 2020, 2019 and 2018.\nThe Company’s assets and liabilities measured at fair value on a recurring basis and subject to fair value disclosure requirements at December 31, 2020 and December 31, 2019 were as follows:\nFair Value Measurements at Reporting Date Using\nQuoted Prices\nin Active Markets\nfor Identical\nAssets Significant\nOther\nObservable\nInputs Significant Unobservable Inputs\nIn millions Total (Level 1) (Level 2) (Level 3)\nAssets\nMoney market funds at December 31, 2020 $ 16 $ 16 $ - $ -\nMoney market funds at December 31, 2019 $ 141 $ 141 $ - $ -\nLiabilities\nInterest rate swap at December 31, 2020 $ 27 $ - $ 27 $ -\nInterest rate swap at December 31, 2019 $ 19 $ - $ 19 $ -\nNote 12 Debt\nIn June 2018, Teradata replaced its existing five-year, $400 million revolving credit facility with a new $400 million revolving credit facility (the \"Credit Facility\"). The Credit Facility ends in June 2023, at which point any remaining outstanding borrowings would be due for repayment unless extended by agreement of the parties for up to two additional one-year periods. In addition, under the terms of the Credit Facility, Teradata from time to time and subject to certain conditions may increase the lending commitments under the Credit Facility in an aggregate principal amount up to an additional $200 million, to the extent that existing or new lenders agree to provide such additional commitments. The outstanding principal amount of the Credit Facility bears interest at a floating rate based upon, at Teradata’s option, a negotiated base rate or a Eurodollar rate plus, in each case, a margin based on Teradata’s leverage ratio. In the near term, Teradata would anticipate choosing a floating rate based on London Interbank Offered Rate (\"LIBOR\"). The Credit Facility is unsecured but is guaranteed by certain of Teradata’s material domestic subsidiaries and contains certain representations and warranties, conditions, affirmative, negative and financial covenants, and events of default customary for such facilities. As of December 31, 2020 and 2019, the Company had no borrowings outstanding under the Credit Facility, leaving $400 million in additional borrowing capacity available under the Credit Facility. The Company was in compliance with all covenants as of December 31, 2020 and 2019.\nAlso, in June 2018, Teradata closed on a new senior unsecured $500 million five-year term loan, the proceeds of which plus additional cash-on-hand were used to pay off the remaining $525 million of principal on its previous term loan. The term loan is payable in quarterly installments, which commenced on June 30, 2019, with 1.25% of the initial principal amount due on each of the first eight payment dates; 2.50% of the initial principal amount due on each of the next four payment dates; 5.0% of the initial principal amount due on each of the next three payment dates; and all remaining principal due on June 11, 2023. The outstanding principal amount of the term loan bears\ninterest at a floating rate based upon a negotiated base rate or a Eurodollar rate plus, in each case, a margin based on the leverage ratio of the Company. The term loan principal outstanding was $456 million at December 31, 2020 and $482 million at December 31, 2019. As disclosed in Note 9, Teradata entered into an interest rate swap to hedge the floating interest rate of the Term Loan. As a result of the swap, Teradata’s fixed rate on the term loan equals 2.86% plus the applicable leverage-based margin as defined in the term loan agreement. As of December 31, 2020 and 2019, the all-in fixed rate is 4.36%. Remaining unamortized deferred issuance costs of approximately $1 million were being amortized over the five-year term of the loan. The Company was in compliance with all covenants as of December 31, 2020 and 2019.\nAnnual contractual maturities of outstanding principal on the term loan at December 31, 2020, are as follows:\nIn millions\n2021 44\n2022 87\n2023 325\nTotal $ 456\nTeradata’s term loan is recognized on the Company’s balance sheet at its unpaid principal balance and is not subject to fair value measurement. However, given that the loan carries a variable rate, the Company estimates that the unpaid principal balance of the term loan would approximate its fair value. If measured at fair value in the financial statements, the Company’s term loan would be classified as Level 2 in the fair value hierarchy.\nNote 13. Leases\nLessee\nThe Company adopted ASU No. 2016-02, \"Leases (Topic 842),\" on January 1, 2019, which requires leases with durations greater than twelve months to be recognized on the balance sheet. The Company adopted the standard using the modified retrospective approach utilizing the optional transition method. Prior year financial statements were not recast using this approach. The Company elected the package of practical expedients available for expired or existing contracts, which allowed us to carryforward our historical assessments of (1) whether contracts are or contain leases, (2) lease classification and (3) initial direct costs. Adoption of the new standard resulted in the recording of additional net lease assets and lease liabilities of approximately $68 million and $66 million, respectively, as of January 1, 2019. The standard did not materially impact our consolidated net earnings or cash flows.\nThe Company leases property and equipment under finance and operating leases. The Company's operating leases consist of automobiles in certain countries and real estate, including office, storage and parking spaces. The duration of these leases range from 2 to 6 years. The Company's finance leases primarily consist of equipment financed for the purpose of delivering services to our customers. For leases with terms greater than 12 months, the Company recorded the related asset and obligation at the present value of lease payments over the term. Many of our leases include variable rental escalation clauses which are recognized when incurred. Some of our leases also include renewal options and/or termination options that are factored into the determination of lease payments and lease terms when it is reasonably certain that the Company will exercise these options. Lease agreements do not contain any material residual value guarantees or material restrictive covenants. Leases with an initial term of 12 months or less are not recorded on the balance sheet. The Company recognizes lease expense for these leases on a straight-line basis over the lease term. For real estate leases beginning in 2019 and later, we account for lease components (e.g., fixed payments including rent, real estate taxes and insurance costs) separately from the non-lease components (e.g., common-area maintenance costs). For automobile leases we account for lease and non-lease components together.\nWhen available, the Company uses the rate implicit in the lease to discount lease payments to present value. However, real estate leases do not typically provide a readily determinable implicit rate. Therefore, the Company must estimate the incremental borrowing rate to discount the lease payments based on information available at lease commencement. The incremental borrowing rate used in the calculation of the lease liability is based on the secured rate associated with financed lease obligations for each location of leased property.\nThe table below presents the lease-related assets and liabilities recorded on the balance sheet at December 31:\nIn millions, except weighted average calculations Classification on the Balance Sheet 2020 2019\nAssets\nOperating lease assets Right of use assets - operating lease, net $ 38 $ 51\nFinance lease assets Property and equipment, net 170 141\nTotal lease assets $ 208 $ 192\nLiabilities\nCurrent\nOperating Current portion of operating lease liability $ 15 $ 20\nFinance Current portion of finance lease liability 75 55\nNon current\nOperating Operating lease liability 28 38\nFinance Finance lease liability 70 75\nTotal lease liabilities $ 188 $ 188\nWeighted-average remaining lease term\nOperating leases 3.35 years 3.49 years\nFinance leases 2.03 years 2.44 years\nWeighted-average discount rate\nOperating leases(1)\n5.00 % 5.00 %\nFinance leases 4.33 % 4.58 %\n(1) Upon adoption of the new lease standard, discount rates used for existing leases were established based on the Company's incremental borrowing rate at January 1, 2019. For new leases entered after January 1, 2019, the discount rate was determined based on the Company's incremental borrowing rate at lease commencement.\nLessee Costs\nThe table below presents certain information related to the lease costs for finance and operating leases recognized in the Company's consolidated statements of income (loss) for the years ended December 31:\nIn millions 2020 2019\nFinance lease cost\nDepreciation of leased assets $ 55 $ 25\nInterest of lease liabilities 6 4\nOperating lease cost 24 31\nSub-lease income from real estate properties owned and leased (6) (6)\nTotal lease cost $ 79 $ 54\nOther Information\nThe table below presents supplemental cash flow information related to cash paid for amounts included in the measurement of lease liabilities for the year ended December 31:\nIn millions 2020 2019\nOperating cash flows for operating leases $ 23 $ 22\nOperating cash flows for finance leases $ 6 $ 4\nFinancing cash flows for finance leases $ 70 $ 33\nUndiscounted Cash Flows\nThe table below reconciles the undiscounted cash flows for each of the first five years and total of the remaining years to the finance lease liabilities and operating lease liabilities recorded on the balance sheet at December 31, 2020:\nIn millions Operating Leases Finance Leases\n2021 $ 19 $ 80\n2022 14 56\n2023 9 17\n2024 5 -\n2025 3 -\nThereafter 1 -\nTotal minimum lease payments 51 153\nLess: amount of lease payments representing interest (8) (8)\nPresent value of future minimum lease payments 43 145\nLess: current obligations under leases (15) (75)\nLong-term lease obligations $ 28 $ 70\nThe table below provides the undiscounted cash flows for the Company's finance lease liabilities and operating lease obligations as of December 31, 2019.\nIn millions Operating Leases Finance Leases\n2020 $ 24 $ 60\n2021 16 54\n2022 12 23\n2023 7 -\n2024 4 -\nThereafter 2 -\nTotal minimum lease payments 65 137\nLess: amount of lease payments representing interest (7) (7)\nPresent value of future minimum lease payments 58 130\nLess: current obligations under leases (20) (55)\nLong-term lease obligations $ 38 $ 75\nLessor\nThe Company receives rental revenue for leasing hardware offerings to its customers. For our hardware rental offering, the Company owns or leases the hardware and may or may not provide managed services. Leases sometimes include options to renew but typically do not include lessee purchase options. The revenue for these operating leases is generally recognized straight-line over the term of the contract and is included within the recurring revenue caption on the consolidated statements of income (loss). Equipment used for this revenue is reported within Property and equipment, net on the consolidated balance sheet.\nThe following table includes rental revenue for the years ended December 31:\nIn millions 2020 2019 2018\nRental revenue* $ 100 $ 76 $ 32\n*Rental revenue includes hardware maintenance.\nThe following table includes estimated rental revenue expected to be recognized in the future based on executed contracts at December 31, 2020:\nIn millions Rental Revenue\n2021 $ 151\n2022 118\n2023-24 73\nTotal $ 342\nNote 14 Segment, Other Supplemental Information and Concentrations\nTeradata now manages its business under three geographic regions, which are also the Company’s operating segments: (1) Americas region (North America and Latin America); (2) EMEA region (Europe, Middle East and Africa) and (3) APJ region (Asia Pacific and Japan). For purposes of discussing results by segment, management excludes the impact of certain items, consistent with the manner by which management evaluates the performance of each segment. This format is useful to investors because it allows analysis and comparability of operating trends. It also includes the same information that is used by Teradata management to make decisions regarding the segments and to assess financial performance. The chief operating decision maker, who is our President and Chief Executive Officer, evaluates the performance of the segments based on revenue and multiple profit measures, including segment gross profit. For management reporting purposes assets are not allocated to the segments. Prior periods have been restated to conform to the current year presentation.\nThe following table presents segment revenue and segment gross profit for the Company for the years ended December 31:\nIn millions 2020 2019 2018\nSegment revenue\nAmericas $ 1,025 $ 1,057 $ 1,126\nEMEA 485 492 587\nAPJ 326 350 451\nTotal revenue 1,836 1,899 2,164\nSegment gross profit\nAmericas 631 626 621\nEMEA 273 239 275\nAPJ 168 148 199\nTotal segment gross profit 1,072 1,013 1,095\nStock-based compensation expense 16 14 15\nAcquisition, integration and reorganization-related costs 14 11 5\nAmortization of capitalized software costs 23 33 49\nTotal gross profit 1,019 955 1,026\nSelling, general and administrative expenses 669 618 666\nResearch and development expenses 334 327 317\nTotal income from operations $ 16 $ 10 $ 43\nCertain items, including amortization of certain capitalized software costs, were excluded from segment gross profit to conform to the way the Company manages and reviews the results by segment.\nThe following table presents revenues by geographic area for the years ended December 31:\nIn millions 2020 2019 2018\nUnited States $ 921 $ 953 $ 1,018\nAmericas (excluding United States) 104 104 108\nEMEA 485 492 587\nAPJ 326 350 451\nTotal revenue $ 1,836 $ 1,899 $ 2,164\nThe following table presents property and equipment, net by geographic area at December 31:\nIn millions 2020 2019\nUnited States $ 248 $ 261\nAmericas (excluding United States) 18 19\nEMEA 43 36\nAPJ 30 34\nProperty and equipment, net $ 339 $ 350\nConcentrations. No single customer accounts for more than 10% of the Company's revenue. As of December 31, 2020, the Company is not aware of any significant concentration of business transacted with a particular customer that could, if suddenly eliminated, have a material adverse effect on the Company’s operations. The Company's hardware components are assembled exclusively by Flex. In addition, the Company utilizes preferred supplier relationships to better ensure more consistent quality, cost, and delivery. There can be no assurances that a disruption in production at Flex or at a supplier would not have a material adverse effect on the Company's operations. In addition, a significant change in the forecasts to any of these preferred suppliers could result in purchase obligations or components that may be in excess of demand.\nNote 15 Accumulated Other Comprehensive (Loss) Income\nThe following table provides information on changes in accumulated other comprehensive (loss) income, net of tax (\"AOCI\"), for the years ended December 31:\nIn millions Derivatives Defined\nbenefit\nplans Foreign\ncurrency\ntranslation\nadjustments Total\nAOCI\nBalance as of December 31, 2017 $ - $ (36) $ (38) $ (74)\nOther comprehensive loss before reclassifications (6) (13) (13) (32)\nAmounts reclassified from AOCI - 5 - 5\nNet other comprehensive loss (6) (8) (13) (27)\nBalance as of December 31, 2018 $ (6) $ (44) $ (51) $ (101)\nOther comprehensive loss before reclassifications (9) (27) (10) (46)\nAmounts reclassified from AOCI - 6 - 6\nNet other comprehensive loss (9) (21) (10) (40)\nBalance as of December 31, 2019 $ (15) $ (65) $ (61) $ (141)\nOther comprehensive (loss) income before reclassifications (6) (12) 7 (11)\nAmounts reclassified from AOCI - 9 - 9\nNet other comprehensive (loss) income (6) (3) 7 (2)\nBalance as of December 31, 2020 $ (21) $ (68) $ (54) $ (143)\nThe following table presents the impact and respective location of AOCI reclassifications in the Consolidated Statements of Income for the years ended December 31:\nIn millions\nAOCI Component Location 2020 2019 2018\nOther Expense Other Expense (10) (7) (6)\nTax portion Income tax benefit 1 1 1\nTotal reclassifications Net (loss) income $ (9) $ (6) $ (5)\nFurther information on the Company’s defined benefit plans is included in Note 8.\nNote 16 Reorganization and Business Transformation\n2018 Plan\nIn June 2018, the Company approved a plan to consolidate certain of its operations, including transitioning its corporate headquarters to San Diego, California from its location in Dayton, Ohio. This plan, which was being executed in connection with Teradata’s comprehensive business transformation, better aligned the Company’s skills and resources to effectively pursue opportunities in the marketplace. The Company recognized costs of $23 million in 2018, $14 million in 2019 and $1 million in 2020 for employee separation benefits, transition support, facilities lease related costs, outside service, legal and other exit-related costs. The employee separation benefit costs were expensed over the time period that the employees had to work to earn them. All actions were completed as of December 31, 2020 and the Company incurred costs and charges of approximately $38 million related to the plan. The majority of the costs were attributable to the Americas reporting unit and recorded as selling, general and administrative expenses with no impact on our segment gross profit. Cash paid related to this plan was $11 million in 2018, $19 million in 2019 and $2 million in 2020. Included in the total costs of $38 million for the plan are non cash expenses of $6 million for accelerated amortization recorded in 2019 for right-of-use assets associated with the lease on its prior corporate headquarters. The remaining lease liability is included in our operating lease obligations as of December 31, 2019 and 2020.\n2020 Plan\nIn September 2020, the Company offered a voluntary separation program (\"VSP\") to certain tenured employees. This global program was generally made available to active employees in good standing who (1) were at least 55 years old as of October 1, 2020 and (2) had at least ten years of service with Teradata. This program was implemented as part of the Company's efforts to improve its cost structure. On November 2, 2020, the Company approved a plan to realign and reduce its workforce and rationalize its real estate footprint. The workforce measures involve involuntary headcount reduction actions. These actions are separate from the VSP. The rationalization of the Company’s real estate footprint involves terminating leases relating to certain of the Company’s offices globally and transitioning impacted employees to a permanent virtual working environment, co-working space or a smaller facility, depending on business need. The Company is continuing to evaluate and implement additional measures that would be expected to result in further cost savings.\nThe Company expects that the costs relating to these workforce reduction and real estate rationalization measures will include one-time employee separation benefits, transition support, outside services and other exit-related costs. The Company expects that it will incur total costs and charges related to these actions in the range of approximately $55 to $65 million, consisting primarily of the following:\n•$12 to $14 million for employee severance and other employee-related costs, which is separate from the $30 to $33 million for costs related to the Voluntary Separation Program,\n•$5 to $6 million charge for facilities lease related costs, and\n•$8 to $12 million for outside service, legal and other associated costs.\nThe Company incurred $42 million of these costs and charges in 2020 with the remaining costs and charges expected to be incurred in 2021 upon completion of these actions. Cash expenditures related to these actions are estimated at approximately $65 to $75 million. Approximately $14 to $18 million of the cash expenditures relate to cash payments to international employees and will not have a material impact on the Consolidated Statements of Income (Loss) due to the Company accounting for its International postemployment benefits under Accounting\nStandards Codification 712, Compensation - Nonretirement Postemployment Benefits (\"ASC 712\"), which uses actuarial estimates and defers the immediate recognition of gains or losses.\nThe Company recognized costs of $42 million ($38 million cash and $4 million non-cash) in 2020 for the VSP, employee separation benefits, facilities lease related costs, outside service, legal and other associated costs. Certain benefits are being expensed over the time period that the employees have to work to earn them to the extent the required service period extends beyond the nominal period. $10 million of these costs were recorded to Costs of revenue, $25 million were recorded to Selling, general and administrative expenses and $7 million were recorded to Research and development expenses. There was no impact to the segment gross profit.\nCash paid related to the plan listed above was $23 million in 2020. Not included in the table below are approximately $2 million of cash payments for international employees which will not have a material impact on the Consolidated Statements of Income (Loss) as noted above, as well as another $1 million payments made for outside services to be completed in early 2021. These advance payments have not yet been recognized as expense for the year ended December 31, 2020.\nThe 2020 activity and the reserves related to the 2020 plan are as follows:\nIn millions Expense accruals Cash payments Balance at\nDecember 31, 2020\nVSP $ 23 $ (7) $ 16\nEmployee severance and other employee-related costs 9 (7) 2\nFacilities lease related costs, outside service, legal and other associated costs 6 (6) -\nTotal $ 38 $ (20) $ 18\nIn addition, the Company incurred non-cash costs not reflected in the table above of $2 million in stock-based compensation for accelerated vesting tied to the VSP and $2 million for accelerated amortization of right-of-use assets and fixed assets in 2020 associated with the termination of leases relating to certain of the Company’s offices globally. The remaining lease liability is included in our operating lease obligations as of December 31, 2020 and is not included in the table above.",
    "item_9": "Item 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.",
    "item_9A": "Item 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nTeradata maintains a system of disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) of the Securities Exchange Act of 1934 (the \"Exchange Act\")) that are designed to provide reasonable assurance that information required to be disclosed in its reports filed or submitted under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the SEC’s rules and forms, and that such information is accumulated and communicated to management, including, as appropriate, the chief executive officer and the chief financial officer, to allow timely decisions regarding required disclosures. In designing and evaluating the disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives.\nBased on their evaluation, our Chief Executive Officer and Chief Financial Officer have concluded that our disclosure controls and procedures were effective to provide reasonable assurance as of December 31, 2020.\nManagement’s Annual Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as such term is defined in Rule 13a-15(f) under the Exchange Act. Teradata’s internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree or compliance with the policies or procedures may deteriorate.\nManagement assessed the effectiveness of Teradata’s internal control over financial reporting as of the end of the period covered by this report. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (\"COSO\") in Internal Control - Integrated Framework (2013). Based on our assessment and those criteria, management concluded that Teradata’s internal control over financial reporting was effective as of December 31, 2020.\nTeradata’s independent registered public accounting firm has issued their report on the effectiveness of Teradata’s internal control over financial reporting as of December 31, 2020, which appears in this Annual Report.\nChanges in Internal Control over Financial Reporting\nThere have been no changes in our internal control over financial reporting that occurred during the last fiscal quarter ended December 31, 2020 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.",
    "item_9B": "Item 9B. OTHER INFORMATION\nNone.\nPART III",
    "item_10": "Item 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nInformation required to be included in Part III Item 10 is set forth under the captions \"Election of Directors\" and \"Additional Information Concerning the Board of Directors\" in Teradata’s Notice of Annual Meeting of Stockholders and Proxy Statement to be filed with the SEC within 120 days after the end of our fiscal 2020 year (the \"2021 Proxy Statement\") and is incorporated herein by reference. The information under the heading \"Executive Officers of the Registrant\" in Part I Item 1 of this Annual Report on Form 10-K is also incorporated by reference in this section.",
    "item_11": "Item 11. EXECUTIVE COMPENSATION\nInformation required to be included in Part III Item 11 is set forth under the captions \"Director Compensation,\" \"Compensation Discussion and Analysis,\" \"Compensation Tables,\" \"Potential Payments Upon Termination or Change in Control,\" \"Compensation and Human Resource Committee\" and \"Board Compensation and Human\nResource Committee Report on Executive Compensation\" in Teradata’s 2021 Proxy Statement and incorporated herein by reference.",
    "item_12": "Item 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nInformation required to be included in Part III Item 12 is set forth under the caption “Stock Ownership” and the caption “Current Equity Compensation Plan Information” under Item 3 of Teradata’s 2021 Proxy Statement and incorporated herein by reference.",
    "item_13": "Item 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nInformation required to be included in Part III Item 13 is set forth under the captions \"Related Person Transactions\" and \"Board Independence and Related Transactions\" in Teradata’s 2021 Proxy Statement and incorporated herein by reference.",
    "item_14": "Item 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nInformation required to be included in Part III Item 14 is set forth under the caption \"Fees Paid to Independent Registered Public Accounting Firm\" in Teradata’s 2021 Proxy Statement and incorporated herein by reference.\nPART IV",
    "item_15": "Item 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(a)Index\n1. Financial Statements: The consolidated financial statements of the Company and the Report of Independent Registered Public Accounting Firm as set forth in Part II, Item 8 of this Annual Report:\nReport of Independent Registered Public Accounting Firm\nConsolidated Statements of Income (Loss) for the years ended December 31, 2020, 2019 and 2018\nConsolidated Statements of Consolidated Statements of Comprehensive Income (Loss) for the years ended December 31, 2020, 2019 and 2018 (Loss) Income for the years ended December 31, 2020, 2019 and 2018\nConsolidated Balance Sheets at December 31, 2020 and 2019\nConsolidated Statements of Cash Flows for the years ended December 31, 2020 2019 and 2018\nConsolidated Statements of Changes in Stockholders’ Equity for the years ended December 31, 2020, 2019 and 2018\nNotes to Consolidated Financial Statements\n2. Financial Statement Schedule: Financial Statement Schedule II - Valuation and Qualifying Accounts is included in this Annual Report on page 87. All other schedules are not required under the related instructions or are not applicable.\nExhibits: See Index of Exhibits below for a listing of all exhibits to this Annual Report.\n(b) Exhibits identified in parentheses below, on file with the SEC, are incorporated herein by reference as exhibits hereto.\nReference\nNumber per Item\n601 of\nRegulation S-K Description\n2.1\nForm of Separation and Distribution Agreement between Teradata Corporation and NCR Corporation (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K dated September 11, 2007 (SEC file number 001-33458)).\n3.1\nAmended and Restated Certificate of Incorporation of Teradata Corporation as amended and restated on September 24, 2007 (incorporated by reference to Exhibit 3.1 to the Current Report on Form 8-K dated September 25, 2007 (SEC file number 001-33458)).\n3.2\nAmended and Restated By-Laws of Teradata Corporation, as amended and restated on July 26, 2016 (incorporated by reference to Exhibit 3.1 to the Current Report on Form 8-K dated August 1, 2016).\n4.1\nCommon Stock Certificate of Teradata Corporation (incorporated by reference to Exhibit 4.1 to the Quarterly Report on Form 10-Q dated November 13, 2007 (SEC file number 001-33458)).\n4.2\nDescription of the Registrant’s Securities (incorporated by reference to Exhibit 4.2 to the Annual Report on Form 10-K dated February 28, 2020).\n10.1\nForm of Technology Agreement (incorporated by reference to Exhibit 10.6 to the Registration Statement on Form 10).\n10.2*\nTeradata Corporation Employee Stock Purchase Plan, as amended and restated on January 30, 2012 (incorporated by reference to Exhibit 10.4 to the Quarterly Report on Form 10-Q dated August 6, 2018).\n10.3*\nTeradata Management Incentive Plan, as amended and restated on February 20, 2018 (incorporated by reference to Exhibit 10.3 to the Annual Report on Form 10-K dated February 23, 2018).\n10.4*\nTeradata Change in Control Severance Plan, as amended and restated on July 18, 2018 (incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q dated November 5, 2018).\n10.5*\nTeradata Executive Severance Plan, effective as of February 1, 2017 (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K dated February 3, 2017).\n10.6*\nAmended and Restated Teradata Corporation 2007 Stock Incentive Plan, dated February 3, 2009 (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K dated February 9, 2009 (SEC file number 001-33458)).\n10.6.1*\nForm of Stock Option Agreement Under the Teradata Corporation 2007 Stock Incentive Plan, approved on November 29, 2010 and November 28, 2011 (incorporated by reference to Exhibit 10.11.10 to the Annual Report on Form 10-K dated March 1, 2011).\n10.6.2*\nForm of 2008 Director Option Grant Statement under the Teradata Corporation 2007 Stock Incentive Plan (incorporated by reference to Exhibit 10.5 to the Quarterly Report on Form 10-Q dated May 15, 2008 (SEC file number 001-33458)).\n10.6.3*\nTeradata Corporation Director Compensation Program, as amended and restated and effective on April 17, 2018 (incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q dated August 6, 2018 (SEC file number 001-33458)).\n10.7*\nTeradata 2012 Stock Incentive Plan (Amended and Restated as of March 1, 2019) (incorporated by reference from the Proxy Statement of Teradata Corporation filed with the SEC on March 13, 2016).\n10.7.1*\nForm of Stock Option Agreement Under the Teradata 2012 Stock Incentive Plan, approved on April 19, 2012 (incorporated by reference to Exhibit 10.2 to the Current Report on Form 8-K dated April 26, 2012).\n10.7.2*\nForm of Stock Option Agreement Under the Teradata 2012 Stock Incentive Plan, approved on December 2, 2013 (incorporated by reference to Exhibit 10.9.6 to the Annual Report on Form 10-K dated February 27, 2014).\n10.7.3*\nForm of Stock Option Agreement For Non-U.S. Employees Under the Teradata 2012 Stock Incentive Plan, approved on December 2, 2013 (incorporated by reference to Exhibit 10.9.7 to the Annual Report on Form 10-K dated February 27, 2014).\n10.7.4*\nForm of Stock Option Agreement Under the Teradata 2012 Stock Incentive Plan, approved on December 1, 2014 (incorporated by reference to Exhibit 10.9.11 to the Annual Report on Form 10-K dated February 27, 2015).\n10.7.5*\nForm of Stock Option Agreement For Non-U.S. Employees Under the Teradata 2012 Stock Incentive Plan, approved on December 1, 2014 (incorporated by reference to Exhibit 10.9.12 to the Annual Report on Form 10-K dated February 27, 2015).\n10.7.6*\nForm of Stock Option Agreement Under the Teradata 2012 Stock Incentive Plan, approved on December 1, 2015 (incorporated by reference to Exhibit 10.9.16 to the Annual Report on Form 10-K dated February 26, 2016).\n10.7.7*\nForm of Stock Option Agreement For Non-U.S. Employees Under the Teradata 2012 Stock Incentive Plan, approved on December 1, 2015 (incorporated by reference to Exhibit 10.9.17 to the Annual Report on Form 10-K dated February 26, 2016).\n10.7.8*\nForm of Director Restricted Share Unit Grant Statement under the Teradata 2012 Stock Incentive Plan, approved on April 26, 2016 (incorporated by reference to Exhibit 10.2 to the Current Report on Form 8-K dated April 29, 2016).\n10.7.9*\nForm of Stock Option Agreement Under the Teradata 2012 Stock Incentive Plan, approved on November 28, 2016 (incorporated by reference to Exhibit 10.10.23 to the Annual Report on Form 10-K dated February 27, 2017).\n10.7.10*\nForm of Stock Option Agreement For Non-U.S. Employees Under the Teradata 2012 Stock Incentive Plan, approved on November 28, 2016 (incorporated by reference to Exhibit 10.10.24 to the Annual Report on Form 10-K dated February 27, 2017).\n10.7.11*\nForm of Restricted Share Unit Agreements Under the Teradata 2012 Stock Incentive Plan, approved on November 28, 2016 (incorporated by reference to Exhibit 10.10.25 to the Annual Report on Form 10-K dated February 27, 2017).\n10.7.12*\nForm of Restricted Share Unit Agreements For Non-U.S. Employees Under the Teradata 2012 Stock Incentive Plan, approved on November 28, 2016 (incorporated by reference to Exhibit 10.10.26 to the Annual Report on Form 10-K dated February 27, 2017).\n10.7.13*\nForm of Performance-Based Restricted Share Unit Agreement Under the Teradata 2012 Stock Incentive Plan, approved on November 28, 2016 (incorporated by reference to Exhibit 10.10.27 to the Annual Report on Form 10-K dated February 27, 2017).\n10.7.14*\nForm of CEO Performance-Based Restricted Share Unit Agreement Under the Teradata 2012 Stock Incentive Plan (2017 Performance Period Award), approved on November 28, 2016 (incorporated by reference to Exhibit 10.10.29 to the Annual Report on Form 10-K dated February 27, 2017).\n10.7.15*\nForm of Restricted Share Unit Agreement Under the Teradata 2012 Stock Incentive Plan, approved on April 18, 2017 (incorporated by reference to Exhibit 10.2 to the Quarterly Report on Form 10-Q dated August 4, 2017).\n10.7.16*\nForms of Restricted Share Unit Agreements Under the Teradata 2012 Stock Incentive Plan, approved on November 27, 2017 (incorporated by reference to Exhibit 10.8.25 to the Annual Report on Form 10-K dated February 23, 2018).\n10.7.17*\nForms of Restricted Share Unit Agreements For Non-U.S. Employees Under the Teradata 2012 Stock Incentive Plan, approved on November 27, 2017 (incorporated by reference to Exhibit 10.8.26 to the Annual Report on Form 10-K dated February 23, 2018).\n10.7.18*\nForm of Performance-Based Restricted Share Unit Agreement Under the Teradata 2012 Stock Incentive Plan, approved on November 27, 2017 (incorporated by reference to Exhibit 10.8.27 to the Annual Report on Form 10-K dated February 23, 2018).\n10.7.19*\nForm of Special Retention Restricted Share Unit Agreement Under the Teradata 2012 Stock Incentive Plan, approved on November 27, 2017 (incorporated by reference to Exhibit 10.8.28 to the Annual Report on Form 10-K dated February 23, 2018).\n10.7.20*\nForm of Restricted Share Unit Agreement Under the Teradata 2012 Stock Incentive Plan, approved on February 4, 2019 (incorporated by reference to Exhibit 10.8.29 to the Annual Report, as amended, on Form 10-K/A dated March 1, 2019).\n10.7.21*\nForm of Restricted Share Unit Agreement For Non-U.S. Employees Under the Teradata 2012 Stock Incentive Plan, approved on February 4, 2019 (incorporated by reference to Exhibit 10.8.30 to the Annual Report, as amended, on Form 10-K/A dated March 1, 2019).\n10.7.22*\nForm of Performance-Based Restricted Share Unit Agreement Under the Teradata 2012 Stock Incentive Plan, approved on February 4, 2019 (incorporated by reference to Exhibit 10.8.31 to the Annual Report, as amended, on Form 10-K/A dated March 1, 2019).\n10.7.23*\nForm of Restricted Share Unit Agreement (Interim CEO Grant with Graded Vesting) Under the Teradata 2012 Stock Incentive Plan, approved on November 15, 2019.\n10.7.24*\nForm of Restricted Share Unit Agreement Under the Teradata 2012 Stock Incentive Plan, approved on February 27, 2020 (incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q dated May 11, 2020).\n10.7.25*\nForm of Restricted Share Unit Agreement for Non-U.S. Employees Under the Teradata 2012 Stock Incentive Plan, approved on February 27, 2020 (incorporated by reference to Exhibit 10.2 to the Quarterly Report on Form 10-Q dated May 11, 2020).\n10.7.26*\nForm of Performance-Based Restricted Share Unit Agreement Under the Teradata 2012 Stock Incentive Plan, approved on February 27, 2020 (incorporated by reference to Exhibit 10.3 to the Quarterly Report on Form 10-Q dated May 11, 2020).\n10.7.27*\nForm of Restricted Share Unit Agreement for Non-U.S. Employees Under the Teradata 2012 Stock Incentive Plan, approved on February 27, 2020 (incorporated by reference to Exhibit 10.4 to the Quarterly Report on Form 10-Q dated May 11, 2020).\n10.8\nPurchase and Manufacturing Services Agreement, effective April 27, 1998, by and between NCR Corporation and Solectron Corporation, now known as Flex Ltd. (filed as Exhibit 10.1 to NCR Corporation’s Form 10-Q (SEC File No. 001-00395) for the fiscal quarter ended June 30, 1998 and incorporated herein by reference).\n10.8.1\nAmendment No. 1 to Purchase and Manufacturing Services Agreement, dated January 29, 2000, between NCR Corporation and Solectron Corporation, now known as Flex Ltd. (incorporated by reference to Exhibit 10.22 to the Registration Statement on Form 10).\n10.9*\nOffer Letter from Teradata Corporation to Daniel Harrington dated September 20, 2007 (incorporated by reference to Exhibit 10.3 to the Current Report on Form 8-K dated February 9, 2009 (SEC file number 001-33458)).\n10.9.1*\nAmendment to the Offer Letter from Teradata Corporation to Daniel Harrington effective December 31, 2008 (incorporated by reference to Exhibit 10.6 to the Current Report on Form 8-K dated February 9, 2009 (SEC file number 001-33458)).\n10.10*\nOffer letter from Teradata Corporation to Oliver Ratzesberger dated June 11, 2013 (incorporated by reference to Exhibit 10.22 to the Annual Report on Form 10-K dated February 27, 2017).\n10.11*\nAmended offer letter from Teradata Corporation to Mark Culhane dated October 31, 2017 and February 20, 2018 (incorporated by reference to Exhibit 10.16 to the Annual Report on Form 10-K dated February 23, 2018)\n10.12*\nOffer letter from Teradata Corporation to Martyn Etherington dated February 9, 2018 (incorporated by reference to Exhibit 10.16 to the Annual Report, as amended, on Form 10-K/A dated March 1, 2019).\n10.13*\nOffer letter between Scott A. Brown and the Company dated May 31, 2019 (incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q dated August 5, 2019).\n10.14*\nOffer letter between Kathy Cullen-Cote and the Company dated June 21, 2019 (incorporated by reference to Exhibit 10.2 to the Quarterly Report on Form 10-Q dated August 5, 2019).\n10.15*\nOffer letter from Teradata Corporation to Stephen McMillan dated May 5, 2020 (incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q dated August 10, 2020).\n10.15.1*\nForm of Restricted Share Unit Agreement (New Hire Grant) Inducement Grant to new CEO, approved on May 5, 2020 (incorporated by reference to Exhibit 4.6 to the Registration Statement on Form S-8 dated June 2, 2020 (SEC file number 001-33458)).\n10.15.2*\nRestricted Share Unit Agreement (Graded Vesting) Inducement Grant to new CEO, approved on May 5, 2020 (incorporated by reference to Exhibit 4.7 to the Registration Statement on Form S-8 dated June 2, 2020 (SEC file number 001-33458)).\n10.15.3*\nPerformance-Based Restricted Share Unit Agreement (2020-2022 Performance Period Award) Inducement Grant to new CEO, approved on May 5, 2020 (incorporated by reference to Exhibit 4.5 to the Registration Statement on Form S-8 dated June 2, 2020 (SEC file number 001-33458)).\n10.15.4*\nExecutive Severance Plan Participation Agreement to new CEO, approved on May 5, 2020 (incorporated by reference to Exhibit 10.5 to the Quarterly Report on Form 10-Q dated August 10, 2020).\n10.16*\nConsulting Services Agreement between Teradata Corporation and Victor L. Lund, effective June 8, 2020 (incorporated by reference to Exhibit 10.6 to the Quarterly Report on Form 10-Q dated August 10, 2020).\n10.17*\nOffer Letter from Teradata Corporation to Hillary Ashton dated August 31, 2020 (incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q dated November 6, 2020).\n10.18*\nOffer letter from Teradata Corporation to Margaret Treese dated September 28, 2020.\n10.19*\nTeradata Incentive Stock Purchase Plan (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K dated June 2, 2020 (SEC file number 001-33458)).\n10.20*\nForm of Teradata Incentive Stock Purchase Plan Stock Purchase Agreement (incorporated by reference to Exhibit 10.2 to the Current Report on Form 8-K dated June 2, 2020 (SEC file number 001-33458)).\n10.21*\nTeradata New Employee Stock Inducement Plan (incorporated by reference to Exhibit 10.3 to the Current Report on Form 8-K dated June 2, 2020 (SEC file number 001-33458)).\n10.22*\nConfidential Separation and General Release Agreement between Laura Nyquist and Teradata Corporation dated November 13, 2020\n10.22.1*\nAmendment dated November 13, 2020 to Supplemental Offer Letter from Teradata Corporation to Laura Nyquist dated June 6, 2018.\n10.22.2*\nSupplemental Offer Letter from Teradata Corporation to Laura Nyquist dated June 6, 2018 (incorporated by reference to Exhibit 10.17 to the Annual Report, as amended, on Form 10-K/A dated March 1, 2019).\n10.23*\nOffer Letter from Teradata Corporation to Todd Cione dated December 4, 2020\n10.24\nRevolving Credit Agreement dated as of June 11, 2018 among Teradata Corporation, Bank of America, N.A., as Administrative Agent, JPMorgan Chase Bank, N.A., as Syndication Agent, Citibank, N.A., MUFG Bank, LTD., U.S. Bank National Association, and Wells Fargo Bank, National Association, as Co-Documentation Agents, and the other lenders party thereto (incorporated by reference to Exhibit 1.1 to the Current Report on Form 8-K dated June 13, 2018).\n10.25\nTerm Loan Agreement dated as of June 11, 2018 among Teradata Corporation, JPMorgan Chase Bank, N.A., as Administrative Agent, Bank of America, N.A., as Syndication Agent, Citibank, N.A., MUFG Bank, LTD., U.S. Bank National Association, and Wells Fargo Bank, National Association, as Co-Documentation Agents, and the other lenders party thereto (incorporated by reference to Exhibit 1.2 to the Current Report on Form 8-K dated June 13, 2018).\n10.26\nAsset Purchase Agreement, by and between Teradata Corporation and TMA Solutions, L.P., dated as of April 22, 2016 (incorporated by reference to Exhibit 2.1 to the Current Report on Form 8-K dated April 25, 2016).**\nSubsidiaries of Teradata Corporation.\n23.1\nConsent of Independent Registered Public Accounting Firm.\n31.1\nCertification pursuant to Rule 13a-14(a) dated February 26, 2021.\n31.2\nCertification pursuant to Rule 13a-14(a) dated February 26, 2021.\nCertification pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 dated February 26, 2021.\n101 Inline interactive data files pursuant to Rule 405 of Regulation S-T: (i) the Consolidated Statement of Income (Loss) for the twelve month periods ended December 31, 2020, 2019 and 2019, (ii) the Consolidated Statement of Comprehensive Income (Loss) for the twelve month periods ended December 31, 2020, 2019 and 2018, (iii) the Consolidated Balance Sheets at December 31, 2020 and 2019, (iv) the Consolidated Statement of Cash Flows for the twelve month periods ended December 31, 2020, 2019 and 2018, (v) the Consolidated Statement of Changes in Stockholders’ Equity for the twelve month periods ended December 31, 2020, 2019 and 2018, (vi) Financial Statement Schedule II, and (vii) the notes to the Consolidated Financial Statements.\n104 Cover page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n* Management contracts or compensatory plans, contracts or arrangements.\n** Schedules have been omitted pursuant to Item 601(a)(5) of Regulation S-K. The Company hereby undertakes to furnish supplemental copies of any of the omitted schedules upon request by the U.S. Securities and Exchange Commission.\nTERADATA CORPORATION\nSCHEDULE II-VALUATION AND QUALIFYING ACCOUNTS\n(In millions)\nColumn A Column B Column C Column D Column E\nDescription Balance at\nBeginning\nof Period Provision/reversals\nCharged\nto Costs &\nExpenses Charged\nto Other\nAccounts Deductions Balance\nat End of\nPeriod\nAllowance for doubtful accounts\nYear ended December 31, 2020 $ 18 $ (3) $ - $ - $ 15\nYear ended December 31, 2019 $ 14 $ 4 $ - $ - $ 18\nYear ended December 31, 2018 $ 12 $ 2 $ - $ - $ 14\nDeferred tax valuation allowance\nYear ended December 31, 2020 $ 45 $ 6 $ - $ - $ 51\nYear ended December 31, 2019 $ 39 $ 6 $ - $ - $ 45\nYear ended December 31, 2018 $ 32 $ 7 $ - $ - $ 39\nItem 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15 (d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nTERADATA CORPORATION\nDate: February 26, 2021 By: /s/ Mark A. Culhane\nMark A. Culhane\nChief Financial Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the date indicated.\nSignature Title\n/s/ Stephen McMillan\nPresident and Chief Executive Officer\nStephen McMillan\n/s/ Mark A. Culhane\nChief Financial Officer\nMark A. Culhane\n(Principal Financial and Accounting Officer)\n/s/ Michael P. Gianoni\nChairman of the board\nMichael P. Gianoni\n/s/ Lisa R. Bacus\nDirector\nLisa R. Bacus\n/s/ Timothy C.K. Chou\nDirector\nTimothy C.K. Chou\n/s/ Daniel R. Fishback\nDirector\nDaniel R. Fishback\n/s/ Cary T. Fu\nDirector\nCary T. Fu\n/s/ David E. Kepler\nDirector\nDavid E. Kepler\n/s/ Kimberly K. Nelson\nDirector\nKimberly K. Nelson\n/s/ Joanne B. Olsen\nDirector\nJoanne Olsen\n/s/ James M. Ringler\nDirector\nJames M. Ringler\n/s/ John G. Schwarz\nDirector\nJohn G. Schwarz"
}