{
    "cik": "823546",
    "company": "ROCKETFUEL BLOCKCHAIN, INC.",
    "filing_type": "10-K",
    "filing_date": "2021-07-22",
    "period_of_report": "2021-03-31",
    "sic": "7372",
    "state_of_inc": "NV",
    "state_location": "NV",
    "fiscal_year_end": "0331",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/823546/0001493152-21-017524-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/823546/000149315221017524/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/823546/0001493152-21-017524.txt",
    "filename": "823546_10K_2021_0001493152-21-017524.htm",
    "item_1": "Item 1. Business\nCautionary Note Regarding Forward Looking Statements\nThis Annual Report on Form 10-K (the “report”) contains forward-looking statements in the sections captioned “Description of Business,” “Risk Factors,” “Management’s Discussion and Analysis of Financial Condition and Plan of Operations” and elsewhere. Any and all statements contained in this Report that are not statements of historical fact may be deemed forward-looking statements. Terms such as “may,” “might,” “would,” “should,” “could,” “project,” “estimate,” “pro-forma,” “predict,” “potential,” “strategy,” “anticipate,” “attempt,” “develop,” “plan,” “help,” “believe,” “continue,” “intend,” “expect,” “future,” and terms of similar import (including the negative of any of these terms) may identify forward-looking statements. However, not all forward-looking statements may contain one or more of these identifying terms. Forward-looking statements in this Report may include, without limitation, statements regarding the plans and objectives of management for future operations, projections of income or loss, earnings or loss per share, capital expenditures, dividends, capital structure or other financial items, our future financial performance, including any such statement contained in a discussion and analysis of financial condition by management or in the results of operations included pursuant to the rules and regulations of the Securities and Exchange Commission (“SEC”), and the assumptions underlying or relating to any such statement.\nThe forward-looking statements are not meant to predict or guarantee actual results, performance, events or circumstances and may not be realized because they are based upon our current projections, plans, objectives, beliefs, expectations, estimates and assumptions and are subject to a number of risks and uncertainties and other influences, many of which we have no control over. Actual results and the timing of certain events and circumstances may differ materially from those described by the forward-looking statements as a result of these risks and uncertainties. Factors that may influence or contribute to the accuracy of the forward-looking statements or cause actual results to differ materially from expected or desired results may include, without limitation:\n● Market acceptance of our products and services;\n● Competition from existing products or new products that may emerge;\n● The implementation of our business model and strategic plans for our business and our products;\n● Estimates of our future revenue, expenses, capital requirements and our need for financing;\n● Our financial performance;\n● Current and future government regulations;\n● Developments relating to our competitors; and\n● Other risks and uncertainties, including those listed under the section titled “Risk Factors.”\nReaders are cautioned not to place undue reliance on forward-looking statements because of the risks and uncertainties related to them and to the risk factors. We disclaim any obligation to update the forward-looking statements contained in this report to reflect any new information or future events or circumstances or otherwise, except as required by law. Readers should read this report in conjunction with the discussion under the caption “Risk Factors,” our financial statements and the related notes thereto in this report, and other documents which we may file from time to time with the SEC.\nOur Corporate History\nOn June 27, 2018 (the “Closing Date”), RocketFuel Blockchain Company (“RBC”) and B4MC Gold Mines, Inc., a Nevada Corporation (“B4MC” or the “Purchaser”), consummated the transactions contemplated by that certain Contribution Agreement (the “Contribution Agreement”) made and entered into as of June 27, 2018 by and among RBC, the Purchaser and Gert Funk, Joseph Page, PacificWave Partners Limited, PacificWave Partners UK Ltd. and Saxton Capital Ltd (collectively referred to herein as the “Sellers”, individually each a “Seller”).\nPursuant to the Contribution Agreement the Sellers contributed, transferred, assigned and conveyed to B4MC all right, title and interest in and to one hundred percent (100%) of the issued and outstanding Common Stock of RBC for an aggregate of 17,001,312 shares of Common Stock, par value $0.001 per share, of B4MC (the “Purchaser Common Stock”), (such transaction, the “Business Combination”). As a result of the Business Combination, RBC became a 100% wholly owned subsidiary of B4MC. In September 2018 B4MC changed its name to RocketFuel Blockchain, Inc. References to “we” and similar terms in this report are to B4MC after the consummation of the Business Transaction.\nPrior to the Business Combination, B4MC was a “shell company,” as such term is defined in Rule 12b-2 under the Exchange Act. As a result of the Business Combination, we have ceased to be a “shell company.”\nThe Business Combination was treated as a “reverse acquisition” of RBC for financial accounting purposes. RBC was considered the acquirer for accounting purposes, and the historical financial statements of BFMC before the Business Combination were replaced with the historical financial statements of RBC before the Business Combination in all future filings with the SEC. The Purchaser Common Stock issued to the Sellers in connection with the Business Combination have not been registered under the Securities Act, in reliance upon the exemption from registration provided by Section 4(a)(2), which exempts transactions by an issuer not involving any public offering, Regulation D and/or Regulation S promulgated by the SEC under that section. These shares may not be offered or sold in the United States absent registration or an applicable exemption from registration. In this report, references to RocketFuel, the “Company,” “we” and similar terms are to B4MC following the consummation of the reverse acquisition. In September 2018 B4MC changed its name to RocketFuel Blockchain, Inc.\nThe foregoing description of the Contribution Agreement does not purport to be complete. For further information, please refer to the copy of the Contribution Agreement included as Exhibit 2.1 to the Current Report on Form 8-K which was filed with the SEC on June 29, 2018. There are representations and warranties contained in the Contribution Agreement that were made by the parties to each other as of the date of execution. The assertions embodied in these representations and warranties were made solely for purposes of the Contribution Agreement and may be subject to important qualifications and limitations agreed to by the parties in connection with negotiating their terms. Moreover, some representations and warranties may not be accurate or complete as of any specified date because they are subject to a contractual standard of materiality that is different from certain standards generally applicable to shareholders or were used for the purpose of allocating risk between the parties rather than establishing matters as facts. For these reasons, investors should not rely on the representations and warranties in the Contribution Agreement as statements of factual information.\nOur Business\nWe provide check-out and payment systems that securely automate and simplify the way online payment and shipping information is received by merchants from their customers. Our “one click” checkout solution is modeled on the “buy now” button on leading eCommerce sites. Our check-out systems are designed to enhance customers’ data protection, enabling consumers to pay for goods and services using cryptocurrencies or by direct transfers from their bank accounts without exposing spending credentials such as credit card data. At the same time, our check-out systems are designed to increase the speed, security and ease of use for both customers and merchants and include a merchant portal that provides detailed transactions and metrics about payments received by the merchant. They also include a customer portal where shoppers are able to track their payments, configure payment defaults and connect with various cryptocurrency exchanges and banks to facilitate payment to merchants. Merchants are able to integrate a unique pop-up user interface that allows customers to pay directly from their ecommerce checkout page with no need to redirect to another website or web page.\nOur merchant portal is updated instantly when a payment transaction is made on the merchant website. The merchant is notified of the transaction and can see the transaction details, including the customer that made the transaction, the transaction amount and the transaction items. This information is added to the merchant dashboard where various metrics are tracked and displayed to the merchant, including information about the various cryptocurrencies that are used for payments to that merchant and the different currencies received by the merchant as payment. In addition to various metrics, merchants are able to see a variety of reports, and are able to configure various options including settlement options from their portal.\nCustomers of merchants that use the RocketFuel payment solution are able to track their payments in their online portal. They are also able to track payments they made to all the merchants that are integrated with the RocketFuel payment technology within one consolidated user portal. They are currently able to connect to their accounts on Coinbase and in the future we plan to add connectivity to Binance, Kraken, Gemini and other exchanges. They can also pay from any cryptocurrency wallet. Customers are able to pay from bank accounts as well. These customers are able to make payment with any of these payment options with 1, 2, or 3 clicks from the merchant checkout page. By default, these customers can choose from dozens of cryptocurrencies to pay from.\nOur payment user interface allows customers to easily onboard as well as to pay for merchants’ products or services with a variety of cryptocurrencies or via bank transfers. The user interface is displayed as a stand-alone popup that allows the creation of new accounts as well as payment directly from crypto exchanges, crypto wallets, and bank accounts, with no redirects to browser tabs or pages. This can be integrated as a plugin on the merchant checkout page or as a browser extension. The plugin comes integrated with popular ecommerce platforms including WooCommerce, Shopify, Prestashop and others. The browser extension is integrated with popular browsers including Chrome, Chromium, Opera, Firefox, and Edge. The payment interface is designed for both web and mobile checkout experiences. Merchants are able to integrate the RocketFuel payment interface to their checkout page with software development kits (SDKs) that are available via the merchant portal. Application programming interfaces (APIs) are also available to the merchant for deeper integration into backend systems, ERP platforms, and other third-party platforms.\nThe RocketFuel payment solution utilizes a variety of blockchains in its execution including Bitcoin, Ethereum and others where the payment transactions are stored. A significant benefit of this technology is that the entire shopping cart checkout process will be accomplished via a distributed ledger or “blockchain,” meaning that merchant websites will no longer required to operate complex payment and check-out infrastructures.\nOur solution is designed to be implemented on an eCommerce site’s check-out page. The technology will also be used for different scenarios, including paying for services, paying invoices, and other payment strategies. In addition, we anticipate that a future version of our payment system will allow for advertisements in which the entire check out process is embedded on third party websites where sales may be completely finalized. Thus, our technology will enable eCommerce strategies that can include advertisements with a fully integrated check-out process. We believe that this has never before been accomplished in any eCommerce arrangement. We believe that such advertisements could provide significant new sales channels to retailers that are simply not possible with legacy check-out solutions. We also believe that transactions costs on our system will be significantly less expensive than the cost of credit-card transactions.\nThe “single-click” RocketFuel check-out solution is based on a streamlined one- to-three-click check-out process for eCommerce purchases. The system is designed to operate identically across merchant channels with all participating merchants. eCommerce merchants are able to encode their check-out protocol to support our technology and the merchants will no longer have to administer complex check-out and payment gateways at their eCommerce websites. At the same time, consumers are able to experience enhanced data protection opportunities and significantly improved convenience.\nWith the RocketFuel check-out systems, consumers will no longer have to enter credit card information or shipping details every time they want to buy online. Payment and shipping information will be handled automatically. Using the RocketFuel payment solution, credit card data will no longer be shared or transmitted and exposed online. Rather, payments will be made via 100% secure cryptocurrency conveyance or direct bank transfer on the blockchain.\nWith the RocketFuel check-out systems, eCommerce merchants are able to find all necessary details for order fulfilment, including item ID, shipping, and payment via the RocketFuel blockchain. Payment will be accomplished automatically and sent instantly. By using the RocketFuel blockchain solution, transaction transmissions may include both payment and shipping information from the consumer to the eCommerce merchant. RocketFuel checkout systems may be served anywhere and potentially on any website. Indeed, special versions of these systems will be able to work in the physical world, such as in-store check outs, without need for any eCommerce website.\nCryptocurrencies are stored in different types of cryptocurrency wallets. These wallets can include mobile wallets, web wallets, desktop wallets, hardware wallets, and exchange wallets. Currently, it can be a difficult, confusing and multi-step process to use these wallets to make cryptocurrency payments. With RocketFuel’s blockchain solution, cryptocurrency holders can use any of the above digital wallets to make payment for products or services to any RocketFuel merchant with 1, 2, or 3 steps. Our payment technology allows payment directly from these wallets to merchants. This includes integration with the largest cryptocurrency exchanges available, currently Coinbase and in the future planned for Binance, Kraken, Gemini, and others, allowing payments directly from crypto exchange wallets. Additionally, instead of allowing payment with only Bitcoin, RocketFuel merchant customers are able to pay with dozens of cryptocurrencies to the various merchants that integrate our technology. Merchants do not need to understand or hold the different cryptocurrencies because RocketFuel exchanges these currencies to the fiat currency of the merchant, currently USD, and allow settlement with fiat currency to the merchant bank account.\nUsing the “single-click” RocketFuel check-out technology and check-out button, consumers will no longer be re-directed to a third-party website or any payment processor websites requesting personal data, payment details or shipping information. No payment card data will be shared with the eCommerce merchant or any other third party. RocketFuel’s solution is a non-custodial platform; therefore, possession and custody of all funds will be 100% exclusive to the consumer, and no control of funds will ever be available to any third party, including us. Each blockchain transaction will be transparent and available to the merchant via the merchant portal provided by RocketFuel Upon receipt of transactions, merchants will be able to immediately respond by delivering the correct product to the correct client via conventional shipping services.\nWith the RocketFuel solution, eCommerce merchants will need no contact or other information exchange with the consumer in order to receive their payment or shipping details. Instead, they will have immediate visibility of payments from customers via the RocketFuel payment system, which may be integrated into merchants’ fulfillment centers.\nOur Process\nCustomers will go to merchants to make purchases on merchant websites or mobile apps. On the checkout page, along with other payment options, RocketFuel enabled merchants will have a ‘Pay with Crypto’ or similarly labeled button. Customers that click this button will see a pop-up that provides various payment options. These payment options include crypto wallets, Coinbase, and bank accounts and in the future we plan to add Kraken, Gemini, Binance, BitStamp and other exchanges. The payment amount in USD (or other fiat currency) will also be displayed along with the description of the product they are purchasing. They will be able to select the appropriate payment option. Based on the selected option they will be presented with a variety of cryptocurrencies that are supported by the specific exchange or bank. Both the cryptocurrency and fiat currency amounts will be displayed with each cryptocurrency listed. The available balance of the cryptocurrency in the wallet is also displayed. This gives clear visibility of the payment source, the available cryptocurrencies, and the available balance for each cryptocurrency currently available in the customer wallet.\nThe customer is able to select the payment method, such as Coinbase, to make the payment. He/she can select the payment currency, such as Bitcoin or Litecoin. The customer then clicks the Pay Now button in the popup window and the payment is immediately sent to the merchant for payment of the product or service with one click. If the customer has two-factor authentication (2FA) enabled, they are prompted for the 2FA code before the payment is sent.\nCustomers have the exact same process to pay with bank accounts. They are able to select a bank account that they have previously connected to, such as Bank of America or Wells Fargo. They can select the currency (currently only USD is supported). When they click Pay Now the payment is sent to the merchant. If 2FA is enabled, they will need to provide the 2FA code before the funds are sent.\nWhen funds are sent the merchant will receive an email notification. They can immediately see the transaction in their merchant portal as well as related statistics about this and other payments. Customers are also notified by email when a payment is sent. They can also log into their portal to see the payment information and status. Payment updates can also be integrated directly to the merchant backend system with our APIs.\nCustomers can also request refunds. The merchant is provided the tools to accept and execute a refund in crypto or cash or to deny the request.\nIndustry Background\nA blockchain, also known as a “distributed ledger technology,” is a sequential, ever-growing, time-stamped set of records that are grouped in blocks and maintained by disparate participants. Each block is interdependent, making alterations of records economically difficult if not outright impossible. A blockchain includes, but is not limited to, the following features:\n● The blockchain is a decentralized and distributed digital ledger that is used to record and secure transactions across multiple computers.\n● The transactions on the blockchain cannot be changed.\n● All transactions on the blockchain can be verified and audited inexpensively by anyone.\n● The blockchain confirms that each unit of value was transferred only once.\n● A blockchain database consists of two kinds of records: transactions and blocks. Blocks hold batches of valid transactions that are hashed and encoded.\n● Each block includes the hash of the prior block in the blockchain, linking the two.\n● The linked blocks form a virtual “chain.”\nThe blockchain, being a globally distributed ledger running on millions of devices, is capable of recording transfers of anything of value. Transactions in money, equities, bonds, titles, deeds, contracts, and virtually all other kinds of assets can be implemented and stored securely, privately, and from peer to peer, because trust is established, not by powerful intermediaries like banks and governments, but by network consensus, cryptography, collaboration, and sophisticated code. For the first time in human history, two or more parties, be they businesses or individuals who may not even know each other, can forge agreements, make transactions, and build value without relying on intermediaries (such as banks, payment institutions, rating agencies and other third parties) to verify their identities, establish trust, or perform the critical business logic contracting, clearing, settling, and record-keeping tasks that are foundational to all forms of commerce.\nGiven the promise and risks associated of such a disruptive technology, many firms in all kinds of industries, such as banks, insurers, audit and other professional service firms, are investing in, and implementing, blockchain solutions, often to take advantage of the opportunities to reduce friction (which in the case of our user interface means fewer clicks for the user) and costs.\nBlockchain Technologies for eCommerce Payments and Check-out Solutions\nRocketFuel blockchain technologies are intended to solve many of the issues with traditional payment methods. By utilizing blockchain technology, our system will be designed to credit payments faster, with little or no transaction costs, and significantly more secure than current payment systems, while enabling consumers to retain more control over their data.\nTraditional online and offline payment methods route transactions through banks, card-schemes and expensive clearing houses before the money is actually credited to the merchant’s account. In addition, the consumers must send and expose sensitive data online, making it vulnerable to hackers and fraudsters. The blockchain has the ability to provide solutions that can remove the need for third parties such as VISA, MasterCard, acquirers/banks and other intermediaries and make the payments faster, cheaper and more frictionless. Blockchain technologies enable the consumer to control his or her personal, sensitive data without the need to share payment credentials, personal information or other vulnerable data. This could remove the need for expensive and complex third-party anti-fraud tools, transaction monitoring software, and the like, eliminating the possibility for consumers to have their data stolen and mis-used, such as recently experienced in the Facebook data scandal.\nWe believe implementing blockchain technologies in the eCommerce industry will be game changing not only for the payment regimes but also for the way consumers interact with merchants and each other in a peer-to-peer environment, creating multiple benefits and opportunities for both the merchants and the consumers; as described below:\nCheaper Transactions. No intermediaries such as digital wallets and other traditional payment methods, card-schemes and acquirers, are required. Instead, the system is based on self-executing contract instructions with no complexity of transfers and transactions.\nFaster Transactions. The merchants will no longer have to wait days for the card-processors and acquirers to settle the transactions. With the blockchain, the transactions, payments and shipping and order details will be encoded in the data-load files encoded in the transaction instant stored and logged on the blockchain.\nTransparency. The blockchain can store the entire owner history of a product, no matter where the product goes and how many times it is re-purchased. Thus, the blockchain can help eliminate fraud and brings transparency to both consumers and merchant.\nCreating Decentralized Blockchain-Based eCommerce Marketplaces. Because of the security that both the network and the cryptography provide, blockchain technology provides a secure system through which individuals and businesses can directly interact and transact with each other without the need for another intermediary. The only minor fees that will be paid are for the network behind the blockchain for validating transactions and securing the network. Both buyer and seller pay no fees to a marketplace company, because technically, there is no company. The platforms through which e-commerce will be conducted in such eCommerce marketplaces are blockchain applications. Because blockchains are decentralized, there is no central party, or company, that sets the rules and decides how users will transact with one another. The users, thus individuals and businesses, determine how the platform will develop and function.\nSecurity and Consumer Data Protection. Sending consumer data using the blockchain instead of the traditional methods using third party gateways eliminates the possibility for the hackers and fraudsters to steal and mis-use the consumer’s sensitive data. Also, on the database level, the blockchain provides remarkable attributes. For example, it has previously been impossible to assure a database was not manipulated by criminal actors. As the blockchain regime is currently designed, data stored on a blockchain cannot be changed by any means. Further, the blockchain is designed such that it is with the highest certainty that only a possessor of a ‘private key’ can cause a transaction to occur. This assures security at a level never before possible in any computing system. With these properties, blockchain now enables improvement in known systems whereby excellent performance never before possible is realized.\nAnti-Money Laundering Features. Blockchain technologies can be used in powerful anti-money laundering systems as every transaction is ‘laid open’ and available to all system users. Transactions on the blockchain cannot be hidden from the public and they are forever recorded in the ledger.\nOur Growth Strategy\nThe first prototype of our blockchain based check-out solution was developed from 2019 through 2021 and we launched our first product in a live environment with an online travel agency and an accounting software company in March 2021. We intend to continue to develop our technology to obtain proof of concept with several larger U.S. eCommerce merchants, social media platforms and blogsites.\nWe have contracted with a development team reporting to our CTO, to oversee the development of our blockchain-based check-out solution. We have recently retained a Vice President for Marketing and Development to push our social media strategy and to approach new merchants and partners.\nOur Sales and Marketing\nWe believe that our business development team is highly experienced within eCommerce and online marketplaces. With connections to several larger eCommerce merchants, we believe that it will secure our growth and bring us revenue commencing in 2021. Our sales and marketing efforts will focus on a few larger eCommerce merchants rather than many smaller merchants and will be scaled up as funding permits. We believe that a strong proof-of-concept window with our technology functionally displayed in scale will attract merchants to our technology, and we intend to sell the technology both on a per transaction fee and on a license fee basis.\nOur Revenue Model\nWe anticipate that our revenues will be derived primarily from transaction and commission fees from eCommerce merchants. Appreciable revenue generation comes with user adoption. User adoption is a difficult matter to predict in the cryptocurrency community and many have set out with optimism and failed to achieve good user adoption. In the future we have the option to charge our merchant customers set-up fees and license fees as well as fees for added merchant services that we may develop, such as fulfillment and order processing services.\nOur Competition\nWhile there are small crypto payment providers currently in the market, our primary competitor will be Bitpay, which is already well established as the leading crypto payment technology in the market. Compared with Bitpay, we believe that RocketFuel offers a better user experience for crypto payments, more choices to crypto holders (including most of the most popular cryptocurrencies), and more features and more value to merchants. While Bitpay allows payment only with Bitcoin, RocketFuel allows payment with over 40 cryptocurrencies and will be adding more options for customers. Unlike Bitpay, RocketFuel offers payments from any crypto wallet and from multiple crypto exchanges. RocketFuel offers a user experience that solve both the problem with complex onboarding and complex crypto payment experiences, which we believe is less complicated and more intuitive. RocketFuel also offers services that Bitpaty currently does not, such as providing merchants immediate visibility of payment transactions, real time metrics of transactions and customers, easy integration to ecommerce checkout as well as deep integration to backend platforms.\nWe also expect to have future competition from traditional payment platforms including Paypal, Visa and Mastercard, but do not expect these providers to have a competitive solution until at least 2022.\nOur technology is designed to be compliant with the European Union’s new General Data Protection Regulation (GDPR) and other governmental regulations and initiatives to protect the consumer’s data.\nGovernment Regulation\nOur merchant clients are subject to federal, state and foreign laws regarding privacy and the protection of user data. Foreign data protection, privacy, consumer protection, content regulation and other laws and regulations are often more restrictive than those in the United States. As the blockchain industry is still relatively new and in the midst of significant development, there are also potential federal, state and foreign legislative proposals and various state legislative bodies and foreign governments concerning data protection, tracking, behavioral advertising and consumer protection that could affect our clients.\nAs of May 25, 2018, the European Union’s GDPR has been enforced for all organizations doing business in Europe. GDPR aims to harmonize European data privacy laws, protect and empower all EU citizens’ data privacy, and set the guidelines on how to embed data privacy controls within participating organizations.\nWe believe that our blockchain based check-out solution will help our clients to be compliant with the enhanced privacy rules and regulations as our technology will enable the consumers to pay for goods online without exposing spending credentials (credit card data) with the eCommerce merchants.\nEmployees\nAs of June 26, 2021, we have 6 employees and an outsourced technical team.",
    "item_1A": "Item 1A. Risk Factors\nThe following are risk factors that could affect our business, financial condition, results of operations, and cash flows. These risk factors should be considered in connection with evaluating the forward-looking statements contained in this report because these factors could cause actual results, performance, and achievements to differ materially from those projected in forward-looking statements. Before you invest in our publicly traded securities, you should know that making such an investment involves some risks, including the risks described below. Additional risks of which we may not be aware or that we currently believe are immaterial may also impair our business operations or our stock price. If any of the risks occur, our business, financial condition, results of operations or cash flow could be negatively affected. In that case, the trading price of our common stock could decline, and you may lose all or part of your investment. In assessing these risks, investors should also refer to the other information contained or incorporated by reference in this report, our quarterly reports on Form 10-Q and other documents filed by us from time to time.\nSummary of Risk Factors\nThe following is a summary of the principal risks that could adversely affect our business, operations and financial results.\nRisks Related to Our Business Operations and Financial Results\n● We have a limited operating history and may not be able to operate our business successfully or generate sufficient revenue to make or sustain distributions to our shareholders.\n● Our future capital needs are uncertain, and our independent registered public accounting firm has expressed in its report on our audited financial statements for the fiscal year ended March 31, 2021 a substantial doubt about our ability to continue as a going concern.\n● We have limited capital resources, and we will need to raise additional capital through additional funding raises. Such funding, if obtained, could result in substantial dilution.\n● The loss of key personnel or the inability of replacements to quickly and successfully perform in their new roles could adversely affect our business.\n● Our financial statements may be materially affected if our estimates prove to be inaccurate as a result of our limited experience in making critical accounting estimates.\n● Our blockchain-based payment solution is being developed by our key technology employees or contractors, whose continued availability cannot be assured.\n● If we do not respond to technological changes or upgrade our blockchain-based payment processing platform as markets require, our growth prospects and results of operations could be adversely affected.\n● Our competitive edge depends on preserving consumer privacy and identity in their purchasing activities.\n● Failure of cryptocurrency exchanges or ACH bank transfers may prevent the seamless operation of the blockchain payment platform.\n● We may be unable to recover digital assets awaiting transmission into or out of the cryptocurrency exchange or banking institution.\n● If we are unable to price our services appropriately, we may not be able to recover the entire cost of our services.\n● We may become reliant on Internet bandwidth and data center providers.\n● We are subject to income taxes and other tax liabilities.\n● We face risks related to COVID-19.\n● We could face substantial competition.\n● If we fail to protect our intellectual property rights, competitors may be able to use our technology/.\n● The slowing or stopping of the development or acceptance of blockchain networks and blockchain assets could have an adverse effect on our core blockchain-based payment solutions business.\n● Risks related to transaction authentication.\n● Risks related to storage of private keys.\n● Excessive price fluctuations may decrease adoption of cryptocurrencies and adversely impact the demand for our payment solutions.\n● Litigation may adversely affect our business, financial condition and results of operations.\n● Use of our payments services for illegal purposes could harm our business.\n● Limitations on director and officer liability and our indemnification of our officers and directors may discourage stockholders from bringing suit against a director.\nRisks Associated with Government Regulation\n● Privacy regulation is an evolving area and compliance with applicable privacy regulations may increase our operating costs or adversely impact our ability to service our clients.\n● Changes in government regulation and industry standards applicable to the Internet and our business could decrease demand for our technologies and services or increase our costs.\n● The applicability of government regulations of digital currencies is uncertain and evolving.\n● It may be illegal now, or in the future, to participate in blockchains or utilize similar digital assets in one or more countries, the ruling of which would adversely affect us.\n● We have not obtained a money transmitter license in any U.S. State, nor a Bitlicense in the State of New York, and our business may be adversely affected if we are required to do so.\nRisks Associated with an Investment in our Common Stock\n● There is no assurance of an active established public trading market, which would adversely affect the ability of our investors to sell their securities in the public market.\n● Shares eligible for future sale may have adverse effects on our share price.\n● Our Common Stock is considered a “penny stock” and may be difficult to sell.\n● The Financial Industry Regulatory Authority, or FINRA, has adopted sales practice requirements that may also limit a stockholder’s ability to buy and sell our stock.\n● A decline in the price of our Common Stock could affect our ability to raise additional working capital.\n● If we fail to maintain an effective system of internal control over financial reporting, we may not be able to accurately report our financial results.\n● A significant majority of our outstanding ordinary shares are held by a small number of shareholders.\n● We are subject to the periodic reporting requirements of the Exchange Act that will require us to incur audit fees and legal fees in connection with the preparation of such reports.\n● The capital markets may experience periods of disruption and instability.\n● We do not anticipate paying any cash dividends on our capital stock in the foreseeable future.\n● If securities or industry analysts do not publish research or publish inaccurate or unfavorable research about our business, our stock price and trading volume could decline.\n● We are a “smaller reporting company” and, as a result of the reduced disclosure and governance requirements applicable to smaller reporting companies, our Common Stock may be less attractive to investors.\nGeneral Risk Factors\n● Our business is subject to the risks of earthquakes, fire, power outages, floods, epidemics and other catastrophic events, and to interruption by man-made problems such as strikes and terrorism.\n● Prolonged economic downturn, particularly in light of the COVID-19 pandemic, could adversely affect our business.\n● Unfavorable general economic conditions may materially adversely affect our business.\nFor a more complete discussion of the material risks facing our business, please see below.\nRisks Related to Our Business Operations and Financial Results\nWe have a limited operating history and may not be able to operate our business successfully or generate sufficient revenue to make or sustain distributions to our shareholders.\nWe became a public company in July of 2018, following the Business Combination (as defined in Item 1) and our business has a relatively limited operating history. We cannot assure you that we will be able to operate our business successfully or implement our operating policies and strategies. The results of our operations depend on several factors, including our success in attracting and retaining motivated and qualified personnel, the availability of adequate short and long-term financing, conditions in the financial markets, and general economic conditions.\nOur future capital needs are uncertain, and our independent registered public accounting firm has expressed in its report on our audited financial statements for the fiscal year ended March 31, 2021 a substantial doubt about our ability to continue as a going concern. Our ability to continue as a going concern is dependent on our ability to raise additional capital and our operations could be curtailed if we are unable to obtain the required additional funding when needed. We may not be able to do so when necessary, and/or the terms of any financings may not be advantageous to us.\nOur financial statements for the fiscal years ended March 31, 2020 and 2021 included in this report have been prepared assuming we will continue to operate as a going concern. However, due to our recurring losses from operations, and working capital deficiency, there is substantial doubt about our ability to continue as a going concern. Because we expect to continue to experience negative cash flow, our ability to continue as a going concern is subject to our ability to obtain necessary funding from outside sources, including obtaining additional funding from the sale of our securities, grants or other forms of financing. Our continued negative cash flow increases the difficulty in completing such sales or securing alternative sources of funding, and there can be no assurances that we will be able to obtain such funding on favorable terms or at all. If we are unable to obtain sufficient financing from the sale of our securities or from alternative sources, we may be required to reduce, defer or discontinue certain of our research and development and operating activities or we may not be able to continue as a going concern. As a result, our independent registered public accounting firm has expressed in its auditors’ report on the financial statements included in this report a substantial doubt regarding our ability to continue as a going concern. Our financial statements do not include any adjustments that might result from the outcome of the uncertainty regarding our ability to continue as a going concern. If we cannot continue as a going concern, our shareholders may lose their entire investment in our Common Stock. Future reports from our independent registered public accounting firm may also contain statements expressing doubt about our ability to continue as a going concern.\nWe have limited capital resources, and we will need to raise additional capital through additional funding raises. Such funding, if obtained, could result in substantial dilution.\nWe have limited capital resources and require the funds from draws under the Stock Purchase Agreement (as defined below) with Triton Funds LP to continue our business. Even if we substantially increase revenue and reduce operating expenses, we will need to raise additional capital. In order to continue operating, we may need to obtain additional financing, either through private offerings, public offerings or token-based financings, and there can be no assurance that we will be successful in such pursuits. We may be unable to acquire the additional funding necessary to continue operating.\nIf we are able to raise additional capital, we do not know what the terms of any such capital raising would be. In addition, any future sale of our equity securities would dilute the ownership and control of your shares and could be at prices substantially below prices at which our shares currently trade. We may seek to increase our cash reserves through the sale of additional equity or debt securities. The sale of convertible debt securities or additional equity securities could result in additional and potentially substantial dilution to our shareholders. The incurrence of indebtedness would result in increased debt service obligations and could result in operating and financing covenants that would restrict our operations and liquidity and ability to pay dividends. In addition, our ability to obtain additional capital on acceptable terms is subject to a variety of uncertainties. We cannot assure you that financing will be available in amounts or on terms acceptable to us, if at all. Any failure to raise additional funds on favorable terms could have a material adverse effect on our liquidity and financial condition.\nThe loss of key personnel or the inability of replacements to quickly and successfully perform in their new roles could adversely affect our business.\nWe depend on the leadership and experience of our relatively small number of key executive management personnel, particularly our Chairman of the Board, Chief Executive Officer, Chief Technology Officer, Chief Financial Officer, and our Vice President of Marketing and Business Development. The loss of the services of any of these key executives or any of our executive management members could have a material adverse effect on our business and prospects, as we may not be able to find suitable individuals to replace such personnel on a timely basis or without incurring increased costs, or at all. Furthermore, if we lose or terminate the services of one or more of our key employees or if one or more of our current or former executives or key employees joins a competitor or otherwise competes with us, it could impair our business and our ability to successfully implement our business plan. Additionally, if we are unable to hire qualified replacements for our executive and other key positions in a timely fashion, our ability to execute our business plan would be harmed. Even if we can quickly hire qualified replacements, we would expect to experience operational disruptions and inefficiencies during any transition. We believe that our future success will depend on our continued ability to attract and retain highly skilled and qualified personnel. There is a high level of competition for experienced, successful personnel in our industry. Our inability to meet our executive staffing requirements in the future could impair our growth and harm our business.\nOur financial statements may be materially affected if our estimates prove to be inaccurate as a result of our limited experience in making critical accounting estimates.\nFinancial statements prepared in accordance with generally accepted accounting principles in the U.S. (“GAAP”) require the use of estimates, judgments, and assumptions that affect the reported amounts. Actual results may differ materially from these estimates under different assumptions or conditions. These estimates, judgments, and assumptions are inherently uncertain, and, if they prove to be wrong, then we face the risk that charges to income will be required. In addition, because we have limited to no operating history and limited experience in making these estimates, judgments, and assumptions, the risk of future charges to income may be greater than if we had more experience in these areas. Any such charges could significantly harm our business, financial condition, results of operations, and the price of our securities.\nOur blockchain-based payment solution is being developed by our key technology employees or contractors, whose continued availability cannot be assured.\nOur blockchain e-commerce payment platform and the related features that may be developed in the future have been and will be further developed by, among others, contracted developers working to finalized back-office functionalities. If we were to lose the services of any of these key employees or hired contractors, it could be difficult or impossible to replace them. The loss of the services of any of these key employees or contractors could have an adverse effect on our ability to further develop, operate or maintain features of our blockchain e-commerce payment platform.\nOur blockchain payment solution might never attain optimal levels of functionality and dependability\nOur blockchain e-commerce payment solution became fully functional in March of 2021. While our software is currently being used “live” with several customers, no guarantee can be given that a unique combination of input conditions experienced when running the system “live” and which has not been encountered during development, will not cause the system to fail, or perform aberrantly.\nIf we do not respond to technological changes or upgrade our blockchain-based payment processing platform as markets require, our growth prospects and results of operations could be adversely affected\nTo remain competitive, we must continue to enhance and improve the functionality and features of our blockchain-based technology platform infrastructure. As a result, we will need to continue to improve and expand our infrastructure and software capabilities. These improvements may require us to commit substantial financial, operational and technical resources, with no assurance that our business will improve. Without such improvements, our operations might suffer from unanticipated system disruptions, slow performance or unreliable service levels, any of which could negatively affect our reputation and ability to attract and retain merchant clients. We may face significant delays in introducing new products, services, and enhancements. If competitors introduce new payment processing solutions and services using new technologies or if new industry standards and practices emerge, our existing technology platform and systems may become obsolete or less competitive, and our business may be harmed.\nOur competitive edge depends on preserving consumer privacy and identity in their purchasing activities. In today’s climate, potential cyberattacks, security problems, or other disruption and expanding social media vehicles present new risks.\nWe may purchase some of our information technology from vendors, on whom our systems will depend, and we rely on commercially available systems, software, tools, and monitoring to provide security for processing, transmission, and storage of confidential information and other customer information. We depend upon the secure transmission of this information over public networks. Our networks and storage applications could be subject to unauthorized access by hackers or others through cyberattacks, which are rapidly evolving and becoming increasingly sophisticated, or by other means, or may be breached due to operator error, malfeasance or other system disruptions. In some cases, it will be difficult to anticipate or immediately detect such incidents and the damage they cause. Any significant breakdown, invasion, destruction, interruption, or leakage of information from our systems could harm our reputation and business.\nIn addition, the use of social media could cause us to suffer brand damage or information leakage. Negative posts or comments about us on any social networking website could damage us or our brand’s reputation. Employees, consultants, contractors or others might disclose non-public sensitive information relating to our business through external media channels, including through the use of social media.\nFurther, in the normal course of our business, we collect, store and transmit proprietary and confidential information regarding our customers, employees, suppliers and others, including personally identifiable information. An operational failure or breach of security from increasingly sophisticated cyber threats could lead to loss, misuse or unauthorized disclosure of this information about our employees or customers, which may result in regulatory or other legal proceedings, and have a material adverse effect on our business and reputation. We also may not have the resources or technical sophistication to anticipate or prevent rapidly evolving types of cyber-attacks. Any such attacks or precautionary measures taken to prevent anticipated attacks may result in increasing costs, including costs for additional technologies, training and third-party consultants. The losses incurred from a breach of data security and operational failures as well as the precautionary measures required to address this evolving risk may adversely impact our financial condition, results of operations and cash flows.\nFailure of cryptocurrency exchanges or ACH bank transfers may prevent the seamless operation of the blockchain payment platform.\nOur payment platform interacts with cryptocurrency exchanges to facilitate the conversion of customer’s cryptocurrency payments to fiat currency. We will take on credit risk every time our platform facilitates a buyer’s purchase using cryptocurrency. Although our transfers of cryptocurrencies or fiat currency will be made to or from a counterparty, including leading cryptocurrency exchanges and FDIC banks (through ACH transfers), which management believes are trustworthy, it is possible that, through computer or human error, or through theft or criminal action, the buyer’s cryptocurrency or fiat currency could be transferred in incorrect amounts or to unauthorized third parties. To the extent that we are unable to seek a corrective transaction with such third party or are incapable of identifying the third party which has received the cryptocurrency or fiat currency (through error or theft), we will be unable to recover incorrectly transferred cryptocurrency or fiat currency, and such losses will negatively impact us, our merchant accounts and consumers.\nDigital asset exchanges may impose daily, weekly, monthly or customer-specific transaction or distribution limits or suspend withdrawals entirely, rendering the exchange of fiat currency for digital assets difficult or impossible. Additionally, digital asset prices and valuations on cryptocurrency exchanges have been volatile and subject to influence by many factors, including the levels of liquidity on exchanges and operational interruptions and disruptions. The prices and valuation of digital assets remain subject to any volatility experienced by digital asset exchanges, and any such volatility can adversely affect our ability to facilitate the conversion of the cryptocurrency payment funds to fiat currency at the intended cash purchase price.\nDigital asset exchanges are appealing targets for cybercrime, hackers and malware. It is possible that while engaging in transactions with various digital asset exchanges located throughout the world, any such exchange may cease operations due to theft, fraud, security breach, liquidity issues, or government investigation. In addition, banks may refuse to process wire transfers to or from exchanges. An exchange may be unable to replace missing digital assets or seek reimbursement for any theft of digital assets, adversely affecting our ability to offer payment solutions in a secure and dependable manner.\nWe may be unable to recover digital assets awaiting transmission into or out of the cryptocurrency exchange or banking institution, all of which could adversely affect our platform’s operations.\nWe may be unable to recover digital assets awaiting transmission into or out of the cryptocurrency exchange or banking institution, all of which could adversely affect our platform’s operations. Additionally, digital asset exchanges may operate outside of the United States. We may have difficulty in successfully pursuing claims in the courts of such countries or enforcing in the courts of such countries a judgment obtained by us in another country. In general, certain less developed countries lack fully developed legal systems and bodies of commercial law and practices normally found in countries with more developed market economies. These legal and regulatory risks may adversely affect us and our operations and investments.\nIf we are unable to price our services appropriately, we may not be able to recover the entire cost of our services.\nOur clients purchase our services according to a variety of pricing formula. Sometimes these include formula based on pay for performance, meaning clients pay only after we have delivered the desired result to them. Regardless of how a given client pays us, we ordinarily pay the vast majority of the costs associated with delivering our services to our clients according to contracts and other arrangements that do not always condition our obligation to pay vendors on the receipt of payments from our clients. This means we typically pay for the costs of providing our services before we receive payment from clients. Additionally, certain of our services costs are highly variable and may fluctuate significantly during each calendar month. Accordingly, we run the risk of not being able to recover the entire cost of our services from clients if pricing or other terms negotiated prior to the performance of services prove less than the cost of performing such services.\nWe may become reliant on Internet bandwidth and data center providers and other third parties for key aspects of the process of providing services to our clients, and any failure or interruption in the services and products provided by these third parties could harm our business.\nWe rely on third-party vendors, including data center and Internet bandwidth providers. Any disruption in the network access or colocation services provided by these third-party providers or any failure of these third-party providers to handle current or higher volumes of use could significantly harm our business. Any financial or other difficulties our providers face may have negative effects on our business, the nature and extent of which we cannot predict. We exercise little control over these third-party vendors, which increases our vulnerability to problems with the services they provide. We license technology and related databases from third parties to facilitate analysis and storage of data and delivery of offerings. Any errors, failures, interruptions or delays experienced in connection with these third-party technologies and services could adversely affect our business and could expose us to liabilities to third parties.\nWe are subject to income taxes and other tax liabilities.\nSignificant judgment is required in determining our provision for income taxes and other tax liabilities. In the ordinary course of our business, there are many transactions and calculations where the ultimate tax determination is uncertain. Although we believe that our tax estimates are reasonable: (i) there is no assurance that the final determination of tax audits or tax disputes will not be different from what is reflected in our income tax provisions, expense amounts for non-income-based taxes and accruals and (ii) any material differences could have an adverse effect on our financial position and results of operations in the period or periods for which determination is made.\nWe face risks related to Novel Coronavirus (COVID-19) which could significantly disrupt our research and development, operations, sales, and financial results.\nOur business will be adversely impacted by the effects of the COVID-19. Our third-party vendors, third-party distributors, and our customers have been and will be disrupted by worker absenteeism, quarantines and restrictions on employees’ ability to work, office and factory closures, disruptions to ports and other shipping infrastructure, border closures, or other travel or health-related restrictions. In addition, the COVID-19 or other disease outbreak will in the short-run and may over the longer term adversely affect the economies and financial markets of many countries, resulting in an economic downturn that will affect demand for our technology platform and services and impact our operating results. Although the magnitude of the impact of the COVID-19 outbreak on our business and operations remains uncertain, the continued spread of the COVID-19 or the occurrence of other epidemics and the imposition of related public health measures may adversely impact our business, financial condition, operating results and revenues.\nWe could face substantial competition, which could reduce our market share and negatively impact our net revenue.\nThere are an increasing number of companies entering the payment facilitator industry using, as we are, blockchain infrastructure and cryptocurrency. Notable companies in the payment facilitator industry include Bitpay, PayPal, Stripe, Greenbox, MasterCard and Visa. Many of our payment facilitator competitors are significantly larger than we are and have considerably greater financial, technical, marketing, and other resources than we do. Some competitors may have a lower cost of funds and access to funding sources that are not available to us. We cannot assure you that the competitive pressures we face will not have a material adverse effect on our business, financial condition, and results of operations.\nIf we fail to protect our intellectual property rights, competitors may be able to use our technology, which could weaken our competitive position, reduce our net revenue, and increase our costs.\nOur long-term success will depend to some degree on our ability to protect the proprietary technology that we have developed or may develop or acquire in the future, including our ability to obtain and maintain patent protection. Patent applications can take many years to issue, and we can provide no assurance that our current pending patent application, or any future patent applications, will be granted. If we are unable to obtain a patent for our current or future applications, we may not be able to successfully prevent our competitors from imitating or copying our payment processing platform. Even if our pending application was granted, our intellectual property rights may not be sufficiently comprehensive to prevent our competitors from developing similar competitive payment processing platforms.\nThere are multiple risks inherent in patent litigation. In patent litigation in the U.S., defendant counterclaims alleging invalidity and/or unenforceability are commonplace, as are validity challenges by the defendant against the subject patent or other patents before the United States Patent and Trademark Office (USPTO). Grounds for a validity challenge could be an alleged failure to meet any of several statutory requirements, including lack of novelty, obviousness or non-enablement, failure to meet the written description requirement, indefiniteness, and/or failure to claim patent eligible subject matter. Grounds for an unenforceability assertion could be an allegation that someone connected with prosecution of the patent intentionally withheld material information from the USPTO, or made a misleading statement, during prosecution. Third parties may also raise similar claims before the USPTO even outside the context of litigation, in for example, post-grant review proceedings and inter-parties review proceedings. The outcome is unpredictable following any legal assertions of invalidity and unenforceability. With respect to the validity question, for example, we cannot be certain that no invalidating prior art existed of which we and the patent examiner were unaware during prosecution. These assertions may also be based on information known to us or the USPTO. If a defendant or third party were to prevail on a legal assertion of invalidity and/or unenforceability, we would lose at least part, and perhaps all, of the claims of the challenged patent. Such a loss of patent protection would or could have a material adverse impact on our business.\nEven if the validity of our patent rights is upheld by a court, a court may not prevent the alleged infringement of our patent rights on the grounds that such activity is not covered by our patent claims. Although we may aggressively pursue anyone whom we reasonably believe is infringing upon our intellectual property rights, initiating and maintaining suits against third parties that may infringe upon our intellectual property rights will require substantial financial resources. We may not have the financial resources to bring such suits, and if we do bring such suits, we may not prevail. Regardless of our success in any such actions, we could incur significant expenses in connection with such suits.\nIn 2019, following resignation of Joseph Page, our former chief technology officer, we retained independent patent counsel to review our patent applications. In connection with this review, we discovered certain deficiencies in some of the applications and in their assignments to us. We determined that all of the applications had been abandoned. Based on this review, we decided to refile three of our applications with the U.S. Patent and Trademark Office, which we did in May 2020. It is our belief that the three newly filed patent applications cover and/or disclose the same subject matter as we disclosed in the five original patent applications. In this case, our rights may be subject to any intervening patent applications made after the dates of the original applications.\nThe slowing or stopping of the development or acceptance of blockchain networks and blockchain assets could have an adverse effect on our core blockchain-based payment solutions business. However, whether such development will take place is subject to a high degree of uncertainty.\nFactors affecting the further development of blockchain networks include, without limitation:\n● worldwide growth in the adoption and use of digital assets and other blockchain technologies;\n● the maintenance and development of the open-source software protocols of blockchain networks;\n● changes in consumer demographics and public tastes and preferences;\n● the availability and popularity of new forms or methods of buying and selling goods and services, or trading assets, including new means of using existing networks;\n● general economic conditions in the United States and the world;\n● the impacts of major events such as pandemics and climate change;\n● the regulatory environment relating to blockchains; and\n● declines in the popularity or acceptance of blockchain-based assets.\nThe slowing or stopping of the development, general acceptance, adoption, and usage of blockchain networks and blockchain assets may deter or delay the acceptance and adoption of cryptocurrencies, and thus demand for our blockchain-based payment solutions.\nRisks related to transaction authentication\nAs of March 31, 2021, the transfer of digital currency assets from one party to another currently typically relies on an authentication process by an outside party known as a miner. In exchange for compensation, the miner will authenticate the transfer of the currency through the solving of a complex algorithm known as a proof of work, or will vouch for the transfer through other means, such as a proof of stake. Effective transfers of and therefore realization of cryptocurrency is dependent on interactions from these miners. In the event that there were a shortage of miners to perform this function, that shortage could have an adverse effect on either the fair value or realization of the cryptocurrency assets. In such event, the adoption of cryptocurrency as a form a payment can be severely impacted, and this would decrease the demand of our cryptocurrency-based payment facilitator platform, and thus affect our results of operations.\nRisks related to storage of private keys\nIn some cases, we may provide technology to facilitate the secure storage of user API keys from cryptocurrency exchanges. This is done to facilitate payment by the user to the merchant for product or services. At all times, these keys are encrypted, controlled by the owner of the keys, and are not available to us, our staff, or our partners. When this feature is used, the keys are stored by a third party using hardware security modules (HSMs) that have been validated under FIPS 140-2 to protect the confidentiality and integrity of the keys.\nExcessive price fluctuations may decrease adoption of cryptocurrencies and adversely impact the demand for our payment solutions, and we are exposed to fluctuations in cryptocurrency exchange rates.\nTo the extent the public demand for digital assets were to decrease, the price of digital assets could fluctuate rapidly. Further, if the supply of digital assets available to the public were to increase or decrease suddenly due to, for example, a change in a digital asset’s source code, the dissolution of a digital asset exchange, or seizure of digital assets by government authorities, the price of digital assets could fluctuate rapidly. Such changes in demand and supply of digital asset could adversely affect digital asset usage among consumers. In addition, governments may intervene, directly and by regulation, in the digital asset market, with the specific effect, or intention, of influencing digital asset prices and valuation (e.g., releasing previously seized digital asset). Similarly, any government action or regulation may indirectly affect the digital asset market or blockchain network, influencing cryptocurrency usage or prices.\nCurrently, there is relatively modest use of digital assets in the retail and commercial marketplace compared to its use by speculators, thus contributing to price volatility that could adversely affect the consumer usage. If future regulatory actions or policies limit the ability to own or exchange digital assets in the retail and commercial marketplace, or use them for payments, or own them generally, the price and demand for digital assets may decrease. Such decrease in demand may result in a drop in demand for our blockchain payment platform or a decrease the market price of our shares.\nLitigation may adversely affect our business, financial condition and results of operations.\nFrom time to time in the normal course of our business operations, we may become subject to litigation involving intellectual property, data privacy and security and other matters that may negatively affect our operating results if changes to our business operation are required. The cost to defend such litigation may be significant and may require a diversion of our resources. There also may be adverse publicity associated with litigation that could negatively affect customer perception of our business, regardless of whether the allegations are valid or whether we are ultimately found liable. As a result, litigation may adversely affect our business, financial condition and results of operations. In addition, insurance may not cover existing or future claims, be sufficient to fully compensate us for one or more of such claims or continue to be available on terms acceptable to us. A claim brought against us that is uninsured or underinsured could result in unanticipated costs, thereby adversely affecting our results of operations and resulting in a reduction in the market price of our stock. See Item 3 - Legal Proceedings of this report for a summary of our material pending legal proceedings.\nUse of our payments services for illegal purposes could harm our business.\nOur payment system is susceptible to potentially illegal or improper uses, including money laundering, terrorist financing, illegal online gambling, fraudulent sales of goods or services, illicit sales of prescription medications or controlled substances, piracy of software, movies, music, and other copyrighted or trademarked goods (in particular, digital goods), money laundering, bank fraud, child pornography trafficking, prohibited sales of alcoholic beverages or tobacco products, online securities fraud, or to facilitate other illegal activity. Certain activity that may be legal in one country may be illegal in another country, and a merchant may intentionally or inadvertently be found responsible for importing illegal goods, creating liability to us. Changes in law have increased the penalties for intermediaries providing payment services for certain illegal activities and additional payments-related proposals are under active consideration by government authorities. Intellectual property rights owners or government authorities may seek to bring legal action against providers of payments solutions, including us, that are peripherally involved in the sale of infringing items. Any resulting claims could result in reputational harm and any resulting liabilities, loss of transaction volume or increased costs could harm our business.\nLimitations on director and officer liability and our indemnification of our officers and directors may discourage stockholders from bringing suit against a director.\nOur articles of incorporation and bylaws provide, as permitted by Nevada corporation law, that a director or officer shall not be personally liable to us or our stockholders for breach of fiduciary duty as a director or officer, except for acts or omissions which involve intentional misconduct, fraud or knowing violation of law. These provisions may discourage stockholders from bringing suit against a director for breach of fiduciary duty and may reduce the likelihood of derivative litigation brought by stockholders on our behalf against a director. In addition, our amended and restated articles of incorporation and bylaws require indemnification of directors and officers to the fullest extent permitted by Nevada law.\nRisks Associated with Government Regulation\nPrivacy regulation is an evolving area and compliance with applicable privacy regulations may increase our operating costs or adversely impact our ability to service our clients.\nBecause we store, process and use data, some of which contains personal information, we are subject to complex and evolving federal, state, and foreign laws and regulations regarding privacy, data protection, and other matters. While we believe we are currently in compliance with applicable laws and regulations, many of these laws and regulations are subject to change and uncertain interpretation, and could result in investigations, claims, changes to our business practices, increased cost of operations, and declines in user growth, retention, or engagement, any of which could seriously harm our business.\nChanges in government regulation and industry standards applicable to the Internet and our business could decrease demand for our technologies and services or increase our costs.\nLaws and regulations that apply to Internet communications, commerce and advertising are becoming more prevalent. These regulations could increase the costs of conducting business on the Internet and could decrease demand for our technologies and services. In the United States, federal and state laws have been enacted regarding copyrights, sending of unsolicited commercial email, user privacy, search engines, Internet tracking technologies, direct marketing, data security, children’s privacy, pricing, sweepstakes, promotions, intellectual property ownership and infringement, trade secrets, export of encryption technology, taxation and acceptable content and quality of goods. Other laws and regulations may be adopted in the future. Laws and regulations, including those related to privacy and use of personal information, are changing rapidly outside the United States as well, which may make compliance with such laws and regulations difficult, and which may negatively affect our ability to expand internationally. This legislation could: (i) hinder growth in the use of the Internet generally; (ii) decrease the acceptance of the Internet as a communications, commercial and advertising medium; (iii) reduce our revenue; (iv) increase our operating expenses; or (v) expose us to significant liabilities.\nThe laws governing the Internet remain largely unsettled, even in areas where there has been some legislative action. While we actively monitor this changing legal and regulatory landscape to stay abreast of changes in the laws and regulations applicable to our business, we are not certain how our business might be affected by the application of existing laws governing issues such as property ownership, copyrights, encryption and other intellectual property issues, libel, obscenity and export or import matters to the Internet advertising industry. The vast majority of such laws were adopted prior to the advent of the Internet. As a result, they do not contemplate or address the unique issues of the Internet and related technologies. Changes in laws intended to address such issues could create uncertainty in the Internet market. It may take years to determine how existing laws apply to the Internet and Internet marketing. Such uncertainty makes it difficult to predict costs and could reduce demand for our services or increase the cost of doing business as a result of litigation costs or increased service delivery costs.\nThe applicability of government regulations of digital currencies is uncertain and evolving.\nThere are uncertainties related to the regulatory regimes governing blockchain technologies, cryptocurrencies, digital assets, cryptocurrency exchanges, and any digital tokens that we may issue, and new international, federal, state and local regulations or policies may materially adversely affect us and the market price for our shares.\nVarious legislative and executive bodies in the United States and in other countries may, in the future, adopt laws, regulations, or guidance, or take other actions that could severely impact the permissibility of any tokens that we may issue in the future, our blockchain and the network or cryptocurrency generally and, in each case, the technology behind them or the means of transacting in or transferring them. It is difficult to predict how or whether regulatory agencies may apply existing or new regulation with respect to this technology and its applications, including our blockchain and the network. For example, several jurisdictions, including the United States, have taken the position that certain crypto assets fall within the definition of “security” under applicable laws. The classification of a crypto asset as a security under applicable law has wide-ranging implications for the regulatory obligations that flow from the offer, sale, trading, and clearing of such assets and could adversely impact our business. Further, future development regarding the treatment of crypto assets for U.S. federal income and foreign tax purposes could adversely impact our business. In addition, self-regulatory bodies may be established that set guidelines regarding cryptocurrencies, and our network, which could have similar effects to new policies adopted by government bodies.\nIt may be illegal now, or in the future, to participate in blockchains or utilize similar digital assets in one or more countries, the ruling of which would adversely affect us.\nCryptocurrency networks, blockchain technologies and cryptocurrencies also face an uncertain regulatory landscape in many foreign jurisdictions, including (among others) the European Union, China and Russia. Various foreign jurisdictions may, in the future, adopt laws, regulations or directives that affect us. These laws, regulations or directives may conflict with those of the United States or may directly and negatively impact results of operations. The effect of any future regulatory change is impossible to predict, but any change could be substantial and materially adverse to us, our results of operations and adoption of our payment solutions platform.\nWe have not obtained a money transmitter license in any U.S. State, nor a Bitlicense in the State of New York, and our business may be adversely affected if we are required to do so.\nWe do not believe that we are a money transmitter, because we do not hold, possess or control payment funds on behalf of a consumer or merchant. If we were deemed to be a money transmitter, we would be subject to significant additional regulation. This could increase our costs in operating our business. In addition, a regulator could take action against us if it views our payment solution platform as a violation of existing law. Any of these outcomes would negatively affect the market price for our shares and could cause us to cease operations in certain U.S. States.\nAdditionally, we are not licensed to conduct a virtual currency business in New York and do not intend to become licensed in any other state that may require licensing in the future. We have taken the position that New York’s BitLicense Regulatory Framework does not apply to our platform business. It is possible, however, that the New York State Department of Financial Services could disagree with our position. If we were deemed to be conducting an unlicensed virtual currency business in New York, we could be subject to significant additional regulation and/or regulatory consequences.\nRisks Associated with an Investment in our Common Stock\nThere is no assurance of an active established public trading market, which would adversely affect the ability of our investors to sell their securities in the public market.\nAlthough our Common Stock is registered under the Exchange Act and is traded on the OTCQB Marketplace, an active trading market for the securities does not yet exist and may not exist or be sustained in the future. The OTCQB Marketplace is an over-the-counter market that provides significantly less liquidity than the NASDAQ Stock Market. Prices for securities traded solely on the OTCQB may be difficult to obtain and holders of Common Stock may be unable to resell their securities at or near their original offering price or at any price. Market prices for our Common Stock will be influenced by a number of factors, including:\n● Our ability to obtain additional financing and the terms thereof;\n● Our financial position and results of operations;\n● Any litigation against us;\n● Possible regulatory requirements on our business;\n● The issuance of new debt or equity securities pursuant to a future offering;\n● Competitive developments;\n● Variations and fluctuations in our operating results;\n● Change in financial estimates by securities analysts;\n● The depth and liquidity of the market for our Common Stock;\n● Investor perceptions of us; and\n● General economic and business conditions.\nShares eligible for future sale may have adverse effects on our share price.\nApproximately 77 percent of the shares of Common Stock issued and outstanding are owned by 11 stockholders who will be eligible to sell some of their shares of Common Stock by means of ordinary brokerage transactions in the open market pursuant to Rule 144 promulgated under the Securities Act (“Rule 144”), subject to certain limitations. Rule 144 also permits the sale of securities, without any limitations, by a nonaffiliate that has satisfied a six-month holding period. Any substantial sale of Common Stock pursuant to Rule 144 may have an adverse effect on the market price of our Common Stock by creating an excessive supply.\nSales of substantial amounts of shares or the perception that such sales could occur may adversely affect the prevailing market price for our shares. We may issue additional shares in subsequent public offerings or private placements to make new investments or for other purposes. We are not required to offer any such shares to existing shareholders on a preemptive basis. Therefore, it may not be possible for existing shareholders to participate in such future share issuances, which may dilute the existing shareholders’ interests in us.\nOur Common Stock is considered a “penny stock” and may be difficult to sell.\nOur Common Stock is considered to be a “penny stock” since it meets one or more of the definitions in Rules 15g-2 through 15g-6 promulgated under Section 15(g) of the Exchange Act. These include but are not limited to the following: (i) the stock trades at a price less than $5.00 per share; (ii) it is not traded on a “recognized” national exchange; (iii) it is not quoted on the NASDAQ Stock Market, or even if so, has a price less than $5.00 per share; or (iv) it is issued by a company with net tangible assets less than $2.0 million, if in business more than a continuous three years, or with average revenues of less than $6.0 million for the past three years. The principal result or effect of being designated a “penny stock” is that securities broker-dealers cannot recommend the stock but must trade in it on an unsolicited basis.\nAdditionally, Section 15(g) of the Exchange Act and Rule 15g-2 promulgated thereunder by the SEC require broker-dealers dealing in penny stocks to provide potential investors with a document disclosing the risks of penny stocks and to obtain a manually signed and dated written receipt of the document before effecting any transaction in a penny stock for the investor’s account.\nHolders of our Common Stock are urged to obtain and read such disclosure carefully before purchasing any shares that are deemed to be “penny stock.” Moreover, Rule 15g-9 requires broker-dealers in penny stocks to approve the account of any investor for transactions in such stocks before selling any penny stock to that investor. This procedure requires the broker-dealer to: (i) obtain from the investor information concerning its financial situation, investment experience and investment objectives; (ii) reasonably determine, based on that information, that transactions in penny stocks are suitable for the investor and that the investor has sufficient knowledge and experience as to be reasonably capable of evaluating the risks of penny stock transactions; (iii) provide the investor with a written statement setting forth the basis on which the broker-dealer made the determination in (ii) above; and (iv) receive a signed and dated copy of such statement from the investor, confirming that it accurately reflects the investor’s financial situation, investment experience and investment objectives. Compliance with these requirements may make it more difficult for holders of our Common Stock to resell their shares to third parties or to otherwise dispose of them in the market or otherwise.\nThe Financial Industry Regulatory Authority, or FINRA, has adopted sales practice requirements that may also limit a stockholder’s ability to buy and sell our stock.\nIn addition to the “penny stock” rules described above, FINRA has adopted rules that require that, in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low-priced securities to their noninstitutional customers, broker-dealers must make reasonable efforts to obtain information about the customer’s financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low-priced securities will not be suitable for at least some customers. FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our Common Stock, which may limit your ability to buy and sell our stock and have an adverse effect on the market for our shares.\nA decline in the price of our Common Stock could affect our ability to raise additional working capital, it may adversely impact our ability to continue operations and we may go out of business.\nA prolonged decline in the price of our Common Stock could result in a reduction in the liquidity of our Common Stock and a reduction in our ability to raise capital. Because we may attempt to acquire a significant portion of the funds we need in order to conduct our planned operations through the sale and issuance of equity securities, a decline in the price of our Common Stock could be detrimental to our liquidity and our operations because the decline may cause investors not to choose to invest in our stock. If we are unable to raise the funds we require for all our planned operations, we may be forced to reallocate funds from other planned uses and we may suffer a significant negative effect on our business plan and operations, including our ability to develop new products and continue our current operations. As a result, our business may suffer, and not be successful and we may go out of business. We also might not be able to meet our financial obligations if we cannot raise enough funds through the sale and issuance of our Common Stock and we may be forced to go out of business.\nIf we fail to maintain an effective system of internal control over financial reporting, we may not be able to accurately report our financial results. As a result, current and potential shareholders could lose confidence in our financial reporting, which would harm our business and the trading price of our stock.\nWe are a development stage company with limited resources. Therefore, we cannot assure investors that we will be able to maintain effective internal controls over financial reporting based on criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”) in Internal Control Integrated Framework. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the company’s annual or interim financial statements will not be prevented or detected on a timely basis. We are considering the costs and benefits associated with improving and documenting our disclosure controls and procedures and internal controls and procedures, which includes (i) hiring additional personnel with sufficient U.S. GAAP experience and (ii) implementing ongoing training in U.S. GAAP requirements for our CFO and accounting and other finance personnel. If the results of these efforts are not successful, or if material weaknesses are identified in our internal control over financial reporting, our management will be unable to report favorably as to the effectiveness of our internal control over financial reporting and/or our disclosure controls and procedures, and we could be required to further implement expensive and time-consuming remedial measures and potentially lose investor confidence in the accuracy and completeness of our financial reports which could have an adverse effect on our stock price and potentially subject us to litigation.\nA significant majority of our outstanding ordinary shares are held by a small number of shareholders, which may have significantly greater influence on us due to the size of their shareholdings relative to other shareholders.\nAs of the date of this report, 11 persons beneficially own approximately 77 percent of the outstanding shares of our Common Stock. These major shareholders have significant influence in determining the outcome of any corporate transactions or other matters submitted to our shareholders for approval, including mergers, consolidations and schemes of arrangement, election and removal of directors and other significant corporate actions. They may not act in our best interests or our minority shareholders’ interests. In addition, without the consent of these major shareholders, we could be prevented from entering into transactions that could be beneficial to us. This concentration of ownership may also discourage, delay or prevent a change in control, which could deprive our shareholders of an opportunity to receive a premium for their shares as part of a sale of our company and might reduce the price of our Common Stock. These actions may be taken even if they are opposed by our other shareholders.\nWe are subject to the periodic reporting requirements of the Exchange Act that will require us to incur audit fees and legal fees in connection with the preparation of such reports. These additional costs could reduce or eliminate our ability to earn a profit.\nWe are required to file periodic reports with the SEC pursuant to the Exchange Act and the rules and regulations promulgated thereunder. In order to comply with these requirements, our independent registered public accounting firm will have to review our financial statements on a quarterly basis and audit our financial statements on an annual basis. Moreover, our legal counsel will have to review and assist in the preparation of such reports. The costs charged by these professionals for such services cannot be accurately predicted at this time because factors such as the number and type of transactions that we engage in and the complexity of our reports cannot be determined at this time and will have a major effect on the amount of time to be spent by our auditors and attorneys. However, the incurrence of such costs will obviously be an expense to our operations and thus have a negative effect on our ability to meet our overhead requirements and earn a profit. We may be exposed to potential risks resulting from any new requirements under Section 404 of the Sarbanes-Oxley Act of 2002. If we cannot provide reliable financial reports or prevent fraud, our business and operating results could be harmed, investors could lose confidence in our reported financial information, and the trading price of our Common Stock, if a market ever develops, could drop significantly.\nPursuant to Section 404 of the Sarbanes-Oxley Act of 2002, as amended by SEC Release 338889, we are required to include in our annual report our assessment of the effectiveness of our internal control over financial reporting. Furthermore, if we cease to be a smaller reporting company, our independent registered public accounting firm will be required to report separately on whether it believes that we have maintained, in all material respects, effective internal control over financial reporting. We have not yet commenced any assessment of the effectiveness of our internal control over financial reporting. We expect to incur additional expenses and diversion of management’s time as a result of performing the system and process evaluation, testing and remediation required in order to comply with the management certification and auditor attestation requirements.\nWe do not have a sufficient number of employees to segregate responsibilities and may be unable to afford increasing our staff or engaging outside consultants or professionals to overcome our lack of employees. During the course of our testing, we may identify other deficiencies that we may not be able to remediate in time to meet the deadline imposed by the Sarbanes-Oxley Act for compliance with the requirements of Section 404. In addition, if we fail to achieve and maintain the adequacy of our internal controls, as such standards are modified, supplemented or amended from time to time, we may not be able to ensure that we can conclude on an ongoing basis that we have effective internal controls over financial reporting in accordance with Section 404 of the Sarbanes-Oxley Act. Moreover, effective internal controls, particularly those related to revenue recognition, are necessary for us to produce reliable financial reports and are important to help prevent financial fraud. If we cannot provide reliable financial reports or prevent fraud, our business and operating results could be harmed, investors could lose confidence in our reported financial information, and the trading price of our Common Stock, if a market ever develops, could drop significantly.\nThe capital markets may experience periods of disruption and instability. Such market conditions may materially and adversely affect debt and equity capital markets, which may have a negative impact on our business and operations.\nVolatility and dislocation in the capital markets can also create a challenging environment in which to raise or access debt capital. The reappearance of market conditions similar to those experienced from 2008 through 2009 for any substantial length of time could make it difficult to obtain debt capital, extend the maturity of or refinance existing indebtedness or obtain new indebtedness with similar terms and any failure to do so could have a material adverse effect on our business. The debt capital that will be available to us in the future, if at all, may be at a higher cost and on less favorable terms and conditions than what is currently available including being at a higher cost due to a rising rate environment. If we are unable to raise or refinance debt, then our equity investors may not benefit from the potential for increased returns on equity resulting from leverage and we may be limited in our ability to make new commitments or to fund existing commitments to our portfolio companies.\nSignificant changes or volatility in the capital markets may also have a negative effect on the valuations of our investments. An inability to raise or access capital could have a material adverse effect on our business, financial condition or results of operations.\nWe do not anticipate paying any cash dividends on our capital stock in the foreseeable future.\nWe currently intend to retain all of our future earnings to finance the growth and development of our business, and therefore, we do not anticipate paying any cash dividends on our capital stock in the foreseeable future. We believe it is likely that our board of directors will continue to conclude that it is in the best interests of us and our shareholders to retain all earnings (if any) for the development of our business. In addition, the terms of any future debt agreements may preclude us from paying dividends. As a result, capital appreciation, if any, of our Common Stock will be your sole source of gain for the foreseeable future.\nIf securities or industry analysts do not publish research or publish inaccurate or unfavorable research about our business, our stock price and trading volume could decline.\nThe trading market for our Common Stock will depend in part on the research and reports that securities or industry analysts publish about us or our business. Few securities and industry analysts currently publish research on our company. If additional securities or industry analysts do not commence coverage of our company, the trading price for our stock would likely be negatively impacted. In the event that additional securities or industry analysts initiate coverage, or if one or more of the analysts who covers us downgrades our stock or publishes inaccurate or unfavorable research about our business, our stock price may decline. If one or more of these analysts ceases coverage of our company or fails to publish reports on us regularly, demand for our stock could decrease, which might cause our stock price and trading volume to decline.\nWe are a “smaller reporting company” and, as a result of the reduced disclosure and governance requirements applicable to smaller reporting companies, our Common Stock may be less attractive to investors.\nWe qualify as a “smaller reporting company,” which allows us to take advantage of certain reduced disclosure obligations, including those regarding executive compensation, in our periodic reports and proxy statements. We cannot predict if investors will find our Common Stock less attractive because we will rely on these reduced disclosure standards. If some investors find our Common Stock less attractive as a result, there may be a less active trading market for our Common Stock and our stock price may be more volatile. We may take advantage of these reduced disclosure requirements until we are no longer a smaller reporting company. We will remain smaller reporting company until (i) our public float exceeds $250,000,000 or (ii) we no longer have less than $100,000,000 in revenues and public float of less than $700,000,000.\nGeneral Risk Factors\nOur business is subject to the risks of earthquakes, fire, power outages, floods, epidemics and other catastrophic events, and to interruption by man-made problems such as strikes and terrorism.\nA significant natural disaster, such as an earthquake, fire, power outage, flood, epidemic or other catastrophic event, or interruptions by strikes, terrorism or other man-made problems, could have an adverse effect on our business, operating results and financial condition. Despite any precautions we may take, the occurrence of a natural disaster or other unanticipated problems could result in lengthy interruptions in our services. The risks of such an event may be further increased if our disaster recovery plans prove to be inadequate. We do not currently maintain business interruption insurance to compensate us for potentially significant losses, including potential harm to our business resulting from interruptions in our ability to provide products or services. Any significant natural disaster or man-made business interruption could have an adverse effect on our financial condition or results of operations.\nProlonged economic downturn, particularly in light of the COVID-19 pandemic, could adversely affect our business.\nUncertain global economic conditions, in particular in light of the COVID-19 pandemic, could adversely affect our business. Negative global and national economic trends, such as decreased consumer and business spending, high unemployment levels and declining consumer and business confidence, pose challenges to our business and could result in declining revenues, profitability and cash flow. Particularly, worsening economic conditions in our target markets could lead to merchants lowering their budgets and decreasing ability and demand to purchase our payment solutions.\nUnfavorable general economic conditions may materially adversely affect our business.\nWhile it is difficult for us to predict the impact of general economic conditions on our business, these conditions could reduce customer demand for some of our products or services which could cause our revenue to decline. Also, our customers that are especially reliant on the credit and capital markets being liquid, retail investors having investment capital and other factors which could affect their ability to host successful capital raises and continue as a going concern. Moreover, we rely on obtaining additional capital and/or additional funding to provide working capital to support our operations. We regularly evaluate alternative financing sources. Further changes in the commercial capital markets or in the financial stability of our investors and creditors may impact the ability of our investors and creditors to provide additional financing. For these reasons, among others, if the economic conditions stagnate or decline, our operating results and financial condition could be adversely affected.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNone.",
    "item_2": "Item 2. Properties\nWe do not own any properties. We lease offices in San Francisco, California on a month-to-month basis.",
    "item_3": "Item 3. Legal Proceedings\nOther than as set forth below, we are not the subject of any pending legal proceedings; and to the knowledge of management, no proceedings are presently contemplated against us by any federal, state or local governmental agency. Further, to the knowledge of management, no director or executive officer is party to any action in which any has an interest adverse to us.\nOn October 8, 2020, we filed a lawsuit in the U.S. District Court for the Central District of California against Joseph Page, our former director and chief technology officer. On January 13, 2021, the case was transferred to the U.S. District Court for the District of Nevada, Las Vegas Division. The causes of action include securities fraud under Federal and California law; fraud, breach of fiduciary duty, negligent misrepresentation and unjust enrichment under California law; and violation of California Business and Professions Code §17200 et seq.\nWe are seeking injunctive and declaratory relief as well as damages of at least $5.1 million. On May 29, 2019, Mr. Page resigned from our board. After his resignation, we retained independent patent counsel to review our patent applications. In connection with this review, we discovered certain deficiencies in some of the applications and in their assignments to us. We determined that all of the applications had been abandoned. Based on this review, we decided to refile three of our applications with the U.S. Patent and Trademark Office, which we did in May 2020. It is our belief that the three newly filed patent applications cover and/or disclose the same subject matter as we disclosed in the five original patent applications. In this case, our rights may be subject to any intervening patent applications made after the dates of the original applications. In the lawsuit, we are alleging that Mr. Page was aware of the abandonments when he assigned the patents to RocketFuel Blockchain Company (“RBC”), a private corporation that he controlled, and that he failed to disclose to us the abandonments when we acquired RBC in exchange for shares of our Common Stock. Mr. Page has filed an answer denying our clams and has asserted cross- and counterclaims against us and several of our shareholders alleging breach of contract and fraud. We intend to vigorously contest these allegations.\nOn March 2, 2021, we filed a lawsuit in the U.S. District Court for the Southern District of New York against Ellenhoff Grossman & Schole LLP (“EGS”) for negligence and legal malpractice, breach of contract and breach of fiduciary duty. EGS had represented RBC prior to the Business Combination and represented us after the closing of the Business Combination through August 2019. In the litigation against Mr. Page, he has alleged that he provided information to an EGS partner that the patent applications had been abandoned and that EGS failed to inform RBC and us of the fact. We are seeking damages and the return of legal fees previously paid.",
    "item_4": "Item 4. Mine Safety Disclosures\nNot applicable.\nPART II",
    "item_5": "Item 5. Market Information for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur common stock was quoted on the OTC Market under the symbol “BFMC” until July 12, 2018 at which time the symbol was changed to “RKFL.” There is limited trading of our common stock. Quotations from the OTC Market reflect inter-dealer prices, without retail mark-up, mark-down or commission and may not necessarily represent actual transactions. The stock market in general has experienced extreme stock price fluctuations in the past few years. In some cases, these fluctuations have been unrelated to the operating performance of the affected companies. Many companies have experienced dramatic volatility in the market prices of their common stock. We believe that a number of factors, both within and outside our control, could cause the price of our common stock to fluctuate, perhaps substantially. Factors such as the following could have a significant adverse impact on the market price of our common stock:\n● Our ability to obtain additional financing and the terms thereof;\n● Our financial position and results of operations;\n● Any litigation to which we are a party;\n● Possible regulatory requirements on our business;\n● The issuance of new debt or equity securities pursuant to a future offering;\n● Our ability to obtain additional financing and the terms thereof;\n● Changes in interest rates;\n● Competitive developments;\n● Variations and fluctuations in our operating results;\n● Change in financial estimates by securities analysts;\n● The depth and liquidity of the market for our common stock;\n● Investor perceptions of us; and\n● General economic and business conditions.\nAs of July 21, 2021, there were 1,064 stockholders of record. The last sale price as quoted by the OTCQB tier of The OTC Markets on July 21, 2021, was $1.10 per share.\nRecent Sales of Unregistered Securities\nWe claimed exemption from registration under the Securities Act for the sales and issuances of securities in the following transactions under Section 4(a)(2) of the Securities Act and/or Regulations D and S promulgated thereunder, in that such sales and issuances (i) did not involve a public offering, or (ii) were made to non-U.S. Persons and otherwise complied with Rule 903 promulgated under the Securities Act, or (iii) were made pursuant to Rule 701 promulgated under the Securities Act, in that they were offered and sold either pursuant to written compensatory plans or pursuant to a written contract relating to compensation, as provided by Rule 701. All of the purchasers of unregistered securities for which we relied on Section 4(a)(2) and/or Regulation D represented that they were accredited investors as defined under the Securities Act. We claimed such exemption on the basis that (a) the purchasers in each case represented that they intended to acquire the securities for investment only and not with a view to the distribution thereof and that they either received adequate information about the registrant or had access, through employment or other relationships, to such information and (b) appropriate legends were affixed to the stock certificates issued in such transactions.\nOn September 3, 2019, a private investor purchased 100,000 shares of our Common Stock at a price of $1.00 per share.\nOn April 29, 2020, we entered into a subscription agreement with a private investor for the purchase of 478,750 shares of our Common Stock, at a purchase price of $1.00 per share, resulting in cash proceeds of $478,750. This transaction was a part of a private placement of 500,000 shares of Common Stock. We paid a placement fee of $50,000 in connection with these transactions.\nOn May 1, 2020, we issued a warrant to the same private investor to purchase an additional 1,500,000 shares of Common Stock at $1.00 per share. The warrant expired on April 30, 2021. We also agreed that upon the full and timely exercise of this warrant, we would issue a second warrant for an additional 1,500,000 shares of Common Stock at a purchase price of $1.50 per share; this second warrant will have a term of 12 months from the date of issue. The first warrant was transferred to an affiliate of the private investor on November 17, 2021. From November 17, 2020 through April 20, 2021 the warrant holder exercised the first warrant providing for the issuance of 1,500,000 shares of our Common Stock at an exercise price of $1.00 per share, resulting in gross proceeds of $1,500,000. On April 26, we issued to the investor the second warrant, covering an additional 1,500,000 shares of our common stock, expiring April 26, 2022, with an exercise price of $1.50 per share.\nOn August 24, 2020, we issued 150,000 shares of our Common Stock to a consultant in lieu of cash for services. The common stock was valued at $162,000, or $1.08 per share, based on an independent appraisal.\nOn February 25, 2021, we entered into a Common Stock Purchase Agreement (the “Stock Purchase Agreement”) with Triton Funds, LP, a Delaware limited partnership (“Triton” or the “Selling Stockholder,” which term also includes Triton’s successors and assigns under the Stock Purchase Agreement and the Warrant). Under the Stock Purchase Agreement Triton, which is an unrelated third party, agreed to invest up to $1,000,000 through purchases of our Common Stock during the commitment period (which runs through December 31, 2022). During the commitment period, we may, in our sole discretion, deliver purchase notices to Triton stating the dollar amount of shares which we intend to sell to Triton, not to exceed $500,000 per purchase notice. The amount to be funded under a purchase notice will be the number of shares of Common Stock to be purchased multiplied by the greater of (i) $1.65 or (ii) 80 percent of the lowest closing price of our Common Stock within 15 business days prior to the closing date for the purchase. The closing date for each purchase is five business days following the date of the corresponding purchase notice. In connection with these transactions, we paid Triton an administrative fee of $15,000.\nTriton’s obligation to purchase Common Stock is conditioned on certain factors including, but not limited to, our having an effective S-1 registration statement in effect for resale of the Common Stock being purchased and Triton’s ownership not exceeding 4.99% of our issued and outstanding shares at any time.\nIn connection with the Stock Purchase Agreement, we also issued to Triton warrants to purchase, in one or more installments, 800,000 shares of our Common Stock (the “Warrants”) at an exercise price equal to the greater of (i) $1.65 per share or (ii) 80 percent of the average closing price of our Common Stock over the 90-calendar day period preceding the Warrant exercise date, subject to adjustments. The Warrants terminate on February 25, 2026. If, at any time after the initial effective date of the S-1 registration statement filed in connection with the Stock Purchase Agreement and during the exercise period of the Warrants, there is no effective registration statement covering the Selling Stockholder’s immediate resale of the shares underlying the exercise of the Warrants (the “Warrant Shares”), then Selling Stockholder may elect to receive Warrant Shares pursuant to a cashless exercise of the Warrants. On May 5, 2021, Triton exercised 50,000 Warrants for an aggregate purchase price of $82,500.\nFrom January 1, 2018 through July 1, 2021, we granted stock options under our 2018 Stock Incentive Plan, as amended, to issue up to an aggregate of 5,597,570 shares of our common stock to our employees, directors, and consultants, at a weighted average exercise price of $1.08 per share.\nOn February 15, 2021, we issued a warrant to purchase 265,982 shares of our common stock to our chief executive officer at an exercise price of $1.00 per share.\nDividend Policy\nOur dividend policy is determined by our Board of Directors and depends upon a number of factors, including our financial condition and performance, our cash needs and expansion plans, income tax consequences, and the restrictions that applicable laws and any credit or other contractual arrangements may then impose. We have not paid any cash dividends on the common stock. We do not anticipate paying a cash dividend on our common stock in the foreseeable future.",
    "item_6": "Item 6. Reserved",
    "item_7": "Item 7. Management’s Discussion and Analysis or Plan of Operation\nOverview\nOur Corporate History\nOn June 27, 2018 (the “Closing Date”), RocketFuel Blockchain Company (“RBC”) and B4MC Gold Mines, Inc., a Nevada Corporation (“B4MC” or the “Purchaser”), consummated the transactions contemplated by that certain Contribution Agreement (the “Contribution Agreement”) made and entered into as of June 27, 2018 by and among RBC, the Purchaser and Gert Funk, Joseph Page, PacificWave Partners Limited, PacificWave Partners UK Ltd. and Saxton Capital Ltd (collectively referred to herein as the “Sellers”, individually each a “Seller”).\nPursuant to the Contribution Agreement the Sellers contributed, transferred, assigned and conveyed to B4MC all right, title and interest in and to one hundred percent (100%) of the issued and outstanding Common Stock of RBC for an aggregate of 17,001,312 shares of Common Stock, par value $0.001 per share, of B4MC (the “Purchaser Common Stock”), (such transaction, the “Business Combination”). As a result of the Business Combination, RBC became a 100% wholly owned subsidiary of B4MC. In September 2018 B4MC changed its name to RocketFuel Blockchain, Inc. References to “we” and similar terms in this report are to B4MC after the consummation of the Business Transaction.\nPrior to the Business Combination, B4MC was a “shell company,” as such term is defined in Rule 12b-2 under the Exchange Act. As a result of the Business Combination, we have ceased to be a “shell company.”\nThe Business Combination was treated as a “reverse acquisition” of RBC for financial accounting purposes. RBC was considered the acquirer for accounting purposes, and the historical financial statements of BFMC before the Business Combination were replaced with the historical financial statements of RBC before the Business Combination in all future filings with the SEC. The Purchaser Common Stock issued to the Sellers in connection with the Business Combination have not been registered under the Securities Act, in reliance upon the exemption from registration provided by Section 4(a)(2), which exempts transactions by an issuer not involving any public offering, Regulation D and/or Regulation S promulgated by the SEC under that section. These shares may not be offered or sold in the United States absent registration or an applicable exemption from registration. In this report, references to RocketFuel, the “Company,” “we” and similar terms are to B4MC following the consummation of the reverse acquisition. In September 2018 B4MC changed its name to RocketFuel Blockchain, Inc.\nThe foregoing description of the Contribution Agreement does not purport to be complete. For further information, please refer to the copy of the Contribution Agreement included as Exhibit 2.1 to the Current Report on Form 8-K which was filed with the SEC on June 29, 2018. There are representations and warranties contained in the Contribution Agreement that were made by the parties to each other as of the date of execution. The assertions embodied in these representations and warranties were made solely for purposes of the Contribution Agreement and may be subject to important qualifications and limitations agreed to by the parties in connection with negotiating their terms. Moreover, some representations and warranties may not be accurate or complete as of any specified date because they are subject to a contractual standard of materiality that is different from certain standards generally applicable to shareholders or were used for the purpose of allocating risk between the parties rather than establishing matters as facts. For these reasons, investors should not rely on the representations and warranties in the Contribution Agreement as statements of factual information.\nOur Business\nWe provide check-out and payment systems that securely automate and simplify the way online payment and shipping information is received by merchants from their customers. Our check-out systems are designed to enhance customers’ data protection, enabling consumers to pay for goods and services using cryptocurrencies or by direct transfers from their bank accounts without exposing spending credentials such as credit card data. At the same time, our check-out systems are designed to increase the speed, security and ease of use for both customers and merchants and include a merchant portal that provides detailed transactions and metrics about payments received by the merchant. They also include a customer portal where shoppers are able to track their payments, configure payment defaults and connect with various cryptocurrency exchanges and banks to facilitate payment to merchants. Merchants are able to integrate a unique pop-up user interface that allows customers to pay directly from their ecommerce checkout page with no need to redirect to another website or web page.\nOur merchant portal is updated instantly when a payment transaction is made on the merchant website. The merchant is notified of the transaction and can see the transaction details, including the customer that made the transaction, the transaction amount and the transaction items. This information is added to the merchant dashboard where various metrics are tracked and displayed to the merchant, including information about the various cryptocurrencies that are used for payments to that merchant and the different currencies received by the merchant as payment. In addition to various metrics, merchants are able to see a variety of reports, and are able to configure various options including settlement options from their portal.\nCustomers of merchants that use the RocketFuel payment solution are able to track their payments in their online portal. They are also able to track payments they made to all the merchants that are integrated with the RocketFuel payment technology within one consolidated user portal. They are currently able to connect to their accounts on Coinbase, and in the future we plan to add connectivity to Binance, Kraken, Gemini and other exchanges to pay directly from bank accounts. They can also pay from any cryptocurrency wallet. Customers are able to pay from as well. These customers are able to make payment with any of these payment options with 1, 2, or 3 clicks from the merchant checkout page. By default, these customers can choose from dozens of cryptocurrencies to pay from.\nOur payment user interface allows customers to easily onboard as well as to pay for merchants’ products or services with a variety of cryptocurrencies or via bank transfers. The user interface is displayed as a stand-alone popup that allows the creation of new accounts as well as payment directly from crypto exchanges, crypto wallets, and bank accounts, with no redirects to browser tabs or pages. This can be integrated as a plugin on the merchant checkout page or as a browser extension. The plugin comes integrated with popular ecommerce platforms including WooCommerce, Shopify, Prestashop and others. The browser extension is integrated with popular browsers including Chrome, Chromium, Opera, Firefox, and Edge. The payment interface is designed for both web and mobile checkout experiences. Merchants are able to integrate the RocketFuel payment interface to their checkout page with software development kits (SDKs) that are available via the merchant portal. Application programming interfaces (APIs) are also available to the merchant for deeper integration into backend systems, ERP platforms, and other third-party platforms.\nThe RocketFuel payment solution utilizes a variety of blockchains in its execution including Bitcoin, Ethereum and others where the payment transactions are stored. A significant benefit of this technology is that the entire shopping cart checkout process will be accomplished via a distributed ledger or “blockchain,” meaning that merchant websites will no longer required to operate complex payment and check-out infrastructures.\nOur solution is designed to be implemented on an eCommerce site’s check-out page. The technology will also be used for different scenarios, including paying for services, paying invoices, and other payment strategies. In addition, we anticipate that a future version of our payment system will allow for advertisements in which the entire check-out process is embedded on third party websites where sales may be completely finalized. Thus, our technology could enable eCommerce strategies that can include advertisements with a fully integrated check-out process. We believe that this has never before been accomplished in any eCommerce arrangement. We believe that such advertisements will provide significant new sales channels to retailers that are simply not possible with legacy check-out solutions. We also believe that transactions costs on our system will be significantly less expensive than the cost of credit-card transactions.\nThe “single-click” RocketFuel check-out solution is based on a streamlined one- to-three-click check-out process for eCommerce purchases. The system is designed to operate identically across merchant channels with all participating merchants. eCommerce merchants are able to encode their check-out protocol to support our technology and the merchants will no longer have to administer complex check-out and payment gateways at their eCommerce websites. At the same time, consumers are able to experience enhanced data protection opportunities and significantly improved convenience.\nWith the RocketFuel check-out systems, consumers will no longer have to enter credit card information or shipping details every time they want to buy online. Payment and shipping information will be handled automatically. Using the RocketFuel payment solution, credit card data will no longer be shared or transmitted and exposed online. Rather, payments will be made via 100% secure cryptocurrency conveyance or direct bank transfer on the blockchain.\nOur corporate headquarters are located in San Francisco, California.\nCritical Accounting Policies\nOur significant accounting policies are summarized in Note 3 to our financial statements. Certain of our accounting policies require the application of significant judgment by our management, and such judgments are reflected in the amounts reported in our financial statements. In applying these policies, our management uses its judgment to determine the appropriate assumptions to be used in the determination of estimates. Those estimates are based on our historical experience, terms of existing contracts, our observance of market trends, information provided by our strategic partners and information available from other outside sources, as appropriate. Actual results may differ significantly from the estimates contained in our financial statements.\nResults of Operations\nFiscal Years Ended March 31, 2021 vs. March 31, 2020\nRevenues\nDuring the three month period ended March 31, 2021, we commenced commercial operations and executed a contract with one customer having a one-year term from the date of execution (the “Contract Term”), which was March 31, 2021, that provided for the payment of $10,000 in connection with the implementation of our blockchain technology. In addition, the Contract Term provided for transaction processing using our blockchain technology with no fees during the Contract Term as an inducement to adopt our blockchain technology. We recorded the $10,000 fee as deferred revenue which will be amortized ratably over the Contract Term. During the fiscal year ended March 31, 2020, we did not generate any revenue and had not yet commenced commercial operations. We anticipate that future revenues will be generated from (i) fees charged in connection with the implementation of our blockchain technology; and (ii) ongoing daily transactional fees derived as a negotiated percentage of the transactional revenues earned by our merchant customers.\nResearch and Development Expenses\nResearch and development expenses for the fiscal year ended March 31, 2021 were $163,405 as compared to $3,390 for the comparable prior year period, an increase of $160,015. The increase is primarily a result of the engagement of contract developers and the payroll expenses incurred in connection with the hiring of our full-time chief technology officer, all of whom were engaged in continued development of our blockchain technology for payment processing.\nGeneral and Administrative Expenses\nGeneral and administrative expenses for the fiscal year ended March 31, 2021 were $2,200,177 as compared to $121,649 for the comparable prior year period, an increase of $2,078,528. The increase is primarily a result of (i) legal fees incurred in connection with certain litigation costs and payroll expenses incurred in connection with the hiring of our full-time chief executive officer, and (ii) stock-based compensation.\nStock-based compensation for the fiscal year ended March 31, 2021 of $1,622,335 was composed of (i) the $162,000 value of 150,000 shares of our common stock issued to an independent consultant for services in lieu of cash consideration; (ii) stock options granted to employees which were valued at $1,090,204; (iii) the issuance of a warrant to our chief executive officer that is exercisable into 265,982 shares of our common stock and valued at $370,131; and the (iv) repricing of certain stock options granted to our chief financial officer in August 2018 which were re-priced resulting in additional stock-based compensation of $489,064.\nLiquidity and Capital Resources\nAs of March 31, 2021, we had cash of $800,331, an increase of $792,493 as compared to a cash balance of $7,838 as of March 31, 2020. Our current cash requirements are approximately $200,000 per month.\nDuring the fiscal year ended March 31, 2021, net cash of $636,257 was used in operating activities. Net cash used in operating activities was primarily composed of our net loss of $2,363,582 and offset by (i) $1,460,335 of non-cash stock-based compensation in connection with the grant of employee stock options and issuance of a common stock purchase warrant to our chief executive officer; (ii) $162,000 of non-cash stock-based compensation in connection with the issuance of 150,000 shares of our common stock to a consultant for services in lieu of cash consideration; and (iii) increase in accounts payable, accrued expenses and related party payable of $109,990 in the aggregate.\nDuring the fiscal year ended March 31, 2021, net cash of $1,428,750 was provided by financing activities from the issuance of 1,478,750 shares of our common stock to two investors. During the fiscal year ended March 31, 2020, net cash of $121,250 was provided by financing activities from the issuance of 121,250 shares of our common stock in consideration of $121,250 in gross cash proceeds.\nThere were no options exercised during the fiscal year ended March 31, 2021 and no options or warrants exercised during the fiscal year ended March 31, 2020. During the fiscal year ended March 31, 2021, one investor exercised warrants to purchase 1,100,000 shares of our common stock of which (i) 1,000,000 shares of our common stock were issued in consideration of gross proceeds of $1,000,000 prior to March 31, 2021; and (ii) 100,000 shares of our common stock, for which we received notice of exercise on March 31, 2021, were issued subsequent to March 31, 2021 in consideration of gross proceeds of $100,000.\nOur financial statements have been presented on the basis that we are a going concern, which contemplates the realization of assets and satisfaction of liabilities in the normal course of business. During the fiscal year ended March 31, 2021, we reported a net loss of $2,363,582, which included non-cash stock-based compensation of $1,622,335, and cash flows used in operating activities of $636,257. As a result, management believes that there is substantial doubt about our ability to continue as a going concern.\nWe will require additional financing in order to continue to develop our product and execute on our business plan. However, there can be no assurances that we will be successful in raising the additional capital necessary to continue operations and execute on our business plan. Any potential future sale of equity or debt securities may result in dilution to our stockholders, and we cannot be certain that additional public or private financing will be available in amounts or on terms acceptable to us, or at all. If we are required to raise additional financing, but are unable to obtain such financing, we may be required to delay, reduce the scope of, or eliminate one or more aspects of our operations or business development activities.\nOff-Balance Sheet Arrangements\nAs of March 31, 2021, we did not have any off-balance sheet arrangements that have, or are reasonably likely to have, a current or future material effect on our financial condition, results of operations, liquidity, capital expenditures or capital resources.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nNot Applicable.",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nThe following documents are filed as part of this report on Form 10-K:\nPage\nReport of Prager Metis CPAs LLC, Independent Registered Public Accounting Firm\nBalance Sheets at March 31, 2021 and 2020\nStatements of Operations for the fiscal years ended March 31, 2021 and 2020\nStatements of Stockholders’ Deficit for the fiscal years ended March 31, 2021 and 2020\nStatements of Cash Flows for the fiscal years ended March 31, 2021 and 2020\nNotes to Financial Statements",
    "item_9": "Item 9. Changes In and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A. Controls and Procedures\nThe certificates of our principal executive officer and principal financial and accounting officer attached as Exhibits 31.1 and 31.2 to this Annual Report on Form 10-K include, in paragraph 4 of such certifications, information concerning our disclosure controls and procedures, and internal control over financial reporting. Such certifications should be read in conjunction with the information contained in this Item 9A for a more complete understanding of the matters covered by such certifications.\nManagement’s Annual Report on Internal Control Over Financial Reporting\nAs required by the SEC rules and regulations for the implementation of Section 404 of the Sarbanes-Oxley Act, our management is responsible for establishing and maintaining adequate internal control over financial reporting. Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of our consolidated financial statements for external reporting purposes in accordance with GAAP. Our internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of our company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of consolidated financial statements in accordance with GAAP, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the consolidated financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect errors or misstatements in our consolidated financial statements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree or compliance with the policies or procedures may deteriorate. Management assessed the effectiveness of our internal control over financial reporting at March 31, 2021. In making these assessments, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (2013 Framework) (COSO).\nBased on our assessments and those criteria and on an evaluation under the supervision and with the participation of our management, our principal executive officer and principal financial officer have concluded that our disclosure controls and procedures as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act were not effective as of March 31, 2021 to ensure that information required to be disclosed by us in reports that we file or submit under the Exchange Act is (i) recorded, processed, summarized and reported within the time periods specified in the SEC rules and forms and (ii) accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate, to allow timely decisions regarding required disclosure.\nBased on this evaluation, our management concluded that, as of March 31, 2021, our internal control over financial reporting was not effective due to (i) insufficient segregation of duties in the finance and accounting functions due to limited personnel; and (ii) inadequate corporate governance policies. In the future, subject to working capital limitations, we intend to take appropriate and reasonable steps to make improvements to remediate these deficiencies.\nThis annual report on Form 10-K does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Management’s report was not subject to attestation by our registered public accounting firm pursuant to Securities and Exchange Commission rules that permit us to provide only management’s report in this annual report.\nChanges in Internal Control Over Financial Reporting\nThere have not been any changes in our internal control over financial reporting (as such term is defined in Rules 13a-15(f) under the Exchange Act) during the fiscal period to which this report relates that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.",
    "item_9B": "Item 9B. Other Information\nNone.\nItem 9C. Disclosure Regarding Foreigh Jurisdictions that Prevent Inspections\nNot Applicable.\nPART III",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nDirectors and Named Executive Officers\nOur board of directors is currently comprised of three directors. Our directors and named executive officers, their ages and positions, as well as certain biographical information of these individuals, are set forth below.\nName\nAge\nPositions Held with the Registrant\nGert Funk\nExecutive Chairman of the Board\nPeter M. Jensen\nChief Executive Officer and Director\nBennett J. Yankowitz\nChief Financial Officer, Secretary and Director\nBiographies of Directors and Executive Officers\nGert Funk has been our Chairman since 2018 and was appointed as our Executive Chairman in March 2021. Mr. Funk has been a serial entrepreneur since 1990 with considerable experience and specialty in banking and payments processing. He has more than 14 years as director in various companies within banking and payments. Mr. Funk has since 2005 been CEO of CNG PRO ApS in Denmark and CNG PRO SARL in Monaco. CNG PRO is a European Payment Service Provider for International eCommerce merchants especially within travel and retail. From 2005 until 2013, Mr. Funk has also been CEO of BigeFinancials A/S, a fully EMI licensed company operating under the European Payment Directive and monitored by the Danish Financial Supervisory Authority, as well as a Principal Member of MasterCard. Mr. Funk has been approved as “Fit and Proper” and “Qualified CEO and owner” by the Danish Financial Supervisory Authority. Mr. Funk is currently also President of the Monaco Blockchain Association. Mr. Funk received a Masters degree in economics in Denmark.\nOur Board has concluded that Mr. Funk is an appropriate person to represent management on our Board of Directors given his position as our Chairman, his professional credentials, and his experience in the banking and payments processing industry.\nPeter M. Jensen has been our Chief Executive Officer since 2020. Mr. Jensen is an experienced IT executive with extensive global experience within enterprise software. From 2019 to 2020 he was chief executive officer of Spanugo, a provider of security assurance applications, which was sold to IBM. From 2016 to 2017 he was chief executive officer of Presidiohealth, a provider of software and services to health care providers to manage the patient experience. From 2014 to 2016 he was chief executive officer of ParStream, which created the first analytics database for the Internet of Things (IoT); this company was acquired by CISCO in 2016. From 2011 to 2014 he was chief executive officer of Stopthehacker.com, a provider of website security and privacy services. Previously, he held sales and marketing positions with several other technology companies including Symantec, Oracle and VMWare. Mr. Jensen holds an MBA from the Copenhagen Business School.\nOur Board has concluded that Mr. Jensen is an appropriate person to represent management on our Board of Directors given his position as our Chief Executive Officer, his professional credentials, and his experience as a chief executive officer in the technology industry.\nBennett J. Yankowitz has been our Chief Financial Officer since 2015. Mr. Yankowitz has more than 30 years of experience as a corporate attorney with leading law firms, specializing in securities, financial and merger and acquisition transactions, and has a background in financial analysis and real estate investment and development. He is of counsel to the law firm Shumaker Mallory LLP, and was previously of counsel to its predecessor firm Parker Shumaker Mills LLP. He was previously counsel to Kaye Scholer LLP and a partner of Heenan Blaikie and of Stroock & Stroock & Lavan LLP. From 2002 to 2014, he was a director of Proteus Energy Corporation, a California-based private oil and gas production and development company and was its Chief Executive Officer from 2008 to 2014. Mr. Yankowitz earned his B.A. degree in Mathematics from the University of California, Berkeley (1977), his J.D. degree from the University of Southern California (1980), where he was an editor of the Southern California Law Review, and his LL.M. degree (First Class Honours) from the University of Cambridge (1981), where he was an Evan Lewis-Thomas Scholar at Sidney Sussex College. He is a member of the California and New York bars.\nOur Board has concluded that Mr. Yankowitz is an appropriate person to represent management on our Board of Directors given his position as our Chief Financial Officer, his professional credentials, and his experience as a corporate attorney with leading law firms, specializing in securities, financial and merger and acquisition transactions.\nStockholder Communications with the Board of Directors\nPursuant to procedures set forth in our bylaws, our Board of Directors will consider stockholder nominations for directors if we receive timely written notice, in proper form, of the intent to make a nomination at a meeting of stockholders. To be timely, the notice must be received within the time frame identified in our bylaws. To be in proper form, the notice must, among other matters, include each nominee’s written consent to serve as a director if elected, a description of all arrangements or understandings between the nominating stockholder and each nominee and information about the nominating stockholder and each nominee. These requirements are detailed in our bylaws, which were included in our previous filings with the SEC on Form 10-K and 8-K. A copy of our bylaws will be provided upon written request to the Chief Financial Officer at RocketFuel Blockchain, Inc., 201 Spear Street, Suite 1100, San Francisco, CA 94105.\nCode of Ethics\nWe have adopted a Code of Ethics that allows for us to ensure that our disclosure controls and procedures remain effective. Our Code also defines the standard of conduct expected by our officers, directors and key employees. A copy of our Code of Ethics will be furnished without charge to any person upon written request. Requests should be sent to: Secretary, RocketFuel Blockchain, Inc., 201 Spear Street, Suite 1100, San Francisco, CA 94105.\nDelinquent Section 16(a) Beneficial Ownership Reports\nSection 16(a) of the Securities Exchange Act of 1934 requires our executive officers, directors and persons who beneficially own more than 10% of a registered class of our securities to file reports of ownership and changes in ownership with the SEC. Based solely on a review of copies of such forms submitted to us, we believe that all persons subject to the requirements of Section 16(a), other than those described below, filed such reports on a timely basis in fiscal 2021. As of March 31, 2021, Gert Funk (one transaction) and Peter Jensen (two transactions) (the “Named Executive Officers”) did not file such reports on a timely basis. The Named Executive Officers cured the deficiency in the filing of such reports on June 17, 2021 and June 14, 2021, respectively.\nCorporate Governance and Guidelines\nOur Board of Directors has long believed that good corporate governance is important to ensure that we manage our company for the long-term benefit of stockholders. During the past year, our Board of Directors has continued to review our governance practices in light of the Sarbanes-Oxley Act of 2002 and recently revised SEC rules and regulations. We intend to implement internal corporate governance guidelines and practices and will make such guidelines and practices available on its website at www.rocketfuelblockchain.com, when implemented.",
    "item_11": "Item 11. Executive Compensation\nSummary Compensation Table\nThis section discusses the material components of the executive compensation program for our named executive officers. This discussion may contain forward-looking statements that are based on our current plans, considerations, expectations and determinations regarding future compensation programs.\nThe following table provides information regarding the compensation awarded to, or earned by, our current and former named executive officers for the fiscal years ended March 31, 2021 and 2020.\nNamed Executive Officer Fiscal Period Salary ($) Bonus ($) Stock Awards ($) Option Awards ($) All Other Compensation\n($)\nTotal\n($)\nGert Funk $ - $ - $ - $ - $ - $ -\nChairman - - - - - -\nPeter M. Jensen (1) $ 88,461 $ 12,500 $ - $ 231,658 $ 370,131 $ 702,750\nChief Executive Officer - - - - - -\nBennett J. Yankowitz (2) $ - $ - $ - $ 489,064 $ - $ 489,064\nChief Financial Officer - - - - - -\nFormer Named Executive Officer\nJoseph Page (3) $ - $ - $ - $ - $ - $ -\nFormer Chief Technical Officer - - - - - -\n(1) On September 15, 2020, our Board of Directors approved the grant of options to purchase 2,393,842 shares of our common stock to Mr. Jensen pursuant to our 2018 Stock Option Plan. We determined the fair value of the stock option using the Black-Scholes pricing model which resulted in a total value of the stock options granted of $1,853,256. During the fiscal year ended March 31, 2021, we amortized $231,658 of the total stock-based compensation. We also issued to Mr. Jensen a warrant to purchase 265,982 shares of our common stock at an exercise price of $1.00 per share. Pursuant to the terms of the agreement, this warrant was exercisable immediately on the date of issuance We determined the fair value of the stock option using the Black-Scholes pricing model which resulted in the recording of stock-based compensation of $370,131 during the fiscal year ended March 31, 2021.\n(2) On August 8, 2018, our Board of Directors approved the grant of options to purchase 500,000 shares of our common stock to Mr. Yankowitz pursuant to our 2018 Stock Option Plan. We determined the fair value of the stock option using the Black-Scholes pricing model which resulted in the recording of stock-based compensation of $1,100,350 during the fiscal year ended March 31, 2019. On March 18, 2021, our Board of Directors approved the re-pricing of the exercise price of these shares from $3.00 per share to $1.08 per share. Accordingly, we recorded an additional $489,064 of stock-based compensation during the fiscal year ended March 31, 2021. As of March 31, 2021, total stock-based compensation in connection with this stock option was $1,589,414 which is recorded as additional paid-in capital.\n(3) On May 29, 2019, Mr. Page resigned as a director. On August 1, 2019, we terminated Mr. Page as our chief technology officer and as an officer of our subsidiary, RocketFuel Blockchain Company.\nEmployment Agreements and Other Arrangements with Named Executive Officers\nGert Funk\nMr. Funk has received a grant of options to purchase 500,000 shares of our Common Stock. The options will be issued under our 2018 Plan. The options will (i) be incentive stock options, (ii) have an exercise price equal to $1.08 per share, which is the fair market value per share of our Common Stock on March 15, 2021, as determined by an independent valuation by a qualified appraiser, (iii) have a term of 10 years, (iv) vest and become exercisable as to 1/48th of the shares subject to the options on the 15th day of each calendar month during the term of his employment agreement, commencing on April 15, 2021, (v) be subject to the exercise, forfeiture and termination provisions set forth in the Plan and (vi) otherwise be evidenced by and subject to the terms of our standard form of stock option agreement. Vesting of the options will be accelerated upon a change of control.\nHe will also receive a cash bonus equal to 2.5% of the net proceeds (i.e., adjusted for our costs) of any initial exchange offering (IEO), token generation event (TGE) or similar financing (a “Token Transaction”) completed on or before the date that is 12 months after the formal acceptance by the Board of a proposal for a Token Transaction (start date, milestones, responsibilities). In the event the Board decides to cancel the Token Transaction, Mr. Funk and the Board shall agree upon a mutually acceptable bonus structure in lieu of the foregoing.\nPeter M. Jensen\nMr. Jensen’s employment agreement initially provided for a base salary of $7,500 per month, which was to increase to $20,000 per month once we had received gross proceeds of at least $2,000,000 in subsequent equity round financings. Our Board determined that the conditions for the salary increase occurred on February 1, 2021. He is also entitled to a performance bonus of $25,000 per calendar quarter based on his achieving quarterly financial and business objectives and milestones to be determined by our board of directors.\nMr. Jensen also received a grant of options to purchase 2,393,842 shares of our Common Stock. The options will be issued under our 2018 Plan. The options will (i) be incentive stock options, (ii) have an exercise price equal to $1.08 per share, which is the fair market value per share of our Common Stock on September 15, 2020, as determined by an independent valuation by a qualified appraiser, (iii) have a term of 10 years, (iv) vest and become exercisable as to 1/48th of the shares subject to the options on the 15th day of each calendar month during the term of his employment agreement, commencing on October 15, 2020, (v) be subject to the exercise, forfeiture and termination provisions set forth in the Plan and (vi) otherwise be evidenced by and subject to the terms of our standard form of stock option agreement. Vesting of the options will be accelerated upon a change of control.\nUnder the employment agreement, upon our closing of an equity funding, in one or more rounds prior to April 30, 2021, resulting in aggregate gross proceeds to us of $2,000,000 or more, Mr. Jensen is to receive warrants to purchase 265,982 shares of our Common Stock. Our Board determined that the conditions for the warrant grant occurred on February 1, 2021. The warrants will have a term of 10 years, be fully vested on the date of issuance, and have an exercise price equal to $1.00 per share, the weighted average price per share paid by the investors in such equity funding rounds.\nMr. Jensen’s employment agreement renews on a month-to-month basis. If Mr. Jensen should voluntarily terminate his agreement, or if we terminate his agreement other than for cause (as defined in the 2018 Plan), then he will be entitled to 12 months of accelerated vesting of his stock options.\nBennett J. Yankowitz\nMr. Yankowitz’s employment agreement provides for a base salary of $5,833 per month on the basis of a commitment of 20 hours per week. He is also entitled to a performance bonus of $7,500 per calendar quarter based on his achieving quarterly business objectives and milestones. In March 2021 he also received a grant of options to purchase 500,000 shares of our Common Stock. The options will be issued under our 2018 Plan. The options will (i) be incentive stock options, (ii) have an exercise price equal $1.08 per share, which is the fair market value per share of our Common Stock on March 1, 2001, as determined by an independent valuation by a qualified appraiser, (iii) have a term of 10 years, (iv) vest and become exercisable as to 1/48th of the shares subject to the options on the 1st day of each calendar month during the term of his employment agreement, commencing on April 1, 2021, (v) be subject to the exercise, forfeiture and termination provisions set forth in the Plan and (vi) otherwise be evidenced by and subject to the terms of our standard form of stock option agreement. 250,000 of the options will become fully vested and exercisable upon the achievement of business objectives and milestones. In addition, vesting of the options will be accelerated upon a change of control.\nOutstanding Equity Awards During Fiscal 2021\nOption Awards\nNumber of securities underlying unexercised options (#) Equity incentive plan awards: Number of securities underlying unexercised unearned options Option exercise price Option expiration\nName Exercisable Unexercisable (#) ($) Date\nGert Funk - 500,000 500,000 $ 1.08 3/15/2031\nPeter M. Jensen 299,232 - 2,094,610 $ 1.08 9/15/2030\nBennett J. Yankowitz (1) 500,000 - - $ 1.08 8/8/2028\nBennett J. Yankowitz - 500,000 500,000 $ 1.08 3/15/2031\n(1). Represents options issued on August 8, 2018. The exercise price of these options was adjusted as of March 15, 2021.\nOption Exercises and Stock Vested During Fiscal 2021\nThere were no options exercised during the fiscal year ended March 31, 2021.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table sets forth the beneficial ownership of shares of our common stock, as of June 26, 2021, of (i) each person known by us to beneficially own five percent (5%) or more of such shares; (ii) each of our directors and current executive officers named in the Summary Compensation Table; and (iii) our current executive officers and directors as a group. Except as otherwise indicated, all shares are beneficially owned, and the persons named as owners hold investment and voting power.\nBeneficial ownership is determined in accordance with the rules of the SEC and generally includes voting or investment power with respect to securities. In accordance with SEC rules, shares of our Common Stock which may be acquired upon exercise of stock options or warrants which are currently exercisable or which become exercisable within 60 days of the date of the applicable table below are deemed beneficially owned by the holders of such options and warrants and are deemed outstanding for the purpose of computing the percentage of ownership of such person, but are not treated as outstanding for the purpose of computing the percentage of ownership of any other person. Subject to community property laws, where applicable, the persons or entities named in the tables below have sole voting and investment power with respect to all shares of our Common Stock indicated as beneficially owned by them.\nThe business address of each person listed below, unless otherwise specified, is RocketFuel Blockchain, Inc., 201 Spear Street, Suite 1100, San Francisco, CA 94105.\nName and Address of Beneficial Owner (1) Amount and\nNature\nof Beneficial\nOwnership\nPercent of\nClass (1)\nGert Funk (2) 5,037,408\n20.2 %\nPeter Jensen (3) 814,571\n3.3 %\nBennett J. Yankowitz (4) 1,404,538\n5.7 %\nAll officers and directors as a group (three persons) 7,256,632\n29.0\n%\nJoseph Page\nDomaine de la Brague\nRoute de Biot 289\nValbonne\nFrance 5,100,394 20.4 %\nCarsten Mark (5)\n15 Ovington Street\nLondon SW3 2JA\nUnited Kingdom 2,472,908 9.9 %\nHenrik Rouf\nIslands Brygge 75B, P1\n2300 Copenhagen S\nDenmark 1,507,998 6.0 %\nHenrik Oerbekker (6)\n9 rue des Aubepines\nL-1145 Luxembourg 2,113,071 8.5 %\n(1) Based on 24,988,416 outstanding shares as of July 21, 2021.\n(2) Includes the vested portion of an option to purchase 500,000 shares of Common Stock at $1.08 per share, expiring March 14, 2031.\n(3)\nIncludes a warrant to purchase 265,982 shares of Common Stock at $1.08 per share, expiring February 15, 2031, and the vested portion of an option to purchase 2,393,842 shares of Common Stock at $1.08 per share, expiring September 15, 2030.\n(4) Includes an option to purchase 500,000 shares of Common Stock at $1.08 per share, expiring August 8, 2028, and the vested portion of an option to purchase 500,000 shares of Common Stock at $1.08 per share, expiring March 15, 2031.\n(5) Includes 1,672,908 shares held by Saxton Capital Ltd. Also includes 300,000 shares owned by SCSE Investments ApS, and 200,000 shares owned by SCSE Equities ApS, entities controlled by Mr. Marc’s daughters and over which he disclaims beneficial ownership.\n(6) Includes 2,053,071 shares of Common Stock held in the name of PacificWave Partners UK Ltd., and 10,000 shares of Common Stock held in the name of Zane Consulting Ltd. Mr. Oerbekker exercises sole voting and dispositive power over all such entities. Also includes 50,000 shares of Common Stock held in the name of Advantage Luxembourg S.A. Mr. Oerbekker exercises shared voting and dispositive power over this entity.\nSecurities Authorized for Issuance under Equity Compensation Plans as of the End of Fiscal 2021 Equity Compensation Plan Information\nPlan Category Number of securities to be issued upon exercise of outstanding options, warrants and rights Weighted\naverage exercise price of outstanding options,\nwarrants and rights\nNumber of securities remaining available for future issuance\nEquity compensation plans approved by stockholders 5,497,770 (1) $ 1.08 502,230\n5,497,770\n502,230\n(1) This total represents shares to be issued upon exercise of outstanding options granted under the RocketFuel Blockchain, Inc. 2018 Stock Incentive Plan (the “2018 Plan”) that was approved by our stockholders on August 8, 2018. Under the 2018 Plan, 2,000,000 shares of our common stock were initially reserved for grant. On March 18, 2021, our Board of Directors approved the increase of shares reserved for issuance under the 2018 Plan to 6,000,000 shares of our common stock, subject to shareholder approval. There were no stock options exercised under the 2018 Plan during the fiscal year ended March 31, 2021.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nRelated Party Transactions\nDuring the fiscal years ended March 31, 2021 and 2020, our chief financial officer was affiliated with legal counsel who provided us with general legal services (the “Affiliate”). We recorded legal fees paid to this Affiliate of $100,349 and $7,003 for the fiscal years ended March 31, 2021 and 2020, respectively. As of March 31, 2021 and 2020 we had $35,475 and $5,503, respectively, payable to the Affiliate.\nIn May 2021, we paid an affiliate of our executive chairman $3,000 to provide website-related services.\nIndependence of the Board of Directors\nWe are not currently subject to listing requirements of any national securities exchange or inter-dealer quotation system which has requirements that a majority of the Board be “independent” and, as a result, we are not at this time required to have our Board comprised of a majority of “Independent Directors.” Our Board is currently composed of one named executive chairman and two named executive officers.\nBoard Attendance\nOur Board is comprised of three directors of which two members are also our chief executive and chief financial officers, respectively. During the fiscal year ended March 31, 2021 we convened one (1) formal meeting of the Board.\nCommittees of the Board of Directors\nWe currently have no separate audit, compensation, or nominating committees. The entire Board oversees our (i) audits and auditing procedures; (ii) compensation philosophies and objectives, establishment of remuneration levels for our executive officers, and implementation of our incentive programs; and (iii) identification of individuals qualified to become Board members and recommendation to our shareholders of persons to be nominated for election as directors.\nDirector’s Compensation\nNone.",
    "item_14": "Item 14. Principal Accounting Fees and Services\nThe following is a summary of (i) the fees billed and billable to us by Prager Metis CPAs LLC, our independent registered public accounting firm, for professional services rendered in connection with (i) annual audits and quarterly review fees for the fiscal years ended March 31, 2021 and 2020; and (ii) other audit related fees and tax preparation fees incurred during the fiscal years ended March 31, 2021 and 2020.\nFee Category\nFiscal Year Ended\nMarch 31, 2021 Fiscal Year Ended\nMarch 31, 2020\nPrager Metis CPAs LLC Audit fees $ 26,000 $ 16,000\nOther audit related fees 2,800 -\nTax fees - -\nTotal fees $ 28,800 $ 16,000\nAudit Fees. This category consists of fees billed for professional services rendered for the audit of our annual financial statements and review of financial statements included in our quarterly reports and other professional services provided in connection with regulatory filings.\nOther Audit Related Fees. This category consists of fees billed for professional services rendered for services other than those described herein as Audit Fees or Tax Fees, including preparation of our tax returns.\nTax Fees. This category consists of fees billed for professional services for tax compliance, tax advice and tax planning. These services include assistance regarding federal and state tax compliance and acquisitions.\nPre-Approval Policies and Procedures. The Board of Directors has the authority to approve all audit and non-audit services that are to be performed by our independent registered public accounting firm. Generally, we may not engage our independent registered public accounting firm to render audit or non-audit services unless the service is specifically approved in advance by the Board of Directors.\nPART IV",
    "item_15": "Item 15. Exhibits, Financial Statement Schedules\nThe following are filed as part of this Form 10-K:\n(1) Financial Statements: For a list of financial statements which are filed as part of this Form 10-K, See Item 8, page 33.\n(2) Exhibits\nExhibit\nFiled or Furnished\nNumber\nExhibit Description\nForm\nExhibit\nFiling Date\nHerewith\n2.1\nContribution Agreement, dated June 27, 2018, by and among the Company, RocketFuel Blockchain Company, Joseph Page, Gert Funk, PacificWave Partners Limited, PacificWave Partners UK Ltd. And Saxton Capital Ltd.\n8-K\n2.1\n6/29/18\n3.1\nArticles of Incorporation\nS-1\n3.1\n9/8/87\n3.2\nAmended and Restated Bylaws\n8-K\n2.1\n6/29/18\n3.3\nCertificates of Amendment to Articles of Incorporation through December 31, 2017\nS-1\n3.3\n3/30/21\n3.4\nCertificate of Amendment, dated September 25, 2018, as filed with the Secretary of State of the State of Nevada\nS-1\n3.4\n3/30/21\n4.1\nForm of Stock Certificate\n10.1\nIndemnification Agreement dated as of January 19, 2016, between Bennett Yankowitz and the Company\n8-K\n10.2\n1/22/16\n10.2\nIndemnification Agreement dated as of January 19, 2016, between Henrik Rouf and the Company\n8-K\n10.3\n1/22/16\n10.3\nStock Incentive Plan\n14-C\nAnnex B\n8/28/18\n10.4\nSubscription Agreement, dated April 29, 2020, between the Company and Investorlisten ApS\nS-1\n10.4\n3/30/21\n10.5\nWarrant Agreement, dated May 1, 2020, between the Company and Investorlisten ApS\nS-1\n10.5\n3/30/21\n10.6\nAgreement with Investorlisten ApS\nS-1\n10.6\n3/30/21\n10.7\nExecutive Employment Agreement, dated as of September 15, 2020, between the registrant and Peter M. Jensen\n8-K\n10.1\n9/21/20\n10.8\nIndemnification Agreement dated as of September 15, 2020, between Peter M. Jensen and the Company\nS-1\n10.8\n3/30/21\n10.9\nAmendment No. 1 to 2018 Stock Option Plan\n8-K\n10.2\n9/21/20\n10.10\nExecutive Employment Agreement, dated as of September 14, 2020, between the registrant and Rohan Hall\n8-K\n10.1\n10/8/20\n10.11\nIndemnification Agreement dated as of September 14, between Rohan Hall and the Company\nS-1\n10.11\n3/30/21\n10.12\nCommon Stock Purchase Agreement dated as of February 25, 2021 between Triton Funds LP and RocketFuel Blockchain, Inc.\n8-K\n10.1\n3/3/21\n10.13\nCommon Stock Purchase Warrant dated as of February 25, 2021 between Triton Funds LP and RocketFuel Blockchain, Inc.\n8-K\n10.2\n3/3/21\n10.14\nIndemnification Agreement dated as of January 1, 2021, between Gert Funk and the Company\nS-1\n10.14\n3/30/21\n10.15\nIndemnification Agreement dated as of February 15, 2021, between Kurt Kumar and the Company\nS-1\n10.15\n3/30/21\n10.16\nAmendment No. 2 to 2018 Stock Option Plan\nS-1\n10.16\n3/30/21\n10.17\nExecutive Employment Agreement, dated as of February 15, 2021, between the registrant and Bennett J. Yankowitz\nS-1\n10.17\n3/30/21\n10.18\nExecutive Employment Agreement, dated as of February 15, 2021, between the registrant and Gert Funk\nS-1\n10.18\n3/30/21\n10.19\nWarrant dated February 15, 2021, from the Company to Peter M. Jensen\nS-1\n10.19\n3/30/21\n14.1\nCode of Ethics\n10-KSB\n14.1\n3/30/04\n14.2\nAmended and Restated Code of Ethics\nS-1\n14.2\n3/30/21\n21.1\nSubsidiaries of the registrant\nS-1\n21.1\n3/30/21\n31.1\nCertification of Principal Executive Officer pursuant to Section 302 Sarbanes-Oxley Act of 2002\nX\n31.2\nCertification of Principal Financial and Accounting Officer pursuant to Section 302 Sarbanes-Oxley Act of 2002\nX\n32.1\nCertification of Principal Executive Officer Pursuant to 18 U.S.C. Section 1350, As Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n32.2\nCertification of Principal Financial and Accounting Officer Pursuant to 18 U.S.C. Section 1350, As Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n101.INS\nXBRL Instance Document.\nX\n101.SCH\nXBRL Taxonomy Extension Schema Document.\nX\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase Document.\nX\n101.LAB\nXBRL Taxonomy Extension Label Linkbase Document.\nX\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase Document.\nX\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document.\nX\nItem 16. Form 10-K Summary\nNone.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nStockholders of RocketFuel Blockchain, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Rocketfuel Blockchain, Inc. (the “Company”) as of March 31, 2021 and 2020, and the related statements of operations, statement of stockholders’ deficit and cash flows for the years then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of March 31, 2021 and 2020, and the results of its operations and its cash flows for years then ended, in conformity with accounting principles generally accepted in the United States of America.\nEmphasis of a Matter\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company reported a net loss of $2,363,582 and $125,039 and a negative cash flow from operations of $636,257 and $132,898 for the years ended March 31, 2021 and 2020, respectively. These factors, among others, raise substantial doubt regarding the Company’s ability to continue as a going concern. Management’s plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/s/ Prager Metis CPAs LLC\nWe have served as the Company’s auditor since 2018\nHackensack, New Jersey\nJuly 22, 2021\nROCKETFUEL BLOCKCHAIN, INC.\nBalance Sheets\nMarch 31, 2021 March 31, 2020\nASSETS\nCurrent assets\nCash $ 800,331 $ 7,838\nAccounts receivable 10,000 -\nPrepaid and other current assets 5,000 -\nTotal current assets 815,331 7,838\nTotal assets $ 815,331 7,838\nLIABILITIES AND STOCKHOLDERS’ EQUITY (DEFICIT)\nCurrent liabilities:\nAccounts payable and accrued expenses $ 144,830 $ 64,812\nPayable to related party 35,475\n5,503\nDeferred revenue 10,000\n-\nTotal current liabilities 190,305 70,315\nTotal liabilities 190,305 70,315\nStockholders’ equity (deficit):\nPreferred stock; $0.001 par value; 50,000,000 and 0 shares authorized; and 0 shares issued and outstanding as of March 31, 2021 and 2020, respectively - -\nCommon stock; $0.001 par value; 250,000,000 shares authorized; 24,438,416 shares and 22,809,666 shares issued and outstanding as of March 31, 2021 and 2020, respectively 24,438 22,810\nAdditional paid-in capital 4,584,214 1,534,757\nAccumulated deficit (3,983,626 ) (1,620,044 )\nTotal stockholders’ equity (deficit) 625,026 (62,477 )\nTotal liabilities and stockholders’ equity (deficit) $ 815,331 $ 7,838\nThe accompanying notes are an integral part of these financial statements.\nROCKETFUEL BLOCKCHAIN, INC.\nStatements of Operations\nYear Ended\nMarch 31, 2021\nYear Ended\nMarch 31, 2020\nRevenues $ - $ -\nOperating expenses:\nResearch and development expenses 163,405 3,390\nGeneral and administrative expenses 2,200,177 121,649\nTotal operating expenses 2,363,582 125,039\nLoss from operations (2,363,582 ) (125,039 )\nNet loss before provision for income taxes (2,363,582 ) (125,039 )\nProvision for income taxes - -\nNet loss $ (2,363,582 ) $ (125,039 )\nNet loss per common share:\nBasic and diluted $ (0.10 ) $ (0.01 )\nWeighted average common shares outstanding:\nBasic and diluted 23,541,520 22,749,087\nThe accompanying notes are an integral part of these financial statements.\nROCKETFUEL BLOCKCHAIN, INC.\nStatement of Stockholders’ Equity (Deficit)\nFor the Years Ended March 31, 2020 and 2021\nShares Amount Shares Amount\nCapital Deficit (Deficit)\nPreferred Stock\nOutstanding\nCommon Stock\nOutstanding\nAdditional\nPaid-in\nAccumulated Total\nStockholders’\nEquity\nShares Amount Shares Amount\nCapital Deficit\n(Deficit)\nBalance at March 31, 2019 - $ - 22,688,416 $ 22,688\n$ 1,413,629 $ (1,495,005 ) $ (58,688 )\nIssuance of common stock in connection with private placement - - 121,250\n121,128\n121,250\nIssuance of common stock to consultant for services -\n-\nIssuance of common stock to consultant for services, shares\nIssuance of common stock in connection with exercise of investor warrants -\n-\nIssuance of common stock in connection with exercise of investor warrants, shares\nStock-based compensation - employee and consultant option grants\nPlacement agent fee\nStock-based compensation - CEO warrant\nNet loss\n(125,039 ) (125,039 )\nBalance at March 31, 2020 - $ - 22,809,666 $ 22,810\n$ 1,534,757 $ (1,620,044 ) $ (62,477 )\nBalance at March 31, 2020 - $ - 22,809,666 $ 22,810\n$ 1,534,757 $ (1,620,044 ) $ (62,477 )\nIssuance of common stock in connection with private placement - - 478,750\n478,272\n478,750\nIssuance of common stock to consultant for services - - 150,000\n161,850 - 162,000\nIssuance of common stock in connection with exercise of investor warrants - - 1,000,000 1,000\n999,000\n1,000,000\nStock-based compensation - employee and consultant option grants - -\n1,090,204\n1,090,204\nStock-based compensation - CEO warrant\n370,131\n370,131\nPlacement agent fee - -\n(50,000 )\n(50,000 )\nNet loss\n(2,363,582 ) (2,363,582 )\nBalance at March 31, 2021 - $ - 24,438,416 $ 24,438\n$ 4,584,214 $ (3,983,626 ) $ 625,026\nThe accompanying notes are an integral part of these financial statements.\nROCKETFUEL BLOCKCHAIN, INC.\nStatements of Cash Flows\nYear Ended\nMarch 31,\nYear Ended\nMarch 31,\nCash flows from operating activities:\nNet loss $ (2,363,582 ) $ (125,039 )\nAdjustments to reconcile net loss to net cash flows used in operating activities\nStock-based compensation in connection with employee stock option grants and warrant issuance 1,460,335\nStock-based compensation in connection with stock issued for consulting services 162,000 -\nChanges in assets and liabilities:\nAccounts receivable (10,000 ) -\nPrepaid and other current assets (5,000 ) -\nAccounts payable and accrued expenses 80,018 (13,362 )\nPayable to related party 29,972\n5,503\nDeferred revenue 10,000\n-\nNet cash flows used in operating activities (636,257 ) (132,898 )\nCash flows from financing activities:\nProceeds from issuance of common stock, net of placement agent fee 1,428,750 121,250\nNet cash flows provided by financing activities 1,428,750 121,250\nNet change in cash 792,493 (11,648 )\nCash at beginning of year 7,838 19,486\nCash at end of year $ 800,331 $ 7,838\nSupplemental disclosure of non-cash flow information:\nInterest paid $ - $ -\nThe accompanying notes are an integral part of these financial statements.\nROCKETFUEL BLOCKCHAIN, INC.\nNOTES TO FINANCIAL STATEMENTS\nMARCH 31, 2021\n1. Business\nOur Corporate History\nOn June 27, 2018 (the “Closing Date”), RocketFuel Blockchain Company (“RBC”) and B4MC Gold Mines, Inc., a Nevada Corporation (“B4MC” or the “Purchaser”), consummated the transactions contemplated by that certain Contribution Agreement (the “Contribution Agreement”) made and entered into as of June 27, 2018 by and among RBC, the Purchaser and Gert Funk, Joseph Page, PacificWave Partners Limited, PacificWave Partners UK Ltd. and Saxton Capital Ltd (collectively referred to herein as the “Sellers”, individually each a “Seller”).\nPursuant to the Contribution Agreement the Sellers contributed, transferred, assigned and conveyed to B4MC all right, title and interest in and to one hundred percent (100%) of the issued and outstanding Common Stock of RBC for an aggregate of 17,001,312 shares of Common Stock, par value $0.001 per share, of B4MC (the “Purchaser Common Stock”), (such transaction, the “Business Combination”). As a result of the Business Combination, RBC became a 100% wholly owned subsidiary of B4MC. In September 2018 B4MC changed its name to RocketFuel Blockchain, Inc. References to “we” and similar terms in this report are to B4MC after the consummation of the Business Transaction.\nPrior to the Business Combination, B4MC was a “shell company,” as such term is defined in Rule 12b-2 under the Exchange Act. As a result of the Business Combination, we have ceased to be a “shell company.” The information contained in this report constitutes the information necessary to satisfy the conditions contained in Rule 144(i)(2) under the Securities Act.\nThe Business Combination was treated as a “reverse acquisition” of RBC for financial accounting purposes. RBC was considered the acquirer for accounting purposes, and the historical financial statements of BFMC before the Business Combination were replaced with the historical financial statements of RBC before the Business Combination in all future filings with the SEC. The Purchaser Common Stock issued to the Sellers in connection with the Business Combination have not been registered under the Securities Act, in reliance upon the exemption from registration provided by Section 4(a)(2), which exempts transactions by an issuer not involving any public offering, Regulation D and/or Regulation S promulgated by the SEC under that section. These shares may not be offered or sold in the United States absent registration or an applicable exemption from registration. In this report, references to RocketFuel, the “Company,” “we” and similar terms are to B4MC following the consummation of the reverse acquisition. In September 2018 B4MC changed its name to RocketFuel Blockchain, Inc.\nThe foregoing description of the Contribution Agreement does not purport to be complete. For further information, please refer to the copy of the Contribution Agreement included as Exhibit 2.1 to the Current Report on Form 8-K which was filed with the SEC on June 29, 2018. There are representations and warranties contained in the Contribution Agreement that were made by the parties to each other as of the date of execution. The assertions embodied in these representations and warranties were made solely for purposes of the Contribution Agreement and may be subject to important qualifications and limitations agreed to by the parties in connection with negotiating their terms. Moreover, some representations and warranties may not be accurate or complete as of any specified date because they are subject to a contractual standard of materiality that is different from certain standards generally applicable to shareholders or were used for the purpose of allocating risk between the parties rather than establishing matters as facts. For these reasons, investors should not rely on the representations and warranties in the Contribution Agreement as statements of factual information.\nOur Business\nWe provide check-out and payment systems that securely automate and simplify the way online payment and shipping information is received by merchants from their customers. Our check-out systems are designed to enhance customers’ data protection, enabling consumers to pay for goods and services using cryptocurrencies or by direct transfers from their bank accounts without exposing spending credentials such as credit card data. At the same time, our check-out systems are designed to increase the speed, security and ease of use for both customers and merchants and include a merchant portal that provides detailed transactions and metrics about payments received by the merchant.\nROCKETFUEL BLOCKCHAIN, INC.\nNOTES TO FINANCIAL STATEMENTS\nMARCH 31, 2021\nThey also include a customer portal where shoppers are able to track their payments, configure payment defaults and connect with various cryptocurrency exchanges and banks to facilitate payment to merchants. Merchants are able to integrate a unique pop-up user interface that allows customers to pay directly from their ecommerce checkout page with no need to redirect to another website or web page.\nOur merchant portal is updated instantly when a payment transaction is made on the merchant website. The merchant is notified of the transaction and can see the transaction details, including the customer that made the transaction, the transaction amount and the transaction items. This information is added to the merchant dashboard where various metrics are tracked and displayed to the merchant, including information about the various cryptocurrencies that are used for payments to that merchant and the different currencies received by the merchant as payment. In addition to various metrics, merchants are able to see a variety of reports, and are able to configure various options including settlement options from their portal.\nCustomers of merchants that use the RocketFuel payment solution are able to track their payments in their online portal. They are also able to track payments they made to all the merchants that are integrated with the RocketFuel payment technology within one consolidated user portal. They are able to connect to multiple exchanges including Coinbase, Binance, Kraken, Gemini and others to pay directly from them. They can also pay from any cryptocurrency wallet. Customers are able to pay from bank accounts as well. These customers are able to make payment with any of these payment options with 1, 2, or 3 clicks from the merchant checkout page. By default, these customers can choose from dozens of cryptocurrencies to pay from.\nOur payment user interface allows customers to easily onboard as well as to pay for merchants’ products or services with a variety of cryptocurrencies or via bank transfers. The user interface is displayed as a stand-alone popup that allows the creation of new accounts as well as payment directly from crypto exchanges, crypto wallets, and bank accounts, with no redirects to browser tabs or pages. This can be integrated as a plugin on the merchant checkout page or as a browser extension. The plugin comes integrated with popular ecommerce platforms including WooCommerce, Shopify, Prestashop and others. The browser extension is integrated with popular browsers including Chrome, Chromium, Opera, Firefox, and Edge. The payment interface is designed for both web and mobile checkout experiences. Merchants are able to integrate the RocketFuel payment interface to their checkout page with software development kits (SDKs) that are available via the merchant portal. Application programming interfaces (APIs) are also available to the merchant for deeper integration into backend systems, ERP platforms, and other third-party platforms.\nThe RocketFuel payment solution utilizes a variety of blockchains in its execution including Bitcoin, Ethereum and others where the payment transactions are stored. A significant benefit of this technology is that the entire shopping cart checkout process will be accomplished via a distributed ledger or “blockchain,” meaning that merchant websites will no longer required to operate complex payment and check-out infrastructures.\nOur solution is designed to be implemented on an eCommerce site’s check-out page. The technology will also be used for different scenarios, including paying for services, paying invoices, and other payment strategies. In addition, we anticipate that a future version of our payment system will allow for advertisements in which the entire check out process is embedded on third party websites where sales may be completely finalized. Thus, our technology will enable eCommerce strategies that can include advertisements with a fully integrated check-out process. We believe that this has never before been accomplished in any eCommerce arrangement. We believe that such advertisements could provide significant new sales channels to retailers that are simply not possible with legacy check-out solutions. We also believe that transactions costs on our system will be significantly less expensive than the cost of credit-card transactions.\nThe “single-click” RocketFuel check-out solution is based on a streamlined one- to-three-click check-out process for eCommerce purchases. The system is designed to operate identically across merchant channels with all participating merchants. eCommerce merchants are able to encode their check-out protocol to support our technology and the merchants will no longer have to administer complex check-out and payment gateways at their eCommerce websites. At the same time, consumers are able to experience enhanced data protection opportunities and significantly improved convenience.\nROCKETFUEL BLOCKCHAIN, INC.\nNOTES TO FINANCIAL STATEMENTS\nMARCH 31, 2021\nWith the RocketFuel check-out systems, consumers will no longer have to enter credit card information or shipping details every time they want to buy online. Payment and shipping information will be handled automatically. Using the RocketFuel payment solution, credit card data will no longer be shared or transmitted and exposed online. Rather, payments will be made via 100% secure cryptocurrency conveyance or direct bank transfer on the blockchain.\nOur corporate headquarters are located in San Francisco, California.\nFiscal Year\nOur fiscal year ends on March 31. References herein to fiscal 2021 and/or fiscal 2020 refer to the fiscal year ended March 31, 2021 and 2020, respectively.\n2. Going Concern\nOur financial statements have been presented on the basis that we are a going concern, which contemplates the realization of assets and satisfaction of liabilities in the normal course of business. We incorporated our business on January 12, 2018, the date of our inception, and commenced commercial operations in March 2021. During the fiscal year ended March 31, 2021, we reported a net loss of $2,363,582, which included as a component of general and administrative expenses in the statement of operations a non-cash stock-based compensation charge of $1,622,335, and cash flows used in operating activities of $636,257. As a result, management believes that there is substantial doubt about our ability to continue as a going concern.\nWe will require additional financing to continue to develop our product and execute on our business plan. However, there can be no assurances that we will be successful in raising the additional capital necessary to continue operations and execute on our business plan. In 2021 we raised $1,428,750 through the private placement of shares of our common stock and the exercise of common stock purchase warrants, net of $50,000 of placement agent fees. Subsequent to March 31,2021, we raised an additional $582,500 from the exercise of common stock purchase warrants from two investors. We have used and plan to continue using the net proceeds of the private placement and warrant exercise to recruit key management and operational personnel, to retain software and blockchain developers and to develop our blockchain based check-out solution. Management believes the funding from the private placement, the exercise of the common stock purchase warrant, and the growth strategy actions executed and planned for execution could contribute to our ability to mitigate any substantial doubt as to our ability to continue as a going concern.\n3. Summary of Significant Accounting Policies\nBasis of Presentation\nThe accompanying financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (“GAAP”) and pursuant to the rules and regulations of the U.S. Securities and Exchange Commission (“SEC”).\nUse of Accounting Estimates\nThe preparation of these financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods. Management’s estimates are based on the facts and circumstances available at the time estimates are made, past historical experience, risk of loss, general economic conditions and trends and management’s assessments of the probable future outcome of these matters. Consequently, actual results could differ from such estimates.\nReclassifications\nCertain prior year amounts have been reclassified for consistency with the current year presentation. These reclassifications had no effect on the reported results of operations.\nROCKETFUEL BLOCKCHAIN, INC.\nNOTES TO FINANCIAL STATEMENTS\nMARCH 31, 2021\nRecent Accounting Pronouncements\nFrom time to time, new accounting pronouncements are issued by the Financial Accounting Standards Board or other standard setting bodies that may have an impact on our accounting and reporting. We believe that such recently issued accounting pronouncements and other authoritative guidance for which the effective date is in the future either will not have an impact on our accounting or reporting or that such impact will not be material to our financial position, results of operations and cash flows when implemented.\nCash and Cash Equivalents\nCash includes cash on hand. We consider all highly-liquid, temporary cash investments with a maturity date of three months or less to be cash equivalents. At March 31, 2021 we had $800,331 of cash deposited at two banks. At March 31, 2020 we had $7,838 in cash on hand and no cash deposited in any banks.\nRevenue Recognition\nDuring March 2021 we commenced commercial operations and executed a contract with one customer having a one-year term from the date of execution (the “Contract Term”), which was March 31, 2021, that provided for the payment of $10,000 in connection with the implementation of our blockchain technology. In addition, the Contract Term provided for transaction processing using our blockchain technology with no fees during the Contract Term as an inducement to adopt our blockchain technology. We recorded the $10,000 fee as deferred revenue which will be amortized ratably over the Contract Term. During the fiscal year ended March 31, 2020, we did not generate any revenue and had not yet commenced commercial operations. We anticipate that future revenues will be generated from (i) fees charged in connection with the implementation of our blockchain technology; and (ii) ongoing daily transactional fees derived as a negotiated percentage of the transactional revenues earned by our merchant customers.\nOur revenue recognition policy follows the guidance from Accounting Standards Codification (“ASC”) 606, “Revenue Recognition,” and Accounting Standards Update No. 2014-09 Revenue from Contracts with Customers (Topic 606) which provides guidance on the recognition, presentation, and disclosure of revenue in financial statements. We recognize revenues when all of the following criteria are satisfied: (i) persuasive evidence of an arrangement exists; (ii) the price is fixed or determinable; (iii) collectability is reasonably assured; and (iv) the service has been performed or the product has been delivered. Collectability is assessed based on a number of factors, including the creditworthiness of a client, the size and nature of a client’s website and transaction history. Amounts billed or collected in excess of revenue recognized are included as deferred revenue. An example of this deferred revenue would be arrangements where clients request or are required by us to pay in advance of delivery.\nIn April 2016, the FASB issued “ASU 2016 - 10 Revenue from Contract with Customers (Topic 606): identifying Performance Obligations and Licensing.” The amendments in this Update do not change the core principle of the guidance in Topic 606. Rather, the amendments in this Update clarify the following two aspects of Topic 606: identifying performance obligations and the licensing implementation guidance, while retaining the related principles for those areas. Topic 606 includes implementation guidance on (a) contracts with customers to transfer goods and services in exchange for consideration and (b) determining whether an entity’s promise to grant a license provides a customer with either a right to use the entity’s intellectual property (which is satisfied at a point in time) or a right to access the entity’s intellectual property (which is satisfied over time). The amendments in this Update are intended to render more detailed implementation guidance with the expectation to reduce the degree of judgement necessary to comply with Topic 606. The amendments in this Update affect the guidance in ASU 2014-09, Revenue from Contracts with Customers (Topic 606), which is not yet effective. The effective date and transition requirements for the amendments in this Update are the same as the effective date and transition requirements in Topic 606 (and any other Topic amended by Update 2014-09). ASU 2015-14, Revenue from Contracts with Customers (Topic 606): Deferral of the Effective Date, defers the effective date of Update 2014-09 by one year. We are currently evaluating the impact that this updated guidance will have on our results of operations, cash flows or financial condition.\nFair Value of Financial Instruments\nWe follow Accounting Standards Codification 820-10 (“ASC 820-10”), “Fair Value Measurements and Disclosures,” for fair value measurements. ASC 820-10 defines fair value, establishes a framework for measuring fair value, and expands disclosures about fair value measurements. The standard provides a consistent definition of fair value, which focuses on an exit price, which is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. The standard also prioritizes, within the measurement of fair value, the use of market-based information over entity specific information and establishes a three-level hierarchy for fair value measurement based on the nature of inputs used in the valuation of an asset or liability as of the measurement date.\nROCKETFUEL BLOCKCHAIN, INC.\nNOTES TO FINANCIAL STATEMENTS\nMARCH 31, 2021\nThe hierarchy established under ASC 820-10 gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1) and the lowest priority to unobservable inputs (Level 3). The three levels of the fair value hierarchy under ASC 820-10 are described below:\nLevel 1 - Pricing inputs are quoted prices available in active markets for identical investments as of the reporting date. As required by ASC 820-10, we do not adjust the quoted price for these investments, even in situations where we hold a large position and a sale could reasonably impact the quoted price.\nLevel 2 - Pricing inputs are quoted prices for similar investments, or inputs that are observable, either directly or indirectly, for substantially the full term through corroboration with observable market data. Level 2 includes investments valued at quoted prices adjusted for legal or contractual restrictions specific to these investments.\nLevel 3 - Pricing inputs are unobservable for the investment, that is, inputs that reflect the reporting entity’s own assumptions about the assumptions market participants would use in pricing the asset or liability. Level 3 includes investments that are supported by little or no market activity.\nIncome Taxes\nThe provision for income taxes includes federal, state, local and foreign taxes. Income taxes are accounted for under the liability method. Deferred tax assets and liabilities are recognized for the estimated future tax consequences of temporary differences between the financial statement carrying amounts and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the year in which the temporary differences are expected to be recovered or settled. We evaluate the realizability of our deferred tax assets and establish a valuation allowance when it is more likely than not that all or a portion of deferred tax assets will not be realized.\nWe account for uncertain tax positions using a “more-likely-than-not” threshold for recognizing and resolving uncertain tax positions. The evaluation of uncertain tax positions is based on factors including, but not limited to, changes in tax law, the measurement of tax positions taken or expected to be taken in tax returns, the effective settlement of matters subject to audit, new audit activity and changes in facts or circumstances related to a tax position. We evaluate this tax position on a quarterly basis. We also accrue for potential interest and penalties, if applicable, related to unrecognized tax benefits in income tax expense.\nStock-Based Compensation\nStock-based compensation is measured at the grant date based on the estimated fair value of the award and is recognized as an expense over the requisite service period. The valuation of employee stock options is an inherently subjective process, since market values are generally not available for long-term, non-transferable employee stock options. Accordingly, the Black-Scholes option pricing model is utilized to derive an estimated fair value. The Black-Scholes pricing model requires the consideration of the following six variables for purposes of estimating fair value:\n● the stock option exercise price;\n● the expected term of the option;\n● the grant date price of our common stock, which is issuable upon exercise of the option;\n● the expected volatility of our common stock;\n● the expected dividends on our common stock (we do not anticipate paying dividends in the foreseeable future); and\n● the risk free interest rate for the expected option term.\nExpected Dividends. We have never declared or paid any cash dividends on any of our capital stock and do not expect to do so in the foreseeable future. Accordingly, we use an expected dividend yield of zero to calculate the grant-date fair value of a stock option.\nExpected Volatility. The expected volatility is a measure of the amount by which our stock price is expected to fluctuate during the expected term of options granted. We determine the expected volatility solely based upon the historical volatility of our common stock over a period commensurate with the option’s expected term. We do not believe that the future volatility of our common stock over an option’s expected term is likely to differ significantly from the past.\nRisk-Free Interest Rate. The risk-free interest rate is the implied yield available on U.S. Treasury zero-coupon issues with a remaining term equal to the option’s expected term on the grant date.\nExpected Term. For option grants subsequent to the adoption of the fair value recognition provisions of the accounting standards, the expected life of stock options granted is based on the actual vesting date and the end of the contractual term.\nStock Option Exercise Price and Grant Date Price of Common Stock. The closing market price of our common stock on the date of grant.\nWe are required to estimate the level of award forfeitures expected to occur and record compensation expense only for those awards that are ultimately expected to vest. This requirement applies to all awards that are not yet vested. Due to the limited number of unvested options outstanding, the majority of which are held by executives and members of our Board of Directors, we have estimated a zero forfeiture rate. We will revisit this assumption periodically and as changes in the composition of the option pool dictate.\nBasic and Diluted Loss Per Share\nBasic loss per common share is computed by dividing net income by the weighted-average number of common shares outstanding during the period. Diluted loss per common share is based upon the weighted-average common shares outstanding during the period plus additional weighted-average common equivalent shares outstanding during the period. Common equivalent shares result from the assumed exercise of outstanding stock options and warrants, the proceeds of which are then assumed to have been used to repurchase outstanding common stock using the treasury stock method. In addition, the numerator is adjusted for any changes in income that would result from the assumed conversion of potential shares. There were no potentially dilutive shares which would have the effect of being antidilutive.\nROCKETFUEL BLOCKCHAIN, INC.\nNOTES TO FINANCIAL STATEMENTS\nMARCH 31, 2021\n4. Related Party Transactions\nDuring the fiscal years ended March 31, 2021 and 2020, our chief executive officer was affiliated with legal counsel who provided us with general legal services (the “Affiliate”). We recorded legal fees paid to the Affiliate of $100,349 and $7,003 for the fiscal years ended March 31, 2021 and 2020, respectively. As of March 31, 2021 and 2020 we had $35,475 and $5,503, respectively, payable to the Affiliate.\nIn May 2021, we paid an affiliate of our executive chairman $3,000 to provide website-related services.\n5. Deferred Revenue\nDuring March 2021 we commenced commercial operations and executed a contract with one customer having a one-year term from the date of execution (the “Contract Term”), which was March 31, 2021, that provided for the payment of $10,000 in connection with the implementation of our blockchain technology. In addition, the Contract Term provided for transaction processing using our blockchain technology with no fees during the Contract Term as an inducement to adopt our blockchain technology. We recorded the $10,000 fee as deferred revenue which will be amortized ratably over the Contract Term.\n6. Income Taxes\nAs of March 31, 2021 and 2020, we had no material unrecognized tax benefits and no adjustments to liabilities or operations were required. We were incorporated on January 12, 2018, accordingly, we have the March 31, 2018 through 2020 tax years subject to examination by the federal and state taxing authorities. There are no income tax examinations currently in process.\nReconciliation between our effective tax rate and the United States statutory rate is as follows:\nSchedule of Effective Income Tax Rate Reconciliation\nYear Ended March 31,\nYear Ended March 31,\nExpected federal tax rate 21.0 % 21.0 %\nChange in valuation allowance (21.0 )% (21.0 )%\nEffective tax rate 0.0 % 0.0 %\nDeferred tax assets and liabilities are determined based on the differences between the financial statement carrying amounts and the tax basis of the assets and liabilities using the enacted tax rate in effect in the years in which the differences are expected to reverse. A 100% valuation allowance has been recorded against the deferred tax asset as it is more likely than not, based upon our analysis of all available evidence, that the tax benefit of the deferred tax asset will not be realized.\nSignificant components of our deferred tax assets consist of the following:\nSchedule of Deferred Tax Assets and Liabilities\nMarch 31, 2021 March 31, 2020\nNet operating loss carryforwards $ 283,854 $ 128,193\nValuation allowance (283,854 ) (128,193 )\nNet deferred tax assets $ - $ -\nA valuation allowance has been established for our tax assets as their use is dependent on the generation of sufficient future taxable income, which cannot be predicted at this time.\nAs of March 31, 2021 and 2020, we had federal tax net operating loss carryforwards of $283,854 and $128,193. The federal net operating loss carryforwards will expire at various dates through 2041.\nThe U.S. Tax Cuts and Jobs Act (Tax Act) was enacted on December 22, 2017 and introduces significant changes to U.S. income tax law. Effective in 2018, the Tax Act reduces the U.S. statutory tax rate from 35% to 21% and creates new taxes on certain foreign-sourced earnings and certain related-party payments, which are referred to as the global intangible low-taxed income tax and the base erosion tax, respectively. The Tax Act requires us to pay U.S. income taxes on accumulated foreign subsidiary earnings not previously subject to U.S. income tax at a rate of 15.5% to the extent of foreign cash and certain other net current assets and 8% on the remaining earnings. The accounting for the tax effects of the Tax Act were completed in 2018 and resulted in no material impact to our provision for income taxes and effective tax rate.\nPotential 382 Limitations\nWe have not completed a study to assess whether one or more ownership changes have occurred since we became a loss corporation as defined in Section 382 of the Code, but we believe that it is likely that an ownership change has occurred. If we have experienced an ownership change, utilization of the NOL and AMT would be subject to an annual limitation, which is determined by first multiplying the value of our common stock at the time of the ownership change by the applicable long-term, tax-exempt rate, and then could be subject to additional adjustments, as required. Any such limitation may result in the expiration of a portion of the NOL and AMT before utilization. Until a study is completed and any limitation known, no amounts are being considered as an uncertain tax position or disclosed as an unrecognized tax benefit under ASC 740. Any carryforwards that expire prior to utilization as a result of such limitations will be removed from deferred tax assets with a corresponding adjustment to the valuation allowance. Due to the existence of the valuation allowance, it is not expected that any potential limitation will have a material impact on our operating results.\nOur net operating loss carryforwards are subject to review and possible adjustment by the Internal Revenue Service and are subject to certain limitations in the event of cumulative changes in the ownership interest of significant stockholders over a three-year period in excess of 50%.\nROCKETFUEL BLOCKCHAIN, INC.\nNOTES TO FINANCIAL STATEMENTS\nMARCH 31, 2021\n7. Stockholders’ Equity (Deficit)\nOn September 3, 2019, a private investor purchased 100,000 shares of our common stock at a price of $1.00 per share.\nOn January 9, 2020, we sold 10,000 shares of our common stock to a private investor, resulting in cash proceeds of $10,000. On February 13, 2020, we sold 11,250 shares of our common stock to a private investor, resulting in cash proceeds of $11,250. On April 29, 2020, we entered into a subscription agreement with a private investor for the purchase of 478,750 shares of the Company’s common stock, at a purchase price of $1.00 per share, resulting in cash proceeds of $478,750. These transactions were part of a private placement of 500,000 shares of our common stock. We paid $50,000 to an investment consultant as a placement fee in connection with these transactions.\nOn May 1, 2020, the Company issued a warrant to purchase 1,500,000 shares of Common Stock at $1.00 per share. The warrant expired on April 30, 2021. The Company also agreed that upon the full and timely exercise of this warrant, it would issue a second warrant for an additional 1,500,000 shares of common stock at a purchase price of $1.50 per share; this second warrant will have a term of 12 months from the date of issue. The first warrant was transferred to an affiliate of the original holder in November 2021. During the fiscal year ended March 31, 2021, the warrant holder exercised warrants to purchase 1,100,000 shares of our common stock of which (i) 1,000,000 shares of our common stock were issued in consideration of gross proceeds of $1,000,000 prior to March 31, 2021; and (ii) 100,000 shares of our common stock, for which we received notice of exercise on March 31, 2021, were issued subsequent to March 31, 2021 in consideration of gross proceeds of $100,000. Additionally, the warrant holder exercised the warrant for the remaining 400,000 shares of our common stock in April 2021 in consideration of gross proceeds of $400,000. On April 26, we issued the second warrant to the holder.\nOn February 25, 2021, we entered into a Common Stock Purchase Agreement (the “Stock Purchase Agreement”) with Triton Funds, LP, a Delaware limited partnership (“Triton” or the “Selling Stockholder,” which term also includes Triton’s successors and assigns under the Stock Purchase Agreement and the Warrant). Under the Stock Purchase Agreement Triton, which is an unrelated third party, agreed to invest up to $1,000,000 through purchases of our Common Stock during the commitment period (which runs through December 31, 2022). During the commitment period, we may, in our sole discretion, deliver purchase notices to Triton stating the dollar amount of shares which we intend to sell to Triton, not to exceed $500,000 per purchase notice. The amount to be funded under a purchase notice will be the number of shares of Common Stock to be purchased multiplied by the greater of (i) $1.65 or (ii) 80 percent of the lowest closing price of our Common Stock within 15 business days prior to the closing date for the purchase. The closing date for each purchase is five business days following the date of the corresponding purchase notice.\nTriton’s obligation to purchase Common Stock is conditioned on certain factors including, but not limited to, our having an effective S-1 registration statement in effect for resale of the Common Stock being purchased and Triton’s ownership not exceeding 4.99% of our issued and outstanding shares at any time.\nIn connection with the Stock Purchase Agreement, we also issued to Triton warrants to purchase, in one or more installments, 800,000 shares of our Common Stock (the “Warrants”) at an exercise price equal to the greater of (i) $1.65 per share or (ii) 80 percent of the average closing price of our Common Stock over the 90-calendar day period preceding the Warrant exercise date, subject to adjustments. The Warrants terminate on February 25, 2026. If, at any time after the initial effective date of the S-1 registration statement filed in connection with the Stock Purchase Agreement and during the exercise period of the Warrants, there is no effective registration statement covering the Selling Stockholder’s immediate resale of the shares underlying the exercise of the Warrants (the “Warrant Shares”), then Selling Stockholder may elect to receive Warrant Shares pursuant to a cashless exercise of the Warrants. On May 5, 2021, Triton exercised 50,000 Warrants for an aggregate purchase price of $82,500.\nAll of these transactions were exempt from registration under the Securities Act of 1933 pursuant to Regulations D and/or S thereunder.\nAs of March 31, 2021, and 2020, we had 24,438,416 shares and 22,809,666 shares of our common stock issued and outstanding, respectively.\nROCKETFUEL BLOCKCHAIN, INC.\nNOTES TO FINANCIAL STATEMENTS\nMARCH 31, 2021\n8. Stock-Based Compensation\nStock Option Plan\nOn August 8, 2018, the Board and stockholders holding a majority of our voting power approved the RocketFuel Blockchain, Inc., 2018 Stock Incentive Plan (the “2018 Plan”), which plan enables us to make awards that qualify as performance-based compensation. Under the terms of the 2018 Plan, the options will (i) be incentive stock options, (ii) have an exercise price equal to the fair market value per share of our common stock on the date of grant as determined by an independent valuation by a qualified appraiser, (iii) have a term of 10 years, (iv) vest and become exercisable pursuant to the terms set forth in the grantees stock option agreement, (v) be subject to the exercise, forfeiture and termination provisions set forth in the 2018 Plan and (vi) otherwise be evidenced by and subject to the terms of our standard form of stock option agreement. We initially reserved 2,000,000 shares of our common stock for issuance in connection with awards under the plan. On September 15, 2020 and March 18, 2021, our board of directors unanimously resolved to amend the 2018 Plan to increase the number of shares of our common stock available for grant to 4,000,000 shares and 6,000,000 shares, respectively. As of March 31, 2021 there were 502,430 shares of our common stock available for grant pursuant to the 2018 Plan. As of the date of the filing of this Annual Report on Form 10-K, we had not yet solicited votes from our stockholders to approve the increase in the number of shares of our common stock available for grant pursuant to the 2018 Plan.\nStock Option Re-Pricing\nOn August 8, 2018, our Board of Directors approved the grant of service-based options to purchase 500,000 shares of our common stock to Mr. Bennett J. Yankowitz, our chief financial officer and a director, pursuant to an exemption under Section 4(a)(2) of the Securities Act of 1933, as amended. Pursuant to the terms of the option agreement, these options are exercisable immediately on the date of grant at an exercise price of $3.00 per share and are exercisable for a term of 10 years from the date of grant. In determining the fair value of the stock option, we used the Black-Scholes pricing model having the following assumptions: i) stock option exercise price of $3.00; ii) fair market value of our common stock of $4.00, which was based on available valuation factors made available to us during the period from the date of grant through the end of our fiscal quarter ended September 30, 2018; iii) expected term of option of 7 years; iv) expected volatility of our common stock of approximately 40%; v) expected dividend rate of 0.0%; and vi) risk-free interest rate of approximately 2.80%. As a result, we recorded stock-based compensation of $1,100,350 during the fiscal year ended March 31, 2019.\nOn March 18, 2021, our Board of Directors approved the re-pricing of the exercise price of these shares from $3.00 per share to $1.08 per share. The exercise price of $1.08 per share was based on a valuation report prepared in accordance with Financial Accounting Standards Board (“FASB”) Accounting Standards Codification (“ASC”) 718 - Stock Compensation (“ASC 718”) by an independent appraiser as of November 12, 2020. All other terms of this stock option grant were unchanged. As a result, we recorded an additional $489,064 of stock-based compensation during the fiscal year ended March 31, 2021. As of March 31, 2021, total amortized stock-based compensation in connection with this stock option was $1,589,414 and is recorded in additional paid-in capital.\nService-Based Stock Option Grants\nIn addition to the service-based option granted to Mr. Yankowitz in August 2018 exercisable into a total of 500,000 shares of our common stock, we also granted service-based options, pursuant to the 2018 Plan, exercisable into a total of 4,397,570 of our common stock service-based options pursuant to our employees during the fiscal year ended March 31, 2021.\nIn determining the fair value of the service-based options granted during the fiscal year ended March 31, 2021, we utilized the Black-Scholes pricing model utilizing the following assumptions:\nSchedule of Share-based Payment Award, Stock Options, Valuation Assumptions\nService-Based Options\nOption exercise price per share $1.08-$1.32\nGrant date fair market value per share $1.08 - $1.96\nExpected term of option in years 6.25\nExpected volatility 85.0% to 214.5 %\nExpected dividend rate 0.00 %\nRisk free interest rate 0.42% to 0.84 %\nROCKETFUEL BLOCKCHAIN, INC.\nNOTES TO FINANCIAL STATEMENTS\nMARCH 31, 2021\nActivity under the 2018 Plan for all service-based stock options for the fiscal year ended March 31, 2021 and 2020 are as follows:\nSchedule of Stock Option Activity\nOptions\nOutstanding\nWeighted-\nAverage Exercise\nPrice per Share\nWeighted-\nAverage\nRemaining\nContractual\nTerm in Years\nAggregate\nIntrinsic Value\nOptions outstanding as of April 1, 2019 500,000 $ 1.08 9.33 $ 120,000\nGranted - -\nExercised - -\nCancelled or forfeited - -\nOptions outstanding as of March 31, 2020 500,000 $ 1.08 8.33 $ 120,000\nOptions outstanding as of March 31, 2020 500,000 $ 1.08 8.33 $ 120,000\nGranted 4,397,770 $ 1.08\nExercised - -\nCancelled or forfeited - -\nOptions outstanding as of March 31, 2021 4,897,770 $ 1.08 9.63 $ 1,175,417\nOptions exercisable as of March 31, 2021 992,641 $ 1.08 9.63 $ 258,811\nOptions vested or expected to vest as of March 31, 2021 992,641 $ 1.08 9.63 $ 258,811\nThe aggregate intrinsic value in the table above represents the total pre-tax intrinsic value (the difference between the closing price of the common stock on March 31, 2021 of $1.32 and the exercise price of each in-the-money option) that would have been received by the option holders had all option holders exercised their options on March 31, 2021. There were no service-based stock options exercised under the 2018 Plan for the fiscal years ended March 31, 2021 and 2020.\nFor the fiscal years ended March 31, 2021 and 2020, we recorded stock-based compensation expense for service-based stock options pursuant to the 2018 Plan in the amount of $1,023,672, inclusive of the additional stock-based compensation of $489,064 recorded in connection with the re-pricing of Mr. Yankowitz’ August 8, 20128 stock option, and $0, respectively. As of March 31, 2021, we had $4,069,865 of unrecognized stock-based compensation cost related to service-based stock options.\nPerformance-Based Stock Option Grants\nWe also granted performance-based options pursuant to the 2018 Plan to Mr. Hall which are exercisable into 600,000 shares of our common stock subject to certain designated milestones. On March 18, 2021, our Board of Directors determined that Mr. Hall earned all of the performance-based options effective February 1, 2021. The Board of Directors also entered into a resolution whereby 75,000 shares of our common stock underlying the performance-based options would vest immediately and 525,000 shares of our common stock underlying the performance-based option would vest ratably over a 48 month period with the first vesting date being February 1, 2021.\nIn determining the fair value of the performance-based options granted Mr. Hall on September 14, 2020 and earned effective February 1, 2021, we utilized the Black-Scholes pricing model utilizing the following assumptions:\nSchedule of Share-based Payment Award, Stock Options, Valuation Assumptions\nPerformance\n-Based Options\nOption exercise price per share $ 1.08\nGrant date fair market value per share $ 1.08\nExpected term of option in years 6.25\nExpected volatility 85.0 %\nExpected dividend rate 0.00 %\nRisk free interest rate 0.54 %\nROCKETFUEL BLOCKCHAIN, INC.\nNOTES TO FINANCIAL STATEMENTS\nMARCH 31, 2021\nActivity under the 2018 Plan for all performance-based stock options for the fiscal year ended March 31, 2021 is as follows:\nSchedule of Stock Option Activity\nOptions\nOutstanding\nWeighted-Average\nExercise Price per\nShare\nWeighted-Average\nRemaining\nContractual Term\nin Years\nAggregate\nIntrinsic\nValue\nOptions outstanding as of April 1, 2020 - $ - - $ -\nGranted 600,000 1.08\nExercised - -\nCancelled or forfeited - -\nOptions outstanding as of March 31, 2021 600,000 $ 1.08 9.83 $ 144,000\nOptions exercisable as of March 31, 2021 85,938 $ 1.08 9.83 $ 20,625\nOptions vested or expected to vest as of March 31, 2021 85,938 $ 1.08 9.83 $ 20,625\nThe aggregate intrinsic value in the table above represents the total pre-tax intrinsic value (the difference between the closing price of the common stock on March 31, 2021 of $1.32 and the exercise price of each in-the-money option) that would have been received by the option holders had all option holders exercised their options on March 31, 2021. There were no performance-based stock options exercised under the 2018 Plan for the fiscal years ended March 31, 2021.\nFor the fiscal years ended March 31, 2021, we recorded stock-based compensation expense for performance-based stock options pursuant to the 2018 Plan in the amount of $66,531. As of March 31, 2021, we had $397,975 of unrecognized stock-based compensation cost related to performance-based stock options. There was no performance-based stock option activity during the fiscal year ended March 31, 2020.\nCEO Warrant\nOn February 15, 2021, we issued a warrant to purchase 265,982 shares of our common stock to our chief executive officer at an exercise price of $1.00 per share. Pursuant to the terms of the agreement, this warrant was exercisable immediately on the date of issuance and have a term of 10 years from the date of issuance. In determining the fair value of the warrant, we used the Black-Scholes pricing model having the following assumptions: i) warrant exercise price of $1.00; ii) fair market value of our common stock of $1.4, which was based on the closing price as quoted by OTC Markets on the date of issuance; iii) expected term of option of 6.25 years; iv) expected volatility of our common stock of approximately 214.4%; v) expected dividend rate of 0.0%; and vi) risk-free interest rate of approximately 0.54%. As a result, we recorded stock-based compensation of $370,131 during the fiscal year ended March 31, 2021.\n9. Employment Agreements\nGert Funk\nMr. Funk has received a grant of options to purchase 500,000 shares of our Common Stock. The options will be issued under our 2018 Plan. The options will (i) be incentive stock options, (ii) have an exercise price equal to $1.08 per share, which is the fair market value per share of our Common Stock on March 15, 2021, as determined by an independent valuation by a qualified appraiser, (iii) have a term of 10 years, (iv) vest and become exercisable as to 1/48th of the shares subject to the options on the 15th day of each calendar month during the term of his employment agreement, commencing on April 15, 2021, (v) be subject to the exercise, forfeiture and termination provisions set forth in the Plan and (vi) otherwise be evidenced by and subject to the terms of our standard form of stock option agreement.\nROCKETFUEL BLOCKCHAIN, INC.\nNOTES TO FINANCIAL STATEMENTS\nMARCH 31, 2021\nHe will also receive a cash bonus equal to 2.5% of the net proceeds (i.e., adjusted for our costs) of any initial exchange offering (IEO), token generation event (TGE) or similar financing (a “Token Transaction”) completed on or before the date that is 12 months after the formal acceptance by the Board of a proposal for a Token Transaction (start date, milestones, responsibilities). In the event the Board decides to cancel the Token Transaction, Mr. Funk and the Board shall agree upon a mutually acceptable bonus structure in lieu of the foregoing.\nPeter M. Jensen\nMr. Jensen’s employment agreement initially provided for a base salary of $7,500 per month, which was to increase to $20,000 per month once we had received gross proceeds of at least $2,000,000 in subsequent equity round financings. Our Board determined that the conditions for the salary increase occurred on February 1, 2021. He is also entitled to a performance bonus of $25,000 per calendar quarter based on his achieving quarterly financial and business objectives and milestones to be determined by our board of directors. During the fiscal year ended March 31, 2021, we recorded bonus expense for Mr. Jensen in the amount of $37,500 of which $12,500 was paid in March 2021. As of March 31, 2021 we recorded bonus payable to Mr. Jensen in the amount of $25,000 which is included in accounts payable and accrued expense in the balance sheet.\nMr. Jensen also received a grant of options to purchase 2,393,842 shares of our Common Stock. The options will be issued under our 2018 Plan. The options will (i) be incentive stock options, (ii) have an exercise price equal to $1.08 per share, which is the fair market value per share of our Common Stock on September 15, 2020, as determined by an independent valuation by a qualified appraiser, (iii) have a term of 10 years, (iv) vest and become exercisable as to 1/48th of the shares subject to the options on the 15th day of each calendar month during the term of his employment agreement, commencing on October 15, 2020, (v) be subject to the exercise, forfeiture and termination provisions set forth in the Plan and (vi) otherwise be evidenced by and subject to the terms of our standard form of stock option agreement.\nBennett Yankowitz\nMr. Yankowitz’s employment agreement provides for a base salary of $5,833 per month on the basis of a commitment of 20 hours per week. He is also entitled to a performance bonus of $7,500 per calendar quarter based on his achieving quarterly business objectives and milestones. In March 2021 he also received a grant of options to purchase 500,000 shares of our Common Stock. The options will be issued under our 2018 Plan. The options will (i) be incentive stock options, (ii) have an exercise price equal $1.08 per share, which is the fair market value per share of our Common Stock on March 1, 2001, as determined by an independent valuation by a qualified appraiser, (iii) have a term of 10 years, (iv) vest and become exercisable as to 1/48th of the shares subject to the options on the 1st day of each calendar month during the term of his employment agreement, commencing on April 1, 2021, (v) be subject to the exercise, forfeiture and termination provisions set forth in the Plan and (vi) otherwise be evidenced by and subject to the terms of our standard form of stock option agreement. 250,000 of the options will become fully vested and exercisable upon the achievement of business objectives and milestones.\n10. Legal Proceedings\nOther than as set forth below, we are not the subject of any pending legal proceedings; and to the knowledge of management, no proceedings are presently contemplated against us by any federal, state or local governmental agency. Further, to the knowledge of management, no director or executive officer is party to any action in which any has an interest adverse to us.\nOn October 8, 2020, we filed a lawsuit in the U.S. District Court for the Central District of California against Joseph Page, our former director and chief technology officer. On January 13, 2021, the case was transferred to the U.S. District Court for the District of Nevada, Las Vegas Division. The causes of action include securities fraud under Federal and California law; fraud, breach of fiduciary duty, negligent misrepresentation and unjust enrichment under California law; and violation of California Business and Professions Code §17200 et seq.\nROCKETFUEL BLOCKCHAIN, INC.\nNOTES TO FINANCIAL STATEMENTS\nMARCH 31, 2021\nWe are seeking injunctive and declaratory relief as well as damages of at least $5.1 million. On May 29, 2019, Mr. Page resigned from our board. After his resignation, we retained independent patent counsel to review our patent applications. In connection with this review, we discovered certain deficiencies in some of the applications and in their assignments to us. We determined that all of the applications had been abandoned. Based on this review, we decided to refile three of our applications with the U.S. Patent and Trademark Office, which we did in May 2020. It is our belief that the three newly filed patent applications cover and/or disclose the same subject matter as we disclosed in the five original patent applications. In this case, our rights may be subject to any intervening patent applications made after the dates of the original applications. In the lawsuit, we are alleging that Mr. Page was aware of the abandonments when he assigned the patents to RocketFuel Blockchain Company (“RBC”), a private corporation that he controlled, and that he failed to disclose to us the abandonments when we acquired RBC in exchange for shares of our Common Stock. Mr. Page has filed an answer denying our clams and has asserted cross- and counterclaims against us and several of our shareholders alleging breach of contract and fraud. We intend to vigorously contest these allegations.\nOn March 2, 2021, we filed a lawsuit in the U.S. District Court for the Southern District of New York against Ellenhoff Grossman & Schole LLP (“EGS”) for negligence and legal malpractice, breach of contract and breach of fiduciary duty. EGS had represented RBC prior to the Business Combination and represented us after the closing of the Business Combination through August 2019. In the litigation against Mr. Page, he has alleged that he provided information to an EGS partner that the patent applications had been abandoned and that EGS failed to inform RBC and us of the fact. We are seeking damages and the return of legal fees previously paid.\n11. Subsequent Events\nWe evaluated all events or transactions that occurred after the balance sheet date through the date when we issued these financial statements and, other than the issuance of common stock as further described below, we did not have any material recognizable subsequent events during this period.\nOn May 1, 2020, the Company issued a warrant to purchase 1,500,000 shares of Common Stock at $1.00 per share. During the fiscal year ended March 31, 2021, the warrant holder exercised warrants to purchase 1,100,000 shares of our common stock of which (i) 1,000,000 shares of our common stock were issued in consideration of gross proceeds of $1,000,000 prior to March 31, 2021; and (ii) 100,000 shares of our common stock, for which we received notice of exercise on March 31, 2021, were issued subsequent to March 31, 2021 in consideration of gross proceeds of $100,000. During April 2021, the warrant holder exercised the warrant for the remaining 400,000 shares of our common stock in consideration of gross proceeds of $400,000.\nOn May 4, 2021, Triton Funds LP exercised warrants to purchase 50,000 of our common shares for an aggregate purchase price of $82,500.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, as amended, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nRocketFuel Blockchain, Inc.\nBy: /s/ Gert Funk\nGert Funk\nExecutive Chairman and Director\nBy: /s/ Peter M. Jensen\nPeter M. Jensen\nChief Executive Officer and Director\n(Principal Executive Officer)\nBy: /s/ Bennett J. Yankowitz\nBennett J. Yankowitz\nChief Financial Officer and Director\n(Principal Financial and Accounting Officer)\nDated: July 22, 2021"
}