{
    "cik": "829323",
    "company": "Inuvo, Inc.",
    "filing_type": "10-K",
    "filing_date": "2021-02-11",
    "period_of_report": "2020-12-31",
    "sic": "7310",
    "state_of_inc": "NV",
    "state_location": "AR",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/829323/0000829323-21-000010-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/829323/000082932321000010/inuv-20201231.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/829323/0000829323-21-000010.txt",
    "filename": "829323_10K_2020_0000829323-21-000010.htm",
    "item_1": "ITEM 1. BUSINESS.\nCompany Overview\nInuvo is a technology company that develops and sells information technology solutions for marketing. These platforms predictively identify and message online audiences for any product or service across devices, channels and formats, including video, mobile, connected TV, display, social and native. These capabilities allow Inuvo’s clients to engage with their customers and prospects in a manner that drives engagement from the first contact with the consumer. Inuvo facilitates the delivery of hundreds of millions of marketing messages to consumers every single month and counts among its clients numerous world- renowned names in industries that have included retail, automotive, insurance, health care, technology, telecommunications and finance.\nThe Inuvo solution incorporates a proprietary form of artificial intelligence, or AI, branded the IntentKey. This sophisticated machine learning technology uses interactions with Internet content as a source of information from which to predict consumer intent. The AI includes a continually updated database of over 500 million machine profiles which Inuvo utilizes to deliver highly aligned online audiences to its clients. Inuvo earns revenue when consumers view or click on its client’s messages.\nThe Inuvo business scales through account management activity with existing clients and by adding new clients through sales activity.\nAs part of the Inuvo technology strategy, it owns a collection of websites including alot.com and earnspendlive.com, where Inuvo creates content in health, finance, travel, careers, auto, education and living categories. These sites provide the means to test the Inuvo technologies, while also delivering high quality consumers to clients through the interaction with proprietary content in the form of images, videos, slideshows and articles.\nThere are many barriers to entry associated with the Inuvo business model, including a proficiency in large scale information processing, predictive software development, marketing data products, analytics, artificial intelligence, integration to the internet of things (\"IOT\"), and the relationships required to execute within the IOT. Inuvo's intellectual property is protected by 18 issued and seven pending patents.\nProducts and Services\nThe Inuvo platforms allow advertisers and publishers the opportunity to buy and sell advertising space in real time and include the following products and services:\n•ValidClick: A marketing service provided to Yahoo!, Google and other consolidators of advertising demand comprising hundreds of thousands of merchants where a collection of data, analytics and software gets used to align merchant advertising messages with anonymous consumers across various websites online. The service includes Think Relevant, a wholly owned marketing agency and alot.com, a wholly owned collection of websites; and\n•IntentKey: An artificial intelligence based consumer intent recognition system designed to reach highly targeted mobile and desktop In- Market audiences with precision. The platform can serve multiple creative formats including display, video, audio and native across multiple device types including desktop, mobile, tablet, connected/smart TV and game consoles. The product is sold as both a fully managed service and/or a Software as a Service (\"SaaS\") solution.\nKey Relationships\nWe maintain long-standing relationships with Yahoo! and Google who provide access to hundreds of thousands of advertisers from which a majority of our ValidClick revenue originates. When an advertisement is clicked, we effectively sell that click to these partners who then sell it to the advertisers. We maintain multi-year service contracts with these companies. In 2020, these customers accounted for 60.5% of our total revenue as compared to 78.5% in 2019. We also have major contracts with Xandr, Inc. who, in exchange for a fee, provides access to advertisers and publishers for the IntentKey.\nIn addition to our key customer relationships, we maintain important distribution relationships with owners and publishers of websites and mobile applications. We provide these partners with advertisements which they use to monetize their websites and mobile applications. We continuously monitor consumer traffic with a variety of proprietary and patent protected software tools\nthat can determine the quality of the traffic viewing and clicking on Inuvo served advertisements as a part of our service to our biggest clients.\nStrategy\nOur business strategy has been to develop data processing and product technologies that can displace intermediaries within the online advertising ecosystem, while cultivating relationships that can provide access to media spend (advertisers) and media inventory (websites). In this regard, we have proprietary demand (media spend) and supply side (media inventory) technologies, targeting technologies, on-page or in-app ad-unit technologies, proprietary data and data management technologies, and advertising fraud detection technologies. We have both direct and indirect relationships at some of the largest media buyers and/or consolidators in the industry. For the ValidClick platform, the immediate strategy is to maintain the business at current levels by working with existing partners. For the IntentKey platform, the immediate strategy is to scale through the hiring of additional sales professionals, growing existing accounts and expanding the market size by launching a SaaS version of the IntentKey in 2021.\nWe have both direct and indirect relationships at some of the largest media buyers and/or consolidators in the industry. For the ValidClick platform, the immediate strategy is to maintain the business at current levels by working with existing partners where the cash generated from the business can be used to accelerate growth of the IntentKey. For the IntentKey platform, the immediate strategy is to scale through the hiring of additional sales professionals, growing existing accounts and expanding the market size by concurrently selling the SaaS version of the IntentKey beginning in 2021.\nOur business strategy is focused on providing differentiation through the AI analytics and data products we own and protect through patents. For the marketing and advertising industries we serve, this strategy aligns with the components of the value chain that are the principal drivers of value to our clients. As part of our growth strategy, we evaluate acquisition candidates from time to time as opportunities arise with a focus on companies that have either advertisers or advertising relationships we do not possess or publishers or publishing partners who have content we do not possess.\nSales and Marketing\nWe drive general awareness of our brands through various marketing channels including our websites, social media, blogs, public relations, trade shows and conferences. Sales and marketing for our products differs based on whether they are demand or supply facing.\nThe demand side of our business includes sales executives who create interest from agencies, trading desks and brands directly. Leveraging our IntentKey technology to highlight our differentiation, our sales executives explain how we identify the most relevant audiences so we can, on behalf of our clients, target those audiences at a time when they are most prone to engage / respond / subscribe / tune-in or watch our clients' message.\nThe supply side of our business includes sales executives who sell to publishers directly. Creating differentiation, they explain our unique ability to create incremental revenue streams for publishers through our custom placements and unique approach to maximizing yield while preserving user experience.\nBoth demand and supply relationships require account management/campaign management, plus operations teams, who ensure that publisher implementations are successful, advertising campaigns deliver anticipated results and clients’ expectations are exceeded.\nCompetition\nWe face significant competition in our industry. Competitors continue to increase their suite of offerings across marketing channels to better compete for total advertising dollars. There are many barriers to entry to Inuvo’s business that would require proficiency in large scale data center management, software development, data products, analytics, artificial intelligence, integration to the internet of things, or IOT, the relationships required to execute within the IOT and the ability to process tens of billions of transactions daily.\nWe compete, both directly and indirectly with companies who offer demand side platforms (DSP’s), direct marketing platforms (DMP’s), Data Suppliers and Aggregators, Media Planners and various Measurement and Analytics companies. The companies within these categories are defined by LUMA @ https://lumapartners.com/content/lumascapes/display-ad-tech-lumascape.\nOur primary competitive advantages include: patented, proprietary technology for the categorization and storage of consumer intent (data used to discover and match online audiences to product or service); real time visibility of a marketing event (recognizing that there is currently a transaction where a match exists between our advertising clients and an interested party for their product on a website) where our technology is capable of responding to over 200,000 events per second; and patented advertising fraud prevention. Many competitors have greater name recognition and are better capitalized than we are. Our ability to remain competitive in our market segment depends upon our ability to be innovative and to efficiently provide unique solutions to our demand and supply customers. There are no assurances we will be able to remain competitive in our markets in the future.\nTechnology Platforms\nOur proprietary applications are constructed from established, readily available technologies. Some of the basic elements of our products are built on components from leading software and hardware providers such as Oracle, Microsoft, Sun, Dell, EMC, and Cisco, while some components are constructed from leading open-source software projects such as Apache Web Server, Apache Spark, HAProxy, MySQL, Java, Perl, and Linux. By seeking to strike the proper balance between using commercially available software and open-source software, our technology expenditures are directed toward maintaining our technology platforms while minimizing third-party technology supplier costs.\nWe strive to build high-performance, availability and reliability into our product offerings. We safeguard against the potential for service interruptions at our third-party technology vendors by engineering controls into our critical components. We deliver our hosted solutions from facilities, geographically disbursed throughout the United States and maintain ready, on-demand services through third-party cloud providers Microsoft Azure and Amazon Web Services to enhance our business continuity. Our applications are monitored 24 hours a day, 365 days a year by specialized monitoring systems that aggregate alarms to a human-staffed network operations center. If a problem occurs, appropriate engineers are notified, and corrective action is taken.\nIntellectual Property Rights\nWe own intellectual property (IP) and related IP rights that relate to our products, services and assets. Our IP portfolio includes patents, trade secrets and trademarks. We actively seek to protect our IP rights and to deter unauthorized use of our IP and other assets. While our IP rights are important to our success, our business as a whole is not significantly dependent on any single patent, trademark, or other IP right.\nOur trademarks include the U.S. Federal Registration for our consumer facing brand ALOT® in the United States. Our intellectual property portfolio includes 18 patents issued by the United States Patent and Trademark Office (“USPTO”) and seven pending patent applications.\nTo distinguish our products and services from our competitors’ products, we have obtained trademarks and trade names for our products. We also protect details about our processes, products, and strategies as trade secrets, keeping confidential the information that we believe provides us with a competitive advantage.\nEmployees\nAs of January 31, 2021, we had 71 full-time employees, none of which are covered by a collective bargaining agreement.\nSeasonality\nOur future results of operations may be subject to fluctuation because of seasonality. Historically, the second half of the year is typically stronger than the first half as a result of the changes in demand for marketing placements leading into the holiday season. If we are not able to appropriately adjust to seasonal or other factors, it could have a material adverse effect on our financial results.\nHistory\nThe business was incorporated under the laws of the state of Nevada in October 1987 and originally operated within the oil and gas industry. This endeavor was not profitable, and as a result from 1993 to 1997 the Company had essentially no operations. In 1997, the business was reorganized and through 2006 a number of companies were acquired from within the advertising and internet marketing industry. In 2009, following the weakness in the economy, a new team was called in to assess the array of businesses that had been acquired in the preceding years and as a result between 2009 and 2011, that team sold and/or retired eleven businesses as a part of the restructure.\nIn March 2012, as part of a longer-term strategy, the Company acquired Vertro, Inc., which owned and operated the ALOT product portfolio. That acquisition included the ALOT brand, as well as a long-standing relationship with Google. In 2013, with a grant funded by the State of Arkansas, the Company moved its headquarters to Arkansas where we have remained.\nIn February 2017, the Company entered into an asset purchase agreement with NetSeer, Inc. which advanced the Company's technology strategy while also increasing the number of advertiser and publisher relationships. We exchanged 3,529,000 shares of Inuvo common stock and assumed approximately $6.8 million of specified liabilities in this business combination.\nMore Information\nOur website address is www.inuvo.com. We file with, or furnish to, the Securities and Exchange Commission (the \"SEC\") annual reports on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K, and amendments to those reports, as well as various other information. This information can be found on the SEC website at www.sec.gov. In addition, we make available free of charge through the Investor Relations page of our website our annual reports, quarterly reports, and current reports, and all amendments to any of those reports, as soon as reasonably practicable after providing such reports to the SEC.",
    "item_1A": "ITEM 1A. RISK FACTORS.\nAn investment in our common stock involves a significant degree of risk. Many of the risk factors are, and will continue to be, exacerbated by the COVID-19 pandemic and any worsening of the economic environment. You should not invest in our common stock unless you can afford to lose your entire investment. You should consider carefully the following risk factors and other information in this report before deciding to invest in our common stock. If any of the following risks and uncertainties develops into actual events, our business, financial condition or results of operations could be materially adversely affected and you could lose your entire investment in our Company.\nWe have a history of losses, and our revenues declined in 2020 from 2019. We cannot anticipate with any degree of certainty what our revenues will be in future periods. While our gross profit margin increased to 81.4% in 2020 from 63.1% in 2019, our revenues declined approximately 27% in 2020 as compared to 2019. We reported an operating loss of approximately $8,048,581 million in 2020 as compared to an operating loss of approximately $7,738,193 million in 2019. The lower revenue in 2020 as compared to 2019 was due primarily to the ValidClick operations where monetization from advertising inventory sold to our largest demand partners was lower in 2020 in part due to the COVID-19 pandemic. The higher gross margin in 2020 was primarily due to the change of revenue mix within the ValidClick business. Since our credit facility is dependent upon receivables, and we do not know when, if ever, that our revenues will return to historic levels or if we will be able to replace those lost revenues with revenues from other sources, the combination of lower credit availability and recent negative cash flows generated from operating activities introduces potential risk of an interruption to operating activities.\nThe COVID-19 pandemic could have a material adverse impact on our business, results of operations and financial condition. In December 2019, a novel strain of coronavirus disease (“COVID-19”) was first reported in Wuhan, China. Less than four months later, on March 11, 2020, the World Health Organization declared COVID-19 a pandemic-the first pandemic caused by a coronavirus. The outbreak has resulted in the implementation of significant governmental measures, including lockdowns, closures, quarantines and travel bans, intended to control the spread of the virus. The COVID-19 outbreak has already caused severe global disruptions. Beginning in late April 2020, we experienced a significant reduction in demand (marketing budgets) within the ValidClick platform and a modest decline in demand within the IntentKey platform, the combination of which has resulted in a significant reduction in our revenue run rate. Generally, marketing budgets tend to decline in times of a recession. We have curtailed expenses, including compensation and travel and we have issued a work from home policy to protect our employees and their families from virus transmission associated with co-workers. We began to experience interruptions in our daily operations, as a result of these policies. The revenue impact on our industry could vary dramatically by vertical. For example, we experienced less advertising demand from the travel, leisure and hospitality verticals. We also maintain long-standing relationships with Yahoo! and Google that provide access to hundreds of thousands of advertisers from which most of our ValidClick and digital publishing revenue originates. Any adverse impact on the operations of those companies would have a correspondingly adverse impact on our revenues in future periods. We will continue to assess the impact of the COVID-19 pandemic on our Company, however, at this time we are unable to predict all possible impacts on our Company, operations and revenues. Should revenues continue to turn downwards or fail to return to historical levels, we may not be able to offset expenses quickly enough which could have a material adverse effect on our business, results of operations, financial condition and cash flows and adversely impact the trading price of our common stock.\nWe rely on two customers for a significant portion of our revenues. We are reliant upon Yahoo! and Google for most of our revenue. During 2020 they accounted for 33.3%, and 27.2% of our revenues, respectively. In 2019, Yahoo! and Google accounted for 64.4% and 14.1% of our revenues, respectively. The amount of revenue we receive from these customers is\ndependent on a number of factors outside of our control, including the amount they charge for advertisements, the depth of advertisements available from them, and their ability to display relevant ads in response to end-user queries. We would likely experience a significant decline in revenue and our business operations could be significantly harmed if these customers do not approve our new websites and applications, or if we violate their guidelines or they change their guidelines. In addition, if any of these preceding circumstances were to occur, we may not be able to find a suitable alternate paid search results provider or otherwise replace the lost revenues. The loss of any of these customers or a material change in the revenue or gross profit they generate would have a material adverse impact on our business, results of operations and financial condition in future periods.\nAbility to maintain our credit facility could impact our ability to access capital in the future. On March 12, 2020 we closed a Loan and Security Agreement with Hitachi Capital America Corp. (\"Hitachi\") the terms of which are described in this report which replaced our credit facility with Western Alliance Bank. Under the terms of the Loan and Security Agreement, Hitachi has provided us with a $5,000,000 line of credit commitment which permits us to borrow against eligible accounts receivable and unbilled receivables. The Hitachi Loan and Security Agreement contains certain affirmative and negative covenants to which we are subject. As of December 31, 2020, we were in compliance or obtained a waiver for these covenants. There are no assurances that we will be able to comply with all the covenants. In the event we violate a covenant, Hitachi may limit or demand all amounts due under the credit facility at any time, including upon an event of default outstanding, if any, to be due and payable. If this occurs and if we have outstanding obligations and are not able to repay, Hitachi could require us to apply all of our available cash to repay the debt amounts and could then proceed against the underlying collateral. Should this occur, we cannot assure you that our assets would be sufficient to repay our debt in full, we would be able to borrow sufficient funds to refinance the debt. In such an event, our ability to conduct our business as it is currently conducted would be in jeopardy.\nWe are dependent upon relationships with and the success of our supply partners. Our supply partners are very important to our success. We must recruit and maintain partners who are able to drive traffic successfully to their websites and mobile applications, resulting in clicks on advertisements we have delivered. These partners may experience difficulty in attracting and maintaining users for a number of reasons, including competition, rapidly changing markets and technology, industry consolidation and changing consumer preferences. We have experienced a decrease in the number of supply partners and quantity of Internet traffic from supply partners within ValidClick beginning in late April 2020. Additionally, we are experiencing turnover in our supply partner network and there can be no assurance traffic levels will increase to prior levels or that we will be able to replace supply partners that have left our network. Further, we may not be able to further develop and maintain relationships with distribution partners. They may be able to make their own deals directly with advertisers, may view us as competitors or may find our competitors offerings more desirable. Any of these potential events could have a material adverse effect on our business, financial position and results of operations.\nThe success of our owned sites is dependent on our ability to acquire traffic in a profitable manner. Our ALOT-branded websites are dependent on our ability to attract traffic in a profitable manner. We use a predictive model to calculate the rate of return for marketing campaigns, which includes estimates and assumptions. If these estimates and assumptions are not accurate, we may not be able to effectively manage our marketing decisions and could acquire traffic in an unprofitable manner. In addition, we may not be able to maintain and grow our traffic for a number of reasons, including, but not limited to, acceptance of our websites by consumers, the availability of advertising to promote our websites, competition, and sufficiency of capital to purchase advertising. We advertise on search engine websites to drive traffic to our owned and operated websites. Our keyword advertising is done primarily with Google and Facebook, but also with Yahoo!. If we are unable to maintain and grow traffic to our sites in a profitable manner, it could have a material adverse effect on our business, financial condition, and results of operations.\nOur business must keep pace with rapid technological change to remain competitive. Our business operates in a market characterized by rapidly changing technology, evolving industry standards, frequent new product and service announcements, enhancements, and changing customer demands. We must adapt to rapidly changing technologies and industry standards and continually improve the speed, performance, features, ease of use and reliability of our services. This includes making our products and services compatible and maintaining compatibility with multiple operating systems, desktop and mobile devices, and evolving network infrastructure. If we fail to do this, our results of operations and financial position could be adversely affected.\nOur services may be interrupted if we experience problems with our network infrastructure. The performance of our network infrastructure is critical to our business and reputation. Because our services are delivered solely through the Internet, our network infrastructure could be disrupted by a number of factors, including, but not limited to:\n•unexpected increases in usage of our services;\n•computer viruses and other security issues;\n•interruption or other loss of connectivity provided by third-party Internet service providers;\n•natural disasters or other catastrophic events; and\n•server failures or other hardware problems.\nWhile we have data centers in multiple, geographically dispersed locations and active back-up and disaster recovery plans, we cannot assure you that serious interruptions will not occur in the future. If our services were to be interrupted, it could cause loss of users, customers and business partners, which could have a material adverse effect on our results of operations and financial position.\nRegulatory and legal uncertainties could harm our business. While there are currently relatively few laws or regulations directly applicable to Internet-based commerce or commercial search activity, there is increasing awareness of such activity and interest from state and federal lawmakers in regulating these services. New regulation of activities in which we are involved or the extension of existing laws and regulations to Internet-based services could have a material adverse effect on our business, results of operations and financial position.\nFailure to comply with federal, state and international privacy and data security laws and regulations, or the expansion of current or the enactment of new privacy and data security laws or regulations, could adversely affect our business. A variety of federal, state and international laws and regulations govern the collection, use, retention, sharing and security of consumer data. In addition, various federal, state and foreign legislative and regulatory bodies may expand current or enact new laws regarding privacy matters. For example, recently there have been Congressional hearings and increased attention to the capture and use of location-based information relating to users of smartphones and other mobile devices, and internationally the European Union’s General Data Protection Regulation (GDPR) went into effect in May 2018. We have posted privacy policies and practices concerning the collection, use and disclosure of subscriber data on our websites and applications. The existing and soon to be enacted privacy and data security related laws and regulations are evolving and subject to potentially differing interpretations. Several Internet companies have incurred penalties for failing to abide by the representations made in their privacy policies and practices. In addition, several states have adopted legislation that requires businesses to implement and maintain reasonable security procedures and practices to protect sensitive personal information and to provide notice to consumers in the event of a security breach. Any failure, or perceived failure, by us to comply with our posted privacy policies or with any data-related consent orders, Federal Trade Commission requirements or orders or other federal, state or international privacy or consumer protection-related laws, including the GDPR, regulations or industry self-regulatory principles could result in claims, proceedings or actions against us by governmental entities or others or other liabilities, which could adversely affect our business.\nWe may face third party intellectual property infringement claims that could be costly to defend and result in the loss of significant rights. From time to time third parties have asserted infringement claims against us including copyright, trademark and patent infringement, among other things. While we believe that we have defenses to these types of claims under appropriate intellectual property laws, we may not prevail in our defenses to any intellectual property infringement claims. In addition, we may not be adequately insured for any judgments awarded in connection with any litigation. Any such claims and resulting litigation could subject us to significant liability for damages or result in the invalidation of our proprietary rights, which would have a material adverse effect on our business, financial condition, and results of operations. Even if we were to prevail, these claims could be time-consuming, expensive to defend, and could result in the diversion of management's time and attention.\nWe are subject to risks from publishers who could fabricate clicks either manually or technologically. Our business involves the establishment of relationships with website owners and publishers. In exchange for their consumer traffic, we provide an advertising placement service and share a portion of the revenue we collect with that website publisher. Although we have click fraud detection software in place, we cannot guarantee that we will identify all fraudulent clicks or be able to recover funds distributed for fabricated clicks. This risk could materially impact our ability to borrow, our cash flow and the stability of our business.\nOur business is seasonal and our financial results may vary significantly from period to period. Our future results of operations may vary significantly from quarter to quarter and year to year because of numerous factors, including seasonality. Historically, in the later part of the fourth quarter and the earlier part of the first quarter we experience lower Revenue Per Click (“RPC”) due to a decline in demand for inventory on website and app space and the recalibrating of advertiser’s marketing budgets after the holiday selling season. If we are not able to appropriately adjust to seasonal or other factors, it could have a material adverse effect on our financial results.\nFailure to comply with the covenants and restrictions in our grant agreement with the State of Arkansas could result in the repayment of a portion of the grant, which we may not be able to repay or finance on favorable terms. In January 2013, we entered into an agreement with the State of Arkansas whereby we were granted $1,750,000 for the relocation of the Company to Arkansas and for the purchase of equipment. The grant was contingent upon us having at least 50 full-time equivalent permanent positions within four years, maintaining at least 50 full-time equivalent permanent positions for the following six years and paying those positions an average total compensation of $90,000 per year. As of December 31, 2020, we had 38 full-time employees located in Arkansas. Failure to meet the requirements of the grant after the initial four-year period, may require\nus to repay a portion of the grant, up to but not to exceed the full amount of the grant. At December 31, 2020, we accrued a contingent liability of $60,000 for the lower than required employment.\nWe are subject to the continued listing standards of the NYSE American and our failure to satisfy these criteria may result in delisting of our common stock. Our common stock is listed on the NYSE American. In order to maintain this listing, we must maintain a certain share price, financial and share distribution targets, including maintaining a minimum amount of shareholders’ equity and a minimum number of public shareholders. In addition to these objective standards, the NYSE American may delist the securities of any issuer (i) if, in its opinion, the issuer’s financial condition and/or operating results appear unsatisfactory; (ii) if it appears that the extent of public distribution or the aggregate market value of the security has become so reduced as to make continued listing on the NYSE American inadvisable; (iii) if the issuer sells or disposes of principal operating assets or ceases to be an operating company; (iv) if an issuer fails to comply with the NYSE American’s listing requirements; (v) if an issuer’s securities sell at what the NYSE American considers a “low selling price” which the exchange generally considers $0.20 per share and the issuer fails to correct this via a reverse split of shares after notification by the NYSE American; or (vi) if any other event occurs or any condition exists which makes continued listing on the NYSE American, in its opinion, inadvisable. There are no assurances how the market price of our common stock will be impacted in future periods as a result of the general uncertainties in the capital markets and any specific impact on our Company as a result of the coronavirus. If the NYSE American delists our common stock, investors may face material adverse consequences, including, but not limited to, a lack of trading market for our common stock, reduced liquidity, decreased analyst coverage of our common stock, and an inability for us to obtain any additional financing to fund our operations that we may need.\nOur quarterly operating results can be difficult to predict and can fluctuate substantially, which could result in volatility in the price of our common stock. Our quarterly revenues and other operating results have varied in the past and are likely to continue to vary significantly from quarter to quarter. Our agreements with distribution partners and key customers do not require minimum levels of usage or payments, and our revenues therefore fluctuate based on the actual usage of our service each quarter by existing and new distribution partners. In addition to the impact of the COVID-19 pandemic on our revenues, quarterly fluctuations in our operating results also might be due to numerous other factors, including:\n•our ability to attract new distribution partners, including the length of our sales cycles, or to sell increased usage of our service to existing distribution partners;\n•technical difficulties or interruptions in our services;\n•changes in privacy protection and other governmental regulations applicable to our industry;\n•changes in our pricing policies or the pricing policies of our competitors;\n•the financial condition and business success of our distribution partners;\n•purchasing and budgeting cycles of our distribution partners;\n•acquisitions of businesses and products by us or our competitors;\n•competition, including entry into the market by new competitors or new offerings by existing competitors;\n•discounts offered to advertisers by upstream advertising networks;\n•our history of litigation;\n•our ability to hire, train and retain sufficient sales, client management and other personnel;\n•timing of development, introduction and market acceptance of new services or service enhancements by us or our competitors;\n•concentration of marketing expenses for activities such as trade shows and advertising campaigns;\n•expenses related to any new or expanded data centers; and\n•general economic and financial market conditions.\nSignificant dilution will occur when outstanding restricted stock unit grants vest. As of December 31, 2020, we had 1,930,526 restricted stock units outstanding. If the restricted stock units vest, dilution will occur to our stockholders, which may be significant.\nOur financial condition may be adversely affected if we are unable to identify and complete future acquisitions, fail to successfully integrate acquired assets or businesses, or are unable to obtain financing for acquisitions on acceptable terms. The acquisition of assets or businesses that we believe to be complementary to our business is an important component of our strategy. We believe that acquisition opportunities may arise from time to time, and that any such acquisitions could be significant. At any given time, discussions with one or more potential sellers may be at different stages. However, any such discussions may not result in the consummation of an acquisition transaction, and we may not be able to identify or complete any acquisitions. We cannot predict the effect, if any, that any announcement or consummation of an acquisition would have on the trading price of our ordinary shares. Our business is capital intensive and any such transactions could involve the payment by us of a substantial amount of cash and/or equity securities. We may need to raise additional capital through public or private debt or equity financings to execute our growth strategy and to fund acquisitions. Adequate sources of capital may not be available when needed on favorable terms. If we raise additional capital by issuing additional equity securities or use equity securities for acquisitions, existing shareholders may be diluted. If our capital resources are insufficient at any time in the\nfuture, we may be unable to fund acquisitions, take advantage of business opportunities or respond to competitive pressures, any of which could harm our business. Any usage of capital to fund an acquisition could lead to a decrease in liquidity.\nAny future acquisitions could present a number of risks, including:\n•the risk of using management time and resources to pursue acquisitions that are not successfully completed;\n•the risk of incorrect assumptions regarding the future results of acquired operations;\n•the risk that the amount and timing of the expected benefits of any acquisition, including potential synergies, are subject to uncertainties;\n•the risk of unexpected losses of key employees, customers and suppliers of the acquired business;\n•the risk of increasing the scope, geographic diversity, and complexity of our business;\n•the risk of unfavorable accounting treatment and unexpected increases in taxes;\n•the risk of difficulty in conforming standards, controls, procedures, policies, business cultures, and compensation structures;\n•the risk of failing to integrate the operations or management of any acquired operations or assets successfully and in a timely manner; and\n•the risk of diversion of management’s attention from existing operations or other priorities.\nIf we are unsuccessful in completing acquisitions of other operations or assets, our financial condition could be adversely affected and we may be unable to implement an important component of our business strategy successfully. In addition, if we are unsuccessful in integrating our acquisitions in a timely and cost-effective manner, our financial condition and results of operations could be adversely affected.",
    "item_1B": "ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNot applicable to a smaller reporting company.",
    "item_2": "ITEM 2. PROPERTIES.\nOur corporate headquarters are located in Little Rock, Arkansas where we entered into a five-year agreement to lease office space on October 1, 2015 and amended the lease as of February 1, 2021. The amended lease is for 7,831 square feet and expires on January 31, 2024. We also have office space in San Jose, CA where in June 2017, we entered into a five-year agreement to lease 4,801 square feet of office space. In July 2020, the lease was amended and renewed for an additional three years.\nIn addition to our office space, we maintain data center operations in third-party collocation facilities in Little Rock, AR, Los Angeles, CA, San Jose, CA and Secaucus, NJ.",
    "item_3": "ITEM 3. LEGAL PROCEEDINGS.\nWe are not party to any pending legal proceedings.",
    "item_4": "ITEM 4. MINE SAFETY DISCLOSURES.\nNot applicable.\nPART II",
    "item_5": "ITEM 5. MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nMarket Information\nOur common stock is listed on the NYSE American LLC under the symbol \"INUV.” As of February 5, 2021, there were approximately 421 record owners of our common stock. This amount does not reflect persons or entities that hold our common stock in nominee or “street” name through various brokerage firms.\nDividends\nWe have not declared or paid cash dividends on our common stock since our inception. Under Nevada law, we are prohibited from paying dividends if the distribution would result in our Company not being able to pay its debts as they become due in the normal course of business if our total assets would be less than the sum of our total liabilities plus the amount that would be needed to pay the dividends, or if we were to be dissolved at the time of distribution to satisfy the preferential rights upon dissolution of stockholders whose preferential rights are superior to those receiving the distribution. Our board of directors has complete discretion on whether to pay dividends subject to compliance with applicable Nevada law. Even if our board of directors decides to pay dividends, the form, the frequency, and the amount will depend upon our future operations and earnings, capital requirements and surplus, general financial condition, contractual restrictions and other factors that the board of directors may deem relevant. While our board of directors will make any future decisions regarding dividends, as circumstances surrounding us change, it currently does not anticipate that we will pay any cash dividends in the foreseeable future.\nRecent Sales of Unregistered Securities\nNone, except as previously reported.\nRepurchases of Equity Securities by the Issuer and Affiliated Purchasers\nNone",
    "item_6": "ITEM 6. SELECTED FINANCIAL DATA.\nNot applicable to a smaller reporting company.",
    "item_7": "ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion of our financial condition and results of operations for 2020 and 2019 should be read in conjunction with the consolidated financial statements and the notes to those statements that are included elsewhere in this report. Our discussion includes forward-looking statements based upon current expectations that involve risks and uncertainties, such as our plans, objectives, expectations and intentions. Actual results and the timing of events could differ materially from those anticipated in these forward-looking statements as a result of a number of factors, including those set forth under Cautionary Statements Regarding Forward-Looking Information, Part I. Item 1. Business and Item 1A. Risk Factors. We use words such as \"anticipate,\" \"estimate,\" \"plan,\" \"project,\" \"continuing,\" \"ongoing,\" \"expect,\" \"believe,\" \"intend,\" \"may,\" \"will,\" \"should,\" \"could,\" and similar expressions to identify forward-looking statements.\nCompany Overview\nInuvo is a technology company that develops and sells information technology solutions for marketing. These platforms predictively identify and message online audiences for any product or service across devices, channels and formats, including video, mobile, connected TV, display, social and native. These capabilities allow Inuvo's clients to engage with their customers and prospects in a manner that drives engagement from the first contact with the consumer. Inuvo facilitates the delivery of hundreds of millions of marketing messages to consumers every single month and counts among its clients, numerous world- renowned names in industries that have included retail, automotive, insurance, health care, technology, telecommunications and finance.\nThe Inuvo solution incorporates a proprietary form of artificial intelligence, or AI, branded the IntentKey. This sophisticated machine learning technology uses interactions with Internet content as a source of information from which to predict consumer intent. The AI includes a continually updated database of over 500 million machine profiles which Inuvo utilizes to deliver highly aligned online audiences to its clients. Inuvo earns revenue when consumers view or click on its client’s messages.\nThe Inuvo business scales through account management activity with existing clients and by adding new clients through sales activity.\nAs part of the Inuvo technology strategy, it owns a collection of websites including alot.com and earnspendlive.com, where Inuvo creates content in health, finance, travel, careers, auto, education and living categories. These sites provide the means to test the Inuvo technologies, while also delivering high quality consumers to clients through the interaction with proprietary content in the form of images, videos, slideshows and articles.\nThere are many barriers to entry associated with the Inuvo business model, including a proficiency in large scale information processing, predictive software development, marketing data products, analytics, artificial intelligence, integration to the internet of things (IOT), and the relationships required to execute within the IOT. Inuvo's intellectual property is protected by 18 issued and seven pending patents.\nMergers Termination\nOn June 20, 2019, Inuvo entered into an Agreement and Plan of Merger Termination Agreement (the “Merger Termination Agreement”) with ConversionPoint Technologies Inc., a Delaware corporation (“CPT”), ConversionPoint Holdings, Inc., a Delaware corporation (“Parent”), CPT Merger Sub, Inc., a Delaware corporation, (“CPT Merger Sub”), and CPT Cigar Merger Sub, Inc., a Nevada corporation (“Inuvo Merger Sub”), which, among other things, (1) terminated the Agreement and Plan of Merger, dated November 2, 2018, by and among Inuvo, CPT, Parent, CPT Merger Sub, and Inuvo Merger Sub, as amended (the “Merger Agreement”), pursuant to which Inuvo would have merged with and into Inuvo Merger Sub and become a wholly-owned subsidiary of Parent, and CPT would have merged with and into CPT Merger Sub and become a wholly-owned subsidiary of Parent (the “Mergers”), and (2) terminated each of the Support Agreements that were entered into by certain officers and directors of Inuvo and the parties to the Merger Agreement. The Merger Agreement was terminated as a result of Parent’s inability to fulfill the closing condition of the Mergers that Parent raise $36,000,000 in gross proceeds from an equity, debt, or equity-linked offering of its securities which no longer obligated Inuvo to consummate the Mergers contemplated by the Merger Agreement.\nConcurrently with the execution of the Merger Termination Agreement, CPT Investments, LLC, a California limited liability company and an affiliate of CPT (“CPT Investments”), and Inuvo entered into a certain Inuvo Note Termination Agreement (the “Note Termination Agreement”) and agreed to (1) terminate and cancel the 10% Senior Unsecured Subordinated Convertible Promissory Note, dated November 1, 2018, executed by Inuvo in favor of CPT Investments (the “CPTI Note”), which as of June 20, 2019, had $1,063,288 in accrued principal and interest outstanding (the “Outstanding Indebtedness”) by July 20, 2019, (2) effective immediately, terminate all conversion rights under the CPTI Note to convert amounts outstanding into shares of Inuvo’s common stock, (3) terminate the Securities Purchase Agreement, dated November 1, 2018, by and between Inuvo and CPT Investments (the “Securities Purchase Agreement”), and (4) terminate the Registration Rights Agreement, dated November 1, 2018, by and between Inuvo and CPT Investments.\nThe Merger Termination Agreement provided that the termination fee of $2,800,000 to be paid to Inuvo (the “Termination Fee”) for failure to fulfill the Financing Condition would be satisfied as follows:\n(1) $1,063,288 of the Termination Fee was satisfied in consideration of the termination and cancellation of the Outstanding Indebtedness pursuant to the CPTI Note Termination Agreement that was approved by CPT’s senior lenders Montage Capital II, L.P. and Partners for Growth IV, L.P. and CPT’s issuance of a replacement note to CPT Investments that was entered into in July 2019;\n(2) $1,611,712 of the Termination Fee was satisfied by CPT transferring all of the assets related to CPT’s programmatic and RTB advertising solutions business conducted through managed services and a proprietary SaaS solution (the “ReTargeter Business”), free and clear of all liabilities, encumbrances, or liens, to Inuvo; and\n(3) CPT paid $125,000 to Inuvo on September 15, 2019 to be contributed to the settlement of ongoing litigation with respect to the Mergers.\nOn September 30, 2019, Inuvo paid its obligation of $250,000 under a confidential settlement agreement that it entered into on June 20, 2019 resolving certain outstanding litigation related to the Mergers. Under the Merger Termination Agreement, CPT and Inuvo agreed to mutually release all claims that each party had against the other, as well as certain affiliated entities of each. Inuvo, however, will be able to pursue any claims against CPT and its affiliates for breaches of the Merger Termination Agreement.\nAn independent valuation of the ReTargeter Business was completed as of September 30, 2019. The enterprise valuation of the ReTargeter Business was determined to be $2.57 million.\nHitachi Credit Agreement\nOn March 12, 2020 Inuvo, Inc. closed a Loan and Security Agreement dated February 28, 2020 by and between our Company and our subsidiaries and Hitachi. Under the terms of the Loan and Security Agreement Hitachi has provided us with a $5,000,000 line of credit commitment. We are permitted to borrow (i) 90% of the aggregate Eligible Accounts Receivable, plus\n(i) the lesser of 75% of the aggregate Unbilled Accounts Receivable (as those terms are defined in the Loan and Security Agreement) or 50% of the amount available to borrow under (i), up to the maximum credit commitment. On March 12, 2020 we drew $5,000,000 under this agreement, using $2,959,573 of these proceeds to satisfy our obligations to Western Alliance Bank under our credit agreement with it and the balance was used for working capital at the time. Following the satisfaction of our obligations to Western Alliance Bank, all agreements with that entity were terminated.\nWe will pay Hitachi monthly interest at the rate of 2% in excess of the Wall Street Journal Prime Rate, with a minimum rate of 6.75% per annum, on outstanding amounts. The principal and all accrued but unpaid interest are due on demand. In the event of a default under the terms of the Loan and Security Agreement, the interest rate increases to 6% greater than the interest rate in effect from time to time prior to a default. The Loan and Security Agreement contains certain affirmative and negative covenants to which we are also subject.\nWe agreed to pay Hitachi a commitment fee of $50,000, with one half due upon the execution of the agreement and the balance due six months thereafter. Thereafter, we are obligated to pay Hitachi a commitment fee of $15,000 annually. We are also obligated to pay Hitachi a quarterly service fee of 0.30% on the monthly unused amount of the maximum credit line. In addition to a $2,000 document fee we have paid to Hitachi, if we should exit the Agreement before March 1, 2022, we are obligated to pay Hitachi an exit fee of $50,000.\n2020 Overview\nWe entered 2020 with two product lines, ValidClick and IntentKey, the latter having been launched through an integration with Xandr at the end of 2018. For ValidClick, our objective was to keep the business steady while diversifying revenue within the product line. With the termination of the Merger Agreement with CPT in June 2019, we began to reassess our strategy. The integration of the IntentKey to Xandr leading into 2019 provided a means to distribute our IntentKey product. We had conducted an extensive evaluation of potential partners in late 2018 having ultimately selected Xandr due to their scale and the immediate fit of their technology. This relationship allowed our proprietary data, which is manufactured by our patented artificial intelligence, to become available for sale by Inuvo as a service to online advertisers, thousands of which use the Xandr platform to execute their campaigns.\nThis year, 2020, has been an extraordinary year that could not have been predicted at the time it was forecasted. The COVID-19 pandemic resulted in the implementation of significant governmental measures, including lockdowns, closures, quarantines and travel bans, intended to control the spread of the virus. Beginning in late April 2020, we experienced a significant reduction in demand (marketing budgets) within the ValidClick business and a modest decline in demand within the IntentKey business, the combination of which has resulted in a significant reduction in our revenue run rate. Generally, marketing budgets tend to decline in times of a recession. We curtailed expenses, including compensation and travel and we issued a work from home policy to protect our employees and their families from virus transmission between co-workers. We began to experience interruptions in our daily operations, as a result of these policies. The revenue impact on our industry could vary dramatically by vertical. For example, we experienced less advertising demand from the travel, leisure and hospitality verticals. We also maintain long-standing relationships with Yahoo! and Google that provide access to hundreds of thousands of advertisers from which most of our ValidClick and digital publishing revenue originates. We continue to assess the impact of the COVID-19 pandemic on our Company.\nWe reported lower revenue for the year ended December 31, 2020 as compared to 2019 due predominately to the impact of the COVID-19 pandemic on customer advertising budgets. Gross margins improved significantly in 2020 compared to 2019. We reported gross margins of 81.4% in 2020 compared to 63.1% in the prior year due to reducing outsourced campaign management for the ValidClick platform as well as growing acceptance of the IntentKey.\nImpact of COVID-19 Pandemic\nFirst identified in late 2019 and known now as COVID-19, the outbreak has impacted millions of individuals and businesses worldwide. In response, many countries have implemented measures to combat the outbreak which has had an unprecedented economic consequence. We did not experience an impact from COVID-19 through the end of fiscal year 2019 and had only minor impact from COVID-19 in the first quarter of 2020. Because we operate in the digital advertising industry, unlike a brick and mortar-based company, predicting the impact of the coronavirus pandemic on our Company is difficult. Beginning in late April 2020, we experienced a significant reduction in marketing budgets and a decrease in monetization rates which impacted ValidClick more severely than the IntentKey. This resulted in a significant reduction in our overall revenue run rates within the year with the low point having occurred in May.\nIn response to COVID-19, we curtailed expenses, including compensation and travel throughout the year in addition to the other actions described above. Additionally, in April 2020, we obtained an unsecured Paycheck Protection Program (\"PPP\") loan under the Coronavirus Aid, Relief and Economic Security (\"CARES\") Act of $1.1 million which we used primarily for payroll costs. The loan was fully forgiven by the Small Business Administration (SBA) on November 2, 2020.\nBeginning mid-June 2020, we began to experience an improvement in overall daily revenue, but because of the unprecedented sustainability of COVID-19 on our business, we are unable at this time to predict with any certainty how our clients will adapt their business strategies within the context of COVID-19 and therefore how our revenue run rate will change as a result. As a result of this uncertainty, we are focusing our resources on areas we believe could have more immediate revenue potential, attempting to reduce expenses and raising additional capital so as to mitigate operating disruptions while the impact of COVID-19 abates.\nOur net working capital was a positive $5.9 million as of December 31, 2020. During January 2021, the Company raised approximately $14.3 million, before expenses, through the sale of our securities in two offerings. During the second and third quarters of 2020, we raised approximately $16.5 million, before expenses, through the sale of our securities and in April 2020, we obtained a $1.1 million loan under the Paycheck Protection Program established by the Coronavirus Aid, Relief, and Economic Security (CARES) Act of 2020 (“PPP Loan”). With the reduction in our revenue run rate, there is an increased need for working capital to fund our operations. There is no assurance that we will be successful in obtaining additional funding to continue operations, particularly in light of the current impact of COVID-19 on the U.S. capital markets, but believe we have sufficient capital to operate during the next twelve months.\nCritical Accounting Policies and Estimates\nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amount of assets and liabilities, the disclosure of contingent assets and liabilities and the reported amounts of revenue and expenses during the reported periods. The more critical accounting estimates include estimates related to revenue recognition and accounts receivable allowances. We also have other key accounting policies, which involve the use of estimates, judgments and assumptions that are significant to understanding our results, which are described in Note 2 to our audited consolidated financial statements for 2020 and 2019 appearing elsewhere in this report. The estimates and assumptions that management makes affect the reported amounts of assets, liabilities, net revenues and expenses and disclosure of contingent assets and liabilities. The estimates and assumptions used are based upon management’s regular evaluation of the relevant facts and circumstances as of the date of the consolidated financial statements. We regularly evaluate estimates and assumptions related to allowances for doubtful accounts, goodwill and purchased intangible asset valuations, valuation of long-lived assets, income tax valuation allowance and derivative liability. Actual results may differ from the estimates and assumptions used in preparing the accompanying consolidated financial statements, and such differences could be material.\nResults of Operations\nFor the Years Ended December 31,\n2020 2019 Change % Change\nNet Revenue $ 44,640,007 $ 61,525,214 $ (16,885,207) (27.4) %\nCost of Revenue 8,296,483 22,700,873 (14,404,390) (63.5) %\nGross Profit $ 36,343,524 $ 38,824,341 (2,480,817) (6.4) %\nNet Revenue\nWe experienced lower year over year revenue for the year ended December 31, 2020 as compared to the same period in 2019. Revenue declined within the ValidClick platform where COVID-19 had a material impact on advertising budgets. The renegotiation of payment terms and conditions with marketing partners in the quarter ended June 30, 2020 also contributed to the lower ValidClick revenue as a trade off for higher gross margins. The IntentKey platform grew 22.2% for the year ended December 31, 2020 over the prior year.\nCost of Revenue\nCost of revenue is primarily generated by payments to website publishers and app developers that host advertisements we serve through ValidClick and to ad exchanges that provide access to a supply of advertising inventory where we serve advertisements\nusing information predicted by the IntentKey. The decrease in the cost of revenue for the year ended December 31, 2020 compared to the same time period in 2019 was due primarily to the decline in ValidClick revenue as described in the Net Revenue section and the decision to reduce certain historically outsourced campaign management tasks.\nOperating Expenses\nFor the Year Ended December 31,\n2020 2019 Change % Change\nMarketing costs (TAC) $ 27,410,284 $ 30,135,991 $ (2,725,707) (9.0 %)\nCompensation 9,350,831 7,753,528 1,597,303 20.6 %\nSelling, general and administrative 7,630,990 8,673,015 (1,042,025) (12.0 %)\nOperating expenses $ 44,392,105 $ 46,562,534 $ (2,170,429) (4.7 %)\nMarketing costs or TAC include those expenses required to attract an audience to the ValidClick owned and operated web properties. The decrease in marketing costs for the year ended December 31, 2020 compared to the same period in 2019 was due primarily to the decline in revenue as described in the Net Revenue section, the decision to reduce the use of outside agencies for traffic acquisition and due to renegotiating payment terms and conditions with a ValidClick marketing partner in the second quarter.\nCompensation expense was higher for the year ended December 31, 2020 compared to the same time period in 2019 due primarily to higher employee salary expense, commissions, stock-based compensation and accrued incentive pay. Our total employment, both full and part-time, was 75 at December 31, 2020 compared to 65 at December 31, 2019. The higher head count at the end of 2020, as described above, was primarily the result of a decision to reduce the use of outside agencies for traffic acquisition and take the function in-house.\nSelling, general and administrative costs were lower for the year ended December 31, 2020 compared to the same time period in 2019 due primarily to approximately $1 million in legal and professional fees related to the terminated Merger in 2019.\nInterest Expense, net\nInterest expense, net, which represents interest expense on financed receivables, finance lease obligations and PPP loan, was approximately $254 thousand for the year ended December 31, 2020.\nInterest expense, net, was approximately $482 thousand for the year ended December 31, 2019. The higher amounts were primarily due to increased borrowings from financed receivables.\nOther income, net\nOther income, net, of $997 thousand in 2020 was primarily due to the $1.1 million PPP loan being fully forgiven on November 2, 2020. The PPP loan helped fund compensation expenses. Partially offsetting the PPP loan was a $103 thousand other expense due to the change of the fair market value of the derivative liability associated with convertible promissory notes that were extinguished by May 2020.\nOther income, net, of $3.4 million in 2019 is due primarily to the Termination Fee of $2.8 million and the excess fair value over assets received for ReTargeter of $967 thousand (see Mergers Termination above), offset by approximately $191 thousand due to the change of the fair market value of the derivative liability associated with convertible promissory notes and to $255 thousand due to the conversion of a portion of the convertible promissory notes (as described in Note 7).\nLiquidity and Capital Resources\nThe change in cash flows from operating activities during 2020 was a use of cash of $5,599,335 primarily due to a net loss of $7,304,569, a decrease in the accounts payable balance by $2,271,578, the benefit of $1,260,978 from a contract cancellation and $1,109,000 from the forgiveness of the PPP loan, partially offset by the decrease in the accounts receivable balance of $1,317,508 and the increase in accrued expenses and other liabilities balance by $623,576. Our terms are such that we generally collect receivables prior to paying trade payables. Media sales typically have slower payment terms than the terms of related payables.\nOur principal sources of liquidity are the sale of our common stock, our borrowings under our credit facility with Hitachi, described in Note 6, and borrowings from non-bank financial institutions (see Note 7). During March 2020 and April 2020, we raised approximately $1.5 million in gross proceeds, before expenses, through sales of our common stock and in April 2020 we received a $1.1 million PPP Loan. On June 8, 2020, we raised an additional $5.5 million in gross proceeds, before expenses, through the sale of our common stock and on July 27, 2020, we raised an additional $10.75 million in gross proceeds, before expenses, through sales of our common stock. On January 19, 2021, we raised an additional $8 million in gross proceeds, before expenses, through the sale of our common stock, and on January 22, 2021, we raised an additional $6.25 million in gross proceeds, before expenses, through sales of our common stock.\nWe have focused our resources behind a plan to grow our AI technology, the IntentKey, where we have a technology advantage and higher margins. If we are successful in implementing our plan, we expect to return to a positive cash flow from operations. However, there is no assurance that we will be able to achieve this objective.\nThough we believe our current cash position and credit facility will be sufficient to sustain operations for the next twelve months, if our plan to grow the IntentKey business is unsuccessful, we may need to fund operations through private or public sales of securities, debt financings or partnering/licensing transactions.\nIn April 2020, the Company experienced a significant reduction in advertiser marketing budgets across both the ValidClick and IntentKey platforms as a direct consequence of COVID-19. These reductions continued to adversely impact overall revenue throughout the year. While COVID-19 is still present, we are at this time, unable to quantify the long-term impacts on our Company. As a result, in May 2020 and June 2020 we implemented a temporary compensation change for senior officers and certain other highly compensated employees. We also curtailed expenses, including compensation and travel for the months of May and June, and we issued a work from home policy to protect our employees and their families from virus transmission associated with co-workers. As a result of this uncertainty, we continue to focus our resources on areas we believe have immediate revenue potential while concurrently reducing expenses where necessary with an objective to minimize daily operating disruptions.\nOn October 7, 2020, we held a Special Meeting of Stockholders for the purpose of approving and adopting the ratification and validation of the amendment to our articles of incorporation to increase the number of authorized shares of common stock that we may issue from 60,000,000 to 100,000,000. The proposal was approved.\nOn December 16, 2020, stockholders approved an amendment to our articles of incorporation increasing the number of authorized shares of common stock, $0.001 par value per share from 100,000,000 to 150,000,000.\nCash Flows\nThe table below sets forth a summary of our cash flows for the years ended 2020 and 2019:\nNet cash used in operating activities\n$5,559,335 $5,338,383\nNet cash used in investing activities\n$1,185,335 $1,194,164\nNet cash provided by financing activities\n$14,302,346 $6,676,580\nCash Flows - Operating\nNet cash used in operating activities was $5,599,335 during 2020. We reported a net loss of $7,304,569, which included non-cash expenses; depreciation and amortization of $3,237,930, amortization of right of use assets $367,981 and stock-based compensation of $858,683. The change in operating assets and liabilities was a net use of cash of $506,196 primarily due to a decrease in the accounts payable balance by $2,271,578, offset by a decrease in the accounts receivable balance by $1,317,508. Our terms are such that we generally collect receivables prior to paying trade payables. Media sales typically have slower payment terms than the terms of related payables.\nDuring 2019, cash used in operating activities was $5,338,383. We reported a net loss of $4,488,107. Additional non-cash expenses included the non-cash expenses of depreciation and amortization of $3,422,385 and stock-based compensation expenses of $789,914. The change in operating assets and liabilities was a net use of cash of $1,583,570.\nCash Flows - Investing\nNet cash used in investing activities was $1,185,335 and $1,194,164 for 2020 and 2019, respectively. Cash used in investing activities in both years has primarily consisted of capitalized internal development costs.\nCash Flows - Financing\nNet cash provided by financing activities was $14,302,346 during 2020 primarily from proceeds from the sale of common stock.\nDuring 2019, net cash used in financing activities was $6,676,580 primarily from proceeds from the sale of common stock and the convertible promissory notes (as described in Note 8).\nOff Balance Sheet Arrangements\nAs of December 31, 2020, we do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors. The term \"off-balance sheet arrangement\" generally means any transaction, agreement or other contractual arrangement to which an entity unconsolidated with us is a party, under which we have any obligation arising under a guarantee contract, derivative instrument or variable interest or a retained or contingent interest in assets transferred to such entity or similar arrangement that serves as credit, liquidity or market risk support for such assets.",
    "item_7A": "ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nNot applicable to a smaller reporting company.",
    "item_8": "ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nOur consolidated financial statements begin on page at the end of this annual report.",
    "item_9": "ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone.",
    "item_9A": "ITEM 9A. CONTROLS AND PROCEDURES.\nEvaluation of Disclosure Controls and Procedures\nWe maintain “disclosure controls and procedures” as such term is defined in Rule 13a-15(e) under the Securities Exchange Act of 1934. Disclosure controls and procedures are controls and procedures designed to reasonably assure that information required to be disclosed in our reports filed under the Securities Exchange Act of 1934, such as this report, is recorded, processed, summarized and reported within the time periods prescribed by SEC rules and regulations, and to reasonably assure that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, to allow timely decisions regarding required disclosure.\nOur management does not expect that our disclosure controls will prevent all errors and fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. In addition, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within a company have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty, and that breakdowns can occur because of simple error or mistake. Additionally, controls can be circumvented by the individual acts of some persons, by collusion of two or more people or by management override of the control. The design of any systems of controls also is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Over time, controls may become\ninadequate because of changes in conditions, or the degree of compliance with the policies or procedures may deteriorate. Because of these inherent limitations in a cost-effective control system, misstatements due to error or fraud may occur and not be detected.\nAs required by Rule 13a-15 under the Securities Exchange Act of 1934, as of December 31, 2020, the end of the period covered by this report, our management concluded their evaluation of the effectiveness of the design and operation of our disclosure controls and procedures. As of the evaluation date, our Chief Executive Officer and Chief Financial Officer concluded that we maintain disclosure controls and procedures that are effective in providing reasonable assurance that information required to be disclosed in our reports under the Securities Exchange Act of 1934 is recorded, processed, summarized and reported within the time periods prescribed by SEC rules and regulations, and that such information is accumulated and communicated to our management to allow timely decisions regarding required disclosure.\nManagement’s Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Securities Exchange Act of 1934 Rule 13a-15(f). Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Our internal control over financial reporting includes those policies and procedures that:\n•pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets;\n•provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and\n•provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\nBecause of the inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur management assessed the effectiveness of our internal control over financial reporting as of December 31, 2020. In making this assessment, our management used the criteria set forth by the Committee of Sponsoring Organizations of the 2013 Treadway Commission (“COSO”) in Internal Control-Integrated Framework. Based upon this assessment, our Chief Executive Officer and Chief Financial Officer concluded that as of December 31, 2020 our internal controls over financial reporting were effective.\nChanges in Internal Control over Financial Reporting\nExcept for the remediation procedures related to ASC 740 (see Note 19), which were completed in our most recent fiscal quarter, there were no changes in our internal controls over financial reporting that occurred during our most recent fiscal quarter that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.",
    "item_9B": "ITEM 9B. OTHER INFORMATION.\nNone\nPART III",
    "item_10": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nThe information required by this Item will be contained in our proxy statement for our 2021 Annual Meeting of Shareholders to be filed on or prior to April 30, 2021 (the “Proxy Statement”) and is incorporated herein by this reference.",
    "item_11": "ITEM 11. EXECUTIVE COMPENSATION.\nThe information required by this item will be contained in our Proxy Statement and is incorporated herein by this reference.",
    "item_12": "ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe information required by this item will be contained in our Proxy Statement and is incorporated herein by this reference.",
    "item_13": "ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nThe information required by this item will be contained in our Proxy Statement and is incorporated herein by this reference.",
    "item_14": "ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES.\nThe information required by this item will be contained in our Proxy Statement and is incorporated herein by this reference.\nPART IV",
    "item_15": "ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES.\n1. Financial Statements\nThe consolidated financial statements and Report of Independent Registered Accounting Firm are listed in the “Index to Financial Statements and Schedules” beginning on page and included on pages through.\n2. Financial Statement Schedules\nAll schedules for which provision is made in the applicable accounting regulations of the SEC are either not required under the related instructions, are not applicable (and therefore have been omitted), or the required disclosures are contained in the consolidated financial statements herein.\n3. Exhibits (including those incorporated by reference).\n*** Portions of this exhibit have been omitted pursuant to a request for confidential treatment filed with the Commission under Rule 24b-2. The omitted material has been filed separately with the Commission. Certain portions of this exhibit have also been redacted pursuant to Item 601(b)(10)(iv) of Regulation S-K. The omitted information is (i) not material and (ii) would likely cause competitive harm to Inuvo if publicly disclosed. The location of the omitted confidential information is indicated in the exhibit with asterisks (***).\nNo. Exhibit Description Form Date Filed Number Filed or Furnished Herewith\n2.1 Agreement and Plan of Merger dated June 5, 2009 between Inuvo, Inc. and Kowabunga! Inc.\n8-K 7/24/09 2.4\n2.2 Agreement and Plan of Merger dated October 16, 2011 between Inuvo, Inc., Anhinga Merger Subsidiary, Inc. and Vertro, Inc.\n8-K 10/17/11 2.5\n2.3 Agreement and Plan of Merger by and among ConversionPoint Technologies, Inc., ConversionPoint Holdings, Inc., CPT Merger Sub, Inc., Inuvo, Inc., and CPT Cigar Merger Sub, Inc., dated November 2, 2018.*\n8-K 11/5/18 2.1\n2.4 Securities Purchase Agreement, by and between Inuvo, Inc. and CPT Investments, LLC, dated November 1, 2018.\n8-K 11/5/18 2.2\n2.5 10% Senior Unsecured Subordinated Convertible Promissory Note, executed by the Company in favor of CPT Investments, LLC, dated November 1, 2018.\n8-K 11/5/18 2.3\n2.6 Registration Rights Agreement, by and between Inuvo, Inc. and CPT Investments, LLC, dated November 1, 2018.\n8-K 11/5/18 2.4\n2.7 Form of 10% Promissory Note, executed by Inuvo, Inc. in favor of certain affiliates of Inuvo, Inc., dated November 1, 2018.\n8-K 11/5/18 2.5\n2.8 First Amendment to Agreement and Plan of Merger dated March 1, 2019, by and among Inuvo, Inc., a Nevada corporation, ConversionPoint Technologies Inc., a Delaware corporation, ConversionPoint Holdings, Inc., a Delaware corporation, CPT Merger Sub, Inc., a Delaware corporation and CPT Cigar Merger Sub, Inc., a Nevada corporation.\n8-K/A 3/5/19 2.1\n2.9 Agreement and Plan of Merger Termination Agreement dated June 20, 2019 by and among ConversionPoint Technologies, Inc., ConversionPoint Holdings, Inc., CPT Merger Sub, Inc., Inuvo, Inc. and CPT Cigar Merger Sub, Inc.\n8-K 6/21/19 2.1\n3(i).1 Articles of Incorporation, as amended\n10-KSB 3/1/04 4\n3(i).2 Amended to Articles of Incorporation filed March 14, 2005\n10-KSB 3/31/06 3.2\n3(i).3 Articles of Merger between Inuvo, Inc. and Kowabunga! Inc.\n8-K 7/24/09 3.4\n3(i).4 Certificate of Change Filed Pursuant to NRS 78.209\n8-K 12/10/10 3(i).4\n3(i).5 Certificate of Merger as filed with the Secretary of State of Nevada on February 29, 2012\n10-K 3/29/12 3(i).5\n3(i).6 Articles of Amendment to Amended Articles of Incorporation as filed on February 29, 2012\n10-K 3/29/12 3(i).6\n3(i).7 Articles of Amendment to Articles of Incorporation as filed on October 31, 2019\n10-Q 5/15/20 3(i).7\n3(i).8 Certificate of Validation of Amendment to Amended Articles of Incorporation as filed October 16, 2020\n10-Q 11/9/20 3(i)(8)\n3(i).9 Articles of Amendment to Articles of Incorporation as filed January 7, 2021\nFiled\n3(ii).1 Amended and Restated By-Laws\n10-K 3/31/10 3(ii).4\n3(ii).2 Bylaw amendment adopted February 29, 2012\n8-K 3/6/12 3(ii).1\n4.1 Description of Securities\nFiled\n10.1 Google Services Agreement effective March 1, 2017 by and between Vertro, Inc. and Google Inc. ***\n8-K/A 6/7/17 10.27\n10.2 Amendment Number One to Google Services Agreement effective March 1, 2019 ***\n10-K 3/15/19 10.6\n10.3 Yahoo! Publisher Network Contract, dated April 4, 2009, as amended with Amendment No. 1, Amendment No. 2, Amendment No. 3, Amendment No. 4, Amendment No. 5 and Amendment No. 6 ***\n10-Q 5/15/12 10.1\n10.4 Yahoo! Publisher Network Contract, dated April 4, 2009, as amended. ***\n10-Q/A 12/28/12 10.1\n10.5 Amendment No. 8 to Yahoo! Publisher Network Contract effective as of September 1, 2013, executed and delivered October 10, 2013 ***\n10-Q/A 1/6/14 10.28\n10.6 Amendment #11 to Yahoo! Publisher Network Contract, effective January 15, 2016, executed and delivered January 26, 2015\n10-K 2/12/16 10.24\n10.7 Amendment #12 to Yahoo! Publisher Network Contract, effective March 2, 2016 ***\n10-Q 4/27/16 10.25\n10.8 Amendment #14 to Yahoo! Publisher Contract dated February 28, 2018\n8-K 3/6/18 10.1\n10.9 Amendment #15 to Yahoo! Publisher Contract dated May 9, 2018\n8-K 5/15/18 10.1\n10.10 Amendment # 16 dated August 28, 2018 to Yahoo! Publisher Network Contract ***\n10-Q 11/7/18 10.1\n10.11 Amendment #18 dated January 24, 2019 to Yahoo! Publisher Contract\n10-K 3/15/19 10.6\n10.12 Amendment #28 to the Yahoo! Publisher Network Contract #1-19868214, dated as of November 11, 2020***\n8-K 11/16/20 10.1\n10.13 Form of Indemnification Agreement with Directors of Inuvo, Inc.\n10-Q 11/7/18 10.5\n10.14 Form of Securities Purchase Agreement dated June 4, 2020 by and between Inuvo, Inc, and the purchasers listed therein\n8-K 6/4/20\n10.1\n10.15 Form of Securities Purchase Agreement, dated January 14, 2021 by and between Inuvo, 2019.Inc, and the purchasers listed therein\n8-K 1/14/21 10.1\n10.16 Form of Securities Purchase Agreement dated January 20, 2021 by and between Inuvo, Inc, and the purchasers listed therein\n8-K 1/20/21 10.1\n10.17 2010 Equity Compensation Plan\nDEF14A 4/30/2010 A\n10.18 Amendment No. 1 to 2010 Equity Compensation Plan dated February 29, 2012\nS-8 2/29/2012 99.2\n10.19 2017 Equity Compensation Plan\nDEF14A 4/28/2017 A\n10.20 Amendment No. 1 to the 2017 Equity Compensation Plan\nDEF14 9/3/2019 B\n10.21 Quick Action Closing Fund Grant Agreement, dated January 25, 2013, with the Arkansas Economic Development Commission\n10-K 3/13/2013 10.23\n10.22 Grant Reimbursement Agreement, dated January 25, 2013, with the Arkansas Economic Development Commission..\n10-K 3/13/2013 10.24\n10.23 Employment Agreement dated March 1, 2012 between Inuvo, Inc. and Richard K. Howe\n8-K 3/6/2012 10.2\n10.24 Employment Agreement dated March 1, 2012 between Inuvo, Inc. and Wallace D. Ruiz\n8-K 3/6/2012 10.4\n10.25 Employment Agreement dated March 1, 2012 between Inuvo, Inc. and John B. Pisaris\n8-K 3/6/2012 10.5\n10.26 Loan and Security Agreement dated February 28, 2020 effective March 12, 2020 by and between Inuvo, Inc. and its subsidiaries and Hitachi Capital America Corp.\n8-K 3/17/2020 10.1\n10.27 Form of Insider Offering Subscription Agreement\n8-K 3/20/20 10.1\n10.28 Form of Subscription Agreement\n8-K 4/01/20 10.1\n10.29 2017 Equity Compensation Plan Restricted Stock Unit Agreement\nFiled\n21.1 Subsidiaries of the Registrant\nFiled\n23.1 Consent of Mayer Hoffman McCann P.C\nFiled\n31.1 Rule 13a-14(a)/15d-14(a) certification of Chief Executive Officer\nFiled\n31.2 Rule 13a-14(Rule 13a-14(a)/15d-14(a) certification of Chief Financial Officer)/15d-14(a) certification of Chief Financial Officer\nFiled\n32.1 Section 1350 certification of Chief Executive Officer\nFiled\n32.2 Section 1350 certification of Chief Financial Officer\nFiled\n101.INS XBRL Instance Document Filed\n101.SCH XBRL Taxonomy Extension Schema Document Filed\n101.CAL XBRL Taxonomy Extension Calculation Linkbase Document Filed\n101.DEF XBRL Taxonomy Extension Definition Linkbase Document Filed\n101.LAB XBRL Taxonomy Extension Label Linkbase Document Filed\n101.PRE XBRL Taxonomy Extension Presentation Linkbase Document Filed\n104 The cover page for Inuvo, Inc.’s Annual Report on Form 10-K for the year ended December 31, 2020, formatted in Inline XBRL (included within Exhibit 101 attachments). Filed\n* The Company has omitted schedules and similar attachments to the subject agreement pursuant to Item 601(b) of Regulation S-K. The Company will furnish a copy of any omitted schedule or similar attachment to the SEC upon request.\n*** Portions of this exhibit have been omitted pursuant to a request for confidential treatment filed with the Securities and Exchange Commission under Rule 24b-2. The omitted confidential material has been filed separately. Certain portions of this exhibit have also been redacted pursuant to Item 601(b)(10)(iv) of Regulation S-K. The omitted information is (i) not material and (ii) would likely cause competitive harm to Inuvo if publicly disclosed. The location of the omitted confidential information is indicated in the exhibit with asterisks (***).\nItem 16. Form 10-K Summary\nThe Company has elected not to provide this optional information.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nInuvo, Inc.\nFebruary 11, 2021 By: /s/ Wallace D. Ruiz\nWallace D. Ruiz, Chief Financial Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature Title Date\n/s/ Richard K. Howe Chairman of the Board of Directors, Chief Executive Officer, and principal executive officer February 11, 2021\nRichard K. Howe\n/s/ Wallace D. Ruiz Chief Financial Officer, principal financial and accounting officer February 11, 2021\nWallace D. Ruiz\n/s/ G. Kent Burnett Director February 11, 2021\nG. Kent Burnett\n/s/ Gordon J. Cameron Director February 11, 2021\nGordon J. Cameron\n/s/ Charles D. Morgan Director February 11, 2021\nCharles D. Morgan\nINUVO, INC.\nCONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2020 AND 2019\nINDEX TO AUDITED CONSOLIDATED FINANCIAL STATEMENTS\nCONTENTS\nReport of Independent Registered Public Accounting Firm 1\nConsolidated Financial Statements:\nConsolidated Balance Sheets 2\nConsolidated Statements of Operations 3\nConsolidated Statements of Stockholders’ Equity 4\nConsolidated Statements of Cash Flows 5\nNotes to Consolidated Financial Statements 6\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and\nStockholders of Inuvo, Inc.:\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Inuvo, Inc. (the “Company”) as of December 31, 2020 and 2019, and the related consolidated statements of operations, stockholders’ equity, and cash flows for each of the two years in the period ended December 31, 2020, and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2020 and 2019, and the results of its operations and its cash flows for each of the two years in the period ended December 31, 2020, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. We conducted our audits in accordance with the standards of the PCAOB.\nThose standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nAdoption of New Accounting Standard\nAs discussed in Notes 2 and 16 to the consolidated financial statements, the Company changed its method of accounting for leases as a result of the adoption of Accounting Standards Codification Topic 842, Leases effective January 1, 2019, under the modified retrospective method. Our opinion is not modified with respect to this adoption.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (i) relate to accounts or disclosures that are material to the financial statements and (ii) involved our especially challenging, subjective, or complex judgements. We determined that there are no critical audit matters.\n/s/ Mayer Hoffman McCann P.C.\nWe have served as the Company’s auditor since 2009.\nFebruary 11, 2021\nClearwater, Florida\nInuvo, Inc.\nConsolidated Balance Sheets\nFor the Years Ended December 31,\n2020 2019\nAssets\nCurrent assets\nCash $ 7,890,665 $ 372,989\nAccounts receivable, net of allowance for doubtful accounts of $209,667 and $225,000, respectively\n6,227,610 7,529,785\nPrepaid expenses and other current assets 413,435 243,888\nTotal current assets $ 14,531,710 $ 8,146,662\nProperty and equipment, net 1,187,061 1,374,152\nOther assets\nGoodwill 9,853,342 9,853,342\nIntangible assets, net of accumulated amortization 8,586,089 10,451,593\nRight of use assets - operating lease 606,573 756,115\nRight of use assets - finance lease 395,910 88,178\nOther assets 20,886 20,886\nTotal other assets $ 19,462,800 $ 21,170,114\nTotal assets $ 35,181,571 $ 30,690,928\nLiabilities and Stockholders’ Equity\nCurrent liabilities\nAccounts payable $ 4,048,260 $ 7,520,567\nAccrued expenses and other current liabilities $ 4,216,448 $ 3,614,433\nLease liability - operating lease $ 217,671 362,130\nLease liability - finance lease $ 246,793 80,777\nDerivative liability $ - 182,250\nConvertible promissory notes, current portion (net) $ - $ 536,806\nFinanced receivables $ - $ 3,381,364\nTotal current liabilities $ 8,729,172 $ 15,678,327\nLong-term liabilities\nDeferred tax liability 107,000 107,000\nLease liability - operating lease 388,902 394,889\nLease liability - finance lease 93,426 -\nOther long-term liabilities 573,957 57,162\nTotal long-term liabilities $ 1,163,285 $ 559,051\nStockholders’ equity\nPreferred stock, $0.001 par value:\nAuthorized shares - 500,000 - none issued and outstanding\n- -\nCommon stock, $0.001 par value:\nAuthorized shares 100,000,000; issued and outstanding shares 98,035,829 and 52,222,538 respectively; issued and outstanding shares 98,035,829 and 51,846,011, respectively\n98,036 52,223\nAdditional paid-in capital 161,541,448 144,843,687\nAccumulated deficit (136,350,370) (129,045,801)\nTreasury stock, at cost - - and 376,527 shares, respectively\n- (1,396,559)\nTotal stockholders' equity $ 25,289,114 $ 14,453,550\nTotal liabilities and stockholders' equity $ 35,181,571 $ 30,690,928\nSee accompanying report of independent registered public accounting firm and notes to the consolidated financial statements.\nInuvo, Inc.\nConsolidated Statements of Operations\nFor the Years Ended December 31,\n2020 2019\nNet revenue $ 44,640,007 $ 61,525,214\nCost of revenue 8,296,483 22,700,873\nGross profit 36,343,524 38,824,341\nOperating expenses\nMarketing costs (Traffic Acquisition Costs-TAC) 27,410,284 30,135,991\nCompensation 9,350,831 7,753,528\nSelling, general and administrative 7,630,990 8,673,015\nTotal operating expenses 44,392,105 46,562,534\nOperating loss (8,048,581) (7,738,193)\nInterest expense, net (253,505) (482,210)\nOther income, net 997,517 3,397,902\nLoss from continuing operations before taxes (7,304,569) (4,822,501)\nIncome tax benefit - 334,394\nNet loss $ (7,304,569) $ (4,488,107)\nPer common share data\nBasic and diluted\nNet loss $ (0.09) $ (0.11)\nWeighted average shares\nBasic 77,473,479 40,454,779\nDiluted 77,473,479 40,454,779\nSee accompanying report of independent registered public accounting firm and notes to the consolidated financial statements.\nInuvo, Inc.\nConsolidated Statements of Stockholders' Equity\nFor the Years Ended December 31, 2020 and 2019\nCommon Stock Additional Paid in Capital\nAccumulated Deficit Treasury Stock Total\nShares Stock\nBalances as of December 31, 2018 32,381,290 $ 32,759 $ 138,867,509 $ (124,557,694) $ (1,396,559) $ 12,946,015\nNet loss - - - (4,488,107) - (4,488,107)\nStock-based compensation - - 789,914 - - 789,914\nStock issued for vested restricted stock awards 765,429 765 (765) - - -\nSale of common stock 15,812,500 15,812 4,398,311 - - 4,414,123\nShares withheld for taxes on vested restricted stock (45,565) (45,565)\nConvertible Note Conversion 2,886,792 2,887 834,283 - - 837,170\nBalances as of December 31, 2019 51,846,011 $ 52,223 $ 144,843,687 $ (129,045,801) $ (1,396,559) $ 14,453,550\nNet loss - - - (7,304,569) - (7,304,569)\nStock-based compensation - - 858,683 - - 858,683\nCancellation of treasury stock - (376) (1,396,183) - 1,396,559 -\nStock issued for vested restricted stock awards 1,020,882 1,020 (1,020) - - -\nShares withheld for taxes on vested restricted stock (74,550) - - (74,550)\nConvertible Note Conversion 3,000,000 3,000 920,810 - 923,810\nSale of common stock 42,168,936 $ 42,169 $ 16,390,021 $ - $ - 16,432,190\nBalances as of December 31, 2020 98,035,829 $ 98,036 $ 161,541,448 $ (136,350,370) $ - $ 25,289,114\nSee accompanying report of independent registered public accounting firm and notes to the consolidated financial statements.\nInuvo, Inc.\nConsolidated Statements of Cash Flows\nFor the Years Ended December 31, 2020 and 2019\n2020 2019\nOperating activities:\nNet loss $ (7,304,569) $ (4,488,107)\nAdjustments to reconcile net loss to net cash used in operating activities:\nPPP loan forgiveness (1,109,000) -\nContract cancellation (1,260,978) -\nGain on merger termination - (3,766,667)\nLoss on extinguishment of convertible debt 65,700 193,179\nDeferred income taxes - (334,394)\nDepreciation and amortization 3,237,930 3,245,192\nAmortization of Right of Use Assets 367,981 177,193\nMark to market fair value of derivative 102,664 (78,913)\nStock based compensation 858,683 789,914\nAmortization of financing fees 11,092 59,245\n(Recovery)/Provision for doubtful accounts (15,333) 161,273\nAmortization of OID interest expense 13,167 119,167\nAmortization of debt discount 18,286 168,105\nThird party rights agreement (78,762) -\nChange in operating assets and liabilities:\nAccounts receivable 1,317,508 (973,522)\nPrepaid expenses, unbilled revenue and other assets (175,702) 20,893\nAccounts payable (2,271,578) (1,978,974)\nAccrued expenses and other liabilities 623,576 1,348,033\nNet cash used in operating activities (5,599,335) (5,338,383)\nInvesting activities:\nPurchases of equipment and capitalized development costs (1,185,335) (1,194,164)\nNet cash used in investing activities (1,185,335) (1,194,164)\nFinancing activities:\nProceeds from sale of common stock, net of expenses 16,432,190 4,349,123\nProceeds from PPP and SBA loans 1,258,900 -\nProceeds from ValidClick licensing agreement 500,000 -\nProceeds from financed receivables - 1,521,511\nProceeds from convertible promissory note - 1,200,000\nPayments on note payable - (250,000)\nNet proceeds on revolving line of credit (3,381,364) -\nPayments on finance/capital leases (432,830) (198,960)\nNet taxes paid on RSU grants exercised (74,550) (45,565)\nPrepaid financing fees - (24,529)\nShareholder settlement - 125,000\nNet cash provided by financing activities\n14,302,346 6,676,580\nNet change - cash 7,517,676 144,033\nCash, beginning of year 372,989 228,956\nCash, end of year $ 7,890,665 $ 372,989\nSupplemental information:\nInterest paid $ 207,213 $ 421,860\nNon-cash investing and financing activities:\nConversion of Debt and derecognition of derivative and discounts to common stock $ 923,810 $ -\nAssets purchased under finance lease obligations $ 547,303 $ -\nAssets purchased under operating lease obligations $ 249,595 $ -\nDebt conversion and related activities $ - $ 837,170\nAdoption of ASC 842-old capital leases $ - $ 263,580\nAdoption of ASC 842 $ - $ 1,173,946\nReTargeter assets $ - $ 2,575,000\nConversion of debt to common stock $ - $ 765,000\nDerecognition of derivative in exchange for common stock $ - $ 72,170\nSee accompanying report of independent registered public accounting firm and notes to the consolidated financial statements.\nInuvo, Inc.\nNotes to Consolidated Financial Statements\nFor the Years Ended December 31, 2020 and 2019\nNote 1 - Organization and Business\nCompany Overview\nInuvo is a technology company that develops and sells information technology solutions for marketing. These platforms predictively identify and message online audiences for any product or service across devices, channels and formats, including video, mobile, connected TV, display, social and native. These capabilities allow Inuvo's clients to engage with their customers and prospects in a manner that drives engagement from the first contact with the consumer. Inuvo facilitates the delivery of hundreds of millions of marketing messages to consumers every single month and counts among its clients, numerous world- renowned names in industries that have included retail, automotive, insurance, health care, technology, telecommunications and finance.\nThe Inuvo solution incorporates a proprietary form of artificial intelligence, or AI, branded the IntentKey. This sophisticated machine learning technology uses interactions with Internet content as a source of information from which to predict consumer intent. The AI includes a continually updated database of over 500 million machine profiles which Inuvo utilizes to deliver highly aligned online audiences to its clients. Inuvo earns revenue when consumers view or click on its client’s messages.\nThe Inuvo business scales through account management activity with existing clients and by adding new clients through sales activity.\nAs part of the Inuvo technology strategy, it owns a collection of websites including alot.com and earnspendlive.com, where Inuvo creates content in health, finance, travel, careers, auto, education and living categories. These sites provide the means to test the Inuvo technologies, while also delivering high quality consumers to clients through the interaction with proprietary content in the form of images, videos, slideshows and articles.\nThere are many barriers to entry associated with the Inuvo business model, including a proficiency in large scale information processing, predictive software development, marketing data products, analytics, artificial intelligence, integration to the internet of things (IOT), and the relationships required to execute within the IOT. Inuvo's intellectual property is protected by 18 issued and seven pending patents.\nMergers Termination\nOn June 20, 2019, Inuvo entered into an Agreement and Plan of Merger Termination Agreement (the “Merger Termination Agreement”) with ConversionPoint Technologies Inc., a Delaware corporation (“CPT”), ConversionPoint Holdings, Inc., a Delaware corporation (“Parent”), CPT Merger Sub, Inc., a Delaware corporation, (“CPT Merger Sub”), and CPT Cigar Merger Sub, Inc., a Nevada corporation (“Inuvo Merger Sub”), which, among other things, (1) terminated the Agreement and Plan of Merger, dated November 2, 2018, by and among Inuvo, CPT, Parent, CPT Merger Sub, and Inuvo Merger Sub, as amended (the “Merger Agreement”), pursuant to which Inuvo would have merged with and into Inuvo Merger Sub and become a wholly-owned subsidiary of Parent, and CPT would have merged with and into CPT Merger Sub and become a wholly-owned subsidiary of Parent (the “Mergers”), and (2) terminated each of the Support Agreements that were entered into by certain officers and directors of Inuvo and the parties to the Merger Agreement. The Merger Agreement was terminated as a result of Parent’s inability to fulfill the closing condition of the Mergers that Parent raise $36,000,000 in gross proceeds from an equity, debt, or equity-linked offering of its securities which no longer obligated Inuvo to consummate the Mergers contemplated by the Merger Agreement.\nConcurrently with the execution of the Merger Termination Agreement, CPT Investments, LLC, a California limited liability company and an affiliate of CPT (“CPT Investments”), and Inuvo entered into a certain Inuvo Note Termination Agreement (the “Note Termination Agreement”) and agreed to (1) terminate and cancel the 10% Senior Unsecured Subordinated Convertible Promissory Note, dated November 1, 2018, executed by Inuvo in favor of CPT Investments (the “CPTI Note”), which as of June 20, 2019, had $1,063,288 in accrued principal and interest outstanding (the “Outstanding Indebtedness”) by July 20, 2019, (2) effective immediately, terminate all conversion rights under the CPTI Note to convert amounts outstanding into shares of Inuvo’s common stock, (3) terminate the Securities Purchase Agreement, dated November 1, 2018, by and between Inuvo and CPT Investments, and (4) terminate the Registration Rights Agreement, dated November 1, 2018, by and between Inuvo and CPT Investments.\nThe Merger Termination Agreement provided that the termination fee of $2,800,000 to be paid to Inuvo (the “Termination Fee”) for failure to fulfill the Financing Condition would be satisfied as follows:\n(1) $1,063,288 of the Termination Fee was satisfied in consideration of the termination and cancellation of the Outstanding Indebtedness pursuant to the CPTI Note Termination Agreement that was approved by CPT’s senior lenders Montage Capital II, L.P. and Partners for Growth IV, L.P. and CPT’s issuance of a replacement note to CPT Investments that was entered into in July 2019;\n(2) $1,611,712 of the Termination Fee was satisfied by CPT transferring all of the assets related to CPT’s programmatic and RTB advertising solutions business conducted through managed services and a proprietary SaaS solution free and clear of all liabilities, encumbrances, or liens, to Inuvo. The enterprise valuation of the ReTargeter Business was determined to be $2.57 million.\n(3) CPT paid $125,000 to Inuvo on September 15, 2019 to be contributed to the settlement of ongoing litigation with respect to the Mergers.\nOn September 30, 2019, Inuvo paid its obligation of $250,000 under a confidential settlement agreement that it entered into on June 20, 2019 resolving certain outstanding litigation related to the Mergers. Under the Merger Termination Agreement, CPT and Inuvo agreed to mutually release all claims that each party had against the other, as well as certain affiliated entities of each. Inuvo, however, will be able to pursue any claims against CPT and its affiliates for breaches of the Merger Termination Agreement.\nLiquidity\nThe change in operating assets and liabilities during 2020 was a use of cash of $5,599,335 primarily due to a net loss of $7,304,569, a decrease in the accounts payable balance by $2,271,578, partially offset with the decrease in the accounts receivable balance of $1,317,508 and the increase in accrued expenses and other liabilities balance by $623,576. Our terms are such that we generally collect receivables prior to paying trade payables. Media sales typically have slower payment terms than the terms of related payables.\nOur principal sources of liquidity are the sale of our common stock, our borrowings under our credit facility with Hitachi, described in Note 6, and borrowings from non-bank financial institutions (see Note 7). During March 2020 and April 2020, we raised approximately $1.5 million in gross proceeds, before expenses, through sales of our common stock and in April 2020 we received a $1.1 million PPP Loan. On June 8, 2020, we raised an additional $5.5 million in gross proceeds, before expenses, through the sale of our common stock and on July 27, 2020, we raised an additional $10.75 million in gross proceeds, before expenses, through sales of our common stock. On January 19, 2021, we raised an additional $8.0 million in gross proceeds, before expenses, through the sale of our common stock, and on January 22, 2021, we raised an additional $6.25 million in gross proceeds, before expenses, through sales of our common stock.\nIn April 2020, the Company experienced a significant reduction in advertiser marketing budgets across both the ValidClick and IntentKey platforms as a direct consequence of COVID-19. These reductions have adversely impacted our overall revenue throughout 2020. We are unable at this time to quantify the ultimate long-term impact on our company. As a result, in May 2020 and June 2020 we implemented a temporary compensation change for senior officers and employees. Certain employees with salaries in excess of $100,000 per year had forgone a percentage of their salary. We have curtailed expenses, including compensation and travel for the months of May and June, and we issued a work from home policy to protect our employees and their families from virus transmission associated with co-workers. As a result of this uncertainty we are focusing our resources on areas we believe have immediate revenue potential and attempting to reduce expenses where necessary with as little disruption on our daily operations as possible. Should revenues continue to turn downwards or fail to return to historical levels, we may not be able to offset expenses quickly enough.\nOn October 7, 2020, we held a Special Meeting of Stockholders for the purpose of approving and adopting the ratification and validation of the amendment to our articles of incorporation to increase the number of authorized shares of common stock that we may issue from 60,000,000 to 100,000,000. The proposal was approved.\nOn December 16, 2020, stockholders approved an amendment to our articles of incorporation increasing the number of authorized shares of common stock, $0.001 par value per share from 100,000,000 to 150,000,000.\nRevisions of Previously Issued Consolidated Financial Statements\nDuring the second quarter of 2020, the Company identified an error in the accounting for deferred tax asset valuation allowance originating in 2012 and continuing in its previously issued 2019 annual consolidated financial statements and the first quarter of 2020. Although the Company assessed the materiality of the error and concluded that the error was not material to the previously issued annual or interim financial statements, the Company is revised its previously issued 2019 annual balance sheet to correct for the error in connection with the filing of its Quarterly Report on Form 10-Q for the period ended June 30, 2020. Additionally, in connection with the filing of this Annual Report on Form 10-K, the Company has disclosed the impact of the revision to the consolidated balance sheet to correct for the impact of the error. See Note 19, \"Revisions of Previously Issued Consolidated Year-end Financial Statements\" for reconciliations between as reported and as revised amounts as of and for the period ended December 31, 2019 and 2018.\nNote 2 - Summary of Significant Accounting Policies\nBasis of presentation - The consolidated financial statements include our accounts and those of our wholly-owned subsidiaries. All intercompany accounts and transactions have been eliminated in consolidation.\nCash and cash equivalents - Cash and cash equivalents consist of highly liquid investments with original maturities of three months or less.\nRevenue recognition - Most of our revenue is generated through clicks on advertisements presented on our properties or those of our partners. We recognize revenue from clicks in the period in which the click occurs. Payments to partners who display advertisements on our behalf are recognized as cost of revenue. Revenue from data sales and commissions is recognized in the period in which the transaction occurs and the other revenue recognition criteria are met. Revenues are recognized when control of the promised goods or services is transferred to our customers, in an amount that reflects the consideration we expect to be entitled to in exchange for those goods or services. We also recognize revenue from serving impressions when we complete all or a part of an order from an advertiser. The revenue is recognized in the period that the impression is served.\nThe below table is the proportion of revenue that is generated through advertisements on our ValidClick and IntentKey platforms:\nFor the Years Ended December 31,\n2020 2019\nValidClick Platform $ 34,233,638 76.7% $ 53,006,638 86.2%\nIntentKey Platform 10,406,369 23.3% 8,518,576 13.8%\nTotal $ 44,640,007 100.0% $ 61,525,214 100.0%\nAccounts receivable - Accounts receivable consists of trade receivables from customers. We record accounts receivable at its net realizable value, recognizing an allowance for doubtful accounts based on our best estimate of probable credit losses on our existing accounts receivable. Balances are written off against the allowance after all means of collection have been exhausted and the possibility of recovery is considered remote.\nMarketing costs - Marketing costs or Traffic Acquisition Costs (\"TAC\") include the purchase of sponsored listings from search engines and is our primary method of attracting consumers to our owned and operated applications and websites. We expense these costs as incurred and present them as a separate line item in operating expenses in the consolidated statements of operations.\nProperty and equipment - Property and equipment are stated at cost, net of accumulated depreciation and amortization. Major renewals and improvements are capitalized while maintenance and repairs which do not improve or extend the life of the respective assets are expensed as incurred. Costs of assets sold or retired and the related accumulated depreciation are eliminated from accounts and the net gain or loss is reflected as an operating expense in the consolidated statements of operations.\nProperty and equipment are depreciated on a straight-line basis over three years for equipment, five to seven years for furniture and fixtures and two to three years for software. Leasehold improvements are amortized over the lesser of the estimated useful life of the asset or the remaining term of the lease. Depreciation expense was $1,372,426 and $1,680,104, respectively, for the years ended December 31, 2020 and 2019.\nCapitalized Software Costs - We capitalize certain costs related to internally developed software and amortize these costs using the straight-line method over the estimated useful life of the software, generally two years. We do not sell internally developed software. Certain development costs not meeting the criteria for capitalization, in accordance with ASC 350-40 Internal-Use Software, are expensed as incurred.\nGoodwill - Goodwill is recorded as the difference, if any, between the aggregate consideration paid for an acquisition and the fair value of the net tangible and intangible assets acquired. ASU 2017-04 simplifies the accounting for goodwill impairments by eliminating the requirement to compare the implied fair value of goodwill with its carrying amount as part of step two of the goodwill impairment test referenced in Accounting Standards Codification (“ASC”) 350, Intangibles - Goodwill and Other (“ASC 350”). As a result, we perform our annual goodwill impairment test by comparing the fair value of our reporting unit with its carrying amount.\nWe generally determine the fair value of our reporting unit using the income approach methodology of valuation that includes the undiscounted cash flow method as well as other generally accepted valuation methodologies. If the carrying amount of a reporting unit exceeds the reporting unit’s fair value, the amount it exceeds fair value is equivalent to the amount of impairment loss.\nWe determined there was no impairment of goodwill during 2020 and 2019.\nSee Note 5, Intangible Assets and Goodwill, for more information.\nIntangible Assets - We allocate a portion of the purchase price of acquisitions to identifiable intangible assets and we amortize definite-lived assets over their estimated useful lives. We consider our indefinite-lived assets for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Trade names are not amortized as they are believed to have an indefinite life. Trade names are reviewed annually for impairment under ASC 350. We also acquire intangible assets outside of acquisitions and record them at their fair value and amortize them over their estimated useful lives.\nWe recorded no impairment of intangible assets during 2020 or 2019.\nIn 2019, we recorded $2.57 million in intangible assets from the CPT Merger Termination Agreement. An independent valuation of the assets was performed to determine the carrying value of the assets listed above. See Note 1 - Organization and Business.\nSee Note 5, Intangible Assets and Goodwill, for more information.\nIncome taxes - We utilize the liability method of accounting for income taxes as set forth in ASC 740, Income Taxes (“ASC 740”). Under the liability method, deferred taxes are determined based on the temporary differences between the financial statement and tax bases of assets and liabilities. A valuation allowance is recorded when it is more likely than not that some of the deferred tax assets will not be realized. In assessing the need for a valuation allowance, we must project future levels of taxable income. We examine evidence related to the history of taxable losses or income, the economic conditions in which we operate, organizational characteristics, our forecasts and projections, as well as factors affecting liquidity. All our deferred tax assets and liabilities are recorded as long-term assets and liabilities in the consolidated balance sheets. We believe it is more likely than not that essentially none of our deferred tax assets will be realized, and we have recorded a valuation for a significant portion of the net deferred tax assets as of December 31, 2020 and 2019.\nWe have adopted certain provisions of ASC 740. This statement clarifies the criteria that an individual tax position must satisfy for some or all of the benefits of that position to be recognized in a company’s financial statements. ASC 740 prescribes a recognition threshold of more likely than not, and a measurement attribute for all tax positions taken or expected to be taken on a tax return, in order to be recognized in the financial statements.\nImpairment of long-lived assets - In accordance with ASC 360, Property, Plant and Equipment, long-lived assets, such as property and equipment, and purchased intangibles subject to amortization, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Recoverability of the asset is measured by comparison of the carrying amount to future undiscounted cash flows the asset is expected to generate. If such assets are considered to be impaired, the impairment to be recognized is measured as the amount by which the carrying amount of the asset exceeds the fair value.\nStock-based compensation - We value stock compensation based on the fair value recognition provisions ASC 718, Compensation - Stock Compensation, which establishes accounting for stock-based awards exchanged for employee services and requires companies to expense the estimated grant date fair value of stock awards over the requisite employee service period.\nThe fair value of restricted stock awards is based on the market price of our common stock on the date of the grant. To value stock option awards, we use the Black-Scholes-Merton option pricing model. This model involves assumptions including the expected life of the option, stock price volatility, risk-free interest rate, dividend yield and exercise price. We recognize compensation expense in earnings over the requisite service period, applying a forfeiture rate to account for expected forfeitures of awards.\nSee Note 13, Stock-Based Compensation, for further details on our stock awards.\nGovernment Grant- During the first quarter of 2013, we received a grant from the state of Arkansas to relocate our corporate headquarters to Conway, AR. We recognized the grant funds into income as a reduction of the related expense in the period in which those expenses were recognized. We deferred grant funds related to capitalized costs and classified them as current or long-term liabilities on the balance sheet according to the classification of the associated asset.\nAs of December 31, 2020, there were 38 employees in Arkansas, twelve employees under the required 50. As such, we recorded a contingent liability $60,000.\nAs of December 31, 2019, there were 33 employees in Arkansas, seventeen employees under the required 50. As such, we recorded a contingent liability $85,000.\nTreasury Stock - The cost method was used in recording the purchase of the treasury stock. Treasury stock changes as a result of common stock we acquire in the market. On July 14, 2020, our Board of Directors authorized the cancellation of 376,527 shares of treasury stock.\nEarnings per share - During the periods presented, we had securities that could potentially dilute basic earnings per share in the future, but were excluded from the computation of diluted net loss per share, as their effect would have been anti-dilutive. We reported a net loss for 2020 and 2019 and therefore, shares associated with stock options, restricted stock and convertible debt are not included because they are anti-dilutive. Basic and diluted net loss per share is the same for all periods presented.\nOperating segments - In accordance with ASC 280 - Segment reporting, segment information reported is built on the basis of internal management data used for performance analysis of businesses and for the allocation of resources. Operating segments are defined as components of an enterprise about which separate financial information is available that is evaluated regularly by the chief operating decision maker, or decision making group, in deciding how to allocate resources and in assessing performance. The Company’s chief operating decision maker, its chief executive officer, reviews financial information presented on a consolidated basis and no expense or operating income is evaluated at a segment level. Given the consolidated level of review by the Company’s chief executive officer, the Company operates as one reportable segment.\nConcentration of credit risk - We are exposed to concentrations of risk primarily in cash and accounts receivable, which are generally not collateralized. Our policy is to place our cash with high credit, quality financial institutions in order to limit the amount of credit exposure. Our cash deposits exceed FDIC limits. We do not require collateral from our customers, but our credit extension and collection policies include monitoring payments and aggressively pursuing delinquent accounts. We maintain allowances for potential credit losses.\nCustomer concentrations - At December 31, 2020, we had two individual customers with accounts receivable balances greater than 10% of the gross accounts receivable. These customers combined owed approximately 35.4% of our gross accounts receivable balance as of December 31, 2020. The same two customers accounted for 60.5% of our revenue for the year ended December 31, 2020.\nIn 2019, we had two individual customers with accounts receivable balances greater than 10% of the gross accounts receivable. These customers combined owed approximately 60.0% of our gross accounts receivable balance as of December 31, 2019. The same two customers accounted for 78.5% of our revenue for the year ended and December 31, 2019.\nUse of estimates - The preparation of financial statements, in accordance with accounting principles generally accepted in the United States (\"U.S. GAAP\"), requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, net revenues and expenses and disclosure of contingent assets and liabilities. The estimates and assumptions\nused in the accompanying consolidated financial statements are based upon management’s regular evaluation of the relevant facts and circumstances as of the date of the consolidated financial statements. We regularly evaluate estimates and assumptions related to allowances for doubtful accounts, goodwill and purchased intangible asset valuations, valuation of long-lived assets, income tax valuation allowance and derivative liability. Actual results may differ from the estimates and assumptions used in preparing the accompanying consolidated financial statements, and such differences could be material.\nLitigation and settlement costs - From time to time, we are involved in disputes, litigation and other legal actions. In accordance with ASC 450, Contingencies, we record a charge equal to at least the minimum estimated liability for a loss contingency when both of the following conditions are met: (i) information available prior to issuance of the consolidated financial statements indicates that it is probable that an asset had been impaired or a liability had been incurred as of the date of the consolidated financial statements and (ii) the range of loss can be reasonably estimated.\nAdditional accounting pronouncements\nIn February 2016, the FASB issued Accounting Standards Update (\"ASU\") No. 2016-02, Leases (Topic 842) (ASU 2016-02), as amended, which generally requires lessees to recognize operating and financing lease liabilities and corresponding right-of- use assets on the balance sheet and to provide enhanced disclosures surrounding the amount, timing and uncertainty of cash flows arising from leasing arrangements. We adopted the new standard effective January 1, 2019 on a modified retrospective basis and did not restate comparative periods. We elected the package of practical expedients permitted under the transition guidance, which allowed us to carryforward our historical lease classification, our assessment on whether a contract is or contains a lease, and our initial direct costs for any leases that exist prior to adoption of the new standard. We also elected to combine lease and non-lease components and to keep leases with an initial term of 12 months or less off the balance sheet and recognize the associated lease payments in the consolidated statements of income on a straight-line basis over the lease term. Based on the present value of the lease payments for the remaining lease term of the Company's existing leases, the Company recognized right-of-use assets and lease liabilities for operating leases of approximately $1.2 million and finance leases of approximately $265,000, respectively, on January 1, 2019.\nIn January 2017, the FASB issued ASU 2017-04, Intangibles-Goodwill and Other (Topic 350)-Simplifying the Test for Goodwill Impairment (“ASU 2017-04”). ASU 2017-04 simplifies the accounting for goodwill impairments by eliminating the requirement to compare the implied fair value of goodwill with its carrying amount as part of step two of the goodwill impairment test referenced in Accounting Standards Codification (“ASC”) 350, Intangibles - Goodwill and Other (“ASC 350”). As a result, an entity should perform its annual, or interim, goodwill impairment test by comparing the fair value of a reporting unit with its carrying amount. An impairment charge should be recognized for the amount by which the carrying amount exceeds the reporting unit’s fair value. However, the impairment loss recognized should not exceed the total amount of goodwill allocated to that reporting unit. ASU 2017-04 is effective for annual reporting periods beginning after December 15, 2019, including any interim impairment tests within those annual periods, with early application permitted for interim or annual goodwill impairment tests performed on testing dates after January 1, 2017. In January 2019, we elected to early adopt ASU 2017-04, and the adoption had no impact on our consolidated financial statements. We will perform future goodwill impairment tests according to ASU 2017-04.\nRecent Accounting Pronouncements Not Yet Adopted\nIn June 2016, (FASB) issued ASU No. 2016-13, Financial Instruments-Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments (ASU 2016-13), which requires the measurement and recognition of expected credit losses for financial assets held at amortized cost. ASU 2016-13 replaces the existing incurred loss impairment model with a forward- looking expected credit loss model which will result in earlier recognition of credit losses. On November 15, 2019, the FASB delayed the effective date certain small public companies and other private companies. As amended, the effective date of ASC Topic 326 was delayed until fiscal years beginning after December 15, 2022 for SEC filers that are eligible to be smaller reporting companies under the SEC’s definition, as well as private companies and not-for-profit entities.\nReclassifications\nCertain amounts previously presented for prior periods have been reclassified to conform to the current presentation. The reclassifications had no effect on net loss, working capital or equity previously reported.\nNote 3 - Allowance for Doubtful Accounts\nThe activity in the allowance for doubtful accounts was as follows during the years ended December 31, 2020 and 2019:\n2020 2019\nBalance at the beginning of the year $ 225,000 $ 63,727\nProvision for bad debts 135,000 189,441\nCharge-offs (150,333) (28,168)\nBalance at the end of the year $ 209,667 $ 225,000\nNote 4- Property and Equipment\nThe net carrying value of property and equipment at December 31, 2020 and 2019 was as follows:\n2020 2019\nFurniture and fixtures $ 293,152 $ 293,152\nEquipment 1,052,199 1,025,357\nSoftware 11,475,683 10,309,298\nLeasehold improvements 421,016 421,016\nSubtotal $ 13,242,050 $ 12,048,823\nLess: accumulated depreciation and amortization (12,054,989) (10,674,671)\nTotal $ 1,187,061 $ 1,374,152\nNote 5 - Intangible Assets and Goodwill\nThe following is a schedule of intangible assets and goodwill as of December 31, 2020:\nTerm Carrying\nValue Accumulated Amortization and Impairment Net Carrying Value 2020\nAmortization\nCustomer list, Google 20 years $ 8,820,000 $ (3,895,500) $ 4,924,500 $ 441,000\nTechnology 5 years 3,600,000 (2,820,000) 780,000 720,000\nCustomer list, ReTargeter (2) 5 years 1,931,250 (547,188) 1,384,062 386,250\nCustomer list, all other 10 years 1,610,000 (1,422,202) 187,798 161,004\nBrand name, ReTargeter (2) 5 years 643,750 (182,396) 461,354 128,750\nCustomer relationships 20 years 570,000 (111,625) 458,375 28,500\nTrade names, web properties (1) - 390,000 - 390,000 -\nIntangible assets classified as long-term $ 17,565,000 $ (8,978,911) $ 8,586,089 $ 1,865,504\nGoodwill, total $ 9,853,342 $ - $ 9,853,342 $ -\nThe following is a schedule of intangible assets and goodwill as of December 31, 2019:\nTerm Carrying\nValue Accumulated Amortization Net Carrying Value 2019\nAmortization\nCustomer list, Google 20 years $ 8,820,000 $ (3,454,500) $ 5,365,500 $ 441,000\nTechnology 5 years 3,600,000 (2,100,000) 1,500,000 720,000\nCustomer list, ReTargeter (2) 5 years 1,931,250 (160,938) 1,770,312 160,938\nCustomer list, all other 10 years 1,610,000 (1,261,198) 348,802 161,004\nBrand name, ReTargeter (2) 5 years 643,750 (53,646) 590,104 53,646\nCustomer relationships 20 years 570,000 (83,125) 486,875 28,500\nTradenames, web properties (1) - 390,000 - 390,000 -\nIntangible assets classified as long-term $ 17,565,000 $ (7,113,407) $ 10,451,593 $ 1,565,088\nGoodwill, total $ 9,853,342 $ - $ 9,853,342 $ -\n___________\n(1)The trade names related to our web properties have an indefinite life, and as such are not amortized.\n(2)We recorded $2.57 million in intangible assets from the CPT Merger Termination Agreement. An independent valuation of the assets was performed to determine the carrying value of the assets listed above. See Note 1 - Organization and Business.\nOur amortization expense over the next five years and thereafter is as follows:\n2021 $ 1,865,504\n2022 1,071,294\n2023 984,500\n2024 769,917\n2025 469,500\nThereafter 3,035,374\nTotal $ 8,196,089\nNote 6 - Bank Debt\nThe following table summarizes our outstanding bank debt balances:\nDecember 31, 2020 December 31, 2019\nFinanced receivables - 5.75 percent at December 31, 2019 (prime plus 1 percent) on invoice receivables; 6.75 percent at December 31, 2019 (prime plus 2 percent) on uninvoiced receivables\n- 3,381,364\nTotal $ - $ 3,381,364\nOn March 1, 2012, we entered into a Business Financing Agreement with Bridge Bank, which is now owned by Western Alliance Bank. The agreement provided us with a revolving credit line of up to $10 million which we used to help satisfy our working capital needs. On October 11, 2018, we entered into the Amended and Restated Financing Agreement with Western Alliance Bank which superseded the Business Financing Agreement, as amended. The material terms of the Amended and Restated Financing Agreement included financing eligible invoiced receivables at an advance rate of 85% and an interest rate of prime plus 1% and a sub-limit of up to $2.5 million of uninvoiced eligible receivables at an advance rate of 75% and an interest rate of prime plus 2%. The sub-limit provision expired at the end of April 2019. The Amended and Restated Financing Agreement included certain fees; a facility fee of $11,765 due at closing; an annual facility fee of 0.25% of the account balance due beginning on April 20, 2019; a monthly maintenance fee of 0.125% of the ending daily account balance; a $30,000 fee in lieu of a warrant; and $80,000 due upon termination of the agreement or repayment of our obligations under the agreement. The Amended and Restated Financing Agreement was secured by all of our assets. On April 30, 2019, under the terms of the Second Amendment, Western Alliance Bank agreed to extend the $2.5 million sub-limit provision of uninvoiced eligible receivables until the earlier of May 31, 2019 or three days after the closing of the Mergers, among other terms.\nOn June 6, 2019, we entered into the Third Amendment to the Amended and Restated Financing. The Third Amendment provided that with respect to the eligible unbilled receivable sublimit of $2,500,000, which expired May 31, 2019 under the Amended and Restated Financing Agreement, that: (i) lender had no obligation to finance unbilled receivables but may do so in its discretion; and (ii) lender may terminate financing of unbilled receivables upon written notice. The Third Amendment also imposed an amendment fee of $2,000. The Business Financing Agreement expired and at December 31, 2020 there were no outstanding balances due.\nOn March 12, 2020, we closed on the Loan and Security Agreement dated February 28, 2020 with Hitachi. Under the terms of the Loan and Security Agreement, Hitachi has provided us with a $5,000,000 line of credit commitment. We are permitted to borrow (i) 90% of the aggregate Eligible Accounts Receivable, plus (i) the lesser of 75% of the aggregate Unbilled Accounts Receivable or 50% of the amount available to borrow under (i), up to the maximum credit commitment. On March 12, 2020, we drew $5,000,000 under this agreement, using $2,959,573 of these proceeds to satisfy all of our obligations under the Western Alliance Bank credit agreement and the balance was used for working capital. Following the satisfaction of our obligations to Western Alliance Bank, all agreements with that entity have been terminated. We pay Hitachi a monthly interest at the rate of 2% in excess of the Wall Street Journal Prime Rate, with a minimum rate of 6.75% per annum, on outstanding amounts. The principal and all accrued but unpaid interest are due on demand. The Agreement contains certain affirmative and negative covenants to which we are subject. As of December 31, 2020, we were in compliance or obtained a waiver for these covenants.\nWe agreed to pay Hitachi a commitment fee of $50,000, with one half due upon the execution of the agreement and the balance due six months thereafter. Thereafter, we are obligated to pay Hitachi a commitment fee of $15,000 annually. We are also obligated to pay Hitachi a quarterly service fee of 0.30% on the monthly unused amount of the maximum credit line. In addition to a $2,000 document fee we have paid to Hitachi, if we exit our relationship with Hitachi before March 1, 2022, we are obligated to pay Hitachi an exit fee of $50,000. At December 31, 2020 there were no outstanding balances due under the Loan and Security Agreement.\nNote 7 - Convertible Promissory Note\nOn March 1, 2019, Inuvo entered into a Securities Purchase Agreement with three accredited investors for the purchase and sale of an aggregate of $1,440,000 of principal of Original Issue Discount Unsecured Subordinated Convertible Notes due September 1, 2020 (the “Calvary Notes”) to fund working capital and additional expenses resulting from the delay in closing of the Mergers associated with the government shut down. The initial conversion price of the Calvary Notes was $1.08 per share which would have made the Calvary Notes then convertible into 1,333,333 unregistered shares of Inuvo’s common stock upon conversion. The Calvary Notes were issued in a private placement and the shares of common stock issuable upon conversion are restricted, subject to resale under Rule 144. The proceeds to Inuvo from the offering were $1,200,000. Inuvo did not pay any commissions or finders fees in connection with the sale of the Calvary Notes and Inuvo utilized the proceeds for working capital. The Calvary Notes are reported net of unamortized original issue discounts and initial value attributed to the bifurcated embedded conversion feature.\nEffective April 20, 2020, the Company and the holder of the remaining Calvary Notes due September 1, 2020 in the principal amount of $315,000 as modified under that certain Note Modification and Release Agreement effective November 11, 2019, agreed to amend the note to extend the maturity date to December 31, 2020 and reduce the conversion price to $0.175 per share. On April 21, 2020, the noteholder converted $200,000 principal amount due under the note into 1,142,857 shares of our common stock. On May 5, 2020, the noteholder converted the final $115,000 principal amount due under the note into 657,143 shares of our common stock, thereby satisfying the note in full.\nConsideration of Down Round Price Adjustment\nThe Calvary Notes contained certain triggers that created adjustments to the conversion ratio, which provided down round protection to the holders. Because the conversion feature has been bifurcated as an embedded derivative and is marked to fair value at each reporting period, the actual occurrence of a trigger and the resulting adjustment to the conversion rate did not require any additional accounting treatment at the time of the price adjustment. Rather, the next fair value computation reflects the new terms of the conversion feature.\nOn July 15, 2019, we closed on an underwritten public offering of 13,750,000 shares at an offering price of $0.30 per share. As a result, this triggered a corresponding adjustment to the conversion ratio in the Calvary Notes to $0.30. The fair value of the embedded derivative reflected these terms at December 31, 2019.\nModifications/Extinguishment\nOn November 11, 2019 we entered into Note Modification and Release Agreements with the holders of $1,080,000 principal amount of the Calvary Notes. Under the terms of the Note Modification and Release Agreement, the parties agreed that in consideration of such noteholder’s agreement to convert a minimum of 50% of the outstanding amount of the note (the “First Conversion Amount”) that the conversion price for the First Conversion Amount would be $0.265 per share and that the conversion price for any remaining amount due under the note would be $0.30 per share, subject to future adjustments under the terms of the note including dilutive issuances at a price below $0.30 per share, subject to a floor of $0.23 per share. The agreement contains mutual general releases. These holders converted an aggregate of $765,000 due under the Calvary Notes into 2,886,792 shares of our common stock. Immediately prior to the conversion, the carrying value of the derivative was marked-to-market. Upon converting, the issued shares were recorded at their fair value of $0.29 per share. This resulted in a loss on extinguishment. Both the loss due to the marking to market and the loss on extinguishment totaling approximately $193,000 were recorded to other income, net.\nIn January 2020, a noteholder of a $360,000 principal amount Calvary note converted the note into 1,200,000 shares of our common stock. The carrying value of the bifurcated derivative was marked-to-market immediately prior to the conversion. Upon conversion, the issued shares were recorded at their fair value. Both the loss due to the marked-to-market and loss on extinguishment of approximately $69,000 were recorded to other income, net.\nUpon the April 2020 conversion, we relieved a proportional amount ($200,000 of $315,000 or 63.49%) of the adjusted carrying values of bifurcated conversion option and the debt host, and recorded the issued shares at their fair value of $0.22 per share. This resulted in a gain on extinguishment of $9,258 and was recorded to other income, net.\nUpon the May 2020 conversion, we relieved the remaining amount ($115,000 of $115,000 or 100%) of the adjusted carrying values of bifurcated conversion option and the debt host, and recorded the issued shares at their fair value of $0.31 per share. This resulted in a loss on extinguishment of $6,201 other income, net.\nNote 8 - Derivative Liability\nDerivative contracts are recorded at fair value under ASC 820 using quoted market prices and significant other observable inputs. Fair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. The fair value hierarchy distinguishes between (1) market participant assumptions developed based on market data obtained from independent sources (observable inputs) and (2) an entity’s own assumptions about market participant assumptions developed based on the best information available in the circumstances (unobservable inputs). The fair value hierarchy consists of three broad levels, which gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1) and the lowest priority to unobservable inputs (Level 3). The three levels of the fair value hierarchy are described below:\nLevel 1-Unadjusted quoted prices in active markets that are accessible at the measurement date for identical, unrestricted assets or liabilities.\nLevel 2-Inputs other than quoted prices included within Level 1 that are observable for the asset or liability, either directly or indirectly, including quoted prices for similar assets or liabilities in active markets; quoted prices for identical or similar assets or liabilities in markets that are not active; inputs other than quoted prices that are observable for the asset or liability (e.g., interest rates); and inputs that are derived principally from or corroborated by observable market data by correlation or other means.\nLevel 3-Inputs that are both significant to the fair value measurement and unobservable.\nAt December 31, 2019, we recorded a derivative liability of $182,250 related to the modification and extinguishment of the convertible promissory note discussed in Note 7 - Convertible Promissory Note. In accordance with the guidance above, the fair value of the derivative liability is considered \"Level 3.\"\nNote 9 - Accrued Expenses and Other Current Liabilities\nAccrued expenses and other current liabilities consist of the following at December 31, 2020 and 2019:\n2020 2019\nAccrued marketing costs (TAC) $ 3,234,192 $ 2,200,014\nAccrued expenses and other 440,578 1,152,267\nAccrued commissions and payroll 423,373 115,707\nArkansas grant contingency 60,000 85,000\nAccrued sales allowance 50,000 50,000\nAccrued taxes, current portion 8,305 11,445\nTotal $ 4,216,448 $ 3,614,433\nNote 10 - Other Long-Term Liabilities\nOther long-term liabilities consist of the following at December 31, 2020 and 2019:\n2020 2019\nDeferred revenue 420,000 -\nSBA loan 149,900 -\nDeferred rent 4,057 57,162\nTotal $ 573,957 $ 57,162\nNote 11 - Commitments\nIn March 2020, we entered into an agreement to allow a third party to license and use ValidClick technology. The agreement required a nonrefundable fee of $500,000 in March with subsequent fees as earned in later quarters. The $500,000 fee was recorded as deferred revenue in March 2020. We are committed to paying a monthly development royalty and marketing services fee when certain adjusted gross profit targets are achieved. For the year ended December 31, 2020, approximately $79,000 has been recognized as other income and approximately $420,000 as deferred revenue.\nNote 12 - Income Taxes\nThe provision for income taxes consists of the following at December 31, 2020 and 2019:\n2020 2019\nCurrent tax provision $ - $ -\nDeferred tax benefit - (334,394)\nTotal tax benefit $ - $ (334,394)\nA reconciliation of the expected Federal statutory rate to our actual rate as reported for each of the periods presented is as follows:\n2020 2019\nFederal statutory rate 21 % 21 %\nState income tax rate, net of federal benefit - % 1 %\nPermanent differences 3 % (3 %)\nChange in valuation allowance (25 %) (12 %)\n- % 7 %\nDeferred Income Taxes\nDeferred income taxes are the result of temporary differences between book and tax basis of certain assets and liabilities, timing of income and expense recognition of certain items and net operating loss carry-forwards.\nWhen required, the Company records a liability for unrecognized tax positions, defined as the aggregate tax effect of differences between positions taken on tax returns and the benefits recognized in the financial statements. Tax positions are measured at the largest amount of benefit that is greater than fifty percent likely of being realized upon ultimate settlement. No tax benefits are recognized for positions that do not meet this threshold. The Company has no uncertain tax positions that\nrequire the Company to record a liability. The federal income tax returns of the Company are subject to examination by the IRS, generally for three years after they are filed.\nWe assess temporary differences resulting from different treatments of items for tax and accounting purposes. These differences result in deferred tax assets and liabilities, which are recorded in the consolidated balance sheets. We evaluate the realizability of our deferred tax assets on a regular basis, an exercise that requires significant judgment. In the course of this evaluation we considered our recent history of tax losses, the economic conditions in which we operate, recent organizational changes and our forecasts and projections. We believe it is more likely than not that essentially none of our deferred tax assets will be realized, and we have recorded a valuation allowance for a significant portion of the net deferred tax assets that may not be realized as of December 31, 2020 and 2019.\nThe following is a schedule of the deferred tax assets and liabilities as of December 31, 2020 and 2019:\n2020 2019\nDeferred tax assets:\nNet operating loss carry forward $ 36,484,500 $ 32,742,350\nIntangible assets 447,700 686,400\nAccrued expense 211,600 223,100\nDeferred rent 18,000 15,700\nAllowance for doubtful accounts 58,800 61,700\nOther 472,500 258,600\nSubtotal 37,693,100 33,987,850\nLess valuation allowance (35,848,400) (32,075,650)\nTotal 1,844,700 1,912,200\nDeferred tax liabilities:\nIntangible assets and property and equipment 1,449,900 1,989,800\nOther 501,800 29,400\nTotal 1,951,700 2,019,200\nTotal deferred tax liabilities $ (107,000) $ (107,000)\nThe net operating losses amounted to approximately $102,756,587 and expire beginning 2022 through 2037. Pursuant to Internal Revenue Service Code Section 382, the use of certain of the Company’s net operating loss carry forwards are limited due to a cumulative change in ownership.\nWe are currently open to audit under the statute of limitations by the Internal Revenue Service for the years ending December 31, 2017 through 2019. Our state income tax returns are open to audit under the statute of limitations for the same periods.\nWe recognize interest and penalties related to income taxes in income tax expense. We have incurred no penalties and interest for the years ended December 31, 2020 and 2019.\nNote 13 - Stock-Based Compensation\nWe maintain a stock-based compensation program intended to attract, retain and provide incentives for talented employees and directors and align stockholder and employee interests. During the 2020 and 2019 periods, we granted options and restricted stock units (\"RSUs\") from the 2010 Equity Compensation Plan (“2010 ECP”) and the 2017 Equity Compensation Plan (“2017 ECP”). The 2010 ECP expired by its terms in April 2020. Option and RSUs vesting periods are generally up to three years and/ or achieving certain financial targets.\nCompensation Expense\nWe recorded stock-based compensation expense for all equity incentive plans of $858,683 and $789,914 for the years ended December 31, 2020 and 2019, respectively. Total compensation cost not yet recognized at December 31, 2020 was $20,122 to be recognized over a weighted-average recognition period of less than one year.\nAward Information and Activity\nOn August 14, 2019, the Inuvo Nominating, Corporate Governance and Compensation Committee approved modifications to the outstanding RSU grants under the 2010 and 2017 ECP plans. The modifications include deeming the performance criteria for the performance based RSU grants with a measurement period based on June 30, 2019 as met and vested. In addition, any remaining RSU grants outstanding were modified to vest in three equal parts on August 19, 2019, January 1, 2020 and July 1, 2020 as long as the grantee is employed by Inuvo on the vesting date.\nOn August 21, 2019 our board of directors adopted, subject to stockholder approval, an amendment to our 2017 ECP to increase in the number of shares reserved for issuance upon grants made under the plan by an additional 6,800,000 shares of our common stock. The stockholders approved the amendment to our 2017 ECP at the annual stockholders meeting on October 4, 2019.\nOn January 1, 2020, in accordance with the plan provisions, the number of shares available for issuance under the 2017 and 2010 ECP plans were increased by 150,000 and 250,000 shares, respectively.\nThe following table summarizes the stock grants outstanding under our 2010 ECP and 2017 ECP plans as of December 31, 2020:\nOptions Outstanding RSUs Outstanding Options and RSUs Exercised Available Shares Total\n2017 ECP - 972,860 1,485,473 6,791,667 9,250,000\n2010 ECP (*) 9,500 957,666 4,084,095 - 5,051,261\nTotal 9,500 1,930,526 5,569,568 6,791,667 14,301,261\n(*) Expired April 2020\nThe fair value of restricted stock units is determined using market value of the common stock on the date of the grant. The fair value of stock options is determined using the Black-Scholes-Merton valuation model. The use of this valuation model involves assumptions that are judgmental and highly sensitive in the determination of compensation expense and include the expected life of the option, stock price volatility, risk-free interest rate, dividend yield, exercise price, and forfeiture rate. Forfeitures are estimated at the time of valuation and reduce expense ratably over the vesting period. The forfeiture rate, which is estimated at a weighted average of 0% of unvested options outstanding, is adjusted periodically based on the extent to which actual forfeitures differ, or are expected to differ, from the previous estimate. At December 31, 2020, the 2010 ECP plan had 9,500 outstanding options and all were exercisable with an aggregate intrinsic value of $0, a weighted average exercise price of $0.56 and a weighted average remaining contractual term of 1.5 years.\nThe following table summarizes our stock option activity under the 2010 ECP plan during 2020:\nOptions Weighted Average Exercise Price\nOutstanding, beginning of year 18,248 $ 1.74\nGranted - $ -\nForfeited, expired or cancelled 8,748 $ 3.01\nExercised - $ -\nOutstanding, end of year 9,500 $ 0.56\nExercisable, end of year 9,500 $ 0.56\nNo options were granted during 2020 or 2019.\nExpected volatility is based on the historical volatility of our common stock over the period commensurate with or longer than the expected life of the options. The expected life of the options is based on the vesting schedule of the option in relation to the overall term of the option. The risk free interest rate is based on the market yield of the U.S. Treasury Bill with a term equal to the expected term of the option awarded. We do not anticipate paying any dividends so the dividend yield in the model is zero.\nThe following table summarizes our restricted stock unit activity for 2020:\nRestricted Stock Unit Weighted Average Fair Value\nOutstanding, beginning of year 2,568,951 $ 0.79\nGranted 587,103 $ 0.44\nExercised 1,202,933 $ 0.31\nForfeited 22,595 $ 0.50\nOutstanding, end of year 1,930,526 $ 0.28\nNote 14 - Stockholders Equity\nEarnings per Share\nDuring the 2020 and 2019, we generated a net loss from continuing operations and as a result, all of our shares are anti-dilutive.\nTreasury Stock\nOn July 14, 2020, our Board of Directors authorized the cancellation of the 376,527 shares of treasury stock.\nNote 15 - Retirement Plan Costs\nWe provide a 401(k) plan to help our employees prepare for retirement where we matched each employee's contributions to the plan up to the first four of the employee's annual salary. The matching contribution for the year ended 2020 was $186,483. The employer match was suspended for 2019.\nNote 16 - Leases\nThe Company has entered into operating and finance leases primarily for real estate and equipment rental. These leases have\nterms ranging from two to four years, and often include one or more options to renew or in the case of equipment rental, to\npurchase the equipment. These operating and finance leases are listed as separate line items on the Company's December 31, 2020 and 2019 consolidated balance sheets and represent the Company’s right to use the underlying asset for the lease term. The Company’s obligations to make lease payments are also listed as a separate line items on the Company's December 31, 2020 and 2019 consolidated balance sheets. Based on the present value of the lease payments for the remaining lease term of the Company's existing leases, the Company recognized right-of-use assets and lease liabilities for operating leases of approximately $1.2 million and finance leases of approximately $265,000, respectively, on January 1, 2019. Operating lease right-of-use assets and liabilities commencing after January 1, 2019 are recognized at commencement date based on the present value of lease payments over the lease term. As of December 31, 2020, total operating and financed right-of-use assets were $606,573 and $395,910, respectively. As of December 31, 2019, total operating and financed right-of-use assets were $756,115 and $88,178, respectively. As of December 31, 2019 the Company has entered into a short-term finance lease for equipment with a remaining term of twelve months or less and is included in the \"Accrued expense and other current liabilities\" section of the 2019 consolidated balance sheet. All operating lease expense is recognized on a straight-line basis over the lease term.\nFor the years-ended December 31, 2020 and 2019, the Company recorded $367,981 and $177,193 in amortization expense related to finance leases.\nBecause the rate implicit in each lease is not readily determinable, the Company uses its incremental borrowing rate to\ndetermine the present value of the lease payments.\nInformation related to the Company's operating lease liabilities for are as follows:\nDecember 31, 2020\nCash paid for operating lease liabilities $ 362,366\nWeighted-average remaining lease term 2.2 years\nWeighted-average discount rate 6.25 %\nDecember 31, 2019\nCash paid for operating lease liabilities\n$ 451,107\nWeighted-average remaining lease term\n2.0 years\nWeighted-average discount rate\n6.25 %\nMinimum future lease payments ended December 31, 2020\n2021 249,417\n2022 246,527\n2023 163,965\n659,909\nLess imputed interest (53,336)\nTotal lease liabilities $ 606,573\nInformation related to the Company's financed lease liabilities are as follows:\nDecember 31, 2020\nCash paid for finance lease liabilities $ 589,504\nWeighted-average remaining lease term 2.3 years\nWeighted-average discount rate 6.25 %\nDecember 31, 2019\nCash paid for finance lease liabilities\n$ 270,312\nWeighted-average remaining lease term\nLess than one year\nWeighted-average discount rate\n6.25 %\nMinimum future lease payments ended December 31, 2020\n2021 260,970\n2022 66,691\n2023 31,366\n359,027\nLess imputed interest (18,808)\nTotal lease liabilities $ 340,219\nNote 17 - Related Party Transactions\nOn March 20, 2020, we sold an aggregate of 3,931,428 shares of our common stock at a purchase price of $0.175 per share to the five members of our Board of Directors in a private placement exempt from registration under Section 4(a)(2) and Rule 506(b) of Regulation D under the Securities Act of 1933, as amended. We received proceeds of $688,000 in this offering. The purchase price of the shares of our common stock sold in the offering exceeded the closing market price of our common stock on March 19, 2020, the trading day immediately preceding the day the binding Insider Subscription Agreements were executed by the purchasers. The purchasers were all accredited investors. We did not pay any commissions or finder’s fees, and we used the proceeds for general working capital.\nIn June 2019, the Company entered into an agreement with First Orion Corp., which is partially owned by two directors and\nshareholders of Inuvo, to provide office space. The lease is for six-months commencing on July 1, 2019 and cost $60,000\nwhich was prepaid in June 2019.\nNote 18 - Subsequent Events\nOn January 7, 2021, we filed the Articles of Amendment to our Articles of Incorporation in the sate of Nevada increasing the number of authorized shares from 100,000,000 to 150,000,000.\nOn January 19, 2021, we closed a registered direct offering of an aggregate of 13,333,334 shares of our common stock, at a price of $0.60 per share, for gross proceeds of $8,000,000, before deducting placement agent fees and other offering expenses.\nOn January 22, 2021, we closed a registered direct offering of an aggregate of 5,681,817 shares of our common stock, at a price of $1.10 per share, for gross proceeds of $6,250,000, before deducting placement agent fees and commission and other offering expenses.\nOn January 28, 2021, we paid off the SBA loan and related interest of $153,930.\nOn February 1, 2021, our Little Rock, Arkansas lease was amended reducing the total office space to 7,831 square feet and adding an additional three years to the lease term. The lease is considered a lease modification under ASC Topic 842 - Leases and will be recorded in the first quarter of 2021.\nNote 19 - Revisions of Previously Issued Consolidated Year-End Financial Statements\nAs described in Note 1, \"Organization and Business,\" the following table sets forth the impact of an error correction on the Company’s consolidated financial statements as of and for the period ended December 31, 2019 by financial statement line item. Most of the deferred tax liabilities arose from the acquisition in 2012. The tax assets with definite lives should have been netted against the tax liabilities with definite lives as required by ASC 740 when evaluating the valuation allowance. Instead, both the tax assets and liabilities were maintained on a gross basis on the balance sheet and the tax assets were entirely offset with a valuation allowance. The effect of the error was deemed immaterial.\nDecember 31, 2019\nConsolidated Balance Sheet Line Item As Previously Reported Adjustments As Revised\nDeferred tax liability $ 2,019,200 $ 1,912,200 $ 107,000\nAccumulated deficit $ 130,958,001 $ (1,912,200) $ 129,045,801\nDecember 31, 2018\nConsolidated Balance Sheet Line Item As Previously Reported Adjustments As Revised\nAccumulated deficit $ 126,469,894 $ (1,912,200) $ 124,557,694"
}