{
    "cik": "843006",
    "company": "ISSUER DIRECT CORP",
    "filing_type": "10-K",
    "filing_date": "2021-03-04",
    "period_of_report": "2020-12-31",
    "sic": "2750",
    "state_of_inc": null,
    "state_location": "NC",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/843006/0001654954-21-002389-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/843006/000165495421002389/isdr_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/843006/0001654954-21-002389.txt",
    "filename": "843006_10K_2020_0001654954-21-002389.htm",
    "item_1": "ITEM 1. DESCRIPTION OF BUSINESS.\nCompany Overview\nIssuer Direct Corporation and its subsidiaries are hereinafter collectively referred to as “Issuer Direct”, the “Company”, “We” or “Our” unless otherwise noted. Our corporate offices are located at One Glenwood Ave., Suite 1001, Raleigh, North Carolina, 27603.\nWe announce material financial information to our investors using our investor relations website, SEC filings, investor events, news and earnings releases, public conference calls, webcasts and social media. We use these channels to communicate with our investors and the public about our company, our products and services and other related matters. It is possible that information we post on some of these channels could be deemed to be material information. Therefore, we encourage investors, the media and others interested in Issuer Direct to review the information we post to all our channels, including our social media accounts.\nWe are a premier provider of communications and compliance technology solutions that are designed to help organizations tell their stories globally. Our principal platform, Platform id.™, empowers users by thoughtfully integrating the most relevant tools, technologies and products, thus eliminating the complexity associated with producing and distributing their business communications and financial information. Platform id. efficiently and effectively helps our customers manage their events when seeking to distribute their messaging to key constituents, investors, markets and regulatory systems around the globe. Platform id. consists of several related but distinct communications and compliance modules that companies utilize every quarter.\nAs our cloud-based subscription business continues to mature, we expect the communications portion of our business to continue to increase over the next several years, both in terms of overall revenue and as compared to the compliance portion of our business. Therefore, as noted below, we have begun to report our revenue as Communications and Compliance revenues rather than Platform & Technology and Services revenues as we have done in the past. Communications revenues grew to 64% of total revenue during 2020, compared to 57% and 45% of our revenue for the years ending December 31, 2019 and 2018, respectively. In 2020, growth from our Communications business was led by the market demands for our events products that were upgraded to handle virtual needs in the industry, as well as our ACCESSWIRE news brand, which drove both subscriptions and pay-as-you-go revenues higher than in prior years.\nWe plan to continue to invest in our Platform id. communications offerings as well as additional offerings that we intend to incorporate into our Communications product lineup. Within most of our target markets, customers require several individual services and/or software providers to meet their investor relations, communications and compliance needs. We believe Platform id. can address all these needs in a single, secure, cloud-based platform - one that offers a customer control, increases efficiencies, demonstrates clear value and, most importantly, delivers consistent and compliant messaging from one centralized platform.\nWe work with a diverse customer base, which includes not only corporate issuers and private companies, but also investment banks, professional firms, such as investor relations and public relations firms, as well as the accounting and legal communities. Our customers and their service providers utilize Platform id. and related solutions from document creation all the way to dissemination to regulatory bodies, news outlets, financial platforms and our customer’s shareholders. Private companies primarily use our news distribution and webcasting products and services to disseminate their message globally. Platform id.’s intelligent subscription platform guides thousands of customers through the process of communicating their message to a large audience.\nWe also work with several select stock exchanges by making available certain parts of our platform under agreements to integrate our offerings within their products. We believe such partnerships will continue to yield increased exposure to a targeted customer base that could impact our revenue and overall brand in the market.\nIn the past we have disclosed revenues in two main categories: (i) Platform and Technology and (ii) Services. However, to be more reflective of our strategy of primarily being a communications company, we have decided to re-categorize and disclose our revenues in the following two main categories: (i) Communications and (ii) Compliance. Set forth below is an infographic depicting the products included in each of these two main categories we provide today:\nCommunications\nOur communications platform consists of our newswire, ACCESSWIRE, our webcasting and events business, professional conference and events software, as well as our investor relations website technology. These products are sold as the leading part of our Platform id. subscription, as well as individually to customers around the globe and further described below.\nACCESSWIRE\nOur press release offering, which is marketed under the brand ACCESSWIRE, is a cost-effective, news dissemination and media outreach service. The ACCESSWIRE product offering focuses on press release distribution for both private and public companies globally. We believe ACCESSWIRE is becoming a competitive alternative to the traditional newswires because we have been able to use our technological advancements to allow customers to self-edit releases or use our editorial staff as desired to edit releases. We also continue to expand our distribution points, improve our targeting and enhance our analytics reporting. During 2020 we released a new e-commerce element to our ACCESSWIRE product, whereby customers can self-select their distribution and then register, upload their press release and tell their story in minutes without contacting a sales or operational employee.\nWe believe the above strategy will enable us to continue to add new customers in 2021 and beyond. We have also been able to maintain high gross margins while providing our customers flexible pricing, with options to pay per release or enter longer-term, flat-fee subscriptions. Currently, ACCESSWIRE is available within our Platform id. subscription, or as a stand-alone offering.\nLike other newswires globally, ACCESSWIRE is dependent upon several key partners for its news distribution. Disruption in any of our partnerships could have a materially adverse impact on ACCESSWIRE and our overall business.\nACCESSWIRE revenues and customers have increased each year compared to the prior year, a trend we expect to continue over the next several years. A significant portion of the growth has been due to increased private company customers, through either direct sales, e-commerce or through partner and reseller relationships.\nWebcasting & Events\nOur webcasting and events business is comprised of our earnings call webcasting solutions and our virtual meeting and events software (such as annual meetings, deal/non-deal road shows, analyst days and shareholder days). The demands for these products with a virtual component were at an all-time high for us in 2020 in large part due to the COVID-19 pandemic, something we expect will continue for the majority of 2021, although, there can be no assurances this high demand will continue in the future.\nTraditional earnings calls and webcasts are a highly competitive space with the majority of the business being driven from practitioners in investor relations and communications firms. We estimate there are approximately 5,000 companies in North America conducting earnings events each quarter that include a teleconference, webcast or both as part of their events. Platform id. also incorporates other elements of the earnings event, including earnings date/call announcement, earnings press release and SEC Form 8-K filings. There are a handful of our competitors that can offer this integrated full-service solution today. However, we believe our real-time event setup and integrated approach offers a more effective way to manage the process, as well, as attract an audience of investors.\nWe have also attempted to differentiate our offering by investing in developing and integrating systems and processes within Platform id. and creating an application programming interface (“API”). This API allows customers, such as financial content sites and investment banks, to query an industry or a single company’s current and past earnings calls and present those webcasts on their platforms. Initially, this has been broadly distributed via our Investor Network platform, with expectations that customers will license this dataset for their platforms in the future. We believe this offering will further increase our brand awareness.\nAdditionally, as a commitment to broadening the reach of our webcast platform, we broadcast live all earnings events, whether they are conducted on our platform or not, within our shareholder outreach module, which helps drive new audiences and give companies the ability to view their analytics and engagement of each event. We believe these analytics, which will be a component of our Insight and Analytics module, will increase the demand for our webcasting platform among the corporate issuer community.\nOur VisualWebcaster Platform (“VWP”) is a leading cloud-based webcast, webinar and virtual meeting platform that delivers live and on-demand streaming of events to audiences of all sizes. VWP allows customers to create, produce and deliver events, which we feel integrates well into Platform id. We believe by acquiring VWP we have significantly strengthened our webcasting product and Platform id. offering as well as acquired over 120 customers, ranging from small private companies to Fortune 500 companies. The VWP technology gives us the ability to host thousands of additional webcasts each year, expanding and diversifying our webcast business from our historical earnings-based events to include any type of virtual event. As we expand our platform, it is vital for us to have solutions that service both our core public companies but also a growing segment of private customers. As a result of COVID-19, most companies have been holding meetings virtually over the past 12 months, which has increased demand for this product. There can be no assurance that this demand will continue after the end of the pandemic.\nProfessional Conference and Events Software\nAt the end of 2018, we released a new module to Platform id., centered around the professional conference organizer (“PCO”). This subscription offering is being licensed to investor conference organizers, which in the aggregate we believe held an estimated 1,000 plus events a year prior to 2020. This number significantly decreased in 2020 and is expected to remain at significantly decreased numbers in the near future and possibly long-term as a result of COVID-19. Our professional conference and events software, which is available as a mobile app, offers organizers, issuers and investors the ability to register, request and approve one-on-one meetings, manage schedules, perform event promotion and sponsorship, print attendee badges and manage lodging. This cloud-based product can be used in a virtual or in person conference setting and is integrated within Platform id. to enhance our communications module subscription offerings of newswire, newsrooms, webcasting and shareholder targeting. We believe this integration gives us a unique offering for PCOs that is not available elsewhere in the market.\nWe believe entering this business expands our current communications revenue base, and as an adjacency, should assist in making Platform id. a platform of choice for investment banks, issuers and investors.\nInvestor Relations Websites\nOur investor relations content network is another component of Platform id., which is used to create the investor relations’ tab of a company’s website. This investor relations content network is a robust series of data feeds including news feeds, stock feeds, fundamentals, regulatory filings, corporate governance and many other components which are aggregated from most of the major exchanges and news distribution outlets around the world. Customers can subscribe to one or more of these data feeds or as a component of a fully designed and hosted website for pre-IPO companies, SEC reporting companies and partners seeking to display our content on their corporate sites. The clear benefit to our investor relations content network is its integration into Platform id. As such, companies can produce content for public distribution and it is automatically linked to their corporate website, distributed to targeted groups and placed into our data feed partners.\nAs what we believe to be a natural expansion to our investor relations website business, we are developing what is known as a “corporate newsroom” in the communications industry, which we plan to expect to bring to market during the year. This product offering will be an add-on to any customer’s ACCESSWIRE account and or their Platform id. subscription. Our intent is to leverage the technology we have in our investor relations content business and focus a module toward all companies, to assist in making their corporate news, media kits and alerts available from our ecosystem to their corporate website.\nCompliance\nOur compliance offerings consist of our disclosure software for financial reporting as well as our stock transfer agency, and related annual meeting, print and shareholder distribution services. Some of these products are sold as part of a Platform id. subscription as well as individually to customers around the globe.\nCompliance Software and Services\nPlatform id.’s disclosure reporting module is a document conversion, editing and filing offering which is designed for reporting companies and professionals seeking to insource the document drafting, editing and filing processes to the SEC’s EDGAR system. Our compliance business also offers companies the ability to use our in-house staff to assist in the conversion, tagging and filing of their documents. We generate revenues in compliance both from software and services and, in most cases, customers have both components within their annual agreements, while others pay for services as they are completed.\nToward the end of 2017, we completed upgrades to our disclosure reporting product to include tagging functionality that meets newly mandated SEC disclosure requirements under Inline XBRL (Inline Extensible Business Reporting Language or “iXBRL”). These requirements will impact most of our customers for the fiscal periods ending on or after June 15, 2021, however, we have had a number of customers already file using our iXBRL upgrades.\nWhistleblower Hotline\nOur whistleblower hotline is an add-on product within Platform id. This system delivers secure notifications and basic incident workflow management processes that align with a company’s corporate governance whistleblower policy. As a supported and subsidized bundle product of the New York Stock Exchange (“NYSE”) offerings, we are introduced to new IPO customers and other larger cap customers listed on the NYSE.\nStock Transfer Module\nA valued subscription add-on in our Platform id. offering is the ability for our customers to gain access to real-time information about their shareholders, stock ledgers and reports and to issue new shares from our cloud-based stock transfer module. Managing the capitalization table of a public company or pre-IPO company is a cornerstone of corporate governance and transparency, and as such companies and community banks have chosen us to assist with their stock transfer needs, including bond offerings and dividend management. This is an industry which has experienced declining overall revenues as it was affected by the replacement of paper certificates with digital certificates. However, we have been focused on selling subscriptions of the stock transfer component of our platform, allowing customers to gain access to our cloud-based system in order to move shares or query shareholders, which we believe has resulted in a more efficient process for both our customers and us.\nAnnual Meeting / Proxy Voting Platform\nDuring early 2020, we upgraded our webcasting and annual meeting platform to bring to market a virtual annual meeting solution. This solution provides our customers the ability to conduct their annual meetings in a fully virtual manner considering the constraints caused by COVID-19. Our solution incorporates shareholder and guest registration, voting integration, real-time stats on attendance, audio video and presentation features as well as fully managed meeting managers and inspector of elections.\nBy adding a component of our webcasting and events business, we were able to offer a complete annual meeting solution, which resulted in us becoming one of the top technology providers of virtual annual meetings in 2020, which incorporated real-time voting. In perspective, during 2019, approximately 300 North American public companies opted for a virtual component to their annual meeting compared to an estimated 4,000+ companies in 2020.\nOur proxy module is marketed as a fully integrated, real-time voting platform for our customers and their shareholders of record. This module is utilized for every annual meeting or special meeting we manage for our customers and offers both full-set mailing and notice of internet availability options.\nShareholder Distribution\nOver the past few years, we have worked on refining the model of digital distribution of our customers’ message to the investment community and beyond. This was accomplished by integrating our shareholder outreach module, Investor Network, into and with Platform id. Most of the customers subscribing to this module today are historical PrecisionIR (“PIR”) - Annual Report Service (“ARS”) users, as well as new customers purchasing the entire Platform id. subscription. We migrated some of the customers from the traditional ARS business into this new digital subscription business, however, we continue to operate a portion of this legacy physical hard copy delivery of annual reports and prospectuses for customers who opt to take advantage of it. We continue to see customer attrition for customers who subscribe to both the electronic and physical distribution of reports as a stand-alone product.\nOur overall strategy includes:\nExpansion of Current Customers\nWe expect to continue to see demand for our products within our customer base and in the industries we serve. As we continue to transition from a services-oriented business, our focus is to migrate customer contracts over to subscription-based contracts for our entire Platform id. offering. We believe this will help us move from a transaction-based revenue model to a recurring subscription-based revenue model, which may give us more consistent, predictable revenue patterns and hopefully create longer lasting customer relationships. Additionally, as part of our customer expansion efforts, we are committed to working beyond the single point of contact and into the entire C suite (CEO, CFO, IRO, Corporate Secretary, etc.) of an organization which we believe will help drive subscription revenues per customer.\nFocus on Organic Growth\nOur primary growth strategy continues to be selling our communications solutions to new customers under a subscription arrangement, whereas in the past we were inclined to sell a single point solution. Selling a subscription to Platform id. allows us to provide our customers with a competitively priced, complete solution for their communications needs. Our strategy of selling our cloud-based offerings via Platform id. to all customers under a subscription agreement should benefit us by moving away from selling individual solutions within highly commoditized markets that are experiencing pricing pressures.\nNew Offerings\nDuring 2021 and going forward, we will continue to innovate, improve and build new applications into and with our platform, with the objective of developing integrated application solutions that are not offered by our competitors. As a company focused on technology offerings, we understand the importance of advancements and fully appreciate the risks and consequences of losing our market position. The pursuit of technological innovation is and has been a part of our overall strategy as an organization over the last several years.\nEach year we bring to market certain platform upgrades, add-ons, and new offerings that we believe will complement our overall platform solutions. We believe our innovation and technological efficiencies continue to be a competitive advantage and focus for us.\nPart of our continued strategy from 2020 will be to continue to meet the virtual event market demands, in both our conference business, annual meeting business and shareholder communications business. We benefited during 2020 in each of these businesses and expect this year’s product advancements to continue to benefit us throughout the year as a result of the continued public gathering restrictions which have been caused by COVID-19.\nWe also have a slate of product platform enhancements beginning in the first quarter of 2021 that will help our customers stay connected with their shareholder and constituent base. Specifically, these advancements will be centered around the creation process of a story, whereby we will be adding a real-time collaboration suite into the ACCESSWIRE process. We also plan to enhance the ability of users to request, book and hold meetings within our virtual events products. Additionally, we have other strategic upgrades to Platform id., such as the corporate newsroom mentioned above, that we believe will both increase customer retention and annual revenue per customer.\nAcquisition Strategy\nWe will continue to evaluate complimentary verticals and businesses that we can integrate into our communications platform. While we typically focus on accretive acquisition opportunities, we will also evaluate technology acquisitions that we believe would be strategic to our overall business. We will continue to maintain our acquisition focus in the communications industry. Specifically, we will look for communications products and businesses that have recurring revenues, customers and technologies that will further enhance our overall market position.\nSales and Marketing\nDuring 2020, we continued to strengthen our brands in the market by working aggressively to expand our new customer footprint and continue to cross sell to increase average revenue per customer. Since our platform, systems and operations are built to handle growth, we can leverage them to produce consistently high margins and increased cash flows without a proportional increase in our capital or operating expenses.\nOur sales organization is responsible for generating new customer opportunities and expanding our current customers. We ended 2020 with a multi-tier organization of sales personnel, consisting of Sales Development Representatives, Business Development Managers and Strategic Account Managers. During 2020, we created a new inbound digital sales and marketing group to manage all inbound leads and focus on e-commerce and digital marketing relating to the portions of our platform we believe may be attractive for online purchases. We believe this structured approach is the most efficient and effective way to reach new customers and grow our current install base. The total compensation packages for these teams are heavily weighted with commission compensation to incent sales and retention. All members of the sales team have quotas. As of December 31, 2020, we employed 29 full-time equivalent sales and marketing personnel compared to 25 as of December 31, 2019.\nOur marketing organization has been focused on both new customer acquisition as well as campaigns to educate current customers on the advantages of using our entire Platform id. offerings. Additionally, our marketing team has expanded their focus on investor conferences, strategic partnerships and private company marketing activities in order to continue to scale our business long term.\nCybersecurity\nIn all our offerings, quality, support, and scalability as well as the need to preserve the confidential content of our customers are of utmost importance and part of our core values. We continue to maintain agreements with security software and hardware providers and consulting firms to identify, address and create policies and plans which enable us to mitigate our cybersecurity and information vulnerabilities on both a short-term and long-term basis. We believe having a strong cyber and information security policy is not only necessary to maintain our current business model but also is important to attract new customers. We plan to continue to work closely with these firms and others to ensure our security policies and practices meet our customers’ needs and requirements.\nIndustry Overview\nAccording to a 2020 Burton-Taylor Media Intelligence report, the global communications technology market is almost $5 billion in annual revenue. This total includes spending on social media solutions, media monitoring, press release distribution engagement and targeting and investor relations platforms globally. A key driver of growth in our industry is the introduction of new innovative technologies and solutions. We believe our technology and workflow automation solutions will help us gain market share within the industry.\nThe webcasting and virtual event side of the communications industry was greatly impacted by the COVID-19 pandemic as demand significantly increased for virtual events due to cancelled live, in-person events, meetings and conferences. Toward the end of the first quarter of 2020, we began enhancing our products by adding virtual components, as well as focusing our selling efforts on our webcasting technologies.\nOur industry also benefits from increased regulatory requirements and the need for platforms and systems to manage these new regulations. Additionally, the industry, along with cloud-based technologies, have matured considerably over the past several years, whereby corporate issuers and communication professionals are seeking platforms and systems to do some, if not all the work themselves. We believe we are well positioned in this new environment to benefit from subscriptions and further advancements of Platform id.\nThe compliance industry is highly fragmented, with hundreds of independent service companies that provide a range of financial reporting, document management services. There is also a wide range of printing and technology software providers. The demands for many of our services historically have been cyclical and reliant on capital market activity. Over the past few years, we have been offering subscriptions which combine both compliance software and service in one annual contract. We believe this new offering affords us the ability to reduce our revenue seasonality and provide a new baseline of recurring annualized revenue.\nCompetition\nDespite some significant consolidation in recent years, the communications and compliance industries remain both highly fragmented and extremely competitive. The success of our products and services are generally based on price, quality and the ability to service customer demands. Management has been focused on offsetting these risks relating to competition as well as the seasonality by introducing our cloud-based subscription platforms, with higher margins, clear competitive advantages, higher customer stickiness and scalability to withstand market and pricing pressures.\nWe also review our operations on a regular basis to balance growth with opportunities to maximize efficiencies and support our long-term strategic goals. We believe by blending our workflow technologies with our legacy service offerings we can offer a comprehensive set of products and solutions to each of our customers within one platform that most competitors cannot offer today.\nWe believe we are positioned to be the communications platform of choice as a cost-effective alternative to both small regional providers and global providers. We also believe we benefit from our location in Raleigh, North Carolina, as we can hire and retain sales, customer service or production personnel in the area at a reasonable cost. However, there are areas we have strong competition in hiring, such as research and development and qualified sales individuals with communications industry experience.\nCustomers\nOur customers include a wide variety of public and private companies, mutual funds, law firms, brokerage firms, investment banks, individuals, and other institutions. For the year ended December 31, 2020, we worked with 2,242 publicly traded customers and 4,426 private customers, compared to 2,169 publicly traded customers and 2,691 private customers for the year ended December 31, 2019. The increase in private companies is primarily related to additional agencies we began to partner with during the year as well as direct sales to private companies in our newswire business. We did not have any customers during the year ended December 31, 2020 that accounted for more than 10% of our revenue or more than 10% of our year end accounts receivable balance as of December 31, 2020.\nEmployees\nAs of December 31, 2020, we employed eighty-six employees and engaged five independent contractors, none of which are represented by a union. Our employees work in our corporate offices in North Carolina and in other offices throughout North America.\nFacilities\nOur headquarters are located in Raleigh, North Carolina. In October 2019, we began a new lease for 9,766 square feet of office space, which expires December 31, 2027.\nAs part of our acquisition of VWP, we assumed a three-year lease in Ft. Lauderdale, Florida, and a month-to-month lease in New York City, New York. Additionally, we have an office in Salt Lake City, Utah, which is also on a short-term lease. As a result of an increase in our remote workforce, we are examining the needs for these satellite locations and have already vacated the New York City office after year-end. The Company intends to monitor the needs of its employees both in a remote and on-site basis and will make the necessary adjustments to its locations on that basis.\nInsurance\nWe maintain both a general business liability, cyber-security and an errors and omissions policies specific to our industry and operations. We believe that our insurance policies provide adequate coverage for all reasonable risks associated with operating our business. Additionally, we maintain a Directors and Officers insurance policy, which is standard for our industry and size. We also maintain key person life insurance on our C level executives, and one other key individual.\nRegulations\nThe securities and financial services industries generally are subject to regulation in the United States and elsewhere. Regulatory policies in the United States and the rest of the world are tasked with safeguarding the integrity of the securities and financial markets and with protecting the interests of both issuers and shareholders.\nIn the United States, corporate issuers are subject to regulation under both federal and state laws, which often require public disclosure and regulatory filings. At the federal level, the SEC regulates the securities industry, along with the Financial Industry Regulatory Authority, or FINRA, formally known as NASD, and NYSE market regulations, various stock exchanges, and other self-regulatory organizations (“SRO”).\nIn the European Union (EU), the securities and reporting authorities tend to be based on exchanges as well as individual country disclosure requirements. We currently work with our stock exchange partners to deliver our solutions. We believe this is the best approach as this market is highly complex and divided in comparison to our North American markets.\nWe operate our filing agent business and transfer agent business under the supervision and regulations of the SEC.\nOur transfer agency business, Direct Transfer, LLC, is registered with the SEC and is subject to SEC regulations relating to, among other things, annual reporting, examination, internal controls, tax reporting and escheatment services. Our transfer agency is currently approved to handle the securities of NYSE, NASDAQ and OTC Markets.\nOur mission is to assist corporate issuers with these regulations, communication and compliance of rules imposed by regulatory bodies. The majority of our business involves the distribution of content, either electronically or on paper, to governing bodies and shareholders alike. We are recognized under these regulations to disseminate, communicate and or solicit on behalf of our customers, the issuers.",
    "item_1A": "ITEM 1A. RISK FACTORS.\nForward-Looking and Cautionary Statements\nInvesting in our common stock involves a high degree of risk. Prospective investors should carefully consider the following risks and uncertainties and all other information contained or referred to in this Annual Report on Form 10-K before investing in our common stock. The risks and uncertainties described below are not the only ones facing us. Additional risks and uncertainties that we are unaware of, or that we currently deem immaterial, also may become important factors that affect us. If any of the following risks occur, our business, financial condition or results of operations could be materially and adversely affected. In that case, the trading price of our common stock could decline, and you could lose some or all of your investment.\nRisks related to our business\nLegislative and regulatory changes can influence demand for our solutions and could adversely affect our business.\nThe market for our solutions depends in part on the requirements of the SEC and other regulatory bodies. Any legislation or rulemaking substantially affecting the content or method of delivery of documents to be filed with these regulatory bodies could have an adverse effect on our business. In addition, evolving market practices in light of regulatory developments could adversely affect the demand for our solutions. Uncertainty caused by political change in the United States and European Union heightens regulatory uncertainty in these areas. For example, the SEC has proposed a rule to require certain over-the-counter (“OTC”) companies to provide greater transparency to investors and other market participants by requiring that information about the issuer be current and publicly available, which could cause a decrease in the number of publicly traded companies. New legislation, or a significant change in rules, regulations, directives or standards could reduce demand for our products and services. Regulatory changes could also increase expenses as we modify our products and services to comply with new requirements and retain relevancy, impose limitations on our operations, and increase compliance or litigation expense, each of which could have a material adverse effect on our business, financial condition and results of operations.\nThe environment in which we compete is highly competitive, which creates adverse pricing pressures and may harm our business and operating results if we cannot compete effectively.\nCompetition across all of our businesses is intense. The speed and accuracy with which we can meet customers’ needs, the price of our services and the quality of our products and supporting services are factors in this competition.\nSome of our competitors have longer operating histories, greater name recognition, more established customer bases and significantly greater financial, technical, marketing and other resources than we do. As a result, they may be able to respond more quickly and effectively than we can to new or changing market demands and requirements. We could also be negatively impacted if our competitors reduce prices, add new features, form strategic alliances with other companies, or are acquired by other companies with greater available resources.\nThese competitive pressures to any aspect of our business could reduce our revenue and earnings.\nOur revenue growth rate in the recent period relating to our Communications business may not be indicative of this business segment’s future performance.\nWe experienced a revenue growth rate of 28% from 2019 to 2020, 45% from 2018 to 2019, 22% from 2017 to 2018 and 55% from 2016 to 2017 with respect to our Communications business. In 2020, much of the growth came from demand for our events products that were upgraded to handle virtual needs in the industry, as well as our ACCESSWIRE news brand, which drove both subscriptions and pay-as-you-go revenues higher than in prior years. In 2019, much of the growth came from the acquisition of VWP in January 2019 and FSCwire in July 2018, while the previous years’ growth was due to the success of our ACCESSWIRE business. Our historical revenue growth rate of the Communications business is not indicative of future growth, and we may not achieve similar revenue growth rates in future periods. You should not rely on our revenue or revenue growth for any prior quarterly or annual periods as any indication of our future revenue or revenue growth. If we are unable to maintain consistent revenue or revenue growth, it may be difficult to achieve and maintain profitability and our stock price may be negatively impacted.\nThe success of our cloud-based software largely depends on our ability to provide reliable solutions to our customers. If a customer were to experience a product defect, a disruption in its ability to use our solutions or a security flaw, demand for our solutions could be diminished, we could be subject to substantial liability and our business could suffer.\nOur product solutions are complex and we often release new features. As such, our solutions could have errors, defects, viruses or security flaws that could result in unanticipated downtime for our customers and harm our reputation and our business. Internet-based software may contain undetected errors or security flaws when first introduced or when new versions or enhancements are released. We might from time to time find such defects in our solutions, the detection and correction of which could be time consuming and costly. Since our customers use our solutions for important aspects of their business, any errors, defects, disruptions in access, security flaws, viruses, data corruption or other performance problems with our solutions could hurt our reputation and may damage our customers’ businesses. If that occurs, customers could elect not to renew, could delay or withhold payment to us or may make claims against us, which could result in an increase in our provision for doubtful accounts, an increase in collection cycles for accounts receivable or the expense and risk of litigation. We could also lose future sales. In addition, a security breach of our solutions could result in our future business prospects being materially adversely impacted.\nA substantial portion of our business is derived from our ACCESSWIRE brand, which is dependent on technology and key partners.\nAs noted, our ACCESSWIRE brand has been vital to the increase in revenue associated with our Communications business. ACCESSWIRE is dependent upon several key partners for news distribution, some of which are also partners that we rely on for other shareholder communications services. During the second quarter of 2019, one of our key partners made an industry-wide decision to no longer accept investor commentary content. A significant portion of our historical ACCESSWIRE revenue was generated from this type of content, which has significantly affected revenue going forward. Further disruption in any of these partnership relationships could have a material adverse impact on our business and financial results and the inability to procure new key partners could impact the growth of the ACCESSWIRE brand, particularly with respect to public company news distribution. Additionally, ACCESSWIRE is highly dependent on technology and any performance issues with this technology could have a material impact on our ability to serve our customers and thus our ability to generate revenue.\nFailure to manage our growth may adversely affect our business or operations.\nSince 2013, we have experienced overall growth in our business, customer base, employee headcount and operations, and we expect to continue to grow our business over the next several years. This growth places a significant strain on our executive management team and employees and on our operating and financial systems. To manage our future growth, we must continue to scale our business functions, improve our financial and management controls and our reporting systems and procedures and expand and train our work force. In particular, we grew from twenty-four employees and contractors as of December 31, 2012 to ninety-one (including 5 independent contractors) as of December 31, 2020. We anticipate that additional investments in sales personnel, infrastructure and research and development spending will be required to:\n●\nscale our operations and increase productivity;\n●\naddress the needs of our customers;\n●\nfurther develop and enhance our existing solutions and offerings; and\n●\ndevelop new technology.\nWe cannot assure you that our controls, systems and procedures will be adequate to support our future operations or that we will be able to manage our growth effectively. We also cannot assure you that we will be able to continue to expand our market presence in the United States and other current markets or successfully establish our presence in other markets. Failure to effectively manage growth could result in difficulty or delays in deploying customers, declines in quality or customer satisfaction, increases in costs, difficulties in introducing new features or other operational difficulties, and any of these difficulties could adversely impact our business performance and results of operations.\nIf we are unable to retain our key employees and attract and retain other qualified personnel, our business could suffer.\nOur ability to grow and our future success will depend to a significant extent on the continued contributions of our key executives, managers and employees. In addition, many of our individual technical and sales personnel have extensive experience in our business operations and/or have valuable customer relationships that would be difficult to replace. Their departure, if unexpected and unplanned, could cause a disruption to our business. Our competition for these individuals is intense in certain areas of our business. We may not succeed in identifying and retaining the appropriate personnel in key positions. Further, competitors and other entities have in the past recruited and may in the future attempt to recruit our employees, particularly our sales personnel. The loss of the services of our key personnel, the inability to identify, attract and retain qualified personnel in the future or delays in hiring qualified personnel, particularly technical and sales personnel, could make it difficult for us to manage our business and meet key objectives, such as the timely introduction of new technology-based products and services, which could harm our business, financial condition and operating results\nThe recent COVID-19 outbreak could harm our business and results of operations.\nOn January 30, 2020, the World Health Organization declared the COVID-19 outbreak a \"Public Health Emergency of International Concern\" and on March 11, 2020, declared it to be a pandemic. We have undertaken measures to protect our employees, partners and customers by requiring a majority of our employees to work remotely at certain times. There can be no assurance that these measures will be effective or that we can adopt them without adversely affecting our business operations. In addition, the COVID-19 outbreak has created and may continue to create significant uncertainty in global financial markets, which may materially decrease spending, demand for our solutions, the viability of our customers and the value of our assets, which would significantly harm our business and results of operations. The ultimate extent of the impact of any epidemic, pandemic or other health crisis in our business, financial condition and results of operations will depend on future developments, which are highly uncertain and cannot be predicted.\nIf we fail to keep our customers’ information confidential or if we handle their information improperly, our business and reputation could be significantly and adversely affected.\nIf we fail to keep customers’ proprietary information and documentation confidential, we may lose existing customers and potential new customers and may expose them to significant loss of revenue based on the premature release of confidential information. While we have security measures in place to protect customer information and prevent data loss and other security breaches, these measures may be breached as a result of third-party action, employee error, malfeasance or otherwise. Because the techniques used to obtain unauthorized access or sabotage systems change frequently and generally are not identified until they are launched against a target, we may be unable to anticipate these techniques or to implement adequate preventative measures.\nIn addition, our service providers (including, without limitation, hosting facilities, disaster recovery providers and software providers) may have access to our customers’ data and could suffer security breaches or data losses that affect our customers’ information.\nIf an actual or perceived security breach or premature release occurs, our reputation could be damaged and we may lose future sales and customers. We may also become subject to civil claims, including indemnity or damage claims in certain customer contracts, or criminal investigations by appropriate authorities, any of which could harm our business and operating results. Furthermore, while our errors and omissions insurance policies include liability coverage for these matters, if we experienced a widespread security breach that impacted a significant number of our customers for whom we have these indemnity obligations, we could be subject to indemnity claims that exceed such coverage.\nWe must adapt to rapid changes in technology and customer requirements to remain competitive.\nThe market and demand for our products and services, to a varying extent, have been characterized by:\n●\ntechnological change;\n●\nfrequent product and service introductions; and\n●\nevolving customer requirements.\nWe believe that these trends will continue into the foreseeable future. Our success will depend, in part, upon our ability to:\n●\nenhance our existing products and services;\n●\ngain market acceptance.\n●\nsuccessfully develop new products and services that meet increasing customer requirements; and\nTo achieve these goals, we will need to continue to make substantial investments in sales and marketing. We may not:\n●\nhave sufficient resources to make these investments;\n●\nbe successful in developing product and service enhancements or new products and services on a timely basis, if at all; or\n●\nbe able to market successfully these enhancements and new products once developed.\nFurther, our products and services may be rendered obsolete or uncompetitive by new industry standards or changing technology.\nOur business could be harmed if we do not successfully manage the integration of any business that we have acquired or may acquire in the future. These risks include, among other things:\n●\nthe difficulty of integrating the operations and personnel of the acquired businesses into our ongoing operations;\n●\nthe potential disruption of our ongoing business and distraction of management;\n●\nthe potential for new cyber security risks to existing operations that weren’t previously mitigated:\n●\nthe difficulty in incorporating acquired technology and rights into our products and technology;\n●\nunanticipated expenses and delays relating to completing acquired development projects and technology integration;\n●\na potential increase in our indebtedness and contingent liabilities, which could restrict our ability to access additional capital when needed or to pursue other important elements of our business strategy;\n●\nthe management of geographically remote units;\n●\nthe establishment and maintenance of uniform standards, controls, procedures and policies;\n●\nthe impairment of relationships with employees and customers as a result of any integration of new management personnel;\n●\nrisks of entering markets or types of businesses in which we have either limited or no direct experience;\n●\nthe potential loss of key employees or customers of the acquired businesses; and\n●\npotential unknown liabilities, such as liability for hazardous substances, or other difficulties associated with acquired businesses.\nRevenue from Platform id. subscriptions and many of our service contracts is recognized ratably over the term of the contract or subscription period. As a result, downturns or upturns in sales may not be immediately reflected in our operating results.\nWe generally recognize subscription and support revenue from customers ratably over the terms of their subscription agreements, which are typically on a quarterly or annual cycle and automatically renew for additional periods. As a result, a substantial portion of the revenue we report in each quarter will be derived from the recognition of deferred revenue relating to subscription agreements entered into during previous quarters. Consequently, a decline in new or renewed subscriptions in any one quarter may not be immediately reflected in our revenue results for that quarter. This decline, however, will negatively affect our revenue in future quarters. Accordingly, the effect of significant downturns in sales and market acceptance of our solutions and potential changes in our rate of renewals may not be fully reflected in our results of operations until future periods. Our subscription model also makes it difficult for us to rapidly increase our subscription revenue through additional sales in any period, as revenue from new customers must be recognized over the applicable subscription term. In addition, we may be unable to adjust our cost structure to reflect the changes in revenue, which could adversely affect our operating results.\nWe cannot accurately predict subscription renewal or upgrade rates and the impact these rates may have on our future revenue and operating results.\nOur business depends substantially on customers renewing their subscriptions with us, specifically Platform id., and expanding their use of our products. Our customers have no obligation to renew their subscriptions for our products after the expiration of their initial subscription period. Given our limited operating history with respect to our subscription business, we may be unable to accurately predict our revenue retention rate. In addition, our customers may renew for shorter contract lengths, lower prices or fewer users. We cannot accurately predict new subscription or expansion rates and the impact these rates may have on our future revenue and operating results. Our renewal rates may decline or fluctuate as a result of a number of factors, including customer dissatisfaction with our service, customers’ ability to continue their operations and spending levels and deteriorating general economic conditions. If our customers do not renew their subscriptions for our products, purchase fewer solutions at the time of renewal, or negotiate a lower price upon renewal, our revenue will decline and our business will suffer. Our future success also depends in part on our ability to sell additional solutions and products, more subscriptions or enhanced editions of our products to our current customers. If our efforts to sell additional solutions and products to our customers are not successful, our growth and operations may be impeded. In addition, any decline in our customer renewals or failure to convince our customers to broaden their use of our products would harm our future operating results.\nWe continue to transition our business from a services company to a cloud-based platform company, which makes it difficult to predict our future operating results.\nIn 2015, we began our transition from a services company to a cloud-based platform company. As a result of this transition, our ability to forecast our future operating results is limited and subject to a number of uncertainties, including our ability to plan for and model future growth. We have encountered and will encounter risks and uncertainties frequently experienced by growing companies in rapidly changing industries, such as the risks and uncertainties described herein. If our assumptions regarding these risks and uncertainties (which we use to plan our business) are incorrect or change due to changes in our markets, or if we do not address these risks successfully, our operating and financial results could differ materially from our expectations and our business could suffer.\nWe are subject to general litigation and regulatory requirements that may materially adversely affect us.\nFrom time to time, we may be involved in disputes or regulatory inquiries that arise in the ordinary course of business. We expect that the number and significance of these potential disputes may increase as our business expands and we grow larger. While most of our agreements with customers limit our liability for damages arising from our solutions, we cannot assure you that these contractual provisions will protect us from liability for damages in the event we are sued. Although we carry general liability insurance coverage, our insurance may not cover all potential claims to which we are exposed or may not be adequate to indemnify us for all liability that may be imposed. Any claims against us, whether meritorious or not, could be time consuming, result in costly litigation, require significant amounts of management time, and result in the diversion of significant operational resources. Because litigation is inherently unpredictable, we cannot assure you that the results of any of these actions will not have a material adverse effect on our business, financial condition, results of operations and prospects.\nNew and existing laws make determining our sales and use taxes and income tax rate complex and subject to uncertainty.\nThe computation of sales and use taxes and our provision for income tax is complex, as it is based on the laws of multiple taxing jurisdictions and requires significant judgment on the application of complicated rules governing accounting for such tax provisions under U.S. generally accepted accounting principles. Additionally, provisions for income tax for interim quarters are based on forecasts of our U.S. and non-U.S. effective tax rates for the year and contain numerous assumptions. Various items cannot be accurately forecasted and future events may be treated as discrete to the period in which they occur. Our provision for income tax can be materially impacted by things such as changes in our business, internal restructuring and acquisitions, changes in tax laws and accounting guidance and other regulatory, legislative developments, tax audit determinations, changes in uncertain tax positions, tax deductions attributed to equity compensation and changes in our determination for a valuation allowance for deferred tax assets. For all of these reasons, our actual income taxes may be materially different than our provision for income tax.\nWe are subject to U.S. and foreign data privacy and protection laws and regulations as well as contractual privacy obligations, and our failure to comply could subject us to fines and damages and would harm our reputation and business.\nWe manage private and confidential information and documentation related to our customers’ finances and transactions, often prior to public dissemination. The use of insider information is highly regulated in the United States and abroad, and violations of securities laws and regulations may result in civil and criminal penalties. In addition, we are subject to the data privacy and protection laws and regulations adopted by federal, state and foreign legislatures and governmental agencies. Data privacy and protection is highly regulated and may become the subject of additional regulation in the future. Privacy laws restrict our storage, use, processing, disclosure, transfer and protection of non-public personal information by our customers or collected from visitors of our website. We strive to comply with all applicable laws, regulations, policies and legal obligations relating to privacy and data protection. However, it is possible that these requirements may be interpreted and applied in a manner that is inconsistent from one jurisdiction to another and may conflict with other rules or our practices. Any failure, or perceived failure, by us to comply with federal, state or international laws, including laws and regulations regulating privacy, payment card information, personal health information, data or consumer protection, could result in proceedings or actions against us by governmental entities or others.\nThe regulatory framework for privacy and data protection issues worldwide is evolving, and various government and consumer agencies and public advocacy groups have called for new regulation and changes in industry practices, including some directed at providers of mobile and online resources in particular. Our obligations with respect to privacy and data protection may become broader or more stringent. If we are required to change our business activities or revise or eliminate services, or to implement costly compliance measures, our business and results of operations could be harmed.\nOur business may be affected by factors outside of our control.\nOur ability to increase sales and deliver and sell our service offerings profitably is subject to a number of risks, including changes to corporate disclosure requirements, regulatory filings and distribution of proxy materials, competitive risks such as the entrance of additional competitors into our market, pricing and competition and risks associated with the marketing of new services in order to remain competitive.\nIf potential customers take a long time to evaluate the use of our products, we could incur additional selling expenses and decrease our profitability.\nThe acceptance of our services depends on a number of factors, including the nature and size of the potential customer base, the effectiveness of our system, and the extent of the commitment being made by the potential customer, and is difficult to predict. Currently, our sales and marketing expenses per customer are fairly low. If potential customers take longer than we expect to decide whether to use our services and require that we travel to their sites, present more marketing material, or spend more time in completing the sales process, our selling expenses could increase, and decrease our profitability.\nThe seasonality of business makes it difficult to predict future results based on specific quarters.\nA greater portion of our printing, distribution and solicitation of proxy materials business will be processed during the second quarter of our fiscal year. Therefore, the seasonality of our revenue makes it difficult to estimate future operating results based on the results of any specific quarter and could affect an investor’s ability to compare our financial condition and results of operations on a quarter-by-quarter basis. To balance the seasonal activity of print, distribution and solicitation of proxy materials, we will attempt to continue to grow other revenues linked to predictable periodic activity that is not cyclical in nature.\nIf we are unable to successfully develop and timely introduce new technology-based products or enhance existing technology-based products, our business may be adversely affected.\nIn the past few years, we have expended significant resources to develop and introduce new technology-based products and improve and enhance our existing technology-based products in an attempt to maintain or increase our sales. The long-term success of new or enhanced technology-based products may depend on a number of factors including, but not limited to, the following: anticipating and effectively addressing customer preferences and demand, the success of our sales and marketing efforts, timely and successful development, changes in governmental regulations and the quality of or defects in our products.\nThe development of our technology-based products is complex and costly, and we typically have multiple technology-based products in development at the same time. Given the complexity, we occasionally have experienced, and could experience in the future, delays in completing the development and introduction of new and enhanced technology-based products. Problems in the design or quality of our products or services may also have an adverse effect on our brand, business, financial condition, and operating results. Unanticipated problems in developing technology-based products could also divert substantial development resources, which may impair our ability to develop new technology-based products and enhancements of such products, and could substantially increase our costs. If new or enhanced product and service introductions are delayed or not successful, we may not be able to achieve an acceptable return, if any, on our development efforts, and our business may be adversely affected.\nRisks Related to Our Common Stock; Liquidity Risks\nThe price of our common stock may fluctuate significantly, which could lead to losses for stockholders.\nThe stock prices of smaller public companies can experience extreme price and volume fluctuations. These fluctuations often have been unrelated or out of proportion to the operating performance of such companies. We expect our stock price to be similarly volatile. These broad market fluctuations may continue and could harm our stock price. Any negative change in the public’s perception of our prospects or companies in our market could also depress our stock price, regardless of our actual results. Factors affecting the trading price of our common stock may include:\n●\nvariations in operating results;\n●\nannouncements of strategic alliances or significant agreements by the Company or by competitors;\n●\nrecruitment or departure of key personnel;\n●\nlitigation, legislation, regulation of all or part of our business; and\n●\nchanges in the estimates of operating results or changes in recommendations by any securities analyst that elect to follow our common stock.\nIf securities or industry analysts issue an adverse opinion regarding our stock, our stock price and trading volume could decline.\nThe trading market for our common stock is influenced by the research and reports that securities or industry analysts may publish about us, our business, our market or our competitors. If any of the analysts who may cover us adversely change their recommendation regarding our common stock, or provide more favorable relative recommendations about our competitors, the trading price of our common stock could decline. If any analyst who may cover us were to cease coverage of our company or fail to regularly publish reports on us, we could lose visibility in the financial markets, which in turn could cause the trading price of our common stock or trading volume to decline.\nThe market price of our common stock may be adversely affected by market conditions affecting the stock markets in general, including price and trading fluctuations on the NYSE American.\nMarket conditions may result in volatility in the level of, and fluctuations in, market prices of stocks generally and, in turn, our common stock and sales of substantial amounts of our common stock in the market, in each case being unrelated or disproportionate to changes in our operating performance. A weak global economy could also contribute to extreme volatility of the markets, which may have an effect on the market price of our common stock.\nWe do not intend to pay dividends for the foreseeable future.\nWe paid dividends in 2012, part of 2013 and from the fourth quarter of 2015 through the third quarter of 2018. In the fourth quarter of 2018, we announced that we would no longer be declaring quarterly dividends for the foreseeable future in order to invest such money in our business. There can be no assurances that dividends will be paid in the future in the form of either cash or stock.\nOur Board of Directors has the ability without stockholder approval to issue shares of preferred stock with terms detrimental to the holders of our common stock.\nWe currently have authorized but unissued “blank check” preferred stock. Without the vote of our shareholders, the Board of Directors may issue such preferred stock with both economic and voting rights and preferences senior to those of the holders of our common stock. Any such issuances may negatively impact the ultimate benefits to the holders of our common stock in the event of a liquidation event and may have the effect of preventing a change of control and could dilute the voting power of our common stock and reduce the market price of our common stock.\nFuture sales and issuances of our capital stock or rights to purchase capital stock could result in additional dilution of the percentage ownership of our stockholders and could cause our stock price to decline.\nOur certificate of incorporation authorizes us to issue up to 20,000,000 shares of common stock. Future sales and issuances of our capital stock or rights to purchase our capital stock could result in substantial dilution to our existing stockholders. We may sell common stock, convertible securities and other equity securities in one or more transactions at prices and in a manner as we may determine from time to time. If we sell any such securities in subsequent transactions, investors may be materially diluted, which could result in downward pressure on the price of our common stock. New investors in subsequent transactions could gain rights, preferences and privileges senior to those of holders of our common stock. In addition, if outstanding stock options are exercised or when outstanding restricted stock units are settled in shares, current shareholders will experience dilution.\nWe will continue to incur significantly increased costs and devote substantial management time as a result of operating as a public company.\nAs a public company, we incur significant legal, accounting and other expenses that would not be incurred as a private company. For example, we are subject to the reporting requirements of the Securities Exchange Act of 1934, as amended (Exchange Act), and are required to comply with the applicable requirements of the Sarbanes-Oxley Act and the Dodd-Frank Act, as well as rules and regulations subsequently implemented by the SEC and the New York Stock Exchange, including the establishment and maintenance of effective disclosure and financial controls and changes in corporate governance practices. Compliance with these requirements has increased our legal and financial compliance costs and made some activities more time consuming and costly. Many of these costs recur annually. As a result, management’s attention may be diverted from other business concerns, which could adversely affect our business and operating results.\nA failure to maintain adequate internal controls over our financial and management systems could cause errors in our financial reporting, which could cause a loss of investor confidence and result in a decline in the price of our common stock.\nThe Sarbanes-Oxley Act requires, among other things, that we maintain effective disclosure controls and procedures and internal control over financial reporting. In order to maintain and, if required, improve our disclosure controls and procedures and internal control over financial reporting to meet this standard, significant resources and management oversight may be required. If we have a material weaknesses or significant deficiency in our internal control over financial reporting, we may not detect errors on a timely basis and our financial statements may be materially misstated. Effective internal controls are necessary for us to produce reliable financial reports and are important to prevent fraud. As a result, our failure to satisfy the requirements of Section 404 of the Sarbanes-Oxley Act on a timely basis could result in us being subject to regulatory action and a loss of investor confidence in the reliability of our financial statements, both of which in turn could cause the market value of our common stock to decline and affect our ability to raise capital.\nBecause we are a smaller reporting company, our independent registered public accounting firm was not required to and did not perform an audit of our internal control over financial reporting for the fiscal year ended December 31, 2020.",
    "item_1B": "ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNone.",
    "item_2": "ITEM 2. PROPERTY.\nOur headquarters are located in Raleigh, North Carolina. In October 2019, we began a new lease for 9,766 square feet of office space, which expires December 31, 2027.\nAs part of our acquisition of VWP, we assumed a three-year lease in Ft. Lauderdale, Florida, and a month-to-month lease in New York City, New York. Additionally, we have an office in Salt Lake City, Utah, which is also on a short-term lease. As a result of an increase in our remote workforce, we are examining the needs for these satellite locations and have already vacated the New York City office after year-end. The Company intends to monitor the needs of its employees both in a remote and on-site basis and will make the necessary adjustments to its locations on that basis.",
    "item_3": "ITEM 3. LEGAL PROCEEDINGS.\nFrom time to time, we may be involved in litigation that arises through the normal course of business. As of the date of this filing, we are neither a party to any litigation nor are we aware of any such threatened or pending litigation that might result in a material adverse effect to our business.",
    "item_4": "ITEM 4. MINE SAFETY DISCOLSURES.\nNot applicable.\nPART II",
    "item_5": "ITEM 5. MARKET FOR COMMON EQUITY AND RELATED STOCKHOLDER MATTERS.\nMarket for common stock\nOur common stock is listed on the NYSE American under the symbol \"ISDR\". The following table sets forth for the periods indicated the high and low closing prices of our common stock for the following periods.\nHigh\nLow\nYear ended December 31, 2020\nQuarter Ended March 31, 2020\n$12.38\n$8.88\nQuarter Ended June 30, 2020\n11.91\n8.65\nQuarter Ended September 30, 2020\n19.88\n10.05\nQuarter Ended December 31, 2020\n$23.50\n$17.51\nYear ended December 31, 2019\nQuarter Ended March 31, 2019\n$13.85\n$11.35\nQuarter Ended June 30, 2019\n13.27\n10.25\nQuarter Ended September 30, 2019\n11.39\n8.90\nQuarter Ended December 31, 2019\n$12.75\n$10.10\nHolders of Record\nAs of December 31, 2020, there were approximately 150 registered holders of record of our common stock and 3,770,752 shares outstanding.\nIssuer Purchases of Equity Securities\nOn August 7, 2019, the Company publicly announced a share repurchase program under which the Company is authorized to repurchase up to $1,000,000 of its common shares. On March 16, 2020, the Company publicly announced an increase to the share repurchase program to repurchase up to $2,000,000 of its common shares. As of December 31, 2020, the Company repurchased a total of 160,068 shares at an aggregate cost of $1,552,000 (not including commissions of $7,000) as shown in the table below ($ in 000’s, except share or per share amounts):\nShares Repurchased\nPeriod\nTotal Number of Shares Repurchased\nAverage Price Paid Per Share\nTotal Number of Shares Purchased as Part of Publicly Announced Program\nMaximum Dollar Value of Shares that May Yet Be Purchased Under the Program\nAugust 7 -31,\n22,150\n$9.34\n22,150\n$793\nSeptember 1-30,\n2,830\n$10.00\n2,830\n$765\nOctober 1-31,\n39,363\n$10.44\n39,363\n$354\nNovember 1-30,\n11,827\n$10.43\n11,827\n$231\nDecember 1-31,\n-\n-\n-\n$231\nJanuary 1-31,\n-\n-\n-\n$231\nFebruary 1-29,\n-\n-\n-\n$231\nMarch 1-31,\n21,700\n$9.33\n21,700\n$1,028\nApril 1-30,\n22,698\n$9.02\n22,698\n$823\nMay 1-31,\n39,500\n$9.51\n39,500\n$448\nTotal\n160,068\n$9.70\n160,068\n$448\nThere were no shares repurchased during the period of June 1, 2020 through December 31, 2020.\nDividends\nWe did not pay any dividends during the year ended December 31, 2020 and 2019. There can be no assurances that dividends will be paid in the future. The declaration and payment of dividends in the future will be determined by our Board of Directors in light of conditions then existing, including our earnings, financial condition, capital requirements and other factors.\nCOMPARISON OF CUMULATIVE TOTAL RETURN\nPerformance Comparison Graph\nThis chart compares the five-year cumulative total return on our common stock with that of the Russell MicroCap index and a custom peer group, which was selected by the Company. The chart assumes $100 was invested on December 31, 2015, in our common stock, the Russell MicroCap index and the peer group, and that any dividends were reinvested. The Peer Group is composed of: Broadridge Financial Solutions Inc., Donnelley Financial Solutions, Inc., and Workiva, Inc. The peer group index utilizes the same method of presentation and assumptions for the total return calculation as does Issuer Direct Corporation (ISDR) and the Russell MicroCap index. All companies in the peer group index are weighted in accordance with their market capitalizations.\nThe Company makes no representation to the peer group market caps being similar to that of Issuer Direct, however these peers do represent a fair and accurate list of the companies that Issuer Direct competes with that are in fact public.\n12/15\n12/16\n12/17\n12/18\n12/19\n12/20\nIssuer Direct Corporation\n100.00\n159.14\n329.98\n205.85\n212.02\n317.58\nRussell MicroCap\n100.00\n120.37\n136.22\n118.40\n144.96\n175.34\nPeer Group\n100.00\n122.36\n165.63\n180.99\n230.31\n313.53\nThe stock price performance included in this graph is not necessarily indicative of future stock price performance.",
    "item_6": "ITEM 6. SELECT FINANCIAL DATA.\nOur selected consolidated financial data shown below should be read together with Item7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and our consolidated financial statements and respective notes included in Item 8. “Financial Statements and Supplementary Data.” The data shown below are not necessarily indicative of results to be expected for any future period.\nSummary of Operations for the periods ended December 31, 2020 and 2019 (in 000’s).\nYear Ended December 31,\nStatement of Operations\nRevenue\n$18,526\n$16,295\nCost of revenues\n5,415\n5,080\nGross profit\n13,111\n11,215\nOperating costs\n10,417\n10,741\nOperating income\n2,694\nOther income, net\nIncome before taxes\n2,830\nIncome tax expense\nNet income\n$2,106\n$686\nConcentrations:\nFor the years ended December 31, 2020 and 2019, we generated revenues from the following revenue streams as a percentage of total revenue:\nRevenue\nCommunications\n64.1%\n56.7%\nCompliance\n35.9%\n43.3%\nTotal\n100.0%\n100.0%\nPercentages:\nChange expressed as a percentage increase for the years ended December 31, 2020 and 2019 ($ in 000’s):\n% change\nRevenue\nCommunications\n$11,870\n$9,247\n28.4%\nCompliance\n6,656\n7,048\n(5.6)%\nTotal\n$18,526\n$16,295\n13.7%\nThe following presents Communications and Compliance revenue by the previously reported revenue streams of Platform and Technology, and Services ($ in 000’s):\nRevenue\nCommunications\nPlatform and Technology\n$10,696\n$8,265\nServices\n1,174\nTotal Communications\n11,870\n9,247\nCompliance\nPlatform and Technology\n2,231\n2,431\nServices\n4,425\n4,617\nTotal Compliance\n6,656\n7,048\nTotal\nPlatform and Technology\n12,927\n$10,696\nServices\n5,599\n5,599\nTotal revenue\n$18,526\n$16,295",
    "item_7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nExcept for the historical information contained herein, the matters discussed in this Form 10-K include certain forward-looking statements that involve risks and uncertainties, which are intended to be covered by safe harbors. Those statements include, but are not limited to, all statements regarding our and management’s intent, belief and expectations, such as statements concerning our future and our operating and growth strategy. We generally use words such as \"believe,\" \"may,\" \"could,\" \"will,\" \"intend,\" \"expect,\" \"anticipate,\" \"plan,\" and similar expressions to identify forward-looking statements. You should not place undue reliance on these forward-looking statements. Our actual results could differ materially from those anticipated in the forward-looking statements for many reasons including our ability to implement our business plan, our ability to raise additional funds and manage consumer acceptance of our products, our ability to broaden our customer base, our ability to maintain a satisfactory relationship with our suppliers and other risks described in our reports filed with the Securities and Exchange Commission, including Item 1A of this Report on Form 10-K. Although we believe the expectations reflected in the forward-looking statements are reasonable, they relate only to events as of the date on which the statements are made, and our future results, levels of activity, performance or achievements may not meet these expectations. Investors are cautioned that all forward-looking statements involve risks and uncertainties including, without limitation, the factors set forth under the Risk Factors section of this report. In light of the significant uncertainties inherent in the forward-looking statements included herein, the inclusion of such information should not be regarded as a representation by us or any other person that our objectives and plans will be achieved. All forward-looking statements made in this Form 10-K are based on information presently available to our management. We do not intend to update any of the forward-looking statements after the date of this document to conform these statements to actual results or to changes in our expectations, except as required by law.\nResults of Operations\nComparison of results of operations for the years ended December 31, 2020 and 2019 (in 000’s):\nRevenue\nCommunications\nRevenue\n$11,870\n$9,247\nGross margin\n$8,718\n$6,653\nGross margin %\n73%\n72%\nCompliance\nRevenue\n6,656\n7,048\nGross margin\n4,393\n4,562\nGross margin %\n66%\n65%\nTotal\nRevenue\n$18,526\n$16,295\nGross margin\n$13,111\n$11,215\nGross margin %\n71%\n69%\nRevenues\nTotal revenue increased by $2,231,000, or 14%, to $18,526,000 during the year ended December 31, 2020, as compared to $16,295,000 in 2019. The increase is attributable to an increase in revenue in our Communications business.\nCommunications revenue increased $2,623,000, or 28%, to $11,870,000 for the year ended December 31, 2020, as compared to $9,247,000 during 2019. The increase in revenue is due to a combination of increased revenue from our webcasting, conference software and newswire products, as well as increased licenses of Platform id. During the year ended December 31, 2020, we benefited from our ability to pivot and enhance our products with virtual components, including virtual annual meetings, virtual conferences and enhanced webcasting features to allow banks to conduct virtual roadshows, analyst days and other types of events. Additionally, ACCESSWIRE revenue for the year increased 17% compared to the same period of the prior year due to an increase in customers and the implementation of our new e-commerce platform. Revenue from licenses of Platform id. increased as a result of the additional licenses signed during the year as we entered into 139 new licenses of Platform id. with annual contract value of $1,007,000. This brings our total subscriptions of Platform id. to 341 with annual contract value of $2,677,000 as of December 31, 2020, compared to 255 subscriptions with annual contract value of $2,033,000 as of December 31, 2019. Communications revenue increased to 64% of total revenue during the year, as compared to 57% during the same period of the prior year.\nCompliance revenue decreased $392,000, or 6%, during the year ended December 31, 2020, as compared to 2019. The decrease in revenue is due to continued customer attrition of our legacy ARS services as well as a decline in transfer agent services due to a combination of less corporate transactions and directives, as well as an increased shift from paper-based processing of transactions to electronic processing. These decreases were partially offset by increases in print and proxy fulfillment, due to increased projects associated with annual meetings, as a result of the increased demand for our virtual annual meeting product.\n2020 Revenue Backlog\nAs of December 31, 2020, our deferred revenue balance was $2,212,000, a majority of which we expect to recognize over the next twelve months, compared to $1,812,000 at December 31, 2019, an increase of 22%. Deferred revenue primarily consists of advance billings for subscriptions of our cloud-based products and pre-paid packages of our news distribution product, as well as, advance billings for annual contracts for legacy ARS services.\nCost of Revenues\nCommunications cost of revenues consists primarily of direct labor costs, newswire distribution costs, teleconferencing costs and third-party licensing costs. Compliance and other costs of revenue consists primarily of direct labor costs, warehousing, logistics, print production materials, postage, and amortization of capitalized software costs related to our compliance software. Cost of revenues increased by $335,000, or 7%, during the year ended December 31, 2020, as compared to the same period of 2019. Overall gross margin increased $1,896,000, or 17%, during the year ended December 31, 2020, compared to 2019. As a result, overall gross margin percentage increased to 71% during the year ended December 31, 2020, as compared to 69% during the prior year. The increase in cost of sales is due partially to an increase labor costs associated with delivering our newswire and webcasting revenue, increase in distribution costs as we continue to expand our distribution capabilities as well as increase in teleconferencing costs. These increases were offset by decreases in amortization of capitalized software as well as decreases in postage and fulfillment costs associated with our legacy ARS business.\nGross margin percentage associated with our Communications revenue was 73% for the year ended December 31, 2020, compared to 72% for 2019. The increase in gross margin percentage is primarily attributable to the addition of revenue associated with our virtual products, newswire and subscriptions of Platform id.\nGross margin percentage associated with our Compliance revenue was 66% for the year ended December 31, 2020 compared to 65% for 2019.\nGeneral and Administrative Expense\nGeneral and administrative expenses consist primarily of salaries, stock-based compensation, insurance, fees for professional services, general corporate expenses and facility and equipment expenses. General and administrative expenses were $5,029,000 for the year ended December 31, 2020, a decrease of $57,000 or 1%, as compared to the prior year. This decrease is primarily due to a decrease in our bad debt provision of $449,000 offset by a one-time accrual of $350,000 recorded in 2020 regarding sales and use tax compliance. As a result of our growing customer base, transition from a service-based company to a cloud-based platform company and the complex economic nexus provisions of various states, we completed an assessment of our sales and use tax position during the year. As a result, we recorded a one-time estimate of our current and historical state sales and use tax liabilities of approximately $350,000 for the year ended December 31, 2020. The high bad debt provision in the prior year was primarily related to reserves on accounts receivable balances of two significant investment commentary newswire customers which were written off in 2019.\nAs a percentage of revenue, General and Administrative expenses were 27% for the year ended December 31, 2020, as compared to 31% for 2019.\nSales and Marketing Expenses\nSales and marketing expenses consist primarily of salaries, stock-based compensation, sales commissions, advertising expenses, tradeshow expenses and other marketing expenses. Sales and marketing expenses were $3,812,000 for the year ended December 31, 2020, an increase of $261,000, or 7%, as compared to the prior year. This increase is directly related to our investment in our sales and marketing initiatives with an increase in headcount and digital marketing.\nAs a percentage of revenue, sales and marketing expenses were 21% for the year ended December 31, 2020 compared to 22% for 2019.\nProduct Development\nProduct development expenses consist primarily of salaries, stock-based compensation, bonuses and licenses to develop new products and technology to complement and/or enhance Platform id. Product development costs decreased $394,000, or 32%, to $825,000 during the year ended December 31, 2020, as compared to 2019. The decrease is due to a decrease in headcount within the development team and use of more specialized consultants. We anticipate product development expenses to begin to increase toward previous levels in future periods.\nAs a percentage of revenue, Product Development expenses were 4% for the year ended December 31, 2020, as compared to 7% for 2019.\nDepreciation and Amortization\nDuring the year ended December 31, 2020, depreciation and amortization expenses decreased by $134,000, or 15%, to $751,000, as compared to $885,000 during 2019. The decrease is primarily related to intangible assets associated with the acquisition of PIR that became fully amortized during the year.\nOther income, net\nOther income, net, primarily relates to an $80,000 gain on extinguishment of debt associated with the final anniversary payment related to the acquisition of Interwest Transfer Company (“Interwest”) in 2017 as well as interest income on deposit and money market accounts. These items are partially offset by the non-cash interest associated with the present value of the anniversary payments of the Interwest acquisition.\nIncome Taxes\nWe recorded income tax expense of $724,000 during the year ended December 31, 2020, compared to $109,000 during the year ended December 31, 2019. The increase in income tax expense is attributable to higher pre-tax income for the year ended December 31, 2020. The difference between the Company’s effective tax rate of 26% and the federal statutory rate of 21% is primarily due to state taxes for 2020.\nDuring the year ended December 31, 2019, the Company’s effective tax rate was favorably impacted by the research and development tax credit, foreign tax credits as well as a benefit related to the exercise of stock-based compensation. The aforementioned reasons, as well as state taxes, foreign statutory tax rate differentials are the reasons for the variance between the Company’s effective tax rate and the statutory rate during 2019.\nNet Income\nNet income for the year ended December 31, 2020 was $2,106,000 as compared to $686,000 in 2019. The increase in net income is primarily due to the growth of our Communications revenue and higher gross margin percentages. Additionally, we experienced lower operating expenses which were partially offset by a decline in interest income and higher income taxes.\nLiquidity and Capital Resources\nAs of December 31, 2020, we had $19,556,000 in cash and cash equivalents and $2,514,000 in net accounts receivable. Current liabilities as of December 31, 2020, totaled $4,494,000 including our accounts payable, deferred revenue, accrued payroll liabilities, income taxes payable, current portion of lease liabilities and other accrued expenses. At December 31, 2020, our current assets exceeded our current liabilities by $17,789,000.\nEffective October 3, 2019, the Company renewed its Line of Credit, which increased the term to two years, with all other provisions remaining the same. The amount of funds available for borrowing are $3,000,000 and the interest rate is LIBOR plus 1.75%. As of December 31, 2020, the interest rate was 1.89% and the Company did not owe any amounts on the Line of Credit.\nDisclosure about Off-Balance Sheet Arrangements\nWe do not have any transactions, agreements or other contractual arrangements that constitute off-balance sheet arrangements.\nOutlook\nThe following statements and certain statements made elsewhere in this document are based upon current expectations. These statements are forward looking and are subject to factors that could cause actual results to differ materially from those suggested here, including, without limitation, demand for and acceptance of our services, new developments, competition and general economic or market conditions, particularly in the domestic and international capital markets. Refer also to the Cautionary Statement Concerning Forward Looking Statements included in this report.\nOn January 30, 2020, the World Health Organization declared the COVID-19 outbreak a \"Public Health Emergency of International Concern\" and on March 11, 2020, declared it to be a pandemic. Actions taken around the world to help mitigate the spread of COVID-19 include restrictions on travel, quarantines or “stay-at-home” restrictions in certain areas and forced closures for certain types of public places and businesses. COVID-19 and actions taken to mitigate it have had and are expected to continue to have an adverse impact on the economies and financial markets globally, including the geographical areas in which we operate. Although our offices were initially ordered temporarily closed for the safety of our employees, their families and our community, on June 1, 2020 we began slowly re-opening our offices, which are now open for all employees who voluntarily elect to return to the office.\nWhile it is unknown how long these conditions will last, including whether a worldwide resurgence will occur, variants of the virus will become more impactful or vaccines will be effective, and what the complete financial impact will be to the Company, we could experience a material disruption of our employees and operations, a decline in revenue, a decline in value of our assets, deterioration of our customer base and the inability of our customers to pay for subscriptions or services provided. To date, we have seen both positive and negative impacts to our business. Several in-person conferences scheduled to occur in the first half of the year were either cancelled or delayed and we also experienced a delay in transactions processed by the Depository Trust Company and banks and brokers in our transfer agent business. However, our ability to pivot and enhance our product offering with our virtual products generated increased revenue during the last three quarters of the year. Despite the short-term increase in revenue, the concentrations of our customer base within middle, small and micro-cap public customers make it reasonably possible that we are vulnerable to the risk of a near-term negative impact related to the COVID-19 outbreak if a substantial portion of these customers are forced to scale back or cease operations. We are closely monitoring the impact of the COVID-19 pandemic on all aspects of our business and are unable at this time to predict the continued impact that COVID-19 will have on our business, financial position, and operating results in future periods due to numerous uncertainties.\nOverall, the demand for our platforms and services continues to be stable in a majority of the segments we serve. We are seeing increased demand for virtual events using both our conference software and webcasting products, as customers are opting to hold virtual meetings. During the first and second quarter of 2020, we were able to pivot portions of our platform to specifically address COVID-19 business limitations. This resulted in a new Virtual Annual Meeting product, which combines our webcasting and proxy voting technology together. Additionally, we also upgraded technology of our conference software product to allow conferences to go entirely virtual and hold one-on-one meetings with audio, video and sharing features.\nWe believe these developments will assist us in delivering best of breed solutions to the market, but also lead us into new opportunities during this changing and challenging environment. The extent to how long these shifts in demands will occur is uncertain at this time and could be longer than just 2020 and the early part of 2021. However, we cannot make any assurances at this time that our product upgrades will be accepted by customers and revenue will be significant enough to offset losses in other aspects of our business in the long-term.\nThe transition to a platform subscription model has been and will continue to be key for our long-term sustainable growth. We will also continue to focus on the following key strategic initiatives during 2021:\n●\nContinue to expand our Communications products and adapt to this changing environment,\n●\nContinue to grow through acquisitions in areas of strategic focus,\n●\nContinue to expand our Communications sales and marketing teams and digital marketing strategy,\n●\nContinue to expand customer base,\n●\nContinue to expand our newswire distribution,\n●\nInvest in technology advancements and upgrades,\n●\nGenerate profitable sustainable growth\n●\nGenerate cash flows from operations.\nWe believe there is significant demand for our products around the world among the middle, small and micro-cap markets, as well as private companies, as they seek to find better platforms and tools to disseminate and communicate their messages. Although this demand may decrease or shift in the near term as a result of COVID-19, we believe we have the product sets, platforms, capacity and ability to adapt during these changing times to meet their requirements.\nWe have invested and will continue to invest in our product sets, platforms and intellectual property development via internal development and acquisitions. Acquisitions remain a core part of our strategy and we believe acquisitions are key to enhancing our overall offerings in the market and necessary to keep our competitive advantages and facilitate the next round of growth that management believes it can achieve. If we are successful in this effort, we believe we can further increase our market share and revenues per user as we move forward.\nCritical Accounting Policies and Estimates\nThe consolidated financial statements include the accounts of the Company and its wholly owned subsidiaries. Significant intercompany accounts and transactions are eliminated in consolidation.\nRevenue Recognition\nSubstantially all the Company’s revenue comes from contracts with customers for subscriptions to its cloud-based products or contracts for communications and compliance products and services. Customers consist of corporate issuers and professional firms, such as investor relations and public relations firms. In the case of our news distribution and webcasting offerings, our customers also include private companies. The Company accounts for a contract with a customer when there is an enforceable contract between the Company and the customer, the rights of the parties are identified, the contract has economic substance, and collectability of the contract consideration is probable. The Company's revenues are measured based on consideration specified in the contract with each customer.\nThe Company's contracts include either a subscription to our entire platform or certain modules within our platform, or an agreement to perform services, or any combination thereof, and often contain multiple subscriptions and services. For these bundled contracts, the Company accounts for individual subscriptions and services as separate performance obligations if they are distinct, which is when a product or service is separately identifiable from other items in the bundled package, and a customer can benefit from it on its own or with other resources that are readily available to the customer. The Company separates revenue from its contracts into two revenue streams: i) Platform and Technology and ii) Services. Performance obligations of Platform and Technology contracts include providing subscriptions to certain modules or the entire Platform id. system, distributing press releases on a per release basis or conducting webcasts or virtual annual meetings on a per event basis. Performance obligations of Services contracts include obligations to deliver compliance services and annual report printing and distribution on either a stand ready obligation or on a per project or event basis. Set up fees for compliance services are considered a separate performance obligation and are satisfied upfront. Set up fees for our transfer agent module and investor relations content management module are immaterial. The Company’s subscription and service contracts are generally for one year, with automatic renewal clauses included in the contract until the contract is cancelled. The contracts do not contain any rights of returns, guarantees or warranties. Since contracts are generally for one year, all the revenue is expected to be recognized within one year from the contract start date. As such, the Company has elected the optional exemption that allows the Company not to disclose the transaction price allocated to performance obligations that are unsatisfied or partially satisfied at the end of each reporting period.\nThe Company recognizes revenue for subscriptions evenly over the contract period, upon distribution for per release contracts and upon event completion for webcasting and virtual annual meeting events. For service contracts that include stand ready obligations, revenue is recognized evenly over the contract period. For all other services delivered on a per project or event basis, the revenue is recognized at the completion of the event. The Company believes recognizing revenue for subscriptions and stand ready obligations using a time-based measure of progress, best reflects the Company’s performance in satisfying the obligations.\nFor bundled contracts, revenue is allocated to each performance obligation based on its relative standalone selling price. Standalone selling prices are based on observable prices at which the Company separately sells the subscription or services. If a standalone selling price is not directly observable, the Company uses the residual method to allocate any remaining price to that subscription or service. The Company reviews standalone selling prices, at least annually, and updates these estimates if necessary.\nAccounts Receivable and Allowance for Doubtful Accounts\nThe Company monitors outstanding receivables based on factors surrounding the credit risk of specific customers, historical trends, and other information. Credit is granted on an unsecured basis. The allowance for doubtful accounts is estimated based on an assessment of the Company’s ability to collect on customer accounts receivable. There is judgment involved with estimating the allowance for doubtful accounts and if the financial condition of the Company’s customers were to deteriorate, resulting in their inability to make the required payments, the Company may be required to record additional allowances or charges against revenues. Given the current environment of the COVID-19 pandemic additional attention has been paid to the financial viability of our customers. The Company generally writes-off accounts receivable against the allowance when it determines a balance is uncollectible and no longer actively pursues its collection.\nIncome Taxes\nDeferred income tax assets and liabilities are computed for differences between the financial statement and tax bases of assets and liabilities that will result in future taxable or deductible amounts based on enacted tax laws and rates applicable to the periods in which the differences are expected to affect taxable income. Valuation allowances are established, when necessary, to reduce deferred income tax assets to the amounts expected to be realized. For any uncertain tax positions, we recognize the impact of a tax position, only if it is more likely than not of being sustained upon examination, based on the technical merits of the position. Our policy regarding the classification of interest and penalties is to classify them as income tax expense in our financial statements, if applicable.\nCapitalized Software\nCosts incurred to develop our cloud-based platform products are capitalized when the preliminary project phase is complete, management commits to fund the project and it is probable the project will be completed and used for its intended purposes. Once the software is substantially complete and ready for its intended use, the software is amortized over its estimated useful life, which is typically four years. Costs related to design or maintenance of the software are expensed as incurred.\nImpairment of Long-lived Assets\nIn accordance with the authoritative guidance for accounting for long-lived assets, assets such as property and equipment, trademarks, and intangible assets subject to amortization, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset group may not be recoverable. Recoverability of asset groups to be held and used is measured by a comparison of the carrying amount of an asset group to estimated undiscounted future cash flows expected to be generated by the asset group. If the carrying amount of an asset group exceeds its estimated future cash flows, an impairment charge is recognized by the amount by which the carrying amount of an asset group exceeds fair value of the asset group.\nLease Accounting\nWe determine if an arrangement is a lease at inception. Our operating lease agreements are primarily for office space and are included within lease right-of-use (“ROU”) assets and lease liabilities on the consolidated balance sheets.\nROU assets represent our right to use an underlying asset for the lease term and lease liabilities represent our obligation to make lease payments arising from the lease. ROU assets and lease liabilities are recognized at the commencement date based on the present value of lease payments over the lease term. Our variable lease payments consist of non-lease services related to the lease and payments under operating leases classified as short-term. Variable lease payments are excluded from the ROU assets and lease liabilities and are recognized in the period in which the obligation for those payments is incurred. As most of our leases do not provide an implicit rate, we use our incremental borrowing rate based on the information available at commencement date in determining the present value of lease payments. ROU assets include any lease payments made and exclude lease incentives. Rental expense for lease payments related to operating leases is recognized on a straight-line basis over the lease term.",
    "item_7A": "ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nWe do not believe that we face material market risk with respect to our cash or cash equivalents, which totaled $19,556,000 and $15,766,000 at December 31, 2020 and 2019, respectively. We did not hold any marketable securities as of December 31, 2020 or 2019.",
    "item_8": "ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nThe financial statements required by this Item 8 are set forth in Item 15 of this Annual Report. All information which has been omitted is either inapplicable or not required.\nOur balance sheets as of December 31, 2020 and 2019, and the related statements of income, comprehensive income, stockholders’ equity and cash flows for the two years ended December 31, 2020 and 2019, together with the independent registered public accountants’ reports thereon appear beginning on Page.",
    "item_9": "ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone.",
    "item_9A": "ITEM 9A. CONTROLS AND PROCEDURES.\nManagement’s Annual Report Regarding Internal Disclosure Controls and Procedures\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act. Internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation and fair presentation of financial statements for external purposes, in accordance with generally accepted accounting principles. The effectiveness of any system of internal control over financial reporting is subject to inherent limitations and therefore, may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness of future periods are subject to the risk that the controls may become inadequate due to change in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nThis annual report does not include an attestation report of the Company’s registered public accounting firm regarding internal control over financial reporting. Management’s report was not subject to attestation by the Company’s registered public accounting firm pursuant to rules of the Securities and Exchange Commission that permit the Company to provide only management’s report in this annual report.\nEvaluation of Disclosure Controls and Procedures\nBased on an evaluation under the supervision and with the participation of our management, our principal executive officer and principal financial officer have concluded that our disclosure controls and procedures as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (\"Exchange Act\") were effective as of December 31, 2020, to ensure that information required to be disclosed in reports that are filed or submitted under the Exchange Act is (i) recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission rules and forms and (ii) accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure.\nInherent Limitations over Internal Controls\nOur internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Our internal control over financial reporting includes those policies and procedures that: (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and disposition of our assets; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures are being made only in accordance with authorizations of management and directors; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of assets that could have a material effect on the financial statements.\nManagement, including our Chief Executive Officer and Chief Financial Officer, do not expect that our internal controls will prevent or detect all errors and all fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of internal controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected. Also, any evaluation of the effectiveness of controls in future periods are subject to the risk that those internal controls may become inadequate because of changes in business conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nReport of Management's Annual Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Securities Exchange Act of 1934, as amended). Management conducted an evaluation of the effectiveness of our internal control over financial reporting based on the criteria set forth by the Committee of Sponsoring Organizations (\"COSO\") updated Internal Control-Integrated Framework (2013). Based on this evaluation, management has concluded that our internal control over financial reporting was effective as of December 31, 2020.\nThere were no changes in our internal controls that could materially affect the disclosure controls and procedures subsequent to the date of their evaluation, nor were there any material deficiencies or material weaknesses in our internal controls. As a result, no corrective actions were required or undertaken.",
    "item_9B": "ITEM 9B. OTHER INFORMATION.\nNone.\nPART III",
    "item_10": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nThe information required by this Item is set forth under the headings “Directors, Executive Officers and Corporate Governance” and “Section 16(a) Beneficial Ownership Reporting Compliance” in the Company’s 2021 Proxy Statement to be filed with the U.S. Securities and Exchange Commission (\"SEC\") within 120 days after December 31, 2020 in connection with the solicitation of proxies for the Company’s 2021 annual meeting of shareholders and is incorporated herein by reference.",
    "item_11": "ITEM 11. EXECUTIVE COMPENSATION.\nThe information required by this Item is set forth under the heading “Executive Compensation” and under the subheadings “Board Oversight of Risk Management,” “Compensation of Directors,” “Director Compensation-2020” and “Compensation Committee Interlocks and Insider Participation” under the heading “Directors, Executive Officers and Corporate Governance” in the Company’s 2021 Proxy Statement to be filed with the SEC within 120 days after December 31, 2020 and is incorporated herein by reference.",
    "item_12": "ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe information required by this Item is set forth under the headings “Security Ownership of Certain Beneficial Owners and Management” and “Equity Compensation Plan Information” in the Company’s 2021 Proxy Statement to be filed with the SEC within 120 days after December 31, 2020 and is incorporated herein by reference.",
    "item_13": "ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nThe information required by this Item is set forth under the heading “Review, Approval or Ratification of Transactions with Related Persons” and under the subheading “Board Committees” under the heading “Directors, Executive Officers and Corporate Governance” in the Company’s 2021 Proxy Statement to be filed with the SEC within 120 days after December 31, 2020 and is incorporated herein by reference.",
    "item_14": "ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES.\nThe information required by this Item is set forth under the subheadings “Fees Paid to Auditors” and “Policy on Audit Committee Pre-Approval of Audit and Non-Audit Services Performed by the Independent Registered Public Accounting Firm” under the proposal “Ratification of Appointment of Independent Registered Public Accounting Firm” in the Company’s 2021 Proxy Statement to be filed with the SEC within 120 days after December 31, 2020 and is incorporated herein by reference.\nPART IV",
    "item_15": "ITEM 15. EXHIBITS.\n(a) Financial Statements\nThe financial statements listed in the accompanying index (page) to the financial statements are filed as part of this Annual Report on Form 10-K.\n(b) Exhibits\nExhibit Number\nExhibit Description\n3.1\nCertificate of Incorporation, as amended (incorporated by reference to Exhibit 3.1 to the Form S-3 filed on May 10, 2017)\n3.2\nAmended and Restated Bylaws (incorporated by reference to Exhibit 3.1 to the Form 8-K filed on February 12, 2014)\n10.1\n2014 Equity Incentive Plan (incorporated by reference to Annex A to the Schedule 14A filed on April 2, 2014)\n10.2\nExecutive Employment Agreement dated April 30, 2015 with Brian R. Balbirnie (incorporated by reference to Exhibit 10.1 to the Form 8-K filed on May 5, 2014)\n10.3\nExecutive Employment Agreement dated November 19, 2015 with Steven Knerr (incorporated by reference to Exhibit 10.1 to the Form 8-K filed on November 19, 2015)\n10.4\nIncentive Stock Option Grant and Agreement dated November 19, 2015 with Steven Knerr (incorporated by reference to Exhibit 10.2 to the Form 8-K filed on November 19, 2015)\n10.5\nIndemnification Agreement dated November 19, 2015 with Steven Knerr (incorporated by reference to Exhibit 10.3 to the Form 8-K filed on November 19, 2015)\n10.6\nFirst Amendment to 2014 Equity Incentive Plan (incorporated by reference to Exhibit 10.1 to the Form 8-K filed on June 13,\n10.7\nSecond Amendment to 2014 Equity Incentive Plan (incorporated by reference to Exhibit A to the Definitive Proxy Statement filed on April 28, 2020)\n10.8\nFirst Amendment to Executive Employment Agreement dated May 4, 2017 with Brian R. Balbirnie (incorporated by reference to Exhibit 10.1 to the Form 8-K filed on May 5, 2017)\n10.9\nFirst Amendment to Executive Employment Agreement dated May 4, 2017 with Steven Knerr (incorporated by reference to Exhibit 10.1 to the Form 8-K filed on May 5, 2017)\n10.10\nStock Purchase Agreement dated October 2, 2017 with Kurtis D. Hughes (incorporated by reference to Exhibit 10.1 to the Form 8-K filed on October 3, 2017)\n10.11\nStock Purchase Agreement dated July 3, 2018 with ACCESSWIRE Canada Ltd. and Fred Gautreau (incorporated by reference to Exhibit 10.1 to the Form 8-K filed on July 5, 2018)\n10.12\nStock Repurchase Agreement dated November 28, 2018 with EQS Group AG (incorporated by reference to Exhibit 10.1 to the Form 8-K filed on December 4, 2018)\n10.13\nAsset Purchase Agreement dated January 3, 2019 with Onstream Media Corporation (incorporated by reference to Exhibit 10.1 to the Form 8-K filed on January 3, 2019)\n21.1\nSubsidiaries of the Registrant.*\n23.1\nConsent of Independent Registered Public Accounting Firm.*\n31.1\nRule 13a-14(a) Certification of Principal Executive Officer.*\n31.2\nRule 13a-14(a) Certification of Principal Financial Officer.*\n32.1\nSection 1350 Certification of Principal Executive Officer.*\n32.2\nSection 1350 Certification of Principal Financial Officer.*\n-------\n* Filed herewith\n(c) Financial Statement Schedules omitted\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nISSUER DIRECT CORPORATION\nDate: March 4, 2021\nBy:\n/s/ Brian R. Balbirnie\nBrian R. Balbirnie\nChief Executive Officer, Director\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities indicated as of the dates set forth below.\nSignature\nDate\nTitle\n/s/ Brian R. Balbirnie\nMarch 4, 2021\nDirector, Chief Executive Officer\nBrian R. Balbirnie\n(Principal Executive Officer)\n/s/ Steven Knerr\nMarch 4, 2021\nChief Financial Officer\nSteven Knerr\n(Principal Accounting Officer)\n/s/ William Everett\nMarch 4, 2021\nDirector, Chairman of the Board and Member of the\nWilliam Everett\nAudit Committee and Strategic Advisory Committee\n/s/ J. Patrick Galleher\nMarch 4, 2021\nDirector, Chairman of the Compensation Committee\nJ. Patrick Galleher\nand Strategic Advisory Committee\n/s/ Michael Nowlan\nMarch 4, 2021\nDirector, Chairman of the Audit Committee\nMichael Nowlan\nPage\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of December 31, 2020 and 2019\nConsolidated Statements of Income for the years ended December 31, 2020 and 2019\nConsolidated Statements of Comprehensive Income for the years ended December 31, 2020 and 2019\nConsolidated Statements of Stockholders’ Equity for the years ended December 31, 2020 and\nConsolidated Statements of Cash Flows for the years ended December 31, 2020 and 2019\nNotes to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Stockholders Issuer Direct Corporation\nRaleigh, North Carolina\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Issuer Direct Corporation and subsidiaries (the “Company”) as of December 31, 2020 and 2019, and the related consolidated statements of income, comprehensive income, stockholders’ equity, and cash flows for each of the years in the two-year period ended December 31, 2020, and the related notes. In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2020 and 2019, and the results of its operations and its cash flows for each of the years in the two-year period ended December 31, 2020, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (“PCAOB”) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Company’s internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that:\n(1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nRevenue from Contracts with Customers\nThe Company had $18,525,717 in revenues for the year ended December 31, 2020. As disclosed in Note 2 to the consolidated financial statements, the Company’s contracts include subscriptions to its cloud-based products or contracts for communications and compliance products and services. The Company’s contracts include either a subscription to the entire platform or certain modules within the platform or an agreement to perform services, or any combination thereof, and often contain multiple subscriptions and services.\nDue to the nature of the Company’s contracts including multiple performance obligations, management exercises significant judgment in the following areas in determining appropriate revenue recognition:\n●\nDetermination of which products and services are considered distinct performance obligations that should be accounted for separately or combined.\n●\nDetermination of stand-alone selling prices for each performance obligation.\n●\nEstimation of contract transaction price and allocation of the transaction price to the performance obligations.\n●\nThe pattern of delivery for each distinct performance obligation.\n●\nDetermination of which products and services are recognized over time or point in time.\nAs a result, a high degree of auditor judgment was required in performing audit procedures to evaluate the reasonableness of management’s judgments. Changes in these judgments can have a material effect on the amount of revenue recognized on these contracts.\nBased on our knowledge of the Company, we determined the nature and extent of procedures to be performed over revenue, including the determination of the revenue streams over which those procedures were performed. Our audit procedures included the following for each revenue stream where procedures were performed:\n●\nObtained an understanding of the internal controls and processes in place over the Company’s revenue recognition processes.\n●\nAnalyzed the significant assumptions and estimates made by management as discussed above.\n●\nSelected a sample of revenue transactions and assessed the recorded revenue, analyzed the related contract, tested management’s identification of distinct performance obligations, compared the amounts recognized for consistency with underlying documentation, and tested certain controls identified for each revenue stream.\n/s/ Cherry Bekaert LLP\nWe have served as the Company’s auditor since 2010.\nRaleigh, North Carolina\nMarch 4, 2021\nISSUER DIRECT CORPORATION AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nAS OF DECEMBER 31, 2020 AND 2019\n(in thousands, except share and per share amounts)\nDecember 31,\nASSETS\nCurrent assets:\nCash and cash equivalents\n$19,556\n$15,766\nAccounts receivable (net of allowance for doubtful accounts of $657 and $700, respectively)\n2,514\n2,051\nIncome tax receivable\n-\nOther current assets\nTotal current assets\n22,368\n18,006\nCapitalized software (net of accumulated amortization of $2,761 and $2,153, respectively)\n1,134\nFixed assets (net of accumulated depreciation of $312 and $181, respectively)\nRight-of-use asset - leases (See Note 9)\n1,830\n2,127\nDeferred tax asset\n-\nOther long-term assets\nGoodwill\n6,376\n6,376\nIntangible assets (net of accumulated amortization of $5,546 and $4,937, respectively)\n2,906\n3,515\nTotal assets\n$34,889\n$32,390\nLIABILITIES AND STOCKHOLDERS’ EQUITY\nCurrent liabilities:\nAccounts payable\n$304\n$266\nAccrued expenses\n1,805\n1,151\nNote payable - short-term (net of discount of $0 and $19, respectively) (See Note 4)\n-\nIncome taxes payable\nDeferred revenue\n2,212\n1,812\nTotal current liabilities\n4,579\n3,840\nDeferred income tax liability\nLease liabilities - long-term (See Note 9)\n1,971\n2,309\nTotal liabilities\n6,747\n6,290\nCommitments and contingencies (see Note 10)\nStockholders' equity:\nPreferred stock, $0.001 par value, 1,000,000 shares authorized, no shares issued and outstanding as of December 31, 2020 and 2019, respectively.\n-\n-\nCommon stock $0.001 par value, 20,000,000 shares authorized, 3,770,752 and 3,786,398 shares issued and outstanding as of December 31, 2020 and 2019, respectively.\nAdditional paid-in capital\n22,214\n22,275\nOther accumulated comprehensive loss\n(19)\n(16)\nRetained earnings\n5,943\n3,837\nTotal stockholders' equity\n28,142\n26,100\nTotal liabilities and stockholders’ equity\n$34,889\n$32,390\nThe accompanying notes are an integral part of these consolidated financial statements.\nISSUER DIRECT CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF INCOME\n(in thousands, except per share amounts)\nYears Ended December 31,\nRevenues\n$18,526\n$16,295\nCost of revenues\n5,415\n5,080\nGross profit\n13,111\n11,215\nOperating costs and expenses:\nGeneral and administrative\n5,029\n5,086\nSales and marketing\n3,812\n3,551\nProduct development\n1,219\nDepreciation and amortization\nTotal operating costs and expenses\n10,417\n10,741\nOperating income\n2,694\nOther income\nGain on extinguishment of debt (See Note 2)\n-\nInterest income, net\nNet income before income taxes\n2,830\nIncome tax expense\nNet income\n$2,106\n$686\nIncome per share - basic\n$0.56\n$0.18\nIncome per share - diluted\n$0.56\n$0.18\nWeighted average number of common shares outstanding - basic\n3,755\n3,839\nWeighted average number of common shares outstanding - diluted\n3,784\n3,861\nThe accompanying notes are an integral part of these consolidated financial statements.\nISSUER DIRECT CORPORATION\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(in thousands)\nYears Ended December 31,\nNet income\n$2,106\n$686\nForeign currency translation adjustment\n(3)\nComprehensive income\n$2,103\n$687\nThe accompanying notes are an integral part of these consolidated financial statements.\nISSUER DIRECT CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\nYEARS ENDED DECEMBER 31, 2020 AND 2019\n(in thousands, except share and per share amounts)\nCommon Stock\nAdditional\nAccumulated Other\nTotal\nShares\nAmount\nPaid-in Capital\nComprehensive Loss\nRetained Earnings\nStockholders’ Equity\nBalance on December 31, 2018\n3,829,572\n$4\n$22,525\n$(17)\n$3,151\n$25,663\nStock-based compensation expense\n-\n-\n-\n-\nExercise of stock awards, net of tax\n32,996\n-\n-\n-\n-\n-\nStock repurchase and retirement (see Note 7)\n(76,170)\n-\n(773)\n-\n-\n(773)\nForeign currency translation\n-\n-\n-\n-\nNet income\n-\n-\n-\n-\nBalance on December 31, 2019\n3,786,398\n$4\n$22,275\n$(16)\n$3,837\n$26,100\nStock-based compensation expense\n-\n-\n-\n-\nExercise of stock awards, net of tax\n68,252\n-\n-\n-\nStock repurchase and retirement (see Note 7)\n(83,898)\n-\n(785)\n-\n-\n(785)\nForeign currency translation\n-\n-\n-\n(3)\n-\n(3)\nNet income\n-\n-\n-\n-\n2,106\n2,106\nBalance on December 31, 2020\n3,770,752\n$4\n$22,214\n$(19)\n$5,943\n$28,142\nThe accompanying notes are an integral part of these consolidated financial statements.\nISSUER DIRECT CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in thousands, except share and per share amounts)\nYears Ended December 31,\nCash flows from operating activities\nNet income\n$2,106\n$686\nAdjustments to reconcile net income to net cash provided by operating activities:\nBad debt expense\nDepreciation and amortization\n1,348\n1,667\nDeferred income taxes\n(528)\nNon-cash interest expense\nStock-based compensation expense\nGain on extinguishment of debt\n(80)\n-\nChanges in operating assets and liabilities:\nDecrease (increase) in accounts receivable\n(761)\n(1,210)\nDecrease (increase) in other assets\nIncrease (decrease) in accounts payable\n(117)\nIncrease (decrease) in deferred revenue\nIncrease (decrease) in accrued expenses and other liabilities\nNet cash provided by operating activities\n4,386\n2,864\nCash flows from investing activities\nPurchase of fixed assets\n(27)\n(420)\nPurchase of acquired businesses (See Note 4)\n-\n(2,788)\nCapitalized software\n-\n(20)\nNet cash used in investing activities\n(27)\n(3,228)\nCash flows from financing activities\nPayment for stock repurchase and retirement (see Note 7)\n(785)\n(773)\nPayment on notes payable\n(240)\n(320)\nProceeds from exercise of stock options, net of income taxes\n-\nNet cash used in financing activities\n(574)\n(1,093)\nNet change in cash\n3,785\n(1,457)\nCash- beginning\n15,766\n17,222\nCurrency translation adjustment\nCash- ending\n$19,556\n$15,766\nSupplemental disclosures:\nCash paid for income taxes\n$458\n$340\nNon-cash activities:\nRight-of-use assets obtained in exchange for lease liabilities\n$-\n$2,856\nThe accompanying notes are an integral part of these consolidated financial statements.\nNote 1: Description, Background and Basis of Operations\nNature of Operations\nIssuer Direct Corporation (the “Company” or “Issuer Direct”) was incorporated in the State of Delaware in October 1988 under the name Docucon Inc. Subsequent to the December 13, 2007 merger with My EDGAR, Inc., the Company changed its name to Issuer Direct Corporation. Today, Issuer Direct is an industry-leading global communications and compliance company focusing on the needs of corporate issuers. Issuer Direct's principal platform, Platform id.™, empowers users by thoughtfully integrating the most relevant tools, technologies and products, thus eliminating the complexity associated with producing and distributing their business communications and financial information. The Company operates under several brands in the market, including Direct Transfer, PrecisionIR (PIR), Investor Network, Interwest and ACCESSWIRE. The Company leverages its securities compliance and regulatory expertise to provide a comprehensive set of services that enhance a customer’s ability to communicate effectively with its shareholder base while meeting all reporting regulations required.\nNote 2: Summary of Significant Accounting Policies\nThe consolidated financial statements include the accounts of the Company and its wholly owned subsidiaries. Significant intercompany accounts and transactions are eliminated in consolidation.\nCash Equivalents\nFor purposes of the Company’s financial statements, the Company considers all highly liquid investments purchased with an original maturity date of three months or less to be cash equivalents.\nAccounts Receivable and Allowance for Doubtful Accounts\nThe Company monitors outstanding receivables based on factors surrounding the credit risk of specific customers, historical trends, and other information. Credit is granted on an unsecured basis. The allowance for doubtful accounts is estimated based on an assessment of the Company’s ability to collect on customer accounts receivable. There is judgment involved with estimating the allowance for doubtful accounts and if the financial condition of the Company’s customers were to deteriorate, resulting in their inability to make the required payments, the Company may be required to record additional allowances or charges against revenues. Given the current environment of the COVID-19 pandemic additional attention has been paid to the financial viability of our customers. The Company generally writes-off accounts receivable against the allowance when it determines a balance is uncollectible and no longer actively pursues its collection.\nThe following is a summary of our allowance for doubtful accounts during the years ended December 31, 2020 and 2019 (in 000’s):\nYear Ended\nDecember 31,\nYear Ended\nDecember 31,\nBeginning balance\n$700\n$534\nBad debt expense\nWrite-offs\n(347)\n(587)\nEnding balance\n$657\n$700\nConcentration of Credit Risk\nFinancial instruments and related items which potentially subject the Company to concentrations of credit risk consist primarily of cash, cash equivalents and accounts receivables. The Company places its cash and temporary cash investments with credit quality institutions. Such cash balances are currently in excess of the FDIC insurance limit of $250,000. To reduce its risk associated with the failure of such financial institutions, each quarter the Company evaluates the rating of the financial institution in which it holds deposits. As of December 31, 2020, the total amount exceeding such limit was $18,397,000. The Company also had cash-on-hand of $45,000 in Europe and $441,000 in Canada as of December 31, 2020.\nThe Company believes it did not have any financial instruments that could have potentially subjected us to significant concentrations of credit risk for any relevant period.\nRevenue Recognition\nSubstantially all the Company’s revenue comes from contracts with customers for subscriptions to its cloud-based products or contracts for communications and compliance products and services. Customers consist of corporate issuers and professional firms, such as investor relations and public relations firms. In the case of our news distribution and webcasting offerings, our customers also include private companies. The Company accounts for a contract with a customer when there is an enforceable contract between the Company and the customer, the rights of the parties are identified, the contract has economic substance, and collectability of the contract consideration is probable. The Company's revenues are measured based on consideration specified in the contract with each customer.\nThe Company's contracts include either a subscription to our entire platform or certain modules within our platform, or an agreement to perform services, or any combination thereof, and often contain multiple subscriptions and services. For these bundled contracts, the Company accounts for individual subscriptions and services as separate performance obligations if they are distinct, which is when a product or service is separately identifiable from other items in the bundled package, and a customer can benefit from it on its own or with other resources that are readily available to the customer. The Company separates revenue from its contracts into two revenue streams: i) Platform and Technology and ii) Services. Performance obligations of Platform and Technology contracts include providing subscriptions to certain modules or the entire Platform id. system, distributing press releases on a per release basis or conducting webcasts or virtual annual meetings on a per event basis. Performance obligations of Services contracts include obligations to deliver compliance services and annual report printing and distribution on either a stand ready obligation or on a per project or event basis. Set up fees for compliance services are considered a separate performance obligation and are satisfied upfront. Set up fees for our transfer agent module and investor relations content management module are immaterial. The Company’s subscription and service contracts are generally for one year, with automatic renewal clauses included in the contract until the contract is cancelled. The contracts do not contain any rights of returns, guarantees or warranties. Since contracts are generally for one year, all the revenue is expected to be recognized within one year from the contract start date. As such, the Company has elected the optional exemption that allows the Company not to disclose the transaction price allocated to performance obligations that are unsatisfied or partially satisfied at the end of each reporting period.\nThe Company recognizes revenue for subscriptions evenly over the contract period, upon distribution for per release contracts and upon event completion for webcasting and virtual annual meeting events. For service contracts that include stand ready obligations, revenue is recognized evenly over the contract period. For all other services delivered on a per project or event basis, the revenue is recognized at the completion of the event. The Company believes recognizing revenue for subscriptions and stand ready obligations using a time-based measure of progress, best reflects the Company’s performance in satisfying the obligations.\nFor bundled contracts, revenue is allocated to each performance obligation based on its relative standalone selling price. Standalone selling prices are based on observable prices at which the Company separately sells the subscription or services. If a standalone selling price is not directly observable, the Company uses the residual method to allocate any remaining price to that subscription or service. The Company reviews standalone selling prices, at least annually, and updates these estimates if necessary.\nThe Company invoices its customers based on the billing schedules designated in its contracts, typically upfront on either a monthly, quarterly or annual basis or per transaction at the completion of the performance obligation. Deferred revenue for the periods presented was primarily related to subscription and service contracts, which are billed upfront, quarterly or annually, however the revenue has not yet been recognized. The associated deferred revenue is generally recognized ratably over the billing period. Additionally, deferred revenue is related to pre-paid packages of press releases for which the releases have not yet been disseminated. Deferred revenue as of December 31, 2020 and December 31, 2019 was $2,212,000 and $1,812,000, respectively, and is expected to be recognized within one year. Revenue recognized for the year ended December 31, 2020 and 2019, that was included in the deferred revenue balance at the beginning of each reporting period, was approximately $1,812,000 and $1,249,000, respectively. Accounts receivable, net of allowance for doubtful accounts, related to contracts with customers was $2,514,000 and $2,051,000 as of December 31, 2020 and December 31, 2019, respectively. Since substantially all the contracts have terms of one year or less, the Company has elected to use the practical expedient regarding the existence of a significant financing.\nCosts to obtain contracts with customers consist primarily of sales commissions. As of December 31, 2020 and 2019, the Company has capitalized $44,000 and $21,000, respectively, of costs to obtain contracts that are expected to be amortized over more than one year. For contract costs expected to be amortized in less than one year, the Company has elected to use the practical expedient allowing the recognition of incremental costs of obtaining a contract as an expense when incurred. The Company has considered historical renewal rates, expectations of future renewals and economic factors in making these determinations.\nFixed Assets\nFixed assets are recorded at cost and depreciated over the estimated useful lives of the assets using principally the straight-line method. When items are retired or otherwise disposed of, income is charged or credited for the difference between net book value and proceeds realized thereon. Ordinary maintenance and repairs are charged to expense as incurred, and replacements and betterments are capitalized. The range of estimated useful lives used to calculate depreciation for principal items of property and equipment are as follow:\nAsset Category\nDepreciation / Amortization Period\nComputer equipment\nyears\nFurniture & equipment\n3 to 7 years\nLeasehold improvements\n8 years or lesser of the lease term\nEarnings per Share\nEarnings per share accounting guidance requires that basic net income per common share be computed by dividing net income for the period by the weighted average number of common shares outstanding during the period. Diluted net income per share is computed by dividing the net income for the period by the weighted average number of common and dilutive common equivalent shares outstanding during the period. Shares issuable upon the exercise of stock options totaling 40,000 and 93,000 were excluded in the computation of diluted earnings per common share during the years ended December 31, 2020 and 2019, respectively, because their impact was anti-dilutive.\nUse of Estimates\nThe preparation of financial statements in conformity with United States Generally Accepted Accounting Principles (“GAAP”) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Significant estimates include the allowance for doubtful accounts and the valuation of goodwill, intangible assets, deferred tax assets, and stock-based compensation. Actual results could differ from those estimates.\nGain on Extinguishment of Debt\nOn October 2, 2017, the Company entered into a Stock Purchase Agreement (the “Interwest Purchase Agreement’) to purchase all of the outstanding equity securities of Interwest Transfer Company, Inc., a Utah corporation (“Interwest”) a transfer agent business located in Salt Lake City, Utah. Under the terms of the Interwest Purchase Agreement the Company paid $1,935,000 at closing, $288,000 on the first anniversary of the closing, $320,000 on the second anniversary of the closing and called for another $320,000 to be paid upon the third anniversary date of the closing. The Company also issued 25,235 shares of restricted common stock of the Company at closing. Upon final negotiation and settlement of the third anniversary payment, the Company paid $240,000 to the seller. The difference of $80,000 that was not paid is recorded as Gain on Extinguishment of Debt on the Consolidated Statements of Income for the year ended December 31, 2020.\nIncome Taxes\nWe comply with Financial Accounting Standards Board (“FASB”) Accounting Standards Codification (“ASC”) No. 740 - Income Taxes which requires an asset and liability approach to financial accounting and reporting for income taxes. Deferred income tax assets and liabilities are computed for differences between the financial statement and tax bases of assets and liabilities that will result in future taxable or deductible amounts based on enacted tax laws and rates applicable to the periods in which the differences are expected to affect taxable income. Valuation allowances are established, when necessary, to reduce deferred income tax assets to the amounts expected to be realized. For any uncertain tax positions, we recognize the impact of a tax position, only if it is more likely than not of being sustained upon examination, based on the technical merits of the position. Our policy regarding the classification of interest and penalties is to classify them as income tax expense in our financial statements, if applicable.\nCapitalized Software\nCosts incurred to develop our cloud-based platform products are capitalized when the preliminary project phase is complete, management commits to fund the project and it is probable the project will be completed and used for its intended purposes. Once the software is substantially complete and ready for its intended use, the software is amortized over its estimated useful life, which is typically four years. Costs related to design or maintenance of the software are expensed as incurred. The Company did not capitalize any costs for software development during the year ended December 31, 2020 and capitalized $20,000 during the year ended December 31, 2019. The Company recorded amortization expense of $608,000 and $843,000 during the years ended December 31, 2020 and 2019, respectively, $599,000 and $783,000 of which is included in Cost of revenues on the Consolidated Statements of Income. The remaining amount of $9,000 and $60,000 for the years ended December 31, 2020 and 2019, respectively, is included in Depreciation and amortization.\nThe Company reviews capitalized software for impairment whenever events or changes in circumstances indicate the carrying amount of an asset may not be recoverable. One part of the Company’s suite of products was directed toward private companies seeking to raise capital under Regulation A+ and Regulation D. Market acceptance under these regulations is behind what was initially anticipated, resulting in lower-than-expected revenue from this product. As a result, the Company wrote-off the remaining carrying value of this product in the amount of $44,000 as of December 31, 2019. This amount is included in Depreciation and amortization expense on the Consolidated Statements of Income for the year ended December 31, 2019.\nImpairment of Long-lived Assets\nIn accordance with the authoritative guidance for accounting for long-lived assets, assets such as property and equipment, trademarks, and intangible assets subject to amortization, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset group may not be recoverable. Recoverability of asset groups to be held and used is measured by a comparison of the carrying amount of an asset group to estimated undiscounted future cash flows expected to be generated by the asset group. If the carrying amount of an asset group exceeds its estimated future cash flows, an impairment charge is recognized by the amount by which the carrying amount of an asset group exceeds fair value of the asset group.\nLease Accounting\nWe determine if an arrangement is a lease at inception. Our operating lease agreements are primarily for office space and are included within lease right-of-use (“ROU”) assets and lease liabilities on the consolidated balance sheets.\nROU assets represent our right to use an underlying asset for the lease term and lease liabilities represent our obligation to make lease payments arising from the lease. ROU assets and lease liabilities are recognized at the commencement date based on the present value of lease payments over the lease term. Our variable lease payments consist of non-lease services related to the lease and payments under operating leases classified as short-term. Variable lease payments are excluded from the ROU assets and lease liabilities and are recognized in the period in which the obligation for those payments is incurred. As most of our leases do not provide an implicit rate, we use our incremental borrowing rate based on the information available at commencement date in determining the present value of lease payments. ROU assets include any lease payments made and exclude lease incentives. Rental expense for lease payments related to operating leases is recognized on a straight-line basis over the lease term.\nFair Value Measurements\nASC Topic 820 establishes a fair value hierarchy that requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. Assets and liabilities recorded at fair value in the financial statements are categorized based upon the hierarchy of levels of judgment associated with the inputs used to measure their fair value. Hierarchical levels directly related to the amount of subjectivity associated with the inputs to fair valuation of these assets and liabilities, are as follows:\n●\nLevel 1 - Quoted prices are available in active markets for identical assets or liabilities at the reporting date. Generally, this includes debt and equity securities that are traded in an active market. Our cash and cash equivalents are quoted at Level 1.\n●\nLevel 2 - Observable inputs other than Level 1 prices such as quoted prices for similar assets or liabilities; quoted prices in markets that are not active; or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities. Generally, this includes debt and equity securities that are not traded in an active market.\n●\nLevel 3 - Unobservable inputs that are supported by little or no market activity and that are significant to the fair value of the assets or liabilities. Level 3 assets and liabilities include financial instruments whose value is determined using pricing models, discounted cash flow methodologies, or other valuation techniques, as well as instruments for which the determination of fair value requires significant management judgment or estimation.\nAs of December 31, 2020 and 2019, we believe that the fair value of our financial instruments other than cash and cash equivalents, such as, accounts receivable, our line of credit, notes payable, and accounts payable approximate their carrying amounts.\nStock-based Compensation\nThe authoritative guidance for stock compensation requires that companies estimate the fair value of share-based payment awards on the date of the grant using an option-pricing model. The associated cost is recognized over the period during which an employee or director is required to provide service in exchange for the award.\nTranslation of Foreign Financial Statements\nThe financial statements of the foreign subsidiaries of the Company have been translated into U.S. dollars. All assets and liabilities have been translated at current rates of exchange in effect at the end of the period. Income and expense items have been translated at the average exchange rates for the year or the applicable interim period. The gains or losses that result from this process are recorded as a separate component of other accumulated comprehensive income until the entity is sold or substantially liquidated.\nComprehensive Income\nComprehensive income consists of net income and other comprehensive income related to changes in the cumulative foreign currency translation adjustment.\nBusiness Combinations, Goodwill and Intangible Assets\nWe account for business combinations under FASB ASC No. 805 - Business Combinations and the related acquired intangible assets and goodwill under FASB ASC No. 350 - Intangibles - Goodwill and Other. The authoritative guidance for business combinations specifies the criteria for recognizing and reporting intangible assets apart from goodwill. We record the assets acquired and liabilities assumed in business combinations at their respective fair values at the date of acquisition, with any excess purchase price recorded as goodwill. Goodwill is an asset representing the future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized. Intangible assets consist of client relationships, customer lists, distribution partner relationships, software, technology, non-compete agreements and trademarks that are initially measured at fair value. At the time of the business combination, trademarks are considered an indefinite-lived asset and, as such, are not amortized as there is no foreseeable limit to cash flows generated from them. The goodwill and intangible assets are assessed annually for impairment, or whenever conditions indicate the asset may be impaired, and any such impairment will be recognized in the period identified. The client relationships (7-10 years), customer lists (3 years), distribution partner relationships (10 years), non-compete agreements (5 years) and software and technology (3-6 years) are amortized over their estimated useful lives (See Note 4).\nAdvertising\nThe Company expenses advertising as incurred. Advertising expense totaled $245,000 and $163,000, during the years ended December 31, 2020 and 2019, respectively.\nRecently adopted accounting pronouncements\nOn January 1, 2020, the Company adopted Accounting Standard Update (“ASU”) 2017-04 Intangibles - Goodwill and Other (Topic 350): Simplifying the Test for Goodwill Impairment. These amendments eliminate Step 2 from the goodwill impairment test. The annual, or interim, goodwill impairment test is performed by comparing the fair value of a reporting unit with its carrying amount. An impairment charge should be recognized for the amount by which the carrying amount exceeds the reporting unit’s fair value; however, the loss recognized should not exceed the total amount of goodwill allocated to that reporting unit. In addition, income tax effects from any tax-deductible goodwill on the carrying amount of the reporting unit should be considered when measuring the goodwill impairment loss, if applicable. The amendments also eliminate the requirements for any reporting unit with a zero or negative carrying amount to perform a qualitative assessment and, if it fails that qualitative test, to perform Step 2 of the goodwill impairment test. An entity still has the option to perform the qualitative assessment for a reporting unit to determine if the quantitative impairment test is necessary. The Company adopted this amendment as of January 1, 2020 and it has not, nor is it expected to have a significant impact to the financial statements.\nNote 3: Fixed Assets\nin $000’s\nDecember 31,\nComputers equipment\n$122\n$108\nFurniture & equipment\nLeasehold improvements\nTotal fixed assets, gross\n1,107\n1,080\nLess: Accumulated depreciation\n(312)\n(181)\nTotal fixed assets, net\n$795\n$899\nIncluded in leasehold improvements is $488,000 of tenant improvements allowance associated with a lease signed in March 2019 related to the Company’s new corporate headquarters. Depreciation expense on fixed assets for the years ended December 31, 2020 and 2019 totaled $131,000 and $106,000, respectively. No disposals were made during the year ended December 31, 2020. During the year ended December 31, 2019, the Company disposed of fixed assets totaling $377,000.\nNote 4: Recent Acquisitions\nAcquisition of the VisualWebcaster Platform (“VWP”)\nOn January 3, 2019 (the “Closing Date”), the Company entered into an Asset Purchase Agreement (the “VWP Agreement”) with Onstream Media Corporation, a Florida corporation (the “Seller”), whereby the Company purchased certain assets related primarily to customer accounts, intellectual property, lease deposits and assumed certain existing contractual obligations related primarily to data processing and storage, bandwidth and facility leases relating to the Seller’s VisualWebcaster Platform. The accounts receivable and the accounts payable related to VWP and existing as of the Closing Date were not included as part of the VWP Agreement.\nThe acquisition was accounted for under the acquisition method of accounting for business combinations in accordance with FASB ASC 805, Business Combinations, which requires, among other things, that the assets acquired and liabilities assumed be recognized at their fair values as of the acquisition date. Acquisition-related costs, which totaled approximately $155,000, are not included as a component of the acquisition accounting, but are recognized as expenses in the periods in which the costs are incurred. The Company employed a third-party valuation firm to assist in determining the purchase price allocation of assets and liabilities acquired from Seller. The valuation resulted in the tangible and intangible assets and liabilities disclosed below. The income approach was used to determine the value of the customer relationships and non-compete agreement. The income approach determines the fair value for the asset based on the present value of cash flows projected to be generated by the asset. Projected cash flows are discounted at a rate of return that reflects the relative risk of achieving the cash flow and the time value of money. Projected cash flows considered multiple factors, including current revenue from existing customers; analysis of expected revenue and attrition trends; reasonable contract renewal assumptions from the perspective of a marketplace participant; probability of executives competing, expected profit margins giving consideration to marketplace synergies; and required returns to contributory assets. The relief from royalty method was used to value the technology. The relief from royalty method determines the fair value by calculating what a typical license fee would be in order to obtain the same or similar license of the technology from market participants. Projected cash flows consider revenue assumptions allocated to the technology.\nThe transaction consisted of a single cash payment to the Seller in the amount of $2,788,000. In connection with the acquisition, the Company assumed two short-term leases associated with an office and co-location for certain computer equipment in New York City, New York as well as entered into a three-year office lease in Florida. In addition to the intangible assets listed below, the purchase price included lease deposits of $13,000 and a right of use asset and corresponding lease liability for the office lease in Florida in the amount of $125,000.\nThe identified intangible assets as a result of the acquisition are as follows (in 000’s):\nCustomer relationships\n$865\nTechnology\nNon-compete agreement\nGoodwill\n1,344\n$2,775\nNote 5: Goodwill and Other Intangible Assets\nThe components of intangible assets are as follows (in 000’s):\nDecember 31,\nGross Carrying\nAmount\nAccumulated\nAmortization\nNet Carrying\nAmount\nCustomer lists\n$1,770\n$(1,770)\n$-\nCustomer relationships\n4,600\n(2,589)\n2,011\nProprietary software\n1,279\n(948)\nDistribution partner relationships\n(38)\nNon-compete agreement\n(28)\nTrademarks - definite-lived\n(173)\n-\nTrademarks - indefinite-lived\n-\nTotal intangible assets\n$8,452\n$(5,546)\n$2,906\nDecember 31,\nGross Carrying\nAmount\nAccumulated\nAmortization\nNet Carrying\nAmount\nCustomer lists\n$1,770\n$(1,770)\n$-\nCustomer relationships\n4,600\n(2,100)\n2,500\nProprietary software\n1,279\n(865)\nDistribution partner relationships\n(23)\nNon-compete agreement\n(14)\nTrademarks - definite-lived\n(165)\nTrademarks - indefinite-lived\n-\nTotal intangible assets\n$8,452\n$(4,937)\n$3,515\nThe Company performed its annual assessment for impairment of goodwill and intangible assets and determined there was no impairment as of and for the years ended December 31, 2020 and 2019.\nThe amortization of intangible assets is a charge to operating expenses and totaled $609,000 and $718,000 in the years ended 2020 and 2019, respectively.\nThe future amortization of the identifiable intangible assets is as follows (in 000’s):\nYears Ending December 31:\n$459\nThereafter\nTotal\n$2,498\nOur goodwill balance of $6,376,000 on December 31, 2020, was related to our acquisition of Basset Press in July 2007, PIR in 2013, ACCESSWIRE in 2014, Interwest in 2017, FSCwire in 2018 and VWP in 2019. We conducted our annual impairment analyses as of October 1, of 2020 and 2019 and determined that no goodwill was impaired.\nNote 6: Line of Credit\nEffective October 3, 2019, the Company renewed its unsecured Line of Credit, which increased the term to two years, with all other provisions remaining the same. The amount of funds available for borrowing are $3,000,000 and the interest rate is LIBOR plus 1.75%. As of December 31, 2020, the interest rate was 1.89% and the Company did not owe any amounts on the Line of Credit.\nNote 7: Equity\nDividends\nWe did not pay any dividends during the years ended December 31, 2020 and 2019.\nPreferred stock and common stock\nThere were no issuances of preferred stock or common stock during the years ended December 31, 2020 and 2019 other than stock awarded to employees and the Board of Directors.\nStock repurchase and retirement\nOn August 7, 2019, the Company publicly announced a share repurchase program under which the Company is authorized to repurchase up to $1,000,000 of its common shares. On March 16, 2020, the Company publicly announced that the Company increased the share repurchase program to repurchase up to $2,000,000 of its common shares. As of December 31, 2020, the Company repurchased a total of 160,068 shares at an aggregate cost of $1,552,000 (not including commissions of $6,000) as shown in the table below ($ in 000’s, except share or per share amounts):\nShares Repurchased\nPeriod\nTotal Number of Shares Repurchased\nAverage Price Paid Per Share\nTotal Number of Shares Purchased as Part of Publicly Announced Program\nMaximum Dollar Value of Shares that May Yet Be Purchased Under the Program\nAugust 7 -31,\n22,150\n$9.34\n22,150\n$793\nSeptember 1-30,\n2,830\n$10.00\n2,830\n$765\nOctober 1-31,\n39,363\n$10.44\n39,363\n$354\nNovember 1-30,\n11,827\n$10.43\n11,827\n$231\nDecember 1-31,\n-\n-\n-\n$231\nJanuary 1-31,\n-\n-\n-\n$231\nFebruary 1-29,\n-\n-\n-\n$231\nMarch 1-31,\n21,700\n$9.33\n21,700\n$1,028\nApril 1-30,\n22,698\n$9.02\n22,698\n$823\nMay 1-31,\n39,500\n$9.51\n39,500\n$448\nTotal\n160,068\n$9.70\n160,068\n$448\nThere were no shares repurchased during the period of June 1, 2020 through December 31, 2020.\nNote 8: Stock Options and Restricted Stock Units\nOn May 23, 2014, the shareholders of the Company approved the 2014 Equity Incentive Plan (the “2014 Plan”). Under the terms of the 2014 Plan, the Company is authorized to issue incentive awards for common stock up to 200,000 shares to employees and other personnel. On June 10, 2016 and June 17, 2020, the shareholders of the Company approved an additional 200,000 and 200,000 awards, respectively, to be issued under the 2014 Plan, bringing the total number of shares to be awarded to 600,000. The awards may be in the form of incentive stock options, nonqualified stock options, restricted stock, restricted stock units and performance awards. The 2014 Plan is effective through March 31, 2024. As of December 31, 2020, there are 236,583 shares which remain to be granted under the 2014 Plan.\nThe following is a summary of stock options issued during the year ended December 31, 2020 and 2019:\nNumber of Options\nOutstanding\nRange of\nExercise Price\nWeighted Average\nExercise Price\nAggregate\nIntrinsic Value\nBalance on December 31, 2018\n98,563\n$6.80 - 17.40\n$12.56\n$127,306\nOptions granted\n31,500\n10.75 - 13.21\n12.90\n-\nOptions exercised\n-\n-\n-\n-\nOptions forfeited/cancelled\n(2,500)\n13.21\n13.21\n-\nBalance on December 31, 2019\n127,563\n$6.80 - 17.40\n$12.63\n$142,818\nOptions granted\n-\n-\n-\n-\nOptions exercised\n(36,250)\n7.76 - 17.40\n12.47\n295,921\nOptions forfeited/cancelled\n(16,083)\n9.26 - 17.40\n15.17\n22,682\nBalance on December 31, 2020\n75,230\n$6.80 - 17.40\n$12.16\n$402,275\nThe aggregate intrinsic value in the table above represents the total pretax intrinsic value (i.e. the aggregate difference between the closing price of our common stock on December 31, 2020 and 2019 of $17.51 and $11.69, respectively, and the exercise price for in-the-money options) that would have been received by the holders if all instruments had been exercised on December 31, 2020 and 2019. As of December 31, 2020, there was $15,000 of unrecognized compensation cost related to our unvested stock options, which will be recognized through 2021.\nThe following is a summary of unvested stock options during the year ended December 31, 2020 and 2019:\nNumber of Options\nOutstanding\nWeighted Average\nExercise Price\nWeighted Average Grant Date Fair Value\nBalance on December 31, 2018\n29,000\n$12.87\n$5.47\nOptions vested\n-\n-\n-\nOptions forfeited/cancelled\n-\n-\n-\nBalance on December 31, 2019\n29,000\n$12.87\n$5.47\nOptions vested\n(14,500)\n12.87\n5.47\nOptions forfeited/cancelled\n-\n-\n-\nBalance on December 31, 2020\n14,500\n$12.87\n$5.47\nThe following table summarizes information about stock options outstanding and exercisable on December 31, 2020:\nOptions Outstanding\nOptions Exercisable\nExercise Price Range\nNumber\nWeighted Average Remaining Contractual Life (in Years)\nWeighted Average Exercise Price\nNumber\n$0.01 - 7.00\n10,000\n4.88\n$6.80\n10,000\n$7.01 - 8.00\n10,313\n2.74\n$7.76\n10,313\n$8.01 - 12.00\n7,167\n5.87\n$9.88\n5,167\n$12.01 - 15.00\n31,750\n7.80\n$13.16\n19,250\n$15.01 - 17.40\n16,000\n7.42\n$17.40\n16,000\nTotal\n75,230\n6.46\n$12.16\n60,730\nOf the 75,230 stock options outstanding, 29,000 are non-qualified stock options. All options have been registered with the SEC.\nThere were no common stock options issued during the year ended December 31, 2020. The fair value of common stock options issued during the year ended December 31, 2019 were estimated on the date of grant using the Black-Scholes option pricing model with the following assumptions used:\nYear ended\nDecember 31,\nExpected dividend yield\n1.56%\nExpected stock price volatility\n50%\nWeighted-average risk-free interest rate\n2.45%\nWeighted-average expected life of options (in years)\n5.75\nThe following is a summary of restricted stock units issued during the year ended December 31, 2020 and 2019:\nNumber of RSUs Outstanding\nWeighted Average\nFair Value\nAggregate Intrinsic Value\nBalance on December 31, 2018\n36,669\n$8.76\n$257,987\nUnits granted\n46,000\n11.57\n532,220\nUnits vested/issued\n(33,000)\n8.62\n400,700\nUnits forfeited\n(1,667)\n8.85\n14,753\nBalance on December 31, 2019\n48,002\n$11.55\n$554,388\nUnits granted\n18,000\n10.67\n192,060\nUnits vested/issued\n(32,002)\n11.61\n353,948\nUnits forfeited\n(15,000)\n11.35\n156,665\nBalance on December 31, 2020\n19,000\n$10.78\n$332,690\nDuring the year ended December 31, 2020, the Company granted 18,000 restricted stock units with an intrinsic value of $10.67, to certain members of the Board of Directors of the Company. The vesting period for the restricted stock units is the earlier of the 2021 annual meeting of shareholders or one year depending on whether a director stands for re-election at the 2021 annual meeting. During the year ended December 31, 2020, 32,000 restricted stock units with an intrinsic value of $11.61 vested. As of December 31, 2020, there was $91,000 of unrecognized compensation cost related to our unvested restricted stock units, which will be recognized through 2021. All restricted stock units have been registered with the SEC.\nDuring the year ended December 31, 2020 and 2019, we recorded compensation expense of $273,000 and $523,000, respectively, related to stock options and restricted stock units.\nNote 9: Leases\nGenerally, our leasing activity consists of office leases. In March 2019, we signed a new lease to move our corporate headquarters to Raleigh, North Carolina. As we continue our transition from a services-based company to a cloud-based platform company, the new lease affords us the ability to separate our warehouse from our corporate office. The new lease, which had a lease commencement date of October 2, 2019, is for 9,766 square feet and expires December 31, 2027. Minimum lease payments are $2,997,000, not including a tenant improvement allowance of $488,000, which is included in fixed assets as of December 31, 2020. We recognized a ROU asset and corresponding lease liability of $2,596,000, which represents the present value of minimum lease payments discounted at 3.77%, the Company’s incremental borrowing rate at lease inception.\nAdditionally, we have an office in Salt Lake City, Utah, which is on a short-term lease that is less than twelve months. As a result, we have elected the short-term lease recognition exemption for our Utah office lease, which means, for those leases we do not expect to extend beyond twelve months, we will not recognize ROU assets or lease liabilities.\nIn connection with the Company’s acquisition of VWP (See Note 4), the Company assumed two short-term leases in New York City, NY and entered into a three-year office lease in Florida. We have elected the short-term lease exemption for the two New York leases because we do not expect them to extend beyond twelve months. For the Florida lease, which was signed on January 4, 2019, we recognized a ROU asset and corresponding lease liability of $125,000, which represents the present value of minimum lease payments discounted at 4.25%, the Company’s incremental borrowing rate at lease inception. After year-end, the Company vacated one of the leases in New York.\nLease liabilities totaled $2,361,000 as of December 31, 2020. The current portion of this liability of $390,000 is included in Accrued expenses on the Consolidated balance sheets and the long-term portion of $1,971,000 is included in Lease liabilities on the Consolidated Balance Sheets. Rent expense consists of both operating lease expense from amortization of our ROU assets as well as variable lease expense which consists of non-lease components of office leases (i.e. common area maintenance) or rent expense associated with short- term leases. The components of lease expense were as follows (in 000’s):\nYear ended\nDecember 31,\nYear ended\nDecember 31,\nLease expense\nOperating lease expense\n$347\n$241\nVariable lease expense\nRent expense\n$479\n$374\nThe weighted-average remaining non-cancelable lease term for our operating leases was 6.9 years as of December 31, 2020. As of December 31, 2020, the weighted-average discount rate used to determine the lease liability was 3.8%. The future minimum lease payments to be made under non-cancelable operating leases on December 31, 2020, are as follows (in 000’s):\nYear Ended December 31:\n$394\nThereafter\nTotal lease payments\n$2,702\nPresent value adjustment\n(341)\nLease liability\n2,361\nWe have performed an evaluation of our other contracts with customers and suppliers in accordance with Topic 842 and have determined that, except for the leases described above, none of our contracts contain a lease.\nNote 10: Commitments and Contingencies\nFrom time to time, the Company may be involved in litigation that arises through the normal course of business. The Company is neither a party to any litigation nor are we aware of any such threatened or pending litigation that might result in a material adverse effect to our business.\nNote 11: Revenues\nWe consider ourselves to be in a single reportable segment under the authoritative guidance for segment reporting, specifically a shareholder communications and compliance company for publicly traded and private companies. The following tables present revenue disaggregated by revenue stream in (000’s):\nFor the years ended December 31, 2020 and 2019, we generated revenues from the following revenue streams as a percentage of total revenue (in 000’s):\nYear Ended\nDecember 31,\nYear Ended\nDecember 31,\nAmount\nPercentage\nAmount\nPercentage\nRevenue\nPlatform and Technology\n$12,927\n69.8%\n$10,696\n65.6%\nServices\n5,599\n30.2%\n5,599\n34.4%\nTotal\n$18,526\n100.0%\n$16,295\n100.0%\nWe did not have any customers during the years ended December 31, 2020 or 2019 that accounted for more than 10% of our revenue.\nNote 12: Income Taxes\nThe provision for income taxes consisted of the following components for the years ended December 31 (in 000’s):\nCurrent:\nFederal\n$307\n$522\nState\nForeign\nTotal Current\nDeferred:\nFederal\n(434)\nState\n(55)\nForeign\n(21)\n(39)\nTotal Deferred\n(528)\nTotal expense for income taxes\n$724\n$109\nReconciliation between the statutory rate and the effective tax rate is as follows on December 31 (in 000's, except percentages):\nAmount\nPercentage\nAmount\nPercentage\nFederal statutory tax rate\n$594\n21.0%\n$165\n21.0%\nState tax rate\n4.1%\n1.5%\nPermanent difference - stock-based compensation\n1.1%\n(13)\n(1.6)%\nPermanent difference - other\n0.3%\n0.9%\nProvision to return\n0.2%\n(37)\n(4.5)%\nForeign tax credit generated\n(15)\n(0.5)%\n-\n0.0%\nTax on foreign earnings - tax reform\n0.6%\n2.9%\nForeign rate differential\n(2)\n(0.1)%\n(11)\n(1.3)%\nFDII Deduction\n(32)\n(1.1)%\n-\n0.0%\nResearch and development credit\n-\n0.0%\n(39)\n(4.7)%\nTotal\n$724\n25.6%\n$109\n14.2%\nComponents of net deferred income tax assets are as follows on December 31 (in 000's):\nChange\nAssets:\nDeferred revenue\n$24\n$379\n$(355)\nAllowance for doubtful accounts\n-\nStock options\n(48)\nTransaction costs\n(3)\nOther\nTotal deferred tax asset\n(307)\nLiabilities\nPrepaid expenses\n(15)\n(23)\nBasis difference in fixed assets\n(188)\n(14)\n(174)\nCapitalized software\n-\n(94)\nPurchase of intangibles\n(459)\n(522)\nOther\n-\n(4)\nTotal deferred tax liability\n(662)\n(657)\n(5)\nTotal net deferred tax asset / (liability)\n$(197)\n$115\n$(312)\nAs of each reporting date, the Company’s management considers new evidence, both positive and negative, that could impact management’s view with regard to future realization of deferred tax assets. In assessing the recovery of the deferred tax assets, management considers whether it is more likely than not that some portion or all of the deferred tax assets will not be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income in the periods in which those temporary differences become deductible. Management considers the scheduled reversals of future deferred tax assets, projected future taxable income, and tax planning strategies in making this assessment. It has been determined that is more likely than not that the Company's deferred tax assets are able to be realized based on future positive earnings and reversal of existing temporary differences.\nThe Company had no unrecognized tax benefits as of December 31, 2020 or December 31, 2019. Interest and, if applicable, penalties are recognized related to unrecognized tax benefits in income tax expense. There are no accruals for interest and penalties on December 31, 2020.\nUndistributed earnings of the Company are insignificant as of December 31, 2020. With the enactment of the 2017 Act, the Company does not consider any of its foreign earnings as indefinitely reinvested.\nThe Company is subject to income taxation by both federal and state taxing authorities. Income tax returns for the years ended December 31, 2019, 2018 and 2017 are open to audit by federal and state taxing authorities.\nNote 13: Employee Benefit Plans\nThe Company sponsors a defined contribution 401(k) Profit Sharing Plan and allows all employees in the United States to participate. Matching and profit-sharing contributions to the plan are at the discretion of management, but are limited to the amount deductible for federal income tax purposes. The Company made contributions to the plan of $24,000 and $27,000 during the years ended December 31, 2020 and 2019, respectively."
}