{
    "cik": "849399",
    "company": "NortonLifeLock Inc.",
    "filing_type": "10-K",
    "filing_date": "2021-05-21",
    "period_of_report": "2021-04-02",
    "sic": "7372",
    "state_of_inc": "DE",
    "state_location": "AZ",
    "fiscal_year_end": "0402",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/849399/0000849399-21-000010-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/849399/000084939921000010/nlok-20210402.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/849399/0000849399-21-000010.txt",
    "filename": "849399_10K_2021_0000849399-21-000010.htm",
    "item_1": "ITEM 1. Business\nVision & Mission\nOur vision is to protect and empower people to live their digital lives safely.\nOur mission is to build a comprehensive and easy-to-use integrated portfolio that prevents, detects, and responds to cyber threats and cyber crimes in today’s digital world.\nOur Values\nProtecting people is what inspires us, and our people are at the core of what we do. We seek to attract talent that embraces the following values:\n•Advocate: think consumer first - ensure the customer’s voice is heard and consider how our actions benefit our customers’ digital lives.\n•Be Empowered: own it - take initiative to lead and speak up when we see an opportunity to delight our customers or improve the business, regardless of job title.\n•Communicate: be open and authentic - being true to ourselves and our mission; we build cross-functional and inclusive connections to stay aligned and move faster, and we operate with integrity.\n•Execute - smart and scrappy: be a leader, quick to adapt, willing to take risks and put yourself out there; be agile in adapting to meet new challenges and continue a constant learning journey.\n•Win Together: innovate and grow - welcome diverse perspectives and seek and act on feedback; champion the unique value of every individual; diversity fuels innovation.\nCompany Overview\nNortonLifeLock has the largest Consumer Cyber Safety platform in the world, empowering nearly 80 million users in more than 150 countries.\nOur business is built around consumers, we are the trusted and number one top of mind brand in consumer Cyber Safety, according to the 2020 NortonLifeLock brand tracking study.\nToday’s world is increasingly digital, and this digital world has changed the way we live our lives every day. Between the massive shift to working and learning from home, and the ever-growing utility and opportunities to play and transact online, people’s digital lives have become the norm. With each new digital interaction comes increased risk for consumers, as cyber criminals look to take advantage of this accelerating trend. This is why we view ourselves as a trusted ally for our customers in a complex digital world and are committed to advancing our mission of protecting each element of their digital lives.\nWe maintain a global, multi-channel direct acquisition and brand marketing program. This program is designed to grow our customer base by increasing brand awareness and understanding of our products and services, and maximizing our global reach to prospective customers.\nWe help prevent, detect and restore potential damages caused by many cyber criminals. We also make it easy for consumers to find, buy and use our products and services. To this end, we sell subscription-based Cyber Safety solutions primarily direct-to-consumer through our Norton and Avira websites, and indirectly through partner relationships with retailers, telecom service providers, hardware original equipment manufacturers (OEMs), and employee benefit providers. Most of our subscriptions are sold on either annual or monthly terms. As of April 2, 2021, we have nearly 80 million total users, which come from direct, indirect, and freemium channels. Of the total users, we have 23 million direct customers with whom we have a direct billing relationship, and we have 30 million free users.\n•Direct-to-consumer channel: We use advertising and direct response marketing to elevate our brand, attract new customers, and generate significant demand for our services. We have a direct billing relationship with these customers.\n•Indirect partner distribution channels: We use strategic and affiliate partner distribution channels to refer prospective customers to us and expand our reach to our partners’ and affiliates’ customer bases. We developed and implemented a global partner sales organization that targets new, as well as existing, partners to enhance our partner distribution channels. These channels include retailers, telecom service providers, hardware OEMs, and employee benefit providers. Physical retail and OEM partners represent a small portion of our distribution, which minimizes the impacts of supply chain disruptions.\n•Freemium channel: With the acquisition of Avira, we have expanded our go-to-market with a freemium channel. We use free versions of our products to reach the broadest set of customers globally and bring Cyber Safety to a larger audience, especially in international markets. The free solution offers a baseline of protection and presents premium functionalities based on the risk profile and device-type of the user. The user can choose to add specific premium features or upgrade to our Norton 360 integrated platform, at which point, becoming a member of our paid customer base.\nSeasonality\nAs is typical for many consumer technology companies, portions of our business are impacted by seasonality. However, we believe the net impact to our business is limited. Seasonal behavior in orders primarily reflects consumer spending patterns where our fiscal third and fourth quarters are higher due to the holidays in our third quarter, as well as follow-on holiday purchases and the U.S. tax filing season in our fourth quarter. Revenue generally reflects similar seasonal patterns but to a lesser extent than orders because of our subscription business model and because a large portion of our in-period revenues are recognized ratably from our deferred revenue balance.\nOur Strategy\nOur strategy is focused on profitable growth, allowing consumers to experience Cyber Safety. To fuel our growth, our consumer-centric strategy is to provide a comprehensive and easy-to-use integrated platform, which we have built in-house. By combining and leveraging our entire portfolio of Norton, LifeLock, and Avira offerings, we are able to deliver an industry-leading set of Cyber Safety solutions.\nThe key elements of our strategy include the following:\n•Extend our leadership position through continued enhancement of our solutions and services: The Cyber Safety industry is large and expanding, which we believe provides a significant growth opportunity. Our strategy is to grow our business by investing in research and development and pursuing acquisitions, where appropriate, to expand the solutions and services we offer into new cohorts, territories and sectors. We believe there are many additional areas where we can both offer new solutions, as well as use our core capabilities and our integrated platform to reach new customers and markets globally.\n•Grow our customer base through multiple channels: We have multiple go-to-market channels to reach new customers globally, including direct-to-customer, indirect partnerships, and freemium. We intend to leverage our expertise in digital marketing, as well as existing and new strategic partnerships, to grow our customer base. We believe that continued investments in these areas, as well as our product offerings and infrastructure, will allow us to further enhance our leading brands and superior products, increase awareness of our consumer services and enhance our ability to efficiently acquire new customers.\n•Continue our focus on customer retention: We plan to invest in increasing customer retention by optimizing and expanding the value we provide to customers. We aim to continue to increase customer engagements through actionable alerts, education on timely topics, and introducing new product capabilities. We plan to also continue investing in enhancing both desktop and mobile customer experiences throughout a customer’s journey with NortonLifeLock, from purchase, to onboarding and beyond. We aim to build long-term relationships with our customers, and to provide our customers with the peace of mind and confidence they need to protect their digital lives.\n•Increase sales to existing customers: We believe strong customer satisfaction will provide us with the opportunity to engage customers in new services offerings. We maintain the Norton 360 platform, with multiple tiers of membership, and we are actively engaging with customers of standalone products to move them into a Norton 360 membership. We also believe a substantial opportunity exists to increase the penetration of our premium-level consumer solutions. Over time, we plan to drive further growth as we add additional offerings and services for our customers.\n•Draw strength from our world-class customer service support: We have the largest consumer Cyber Safety customer support organization in the world. Our global support team seeks to ensure the voice of the consumer is heard, and that we put our customers first. We leverage frequent communication and feedback from our customers to continually improve our solutions and services.\n•Leverage our global brands to drive growth: We will work to keep building our trusted brands in markets globally as we strive to bring protection and empowerment to all consumers when it comes to their digital lives. According to our most recent research, Norton has 89% global brand awareness. We are also the best positioned brand in device security and #1 top of mind brand in consumer Cyber Safety, according to the 2020 NortonLifeLock Brand Impact study.\nOur Cyber Safety Solutions and Services\nOur vast portfolio of products and services are developed from consumer insights to help us bring to market real solutions to real problems, and to raise the overall awareness of consumer Cyber Safety across all audiences. We continuously target to release new products and features at an accelerated pace, and find synergies to integrate current and future technology acquisitions.\nOur full portfolio provides protection across three Cyber Safety categories in multiple channels and geographies, including security, identity, and privacy. We have built a technology platform that brings together software and service capabilities into a comprehensive and easy-to-use integrated platform - it is called Norton 360. The Norton 360 integrated platform provides extensive Cyber Safety coverage to our members, by delivering Cyber Safety subscription solutions with industry leading features, coupled with an integrated user experience. Through our platform, we aim for simplicity and peace of mind for the consumers. We also complement this Cyber Safety platform by adding adjacent trust-based solutions, which enables people to live their digital lives without compromising their security, identity, or privacy.\nWe protect and empower consumers by providing solutions and services in two main ways:\n•Comprehensive membership plans: Providing a complete Cyber Safety portfolio of solutions for a membership fee. Plans are offered through Norton 360 subscriptions, which include multiple levels of membership tiers that incorporate solutions from each of our key Cyber Safety categories: Security, Identity Protection, and Online Privacy. We also offer solutions that target specific needs of consumers such as Norton Family and Norton 360 for Gamers. Norton Family brings the protection and security of our products to every member of the family across multiple devices and platforms. Norton 360 for Gamers is designed by gamers to help protect gamers, we aim to provide the protection and features gamers need the most, while minimizing interruptions to gaming.\n•Point solutions: Individual, stand-alone products and services in security, identity, and privacy - both free and paid solutions.\nWe are positioned across three key Cyber Safety categories:\n•Security (Norton and Avira offerings): Our Norton 360 and Avira offerings provide real-time protection for PCs, Macs and mobile devices against malware, viruses, adware, ransomware and other online threats. They monitor and block unauthorized traffic from the internet to the device to help protect private and sensitive information when customers are online. For mobile devices, Norton 360 for Mobile alerts customers of risky apps, safeguards against fraudulent and malicious websites, identifies Wi-Fi networks that are under attack, enables stolen device recovery, and blocks unwanted spam and potential fraud calls. Norton 360 includes 24x7 support by trained support agents. We provide on-call support and offer a money-back guarantee if we cannot remove viruses from infected devices through our Virus Protection Promise.\n•Identity Protection (LifeLock Identity Theft Protection): Our LifeLock identity theft protection solution includes monitoring, alerts and restoration services to protect the safety of our customers. We monitor events that may present a risk of identity theft, such as new account openings and applications. If we detect that a customer’s personally identifiable information is being used, we deliver notifications and alerts to our customers about potentially suspicious activity. In the event of identity theft, we assign an Identity Restoration Specialist to work directly with customers to help restore their identities. Customers are further protected by our Million Dollar Protection Package, which provides reimbursement for stolen funds and coverage for personal expenses. Our Dark Web Monitoring product looks for personal information of our Norton 360 members on the Dark Web. We currently offer this product in many countries internationally and continue to add new countries each year.\n•Online Privacy (VPN, Privacy Monitor Assistant, Home Title Protect): As people are exchanging more sensitive information through digital channels, such as personal healthcare information to enable tele-health or financial information for personal accounting, having a VPN has become even more crucial. Our VPN solution enhances security and online privacy by providing an encrypted data tunnel. This allows customers to securely transmit and access private information such as passwords, bank details and credit card numbers when using public Wi-Fi on PCs, Macs and mobile iOS and Android devices. Our VPN service allows customers to browse the Web anonymously to protect their\nonline privacy and prevent tracking by online advertisers and other companies. Customers can also change their virtual location when they are traveling internationally to allow them to connect to their favorite apps, websites and online streaming services as if they are in their home country. Our Privacy Monitor Assistant is an on-demand, white glove service where our agents help our members delete personal information from Data brokers online. Our Home Title Protect product detects fraud and notifies members if we find changes made to their Home Title. If a member becomes a victim of identity theft, we provide a dedicated Identity Restoration Specialist to work with the customer until their case is closed.\nInnovation and Research & Development\nNortonLifeLock has a long history of innovation, and we plan to continue to invest in research and development to drive our long-term success.\nAs cyber threats evolve, we are focused on delivering a portfolio that protects each element of our customers’ digital lives. To do this, we engage and listen to our customers, and we embrace innovation by deploying a global research and development strategy across our Cyber Safety platform. Our engineering and product management teams are focused on delivering new versions of existing offerings, as well as developing entirely new offerings to drive the company’s global leadership in Cyber Safety.\nWe are committed to our innovation and research & development efforts. Norton Labs, a global team of experts, is leading the company’s future technology and helping guide the consumer cybersecurity industry. Within Norton Labs, our global technology research organization is focused on applied research projects, with the goal of rapidly creating new products to address consumer trends and grow the business, including defending consumer digital privacy and identity. We also have a global threat response and security technology organization that is made up of leading threat and security researchers, supported by advanced systems to innovate security technology and threat intelligence.\nIndustry Overview & Market Opportunity\nCyber Safety is a growing market, fueled by the increase in activities online over the years, as well as the years ahead. The core markets that we participate in are security, identity, and privacy. We believe the Cyber Safety market will continue to expand beyond these core markets and grow significantly - driven by the growing number of people connected to the Internet who have a digital life.\nThe cyber threat landscape is larger and more complicated than ever before, exposing consumers to an increased risk to their digital lives. The digitization of the world and the overlap between the physical and digital world is growing at a fast pace. New technologies, smart devices, digital identities, and an increasingly more connected world means consumers will encounter a range of new Cyber Safety challenges. Consumer demands and behaviors are rapidly changing and driving more activities online, from shopping, socializing, working, banking, to other activities in healthcare, entertainment, and so much more. Almost every aspect of a person’s life has a digital component. Unfortunately, many of those activities are left unprotected, and attackers are exploiting this larger opportunity and the inherent security and privacy vulnerabilities. Cyber criminals have not only expanded their reach, but the sophistication of digital threats and attacks are becoming increasingly more consumer-related.\nCyber crime, and the ways in which cyber criminals target consumers, continue to evolve along with behaviors and technology. Cyber crime encompasses any crime committed digitally over the internet and includes crimes where (i) malicious software or unauthorized access is detected on a device, network or online account (such as email, social media, online banking, online retail, gaming, online entertainment, etc.), and unauthorized access or connection to cloud service accounts; (ii) an individual is digitally victimized through a data breach, cyber theft, cyber extortion, or fraud (stolen personally identifiable information, identity theft, etc.); (iii) online stalking, bullying, or harassment is inflicted; or (iv) attacks related to privacy or disinformation (such as online tracking protection, identity impersonation, disinformation on social media, DeepFakes, non-trustworthy WiFis, EvilTwin attacks, etc.).\nAs cyber crime becomes an intensifying threat to our world, consumers are increasingly concerned. Our annual Norton Cyber Safety Insights Report examines the impact of cyber crime and consumers’ online behaviors and concerns related to their online security, privacy and identity. According to the 2021 report, which is based on research conducted online by The Harris Poll on behalf of us, nearly 330 million people across 10 countries were victims of cyber crime and more than 55 million people were victims of identity theft. Cyber crime victims collectively spent nearly 2.7 billion hours trying to resolve their issues. For more insights or information related to our Norton Cyber Safety Insights Report, please visit https://us.norton.com/nortonlifelock-cyber-safety-report.\nCompetitive Landscape\nWe operate in a highly competitive and rapidly evolving business environment. We believe that the competitive factors in our market include access to a breadth of identity and consumer transaction data, broad and effective service offerings, brand recognition, technology, effective and cost-efficient customer acquisition, having a large customer base and strong retention rate, customer satisfaction, price, convenience of purchase, ease of use, frequency of upgrades and updates, and quality and reliable customer service. Our competitors vary by offering, geography, and channel.\nOur principal competitors are set forth below:\n•Security: Our principal competitors in this market are Avast, Kaspersky, McAfee, Microsoft, Bitdefender, and Trend Micro.\n•Identity Protection: Our principal competitors in this market are credit bureaus Equifax, Experian, and TransUnion, as well as certain credit monitoring and identity theft protection solutions from others such as Allstate, and Credit Karma.\n•Online Privacy: Our principal competitors in this market are Avast, Kape, ExpressVPN, NordVPN, and Pango.\n•Other Competitors: In addition to competition from large consumer security companies such as Avast and McAfee, we also face competition from smaller companies that may develop competing products, emerging competition from ISPs, operating systems, insurance companies, and financial service organization.\nWe believe we compete favorably with our competitors on the strength of our technology, people, product offerings, and integration across all of the key Cyber Safety categories. However, some of our competitors have substantially greater financial, technical, marketing, distribution, and other resources than we possess that afford them competitive advantages. As a result, they may be able to devote greater resources to develop, promote and sell their offerings; deliver competitive offerings at lower prices or for free; and introduce new solutions and respond to market developments and customer requirements more quickly than we can.\nFor more information on the risks associated with our competitors, please see “Risk Factors” in",
    "item_1A": "Item 1A. Risk Factors\nCOVID-19 RISKS\nThe COVID-19 pandemic has affected how we are operating our business, and the duration and extent to which this will impact our future results of operations and overall financial performance remains uncertain.\nThe COVID-19 pandemic is having widespread, rapidly evolving, and unpredictable impacts on global society, economies, financial markets, and business practices. To protect the health and well-being of our employees, partners and third-party service providers, we have implemented a near company-wide work-from-home requirement for most employees until further notice, made substantial modifications to employee travel policies, and cancelled or shifted our conferences and other marketing events to virtual-only for the foreseeable future. We continue to monitor the situation and will adjust our current policies as recommendations and public health guidance changes. To date, we have not seen any meaningful negative impact on our customer success efforts, sales and marketing efforts, or employee productivity. Nevertheless, as employees, partners or third-party services providers return to work during the COVID-19 pandemic, the risk of inadvertent transmission of COVID-19 through human contact could still occur and result in litigation.\nThe U.S. and global economies have experienced a recession due to the economic impacts of the COVID-19 pandemic. Although we did not experience a material increase in cancellations by customers or a material reduction in our retention rate in 2021, we may experience such an increase or reduction in the future, especially in the event of a prolonged recession as a result of the COVID-19 pandemic. A prolonged recession could adversely affect demand for our offerings, retention rates and harm our business and results of operations, particularly in light of the fact that our solutions are discretionary purchases and thus may be more susceptible to macroeconomic pressures, as well impact the value of our common stock, ability to refinance our debt, and our access to capital.\nThe duration and extent of the impact from the COVID-19 pandemic depends on future developments that cannot be accurately forecasted at this time, such as the severity and transmission rate of new variants of the disease, the extent, effectiveness and acceptance of containment actions, such as vaccination programs, and the impact of these and other factors on our employees, customers, partners and third-party service providers. If we are not able to respond to and manage the impact of such events effectively and if the macroeconomic conditions of the general economy or the industries in which we operate do not improve, or deteriorate further, our business, operating results, financial condition and cash flows could be adversely affected.\nRISKS RELATED TO OUR BUSINESS STRATEGY AND INDUSTRY\nIf we are unable to develop new and enhanced solutions, or if we are unable to continually improve the performance, features, and reliability of our existing solutions, our business and operating results could be adversely affected.\nOur future success depends on our ability to effectively respond to evolving threats to consumers, as well as competitive technological developments and industry changes, by developing or introducing new and enhanced solutions on a timely basis. We have in the past incurred, and will continue to incur, significant research and development expenses as we focus on organic growth through internal innovation. We believe that we also must continue to dedicate a significant amount of resources to our research and development efforts to decrease our reliance on third parties. If we do not achieve the benefits anticipated from these investments, or if the achievement of these benefits is delayed, our operating results may be adversely affected. Additionally, we must continually address the challenges of dynamic and accelerating market trends and competitive developments. Customers may require features and capabilities that our current solutions do not have. Our failure to develop\nnew solutions and improve our existing solutions to satisfy customer preferences and effectively compete with other market offerings in a timely and cost-effective manner may harm our ability to retain our customers and attract new customers. A loss of customers would adversely impact our business and operating results.\nThe development and introduction of new solutions involve a significant commitment of time and resources and are subject to a number of risks and challenges including but not limited to:\n•Lengthy development cycles;\n•Evolving industry and regulatory standards and technological developments by our competitors and customers;\n•Rapidly changing customer preferences;\n•Evolving platforms, operating systems, and hardware products, such as mobile devices;\n•Product and service interoperability challenges with customer’s technology and third-party vendors;\n•Entering into new or unproven markets; and\n•Executing new product and service strategies.\nIn addition, third parties, including operating systems and internet browser companies, may take steps to limit the interoperability of our solutions with their own products and services, in some cases to promote their own offerings. This could delay the development of our solutions or our solutions may be unable to operate effectively. This could also result in decreased demand for our solutions, decreased revenue, and harm to our reputation, and adversely affect our business, financial condition, results of operations, and cash flows.\nIf we are not successful in managing these risks and challenges, or if our new or improved solutions are not technologically competitive or do not achieve market acceptance, our business and operating results could be adversely affected.\nWe operate in a highly competitive environment, and our competitors may gain market share in the markets for our solutions.\nWe operate in intensely competitive markets that experience frequent technological developments, changes in industry and regulatory standards, changes in customer requirements and preferences, and frequent new product introductions and improvements. If we are unable to anticipate or react to these continually evolving conditions, we could lose market share and experience a decline in our revenues. To compete successfully, we must maintain an innovative research and development effort to develop new solutions and enhance our existing solutions, effectively adapt to changes in the technology or product rights held by our competitors as well as the ways our information is accessed, used and stored by our customers, and appropriately respond to competitive strategies.\nOur competitors include software vendors and operating system providers that offer solutions that directly compete with our offerings. We face growing competition from other technology companies, as well as from companies in the identity threat protection space such as credit bureaus. Many of our competitors are increasingly developing and incorporating into their products data protection software and other competing products, often free of charge, that compete at some level with our offerings. Our competitive position could be adversely affected to the extent that our customers perceive the functionality incorporated into these products as replacing the need for our solutions. We face additional risks that these products could limit the operability of our solutions for our customers. Some of our competitors have greater financial, technical, marketing, or other resources than we do and consequently, may have the ability to influence customers to purchase their products instead of ours, including through investing more in internal innovation than we can. Further consolidation within our industry or other changes in the competitive environment, such as greater vertical integration from key computing and operating system suppliers could result in larger competitors that compete more directly with us. We also face competition from many smaller companies that specialize in particular segments of the market in which we compete.\nIn addition to competing with these vendors directly for sales to end-users of our solutions, we compete with them for the opportunity to have our solutions bundled with the offerings of our strategic partners, such as computer hardware original equipment manufacturers (OEMs) and internet service providers (ISPs) and operating systems. Our competitors could gain market share from us if any of these strategic partners replace our solutions with those of our competitors or if these partners more actively promote our competitors’ solutions than our own. In addition, software vendors who have bundled our solutions with theirs may choose to bundle their solutions with their own or other vendors’ solutions or may limit our access to standard interfaces and inhibit our ability to develop solutions for their platform. In the future, further product development by these vendors could cause our solutions to become redundant, which could significantly impact our sales and operating results.\nWe may need to change our pricing models to compete successfully.\nThe intense competition we face, in addition to general and economic business conditions, can put pressure on us to change our prices. If our competitors offer deep discounts on certain solutions or provide offerings, or offer free introductory products (freemium products) that compete with ours, we may need to lower prices or offer similar freemium products in order to compete successfully. Similarly, if external factors require us to raise our prices, our ability to acquire new customers and retain existing customers may be diminished. Any such changes may reduce revenue and margins and could adversely affect our financial results.\nAdditionally, our business may be affected by changes in the macroeconomic environment. Our solutions are discretionary purchases, and customers may reduce or eliminate their discretionary spending on our solutions during a difficult\nmacroeconomic environment. Although we did not experience a material increase in cancellations by customers or a material reduction in our retention rate in fiscal 2021, we may experience such an increase or reduction in the future, especially in the event of a prolonged recession or a worsening of current conditions as a result of the COVID-19 pandemic. In addition, during a recession, consumers may experience a decline in their credit or disposable income, which may result in less demand for our solutions. As a result, we may have to lower our prices or make other changes to our pricing model to address these dynamics, any of which could adversely affect our business and financial results.\nIn addition, in January 2021, we acquired Germany-based Avira. Many of Avira’s users are freemium subscribers, meaning they do not pay for its basic services. Much of our anticipated growth in connection with the Avira acquisition is attributable to converting Avira’s freemium users to a paid subscription option. Numerous factors, however, may impede our ability to retain and convert these users into paying customers.\nIf we fail to manage our sales and distribution channels effectively, or if our partners choose not to market and sell our solutions to their customers, our operating results could be adversely affected.\nA portion of our revenues is derived from sales through indirect channels, including, but not limited to, distributors that sell our products to end-users and other resellers, and OEM partners that incorporate our products into, or bundle our products with, their products. These channels involve a number of risks, including:\n•Our resellers, distributors and OEMs are generally not subject to minimum sales requirements or any obligation to market our solutions to their customers;\n•Our reseller and distributor agreements are generally nonexclusive and may be terminated at any time without cause and our OEM partners may terminate or renegotiate their arrangements with us and new terms may be less favorable due to competitive conditions in our markets and other factors;\n•Our resellers, distributors and OEMs may encounter issues or have violations of applicable law or regulatory requirements or otherwise cause damage to our reputation through their actions;\n•Our resellers and distributors frequently market and distribute competing solutions and may, from time to time, place greater emphasis on the sale of these competing solutions due to pricing, promotions, and other terms offered by our competitors;\n•Any consolidation of electronics retailers can increase their negotiating power with respect to software providers such as us and any decline in the number of physical retailers could decrease the channels of distribution for us;\n•The continued consolidation of online sales through a small number of larger channels has been increasing, which could reduce the channels available for online distribution of our solutions; and\n•Sales through our partners are subject to changes in general economic conditions, strategic direction, competitive risks, and other issues that could result in a reduction of sales, or cause our partners to suffer financial difficulty which could delay payments to us, affecting our operating results.\nIf we fail to manage our sales and distribution channels successfully, these channels may conflict with one another or otherwise fail to perform as we anticipate, which could reduce our sales and increase our expenses as well as weaken our competitive position.\nOur revenue and operating results depend significantly on our ability to retain our existing customers, convert existing non-paying customers to paying customers, and add new customers.\nWe generally sell our solutions to our customers on a monthly or annual subscription basis. Customers may choose not to renew their membership with us at any time. Renewing customers may require additional incentives to renew, may not renew for the same contract period, or may change their subscriptions. We therefore may be unable to retain our existing customers on the same or on more profitable terms, if at all. In addition, we may not be able to accurately predict or anticipate future trends in customer retention or effectively respond to such trends.\nOur customer retention rates may decline or fluctuate due to a variety of factors, including the following:\n•Our customers’ levels of satisfaction or dissatisfaction with our solutions and the value they place on our solutions;\n•The quality, breadth, and prices of our solutions;\n•Our general reputation and events impacting that reputation;\n•The services and related pricing offered by our competitors;\n•Disruption by new services or changes in law or regulations that impact the need for efficacy or of our products and services;\n•Changes in autorenewal regulations;\n•Our customer service and responsiveness to the needs of our customers; and\n•Changes in our target customers’ spending levels as a result of general economic conditions or other factors.\nDeclining customer retention rates could cause our revenue to may grow more slowly than expected or decline; and our operating results, gross margins and business will be harmed.\nOur acquisitions and divestitures create special risks and challenges that could adversely affect our financial results.\nAs part of our business strategy, we may acquire or divest businesses or assets. For example, in 2019, we completed the sale of certain of our enterprise security assets to Broadcom Inc. (the “Broadcom sale”) and in January 2021, we completed the acquisition of Avira. These activities can involve a number of risks and challenges, including:\n•Complexity, time, and costs associated with managing these transactions, including the integration of acquired and the winding down of divested business operations, workforce, products, IT systems, and technologies;\n•Challenges in retaining customers of acquired businesses, or providing the same level of service to existing customers with reduced resources;\n•Diversion of management time and attention;\n•Loss or termination of employees, including costs associated with the termination or replacement of those employees;\n•Assumption of liabilities of the acquired and divested business or assets, including pending or future litigation, investigations or claims related to the acquired business or assets;\n•The addition of acquisition-related debt;\n•Difficulty in entering into or expanding in new markets or geographies;\n•Increased or unexpected costs and working capital requirements;\n•Dilution of stock ownership of existing stockholders;\n•Unanticipated delays or failure to meet contractual obligations;\n•Substantial accounting charges for acquisition-related costs, asset impairments, amortization of intangible assets, and higher levels of stock-based compensation expense; and\n•Difficulty in realizing potential benefits, including cost savings and operational efficiencies, synergies and growth prospects from integrating acquired businesses.\nMoreover, to be successful, large complex acquisitions depend on large-scale product, technology, and sales force integrations that are difficult to complete on a timely basis or at all and may be more susceptible to the special risks and challenges described above. Any of the foregoing, and other factors, could harm our ability to achieve anticipated levels of profitability or other financial benefits from our acquired or divested businesses, product lines or assets or to realize other anticipated benefits of divestitures or acquisitions.\nChanges in industry structure and market conditions could lead to charges related to discontinuance of certain of our products or businesses and asset impairments.\nIn response to changes in industry structure and market conditions, we may be required to strategically reallocate our resources and consider restructuring, disposing of, or otherwise exiting certain businesses. Any decision to limit investment in or dispose of or otherwise exit businesses may result in the recording of special charges, such as technology-related write-offs, workforce reduction costs, charges relating to consolidation of excess facilities, or claims from third parties who were resellers or users of discontinued products. Our estimates with respect to the useful life or ultimate recoverability of our carrying basis of assets, including purchased intangible assets, could change as a result of such assessments and decisions. Although in certain instances our vendor agreements allow us the option to cancel, reschedule, and adjust our requirements based on our business needs, our loss contingencies may include liabilities for contracts that we cannot cancel, reschedule or adjust with suppliers.\nFurther, our estimates relating to the liabilities for excess facilities are affected by changes in real estate market conditions. Additionally, we are required to evaluate goodwill impairment on an annual basis and between annual evaluations in certain circumstances, and future goodwill impairment evaluations may result in a charge to earnings.\nRISKS RELATED TO OUR OPERATIONS\nWe are dependent upon Broadcom for certain engineering and threat response services, which are critical to our products and business.\nOur endpoint security solution has historically relied upon certain threat analytics software engines and other software (the Engine-Related Services) that have been developed and provided by engineering teams that have transferred to Broadcom as part of the Broadcom sale. The technology, including source code, at issue is shared, and pursuant to the terms of the Broadcom sale, we retain rights to use, modify, enhance and create derivative works from such technology. Broadcom has committed to provide these Engine-Related Services substantially to the same extent and in substantially the same manner, as has been historically provided under a license agreement with a limited term.\nAs a result, we are dependent on Broadcom for services and technology that are critical to our Norton business, and if Broadcom fails to deliver these Engine-Related Services it would result in significant business disruption, and our business and operating results and financial condition could be materially and adversely affected. Furthermore, if our current sources become unavailable, and if we are unable to develop or obtain alternatives to integrate or deploy them in time, our ability to compete effectively could be impacted and have a material adverse effect on our business. Additionally, in connection with the Broadcom sale, we lost other capabilities, including certain threat intelligence data which were historically provided by our former Enterprise Security business, the lack of which could have a negative impact on our business and products.\nOur future success depends on our ability to attract and retain personnel in a competitive marketplace.\nOur future success depends upon our ability to recruit and retain key management, technical (including cyber security experts), sales, marketing, e-commerce, finance, and other personnel. Our officers and other key personnel are “at will” employees and we generally do not have employment or non-compete agreements with our employees. Competition for people with the specific skills that we require is significant. While we continue to monitor the competitive environment, it is possible that the COVID-19 pandemic may affect the productivity of our employees and our ability to attract and retain key talent. As a result of the pandemic, in March 2020, we transitioned to a remote working environment for the substantial majority of our employees. While our employees have transitioned effectively to working from home, over time such remote operations may decrease the cohesiveness of our employees and our ability to maintain our culture, both of which are integral to our success. Additionally, a remote working environment may impede our ability to undertake new business projects, to foster a creative environment, to hire new employees and to retain existing employees.\nIn order to attract and retain personnel in a competitive marketplace, we must provide competitive pay packages, including cash and equity-based compensation. Additionally, changes in immigration laws could impair our ability to attract and retain highly qualified employees. If we fail to attract, retain and motivate new or existing personnel, our business, results of operations and future growth prospects could suffer. The volatility in our stock price may from time to time adversely affect our ability to recruit or retain employees. In addition, we may not have an adequate number of shares reserved under our equity compensation plans, forcing us to reduce awards of equity-based compensation, which could impair our efforts to attract, retain and motivate necessary personnel. If we are unable to hire and retain qualified employees, or conversely, if we fail to manage employee performance or reduce staffing levels when required by market conditions, our business and operating results could be adversely affected.\nEffective succession planning is also important to our long-term success. Failure to ensure effective transfer of knowledge and smooth transitions involving key employees could hinder our strategic planning and execution. From time to time, key personnel leave our company and the frequency and number of such departures have widely varied and have, in the past, resulted in significant changes to our executive leadership team. The loss of any key employee could result in significant disruptions to our operations, including adversely affecting the timeliness of product releases, the successful implementation and completion of company initiatives, our internal control over financial reporting, and our results of operations. In addition, hiring, training, and successfully integrating replacement personnel can be time consuming and expensive, may cause additional disruptions to our operations, and may be unsuccessful, which could negatively impact future financial results.\nOur inability to successfully recover from a disaster or other business continuity event could impair our ability to deliver our products and services and harm our business.\nWe are heavily reliant on our technology and infrastructure to provide our products and services to our customers. For example, we host many of our products using third-party data center facilities, and while we require them to maintain formal service level agreements around availability, we do not control the operation of these facilities. These facilities are vulnerable to damage, interruption, or performance problems from earthquakes, hurricanes, floods, fires, power loss, telecommunications failures, pandemics and similar events. They are also subject to break-ins, computer viruses, sabotage, intentional acts of vandalism, and other misconduct. The occurrence of a natural disaster, an act of terrorism, a pandemic, and similar events could result in a decision to close the facilities without adequate notice or other unanticipated problems, which in turn, could result in lengthy interruptions in the delivery of our products and services, which could negatively impact our sales and operating results.\nFurthermore, our business administration, human resources, compliance efforts, and finance services depend on the proper functioning of our computer, telecommunication, and other related systems and operations. A disruption or failure of these systems or operations because of a disaster, cyber-attack or other business continuity event, such as the COVID-19 pandemic, could cause data to be lost or otherwise delay our ability to complete sales and provide the highest level of service to our customers. In addition, we could have difficulty producing accurate financial statements on a timely basis, and deficiencies may arise in our internal control over financial reporting, which may impact our ability to certify our financial results, all of which could adversely affect the trading value of our stock. Although we endeavor to ensure there is redundancy in these systems and that they are regularly backed-up, there are no assurances that data recovery in the event of a disaster would be effective or occur in an efficient manner. If these systems or their functionality do not operate as we expect them to, we may be required to expend significant resources to make corrections or find alternative sources for performing these functions.\nIf we fail to offer high-quality customer support, our customer satisfaction may suffer and have a negative impact our business and reputation.\nMany of our customers rely on our customer support services to resolve issues, including technical support, billing and subscription issues, that may arise. If demand increases, or our resources decrease, we may be unable to offer the level of support our customers expect. Any failure by us to maintain the expected level of support could reduce customer satisfaction and negatively impact our customer retention and our business.\nOur international operations involve risks that could increase our expenses, adversely affect our operating results, and require increased time and attention of our management.\nWe derive a portion of our revenues from customers located outside of the U.S., and we have significant operations outside of the U.S., including engineering, finance, sales and customer support. Our international operations are subject to risks in addition to those faced by our domestic operations, including:\n•Potential loss of proprietary information due to misappropriation or laws that may be less protective of our intellectual property rights than U.S. laws or that may not be adequately enforced;\n•Requirements of foreign laws and other governmental controls, including tariffs, trade barriers and labor restrictions, and related laws that reduce the flexibility of our business operations;\n•Potential changes in trade relations arising from policy initiatives or other political factors;\n•Regulations or restrictions on the use, import, or export of encryption technologies that could delay or prevent the acceptance and use of encryption products and public networks for secure communications;\n•Local business and cultural factors that differ from our normal standards and practices, including business practices that we are prohibited from engaging in by the Foreign Corrupt Practices Act and other anti-corruption laws and regulations;\n•Central bank and other restrictions on our ability to repatriate cash from our international subsidiaries or to exchange cash in international subsidiaries into cash available for use in the U.S.;\n•Fluctuations in currency exchange rates, economic instability, and inflationary conditions could make our solutions more expensive or could increase our costs of doing business in certain countries;\n•Limitations on future growth or inability to maintain current levels of revenues from international sales if we do not invest sufficiently in our international operations;\n•Difficulties in staffing, managing, and operating our international operations;\n•Difficulties in coordinating the activities of our geographically dispersed and culturally diverse operations;\n•Costs and delays associated with developing software and providing support in multiple languages; and\n•Political unrest, war, or terrorism, or regional natural disasters, particularly in areas in which we have facilities.\nRISKS RELATED TO OUR SOLUTIONS\nOur solutions, systems, websites and the data on these sources may be subject to intentional disruption that could materially harm to our reputation and future sales.\nDespite our precautions and significant ongoing investments to protect against security risks, data protection breaches, cyber-attacks, and other intentional disruptions of our solutions, we expect to be an ongoing target of attacks specifically designed to impede the performance and availability of our offerings and harm our reputation as a leading cyber security company. Similarly, experienced computer programmers or other sophisticated individuals or entities, including malicious hackers, state-sponsored organizations, and insider threats including actions by employees and third-party service providers, may attempt to penetrate our network security or the security of our systems and websites and misappropriate proprietary information or cause interruptions of our products and services. Such attempts are increasing in number and in technical sophistication, and if successful could expose us and the affected parties, to risk of loss or misuse of proprietary or confidential information or disruptions of our business operations.\nWhile we engage in a number of measures aimed to protect against security breaches and to minimize the impact if a data breach were to occur, our information technology systems and infrastructure may be vulnerable to damage, compromise, disruption, and shutdown due to attacks or breaches by hackers or other circumstances, such as error or malfeasance by employees or third party service providers or technology malfunction. The occurrence of any of these events, as well as a failure to promptly remedy these events should they occur, could compromise our systems, and the information stored in our systems could be accessed, publicly disclosed, lost, stolen, or damaged. Any such circumstance could adversely affect our ability to attract and maintain customers as well as strategic partners, cause us to suffer negative publicity or damage to our brand, and subject us to legal claims and liabilities or regulatory penalties. In addition, unauthorized parties might alter information in our databases, which would adversely affect both the reliability of that information and our ability to market and perform our services as well as undermine our ability to remain compliant with relevant laws and regulations. Techniques used to obtain unauthorized access or to sabotage systems change frequently, are constantly evolving and generally are difficult to recognize and react to effectively. We may be unable to anticipate these techniques or to implement adequate preventive or reactive measures. Several recent, highly publicized data security breaches, including a large-scale attack on SolarWinds customers by a foreign nation state actor and a significant uptick in ransomware/extortion attacks at other companies have heightened consumer awareness of this issue and may embolden individuals or groups to target our systems or those of our strategic partners or enterprise customers.\nOur solutions are complex and operate in a wide variety of environments, systems and configurations, which could result in failures of our solutions to function as designed.\nBecause we offer very complex solutions, errors, defects, disruptions, or other performance problems with our solutions may and have occurred. For example, we may experience disruptions, outages, and other performance problems due to a variety of factors, including infrastructure changes, human or software errors, capacity constraints due to an overwhelming number of users accessing our websites simultaneously, fraud, or security attacks. In some instances, we may not be able to identify the cause or causes of these performance problems within an acceptable period of time. Interruptions in our solutions could impact our revenues or cause customers to cease doing business with us. Our operations are dependent upon our ability to protect our technology infrastructure against damage from business continuity events that could have a significant disruptive effect on our operations. We could potentially lose customer data or experience material adverse interruptions to our operations or delivery of solutions to our clients in a disaster recovery scenario.\nNegative publicity regarding our brand, solutions and business could harm our competitive position.\nOur brand recognition and reputation as a trusted service provider are critical aspects of our business and key to retaining existing customers and attracting new customers. Our business could be harmed due to errors, defects, disruptions or other performance problems with our solutions causing our customers and potential customers to believe our solutions are unreliable. Furthermore, negative publicity, whether or not justified, including intentional brand misappropriation, relating to events or activities attributed to us, our employees, our strategic partners, our affiliates, or others associated with any of these parties, may tarnish our reputation and reduce the value of our brands. In addition, the rapid rise and use of social media has the potential to harm our brand and reputation. We may be unable to timely respond to and resolve negative and inaccurate social media posts regarding our company, solutions and business in an appropriate manner. Damage to our reputation and loss of brand equity may reduce demand for our solutions and have an adverse effect on our business, operating results, and financial condition. Moreover, any attempts to rebuild our reputation and restore the value of our brands may be costly and time consuming, and such efforts may not ultimately be successful.\nWe collect, use, disclose, store, or otherwise process personal information, which subjects us to privacy and data security laws and contractual commitments.\nWe collect, use, process, store, transmit or disclose (collectively, process) an increasingly large amount of confidential information, including personally identifiable information, credit card information and other critical data from employees and customers, in connection with the operation of our business, particularly in relation to our identity and information protection offerings.\nThe personal information we process is subject to an increasing number of federal, state, local, and foreign laws regarding privacy and data security, as well as contractual commitments. Any failure or perceived failure by us to comply with such obligations may result in governmental enforcement actions, fines, litigation, or public statements against us by consumer advocacy groups or others and could cause our customers to lose trust in us, which could have an adverse effect on our reputation and business.\nAdditionally, changes to applicable privacy or data security laws could impact how we process personal information and therefore limit the effectiveness of our solutions or our ability to develop new solutions. For example, the European Union General Data Protection Regulation imposes more stringent data protection requirements and provides for greater penalties for noncompliance of up to the greater of €20 million or four percent of our worldwide annual revenues.\nData protection legislation is also becoming increasingly common in the U.S. at both the federal and state level. For example, the California Consumer Privacy Act of 2018 (the CCPA) requires, among other things, covered companies to provide new disclosures to California consumers regarding the use of personal information, gives California residents expanded rights to access their personal information that has been collected and allows such consumers new abilities to opt-out of certain sales of personal information. Further, the new California Privacy Rights Act (the CPRA) significantly modifies the CCPA. These modifications may result in additional uncertainty and require us to incur additional costs and expenses in our effort to comply. Additionally, the Federal Trade Commission and many state attorneys general are interpreting federal and state consumer protection laws to impose standards for the online collection, use, dissemination, and security of data. The burdens imposed by the CCPA, CPRA and other similar laws that may be enacted at the federal and state level may require us to modify our data processing practices and policies, adapt our goods and services and incur substantial expenditures in order to comply.\nGlobal privacy and data protection legislation, enforcement, and policy activity are rapidly expanding and evolving, and may be inconsistent from jurisdiction to jurisdiction. We may be or become subject to data localization laws mandating that data collected in a foreign country be processed and stored only within that country. If any country in which we have customers were to adopt a data localization law, we could be required to expand our data storage facilities there or build new ones in order to comply. The expenditure this would require, as well as costs of compliance generally, could harm our financial condition.\nAdditionally, third parties with whom we work, such as vendors or developers, may violate applicable laws or our policies and such violations can place personal information of our customers at risk. In addition, our customers may also accidentally disclose their passwords or store them on a device that is lost or stolen, creating the perception that our systems are not secure against third-party access. This could have an adverse effect on our reputation and business. In addition, such third parties could expose us to compromised data or technology, or be the target of cyberattack and other data breaches which could impact our systems or our customers’ records. Further, we could be the target of a cyberattack or other action that impacts our systems and results in a data breach of our customers’ records. This could have an adverse effect on our reputation and business.\nLEGAL AND COMPLIANCE RISKS\nMatters relating to or arising from our completed Audit Committee Investigation, including regulatory investigations and proceedings, litigation matters, and potential additional expenses, may adversely affect our business and results of operations.\nAs previously disclosed in our public filings, the Audit Committee completed its internal investigation in September 2018. In connection with the Audit Committee Investigation, we voluntarily self-reported to the SEC. The SEC commenced a formal investigation, and we continue to cooperate with that investigation. The outcome of such an investigation is difficult to predict. If the SEC commences legal action, we could be required to pay significant penalties and become subject to injunctions, a cease and desist order, and other equitable remedies. We can provide no assurances as to the outcome of any governmental investigation.\nWe have incurred, and may continue to incur, significant expenses related to legal and other professional services in connection with the ongoing SEC investigation, which may continue to adversely affect our business and financial condition. In\naddition, securities class actions and other lawsuits have been filed against us, certain current and former directors, and former officers. The outcome of the securities class actions and other litigation and regulatory proceedings or government enforcement actions is difficult to predict, and the cost to defend, settle, or otherwise resolve these matters may be significant. Plaintiffs or regulatory agencies or authorities in these matters may seek recovery of very large or indeterminate amounts or seek to impose sanctions, including significant monetary penalties. The monetary and other impact of these litigations, proceedings, or actions may remain unknown for substantial periods of time. Further, an unfavorable resolution of litigations, proceedings or actions could have a material adverse effect on our business, financial condition, and results of operations and cash flows. Any future investigations or additional lawsuits may also adversely affect our business, financial condition, results of operations, and cash flows.\nOur solutions are highly regulated, which could impede our ability to market and provide our solutions or adversely affect our business, financial position, and results of operations.\nOur solutions are subject to a high degree of regulation, including a wide variety of federal, state, and local laws and regulations, such as the Fair Credit Reporting Act, the Gramm-Leach-Bliley Act, the Federal Trade Commission Act (FTC Act), and comparable state laws that are patterned after the FTC Act. LifeLock has previously entered into consent decrees and similar arrangements with the FTC and the attorney generals of 35 states as well as a settlement with the FTC relating to allegations that certain of LifeLock’s advertising, marketing and security practices constituted deceptive acts or practices in violation of the FTC Act, which impose additional restrictions on our business, including prohibitions against making any misrepresentation of “the means, methods, procedures, effects, effectiveness, coverage, or scope of” our solutions. Any of the laws and regulations that apply to our business are subject to revision or new or changed interpretations, and we cannot predict the impact of such changes on our business.\nAdditionally, the nature of our identity and information protection products subjects us to the broad regulatory, supervisory, and enforcement powers of the Consumer Financial Protection Bureau which may exercise authority with respect to our services, or the marketing and servicing of those services, through the oversight of our financial institution or credit reporting agency customers and suppliers, or by otherwise exercising its supervisory, regulatory, or enforcement authority over consumer financial products and services.\nIf we do not protect our proprietary information and prevent third parties from making unauthorized use of our products and technology, our financial results could be harmed.\nMuch of our software and underlying technology is proprietary. We seek to protect our proprietary rights through a combination of confidentiality agreements and procedures and through copyright, patent, trademark, and trade secret laws. However, these measures afford only limited protection and may be challenged, invalidated, or circumvented by third parties. Third parties may copy all or portions of our products or otherwise obtain, use, distribute, and sell our proprietary information without authorization.\nThird parties may also develop similar or superior technology independently by designing around our patents. Our consumer agreements do not require a signature and therefore may be unenforceable under the laws of some jurisdictions. Furthermore, the laws of some foreign countries do not offer the same level of protection of our proprietary rights as the laws of the U.S., and we may be subject to the unauthorized use of our products in those countries. The unauthorized copying or use of our products or proprietary information could result in reduced sales of our products. Any legal action to protect proprietary information that we may bring or be engaged in with a strategic partner or vendor could adversely affect our ability to access software, operating system, and hardware platforms of such partner or vendor, or cause such partner or vendor to choose not to offer our products to their customers. In addition, any legal action to protect proprietary information that we may bring or be engaged in, could be costly, may distract management from day-to-day operations, and may lead to additional claims against us, which could adversely affect our operating results.\nFrom time to time we are a party to lawsuits and investigations, which typically require significant management time and attention and result in significant legal expenses.\nWe have initiated and been named as a party to lawsuits, including patent litigation, class actions, and governmental claims, and we may be named in additional litigation. The expense of initiating and defending, and in some cases settling, such litigation may be costly and divert management’s attention from the day-to-day operations of our business, which could have a materially adverse effect on our business, results of operations, and cash flows. In addition, an unfavorable outcome in such litigation could result in significant fines, settlements, monetary damages, or injunctive relief that could negatively and materially impact our ability to conduct our business, results of operations, and cash flows.\nFor example, in December 2018 the United Kingdom’s Competition and Markets Authority (CMA) launched an investigation into auto-renewal practices in the antivirus sector and recently announced that NortonLifeLock was one of the companies it was investigating. We continue to cooperate with the CMA in the course of its investigation and believe our business practices are fair and compliant with U.K. consumer law; however, we have been expending management time and resources on this matter and an unfavorable outcome of this investigation and any resulting litigation could impact our marketing practices to consumers, and potentially damage our reputation and otherwise harm our business and financial results.\nThird parties claiming that we infringe their proprietary rights could cause us to incur significant legal expenses and prevent us from selling our products.\nFrom time to time, third parties may claim that we have infringed their intellectual property rights, including claims regarding patents, copyrights, and trademarks. Because of constant technological change in the segments in which we compete, the\nextensive patent coverage of existing technologies, and the rapid rate of issuance of new patents, it is possible that the number of these claims may grow. In addition, former employers of our former, current, or future employees may assert claims that such employees have improperly disclosed to us confidential or proprietary information of these former employers. Any such claim, with or without merit, could result in costly litigation and distract management from day-to-day operations. If we are not successful in defending such claims, we could be required to stop selling, delay shipments of, or redesign our solutions, pay monetary amounts as damages, enter into royalty or licensing arrangements, or satisfy indemnification obligations that we have with some of our partners. We cannot assure you that any royalty or licensing arrangements that we may seek in such circumstances will be available to us on commercially reasonable terms or at all. We have made and expect to continue making significant expenditures to investigate, defend, and settle claims related to the use of technology and intellectual property rights as part of our strategy to manage this risk.\nIn addition, we license and use software from third parties in our business. These third-party software licenses may not continue to be available to us on acceptable terms or at all and may expose us to additional liability. This liability, or our inability to use any of this third-party software, could result in delivery delays or other disruptions in our business that could materially and adversely affect our operating results.\nSome of our products contain “open source” software, and any failure to comply with the terms of one or more of these open source licenses could negatively affect our business.\nCertain of our products are distributed with software licensed by its authors or other third parties under so-called “open source” licenses. Some of these licenses contain requirements that we make available source code for modifications or derivative works we create based upon the open source software and that we license such modifications or derivative works under the terms of a particular open source license or other license granting third parties certain rights of further use. By the terms of certain open source licenses, we could be required to release the source code of our proprietary software if we combine our proprietary software with open source software in a certain manner. In addition to risks related to license requirements, usage of open source software can lead to greater risks than use of third-party commercial software, as open source licensors generally do not provide warranties or controls on origin of the software. We have established processes to help alleviate these risks, including a review process for screening requests from our development organizations for the use of open source, but we cannot be sure that all open source is submitted for approval prior to use in our products. In addition, many of the risks associated with usage of open source may not or cannot be eliminated and could, if not properly addressed, negatively affect our business.\nRISKS RELATED TO OUR LIQUIDITY AND INDEBTEDNESS\nThere are risks associated with our outstanding and future indebtedness that could adversely affect our financial condition.\nAs of April 2, 2021, we had an aggregate of $3,620 million of outstanding indebtedness that will mature in calendar years 2022 through 2030, and $1,000 million available for borrowing under our revolving credit facility. See Note 10 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information on our outstanding debt. Our ability to meet expenses, remain in compliance with the covenants under our debt instruments, pay interest, and repay principal for our substantial level of indebtedness depends on, among other things, our operating performance, competitive developments, and financial market conditions, all of which are significantly affected by financial, business, economic, and other factors. We are not able to control many of these factors. Accordingly, our cash flow may not be sufficient to allow us to pay principal and interest on our debt, including the notes, and meet our other obligations. Our level of indebtedness could have other important consequences, including the following:\n•We must use a substantial portion of our cash flow from operations to pay interest and principal on the term loans and revolving credit facility, our existing senior notes, and other indebtedness, which reduces funds available to us for other purposes such as working capital, capital expenditures, other general corporate purposes, and potential acquisitions;\n•We may be unable to refinance our indebtedness or to obtain additional financing for working capital, capital expenditures, acquisitions, or general corporate purposes;\n•We are exposed to fluctuations in interest rates because borrowings under our senior secured credit facilities bear interest at variable rates;\n•Our leverage may be greater than that of some of our competitors, which may put us at a competitive disadvantage and reduce our flexibility in responding to current and changing industry and financial market conditions;\n•We may be more vulnerable to an economic downturn or recession and adverse developments in our business;\n•We may be unable to comply with financial and other covenants in our debt agreements, which could result in an event of default that, if not cured or waived, may result in acceleration of certain of our debt and would have an adverse effect on our business and prospects and could force us into bankruptcy or liquidation;\n•Changes by any rating agency to our outlook or credit rating could negatively affect the value of our debt and/or our common stock, adversely affect our access to debt markets, and increase the interest we pay on outstanding or future debt; and\n•Conversion of our convertible note could result in significant dilution of our common stock, which could result in significant dilution to our existing stockholders and cause the market price of our common stock to decline.\nThere can be no assurance that we will be able to manage any of these risks successfully. In addition, we conduct a significant portion of our operations through our subsidiaries. Accordingly, repayment of our indebtedness will be dependent in part on the generation of cash flow by our subsidiaries and their ability to make such cash available to us by dividend, debt repayment, or otherwise, which may not always be possible. In the event that we do not receive distributions from our subsidiaries, we may be unable to make the required principal and interest payments on our indebtedness.\nThe elimination of LIBOR after June 2023 may affect our financial results.\nOn March 5, 2021, the United Kingdom Financial Conduct Authority, which regulates LIBOR, announced that all LIBOR tenors relevant to us will cease to be published or will no longer be representative after June 30, 2023. This means that any of our LIBOR-based borrowings that extend beyond June 30, 2023 will need to be converted to a replacement rate. In the U.S., the Alternative Reference Rates Committee, or ARRC, a committee of private sector entities with ex-officio official sector members convened by the Federal Reserve Board and the Federal Reserve Bank of New York, has recommended the Secured Overnight Financing Rate (“SOFR”) plus a recommended spread adjustment as LIBOR's replacement. There are significant differences between LIBOR and SOFR, such as LIBOR being an unsecured lending rate while SOFR is a secured lending rate, and SOFR is an overnight rate while LIBOR reflects term rates at different maturities. If our LIBOR-based borrowings are converted to SOFR, the differences between LIBOR and SOFR, plus the recommended spread adjustment, could result in interest costs that are higher than if LIBOR remained available, which could have a material adverse effect on our operating results. Although SOFR is the ARRC's recommended replacement rate, it is also possible that lenders may instead choose alternative replacement rates that may differ from LIBOR in ways similar to SOFR or in other ways that would result in higher interest costs for us. It is not yet possible to predict the magnitude of LIBOR's end on our borrowing costs given the remaining uncertainty about which rates will replace LIBOR.\nOur term loan and revolving credit facility agreement impose operating and financial restrictions on us.\nOur term loan and revolving credit facility agreement contain covenants that limit our ability and the ability of our restricted subsidiaries to:\n•Incur additional debt;\n•Create liens on certain assets to secure debt;\n•Enter into certain sale and leaseback transactions;\n•Pay dividends on or make other distributions in respect of our capital stock or make other restricted payments; and\n•Consolidate, merge, sell or otherwise dispose of all or substantially all of our assets.\nAll of these covenants may adversely affect our ability to finance our operations, meet or otherwise address our capital needs, pursue business opportunities, react to market conditions, or otherwise restrict activities or business plans. A breach of any of these covenants could result in a default in respect of the related indebtedness. If a default occurs, the relevant lenders could elect to declare the indebtedness, together with accrued interest and other fees, to be immediately due and payable and, to the extent such indebtedness is secured in the future, proceed against any collateral securing that indebtedness.\nGENERAL RISKS\nFluctuations in our quarterly financial results have affected the trading price of our outstanding securities in the past and could affect the trading price of our outstanding securities in the future.\nOur quarterly financial results have fluctuated in the past and are likely to vary in the future due to a number of factors, many of which are outside of our control. If our quarterly financial results or our predictions of future financial results fail to meet our expectations or the expectations of securities analysts and investors, the trading price of our outstanding securities could be negatively affected. Volatility in our quarterly financial results may make it more difficult for us to raise capital in the future or pursue acquisitions.\nFactors associated with our industry, the operation of our business, and the markets for our solutions may cause our quarterly financial results to fluctuate, including but not limited to:\n•Fluctuations in demand for our solutions;\n•Disruptions in our business operations or target markets caused by, among other things, terrorism or other intentional acts, outbreaks of disease, such as the COVID-19 pandemic, or earthquakes, floods, or other natural disasters;\n•Entry of new competition into our markets;\n•Our ability to achieve targeted operating income and margins and revenues;\n•Competitive pricing pressure or free offerings that compete with one or more of our solutions;\n•Our ability to timely complete the release of new or enhanced versions of our solutions;\n•The amount and timing of commencement and termination of major marketing campaigns;\n•The number, severity, and timing of threat outbreaks and cyber security incidents;\n•Loss of customers or strategic partners;\n•Changes in the mix or type of solutions and subscriptions sold and changes in consumer retention rates;\n•The rate of adoption of new technologies and new releases of operating systems, and new business processes;\n•Consumer confidence and spending changes;\n•The impact of litigation, regulatory inquiries, or investigations;\n•The impact of acquisitions and divestitures and our ability to achieve expected synergies or attendant cost savings;\n•Fluctuations in foreign currency exchange rates and interest rates;\n•The publication of unfavorable or inaccurate research reports about our business by cybersecurity industry analysts;\n•The success of our corporate responsibility initiatives;\n•Changes in tax laws, rules, and regulations; and\n•Changes in consumer protection laws and regulations.\nAny of the foregoing factors could cause the trading price of our outstanding securities to fluctuate significantly.\nChanges to our effective tax rate could increase our income tax expense and reduce (increase) our net income (loss), cash flows and working capital.\nOur effective tax rate could be adversely affected by several factors, many of which are outside of our control, including:\n•Changes to the U.S. federal income tax laws, including the potential for corporate tax increases under the new Biden Administration;\n•Changes to other tax laws, regulations, and interpretations in multiple jurisdictions in which we operate, including actions resulting from the Organisation for Economic Co-operation and Development's base erosion and profit shifting project, proposed actions by international bodies such as digital services taxation, as well as the requirements of certain tax rulings;\n•Changes in the relative proportions of revenues and income before taxes in the various jurisdictions in which we operate that have differing statutory tax rates;\n•The tax effects of significant infrequently occurring events that may cause fluctuations between reporting periods;\n•Tax assessments, or any related tax interest or penalties, that could significantly affect our income tax expense for the period in which the settlements take place; and\n•Taxes arising in connection to changes in our workforce, corporate entity structure or operations as they relate to tax incentives and tax rates.\nFrom time to time, we receive notices that a tax authority in a particular jurisdiction believes that we owe a greater amount of tax than we have reported to such authority. We are regularly engaged in discussions and sometimes disputes with these tax authorities. If the ultimate determination of our taxes owed in any of these jurisdictions is for an amount in excess of the tax provision we have recorded or reserved for, our operating results, cash flows, and financial condition could be adversely affected.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nThere are no unresolved issues with respect to any Commission staff’s written comments that were received at least 180 days before the end of our fiscal year to which this report relates and that relate to our periodic or current reports under the Exchange Act.",
    "item_2": "Item 2. Properties\nNot applicable.",
    "item_3": "Item 3. Legal Proceedings\nInformation with respect to this Item may be found under the heading “Litigation contingencies” in Note 18 to the Consolidated Financial Statements in this Annual Report on Form 10-K which information is incorporated into this Item 3 by reference.",
    "item_4": "Item 4. Mine Safety Disclosures\nNot applicable.\nPART II",
    "item_5": "Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nStock symbol and stockholders of record\nOur common stock is traded on the Nasdaq Global Select Market under the symbol “NLOK”. As of April 2, 2021, there were 1,538 stockholders of record. A substantially greater number of holders of our common stock are \"street name\" or beneficial holders, whose shares of record are held by banks, brokers, and other financial institutions.\nStock performance graph\nThe graph below compares the cumulative total stockholder return on our common stock with the cumulative total return on the S&P 500 Composite Index and the S&P Information Technology Index for the five fiscal years ended April 2, 2021 (assuming the initial investment of $100 in our common stock and in each of the other indices on the last day of trading for fiscal 2016 and the reinvestment of all dividends). The comparisons in the graph below are based on historical data and are not indicative of, nor intended to forecast the possible future performance of our common stock.\nCOMPARISON OF FIVE-YEAR CUMULATIVE TOTAL RETURN\nAmong NortonLifeLock Inc., the S&P 500 Index\nand the S&P Information Technology Index\nThis performance graph shall not be deemed “filed” for purposes of Section 18 of the Exchange Act or otherwise subject to the liabilities under that Section and shall not be deemed to be incorporated by reference into any filing of NortonLifeLock under the Securities Act or the Exchange Act.\nRepurchases of our equity securities\nUnder our stock repurchase programs, shares may be repurchased on the open market and through accelerated stock repurchase transactions. As of April 2, 2021, we had $274 million remaining authorized to be completed in future periods. On May 4, 2021, our Board of Directors approved an incremental share repurchase authorization of $1,500 million bringing the total authorized under the stock repurchase program to $1,774 million. The authorization does not have an expiration date. Stock repurchases during the three months ended April 2, 2021, were as follows:\n(In millions, except per share data) Total Number of Shares Purchased (1)\nAverage Price Paid per Share\nTotal Number of Shares Purchased as Part of Publicly Announced Program Maximum Dollar Value of Shares That May Yet Be Purchased Under the Plans or Programs\nJanuary 2, 2021 to January 29, 2021 5 $ 20.80 5 $ 323\nJanuary 30, 2021 to February 26, 2021 2 $ 20.28 2 $ 284\nFebruary 27, 2021 to April 2, 2021 (2)\n- $ 20.01 - $ 274\nTotal number of shares repurchased 7 7\n(1) The number of shares purchased is reported on trade date. Repurchases of 1 million shares, which were executed prior to January 2, 2021, settled during the period of January 2, 2021 to January 29, 2021.\n(2) The number of shares is less than 1 million.",
    "item_6": "Item 6. Selected Financial Data\nThis item is no longer required, as we have elected to early adopt the amendment to Item 301 of Regulation S-K contained in SEC Release No. 33-10890, which became effective on February 10, 2021.",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nPlease read the following discussion and analysis of our financial condition and results of operations together with our Consolidated Financial Statements and related Notes thereto included under Item 15 of this Annual Report on Form 10-K.\nOVERVIEW\nNortonLifeLock Inc. has the largest Consumer Cyber Safety platform in the world, empowering nearly 80 million users in more than 150 countries. We are the trusted and number one top of mind brand in consumer Cyber Safety, according to the 2020 NortonLifelock brand tracking study. We help prevent, detect, and restore potential damages caused by many cyber criminals.\nWe have utilized and expect to continue to utilize acquisitions to contribute to our long-term growth objectives. During fiscal year 2021, we completed the acquisition of Avira, which provides a consumer-focused portfolio of cybersecurity and privacy solutions primarily in Europe and key emerging markets. We believe this acquisition will help accelerate our international growth.\nFiscal Year Highlights\n•In May 2020, we settled the $625 million principal and conversion rights of our 2.0% Convertible Notes for $1,176 million in cash. The repayments resulted in an adjustment to stockholders’ equity of $578 million and a gain on extinguishment of $20 million.\n•In July 2020, we completed the sale of our Culver City property for cash consideration of $118 million, net of selling costs, and recognized a gain on sale of $35 million.\n•In September 2020, we borrowed $750 million under the Delayed Draw Term Loan, maturing in 2024, and used the entire amount of the proceeds to repay in full the principal and accrued interest under our 4.2% Senior Notes due September 2020. The first amendment to our credit agreement, executed in May 2021, extends the maturity date from November 2024 to May 2026 for this tranche. See Note 10 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K.\n•In October 2020, we entered into multiple agreements with Broadcom for an aggregate amount of $200 million to license Broadcom’s enterprise software and security engines and to resolve all outstanding payments and claims related to the asset purchase and transition services agreement.\n•In December 2020, we substantially completed our restructuring plan (the November 2019 Plan) in connection with the strategic decision to divest our Enterprise Security business. We incurred total costs of $509 million since the inception of the November 2019 Plan, excluding stock-compensation expense, primarily related to workforce reduction, contract termination, and asset write-offs and impairment charges.\n•In January 2021, we completed the acquisition of Avira for total aggregate consideration of $344 million, net of $32 million cash acquired.\n•On April 1, 2021, we completed the sale of certain land and buildings in Mountain View for cash consideration of $100 million, net of selling costs, and recognized a gain on sale of $63 million.\nFiscal calendar and basis of presentation\nWe have a 52/53-week fiscal year ending on the Friday closest to March 31. Fiscal 2021, 2020, and 2019 in this report refers to fiscal year ended April 2, 2021, April 3, 2020, and March 29, 2019, respectively. Fiscal 2020 was a 53-week year, whereas fiscal 2021 and 2019 each consisted of 52 weeks.\nKey financial metrics\nThe following table provides our key financial metrics for fiscal 2021 compared with fiscal 2020:\nFiscal Year\n(In millions, except for per share amounts) 2021 2020\nNet revenues $ 2,551 $ 2,490\nOperating income $ 896 $ 355\nIncome from continuing operations $ 696 $ 578\nIncome (loss) from discontinued operations $ (142) $ 3,309\nNet income $ 554 $ 3,887\nNet income per share from continuing operations - diluted $ 1.16 $ 0.90\nNet income per share from discontinued operations - diluted $ (0.24) $ 5.15\nNet income per share - diluted $ 0.92 $ 6.05\nNet cash provided by (used in) operating activities $ 706 $ (861)\nAs of\n(in millions) April 2, 2021 April 3, 2020\nCash, cash equivalents and short-term investments $ 951 $ 2,263\nContract liabilities $ 1,265 $ 1,076\n•Net revenues increased $61 million, primarily due to increased sales of our consumer security products and our identity and protection products, partially offset by the divestiture of our ID Analytics solutions and the additional week of revenue recognized during fiscal 2020.\n•Operating income increased $541 million, primarily due to lower compensation expense, outside services expense, and facility and IT costs that were driven by our cost reduction programs, partially offset by a legal accrual relating to an ongoing civil lawsuit involving a government contract with the U.S. General Services Administration (GSA).\n•Income from continuing operations increased $118 million, primarily due to higher operating income, gain on sale of our Culver City and certain Mountain View properties, gain on extinguishment of debt, and lower income tax expense, partially offset by the absence of the $379 million gain on sale of our equity method investment in DigiCert and the $250 million gain on the sale of our ID Analytics solutions, which were divested in fiscal 2020.\n•We incurred a loss from discontinued operations, net of tax, compared to a gain during the corresponding period in fiscal 2020, primarily due to the absence of gain on the sale of certain of our Enterprise Security assets and certain liabilities to Broadcom Inc. (the “Broadcom sale”), the absence of operating income as a result of the Broadcom sale, and a settlement with Broadcom in the second quarter of fiscal 2021 of all outstanding payments and certain claims related to the Broadcom sale.\n•Net income and net income per share decreased, primarily due to the loss from discontinued operations for the reasons discussed above, partially offset by higher income from continuing operations.\n•Cash, cash equivalents and short-term investments decreased by $1,312 million compared to April 3, 2020, primarily due to repayment of debt, net of borrowings, and to a lesser extent, payments for dividends and dividend equivalents, and payment for acquisitions. The payments were partially offset by net cash provided by operating activities and proceeds from the sale of our Culver City and certain Mountain View properties. In May 2020, we settled the principal and conversion rights of $625 million of our 2.0% Convertible Notes for $1,176 million in cash.\n•Contract liabilities increased $189 million compared to April 3, 2020, primarily due to higher billings than recognized revenue and the acquisition of Avira.\nCOVID-19 UPDATE\nThe COVID-19 pandemic is having widespread, rapidly evolving, and unpredictable impacts on global society, economies, financial markets, and business practices. To protect the health and well-being of our employees, partners and third-party service providers, we implemented a near company-wide work-from-home requirement for most employees, made substantial modifications to employee travel policies, and cancelled or shifted our conferences and other marketing events to virtual-only. We continue to monitor the situation and plan to adjust our current policies as recommendations and public health guidance is changing. To date, we have not seen any meaningful negative impact on our customer success efforts, sales and marketing efforts, or employee productivity. Nevertheless, as employees, partners or third-party services providers return to work during the COVID-19 pandemic, the risk of inadvertent transmission of COVID-19 through human contact could still occur and result in litigation.\nThe U.S. and global economies have experienced a recession due to the economic impacts of the COVID-19 pandemic. Although we did not experience a material increase in cancellations by customers or a material reduction in our retention rate in\n2021, we may experience such an increase or reduction in the future, especially in the event of a prolonged recession as a result of the COVID-19 pandemic. A prolonged recession could adversely affect demand for our offerings, retention rates and harm our business and results of operations, particularly in light of the fact that our solutions are discretionary purchases and thus may be more susceptible to macroeconomic pressures, as well impact the value of our common stock, ability to refinance our debt, and our access to capital.\nThe duration and extent of the impact from the COVID-19 pandemic depends on future developments that cannot be accurately forecasted at this time, such as the severity and transmission rate of new variants of the disease, the extent, effectiveness and acceptance of containment actions, such as vaccination programs, and the impact of these and other factors on our employees, customers, partners and third-party service providers. For more information on the risks associated with the COVID-19 pandemic, please see “Risk Factors” in Item 1A.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThe preparation of our Consolidated Financial Statements and related notes in accordance with generally accepted accounting principles in the U.S. (GAAP) requires us to make estimates, including judgments and assumptions that affect the reported amounts of assets, liabilities, revenue and expenses, and related disclosure of contingent assets and liabilities. We have based our estimates on historical experience and on various assumptions that we believe to be reasonable under the circumstances. We evaluate our estimates on a regular basis and make changes accordingly. Management believes that the accounting estimates employed, and the resulting amounts are reasonable; however, actual results may differ from these estimates. Making estimates and judgments about future events is inherently unpredictable and is subject to significant uncertainties, some of which are beyond our control. Should any of these estimates and assumptions change or prove to have been incorrect, it could have a material impact on our results of operations, financial position, and cash flows.\nA summary of our significant accounting policies is included in Note 1 of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K. An accounting policy is deemed to be critical if it requires an accounting estimate to be made based on assumptions about matters that are highly uncertain at the time the estimate is made, if different estimates reasonably could have been used, or if changes in the estimate that are reasonably possible could materially impact the financial statements. Management believes the following critical accounting policies reflect the significant estimates and assumptions used in the preparation of our Consolidated Financial Statements.\nBusiness combinations\nWe allocate the purchase price of acquired businesses to the tangible and identifiable intangible assets acquired and liabilities assumed based on their estimated fair values on the acquisition date. Any residual purchase price is recorded as goodwill. The allocation of purchase price requires management to make significant estimates and assumptions in determining the fair values of the assets acquired and liabilities assumed especially with respect to intangible assets.\nCritical estimates in valuing intangible assets include, but are not limited to, future expected cash flows from customer relationships, developed technology, trade names, and acquired patents, and discount rates. Management estimates of fair value are based upon assumptions believed to be reasonable, but which are inherently uncertain and unpredictable. Third-party valuation specialists are also utilized for certain estimates. Unanticipated events and circumstances may occur which may affect the accuracy or validity of such assumptions, estimates, or actual results.\nIncome taxes\nWe are subject to tax in multiple U.S. and foreign tax jurisdictions. We are required to estimate the current tax exposure as well as assess the temporary differences between the accounting and tax treatment of assets and liabilities, including items such as accruals and allowances not currently deductible for tax purposes. We apply judgment in the recognition and measurement of current and deferred income taxes which includes the following critical accounting estimates.\nWe use a two-step process to recognize liabilities for uncertain tax positions. The first step is to evaluate the tax position for recognition by determining if the weight of available evidence indicates that it is more likely than not that the position will be sustained on audit, including resolution of related appeals or litigation processes, if any. If we determine that the tax position will more likely than not be sustained on audit, the second step requires us to estimate and measure the tax benefit as the largest amount that is more than 50% likely to be realized upon ultimate settlement. It is inherently difficult and subjective to estimate such amounts, as this requires us to determine the probability of various outcomes. We re-evaluate these uncertain tax positions on a quarterly basis. This evaluation is based on factors including, but not limited to, changes in facts or circumstances, changes in tax law, effectively settled issues under audit, and new audit activity. Such a change in recognition or measurement would result in the recognition of a tax benefit or an additional charge to the tax provision in the period.\nLoss contingencies\nWe are subject to contingencies that expose us to losses, including various legal and regulatory proceedings, asserted and potential claims that arise in the ordinary course of business. An estimated loss from such contingencies is recognized as a charge to income if it is probable that a liability has been incurred and the amount of the loss can be reasonably estimated. Judgment is required in both the determination of probability and the determination as to whether a loss is reasonably estimable. We review the status of each significant matter quarterly, and we may revise our estimates. Until the final resolution of such matters, there may be an exposure to loss in excess of the amount recorded, and such amounts could be material. Should any of our estimates and assumptions change or prove to have been incorrect, it could have a material impact on our Consolidated Financial Statements for that reporting period.\nRESULTS OF OPERATIONS\nThe following table sets forth our Consolidated Statements of Operations data as a percentage of net revenues for the periods indicated:\nFiscal Year\n2021 2020 2019\nNet revenues 100 % 100 % 100 %\nCost of revenues 14 16 19\nGross profit 86 84 81\nOperating expenses:\nSales and marketing 23 28 29\nResearch and development 10 13 17\nGeneral and administrative 8 15 17\nAmortization of intangible assets 3 3 3\nRestructuring, transition and other costs 6 11 9\nTotal operating expenses 51 70 75\nOperating income 35 14 6\nInterest expense (6) (8) (8)\nOther income (expense), net 5 27 (2)\nIncome (loss) from continuing operations before income taxes 34 33 (4)\nIncome tax expense 7 10 -\nIncome (loss) from continuing operations 27 23 (4)\nIncome (loss) from discontinued operations (6) 133 6\nNet income 22 % 156 % 1 %\nNote: The percentages may not add due to rounding.\nNet revenues\nFiscal Year Variance in %\n(In millions, except for percentages) 2021 2020 2019 2021 vs. 2020 2020 vs. 2019\nNet revenues $ 2,551 $ 2,490 $ 2,456 2 % 1 %\nFiscal 2021 compared to fiscal 2020\nNet revenues increased $61 million primarily due to a $91 million increase in sales of our consumer security products and a $60 million increase in sales of our identity and protection products. This was driven by the increase in our direct customer count year-over-year, and stable annual retention rate and average revenue per user (ARPU) in fiscal 2021. The increase was partially offset by a $46 million decrease as a result of the divestiture of our ID Analytics solutions in January 2020 and $44 million of revenue recognized during an additional week in fiscal 2020.\nFiscal 2020 compared to fiscal 2019\nNet revenues increased $34 million primarily due to approximately $44 million of revenues from the additional week in fiscal 2020.\nPerformance Metrics\nWe regularly monitor a number of metrics in order to measure our current performance and estimate our future performance. Our metrics may be calculated in a manner different than similar metrics used by other companies.\nThe following table summarizes supplemental key performance metrics for our solutions:\nFiscal Year\n(In millions, except for per user amounts and percentages) 2021 2020 2019\nDirect customer revenue (1)\n$ 2,286 $ 2,204 $ 2,168\nPartner revenues $ 270 $ 240 $ 240\nAverage direct customer count (2)\n21.2 20.2 20.7\nDirect customer count (at quarter-end) 23.0 20.2 20.3\nDirect average revenue per user (ARPU) (3)\n$ 9.01 $ 8.90 $ 8.74\nAnnual retention rate 85 % 85 % 85 %\n(1) Direct customer revenues in fiscal 2021 excludes a $5 million reduction of revenue from a contract liability purchase accounting adjustment recognized during the last quarter due to the acquisition of Avira. Direct customer revenues in fiscal 2020 and 2019 excludes $46 million and $48 million, respectively, of revenue from ID Analytics solutions, which were divested in the fourth quarter of fiscal 2020.\n(2) Average direct customer count for fiscal 2021 is calculated as an average of the fiscal quarters. The average direct customer count for the fourth fiscal quarter was pro-rated to include 1.6 million customers from the Avira acquisition.\n(3) ARPU in fiscal 2020 was normalized to exclude the impact of the extra week on direct revenue, which we estimate to be approximately $41 million of direct customer revenue. Excluding this adjustment, ARPU would have been $9.07 in fiscal 2020.\nWe define direct customer revenues as revenues from sales of our consumer solutions to direct customers, which we define as active paid users who have a direct billing relationship with us at the end of the reported period. Users with multiple products or entitlements are counted for based on which solutions they are subscribed. We exclude users on free trials and promotions and users who have indirectly purchased our product or services through partners unless such users convert or renew their subscriptions directly with us.\nFrom time to time, we update our methodology due to changes in the business. In fiscal 2021, the average direct customer count calculation has been refined primarily to pro-rate for acquisitions that happen during a quarter, such as Avira, which was acquired in January 2021. The full year average direct customer count is calculated as an average across the quarters. This change in methodology had an immaterial impact to historical amounts presented.\nARPU is calculated as estimated direct customer revenues for the period divided by the average direct customer count for the same period, expressed as a monthly figure. We monitor ARPU because it helps us understand the rate at which we are monetizing our consumer customer base.\nAnnual retention rate is defined as the number of direct customers who have more than a one-year tenure as of the end of the most recently completed fiscal period divided by the total number of direct customers as of the end of the period from one year ago. We monitor annual retention rate to evaluate the effectiveness of our strategies to improve renewals of subscriptions.\nNet revenues by geographic region\nPercentage of revenue by geographic region as presented below is based on the billing location of the customer.\nFiscal Year\n2021 2020 2019\nAmericas 72 % 74 % 73 %\nEMEA 16 % 15 % 16 %\nAPJ 12 % 11 % 11 %\nPercentages may not add to 100% due to rounding.\nThe Americas include U.S., Canada, and Latin America; EMEA includes Europe, Middle East, and Africa; APJ includes Asia Pacific and Japan.\nPercentage of revenue by geographic region remained consistent in fiscal 2021, 2020, and 2019.\nCost of revenues\nFiscal Year Variance in %\n(In millions, except for percentages) 2021 2020 2019 2021 vs. 2020 2020 vs. 2019\nCost of revenues $ 362 $ 393 $ 455 (8) % (14) %\nFiscal 2021 compared to fiscal 2020\nOur cost of revenues decreased $31 million primarily due to decreases in royalty charges and technical support costs, partially offset by an increase in commissions, reflecting higher investments in affiliate marketing programs.\nFiscal 2020 compared to fiscal 2019\nOur cost of revenues decreased $62 million primarily due to decreases in technical support costs and service costs, partially offset by an increase in royalty charges. In addition, during fiscal 2019, we recorded higher inventory write-offs of $10 million due to our discontinuation of our consumer hardware product line.\nOperating expenses\nFiscal Year Variance in %\n(In millions, except for percentages) 2021 2020 2019 2021 vs. 2020 2020 vs. 2019\nSales and marketing $ 576 $ 701 $ 712 (18) % (2) %\nResearch and development 267 328 420 (19) % (22) %\nGeneral and administrative 215 368 410 (42) % (10) %\nAmortization of intangible assets 74 79 80 (6) % (1) %\nRestructuring, transition and other costs 161 266 221 (39) % 20 %\nTotal $ 1,293 $ 1,742 $ 1,843 (26) % (5) %\nFiscal 2021 compared to fiscal 2020\nSales and marketing expense decreased $125 million primarily due to a $147 million decrease in shared facility and IT costs, partially offset by a $12 million increase in advertising and promotional expense.\nResearch and development expense decreased $61 million due to a $44 million decrease in shared facility and IT costs and a $17 million decrease in compensation, driven by lower headcount.\nGeneral and administrative expense decreased $153 million primarily due to a $70 million decrease in compensation expense, a $55 million decrease in shared facility and IT costs, and a $43 million decrease in outside services expense, partially offset by an additional legal accrual of $25 million in fiscal 2021 relating to an ongoing civil lawsuit involving a government contract with the GSA.\nThe overall decreases in our sales and marketing, research and development and general and administrative expenses were driven by our cost reduction initiatives.\nAmortization of intangible assets was relatively flat compared to fiscal 2020.\nRestructuring, transition and other costs decreased $105 million primarily due to a $50 million decrease of contract cancellation charges and a $59 million decrease in severance costs in connection with our November 2019 restructuring plan (the November 2019 Plan). The decrease was partially offset by a $11 million increase in asset write-offs and impairments. See Note 12 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information on our restructuring plans.\nFiscal 2020 compared to fiscal 2019\nSales and marketing expense decreased $11 million primarily due to a $75 million decrease in compensation expense and allocated corporate costs, reflecting our cost reduction initiatives. These decreases were partially offset by a $64 million increase in advertising and promotional expense reflecting our higher investments in direct marketing programs.\nResearch and development expense decreased $92 million primarily due to a $77 million decrease in compensation expense and allocated corporate costs, and a $23 million decrease in outside services, reflecting our cost reduction initiatives.\nGeneral and administrative expense decreased $42 million primarily due to a $34 million decrease in compensation expense other than stock-based compensation and allocated corporate costs, and a $18 million decrease in stock-based compensation expense.\nAmortization of intangible assets was relatively flat compared to fiscal 2019.\nRestructuring, transition and other costs increased $45 million primarily due to $101 million of contract cancellation charges incurred in fiscal 2020, a $71 million increase in severance costs, a $45 million increase in asset impairments, and a $20 million increase in stock-based compensation. These increases were partially offset by $185 million costs related to transition projects incurred in fiscal 2019 that were completed by the end of that period.\nNon-operating income (expense), net\nFiscal Year Variance in $\n(In millions) 2021 2020 2019 2021 vs. 2020 2020 vs. 2019\nInterest expense $ (144) $ (196) $ (208) $ 52 $ 12\nInterest income 4 80 42 (76) 38\nLoss from equity interest - (31) (101) 31 70\nForeign exchange gain (loss) 1 (6) (11) 7 5\nGain on divestitures - 250 - (250) 250\nGain on sale of equity method investment - 379 - (379) 379\nGain on early extinguishment of debt 20 - - 20 -\nGain on sale of properties 98 - - 98 -\nTransition service expense, net (9) (19) - 10 (19)\nOther 6 7 13 (1) (6)\nNon-operating income (expense), net $ (24) $ 464 $ (265) $ (488) $ 729\nFiscal 2021 compared to fiscal 2020\nNon-operating income, net of expense, decreased $488 million primarily due the absence of the $379 million gain on sale of our equity method investment in DigiCert and the $250 million gain on the sale of our ID Analytics solutions, which were divested in fiscal 2020. The decrease was partially offset by the absence of loss from our equity interest in DigiCert, gain on sale of our Culver City property and certain Mountain View properties, and the gain on extinguishment of debt due to the repayment of our 2.0% Convertible Notes in fiscal 2021.\nFiscal 2020 compared to fiscal 2019\nNon-operating income, net of expense, increased $729 million primarily due to a $379 million gain on the sale of the DigiCert equity method investment and a $250 million gain on the sale of our ID Analytics solutions in fiscal 2020. In addition, our loss from equity interest that was divested in fiscal 2020 decreased $70 million and our interest income increased $38 million as a result of higher investments in money market funds purchased with proceeds from the Broadcom sale.\nProvision for income taxes\nWe are a U.S.-based multinational company subject to tax in multiple U.S. and international tax jurisdictions. Our results of operations would be adversely affected to the extent that our geographical mix of income becomes more weighted toward jurisdictions with higher tax rates and would be favorably affected to the extent the relative geographic mix shifts to lower tax jurisdictions. Any change in our mix of earnings is dependent upon many factors and is therefore difficult to predict.\nFiscal Year\n(In millions, except for percentages) 2021 2020 2019\nIncome (loss) from continuing operations before income taxes $ 872 $ 819 $ (107)\nProvision for income taxes $ 176 $ 241 $ 3\nEffective tax rate on income (loss) from continuing operations 20 % 29 % (3) %\nFiscal 2021 compared to fiscal 2020\nOur effective tax rate decreased primarily due to releases in uncertain tax positions and favorable withholding tax rulings.\nFiscal 2020 compared to fiscal 2019\nOur effective tax rate increased primarily due to an increase in income taxes from non-deductible goodwill, and an increase in income taxes as a result of the Altera Ninth Circuit Opinion. See Note 13 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for information about the Altera Ninth Circuit Opinion.\nDiscontinued operations\nFiscal Year Variance in %\n(In millions, except for percentages) 2021 2020 2019 2021 vs. 2020 2020 vs. 2019\nNet revenues $ 1 $ 1,368 $ 2,288 (100) % (40) %\nGross profit $ 1 $ 1,035 $ 1,693 (100) % (39) %\nOperating income (loss) $ (177) $ 4 $ 234 (4,525) % (98) %\nGain on sale $ - $ 5,434 $ - N/A N/A\nIncome (loss) before income taxes $ (176) $ 5,431 $ 228 (103) % 2,282 %\nIncome tax expense (benefit) $ (34) $ 2,122 $ 87 (102) % 2,339 %\nIncome (loss) from discontinued operations, net of taxes $ (142) $ 3,309 $ 141 (104) % 2,247 %\nFiscal 2021 compared to fiscal 2020\nWe incurred a loss from discontinued operations in fiscal 2021, compared to a gain during the corresponding period in fiscal 2020, primarily due to the absence of gain on the Broadcom sale, the absence of operating income as a result of the Broadcom sale, and a $200 million settlement with Broadcom in the second quarter of fiscal 2021 of all outstanding payments and certain claims related to the Broadcom sale.\nFiscal 2020 compared to fiscal 2019\nIncome from discontinued operations in fiscal 2020 reflects a $5,434 million gain on the Broadcom sale and $2,122 million income tax expense primarily related to the gain. In addition, we recognized $261 million restructuring, transition and other costs in fiscal 2020, compared to $20 million in fiscal 2019.\nLIQUIDITY, CAPITAL RESOURCES AND CASH REQUIREMENTS\nLiquidity\nWe have historically relied on cash generated from operations, borrowings under credit facilities, issuances of debt, and proceeds from divestitures for our liquidity needs.\nAs of April 2, 2021, we had cash, cash equivalents and short-term investments of approximately $1.0 billion, of which $0.4 billion was held by our foreign subsidiaries. Our cash, cash equivalents and short-term investments are managed with the objective to preserve principal, maintain liquidity, and generate investment returns. The participation exemption system under current U.S. federal tax regulations generally allows us to make distributions of non-U.S. earnings to the U.S. without incurring additional U.S. federal tax; however, these distributions may be subject to applicable state or non-U.S. taxes. We have recognized deferred income taxes for local country income and withholding taxes that could be incurred on distributions of certain non-U.S. earnings or for outside basis differences in our subsidiaries.\nWe also have an undrawn revolving credit facility of $1 billion. The first amendment to our credit agreement, executed in May 2021, extends the maturity date from November 2024 to May 2026. For additional discussion on the amendment, see Note 10 of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K.\nOur principal cash requirements are primarily to meet our working capital needs and support on-going business activities, including payment of taxes and cash dividends, funding capital expenditures, servicing existing debt, repurchasing our common stock, and investing in business acquisitions.\nOur capital allocation strategy is to balance driving stockholder returns, managing financial risk, and preserving our flexibility to pursue strategic options, including acquisitions. Historically, this has included a quarterly cash dividend, the repayment of debt, and the repurchase of our common stock.\nDivestiture of Enterprise Security business\nIn fiscal 2020, we completed the sale of certain assets and the assumption of certain liabilities of our Enterprise Security business to Broadcom. During fiscal 2021, we paid approximately $70 million of U.S. and foreign income taxes as a result of the transaction.\nOn October 1, 2020, we entered into multiple agreements with Broadcom and paid an aggregate amount of $200 million. We licensed Broadcom’s enterprise software, multiple security engines and related telemetry for 5.6 years. In addition, we resolved all outstanding payments and certain claims related to the asset purchase and transition services agreements.\nDebt\nIn May 2020, we settled the $625 million principal and conversion rights of our 2.0% Convertible Notes for $1,176 million in cash. In September 2020, we borrowed $750 million under the Delayed Draw Term Loan, maturing in November 2024, and used the entire amount of the proceeds to repay in full the principal and accrued interest under our 4.2% Senior Notes due September 2020. In March 2021, we made a $6 million quarterly principal payment on our initial term loan (the Initial Term Loan) and a $9 million quarterly principal payment on the Delayed Draw Term Loan. On May 7, 2021, we entered into the first amendment to our credit agreement, which provides an additional five year term loan (the First Amendment Additional Term Loan), and extends the maturity date of the Initial Term Loan, the Delayed Draw Term Loan, and revolving credit facility from November 2024 to May 2026. For additional discussion on the amendment, see Note 10 of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K.\nIn May 2021, we entered into a Convertible Notes Purchase Agreement (the “Agreement”) under which we agreed to repurchase $250 million in aggregate principal amount of our new 2.50% convertible senior notes due 2022. Under the terms of the Agreement, we paid an aggregate of $365 million on May 20, 2021, representing $24.40 per underlying share into which the notes are convertible, accrued and unpaid interest through the date of settlement, and a portion of the cash dividend that we declared on May 10, 2021 . For additional discussion on the Agreement, see Note 19 of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K\nSale of certain assets\nOn July 27, 2020, we completed the sale of our Culver City property for cash consideration of $118 million, net of selling costs.\nOn April 1, 2021, we completed the sale of certain land and buildings in Mountain View for cash consideration of $100 million, net of selling costs.\nAcquisition of Avira\nOn January 8, 2021, we completed our acquisition of Avira for total aggregate cash consideration of $344 million, net of $32 million cash acquired.\nShare repurchase program\nDuring fiscal 2021, we executed repurchases of 15 million shares of our common stock under our existing share repurchase program for an aggregate amount of $304 million.\nCash flows\nThe following table summarizes our cash flow activities in fiscal 2021, 2020 and 2019:\nFiscal Year\n(In millions) 2021 2020 2019\nNet cash provided by (used in):\nOperating activities $ 706 $ (861) $ 1,495\nInvesting activities $ (69) $ 11,379 $ (241)\nFinancing activities $ (1,903) $ (10,123) $ (1,209)\nIncrease (decrease) in cash and cash equivalents $ (1,244) $ 386 $ 17\nCash from operating activities\nFiscal 2021\nOur cash from operating activities in fiscal 2021 reflected net income of $554 million, adjusted by non-cash items, primarily consisting of amortization and depreciation of $150 million, impairments of current and long-lived assets of $90 million, stock-based compensation expense of $81 million, deferred income taxes of $42 million, and gain on sale of properties of $98 million.\nChanges in operating assets and liabilities during fiscal 2021 consisted primarily of the following:\nContract liabilities increased $118 million, primarily due to higher billings than recognized revenue.\nAccounts payable decreased $44 million, primarily due to a reduction in operating costs in connection with our November 2019 Plan, which was completed during fiscal 2021.\nIncome taxes payable decreased $299 million primarily due to tax payments made during fiscal 2021, including payments related to the Broadcom sale, payments of federal and foreign income taxes, and a decrease as a result of favorable tax rulings. During fiscal 2021, we made aggregate tax payments of $341 million related to these transactions.\nFiscal 2020\nOur cash flows for fiscal 2020 reflected net income of $3,887 million, adjusted by non-cash items, primarily consisting of gains on divestitures of $5,684 million and a gain on the sale of our equity method investment of $379 million, amortization and depreciation of $361 million, and stock-based compensation of $312 million.\nChanges in operating assets and liabilities during fiscal 2020 consisted primarily of the following:\nAccounts receivable decreased $583 million, primarily due to the collections of receivables related to our Enterprise Security solutions. Such receivables were not included in the assets that were sold in connection with the Broadcom sale.\nContract liabilities decreased $121 million, primarily due to seasonally higher recognized revenue from our Enterprise Security solutions than billings during the period prior to the Broadcom sale.\nAccrued compensation and benefits decreased $117 million, primarily due to a decrease in headcount as a result of the Broadcom sale and our restructuring activities.\nIncome taxes payable increased $383 million primarily due to taxes owed on the Broadcom sale and the sale of our DigiCert equity method investment. During fiscal 2020, we made aggregate tax payments of $2 billion related to these transactions.\nCash from investing activities\nOur cash flows used in investing activities in fiscal 2021 primarily consisted of payment for the Avira acquisition of $344 million, net of $32 million cash acquired, partially offset by proceeds from the sale of our Culver City and certain Mountain View properties of $218 million and proceeds from maturities and sales of short-term investments of $68 million.\nOur investing activities in fiscal 2020 primarily consisted of $10,918 million in net proceeds from the Broadcom sale and the divestiture of our ID Analytics solutions and $380 million from the sale of our equity method investment in DigiCert.\nCash from financing activities\nOur financing activities in fiscal 2021 primarily consisted of repayments of debt of $1,941 million in connection with the settlement of our 2.0% Convertible Notes, repayments of our 4.2% Senior Notes, and quarterly principal payments of our Initial Term Loan and Delayed Draw Term Loan, payment of dividends and dividend equivalents of $373 million, and repurchases of common stock of $304 million, partially offset by proceeds from issuance of debt of $750 million under our Delayed Draw Term Loan.\nOur financing activities in fiscal 2020 primarily consisted of payments of dividends and dividend equivalents of $7,481 million, repurchases of common stock of $1,581 million, debt repayments of $868 million, consisting of $552 million in principal and a $316 million cash settlement of the equity rights associated with our Senior Convertible notes, and cash consideration of $546 million paid in connection with the exchange of convertible debt.\nCash requirements\nDebt - As of April 2, 2021, our total outstanding principal amount of indebtedness is summarized as follows. See Note 10 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information about our debt.\n(In millions) April 2, 2021\nTerm Loans $ 1,235\nSenior Notes\n1,500\nConvertible Senior Notes 875\nMortgage Loans 10\nTotal debt $ 3,620\nDebt covenant compliance - The credit agreement we entered into in November 2019, which was amended and extended through May 2026 on May 7, 2021, contains customary representations and warranties, non-financial covenants for financial reporting, affirmative and negative covenants, including a covenant that we maintain a consolidated leverage ratio of not more than 5.25 to 1.0, or 5.75 to 1.0 if we acquire assets or business in an aggregate amount greater than $250 million, and restrictions on indebtedness, liens, investments, stock repurchases, and dividends (with exceptions permitting our regular quarterly dividend and other specific capital returns). As of April 2, 2021, we were in compliance with all debt covenants.\nDividends - On May 10, 2021, we announced a cash dividend of $0.125 per share of common stock to be paid in June 2021. Any future dividends will be subject to the approval of our Board of Directors.\nStock repurchases - Under our stock repurchase program, we may purchase shares of our outstanding common stock through accelerated stock repurchase transactions, open market transactions (including through trading plans intended to qualify under Rule 10b5-1 under the Exchange Act,) and privately-negotiated transactions. As of April 2, 2021, the remaining balance of our stock repurchase authorization is $274 million and does not have an expiration date. On May 4, 2021, our Board of Directors approved an incremental share repurchase authorization of $1,500 million, bringing the total authorized amount under the stock repurchase program to $1,774 million. The authorization does not have an expiration date. The timing and actual number of shares repurchased will depend on a variety of factors, including price, general business and market conditions, and other investment opportunities.\nRestructuring - Under our restructuring plans approved by our Board of Directors in November 2019 and December 2020, we have incurred cash expenditures primarily for severance and termination benefits, contract terminations, and other exit and disposal costs. The November 2019 Plan was completed in fiscal 2021 with total cash payments of $139 million during the fiscal year. As of April 2, 2021, we estimate that we will incur total costs up to $20 million in connection with the December 2020 Plan. During fiscal 2021, we made $9 million in cash payments related to the December 2020 Plan. These actions are expected to be\ncompleted in fiscal 2022. See Note 12 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further cash flow information associated with our restructuring activities.\nContractual obligations\nThe following is a schedule of our significant contractual obligations as of April 2, 2021, including those associated with our discontinued operations. The expected timing of payments of the obligations in the following table is estimated based on current information. Timing of payments and actual amounts paid may be different, depending on the time of receipt of goods or services, or changes to agreed-upon amounts for some obligations.\nPayments Due by Period\n(In millions) Total Less than 1 Year 1 - 3 Years 3 - 5 Years Over 5 Years\nDebt $ 3,620 $ 313 $ 1,153 $ 2,149 $ 5\nInterest payments on debt (1)\n367 110 162 94 1\nPurchase obligations (2)\n380 296 70 9 5\nDeemed repatriation taxes (3)\n594 69 196 329 -\nOperating leases (4)\n100 29 41 21 9\nTotal $ 5,061 $ 817 $ 1,622 $ 2,602 $ 20\n(1)Interest payments were calculated based on the contractual terms of the related Senior Notes, Convertible Senior Notes, and credit facility. Interest on variable rate debt was calculated using the interest rate in effect as of April 2, 2021. See Note 10 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information on the Senior Notes, Convertible Senior Notes, and Term loans.\n(2)These amounts are associated with agreements for purchases of goods or services generally including agreements that are enforceable and legally binding and that specify all significant terms, including fixed or minimum quantities to be purchased; fixed, minimum, or variable price provisions; and the approximate timing of the transaction. The table above also includes agreements to purchase goods or services that have cancellation provisions requiring little or no payment. The amounts under such contracts are included in the table above because management believes that cancellation of these contracts is unlikely, and we expect to make future cash payments according to the contract terms or in similar amounts for similar materials.\n(3)These amounts represent the transition tax on previously untaxed foreign earnings of foreign subsidiaries under the Tax Cuts and Jobs Act which may be paid through July 2025.\n(4)We have entered into various non-cancelable operating lease agreements that expire on various dates through fiscal 2028. The amounts in the table above exclude expected sublease income. See Note 9 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information on leases.\nDue to the uncertainty with respect to the timing of future cash flows associated with our unrecognized tax benefits and other long-term taxes as of April 2, 2021, we are unable to make reasonably reliable estimates of the period of cash settlement with the respective taxing authorities. Therefore, $525 million in long-term income taxes payable has been excluded from the contractual obligations table. See Note 13 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information.\nIndemnifications\nIn the ordinary course of business, we may provide indemnifications of varying scope and terms to customers, vendors, lessors, business partners, subsidiaries, and other parties with respect to certain matters, including, but not limited to, losses arising out of our breach of agreements or representations and warranties made by us. In connection with the sale of Veritas and the sale of our Enterprise Security business to Broadcom, we assigned several leases to Veritas Technologies LLC or Broadcom and/or their related subsidiaries. In addition, our bylaws contain indemnification obligations to our directors, officers, employees, and agents, and we have entered into indemnification agreements with our directors and certain of our officers to give such directors and officers additional contractual assurances regarding the scope of the indemnification set forth in our bylaws and to provide additional procedural protections. We maintain director and officer insurance, which may cover certain liabilities arising from our obligation to indemnify our directors and officers. Refer to Note 18 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information on our indemnifications.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nWe are exposed to various market risks related to fluctuations in interest rates and foreign currency exchange rates. We may use derivative financial instruments to mitigate certain risks in accordance with our investment and foreign exchange policies. We do not use derivatives or other financial instruments for trading or speculative purposes.\nInterest rate risk\nOur short-term investments and cash equivalents primarily consist of corporate bonds and certificate of deposits, respectively. A change in interest could have an adverse impact on their market value. As of April 2, 2021, the carrying value and fair value of our short-term investments and cash equivalents was $18 million. A hypothetical change in the yield curve of 100 basis points would not result in a significant reduction in fair value.\nAs of April 2, 2021, we had $2.4 billion in aggregate principal amount of fixed-rate Senior Notes and convertible debt outstanding, with a carrying amount and a fair value of $2.4 billion, based on Level 2 inputs. Since these notes bear interest at\nfixed rates, they do not result in any financial statement risk associated with changes in interest rates. However, the fair value of these notes fluctuates when interest rates change.\nAs of April 2, 2021, we also had $1.2 billion outstanding debt with variable interest rates based on the London InterBank Offered Rate (LIBOR). A reasonably possible hypothetical adverse change of 100 basis points in LIBOR would not result in a significant increase in interest expense on an annualized basis.\nIn addition, we have a $1 billion revolving credit facility that if drawn bears interest at a variable rate based on LIBOR and would be subject to the same risks associated with adverse changes in LIBOR.\nForeign currency exchange rate risk\nWe conduct business in numerous currencies through our worldwide operations, and our entities hold monetary assets or liabilities, earn revenues, or incur costs in currencies other than the entity’s functional currency, primarily in Euro, Japanese Yen, British Pound, Israeli New Shekel, Swiss Franc, Singapore Dollar and Indian Rupee. In addition, we charge our international subsidiaries for their use of intellectual property and technology and for certain corporate services we provide. Our cash flow, results of operations and certain of our intercompany balances that are exposed to foreign exchange rate fluctuations may differ materially from expectations, and we may record significant gains or losses due to foreign currency fluctuations and related hedging activities. As a result, we are exposed to foreign exchange gains or losses which impacts our operating results.\nWe have a foreign exchange exposure management program designed to identify material foreign currency exposures, manage these exposures, and reduce the potential effects of currency fluctuations on our results of operations through which we enter into foreign exchange forward contracts on our assets and liabilities denominated in currencies other than the functional currency of our subsidiaries with up to twelve months in duration. We do not use derivative financial instruments for speculative trading purposes, nor do we hedge our foreign currency exposure in a manner that entirely offsets the effects of the changes in foreign exchange rates. The gains and losses on these foreign exchange contracts are recorded in Other income (expense), net in the Consolidated Statements of Operations.\nAs of April 2, 2021 and April 3, 2020, we had open foreign currency forward contracts with notional amounts of $338 million and $419 million, respectively, to hedge foreign currency balance sheet exposure, with an insignificant fair value. A hypothetical ten percent depreciation of foreign currency would result in a reduction in fair value of our forward contracts of $20 million and $30 million for fiscal 2021 and fiscal 2020, respectively. This analysis disregards the possibilities that the rates can move in opposite directions and that losses from one geographic area may be offset by gains from another geographic area.\nAdditional information with respect to our derivative instruments is included in Note 11 of the Notes to the Consolidated Financial Statements in this Annual Report on Form 10-K.",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nThe Consolidated Financial Statements and related disclosures included in Part IV, Item 15 of this annual report are incorporated by reference into this Item 8.\nThe selected quarterly financial data is no longer required, as we have elected to early adopt the amendment to Item 302 of Regulation S-K contained in SEC Release No. 33-10890, which became effective on February 10, 2021. There were no material retrospective changes to any quarters in the two most recent fiscal years that would require this disclosure.",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A. Controls and Procedures\na) Evaluation of Disclosure Controls and Procedures\nThe SEC defines the term “disclosure controls and procedures” to mean a company’s controls and other procedures that are designed to ensure that information required to be disclosed in the reports that it files or submits under the Exchange Act is recorded, processed, summarized, and reported, within the time periods specified in the SEC’s rules and forms. “Disclosure controls and procedures” include, without limitation, controls and procedures designed to ensure that information required to be disclosed by an issuer in the reports that it files or submits under the Exchange Act is accumulated and communicated to the issuer’s management, including its principal executive and principal financial officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure. Our disclosure controls and procedures are designed to provide reasonable assurance that such information is accumulated and communicated to our management. Our management (with the participation of our Chief Executive Officer and Chief Financial Officer) has conducted an evaluation of the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) of the Securities Exchange Act).\nBased on such evaluation, our Chief Executive Officer and our Chief Financial Officer have concluded that our disclosure controls and procedures were effective at the reasonable assurance level as of the end of the period covered by this report.\nb) Management’s Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act) for NortonLifeLock. Our management, with the participation of our Chief Executive Officer and our Chief Financial Officer, has conducted an evaluation of the effectiveness of our internal control over financial reporting as of April 2, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”).\nWe acquired Avira during January 2021. Management excluded Avira from its assessment of the effectiveness of NortonLifeLock Inc.’s internal control over financial reporting as of April 2, 2021. Total assets and total revenues of Avira represent approximately 1%, or $67 million and 1%, or $21 million, respectively, of the related consolidated financial statement amounts as of, and for the year ended, April 2, 2021. Management did not assess the effectiveness of internal control over financial reporting at Avira due to the complexity associated with assessing internal control during integration efforts as well as the limited amount of time between the transaction date and the assessment date of April 2, 2021.\nOur management has concluded that, as of April 2, 2021, our internal control over financial reporting was effective at the reasonable assurance level based on these criteria.\nThe effectiveness of our internal control over financial reporting as of April 2, 2021 has been audited by KPMG LLP, an independent registered public accounting firm, as stated in their report, which is included in Part IV, Item 15 of this Annual Report on Form 10-K.\nc) Changes in Internal Control over Financial Reporting\nThere were no changes in our internal control over financial reporting during the quarter ended April 2, 2021, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. We have not experienced any significant impact to our internal controls over financial reporting despite the fact that a significant number of employees continue to work remotely due to the COVID-19 pandemic. The design of our processes and controls allow for remote execution with accessibility to secure data. We are continually monitoring and assessing the COVID-19 situation to minimize the impact, if any, on the design and operating effectiveness on our internal controls.\nd) Limitations on Effectiveness of Controls\nOur management, including our Chief Executive Officer and Chief Financial Officer, does not expect that our disclosure controls and procedures or our internal controls will prevent all errors and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within our company have been detected.",
    "item_9B": "Item 9B. Other Information\nNone.\nPART III",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nThe information required by this item will be included under the caption “Directors, Executive Officers, and Corporate Governance” in our proxy statement for the 2021 Annual Meeting to be filed with the SEC within 120 days of the fiscal year ended April 2, 2021 (the 2021 Proxy Statement) and is incorporated herein by reference. With regard to the information required by this item regarding compliance with Section 16(a) of the Exchange Act, we will provide disclosure of delinquent Section 16(a) reports, if any, in the 2021 Proxy Statement, and such disclosure, if any, is incorporated herein by reference.",
    "item_11": "Item 11. Executive Compensation\nThe information required by this item will be included under the caption “Executive Compensation” in our 2021 Proxy Statement and is incorporated herein by reference.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this item will be included under the caption “Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters” in our 2021 Proxy Statement and is incorporated herein by reference.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by this item will be included under the caption “Certain Relationships and Related Transactions, and Director Independence” in our 2021 Proxy Statement and is incorporated herein by reference.",
    "item_14": "Item 14. Principal Accountant Fees and Services\nThe information required by this item will be included under the caption “Principal Accountant Fees and Services” in our 2021 Proxy Statement and is incorporated herein by reference.\nPART IV",
    "item_15": "Item 15. Exhibits, Financial Statement Schedules\n(a)\n(1). Financial Statements\nUpon written request, we will provide, without charge, a copy of this annual report, including the Consolidated Financial Statements and financial statement schedule. All requests should be sent to:\nNortonLifeLock Inc.\nAttn: Investor Relations\n60 E. Rio Salado, Suite 1000\nTempe, Arizona 85281\n(650) 527-8000\nThe following documents are filed as part of this report:\nPage\n1. Consolidated Financial Statements:\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets\nConsolidated Statements of Operations\nConsolidated Statements of Comprehensive Income (Loss)\nConsolidated Statements of Stockholders’ Equity (Deficit)\nConsolidated Statements of Cash Flows\nNotes to the Consolidated Financial Statements\nNote 1. Description of Business and Significant Accounting Policies\nNote 2. Recent Accounting Standards\nNote 3. Divestitures, Discontinued Operations and Assets Held for Sale\nNote 4. Acquisitions\nNote 5. Revenues\nNote 6. Goodwill and Intangible Assets\nNote 7. Supplementary Information\nNote 8. Financial Instruments and Fair Value Measurements\nNote 9. Leases\nNote 10. Debt\nNote 11. Derivatives\nNote 12. Restructuring, Transition and Other Costs\nNote 13. Income Taxes\nNote 14. Stockholders’ Equity\nNote 15. Stock-Based Compensation and Other Benefit Plans\nNote 16. Net Income Per Share\nNote 17. Segment and Geographic Information\nNote 18. Commitments and Contingencies\nNote 19. Subsequent Events\nFinancial statement schedules have been omitted since they are either not required, not applicable, or the information is otherwise included.\n2. Exhibits: The information required by this Item is set forth in the Exhibit Index that precedes the signature page of this Annual Report.\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nNortonLifeLock Inc.:\nOpinions on the Consolidated Financial Statements and Internal Control Over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of NortonLifeLock Inc. and subsidiaries (the Company) as of April 2, 2021 and April 3, 2020, the related consolidated statements of operations, comprehensive income (loss), stockholders’ equity (deficit), and cash flows for each of the years in the three-year period ended April 2, 2021, and the related notes (collectively, the consolidated financial statements). We also have audited the Company’s internal control over financial reporting as of April 2, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of April 2, 2021 and April 3, 2020, and the results of its operations and its cash flows for each of the years in the three-year period ended April 2, 2021, in conformity with U.S. generally accepted accounting principles. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of April 2, 2021 based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nThe Company acquired Avira during 2021, and management excluded from its assessment of the effectiveness of the Company’s internal control over financial reporting as of April 2, 2021, Avira’s internal control over financial reporting associated with total assets and total revenues of approximately 1%, or $67 million and 1%, or $21 million, respectively, included in the consolidated financial statements of the Company as of and for the year ended April 2, 2021. Our audit of internal control over financial reporting of the Company also excluded an evaluation of the internal control over financial reporting of Avira.\nBasis for Opinions\nThe Company’s management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management's Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s consolidated financial statements and an opinion on the Company’s internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nAssessment of uncertain tax positions\nAs discussed in Notes 1 and 13 to the consolidated financial statements, as of April 2, 2021 the Company recognized uncertain tax positions. The Company recognizes tax benefits from uncertain tax positions when there is more than a 50% likelihood that the tax position will be sustained upon examination by the taxing authorities based on the technical merits of the position. As of April 2, 2021, the Company has recorded a liability for gross unrecognized tax benefits, of $558 million.\nWe identified the assessment of uncertain tax positions as a critical audit matter. Complex auditor judgment, including the involvement of tax professionals with specialized skills and knowledge, was required to evaluate the Company’s interpretation and application of tax law globally across its multiple subsidiaries.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls over the Company’s uncertain tax positions process, including controls related to the interpretation of tax law, its application in the liability estimation process, and determination of the final uncertain tax position. We involved tax professionals with specialized skills and knowledge, who assisted in:\n● Obtaining an understanding of the Company’s overall tax structure across multiple subsidiaries and assessing the Company’s compliance with tax laws globally,\n● Evaluating changes in tax law, and assessing the interpretation under the relevant jurisdictions’ tax law,\n● Inspecting settlements with taxing authorities to assess the Company’s determination of its tax positions and having more than a 50% likelihood to be sustained upon examination, and\n● Performing an assessment of the Company’s tax positions and comparing the results of the Company’s assessment.\nIn addition, we evaluated the Company’s ability to accurately estimate its gross unrecognized tax benefits by comparing historical gross unrecognized tax benefits to actual outcome upon conclusion of tax examinations.\n/s/ KPMG LLP\nWe have served as the Company’s auditor since 2002.\nSanta Clara, California\nMay 21, 2021\nNORTONLIFELOCK INC.\nCONSOLIDATED BALANCE SHEETS\n(In millions, except par value per share amounts)\nApril 2, 2021 April 3, 2020\nASSETS\nCurrent assets:\nCash and cash equivalents $ 933 $ 2,177\nShort-term investments 18 86\nAccounts receivable, net 117 111\nOther current assets 237 435\nAssets held for sale 233 270\nTotal current assets 1,538 3,079\nProperty and equipment, net 78 238\nOperating lease assets 76 88\nIntangible assets, net 1,116 1,067\nGoodwill 2,867 2,585\nOther long-term assets 686 678\nTotal assets $ 6,361 $ 7,735\nLIABILITIES AND STOCKHOLDERS’ EQUITY (DEFICIT)\nCurrent liabilities:\nAccounts payable $ 52 $ 87\nAccrued compensation and benefits 107 115\nCurrent portion of long-term debt 313 756\nContract liabilities 1,210 1,049\nCurrent operating lease liabilities 26 28\nOther current liabilities 428 587\nTotal current liabilities 2,136 2,622\nLong-term debt 3,288 3,465\nLong-term contract liabilities 55 27\nDeferred income tax liabilities 137 149\nLong-term income taxes payable 1,119 1,310\nLong-term operating lease liabilities 66 73\nOther long-term liabilities 60 79\nTotal liabilities 6,861 7,725\nCommitments and contingencies (Note 18)\nStockholders’ equity (deficit):\nCommon stock and additional paid-in capital, $0.01 par value: 3,000 shares authorized; 580 and 589 shares issued and outstanding as of April 2, 2021 and April 3, 2020, respectively\n2,229 3,356\nAccumulated other comprehensive income (loss) 47 (16)\nRetained earnings (accumulated deficit) (2,776) (3,330)\nTotal stockholders’ equity (deficit) (500) 10\nTotal liabilities and stockholders’ equity (deficit) $ 6,361 $ 7,735\nThe accompanying Notes to the Consolidated Financial Statements are an integral part of these statements.\nNORTONLIFELOCK INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(In millions, except per share amounts)\nYear Ended\nApril 2, 2021 April 3, 2020 March 29, 2019\nNet revenues $ 2,551 $ 2,490 $ 2,456\nCost of revenues 362 393 455\nGross profit 2,189 2,097 2,001\nOperating expenses:\nSales and marketing 576 701 712\nResearch and development 267 328 420\nGeneral and administrative 215 368 410\nAmortization of intangible assets 74 79 80\nRestructuring, transition and other costs 161 266 221\nTotal operating expenses 1,293 1,742 1,843\nOperating income 896 355 158\nInterest expense (144) (196) (208)\nOther income (expense), net 120 660 (57)\nIncome (loss) from continuing operations before income taxes 872 819 (107)\nIncome tax expense 176 241 3\nIncome (loss) from continuing operations 696 578 (110)\nIncome (loss) from discontinued operations (142) 3,309 141\nNet income $ 554 $ 3,887 $ 31\nIncome (loss) per share - basic:\nContinuing operations $ 1.18 $ 0.94 $ (0.17)\nDiscontinued operations $ (0.24) $ 5.38 $ 0.22\nNet income per share - basic (1)\n$ 0.94 $ 6.32 $ 0.05\nIncome (loss) per share - diluted:\nContinuing operations $ 1.16 $ 0.90 $ (0.17)\nDiscontinued operations $ (0.24) $ 5.15 $ 0.22\nNet income per share - diluted (1)\n$ 0.92 $ 6.05 $ 0.05\nWeighted-average shares outstanding:\nBasic 589 615 632\nDiluted 600 643 632\n(1) Net income per share amounts may not add due to rounding.\nThe accompanying Notes to the Consolidated Financial Statements are an integral part of these statements.\nNORTONLIFELOCK INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME (LOSS)\n(In millions)\nYear Ended\nApril 2, 2021 April 3, 2020 March 29, 2019\nNet income $ 554 $ 3,887 $ 31\nOther comprehensive income (loss), net of taxes:\nForeign currency translation adjustments 63 (11) (13)\nUnrealized gain on available-for-sale securities - 1 3\nOther comprehensive income (loss) from equity method investee - 1 (1)\nOther comprehensive income (loss), net of taxes 63 (9) (11)\nComprehensive income $ 617 $ 3,878 $ 20\nThe accompanying Notes to the Consolidated Financial Statements are an integral part of these statements.\nNORTONLIFELOCK INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY (DEFICIT)\n(In millions, except per share amounts)\nCommon Stock and Additional Paid-In Capital Accumulated Other Comprehensive Income (Loss) Retained Earnings (Accumulated Deficit) Total Stockholders’ Equity (Deficit)\nShares Amount\nBalance as of March 30, 2018 624 $ 4,691 $ 4 $ 328 $ 5,023\nCumulative effect from adoption of accounting standards - - - 939 939\nNet income 31 31\nOther comprehensive income (loss) - - (11) - (11)\nCommon stock issued under employee stock incentive plans 24 19 - - 19\nShares withheld for taxes related to vesting of restricted stock units (8) (173) - - (173)\nRepurchases of common stock (10) (84) - (168) (252)\nCash dividends declared ($0.30 per share of common stock) and dividend equivalents accrued\n- - - (197) (197)\nStock-based compensation - 359 - - 359\nBalance as of March 29, 2019 630 4,812 (7) 933 5,738\nNet income - - - 3,887 3,887\nOther comprehensive income (loss) - - (9) - (9)\nCommon stock issued under employee stock incentive plans 32 123 - - 123\nShares withheld for taxes related to vesting of restricted stock units (4) (86) - - (86)\nRepurchases of common stock (69) (902) - (661) (1,563)\nCash dividends declared ($12.40 per share of common stock) and dividend equivalents accrued\n- (76) - (7,489) (7,565)\nStock-based compensation - 338 - - 338\nShort-swing profit disgorgement - 9 - - 9\nExchange and extinguishment of convertible debt - (862) - - (862)\nBalance as of April 3, 2020 589 3,356 (16) (3,330) 10\nNet income - - - 554 554\nOther comprehensive income (loss) - - 63 - 63\nCommon stock issued under employee stock incentive plans 8 24 - - 24\nShares withheld for taxes related to vesting of restricted stock units (2) (49) - - (49)\nRepurchases of common stock (15) (304) - - (304)\nCash dividends declared ($0.50 per share of common stock) and dividend equivalents accrued\n- (301) - - (301)\nStock-based compensation - 81 - - 81\nExtinguishment of convertible debt - (578) - - (578)\nBalance as of April 2, 2021 580 $ 2,229 $ 47 $ (2,776) $ (500)\nThe accompanying Notes to the Consolidated Financial Statements are an integral part of these statements.\nNORTONLIFELOCK INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In millions)\nYear Ended\nApril 2, 2021 April 3, 2020 March 29, 2019\nOPERATING ACTIVITIES:\nNet income $ 554 $ 3,887 $ 31\nAdjustments:\nAmortization and depreciation 150 361 615\nImpairments and write-offs of current and long-lived assets 90 74 10\nStock-based compensation expense 81 312 352\nDeferred income taxes 42 16 (70)\nGain on extinguishment of debt (20) - -\nLoss from equity interest - 31 101\nGain on divestitures - (5,684) -\nGain on sale of equity method investment - (379) -\nGain on sale of properties (98) - -\nNon-cash operating lease expense 22 40 -\nOther 52 (4) (14)\nChanges in operating assets and liabilities, net of acquisitions:\nAccounts receivable, net 3 583 113\nAccounts payable (44) (61) 6\nAccrued compensation and benefits (10) (117) 2\nContract liabilities 118 (121) 196\nIncome taxes payable (299) 383 67\nOther assets 144 (81) (26)\nOther liabilities (79) (101) 112\nNet cash provided by (used in) operating activities 706 (861) 1,495\nINVESTING ACTIVITIES:\nPurchases of property and equipment (6) (89) (207)\nPayments for acquisitions, net of cash acquired (344) - (180)\nProceeds from divestitures, net of cash contributed and transaction costs - 10,918 -\nProceeds from the maturities and sales of short-term investments 68 167 139\nProceeds from sales of properties 218 - 26\nProceeds from sale of equity method investment - 380 -\nOther (5) 3 (19)\nNet cash provided by (used in) investing activities (69) 11,379 (241)\nFINANCING ACTIVITIES:\nRepayments of debt and related equity component (1,941) (868) (600)\nProceeds from issuance of debt, net of issuance costs 750 300 -\nNet proceeds from sales of common stock under employee stock incentive plans 24 123 19\nTax payments related to restricted stock units (58) (78) (173)\nDividends and dividend equivalents paid (373) (7,481) (217)\nRepurchase of common stock (304) (1,581) (234)\nCash consideration paid in exchange of convertible debt - (546) -\nShort-swing profit disgorgement - 9 -\nOther (1) (1) (4)\nNet cash used in financing activities (1,903) (10,123) (1,209)\nEffect of exchange rate fluctuations on cash and cash equivalents 22 (9) (28)\nChange in cash and cash equivalents (1,244) 386 17\nBeginning cash and cash equivalents 2,177 1,791 1,774\nEnding cash and cash equivalents $ 933 $ 2,177 $ 1,791\nThe accompanying Notes to the Consolidated Financial Statements are an integral part of these statements.\nNORTONLIFELOCK INC.\nNotes to the Consolidated Financial Statements\nNote 1. Description of Business and Significant Accounting Policies\nBusiness\nNortonLifeLock, Inc. is a leading provider of consumer Cyber Safety solutions globally. We help customers protect their devices, online privacy, identity and home networks.\nBasis of presentation\nThe accompanying Consolidated Financial Statements of NortonLifeLock and our wholly-owned subsidiaries are prepared in conformity with generally accepted accounting principles in the United States (GAAP). All significant intercompany accounts and transactions have been eliminated in consolidation.\nFiscal calendar\nWe have a 52/53-week fiscal year ending on the Friday closest to March 31. Our fiscal year 2020 consisted of 53 weeks, whereas fiscal years 2021 and 2019 were each 52-week years.\nUse of estimates\nThe preparation of Consolidated Financial Statements in conformity with GAAP requires management to make estimates and assumptions that affect the amounts reported in the Consolidated Financial Statements and accompanying Notes. Such estimates include, but are not limited to, valuation of business combinations including acquired intangible assets and goodwill, loss contingencies, the recognition and measurement of current and deferred income taxes, including the measurement of uncertain tax positions, and valuation of assets and liabilities and results of operations of our discontinued operations. On an ongoing basis, management determines these estimates and assumptions based on historical experience and on various other assumptions that are believed to be reasonable. Third-party valuation specialists are also utilized for certain estimates. Actual results could differ from such estimates and assumptions due to risks and uncertainties, including uncertainty in the current economic environment due to the COVID-19 pandemic, and such differences may be material to the Consolidated Financial Statements.\nSignificant Accounting Policies\nWith the exception of those discussed in Note 2, there were no material changes in accounting pronouncements issued by the Financial Accounting Standards Board (FASB) that were applicable or adopted by us during the fiscal 2021.\nRevenue recognition\nWe sell products and services directly to end-users and packaged software products through a multi-tiered distribution channel. We recognize revenue when control of the promised products or services is transferred to our customers, in an amount that reflects the consideration we expect to be entitled to in exchange for such products or services. Performance periods are generally one year or less, and payments are generally collected up front. Revenue is recognized net of allowances for partner incentives and rebates, and any taxes collected from customers and subsequently remitted to governmental authorities.\nWe offer various channel rebates for our products. Our estimated reserves for channel volume incentive rebates are based on distributors’ and resellers’ performance compared to the terms and conditions of volume incentive rebate programs, which are typically entered into quarterly. Our reserves for rebates are estimated based on the terms and conditions of the promotional program, actual sales during the promotion, the amount of redemptions received, historical redemption trends by product and by type of promotional program, and the value of the rebate. We record estimated reserves for rebates as an offset to revenue or contract liabilities. Reserves for rebates, recorded in Other current liabilities, were $6 million and $10 million as of April 2, 2021 and April 3, 2020, respectively. For products that include content updates, rebates are recognized as a ratable offset to revenue or contract liabilities over the term of the subscription.\nPerformance obligations\nAt contract inception, we assess the products and services promised in the contract to identify each performance obligation and evaluate whether the performance obligations are capable of being distinct and are distinct within the context of the contract. Performance obligations that are not both capable of being distinct and are distinct within the context of the contract are combined and treated as a single performance obligation in determining the allocation and recognition of revenue. Our software solutions typically consist of a term-based subscription as well as when-and-if available software updates and upgrades. We have determined that our promises to transfer the software license subscription and the related support and maintenance are not separately identifiable because:\n•the licensed software and the software updates and upgrades are highly interdependent and highly interrelated, working together to deliver continuously updated protection to customers;\n•by identifying and addressing new threats, the software updates and upgrades significantly modify the licensed software and are integral to maintaining its utility; and\n•given the rapid pace with which new threats are identified, the value of the licensed software diminishes rapidly without the software updates and upgrades.\nWe therefore consider the software license and related support obligations a single, combined performance obligation with revenue recognized over time as our solutions are delivered.\nFair value measurements\nFor assets and liabilities measured at fair value, fair value is the price that would be received from selling an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. When determining fair value, we consider the principal or most advantageous market in which we would transact, and we consider assumptions that market participants would use when pricing the asset or liability.\nThe three levels of inputs that may be used to measure fair value are:\n•Level 1: Quoted prices in active markets for identical assets or liabilities.\n•Level 2: Observable inputs other than Level 1 prices, such as quoted prices for similar assets or liabilities, quoted prices in less active markets or model-derived valuations. All significant inputs used in our valuations, such as discounted cash flows, are observable or can be derived principally from or corroborated with observable market data for substantially the full term of the assets or liabilities.\n•Level 3: Unobservable inputs to the valuation methodology that are significant to the measurement of the fair value of assets or liabilities. We monitor and review the inputs and results of these valuation models to help ensure the fair value measurements are reasonable and consistent with market experience in similar asset classes.\nAssets measured and recorded at fair value:\nCash equivalents. We consider all highly liquid investments with an original maturity of three months or less at the time of purchase to be cash equivalents. Cash equivalents are carried at amounts that approximate fair value due to the short period of time to maturity.\nShort-term investments. Short-term investments consist primarily of corporate bonds. They are classified as available-for-sale and recognized at fair value using Level 1 and Level 2 inputs, which are quoted using market prices, independent pricing vendors, or other sources, to determine the fair value. Unrealized gains and losses, net of tax, are included in Accumulated other comprehensive income (loss) (AOCI). We regularly review our investment portfolio to identify and evaluate investments that have indications of impairment. Available-for-sale debt securities with an amortized cost basis in excess of estimated fair value are assessed to determine what amount of that difference, if any, is caused by expected credit losses. Factors considered in determining if a credit loss exists include: the extent to which the fair value has been lower than the cost basis, any changes to the rating of the security by a rating agency, and any adverse financial conditions specifically related to the security. Expected credit losses on available-for-sale debt securities are recognized in Other income (expense), net in our Consolidated Statements of Operations, and any remaining unrealized losses, net of taxes, are included in AOCI in our Consolidated Statements of Stockholders’ Equity (Deficit).\nNon-marketable investments\nOur non-marketable investments consist of equity investments in privately-held companies without a readily determinable fair value. We measure these investments at cost minus impairment, if any, plus or minus changes resulting from observable price changes in orderly transactions for identical or similar investments of the same issuer. Gains and losses on these investments, whether realized or unrealized, are recognized in Other income (expense), net in our Consolidated Statements of Operations.\nWe assess the recoverability of our non-marketable investments by reviewing various indicators of impairment. If indicators are present, a fair value measurement is made by performing a discounted cash flow analysis of the investment. We immediately recognize the impairment to our non-marketable equity investments if the carrying value exceeds the fair value. For our equity method investment, if a decline in value is determined to be other than temporary, impairment is recognized and included in Other income (expense), net in our Consolidated Statements of Operations.\nAccounts receivable\nAccounts receivable are recorded at the invoiced amount and are not interest bearing. We maintain an allowance for doubtful accounts or expected credit losses to reserve for potentially uncollectible receivables. We review our accounts receivables by aging category to identify specific customers with known disputes or collectability issues. In addition, we maintain an allowance for all other receivables not included in the specific reserve by applying specific percentages of projected uncollectible receivables to the various aging categories. In determining these percentages, we use judgment based on our historical collection experience and current economic trends as well as reasonable and supportable forecasts of future economic conditions.\nAssets held for sale\nLong-lived assets held for sale are recorded as the lower of its carrying value or fair value less costs to sell. Fair value is determined based on discounted cash flows, appraised values or management’s estimates, depending upon the nature of the assets and external data available.\nProperty and equipment\nProperty, equipment, and leasehold improvements are stated at cost, net of accumulated depreciation. Depreciation is provided on a straight-line basis over the estimated useful lives. Estimated useful lives for financial reporting purposes are as follows: buildings, 20 to 30 years; building improvements, 7 to 20 years; leasehold improvements, the lesser of the life of the improvement or the initial lease term, and computer hardware and software, and office furniture and equipment, 3 to 5 years.\nSoftware development costs\nThe costs for the development of new software products and substantial enhancements to existing software products are expensed as incurred until technological feasibility has been established, at which time any additional costs would be capitalized in accordance with the accounting guidance for software. Because our current process for developing software is essentially completed concurrently with the establishment of technological feasibility, which occurs upon the completion of a working model, no costs have been capitalized for any of the periods presented.\nInternal-use software development costs\nWe capitalize qualifying costs incurred during the application development stage related to software developed for internal-use and amortize them over the estimated useful life of 3 years. We expense costs incurred related to the planning and post-implementation phases of development as incurred. As of April 2, 2021 and April 3, 2020, capitalized costs, net of amortization, were $9 million and $24 million, respectively.\nLeases\nWe determine if an arrangement is a lease at inception. We have elected to not recognize a lease liability or right-of-use (ROU) asset for short-term leases (leases with a term of twelve months or less that do not include an option to purchase the underlying asset). Operating lease ROU assets and operating lease liabilities are recognized based on the present value of the future minimum lease payments over the lease term at commencement date. The interest rate we use to determine the present value of future payments is our incremental borrowing rate because the rate implicit in our leases is not readily determinable. Our incremental borrowing rate is a hypothetical rate for collateralized borrowings in economic environments where the leased asset is located based on credit rating factors. Our operating lease assets also include adjustments for prepaid lease payments, lease incentives and initial direct costs.\nCertain lease contracts include obligations to pay for other services, such as operations and maintenance. We elected the practical expedient whereby we record all lease components and the related minimum non-lease components as a single lease component. Cash payments made for variable lease costs are not included in the measurement of our operating lease assets and liabilities. Many of our lease terms include one or more options to renew. We do not assume renewals in our determination of the lease term unless it is reasonably certain that we will exercise that option. Lease costs for minimum lease payments for operating leases are recognized on a straight-line basis over the lease term. Our lease agreements do not contain any residual value guarantees.\nBusiness combinations\nWe use the acquisition method of accounting under the authoritative guidance on business combinations. We allocate the purchase price of our acquisitions to the assets acquired and liabilities assumed based on their estimated fair values. The excess of the purchase price over the fair values of these identifiable assets and liabilities is recorded as goodwill. Acquisition-related expenses are recognized separately from the business combination and are expensed as incurred. Each acquired company’s operating results are included in our Consolidated Financial Statements starting on the date of acquisition.\nGoodwill\nGoodwill is recorded when consideration paid for an acquisition exceeds the fair value of net tangible and intangible assets acquired.\nWe perform an impairment assessment of goodwill at the reporting unit level at least annually in the fourth quarter of each fiscal year, or more frequently if events or changes in circumstances indicate that the asset may be impaired. The accounting guidance gives us the option to perform a qualitative assessment to determine whether further impairment testing is necessary. The qualitative assessment considers events and circumstances that might indicate that a reporting unit’s fair value is less than its carrying amount. If it is determined, as a result of the qualitative assessment, that it is more likely than not that the fair value of a reporting unit is less than its carrying amount, a quantitative test is performed.\nIn fiscal 2021, based on our qualitative assessments, we concluded that it is more likely than not that the fair values are more than their carrying values. Accordingly, there was no indication of impairment of goodwill, and further quantitative testing was not required.\nLong-lived assets\nIn connection with our acquisitions, we generally recognize assets for customer relationships, developed technology, finite-lived trade names, patents, and indefinite-lived trade names. Finite-lived intangible assets are carried at cost less accumulated amortization. Such amortization is provided on a straight-line basis over the estimated useful lives of the respective assets, generally from 1 to 9 years. Amortization for developed technology is recognized in cost of revenue. Amortization for customer relationships and certain trade names is recognized in operating expenses. Indefinite-lived intangible assets are not subject to amortization but instead tested for impairment annually or more frequently if events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable.\nLong-lived assets, including finite-lived intangible assets and property and equipment, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset or group may not be recoverable. The evaluation is performed at the lowest level of identifiable cash flows independent of other assets. An impairment loss is recognized when estimated undiscounted future cash flows generated from the assets are less than their carrying amount. Measurement of an impairment loss is based on the excess of the carrying amount of the asset group over its fair value.\nIn fiscal 2021, based on our qualitative assessments, we concluded that it is more likely than not that the fair values are more than their carrying values. Accordingly, there was no indication of impairment of long-lived assets, and further quantitative testing was not required.\nContract liabilities\nContract liabilities consist of deferred revenue and customer deposit liabilities and represent cash payments received or due in advance of fulfilling our performance obligations. Deferred revenue represents billings under non-cancelable contracts before the related product or service is transferred to the customer. Certain arrangements include terms that allow the customer to terminate the contract and receive a pro-rata refund for a period of time. In these arrangements, we have concluded there are no enforceable rights and obligations during the period in which the option to cancel is exercisable by the customer, and therefore the consideration received or due from the customer is recorded as a customer deposit liability.\nDebt\nOur debt includes senior unsecured notes, senior term loans, convertible senior notes, and a senior unsecured revolving credit facility. Our senior unsecured notes are recorded at par value at issuance less a discount representing the amount by which the face value exceeds the fair value at the date of issuance and an amount which represents issuance costs. Our senior term loans are recorded at par value less debt issuance costs, which are recorded as a reduction in the carrying value of the debt. Our convertible senior notes are recorded at par value less the fair value of the equity component of the notes, at their issuance date, determined using Level 2 inputs and less any issuance costs. The discount and issuance costs associated with the various notes are amortized using the effective interest rate method over the term of the debt as a non-cash charge to interest expense. Borrowings under our revolving credit facility, if any, are recognized at principal balance plus accrued interest based upon stated interest rates. Debt maturities are classified as current liabilities on our Consolidated Balance Sheets if we are contractually obligated to repay them in the next twelve months or, prior to the balance sheet date, we have the authorization and intent to repay them prior to their contractual maturities and within the next twelve months.\nTreasury stock\nWe account for treasury stock under the cost method. Shares repurchased under our share repurchase program are retired. Upon retirement, we allocate the value of treasury stock between Additional paid-in capital and Retained earnings.\nRestructuring\nRestructuring actions generally include significant actions involving employee-related severance charges, contract termination costs, and assets write-offs. Employee-related severance charges are largely based upon substantive severance plans, while some charges result from mandated requirements in certain foreign jurisdictions. These charges are reflected in the period when both the actions are probable, and the amounts are estimable. Contract termination costs reflect costs that will continue to be incurred under a contract for its remaining term without future economic benefit. These charges are reflected in the period when a contract is terminated. Asset impairments, including those related to ROU lease assets, are recognized in the period that an asset is decommissioned or a facility ceases to be used.\nIncome taxes\nWe compute the provision for income taxes using the asset and liability method, under which deferred tax assets and liabilities are recognized for the expected future tax consequences of temporary differences between the financial reporting and tax basis of assets and liabilities and for operating losses and tax credit carryforwards in each jurisdiction in which we operate. We measure deferred tax assets and liabilities using the currently enacted tax rates that apply to taxable income in effect for the years in which those tax assets are expected to be realized or settled.\nWe also assess the likelihood that deferred tax assets will be realized from future taxable income and based on weighting positive and negative evidence, we will assess and determine the need for a valuation allowance, if required. The determination of our valuation allowance involves assumptions, judgments, and estimates, including forecasted earnings, future taxable income, and the relative proportions of revenue and income before taxes in the various domestic and international jurisdictions in which we operate. To the extent we establish a valuation allowance or change the valuation allowance in a period, we reflect the change with a corresponding increase or decrease to our tax expense.\nWe record accruals for uncertain tax positions when we believe that it is not more likely than not that the tax position will be sustained on examination by the taxing authorities based on the technical merits of the position. We adjust these accruals when facts and circumstances change, such as the closing of a tax audit or the refinement of an estimate. The provision for income taxes includes the effects of adjustments for uncertain tax positions as well as any related interest and penalties.\nStock-based compensation\nWe measure and recognize stock-based compensation for all stock-based awards, including restricted stock units (RSU), performance-based restricted stock units (PRU), stock options, and rights to purchase shares under our employee stock purchase plan (ESPP), based on their estimated fair value on the grant date. We recognize the costs in our Consolidated\nFinancial Statements on a straight-line basis over the award’s requisite service period except for PRUs with graded vesting, for which we recognize the costs on a graded basis. For awards with performance conditions, the amount of compensation cost we recognize over the requisite service period is based on the actual or estimated achievement of the performance condition. We estimate the number of stock-based awards that will be forfeited due to employee turnover.\nThe fair value of each RSU and PRU that does not contain a market condition is equal to the market value of our common stock on the date of grant. The fair value of each PRU that contains a market condition is estimated using the Monte Carlo simulation model. The fair values of RSUs and PRUs are not discounted by the dividend yield because our RSUs and PRUs include dividend-equivalent rights. We use the Black-Scholes model to determine the fair value of stock options and the fair value of rights to acquire shares of common stock under our ESPP. The Black-Scholes valuation model incorporates a number of variables, including our expected stock price volatility over the expected life of the awards, actual and projected employee exercise and forfeiture behaviors, risk-free interest rates, and expected dividends.\nForeign currency\nFor foreign subsidiaries whose functional currency is the local currency, assets and liabilities are translated to U.S. dollars at exchange rates in effect at the balance sheet date. Gains and losses resulting from translation of these foreign currency financial statements into U.S. dollars are recorded in AOCI. Remeasurement adjustments are recorded in Other income (expense), net in our Consolidated Statements of Operations.\nConcentrations of risk\nA significant portion of our revenue is derived from international sales. Fluctuations of the U.S. dollar against foreign currencies, changes in local regulatory or economic conditions, or piracy could adversely affect our operating results.\nFinancial instruments that potentially subject us to concentrations of risk consist principally of cash and cash equivalents, short-term investments, and trade accounts receivable. Our investment policy limits the amount of credit risk exposure to any one issuer and to any one country. A majority of our trade receivables are derived from sales to distributors and retailers. The credit risk in our trade accounts receivable is substantially mitigated by our credit evaluation process, reasonably short collection terms, and the geographical dispersion of sales transactions. Customers which are distributors that accounted for over 10% of our net accounts receivable, are as follows:\nApril 2, 2021 April 3, 2020\nCustomer A 46 % 39 %\nAdvertising and other promotional costs\nAdvertising and other promotional costs are charged to operations as incurred and included in sales and marketing expenses. These costs totaled $353 million, $343 million, and $279 million for fiscal 2021, 2020, and 2019, respectively.\nContingencies\nWe evaluate contingent liabilities including threatened or pending litigation in accordance with the authoritative guidance on contingencies. We assess the likelihood of any adverse judgments or outcomes from potential claims or proceedings, as well as potential ranges of probable losses, when the outcomes of the claims or proceedings are probable and reasonably estimable. A determination of the amount of an accrual required, if any, for these contingencies is made after the analysis of each separate matter. Because of uncertainties related to these matters, we base our estimates on the information available at the time of our assessment. As additional information becomes available, we reassess the potential liability related to our pending claims and litigation and may revise our estimates.\nNote 2. Recent Accounting Standards\nRecently adopted authoritative guidance\nCredit Losses. In June 2016, the Financial Accounting Standards Board (FASB) issued new authoritative guidance on credit losses which changes the impairment model for most financial assets and certain other instruments. On April 4, 2020, the first day of our fiscal 2021, we adopted the new guidance using the modified retrospective transition method. Upon adoption, we utilized a new forward-looking “expected loss” model to replace the incurred loss impairment model for our accounts receivable and other financial assets. Additionally, for available-for-sale debt securities with unrealized losses, we discontinued using the concept of “other than temporary” impairment and recognized the estimated credit loss as allowances. The adoption of this guidance did not have a material impact on our Consolidated Financial Statements.\nInternal-Use Software. In August 2018, the FASB issued new guidance that clarifies the accounting for implementation costs in a cloud computing arrangement. The new guidance aligns the requirements for capitalizing implementation costs incurred in a hosting arrangement that is a service contract with the requirements for capitalizing implementation costs incurred to develop or obtain internal-use software. On April 4, 2020, we adopted the new guidance prospectively. The adoption of this guidance did not have a material impact on our Consolidated Financial Statements.\nRecently issued authoritative guidance not yet adopted\nIncome taxes. In December 2019, the FASB issued new guidance that simplifies the accounting for income taxes by removing certain exceptions to the general principles in Topic 740. The guidance also clarifies and amends existing guidance to\nimprove consistent application. The standard will be effective for us in our first quarter of fiscal 2022. We do not believe the adoption of this guidance will have a material impact on our Consolidated Financial Statements.\nDebt with Conversion and Other options. In August 2020, the FASB issued new guidance that simplifies the accounting for certain financial instruments with characteristics of liabilities and equity, including convertible instruments. The new guidance removes from GAAP the separation models for convertible debt with embedded conversion features. As a result, after adopting the guidance, entities will no longer separately present embedded conversion features in equity. Instead, they will account for the convertible debt wholly as debt. The new guidance also requires use of the if-converted method when calculating the dilutive impact of convertible debt on earnings per share. The standard will be effective for us in our first quarter of fiscal 2023, with early adoption permitted beginning in the first quarter of fiscal 2022. It may be applied retrospectively to each prior period presented or retrospectively with cumulative effect recognized in retained earnings as of the date of adoption. We are currently evaluating the adoption date and the impact of the adoption of this guidance on our Consolidated Financial Statements and disclosures.\nReference Rate Reform. In March 2020, the FASB issued new guidance providing temporary optional expedients and exceptions to ease the financial reporting burden of the expected market transition from the London Interbank Offered Rate (LIBOR) and other interbank offered rates to alternative reference rates, such as the Secured Overnight Financing Rate. The standard was effective upon issuance and may generally be applied through December 31, 2022, to any new or amended contracts, hedging relationships, and other transactions that reference LIBOR. We continue to evaluate our contractual arrangements and hedging relationships that reference LIBOR.\nAlthough there are several other new accounting pronouncements issued or proposed by the FASB that we have adopted or will adopt, as applicable, we do not believe any of these accounting pronouncements has had, or will have, a material impact on our Consolidated Financial Statements or disclosures.\nNote 3. Divestitures, Discontinued Operations and Assets Held for Sale\nDivestitures\nEnterprise Security assets\nOn November 4, 2019, we completed the sale of certain of our Enterprise Security assets and certain liabilities to Broadcom Inc. (the Broadcom sale) for a purchase price of $10.7 billion. As a result of the sale, the majority of the results of our Enterprise Security business were classified as discontinued operations in our Consolidated Statements of Operations and thus excluded from both continuing operations and segment results for all periods presented. We recognized a gain on sale of $5,434 million, which was included in Income (loss) from discontinued operations in our Consolidated Statements of Operations. Total net assets sold was $5,211 million, consisting of goodwill, net intangible assets and other assets of $7,121 million, net of contract and other liabilities of $1,910 million.\nIn connection with the Broadcom sale, we entered into a transition services agreement under which we provided assistance to Broadcom including, but not limited to, business support services and information technology services. During fiscal 2021, the transition services were completed. Dedicated direct costs, net of charges to Broadcom, for these transition services were $9 million and $19 million during fiscal 2021 and 2020, respectively. These direct costs were presented as part of Other income (expense), net in the Consolidated Statements of Operations.\nOn October 1, 2020, we entered into multiple agreements with Broadcom for an aggregate amount of $200 million. We licensed Broadcom’s enterprise software, multiple security engines and related telemetry for 5.6 years, which will be amortized to continuing operations over the term of the license. In addition, we resolved all outstanding payments and certain claims related to the asset purchase and transition services agreements, which is included in discontinued operations.\nID Analytics solutions\nOn January 31, 2020, we completed the sale of our ID Analytics solutions for $375 million in net cash proceeds. We recognized a gain on sale of $250 million, which was included in Other income (expense), net in our Consolidated Statements of Operations. Total net assets sold was $125 million, consisting of goodwill and net intangible assets of $114 million and net other assets, net of other liabilities, of $11 million. We incurred tax expense of $86 million related to the gain.\nDiscontinued Operations\nThe following table presents information regarding certain components of income (loss) from discontinued operations, net of income taxes:\nYear Ended\n(In millions)\nApril 2, 2021 April 3, 2020 March 29, 2019\nNet revenues $ 1 $ 1,368 $ 2,288\nGross profit $ 1 $ 1,035 $ 1,693\nOperating income (loss) $ (177) $ 4 $ 234\nGain on sale $ - $ 5,434 $ -\nIncome (loss) before income taxes $ (176) $ 5,431 $ 228\nIncome tax expense (benefit) $ (34) $ 2,122 $ 87\nIncome (loss) from discontinued operations, net of taxes $ (142) $ 3,309 $ 141\nOur discontinued operations consist of our divested Enterprise Security assets and results of our previously divested Veritas information management business (Veritas). There was no income from Veritas during fiscal 2021 and 2020. During fiscal 2019, revenue from Veritas was $13 million and income from Veritas, net of taxes was $15 million.\nThe following table presents significant non-cash items and capital expenditures of discontinued operations:\nYear Ended\n(In millions) April 2, 2021 April 3, 2020 March 29, 2019\nAmortization and depreciation\n$ - $ 130 $ 368\nStock-based compensation expense\n$ 1 $ 172 $ 193\nPurchases of property and equipment $ - $ 43 $ 65\nAssets held for sale\nDuring fiscal 2020, we reclassified certain land and buildings previously reported as property and equipment to assets held for sale when the properties were approved for immediate sale in their present condition and the sale was expected to be completed within one year. As a result, we recognized an impairment of $24 million in fiscal 2020, which was included in restructuring costs, representing the difference between the estimated net sales price and the carrying value of one of our properties.\nOn July 27, 2020, we completed the sale of our Culver City property, which was previously classified as held for sale during the first quarter of fiscal 2021, for cash consideration of $118 million, net of selling costs, and recognized a gain on sale of $35 million.\nOn April 1, 2021, we completed the sale of certain land and buildings in Mountain View, which was previously classified as held for sale as of April 3, 2020, for cash consideration of $100 million, net of selling costs, and recognized a gain on sale of $63 million.\nWe continue to actively market the remaining properties for sale; however, in fiscal 2021, the real estate market was adversely affected by the COVID-19 pandemic, which delayed the expected timing of sale. We have taken into consideration the current real estate values and demand, and continue to execute plans to sell these properties. As of April 2, 2021, these assets are classified as assets held for sale. During fiscal 2021, there were no impairments because the fair value of the properties less costs to sell either equals or exceeds their carrying value.\nNote 4. Acquisitions\nFiscal 2021 acquisition\nOn January 8, 2021, we completed our acquisition of Avira. Avira provides a consumer-focused portfolio of cybersecurity and privacy solutions primarily in Europe and key emerging markets. The total aggregate consideration for the acquisition was $344 million, net of $32 million cash acquired.\nOur preliminary allocation of the aggregate purchase price for the acquisition as of January 8, 2021, was as follows:\n(In millions, except useful lives) January 8, 2021\nAssets:\nCurrent assets $ 12\nIntangible assets 151\nGoodwill 269\nOther long-term asset 21\nTotal assets acquired 453\nLiabilities:\nCurrent liabilities 29\nContract liabilities 54\nOther long-term obligations 26\nTotal liabilities assumed 109\nTotal purchase price $ 344\nThe allocation of the purchase price was based upon a preliminary valuation, and our estimates and assumptions are subject to refinement within the measurement period, which may be up to one year from the acquisition date. Adjustments to the purchase price allocation may require adjustments to goodwill prospectively. The primary areas of preliminary purchase price allocation that are not yet finalized are certain tax matters and intangible assets.\nThe preliminary goodwill of $269 million arising from the acquisition is attributed to the expected synergies, including future cost efficiencies, and other benefits that are expected to be generated by combining Avira and NortonLifeLock. Substantially all of the goodwill recognized is expected to be deductible for tax purposes. See Note 6 for further information on goodwill.\nNote 5. Revenues\nContract liabilities\nDuring fiscal 2021 and 2020, we recognized $1,050 million and $1,017 million of revenue, respectively, from the contract liabilities balance at the beginning of the respective fiscal years.\nRemaining performance obligations\nRemaining performance obligations represent contracted revenue that has not been recognized, which include contract liabilities and amounts that will be billed and recognized as revenue in future periods. As of April 2, 2021, we had $850 million of remaining performance obligations, which does not include customer deposit liabilities of $415 million, of which we expect to recognize approximately 94% as revenue over the next 12 months.\nSee Note 1 for a description of our revenue recognition policy and Note 17 for tabular disclosures of disaggregated revenue by solution and geographic region.\nNote 6. Goodwill and Intangible Assets\nGoodwill\nThe changes in the carrying amount of goodwill are as follows:\n(In millions)\nBalance as of March 29, 2019 $ 2,677\nDivestitures (88)\nOther adjustments (4)\nBalance as of April 3, 2020 2,585\nAcquisitions 269\nTranslation adjustments 13\nBalance as of April 2, 2021 $ 2,867\nIntangible assets, net\nApril 2, 2021 April 3, 2020\n(In millions) Gross\nCarrying\nAmount\nAccumulated\nAmortization\nNet\nCarrying\nAmount\nGross\nCarrying\nAmount\nAccumulated\nAmortization\nNet\nCarrying\nAmount\nCustomer relationships $ 556 $ (299) $ 257 $ 505 $ (230) $ 275\nDeveloped technology 210 (104) 106 133 (85) 48\nOther 7 (1) 6 - - -\nTotal finite-lived intangible assets 773 (404) 369 638 (315) 323\nIndefinite-lived trade names 747 - 747 744 - 744\nTotal intangible assets $ 1,520 $ (404) $ 1,116 $ 1,382 $ (315) $ 1,067\nAmortization expense for purchased intangible assets is summarized below:\nYear Ended Consolidated Statements of Operations Classification\n(In millions) April 2, 2021 April 3, 2020 March 29, 2019\nCustomer relationships and other $ 74 $ 79 $ 80 Operating expenses\nDeveloped technology 31 30 30 Cost of revenues\nTotal $ 105 $ 109 $ 110\nAs of April 2, 2021, future amortization expense related to intangible assets that have finite lives is as follows by fiscal year:\n(In millions) April 2, 2021\n2022 $ 119\n2023 99\n2024 86\n2025 27\n2026 22\nThereafter 16\nTotal $ 369\nNote 7. Supplementary Information\nCash and cash equivalents:\n(In millions) April 2, 2021 April 3, 2020\nCash $ 650 $ 483\nCash equivalents 283 1,694\nTotal cash and cash equivalents $ 933 $ 2,177\nAccounts receivable, net:\n(In millions) April 2, 2021 April 3, 2020\nAccounts receivable $ 118 $ 123\nAllowance for doubtful accounts (1) (12)\nAccounts receivable, net $ 117 $ 111\nOther current assets:\n(In millions) April 2, 2021 April 3, 2020\nPrepaid expenses $ 95 $ 110\nIncome tax receivable and prepaid income taxes 96 150\nOther tax receivable 31 88\nOther 15 87\nTotal other current assets $ 237 $ 435\nProperty and equipment, net:\n(In millions) April 2, 2021 April 3, 2020\nLand $ 3 $ 7\nComputer hardware and software 479 746\nOffice furniture and equipment 63 88\nBuildings 29 108\nLeasehold improvements 58 128\nConstruction in progress 1 1\nTotal property and equipment, gross 633 1,078\nAccumulated depreciation and amortization (555) (840)\nTotal property and equipment, net $ 78 $ 238\nDuring 2021, we completed the sale of certain properties with total carrying value of $120 million, including land, buildings, furniture and fixtures, and leasehold improvements, of which $37 million was classified as held for sale and $83 million was included in property and equipment as of April 3, 2020. See Note 3 for further information on the sale.\nDepreciation and amortization expense of property and equipment was $45 million, $122 million, and $139 million in fiscal 2021, 2020, and 2019, respectively.\nOther long-term assets:\n(In millions) April 2, 2021 April 3, 2020\nNon-marketable equity investments $ 185 $ 187\nLong-term income tax receivable and prepaid income taxes 30 38\nDeferred income tax assets 355 387\nLong-term prepaid royalty 70 15\nOther 46 51\nTotal other long-term assets $ 686 $ 678\nShort-term contract liabilities:\n(In millions) April 2, 2021 April 3, 2020\nDeferred revenue $ 795 $ 709\nCustomer deposit liabilities 415 340\nTotal short-term contract liabilities $ 1,210 $ 1,049\nOther current liabilities:\n(In millions) April 2, 2021 April 3, 2020\nIncome taxes payable $ 111 $ 195\nOther taxes payable 82 141\nOther accrued liabilities 235 251\nTotal other current liabilities $ 428 $ 587\nLong-term income taxes payable:\n(In millions) April 2, 2021 April 3, 2020\nDeemed repatriation tax payable $ 525 $ 615\nOther long-term income taxes 29 -\nUncertain tax positions (including interest and penalties) 565 695\nTotal long-term income taxes payable $ 1,119 $ 1,310\nOther income (expense), net:\nYear Ended\n(In millions) April 2, 2021 April 3, 2020 March 29, 2019\nInterest income $ 4 $ 80 $ 42\nLoss from equity interest - (31) (101)\nForeign exchange gain (loss) 1 (6) (11)\nGain on divestitures - 250 -\nGain on sale of equity method investment - 379 -\nGain on early extinguishment of debt 20 - -\nGain on sale of properties 98 - -\nTransition service expense, net (9) (19) -\nOther 6 7 13\nTotal other income (expense), net $ 120 $ 660 $ (57)\nSupplemental cash flow information:\nYear Ended\n(In millions) April 2, 2021 April 3, 2020 March 29, 2019\nIncome taxes paid, net of refunds $ 341 $ 1,985 $ 112\nInterest expense paid $ 139 $ 179 $ 183\nCash paid for amounts included in the measurement of operating lease liabilities $ 34 $ 51 $ -\nNon-cash operating activities:\nOperating lease assets obtained in exchange for operating lease liabilities $ 34 $ 15 $ -\nReduction of operating lease assets as a result of lease terminations and modifications $ 26 $ 34 $ -\nNon-cash investing and financing activities:\nPurchases of property and equipment in current liabilities $ - $ - $ 23\nExtinguishment of debt with borrowings from same creditors $ - $ 1,073 $ -\nNote 8. Financial Instruments and Fair Value Measurements\nThe following table summarizes our financial instruments measured at fair value on a recurring basis:\nApril 2, 2021 April 3, 2020\n(In millions) Fair Value Level 1 Level 2 Fair Value Level 1 Level 2\nAssets:\nMoney market funds $ 284 $ 284 $ - $ 1,346 $ 1,346 $ -\nCertificates of deposit 1 - 1 348 - 348\nCorporate bonds 17 - 17 86 - 86\nTotal $ 302 $ 284 $ 18 $ 1,780 $ 1,346 $ 434\nThe following table presents the contractual maturities of our investments in debt securities as of April 2, 2021:\n(In millions) Fair Value\nDue in one year or less $ 14\nDue after one year through five years 4\nTotal $ 18\nActual maturities may differ from the contractual maturities because borrowers may have the right to call or prepay certain obligations.\nFinancial instruments not recorded at fair value on a recurring basis include our non-marketable equity investments, equity method investment, and our long-term debt.\nNon-marketable equity investments\nAs of April 2, 2021 and April 3, 2020, the carrying value of our non-marketable equity investments was $185 million and $187 million, respectively.\nEquity method investment\nOur investment in equity securities that was accounted for using the equity method was divested during fiscal 2020 and consisted of our equity investment in DigiCert. On October 16, 2019, Clearlake Capital Group, L.P, a private investment firm, and TA Associates, an investor of DigiCert and private equity firm, completed a joint investment in DigiCert. As a result, we sold our equity investment in DigiCert for $380 million in cash and recognized a gain on sale of $379 million in fiscal 2020.\nWe recorded a loss from our equity interest of $31 million and $101 million during 2020 and 2019, respectively, in Other income (expense), net in our Consolidated Statements of Operations. This loss was reflected as a reduction in the carrying amount of our investment in equity interests in our Consolidated Balance Sheets.\nDigiCert’s results were reported on a three month lag prior to our divestiture of our investment. The following table summarizes DigiCert’s results of operations through October 16, 2019, the date of our investment sale.\n(In millions) Period from January 1, 2019 to October 16, 2019 (unaudited) Year Ended\nDecember 31, 2018\nRevenue $ 350 $ 313\nGross profit $ 293 $ 250\nNet loss $ (102) $ (342)\nCurrent and long-term debt\nAs of April 2, 2021 and April 3, 2020, the total fair value of our current and long-term fixed rate debt was $2,400 million and $3,634 million, respectively. The fair value of our variable rate debt approximated their carrying value. The fair values of all our debt obligations were based on Level 2 inputs.\nNote 9. Leases\nWe lease certain of our facilities, equipment, and data center co-locations under operating leases that expire on various dates through fiscal 2028. Our leases generally have terms that range from 1 year to 10 years for our facilities, 1 year to 6 years for equipment, and 1 year to 6 years for data center co-locations. Some of our leases contain renewal options, escalation clauses, rent concessions, and leasehold improvement incentives.\nThe following summarizes our lease costs for fiscal 2021 and 2020:\nYear Ended\n(In millions) April 2, 2021 April 3, 2020\nOperating lease costs $ 17 $ 34\nShort-term lease costs 4 8\nVariable lease costs 6 21\nTotal lease costs $ 27 $ 63\nRent expense under operating leases prior to our adoption of Topic 842 was $58 million for fiscal 2019.\nOther information related to our operating leases as of April 2, 2021 was as follows:\nYear Ended\nApril 2, 2021 April 3, 2020\nWeighted-average remaining lease term 4.4 years 4.5 years\nWeighted-average discount rate 4.07 % 4.05 %\nSee Note 7 for cash flow information related to our operating leases.\nAs of April 2, 2021, the maturities of our lease liabilities by fiscal year are as follows:\n(In millions)\n2022 $ 29\n2023 22\n2024 19\n2025 14\n2026 7\nThereafter 9\nTotal lease payments 100\nLess: Imputed interest (8)\nPresent value of lease liabilities $ 92\nNote 10. Debt\nThe following table summarizes components of our debt:\nApril 2, 2021 April 3, 2020\n(In millions, except percentages) Amount Effective\nInterest Rate Amount Effective\nInterest Rate\n2.00% Convertible Unsecured Notes due August 15, 2022\n$ - N/A $ 625 2.66 %\n4.20% Senior Notes due September 15, 2020\n- N/A 750 4.25 %\nNew 2.50% Convertible Senior Notes due April 1, 2022\n250 2.63 % 250 2.63 %\n3.95% Senior Notes due June 15, 2022\n400 4.05 % 400 4.05 %\nNew 2.00% Convertible Unsecured Notes due August 15, 2022\n625 2.62 % 625 2.62 %\nTerm Loan due November 4, 2024 494 LIBOR plus (1)\n500 LIBOR plus (1)\nDelayed Term Loan due November 4, 2024 741 LIBOR plus (1)\n- N/A\n5.0% Senior Notes due April 15, 2025\n1,100 5.00 % 1,100 5.23 %\n0.95% Avira Mortgage due December 30, 2030\n5 0.95 % - N/A\n1.29% Avira Mortgage due December 30, 2029\n5 1.29 % - N/A\nTotal principal amount 3,620 4,250\nLess: unamortized discount and issuance costs (19) (29)\nTotal debt 3,601 4,221\nLess: current portion (313) (756)\nTotal long-term portion $ 3,288 $ 3,465\n(1)The term loans bear interest at a rate equal to the LIBOR plus a margin based on the current debt rating of our non-credit-enhanced, senior unsecured long-term debt, and our underlying loan agreements. The interest rates for the outstanding term loans are as follows:\nApril 2, 2021 April 3, 2020\nTerm Loan due November 4, 2024 1.50 % 2.88 %\nDelayed Term Loan due November 4, 2024 1.50 % N/A\nAs of April 2, 2021, the future contractual maturities of debt by fiscal year are as follows:\n(In millions)\n2022 $ 313\n2023 1,089\n2024 64\n2025 1,048\n2026 1,101\nThereafter 5\nTotal future maturities of debt $ 3,620\nCredit Facility\nOn November 4, 2019, we entered into a credit agreement with financial institutions, which provides a revolving line of credit of $1 billion, a 5-year term loan of $500 million (the Initial Term Loan), and a delayed draw 5-year term loan commitment of $750 million (the Delayed Draw Term Loan). On September 14, 2020, we drew $750 million on the Delayed Draw Term Loan.\nOn May 7, 2021, we entered into the first amendment to the credit agreement with financial institutions (the First Amendment), which extends the maturity of all term loan and revolver credit facilities from November 2024 to May 2026. The First Amendment also provides an additional five-year term loan facility (the First Amendment Additional Term Loan) of $525 million. At the closing of the First Amendment, we did not borrow any funds under the revolving line of credit and fully borrowed the First Amendment Additional Term Loan such that loans in an aggregate principal amount of $1.75 billion were outstanding. The credit facilities remain senior secured.\nThe principal amount of the Initial Term Loan and the First Amendment Additional Term Loan must be repaid in quarterly installments on the last business day of each calendar quarter commencing with the quarter ended September 30, 2022 in an amount equal to 1.25% of the aggregate principal amount, as of the date of the first amendment. The principal amount of the Delayed Draw Term Loan must be repaid in quarterly installments on the last business day of each calendar quarter commencing with the later of (i) the quarter ended March 31, 2021 and (ii) the first full fiscal quarter ended following the Borrowing of the Delayed Draw Term Loans in an amount equal to 1.25% of aggregate principal amount that are outstanding immediately after the borrowing of the Delayed Draw Term Loan. We may voluntarily repay outstanding principal balances without penalty. As of April 2, 2021 and April 3, 2020, there were no borrowings outstanding under our revolving credit facilities.\nInterest on borrowings under the credit agreement can be based on a base rate or a LIBOR at our election. Based on our debt ratings and our consolidated leverage ratios as determined in accordance with the credit agreement, loans borrowed bear interest, in the case of base rate loans, at a per annum rate equal to the applicable base rate plus a margin ranging from 0.125% to 0.75%, and in the case of LIBOR loans, LIBOR, as adjusted for statutory reserves, plus a margin ranging from 1.125% to 1.75%. The unused revolving line of credit is subject to a commitment fee ranging from 0.125% to 0.30% per annum.\nThe credit agreement contains customary representations and warranties, non-financial covenants for financial reporting, affirmative and negative covenants, including a covenant that we maintain a consolidated leverage ratio of not more than 5.25 to 1.0, or 5.75 to 1.0 if we acquire assets or business in an aggregate amount greater than $250 million, and restrictions on indebtedness, liens, investments, stock repurchases, and dividends (with exceptions permitting our regular quarterly dividend and other specific capital returns). As of April 2, 2021, we were in compliance with all debt covenants.\nSenior Notes\nOn February 9, 2017, we issued $1.1 billion aggregate principal amount of our 5.0% Senior Notes due April 15, 2025 (the 5.0% Senior Notes). The 5.0% Senior Notes bear interest at a rate of 5.00% per year, payable semiannually in arrears on April 15 and October 15 of each year, beginning on October 15, 2017.\nOn or after April 15, 2020, we may redeem some or all of the 5.0% Senior Notes at the applicable redemption prices set forth in the supplemental indenture, plus accrued and unpaid interest.\nIn addition, we had two series of senior notes, the 4.2% Senior Notes and 3.95% Senior Notes that are senior unsecured obligations that rank equally in right of payment with all of our existing and future senior, unsecured, unsubordinated obligations and may be redeemed at any time, subject to the make-whole provisions contained in the applicable indenture relating to such series of notes. Interest on each series of these notes is payable semi-annually in arrears, on September 15 and March 15 for the 4.2% Senior Notes, and June 15 and December 15 for the 3.95% Senior Notes.\nOn September 15, 2020, we fully repaid the principal and accrued interest under the 4.2% Senior Notes due September 2020, which had an aggregate principal amount outstanding of $750 million.\nConvertible Senior Notes\nOn March 4, 2016, we issued $500 million of convertible notes which would mature on April 1, 2021 and bear interest at an annual rate of 2.5% (2.5% Convertible Notes). On August 1, 2016, we issued an additional $1.25 billion of convertible notes which would mature on August 15, 2021 and bear interest at an annual rate of 2.0% (2.0% Convertible Notes and collectively, Convertible Senior Notes). As of March 29, 2019, the principal amount and associated unamortized discount and issuance costs of the 2.5% Convertible Notes were classified as current because upon the four year anniversary of the issuance of the notes, holders of thereof had the option to require us to repurchase the notes, in cash, equal to the principal amount and accrued and unpaid interest of the 2.5% Convertible Notes (the Repurchase Right).\nOn November 11, 2019, we amended the Convertible Senior Notes agreements to provide that, if and when we pay a special dividend of $12 to our stockholders, we would exchange $250 million of the principal amount underlying the 2.5% Convertible Notes for new notes to be issued pursuant to a new indenture (the New 2.5% Convertible Notes) and would also pay cash consideration of $12 for each share underlying the New 2.5% Convertible Notes, and exchange $625 million of the principal amount underlying the 2.0% Convertible Notes for new notes to be issued pursuant to a new indenture (the New 2.0% Convertible Notes) and would also pay cash consideration of $12 for each share underlying the New 2.0% Convertible Notes, in each case in lieu of conversion price adjustments (the Cash Note Payments). The remaining principal of the Convertible Senior Notes would receive a conversion price adjustment with respect to such special dividend.\nThe special dividend was payable to stockholders on January 31, 2020. On February 4, 2020, we issued the New 2.5% Convertible Notes, maturing on April 1, 2022, and the New 2.0% Convertible Notes, which mature on August 15, 2022, pursuant\nto two new indentures, and made the Cash Note Payments. The new Notes are convertible into cash, shares of common stock or a combination of cash and common stock, at the Company’s option, at an initial conversion rate for the New 2.50% Convertible Notes of 59.6341 per $1,000 principal amount of the New 2.50% Convertible Notes (which represents an initial conversion price of approximately $16.77 per share) and an initial conversion rate for the New 2.00% Convertible Notes of 48.9860 per $1,000 principal amount of the New 2.00% Convertible Notes (which represents an initial conversion price of approximately $20.41 per share), in each case subject to certain limitations and certain adjustments. The Cash Note Payments consisted of $179 million with respect to holders of the New 2.5% Convertible Notes and $367 million with respect to holders of the New 2.0% Convertible Notes. The exchange of the convertible notes was accounted for as extinguishment of debt and the consideration comprising the Cash Note Payments were recorded as charges to paid in capital. We recognized a gain of $2 million related to the exchange.\nAfter giving effect to the conversion rate adjustment that was made in connection with the payment of the special dividend on January 31, 2020, the conversion rate for the remaining $250 million of the 2.5% Convertible Notes was 118.9814 shares of common stock per $1,000 principal amount of the notes, which represents an adjusted conversion price of approximately $8.40 per share and the conversion rate for the remaining $625 million of the 2.0% Convertible Notes was 97.7364 shares of common stock per $1,000 principal amount of the notes, which represented an adjusted conversion price of approximately $10.23 per share.\nIn addition, in connection with the amendments, the maturity dates of the 2.5% Convertible Notes and the 2.0% Convertible Notes were extended to April 1, 2022 and August 15, 2022, respectively. Holders of the Convertible Senior Notes would only be able to convert the notes in a period of six months prior to the extended maturity dates; and the Redemption Right and Repurchase Right were removed.\nOn March 5, 2020, we entered into an agreement to repay the full $250 million of principal and conversion rights of the 2.5% Convertible Notes for an aggregate amount of $566 million in cash. The payment was based on $19 per underlying share into which the 2.5% Convertible Notes were convertible. In addition, we paid $2 million of accrued and unpaid interest through the date of settlement, and $1 million in lieu of a proration of the cash dividend declared on February 6, 2020. The extinguishment was settled on March 10, 2020 and resulted in an adjustment to stockholders’ equity of $316 million and a loss on extinguishment of $1 million.\nOn May 26, 2020, we settled the $625 million principal and conversion rights of the 2.0% Convertible Senior Notes in cash. The aggregate settlement amount of $1,176 million was based on $19.25 per underlying share into which the 2.0% Convertible Notes were convertible. In addition, we paid $3 million of accrued and unpaid interest through the date of settlement. The extinguishment resulted in an adjustment to stockholders’ equity of $578 million and a gain on extinguishment of $20 million.\nAs of April 2, 2021 and April 3, 2020, the Convertible Senior Notes consisted of the following:\nApril 2, 2021 April 3, 2020\n(In millions) New 2.5% Convertible Notes\nNew 2.0% Convertible Notes\nNew 2.5% Convertible Notes\nNew 2.0% Convertible Notes\n2.0% Convertible Notes\nLiability component:\nPrincipal $ 250 $ 625 $ 250 $ 625 $ 625\nUnamortized discount and issuance costs - (5) (1) (9) (6)\nNet carrying amount $ 250 $ 620 $ 249 $ 616 $ 619\nEquity component, net of tax $ 43 $ 56 $ 43 $ 56 $ 12\nBased on the closing price of our common stock of $21.42 on the last trading date closest to April 2, 2021, the if-converted values of the New 2.5% Convertible Notes and the 2.0% Convertible Notes exceeded the principal amount by approximately $69 million and $31 million, respectively. See Note 19 for discussion of convertible note purchase agreement entered into on May 13, 2021.\nThe following table sets forth total interest expense recognized related to our convertible notes:\nYear Ended\n(In millions) April 2, 2021 April 3, 2020 March 29, 2019\nContractual interest expense $ 20 $ 37 $ 38\nAmortization of debt discount and issuance costs $ 4 $ 13 $ 16\nPayments in lieu of conversion price adjustments (1)\n$ 12 $ 11 $ -\n(1) Payments in lieu of conversion price adjustments consist of amounts paid to holders of the Convertible Senior Notes when our quarterly dividend to our common stockholders exceeds the amounts defined in the Convertible Senior Notes agreements.\nNote 11. Derivatives\nWe conduct business in numerous currencies throughout our worldwide operations, and our entities hold monetary assets or liabilities, earn revenues, or incur costs in currencies other than the entity’s functional currency. As a result, we are exposed to foreign exchange gains or losses which impacts our operating results. As part of our foreign currency risk mitigation strategy, we have entered into foreign exchange forward contracts with up to twelve months in duration. We do not use derivative financial instruments for speculative trading purposes, nor do we hedge our foreign currency exposure in a manner that entirely offsets the effects of the changes in foreign exchange rates.\nWe enter into foreign currency forward contracts to hedge foreign currency balance sheet exposure. These forward contracts are not designated as hedging instruments. As of April 2, 2021 and April 3, 2020, the fair value of these contracts was immaterial. The related gain (loss) recognized in Other income (expense), net in our Consolidated Statements of Operations was as follows:\nYear Ended\n(In millions) April 2, 2021 April 3, 2020 March 29, 2019\nForeign exchange forward contracts gain (loss) $ 15 $ (22) $ (37)\nThe fair value of our foreign exchange forward contracts is presented on a gross basis in our Consolidated Balance Sheets. To mitigate losses in the event of nonperformance by counterparties, we have entered into master netting arrangements with our counterparties that allow us to settle payments on a net basis. The effect of netting on our derivative assets and liabilities was not material as of April 2, 2021 and April 3, 2020.\nThe notional amount of our outstanding foreign exchange forward contracts in U.S. dollar equivalent was as follows:\n(In millions) April 2, 2021 April 3, 2020\nForeign exchange forward contracts purchased $ 270 $ 362\nForeign exchange forward contracts sold $ 68 $ 57\nNote 12. Restructuring, Transition and Other Costs\nOur restructuring, transition and other costs consist primarily of severance, contract cancellations, separation, transition, and other related costs. Severance costs generally include severance payments, outplacement services, health insurance coverage, and legal costs. Included in other exit and disposal costs are advisory fees incurred in connection with restructuring events. Separation costs primarily consist of consulting costs incurred in connection with our divestitures. Transition costs are incurred in connection with Board of Directors approved discrete strategic information technology transformation initiatives and primarily consist of consulting charges associated with our enterprise resource planning and supporting systems and costs to automate business processes. Such transition projects were completed by the end of fiscal 2019.\nDecember 2020 Plan\nIn December 2020, our Board of Directors approved a restructuring plan (the December 2020 Plan) to consolidate facilities and reduce operating costs in connection with our acquisition of Avira. We estimate that we will incur total costs of up to $20 million. These actions are expected to be completed in fiscal 2022. As of April 2, 2021, we have incurred total costs of $12 million under the December 2020 Plan. See Note 4 for further information on our Avira acquisition.\nNovember 2019 Plan\nIn November 2019, our Board of Directors approved a restructuring plan (the November 2019 Plan) in connection with the strategic decision to divest our Enterprise Security business. Actions under this plan included the reduction of our workforce as well as asset write-offs and impairments, contract terminations, facilities closures, and the sale of underutilized facilities. These actions were completed in fiscal 2021, and we incurred total costs of $509 million, excluding stock-based compensation expense, under the November 2019 Plan.\nIn connection with the Broadcom sale, our Board of Directors approved an equity-based severance program under which certain equity awards to certain terminated employees were accelerated. As of April 2, 2021, we have incurred $127 million of stock-based compensation related to our equity-based severance program. See Note 15 for further information on the impact of this program.\nAugust 2019 Plan\nOn August 6, 2019, our Board of Directors approved a restructuring plan (the August 2019 Plan) to improve productivity and reduce complexity in the way we manage the business. Under the August 2019 Plan, we reduced our global headcount and closed certain facilities. These actions were completed in fiscal 2020, and we incurred total costs of $53 million, primarily consisting of severance and termination benefits.\nRestructuring, transition and other costs summary\nOur restructuring, transition and other costs attributable to continuing operations are presented in the table below:\nYear Ended\n(In millions) April 2, 2021 April 3, 2020 March 29, 2019\nSeverance and termination benefit costs $ 31 $ 90 $ 19\nContract cancellation charges 51 101 -\nStock-based compensation charges 10 20 -\nAsset write-offs and impairments 58 47 2\nOther exit and disposal costs 11 7 12\nSeparation costs - 1 3\nTransition costs - - 185\nTotal restructuring, transition and other $ 161 $ 266 $ 221\nIn connection with the agreement to sell certain assets of our Enterprise Security business, a portion of our restructuring, transition and other costs were classified to discontinued operations for all periods presented. Our restructuring, transition and other costs attributable to discontinued operations are presented in the table below:\nYear Ended\n(In millions) April 2, 2021 April 3, 2020 March 29, 2019\nSeverance and termination benefit costs $ 64 $ 121 $ 9\nContract cancellation charges - 5 -\nStock-based compensation charges - 97 -\nAsset write-offs and impairments - 13 -\nOther exit and disposal costs - - 3\nSeparation costs 2 25 -\nTransition costs - - 8\nTotal restructuring, transition and other $ 66 $ 261 $ 20\nRestructuring summary\nOur activities and liability balances related to our restructuring plans are presented in the tables below:\nDecember 2020 Plan\n(In millions) Liability Balance as of April 3, 2020 Net Charges Cash Payments Non-Cash Items Liability Balance as of April 2, 2021\nSeverance and termination benefit costs $ - $ 12 $ (9) $ - $ 3\nTotal $ - $ 12 $ (9) $ - $ 3\nNovember 2019 Plan\n(In millions) Liability Balance as of April 3, 2020 Net Charges Cash Payments Non-Cash Items Liability Balance as of April 2, 2021\nSeverance and termination benefit costs $ 35 $ 83 $ (118) $ - $ -\nContract cancellation charges 7 51 (11) (35) 12\nStock-based compensation charges - 10 - (10) -\nAsset write-offs and impairments - 58 - (58) -\nOther exit and disposal costs - 11 (10) - 1\nTotal $ 42 $ 213 $ (139) $ (103) $ 13\nThe restructuring liabilities are included in Other current liabilities in our Consolidated Balance Sheets.\nNote 13. Income Taxes\nThe components of our income (loss) from continuing operations before income taxes are as follows:\nYear Ended\n(In millions) April 2, 2021 April 3, 2020 March 29, 2019\nDomestic $ 607 $ 667 $ (179)\nInternational 265 152 72\nIncome (loss) before income taxes $ 872 $ 819 $ (107)\nThe components of income tax expense (benefit) from continuing operations are as follows:\nYear Ended\n(In millions) April 2, 2021 April 3, 2020 March 29, 2019\nCurrent:\nFederal $ 133 $ 208 $ 58\nState 36 33 4\nInternational (13) 3 (14)\nTotal 156 244 48\nDeferred:\nFederal (6) (23) (35)\nState (5) 3 (3)\nInternational 31 17 (7)\nTotal 20 (3) (45)\nIncome tax expense $ 176 $ 241 $ 3\nThe U.S. federal statutory income tax rates we have applied for fiscal 2021, 2020, and 2019 are as follows:\nYear Ended\nApril 2, 2021 April 3, 2020 March 29, 2019\nU.S. federal statutory income tax rate 21.0 % 21.0 % 21.0 %\nThe difference between our effective income tax and the federal statutory income tax is as follows:\nYear Ended\n(In millions) April 2, 2021 April 3, 2020 March 29, 2019\nFederal statutory tax expense (benefit) $ 183 $ 172 $ (23)\nState taxes, net of federal benefit 25 22 (11)\nForeign earnings taxed at other than the federal rate 7 (2) (24)\nTransition tax - - (2)\nFederal research and development credit (1) (2) (4)\nValuation allowance increase (decrease) 1 (57) 26\nChange in uncertain tax positions 3 60 44\nStock-based compensation 5 5 8\nNondeductible goodwill - 18 -\nFavorable ruling on foreign withholding tax (35) - -\nUS tax on foreign earnings (15) (4) (1)\nReturn to provision adjustment 1 12 (16)\nOther, net 2 17 6\nIncome tax expense $ 176 $ 241 $ 3\nThe principal components of deferred tax assets and liabilities are as follows:\n(In millions) April 2, 2021 April 3, 2020\nDeferred tax assets:\nTax credit carryforwards $ 2 $ 6\nNet operating loss carryforwards of acquired companies 23 21\nOther accruals and reserves not currently tax deductible 54 46\nOperating lease liabilities 29 12\nDeferred revenue - 2\nProperty and equipment 17 10\nIntangible assets 103 117\nLoss on investments not currently tax deductible - 1\nStock-based compensation 7 21\nOther 36 44\nGross deferred tax assets 271 280\nValuation allowance (7) (9)\nDeferred tax assets, net of valuation allowance 264 271\nDeferred tax liabilities:\nOperating lease assets (25) (10)\nGoodwill (1) -\nDeferred revenue (1) -\nUnremitted earnings of foreign subsidiaries (15) (17)\nPrepaids and deferred expenses (2) (2)\nDiscount on convertible debt (2) (4)\nDeferred tax liabilities (46) (33)\nNet deferred tax assets (liabilities) $ 218 $ 238\nThe valuation allowance provided against our deferred tax assets as of April 2, 2021, decreased primarily due to a change in tax credit carryforwards. The ending valuation allowance of $7 million is provided primarily against certain foreign tax credits.\nAs of April 2, 2021, we have U.S. federal net operating losses attributable to various acquired companies of approximately $77 million, which, if not used, will expire between fiscal 2022 and 2039. The remaining net operating loss carryforwards are subject to an annual limitation under U.S. federal tax regulations but are expected to be fully realized. Furthermore, we have U.S. state net operating loss carryforwards attributable to various acquired companies of approximately $13 million. If not used, our U.S. state net operating losses will expire between fiscal 2022 and 2038. In addition, we have foreign net operating loss carryforwards attributable to various foreign companies of approximately $26 million.\nIn assessing the ability to realize our deferred tax assets, we considered whether it is more likely than not that some portion or all the deferred tax assets will not be realized. We considered the following: we have historical cumulative book income, as measured by the current and prior two years; we have strong, consistent taxpaying history; we have substantial U.S. federal income tax carryback potential; and we have substantial amounts of scheduled future reversals of taxable temporary differences from our deferred tax liabilities. We have concluded that this positive evidence outweighs the negative evidence and, thus, that the deferred tax assets as of April 2, 2021, are realizable on a “more likely than not” basis.\nThe aggregate changes in the balance of gross unrecognized tax benefits were as follows:\nYear Ended\n(In millions) April 2, 2021 April 3, 2020 March 29, 2019\nBalance at beginning of year $ 724 $ 446 $ 378\nSettlements with tax authorities (37) (5) (3)\nLapse of statute of limitations (34) (15) (17)\nIncrease related to prior period tax positions 13 77 16\nDecrease related to prior period tax positions (129) (11) (11)\nIncrease related to current year tax positions 11 232 75\nIncrease due to acquisition - - 8\nBalance at end of year $ 548 $ 724 $ 446\nThere was a change of $176 million in gross unrecognized tax benefits during the year ended April 2, 2021, as disclosed above. This gross liability does not include offsetting tax benefits associated with the correlative effects of potential transfer pricing adjustments, interest deductions, and state income taxes.\nOf the total unrecognized tax benefits at April 2, 2021, $494 million, if recognized, would affect our effective tax rate.\nWe recognize interest and/or penalties related to uncertain tax positions in income tax expense. At April 2, 2021, before any tax benefits, we had $74 million of accrued interest and penalties on unrecognized tax benefits. Interest included in our provision for income taxes was an expense of approximately $26 million for fiscal 2021. If the accrued interest and penalties do not ultimately become payable, amounts accrued will be reduced in the period that such determination is made and reflected as a reduction of the overall income tax provision.\nOn July 27, 2015, the United States Tax Court (Tax Court) issued its opinion in Altera v. Commissioner and concluded that related parties in a cost sharing arrangement are not required to share expenses related to stock-based compensation. The Commissioner of the Internal Revenue Service appealed the Tax Court decision to the Ninth Circuit. In June 2019, the U.S. Court of Appeals for the Ninth Circuit reversed the July 2015 decision of the U.S. Tax Court. As a result of this decision, we recorded a cumulative income tax expense of $62 million in the first quarter of fiscal 2020. On July 22, 2019, the taxpayer requested a rehearing before the full Ninth Circuit, but such request was denied on November 12, 2019. In February 2020, Altera requested a hearing before the Supreme Court of the United States. In June 2020, the Supreme Court declined to review the case.\nWe file income tax returns in the U.S. on a federal basis and in many U.S. state and foreign jurisdictions. Our most significant tax jurisdictions are the U.S. and Ireland. Our tax filings remain subject to examination by applicable tax authorities for a certain length of time following the tax year to which those filings relate. Our fiscal years 2014 through 2021 remain subject to examination by the IRS for U.S. federal tax purposes. Our fiscal years prior to 2014 have been settled and closed with the IRS. Our fiscal years 2014 to 2019 are currently under audit by the IRS. Our 2016 through 2021 fiscal years remain subject to examination by the appropriate governmental agencies for Irish tax purposes.\nThe timing of the resolution of income tax examinations is highly uncertain, and the amounts ultimately paid, if any, upon resolution of the issues raised by the taxing authorities may differ materially from the amounts accrued for each year. Although potential resolution of uncertain tax positions involves multiple tax periods and jurisdictions, it is reasonably possible that the gross unrecognized tax benefits related to these audits could decrease (whether by payment, release, or a combination of both) in the next 12 months. Depending on the nature of the settlement or expiration of statutes of limitations, it could affect our income tax provision and therefore benefit the resulting effective tax rate.\nWe continue to monitor the progress of ongoing income tax controversies and the impact, if any, of the expected tolling of the statute of limitations in various taxing jurisdictions.\nNote 14. Stockholders’ Equity\nPreferred stock\nOn May 22, 2020, we filed a Certificate of Elimination of Series A Junior Preferred Stock (the “Junior Preferred Stock”) with the Secretary of State of the State of Delaware, to remove the Certificate of Designations of the Junior Preferred Stock from our Amended and Restated Certificate of Incorporation. The Certificate of Elimination became effective upon filing. No shares of the Junior Preferred Stock were issued or outstanding upon filing of the Certificate of Elimination.\nDividends\nOn May 10, 2021, we announced that our Board of Directors declared a cash dividend of $0.125 per share of common stock to be paid in June 2021. All shares of common stock issued and outstanding and all RSUs and PRUs as of the record date will be entitled to the dividend and dividend equivalent rights (DERs), respectively, which will be paid out if and when the underlying shares are released. Any future dividends and DERs will be subject to the approval of our Board of Directors.\nStock repurchase program\nUnder our stock repurchase program, we may purchase shares of our outstanding common stock through open market and through accelerated stock repurchase transactions. As of April 2, 2021, we have $274 million remaining under the authorization to be completed in future periods with no expiration date.\nThe following table summarizes activity related to our stock repurchase program:\nYear Ended\n(In millions, except per share amounts)\nApril 2, 2021 April 3, 2020\nNumber of shares repurchased 15 68\nAverage price per share $ 20.50 $ 22.97\nAggregate purchase price $ 304 $ 1,562\nRepurchases of 1 million shares executed during 2019 were settled in fiscal 2020.\nOn May 4, 2021, our Board of Directors approved an incremental share repurchase authorization of $1,500 million, bringing the total authorized under the stock repurchase program to $1,774 million. The authorization does not have an expiration date.\nAccumulated other comprehensive income (loss)\nComponents and activities of AOCI, net of tax, were as follows:\n(In millions) Foreign Currency\nTranslation Adjustments\nUnrealized Gain (Loss) On Available-For-Sale Securities\nEquity Method Investee Total AOCI\nBalance as of March 29, 2019 $ (5) $ (1) $ (1) $ (7)\nOther comprehensive income (loss) before reclassifications (11) 1 2 (8)\nReclassification to net income - - (1) (1)\nBalance as of April 3, 2020 (16) - - (16)\nOther comprehensive income before reclassifications 63 - - 63\nBalance as of April 2, 2021 $ 47 $ - $ - $ 47\nNote 15. Stock-Based Compensation and Other Benefit Plans\nStock incentive plans\nThe purpose of our stock incentive plans is to attract, retain, and motivate eligible persons whose present and potential contributions are important to our success by offering them an opportunity to participate in our future performance through equity awards. We have one primary stock incentive plan: the 2013 Equity Incentive Plan (the 2013 Plan), under which incentive stock options may be granted only to employees (including officers and directors who are also employees), and other awards may be granted to employees, officers, directors, consultants, independent contractors, and advisors. As amended, our stockholders have approved and reserved 82 million shares of common stock for issuance under the 2013 Plan. As of April 2, 2021, 18 million shares remained available for future grant, calculated using the maximum potential shares that could be earned and issued at vesting.\nIn connection with the acquisitions of various companies, we have assumed the equity awards granted under stock incentive plans of the acquired companies or issued equity awards in replacement thereof. No new awards will be granted under our acquired stock plans.\nRSUs\n(In millions, except per share and year data) Number of\nShares\nWeighted-\nAverage\nGrant Date Fair Value\nOutstanding as of April 3, 2020 7 $ 21.33\nGranted 4 $ 20.70\nVested (4) $ 21.86\nForfeited (2) $ 20.55\nOutstanding as of April 2, 2021 5 $ 20.62\nRSUs generally vest over a three-year period. The weighted-average grant date fair value per share of RSUs granted during fiscal 2021, 2020, and 2019 was $20.70, $19.65, and $21.77, respectively. The total fair value of RSUs released in fiscal 2021, 2020, and 2019 was $86 million, $300 million, and $214 million, respectively, which represents the market value of our common stock on the date the RSUs were released.\nPRUs\n(In millions, except per share and year data) Number of\nShares Weighted-\nAverage\nGrant Date Fair Value\nOutstanding and unvested at April 3, 2020 2 $ 22.68\nGranted 2 $ 26.39\nVested (2) $ 23.97\nForfeited (1) $ 20.61\nUnvested at April 2, 2021 1 $ 27.50\nVested and unreleased at April 2, 2021 -\nOutstanding at April 2, 2021 1\nThe total fair value of PRUs released in fiscal 2021, 2020, and 2019 was $43 million, $39 million, and $261 million, respectively, which represents the market value of our common stock on the date the PRUs were released.\nWe have granted PRUs to certain of our executives. Typically, these PRUs have a three-year vest period. PRUs granted in fiscal 2021 and 2019 contain a combination of our company’s performance and market conditions whereas our fiscal 2020 PRUs only contain market conditions. The performance conditions are based on the achievement of specified one-year non-GAAP financial metrics. The market conditions are based on the achievement of our relative total shareholder return over a two- and three-year period. Typically, 0% to 200% of target shares are eligible to be earned based on the achievement of the performance and market conditions.\nValuation of PRUs\nThe fair value of each PRU that does not contain a market condition is equal to the market value of our common stock on the date of grant. The fair value of each PRU that contains a market condition is estimated using the Monte Carlo simulation model. The valuation and the underlying weighted-average assumptions for PRUs are summarized below:\nYear Ended\nApril 2, 2021 April 3, 2020 March 29, 2019\nExpected term 2.7 years 1.9 years 2.7 years\nExpected volatility 42.5 % 38.1 % 34.2 %\nRisk-free interest rate 0.2 % 1.7 % 2.7 %\nExpected dividend yield - % 1.1 % - %\nWeighted-average grant date fair value of PRUs $ 26.39 $ 21.69 $ 21.30\nStock options\n(In millions, except per share and year data) Number of\nShares Weighted-Average Exercise Price Weighted-\nAverage\nRemaining Contractual Term\n(Years) Aggregate Intrinsic\nValue\nOutstanding at April 3, 2020 2 $ 6.85\nExercised (1) $ 7.25\nForfeited and expired (1) $ 6.93\nOutstanding at April 2, 2021 (1)\n- $ 5.22\nExercisable at April 2, 2021 (1)\n- $ 5.22 4.75 $ 5\n(1) The number of shares is less than 1 million.\nThe total intrinsic value of options exercised during fiscal 2021, 2020, and 2019 was $18 million, $171 million, and $23 million, respectively. No options were granted in fiscal 2021. The fair value of options granted in fiscal 2020 was $4.76 per share.\nESPP\nUnder our 2008 Employee Stock Purchase Plan, employees may annually contribute up to 10% of their gross compensation, subject to certain limitations, to purchase shares of our common stock at a discounted price. Eligible employees are offered shares through a 12-month offering period, which consists of two consecutive 6-month purchase periods, at 85% of the lower of either the fair market value on the purchase date or the fair market value at the beginning of the offering period.\nAs of April 2, 2021, 38 million shares have been issued under this plan, and 32 million shares remained available for future issuance.\nThe following table summarizes activity related to the purchase rights issued under the ESPP:\nYear Ended\n(In millions) April 2, 2021 April 3, 2020 March 29, 2019\nShares issued under the ESPP 1 2 -\nProceeds from issuance of shares $ 14 $ 39 $ -\nThe fair value of each stock purchase right under our ESPP is estimated using the Black-Scholes option pricing model. The weighted-average grant date fair value related to rights to acquire shares of common stock under our ESPP in fiscal 2021, 2020, and 2019 was $5.65 per share, $5.17 per share, and $6.22 per share, respectively.\nDividend equivalent rights (DERs)\nOur RSUs and PRUs contain dividend equivalent rights (DER) that entitles the recipient of an award to receive cash dividend payments when the associated award is released. The amount of DER equals to the cumulated dividends on the issued number of common stock that would have been payable since the date the associated award was granted. As of April 2, 2021 and April 3, 2020, current dividends payable related to DER was $12 million and $62 million, respectively, recorded as part of Other current liabilities in the Consolidated Balance Sheets, and long-term dividends payable related to DER was $10 million and $31 million, respectively, recorded as part of Other long-term liabilities.\nStock-based award modifications\nIn connection with the Broadcom sale in fiscal 2020, we approved severance and retention arrangements for certain executives. As a result, these executives are entitled to receive vesting of 50% of their unvested equity, subject to a service condition, and the remaining unvested equity will be earned at levels of 0% to 150%, subject to market and service conditions. In connection with restructuring activities related to the Broadcom sale, we entered into severance and retention arrangements with certain other employees. These arrangements provided for acceleration of either a portion or all of the vesting of their stock-based awards.\nThe following table summarizes the stock-based compensation expense recognized as a result of these modifications:\nYear Ended\n(In millions)\nApril 2, 2021 April 3, 2020\nSales and marketing $ 2 $ 6\nResearch and development 9 -\nGeneral and administrative 8 20\nRestructuring and other costs 10 20\nDiscontinued operations 1 99\nTotal stock-based compensation $ 30 $ 145\nStock-based compensation expense\nTotal stock-based compensation expense and the related income tax benefit recognized for all of our equity incentive plans in our Consolidated Statements of Operations were as follows:\nYear Ended\n(In millions) April 2, 2021 April 3, 2020 March 29, 2019\nCost of revenues $ 1 $ 2 $ 6\nSales and marketing 18 29 42\nResearch and development 26 30 34\nGeneral and administrative 26 58 76\nRestructuring, transition and other costs 10 20 -\nOther income (expense), net (1) 1 -\nTotal stock-based compensation from continuing operations 80 140 158\nDiscontinued operations 1 172 194\nTotal stock-based compensation expense $ 81 $ 312 $ 352\nIncome tax benefit for stock-based compensation expense $ (18) $ (55) $ (73)\nAs of April 2, 2021, the total unrecognized stock-based compensation expense related to our unvested stock-based awards was $94 million, which will be recognized over an estimated weighted-average amortization period of 1.8 years.\nOther employee benefit plans\n401(k) plan\nWe maintain a salary deferral 401(k) plan for all of our U.S. employees. This plan allows employees to contribute their pretax salary up to the maximum dollar limitation prescribed by the Internal Revenue Code. We match the first 3.5% of a participant’s eligible compensation up to $6,000 in a calendar year. Our employer matching contributions to the 401(k) plan were as follows, including contributions to employees of our discontinued operations:\nYear Ended\n(In millions) April 2, 2021 April 3, 2020 March 29, 2019\n401(k) matching contributions $ 3 $ 16 $ 23\nNote 16. Net Income Per Share\nBasic income per share is computed by dividing net income by the weighted-average number of common shares outstanding during the period. Diluted net income per share also includes the incremental effect of dilutive potentially issuable common shares outstanding during the period using the treasury stock method. Dilutive potentially issuable common shares include the dilutive effect of the shares underlying convertible debt and employee equity awards. Diluted income (loss) per share was the same as basic income (loss) per share for the year ended March 29, 2019, as there was a loss from continuing operations in the period and inclusion of potentially issuable shares was anti-dilutive.\nThe components of basic and diluted net income (loss) per share are as follows:\nYear Ended\n(In millions, except per share amounts) April 2, 2021 April 3, 2020 March 29, 2019\nIncome (loss) from continuing operations $ 696 $ 578 $ (110)\nIncome (loss) from discontinued operations, net of income taxes (142) 3,309 141\nNet income $ 554 $ 3,887 $ 31\nIncome (loss) per share - basic:\nContinuing operations $ 1.18 $ 0.94 $ (0.17)\nDiscontinued operations $ (0.24) $ 5.38 $ 0.22\nNet income per share - basic (1)\n$ 0.94 $ 6.32 $ 0.05\nIncome (loss) per share - diluted:\nContinuing operations $ 1.16 $ 0.90 $ (0.17)\nDiscontinued operations $ (0.24) $ 5.15 $ 0.22\nNet income per share - diluted (1)\n$ 0.92 $ 6.05 $ 0.05\nWeighted-average outstanding shares - basic 589 615 632\nDilutive potentially issuable shares:\nConvertible debt 8 20 -\nEmployee equity awards 3 8 -\nWeighted-average shares outstanding - diluted 600 643 632\nAnti-dilutive shares excluded from diluted net income (loss) per share calculation:\nConvertible debt 8 5 91\nEmployee equity awards - 2 47\nTotal 8 7 138\n(1) Net income per share amounts may not add due to rounding.\nUnder the treasury stock method, our convertible debt instruments will generally have a dilutive impact on net income per share when our average stock price for the period exceeds the conversion prices for the convertible debt instruments. On February 4, 2020, a portion of the 2.5% Convertible Notes were exchanged for the New 2.5% Convertible Notes, and a portion of the 2.0% Convertible Notes were exchanged for the New 2.0% Convertible Notes. The remaining Convertible Senior Notes received conversion price adjustments. The 2.5% Convertible Notes and 2.0% Convertible Notes were fully repaid on March 10, 2020 and May 26, 2020, respectively. See Note 10 for further information on our convertible debt instruments and Note 19 for information on a convertible note purchase agreement entered into on May 13, 2021. The conversion price of each convertible debt applicable in the periods presented is as follows:\nYear Ended\nApril 2, 2021 April 3, 2020 March 29, 2019\n2.5% Convertible Senior Notes due April 1, 2022\nN/A $ 8.40 (1)\n$ 16.77\n2.0% Convertible Senior Notes due August 15, 2022\nN/A $ 10.23 (1)\n$ 20.41\nNew 2.5% Convertible Senior Notes due April 1, 2022\n$ 16.77 $ 16.77 N/A\nNew 2.0% Convertible Senior Notes due August 15, 2022\n$ 20.41 $ 20.41 N/A\n(1) Conversion prices of the Convertible Senior Notes prior to their full repayments.\nThe conversion features of the convertible debt instruments were anti-dilutive during fiscal 2019 due to a loss from continuing operations.\nNote 17. Segment and Geographic Information\nWe operate as one reportable segment. Our Chief Operating Decision Maker reviews financial information presented on a consolidated basis to evaluate company performance and to allocate resources.\nThe following table summarizes net revenues for our major solutions:\nYear Ended\n(In millions) April 2, 2021 April 3, 2020 March 29, 2019\nConsumer security $ 1,513 $ 1,450 $ 1,471\nIdentity and information protection 1,038 994 937\nID Analytics - 46 48\nTotal net revenues $ 2,551 $ 2,490 $ 2,456\nFrom time to time, changes in our product hierarchy cause changes to the product categories above. When changes occur, we recast historical amounts to match the current product hierarchy. The changes have been reflected for all periods presented above. Consumer security products include our Norton 360 Security offerings, Norton Security, Norton Secure VPN, Avira Security, and other consumer security solutions. Identity and information protection products include our Norton 360 with LifeLock offerings, LifeLock identity theft protection and other information protection solutions. Our ID Analytics solutions were divested on January 31, 2020.\nGeographic information\nNet revenues by geography are based on the billing addresses of our customers. The following table represents net revenues by geographic area for the periods presented:\nYear Ended\n(In millions) April 2, 2021 April 3, 2020 March 29, 2019\nAmericas $ 1,827 $ 1,831 $ 1,786\nEMEA 419 376 392\nAPJ 305 283 278\nTotal net revenues $ 2,551 $ 2,490 $ 2,456\nNote: The Americas include U.S., Canada, and Latin America; EMEA includes Europe, Middle East, and Africa; APJ includes Asia Pacific and Japan\nRevenues from customers inside the U.S. were $1,742 million, $1,747 million, and $1,700 million during fiscal 2021, 2020, and 2019, respectively. No other individual country accounted for more than 10% of revenues.\nThe table below represents cash, cash equivalents and short-term investments held in the U.S. and internationally in various foreign subsidiaries:\n(In millions) April 2, 2021 April 3, 2020\nU.S. $ 536 $ 1,345\nInternational 415 918\nTotal cash, cash equivalents and short-term investments $ 951 $ 2,263\nThe table below represents our property and equipment, net of accumulated depreciation and amortization, by geographic area, based on the physical location of the asset, at the end of each period presented:\n(In millions) April 2, 2021 April 3, 2020\nU.S. $ 28 $ 174\nIreland 32 34\nGermany 14 4\nOther countries (1)\n4 26\nTotal property and equipment, net $ 78 $ 238\n(1) No individual country represented more than 10% of the respective totals.\nOur operating lease assets by geographic area, based on the physical location of the asset were as follows:\n(In millions) April 2, 2021 April 3, 2020\nU.S. $ 55 $ 40\nIndia 9 11\nJapan 3 10\nOther countries (1)\n9 27\nTotal operating lease assets $ 76 $ 88\n(1)No individual country represented more than 10% of the respective totals.\nSignificant customers\nIn fiscal 2021, 2020, and 2019, no customer accounted for 10% or more of our net revenues. See Note 1 for customers that accounted for over 10% of our net accounts receivable.\nNote 18. Commitments and Contingencies\nPurchase obligations\nWe have purchase obligations that are associated with agreements for purchases of goods or services. Management believes that cancellation of these contracts is unlikely, and we expect to make future cash payments according to the contract terms.\nThe following reflects estimated future payments for purchase obligations by fiscal year. The amount of purchase obligations reflects estimated future payments as of April 2, 2021.\n(In millions) April 2, 2021\n2022 $ 296\n2023 35\n2024 35\n2025 5\n2026 4\nThereafter 5\nTotal purchase obligations $ 380\nDeemed repatriation taxes\nUnder the Tax Cuts and Jobs Act (H.R.1), we are required to pay a one-time transition tax on untaxed foreign earnings of our foreign subsidiaries through July 2025. The following reflects estimated future payments for deemed repatriation taxes by fiscal year:\n(In millions) April 2, 2021\n2022 $ 69\n2023 68\n2024 128\n2025 171\n2026 158\nTotal obligations $ 594\nIndemnifications\nIn the ordinary course of business, we may provide indemnifications of varying scope and terms to customers, vendors, lessors, business partners, subsidiaries, and other parties with respect to certain matters, including, but not limited to, losses arising out of our breach of agreements or representations and warranties made by us. In addition, our bylaws contain indemnification obligations to our directors, officers, employees, and agents, and we have entered into indemnification agreements with our directors and certain of our officers to give such directors and officers additional contractual assurances regarding the scope of the indemnification set forth in our bylaws and to provide additional procedural protections. We maintain director and officer insurance, which may cover certain liabilities arising from our obligation to indemnify our directors and officers. It is not possible to determine the aggregate maximum potential loss under these indemnification agreements due to the limited history of prior indemnification claims and the unique facts and circumstances involved in each particular agreement. Such indemnification agreements might not be subject to maximum loss clauses. Historically, we have not incurred material costs as a result of obligations under these agreements, and we have not accrued any material liabilities related to such indemnification obligations in our Consolidated Financial Statements.\nIn connection with the sale of Veritas and the sale of our Enterprise Security business to Broadcom, we assigned several leases to Veritas Technologies LLC or Broadcom and/or their related subsidiaries. As a condition to consenting to the assignments, certain lessors required us to agree to indemnify the lessor under the applicable lease with respect to certain matters, including, but not limited to, losses arising out of Veritas Technologies LLC, Broadcom, or their related subsidiaries’ breach of payment obligations under the terms of the lease. As with our other indemnification obligations discussed above and in general, it is not possible to determine the aggregate maximum potential loss under these indemnification agreements due to the limited history of prior indemnification claims and the unique facts and circumstances involved in each particular agreement. As with our other indemnification obligations, such indemnification agreements might not be subject to maximum loss clauses, and to date, generally under our real estate obligations, we have not incurred material costs as a result of such obligations under our leases and have not accrued any liabilities related to such indemnification obligations in our Consolidated Financial Statements.\nWe provide limited product warranties, and the majority of our software license agreements contain provisions that indemnify licensees of our software from damages and costs resulting from claims alleging that our software infringes on the intellectual property rights of a third party. Historically, payments made under these provisions have been immaterial. We monitor the conditions that are subject to indemnification to identify if a loss has occurred.\nLitigation contingencies\nFor a description of our accounting policy regarding litigation and loss contingencies, see “Critical Accounting Policies and Estimates” included in Part II, Item 7 of this annual report.\nSEC Investigation\nAs previously disclosed in our public filings, the Audit Committee of our Board of Directors (the Audit Committee) completed its internal investigation (the Audit Committee Investigation) in September 2018. In connection with the Audit Committee Investigation, we voluntarily contacted the U.S. Securities and Exchange Commission (SEC) in April 2018. The SEC commenced a formal investigation, and we continue to cooperate with that investigation. The outcome of such an investigation is difficult to predict. We have incurred, and may continue to incur, significant expenses related to legal and other professional services in connection with the SEC investigation. At this stage, we are unable to assess whether any material loss or adverse effect is reasonably possible as a result of the SEC’s investigation or estimate the range of any potential loss.\nSecurities Class Action and Derivative Litigation\nSecurities class action lawsuits, which have since been consolidated, were filed in May 2018 against us and certain of our former officers, in the U.S. District Court for the Northern District of California. The lead plaintiff’s consolidated amended complaint alleged that, during a purported class period of May 11, 2017 to August 2, 2018, defendants made false and misleading statements in violation of Sections 10(b) and 20(a), and that certain individuals violated Section 20A, of the Securities Exchange Act. Defendants filed motions to dismiss, which the Court granted in an order dated June 14, 2019. Pursuant to that order, plaintiff filed a motion seeking leave to amend and a proposed first amended complaint on July 11, 2019. The Court granted the motion in part on October 2, 2019 and the first amended complaint was filed on October 11, 2019. The Court’s order dismissed certain claims against certain of our former officers. Defendants filed answers on November 7, 2019. On April 20, 2021, to resolve an alleged conflict of interest raised with respect to the lead plaintiff and its counsel, the Court ordered a second Class Notice disclosing the circumstances of the alleged conflict and providing a further period for class members to opt out, which will conclude on July 2, 2021. The initial class opt out period closed on August 25, 2020. In an April 29, 2021 Order, the Court vacated the June 14, 2021 trial date and the trial is now continued indefinitely. A settlement conference has been set for May 24, 2021.\nPurported shareholder derivative lawsuits have been filed against us and certain of our former officers and current and former directors in the U.S. District Courts for the District of Delaware and the Northern District of California, Delaware Chancery Court, and Delaware Superior Court, arising generally out of the same facts and circumstances as alleged in the securities class action and alleging claims for breach of fiduciary duty and related claims; these lawsuits include an action brought derivatively on behalf of our 2008 Employee Stock Purchase Plan. The derivative actions are currently voluntarily stayed in light of the securities class action. No specific amount of damages has been alleged in these lawsuits. We have also received demands from purported stockholders to inspect corporate books and records under Delaware law.\nWe will continue to incur legal fees in connection with these pending cases and demands, including expenses for the reimbursement of legal fees of present and former officers and directors under indemnification obligations. The expense of\ncontinuing to defend such litigation may be significant. We intend to defend these lawsuits vigorously, but there can be no assurance that we will be successful in any defense. If any of the lawsuits are decided adversely, we may be liable for significant damages directly or under our indemnification obligations, which could adversely affect our business, results of operations, and cash flows.\nAt this stage, we are unable to assess whether any material loss or adverse effect is reasonably possible as a result of these lawsuits or estimate the range of any potential loss.\nGSA\nDuring the first quarter of fiscal 2013, we were advised by the Commercial Litigation Branch of the Department of Justice’s (DOJ) Civil Division and the Civil Division of the U.S. Attorney’s Office for the District of Columbia that the government is investigating our compliance with certain provisions of our U.S. General Services Administration (GSA) Multiple Award Schedule Contract No. GS-35F-0240T effective January 24, 2007, including provisions relating to pricing, country of origin, accessibility, and the disclosure of commercial sales practices.\nAs reported on the GSA’s publicly-available database, our total sales under the GSA Schedule contract were approximately $222 million from the period beginning January 2007 and ending September 2012. We fully cooperated with the government throughout its investigation, and in January 2014, representatives of the government indicated that their initial analysis of our actual damages exposure from direct government sales under the GSA Schedule contract was approximately $145 million; since the initial meeting, the government’s analysis of our potential damages exposure relating to direct sales has increased. The government also indicated they would pursue claims for certain sales to California, Florida, and New York as well as sales to the federal government through reseller GSA Schedule contracts, which could significantly increase our potential damages exposure.\nIn 2012, a sealed civil lawsuit was filed against us related to compliance with the GSA Schedule contract and contracts with California, Florida, and New York. On July 18, 2014, the Court-imposed seal expired, and the government intervened in the lawsuit. On September 16, 2014, the states of California and Florida intervened in the lawsuit, and the state of New York notified the Court that it would not intervene. On October 3, 2014, the DOJ filed an amended complaint, which did not state a specific damages amount. On October 17, 2014, California and Florida combined their claims with those of the DOJ and the relator on behalf of New York in an Omnibus Complaint, and a First Amended Omnibus Complaint was filed on October 8, 2015; the state claims also do not state specific damages amounts. On June 6, 2019, we filed a motion seeking summary judgment on all claims asserted by all plaintiffs, and the plaintiffs filed a motion for partial summary judgment on elements of liability on their claims. On October 21, 2019, the DOJ moved for a Prejudgment Writ of Sequestration for the Company to set aside $1,090 million to pay a judgment, should the United States prevail in this litigation, under the Federal Debt Collection Procedures Act. The Writ was sought in response to the Company’s announcement of its plans to distribute the after-tax proceeds of the sale of the Symantec enterprise business to Broadcom to its shareholders via a special dividend. The Court denied the Writ on December 12, 2019, on the basis of the Government’s failure to establish the “probable validity” of the debt, the amount sought to be sequestered, and the Company’s available cash, cash equivalents and short-term investments. The Court permitted the DOJ limited discovery of facts relevant to the Company’s financial state and financial projections and the option to renew its motion if appropriate and supported by the analysis of its own financial expert. That discovery period has now closed. On March 30, 2020, the Court issued an Order granting in part and denying in part our motion for summary judgment and granting in part and denying in part the United States’ motion for partial summary judgment. On September 30, 2020, the Company filed a Motion for Reconsideration of certain rulings in the Court’s March 30 Summary Judgment Order. Court ordered mediations in July 2020 February 2021 were not successful. Trial is set for August 2, 2021. On March 23, 2021, Plaintiffs withdrew their demand for a jury trial and the Company consented to proceed with a bench trail. On May 13, 2021, we reached a settlement in principle with the State of Florida to resolve all claims it asserted in the litigation for $0.5 million. The issue of Relator’s statutory attorney’s fees with respect to the State of Florida’s claims remains unresolved. At this time, our current estimate of the low end of the range of probable estimated losses from this matter is $50 million, inclusive of the settlement with the State of Florida, which we have accrued. It is possible that the litigation could lead to claims or findings of violations of the False Claims Act and could be material to our results of operations and cash flows for any period. Resolution of False Claims Act investigations can ultimately result in the payment of somewhere between one and three times the actual damages proven by the government, plus civil penalties. There is at least a reasonable possibility that a loss may have been incurred in excess of our accrual for this matter.\nHolden v. NortonLifeLock\nOn February 8, 2021, Lauren Holden filed a putative class action in the Circuit Court for Duval County, Florida alleging that the Company violated the Florida wiretapping statute, Florida Security of Communications Act, Fla. Stat. Ann. § 934.01, et. seq., through the use of session replay technology on www.us.norton.com. The complaint defines the class as consisting of Florida residents who visited the website and whose electronic communications were alleged to have been intercepted by the Company without prior consent and, on behalf of the class, seeks statutory damages, attorney’s fees and costs, and injunctive relief. On March 12, 2021, the Company removed the case to the District Court for the Middle District of Florida and filed its Answer and Affirmative Defenses to the complaint. The Company then filed a Motion for Judgment on the Pleadings on April 20, 2021.\nAt this stage, we are unable to assess whether any material loss or adverse effect is reasonably possible as a result of this lawsuit or estimate the range of any potential loss. We dispute these claims and intend to defend them vigorously.\nOther\nWe are involved in a number of other judicial and administrative proceedings that are incidental to our business. Although adverse decisions (or settlements) may occur in one or more of the cases, it is not possible to estimate the possible loss or\nlosses from each of these cases. The final resolution of these lawsuits, individually or in the aggregate, is not expected to have a material adverse effect on our business, results of operations, financial condition or cash flows.\nNote 19. Subsequent Events\nOn May 13, 2021, we entered into a Convertible Notes Purchase Agreement (the “Agreement”) with affiliates of Silver Lake Partners (“Silver Lake”), pursuant to which we agreed to repurchase $250 million in aggregate principal amount of our new 2.50% convertible unsecured senior notes due 2022 (the “Note Repurchase”). These notes are convertible into our common stock at a rate of 59.6341 shares for each $1,000 principal amount of notes, representing a conversion price of approximately $16.77 per share. Under the terms of the Agreement, we will pay Silver Lake an aggregate of $365 million, representing $24.40 per underlying share into which the notes are convertible, accrued and unpaid interest through the date of settlement, and a portion of the cash dividend that we declared on May 10, 2021. The Note Repurchase was completed on May 20, 2021.\n(2) Financial Statement Schedule\nSchedule II\nNORTONLIFELOCK INC.\nVALUATION AND QUALIFYING ACCOUNTS\nAll financial statement schedules have been omitted, since the required information is not applicable or is not present in material amounts, and/or changes to such amounts are immaterial to require submission of the schedule, or because the information required is included in our Consolidated Financial Statements and notes thereto included in this Form 10-K.\n(3) Exhibits\nExhibit\nNumber\nIncorporated by Reference Filed\nHerewith\nExhibit Description Form File No. Exhibit Filing Date\n2.01(§) Asset Purchase Agreement, dated August 8, 2019, by and between Broadcom Inc. and Registrant.\n8-K 000-17781 2.01 8/8/2019\n3.01 Amended and Restated Certificate of Incorporation of Registrant, and all amendments thereto.\nX\n3.02 Amended and Restated Bylaws of Registrant.\n8-K 000-17781 3.02 11/4/2019\n3.03 Certificate of Elimination of Series A Junior Preferred Stock.\n10-K 000-17781 3.06 5/28/2020\n4.01 Form of Common Stock Certificate.\n10-K 000-17781 4.01 5/28/2020\n4.02 Description of Securities.\n10-K 000-17781 4.02 5/28/2020\n4.03 Indenture, dated September 16, 2010, between Registrant and Wells Fargo Bank, National Association, as trustee.\n8-K 000-17781 4.01 9/16/2010\n4.04 Form of Global Note for Symantec’s 3.950% Senior Notes due 2022 (contained in Exhibit No. 4.02 of Form 8-K).\n8-K 000-17781 4.04 6/14/2012\n4.05 Investment Agreement, dated as of February 3, 2016, by and among Registrant and Silver Lake Partners IV Cayman (AIV II), L.P.\n8-K 000-17781 10.01 2/9/2016\n4.06 First Amendment to Investment Agreement, dated as of March 2, 2016, by and among Registrant and Silver Lake Partners IV Cayman (AIV II), L.P.\n8-K 000-17781 10.01 3/7/2016\n4.07 Investment Agreement, dated as of June 12, 2016, by and among Registrant, Bain Capital Fund XI, L.P., Bain Capital Europe Fund IV, L.P. and Silver Lake Partners IV Cayman (AIV II), L.P. (including the form of Indenture attached as Exhibit A thereto).\n8-K 000-17781 2.02 6/14/2016\n4.08 Amendment to Investment Agreement, dated as of July 31, 2016, by and among Registrant, Bain Capital Fund XI, L.P., Bain Capital Europe Fund IV, L.P. and Silver Lake Partners IV Cayman (AIV II), L.P.\n10-Q 000-17781 2.03 8/5/2016\n4.09 Base Indenture, dated as of February 9, 2017, between Registrant and Wells Fargo Bank, National Association, as trustee.\n8-K 000-17781 4.01 2/9/2017\nExhibit\nNumber\nIncorporated by Reference Filed\nHerewith\nExhibit Description Form File No. Exhibit Filing Date\n4.10 First Supplemental Indenture related to the 5% Senior Notes due 2025, dated as of February 9, 2017, between Registrant and Wells Fargo Bank, National Association, as trustee (including form of 5.00% Senior Note due 2025).\n8-K 000-17781 4.02 2/9/2017\n4.11 Third Amendment to Investment Agreement, dated November 11, 2019, by and between NortonLifeLock Inc. and Silver Lake Partners IV Cayman (AIV II), L.P., SLP IV Seal Holdings, L.P. and SLP IV Seal II Holdings, L.P.\n8-K 000-17781 10.01 11/12/2019\n4.12 Second Amendment to Investment Agreement, dated November 11, 2019, by and between NortonLifeLock Inc. and BC Bearcat SPV, LP, BCIP Venture Associates, BCIP Venture Associates-B, BCIP Associates IV (US), L.P., BCIP Associates IV-B (US), L.P., BCIP T Associates IV (US),\n8-K 000-17781 10.02 11/12/2019\n4.13 Indenture, dated as of February 4, 2020, by and between Registrant and Wells Fargo Bank, National Association, as trustee (including the form of 2.00% Convertible Senior Notes Due 2022).\n10-K 000-17781 4.14 5/28/2020\n4.14 Indenture, dated as of February 4, 2020, by and between Registrant and Wells Fargo Bank, National Association, as trustee (including the form of 2.500% Convertible Senior Notes Due 2022).\n10-K 000-17781 4.15 5/28/2020\n10.01(*) Form of Indemnification Agreement for Officers, Directors and Key Employees (form for agreements entered into between January 17, 2006 and March 6, 2016).\n8-K 000-17781 10.01 1/23/2006\n10.02(*) Form of Indemnification Agreement for Officers, Directors and Key Employees, as amended (form for agreements entered into after March 6, 2016).\n8-K 000-17781 10.03 3/7/2016\n10.03(*) Registrant’s Deferred Compensation Plan, restated and amended January 1, 2010, as adopted December 15, 2009.\n10-K 000-17781 10.05 5/24/2010\n10.04(*) Registrant’s 2000 Director Equity Incentive Plan, as amended.\n10-Q 000-17781 10.01 11/1/2011\n10.05(*) Registrant’s 2008 Employee Stock Purchase Plan, as amended.\n10-Q 000-17781 10.06 2/7/2020\n10.06(*) Registrant’s 2013 Equity Incentive Plan, as amended.\n8-K 000-17781 10.01 12/3/2018\n10.07(*) Forms of award agreements under 2013 Equity Incentive Plan.\n10-K 000-17781 10.10 10/26/2018\n10.08(*) Form of FY21 Performance Based Restricted Stock Unit Award Agreements under 2013 Equity Incentive Plan\n10-Q 000-17781 10.03 8/6/2020\n10.09(*) Form of FY22 Performance Based Restricted Stock Unit Award Agreements under 2013 Equity Incentive Plan\nX\n10.10(*) Form of Amended and Restated Restricted Stock Unit Award Agreements under 2013 Equity Incentive Plan\nX\nExhibit\nNumber\nIncorporated by Reference Filed\nHerewith\nExhibit Description Form File No. Exhibit Filing Date\n10.11 Amended and Restated Credit Agreement, effective as of August 1, 2016, among Registrant, the lenders party thereto (the Lenders), Wells Fargo Bank, National Association, as Term Loan A-1/Revolver Administrative Agent and Swingline Lender, JPMorgan Chase Bank, N.A., as Term Loan A-2 Administrative Agent, JPMorgan Chase Bank, N.A., Merrill Lynch, Pierce, Fenner & Smith, Incorporated, Barclays Bank PLC, Citigroup Global Markets Inc., Wells Fargo Securities, LLC, Royal Bank of Canada and Mizuho Bank, Ltd., as Lead Arrangers and Joint Bookrunners in respect of the Term A-2 Facility, Barclays Bank PLC, Citibank, N.A., Wells Fargo Bank, National Association, Royal Bank of Canada, Mizuho Bank, Ltd. And TD Securities (USA) LLC, as Co-Documentation Agents in respect of the Term A-2 Facility, and Bank of America, N.A., as Syndication Agent in respect of Term A-2 Facility.\n10-Q 000-17781 4.03 8/5/2016\n10.12 Term Loan Agreement, dated as of August 1, 2016, among Registrant, JPMorgan Chase Bank, N.A., as Administrative Agent, Bank of America, N.A., as Syndication Agent, and Barclays Bank PLC, Citibank, N.A., Wells Fargo Bank, National Association, Royal Bank of Canada, Mizuho Bank, Ltd., and TD Securities (USA) LLC, as Co-Documentation Agents, JPMorgan Chase Bank, N.A., Merrill Lynch, Pierce, Fenner & Smith Incorporated, Barclays Bank, PLC, Citigroup Global Markets Inc., Wells Fargo Securities, LLC, Royal Bank of Canada and Mizuho Bank, Ltd., as Joint Lead Arrangers and Joint Bookrunners.\n10-Q 000-17781 4.05 8/5/2016\n10.13 Amendment Agreement, dated as of July 18, 2016, by and among Registrant, Symantec Operating Corporation, the Lenders and the New Term Lenders, Wells Fargo Bank, National Association, and JPMorgan Chase Bank, N.A.\n10-Q 000-17781 4.02 8/5/2016\n10.14 Assignment and Assumption, dated October 3, 2016, to the Term Loan Agreement dated as of August 1, 2016, among Registrant, JPMorgan Chase Bank, N.A., as Administrative Agent, Bank of America, N.A., as Syndication Agent, and Barclays Bank PLC, Citibank, N.A., Wells Fargo Bank, National Association, Royal Bank of Canada, Mizuho Bank, Ltd., and TD Securities (USA) LLC, as Co-Documentation Agents, JPMorgan Chase Bank, N.A., Merrill Lynch, Pierce, Fenner & Smith Incorporated, Barclays Bank, PLC, Citigroup Global Markets Inc., Wells Fargo Securities, LLC, Royal Bank of Canada and Mizuho Bank, Ltd., as Joint Lead Arrangers and Joint Bookrunners.\n10-Q 000-17781 4.01 2/3/2017\nExhibit\nNumber\nIncorporated by Reference Filed\nHerewith\nExhibit Description Form File No. Exhibit Filing Date\n10.15 First Amendment, dated December 12, 2016, to the Term Loan Agreement, dated as of August 1, 2016, among Registrant, JPMorgan Chase Bank, N.A., as Administrative Agent, Bank of America, N.A., as Syndication Agent, and Barclays Bank PLC, Citibank, N.A., Wells Fargo Bank, National Association, Royal Bank of Canada, Mizuho Bank, Ltd., and TD Securities (USA) LLC, as Co-Documentation Agents, JPMorgan Chase Bank, N.A., Merrill Lynch, Pierce, Fenner & Smith Incorporated, Barclays Bank, PLC, Citigroup Global Markets Inc., Wells Fargo Securities, LLC, Royal Bank of Canada and Mizuho Bank, Ltd., as Joint Lead Arrangers and Joint Bookrunners.\n10-Q 000-17781 4.02 2/3/2017\n10.16 First Amendment, dated December 12, 2016, to the Credit Agreement, effective as of August 1, 2016, among the Registrant, the lenders party thereto (the Lenders), Wells Fargo Bank, National Association, as Term Loan A-1/Revolver Administrative Agent and Swingline Lender, JPMorgan Chase Bank, N.A., as Term Loan A-2 Administrative Agent, JPMorgan Chase Bank, N.A., Merrill Lynch, Pierce, Fenner & Smith, Incorporated, Barclays Bank PLC, Citigroup Global Markets Inc., Wells Fargo Securities, LLC, Royal Bank of Canada and Mizuho Bank, Ltd., as Lead Arrangers and Joint Bookrunners in respect of the Term A-2 Facility, Barclays Bank PLC, Citibank, N.A., Wells Fargo Bank, National Association, Royal Bank of Canada, Mizuho Bank, Ltd. And TD Securities (USA) LLC, as Co-Documentation Agents in respect of the Term A-2 Facility, and Bank of America, N.A., as Syndication Agent in respect of Term A-2 Facility.\n10-Q 000-17781 4.03 2/3/2017\n10.17(*) Registrant’s Senior Executive Incentive Plan, as amended and restated.\n8-K 000-17781 10.03 10/25/2013\n10.18(*) Registrant’s Executive Retention Plan, as amended and restated.\nX\n10.19(*) Registrant’s Executive Severance Plan.\nX\n10.20(*) FY21 Executive Annual Incentive Plan - Chief Executive Officer.\n10-Q 000-17781 10.01 8/6/2020\n10.21(*) FY21 Executive Annual Incentive Plan - Senior Vice President and Executive Vice President.\n10-Q 000-17781 10.02 8/6/2020\n10.22(§§) Assignment of Copyright and Other Intellectual Property Rights, by and between Peter Norton and Peter Norton Computing, Inc., dated August 31, 1990. S-4 33-35385 10.37 6/13/1990\n10.23(†) Environmental Indemnity Agreement, dated April 23, 1999, between Veritas and Fairchild Semiconductor Corporation, included as Exhibit C to that certain Agreement of Purchase and Sale, dated March 29, 1999, between Veritas and Fairchild Semiconductor of California.\nS-1/A 333-83777 10.27 8/6/1999\n10.24 Amendment, dated June 20, 2007, to the Amended and Restated Agreement Respecting Certain Rights of Publicity dated as of August 31, 1990, by and between Peter Norton and Registrant.\n10-Q 000-17781 10.01 8/7/2007\nExhibit\nNumber\nIncorporated by Reference Filed\nHerewith\nExhibit Description Form File No. Exhibit Filing Date\n10.25 Second Amendment and Limited Waiver to Amended and Restated Credit Agreement dated as of June 22, 2018.\n10-Q 000-17781 10.01 11/16/2018\n10.26 Second Amendment and Limited Waiver to Term Loan dated as of June 22, 2018.\n10-Q 000-17781 10.02 11/16/2018\n10.27(*) Registrant’s Offer Letter with Natalie M. Derse dated June 19, 2020\n10-Q 000-17781 10.01 7/8/2020\n10.28 Credit Agreement, effective as of November 4, 2019, among NortonLifeLock Inc., the issuing banks and lenders party thereto (the Lenders), Wells Fargo Bank, National Association, as Revolver Administrative Agent and Swingline Lender, JPMorgan Chase Bank, N.A., as Term Loan Administrative Agent and Collateral Agent, JPMorgan Chase Bank, N.A., Wells Fargo Securities, LLC, BofA Securities, Inc., Mizuho Bank, Ltd., Barclays Bank PLC, and The Bank of Nova Scotia, as Lead Arrangers and Joint Bookrunners, Bank of America, N.A., Mizuho Bank, Ltd., Barclays Bank PLC and The Bank of Nova Scotia, as Syndication Agents and and Goldman Sachs Bank USA, HSBC Securities (USA) Inc., MUFG Bank, Ltd., SunTrust Robinson Humphrey, Inc., Citizens Bank, N.A., BMO Capital Markets Corp., BNP Paribas Securities Corp. and Santander Bank, N.A., as Co-Documentation Agents.\n8-K 000-17781 10.01 11/4/2019\n10.29 APA Letter Agreement dated October 1, 2020 by and between the Company and Broadcom Inc.\n8-K 000-17781 10.01 7/8/2020\n10.30(+) Stock Purchase Agreement dated December 7, 2020 between the Company and Alpaca HoldCo GmbH, Alpaca TopCo GmbH.\n10-Q 000-17781 10.01 2/5/2021\n10.31 First Amendment, effective as of May [7], 2021, among NortonLifeLock Inc., JPMorgan Chase Bank, N.A., as Term Loan Administrative Agent, Wells Fargo Bank, National Association, as Revolver Administrative Agent, and the lenders and other parties party thereto.\nX\n21.01 Subsidiaries of Registrant.\nX\n23.01 Consent of Independent Registered Public Accounting Firm.\nX\n24.01 Power of Attorney (see Signature page to this annual report).\nX\n31.01 Certification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n31.02 Certification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n32.01(††) Certification of Chief Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n32.02(††) Certification of Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\nExhibit\nNumber\nIncorporated by Reference Filed\nHerewith\nExhibit Description Form File No. Exhibit Filing Date\n101.00 The following financial information from NortonLifeLock Inc.'s Annual Report on Form 10-K for the fiscal year ended April 2, 2021 are formatted in iXBRL (Inline eXtensible Business Reporting Language): (i) Consolidated Balance Sheets, (ii) Consolidated Statements of Operations, (iii) Consolidated Statements of Comprehensive Income (Loss), (iv) Consolidated Statements of Stockholders’ Equity (Deficit), (vi) Consolidated Statements of Cash Flows, and (vi) Notes to the Consolidated Financial Statements, tagged as blocks of text and including detailed tags. X\n104.00 Cover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101) X\n* Indicates a management contract, compensatory plan or arrangement.\n** Filed by LifeLock, Inc.\n§ The exhibits and schedules to this agreement have been omitted pursuant to Item 601(b)(2) of Regulation S-K. The Registrant agrees to furnish supplementally copies of any such exhibits and schedules to the SEC upon request.\n§§ Paper filing.\n† Filed by Veritas Software Corporation.\n†† This exhibit is being furnished, rather than filed, and shall not be deemed incorporated by reference into any filing, in accordance with Item 601 of Regulation S-K.\n+ Certain portions of this document that constitute confidential information have been redacted in accordance with Regulations S-K, Item 601(b)(10).\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, in the City of Mountain View, State of California, on the 21st day of May 2021.\nNORTONLIFELOCK INC.\nBy: /s/ Vincent Pilette\nVincent Pilette\nChief Executive Officer and Director\nKNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Vincent Pilette, Natalie Derse, and Bryan Ko, and each or any of them, his or her attorneys-in-fact, each with the power of substitution, for him or her in any and all capacities to sign any and all amendments to this report on Form 10-K and any other documents in connection therewith, with the Securities and Exchange Commission, granting unto said attorneys-in-fact, and each of them, full power and authority to do and perform each and every act and thing requisite and necessary to be done in and about the premises, as fully to all intents and purposes as he or she might or could do in person, hereby ratifying and confirming all that such attorneys-in-fact, or his or their substitute or substitutes, may lawfully do or cause to be done by virtue hereof. This Power of Attorney may be signed in several counterparts.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated below.\nSignature Title Date\n/s/ Vincent Pilette Chief Executive Officer and Director\n(Principal Executive Officer)\nMay 21, 2021\nVincent Pilette\n/s/ Natalie Derse Executive Vice President and Chief Financial Officer\n(Principal Financial Officer and Principal Accounting Officer) May 21, 2021\nNatalie Derse\n/s/ Frank E. Dangeard Chairman of the Board May 21, 2021\nFrank E. Dangeard\n/s/ Sue Barsamian Director May 21, 2021\nSue Barsamian\n/s/ Eric K. Brandt Director May 21, 2021\nEric K. Brandt\n/s/ Nora Denzel Director May 21, 2021\nNora Denzel\n/s/ Peter A. Feld Director May 21, 2021\nPeter A. Feld\n/s/ Kenneth Y. Hao Director May 21, 2021\nKenneth Y. Hao\n/s/ Emily Heath Director May 21, 2021\nEmily Heath\n/s/ Sherrese M. Smith Director May 21, 2021\nSherrese M. Smith"
}