{
    "cik": "857005",
    "company": "PTC INC.",
    "filing_type": "10-K",
    "filing_date": "2021-11-22",
    "period_of_report": "2021-09-30",
    "sic": "7372",
    "state_of_inc": "MA",
    "state_location": "MA",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/857005/0001564590-21-057806-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/857005/000156459021057806/ptc-10k_20210930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/857005/0001564590-21-057806.txt",
    "filename": "857005_10K_2021_0001564590-21-057806.htm",
    "item_1": "ITEM 1.\nBusiness\nPTC is a global software and services company that enables industrial companies to improve growth and profitability with a portfolio of innovative digital solutions that work together to transform how physical products are engineered, manufactured, and serviced. Our award-winning technology portfolio spans the computer-aided design (CAD), product lifecycle management (PLM), Industrial Internet of Things (IIoT), and Augmented Reality (AR) markets. Our technology can be delivered on premises, in the cloud, or in a hybrid model.\nOur customer base includes some of the world’s most innovative manufacturers in the aerospace and defense, automotive, electronics and high tech, industrial machinery and equipment, life sciences, oil and gas, retail and consumer products industries. Our solutions enable industrial companies to create a closed loop of information shared across their organization’s entire value chain. This “digital thread” can drive excellence in engineering, efficiency in manufacturing operations and service delivery, and innovation across product offerings and business models. With our solutions, digital transforms physical.\nAs a purpose-driven company, we don’t just imagine a better world, we help create it. Our purpose statement - Power To Create - is a commitment to our customers to help them solve difficult challenges; a commitment to our employees to build a culture that supports diversity, equity, and inclusion so they can achieve their greatest potential; and a commitment to support the communities our employees live and work in globally.\nWe generate revenue through the sale of software subscriptions, which include license access and support (technical support and software updates); support for existing perpetual licenses; professional services (consulting, implementation, and training); and cloud services (hosting for our software and SaaS).\nOur Strategy\nThere are three key elements to our strategy to deliver long-term shareholder value.\nAlign with market demand to deliver technology solutions aligned with secular market trends, including digital transformation, SaaS, remote collaboration and AI. We believe demand for solutions such as ours that enable work from home and/or office, global team and supply chain collaboration, remote asset management, and remote frontline worker training and support is strong. In addition, there is growing customer demand for SaaS offerings; we intend to increase our investment in SaaS initiatives, while better aligning with SaaS best practices in order to meet the needs of the market.\nDrive sustainable top line ARR growth by expanding our footprint with existing customers, cross-selling complementary solutions in our customer base, adding new customers and by maintaining strong customer retention rates through our global field organization and partner ecosystem. FY’21 marked the fourth consecutive year of double-digit ARR growth, despite the manufacturing and macroeconomic environments over that period. In FY’22, we are evolving our organizational structure to align better with a traditional SaaS model and create a much-improved customer experience.\nGrow operating cash flow through continued operating discipline within a recurring business model. Our organizational changes are designed to grow ARR, increase customer retention, and improve operating efficiency, we expect to grow our operating cash flow.\nOur Principal Products and Services\nIn order to drive clear focus, we have divided our business into two key product groups: Digital Thread and Velocity. The Digital Thread business is focused on customers that are embracing digital transformation and the Velocity business is focused on customers that prioritize agile product development.\nDigital Thread - Core\nOur Creo® 3D CAD technology enables the digital design, testing, and modification of product models. With its design simulation, additive manufacturing, and generative design innovations, we enable our customers to be first to market with differentiated products. From initial concept to design, simulation, and analysis, Creo provides designers with innovative tools to efficiently create better products, faster.\nOur Windchill® PLM application suite manages all aspects of the product development lifecycle - from concept through service and retirement - by enabling a digital thread of product parts, materials, and configuration information. Windchill provides real-time information sharing, dynamic data visualization, and the ability to collaborate across geographically-distributed teams, enabling manufacturers to elevate their product development process. With its open architecture that integrates with other enterprise systems, Windchill provides a solid foundation for a product-driven digital thread.\nDigital Thread - Growth\nFlexible and purpose-built for Industrial IoT, our ThingWorx® platform offers a rich set of capabilities that enable enterprises to digitally transform every aspect of their business with innovative solutions that are simple to create, easy to implement, scalable to meet future needs, and designed to enable customers to accelerate time to value.\nOur Vuforia® augmented reality technology enables the visualization of digital information in a physical context and the creation of AR experiences to deliver workforce productivity and business results in manufacturing, service, engineering, and operations. Vuforia enables augmented reality and mixed reality experiences for the industrial enterprise. Vuforia solutions equip frontline workers with focused and effective step-by-step instructions, procedural guidance, skill development and remote assistance that enable enterprises to reduce errors, increase asset utilization and drive higher profitability.\nDigital Thread - Focused Solutions Group (FSG)\nOur IntegrityTM application lifecycle management (ALM) and model-based systems engineering capabilities enable users to manage system models, software configurations, and test plans and defects.\nOur Servigistics® service parts management solution enables customers to effectively manage service parts, improve their products and services, and increase customer satisfaction.\nVelocity\nOur Onshape® Software-as-a-Service (SaaS) product development platform unites computer-aided design with data management, collaboration tools, and real-time analytics. A cloud-native multi-tenant solution that can be instantly deployed on virtually any computer or mobile device, Onshape enables teams to work together from just about anywhere. Real-time design reviews, commenting, and simultaneous editing enable a collaborative workflow where multiple design iterations can be completed in parallel and merged into the final design.\nOur Arena® SaaS PLM solution enables product teams to collaborate virtually anytime and anywhere, making it easier to share the latest product and quality information with internal teams and supply chain partners and help deliver innovative products to customers faster. Our Arena quality management system software connects quality and product designs into a single system to simplify regulatory compliance.\nOur Markets and How We Address Them\nWe compete in the CAD, PLM, IIoT and AR markets. The markets we serve present different growth opportunities for us. We see greater opportunity for market growth for our IIoT and AR solutions for the enterprise and our SaaS solutions, followed by more moderate market growth for our on-premise CAD and PLM solutions, both of which have been growing faster than their respective market growth rates.\nWe derive most of our sales from products and services sold directly by our sales force to end-user customers. Approximately 30% to 35% of our sales of products and services are through third-party resellers. Our sales force focuses on large accounts, while our reseller channel provides a cost-effective means of covering the small- and medium-size business market. Our strategic alliance partners enable us to increase our market reach, offer broader solutions, and add compelling technology to our offerings. Our strategic services partners provide service offerings to help customers implement our product offerings.\nAdditional financial information about our segments and international and domestic operations may be found in Note 18. Segment and Geographic Information of Notes to Consolidated Financial Statements in this Form 10-K, which information is incorporated herein by reference.\nCompetition\nWe compete with a number of companies whose offerings address one or more specific functional areas covered by our solutions. In our IIoT business, we compete with large established companies such as Amazon, IBM, Oracle, SAP, Siemens AG, and Software AG as well as customers’ homegrown solutions. There are also a number of smaller companies that compete in the market for IIoT products. For enterprise CAD and PLM solutions, we compete with large established companies including Autodesk, Dassault Systèmes SA, and Siemens AG. For our PLM solutions, we also compete with Oracle and SAP, but we believe our products are more specifically targeted toward the business process challenges of manufacturing companies and offer broader and deeper functionality for those processes than ERP-based solutions. For our AR products, our primary competitors include TeamViewer, ScopeAR and Re’Flekt. Although Microsoft is a partner (especially in IoT), it is a competitor in AR; the competing products are Microsoft Dynamics 365 Remote Assist and Dynamics 365 Guides.\nProprietary Rights\nOur software products and related technical know-how, along with our trademarks, including our company names, product names and logos, are proprietary. We protect our intellectual property rights in these items by relying on copyrights, trademarks, patents and common law safeguards, including trade secret protection. The nature and extent of such legal protection depends in part on the type of intellectual property right and the relevant jurisdiction. In the U.S., we are generally able to maintain our trademark registrations for as long as the trademarks are in use and to maintain our patents for up to 20 years from the earliest effective filing date. We also use license management and other anti-piracy\ntechnology measures, as well as contractual restrictions, to curtail the unauthorized use and distribution of our products.\nOur proprietary rights are subject to risks and uncertainties described under",
    "item_1A": "ITEM 1A.\nRisk Factors\nThe following are important factors we have identified that could affect our future results and your investment in our securities. You should consider them carefully when evaluating an investment in PTC securities or any forward-looking statements made by us, including those contained in this Annual Report, because these factors could cause actual results to differ materially from historical results or the performance projected in forward-looking statements. The risks described below are not the only risks we face. Additional risks and uncertainties not currently known to us or that we currently deem to be immaterial may also materially adversely affect our business, financial condition and/or operating results.\nI.Risks Related to Our Business Operations and Industry\nWe face significant competition, which may reduce our profitability and limit or reduce our market share.\nThe markets for our products and solutions are rapidly changing and characterized by intense competition, disruptive technology developments, evolving distribution models and increasingly lower barriers to entry. If we are unable to provide products and solutions that address customers’ needs as well as our competitors’ products and solutions do, or to align our pricing, licensing and delivery models with customer preferences, we could lose customers and/or fail to attract new customers, which could cause us to lose revenue and market share.\nFor example, the COVID-19 pandemic has caused companies worldwide to close their offices and their employees to have to work remotely from their homes, which has focused companies on the need for solutions that empower and support remote work by employees. We believe customers and potential customers will increasingly seek software solutions that support remote work by employees. Although many of our solutions support remote work, others are less efficient at doing so. We have embarked on an effort to make our solutions available on a SaaS platform; however, this will require significant effort and investment and we cannot be sure that we will be able to make our solutions available as SaaS solutions as quickly as we expect or that customers will adopt them as we expect. If we are unable to compete successfully with competitors offering SaaS solutions, we could lose customers and/or fail to attract new customers, which could cause us to lose revenue and market share, which would adversely affect our business and financial results.\nIn addition, competitive pressures could cause us to reduce our prices, which could reduce our revenue and margins.\nFinally, our current and potential competitors range from large and well-established companies to emerging start-ups. Some of our competitors and potential competitors have greater name recognition in the markets we serve and greater financial, technical, sales and marketing, and other resources, which could limit our ability to gain customer recognition and confidence in our products and solutions and successfully sell our products and solutions, which could adversely affect our ability to grow our business.\nA breach of security in our products or computer systems, or those of our third-party service providers, could compromise the integrity of our products, cause loss of data, harm our reputation, create additional liability and adversely impact our financial results.\nWe have implemented and continue to implement measures intended to maintain the security and integrity of our products, source code and IT systems. The potential for a security breach or system disruption has significantly increased over time as the scope, number, intensity and sophistication of attempted cyberattacks and cyber intrusions have increased. We face cyberattacks and intrusions designed to access and exfiltrate information and to disrupt and lock-up access to systems for the purpose of demanding a ransom payment. Despite efforts to create security barriers to such threats, it is impossible for us to eliminate the risk of a successful cyberattack or intrusion, and, in fact, we deal with security issues on a regular basis and have experienced security incidents from time to time. Accordingly, there is a risk that a cyberattack or intrusion will be successful and that such event will be material.\nIn addition, we offer cloud services to our customers and some of our products, including our SaaS products, are hosted by third-party service providers, which expose us to additional risks as those repositories of our customers’ proprietary data may be targeted and a cyberattack or intrusion may be\nsuccessful and material. Interception of data transmission, misappropriation or modification of data, corruption of data and attacks against our service providers may adversely affect our products or product and service delivery. Malicious code, viruses or vulnerabilities that are undetected by our service providers may disrupt our business operations generally and may have a disproportionate effect on those of our products that are developed and delivered in the cloud environment.\nWhile we devote resources to maintaining the security and integrity of our products and systems, as well as performing due diligence of our third-party service providers, a significant breach of the security and/or integrity of our products or systems, or those of our third-party service providers, could prevent our products from functioning properly, could enable access to sensitive, proprietary or confidential information, including that of our customers, or could disrupt our business operations or those of our customers. This could require us to incur significant costs of investigation, remediation and/or payment of a ransom; harm our reputation; cause customers to stop buying our products; and cause us to face lawsuits and potential liability, which could have a material adverse effect on our financial condition and results of operations.\nWe increasingly rely on third-party providers of cloud infrastructure services to deliver our offerings to users on our platform, and any disruption of or interference with our use of these services could adversely affect our business.\nOur continued growth depends in part on the ability of our existing and potential customers to use and access our cloud services or our website in order to download our software or encrypted access keys for our software within an acceptable amount of time. We use a number of third-party service providers, which we do not control, for key components of our infrastructure, particularly with respect to development and delivery of our cloud-based products. The use of these service providers gives us greater flexibility in efficiently delivering a more tailored, scalable customer experience, but also exposes us to additional risks and vulnerabilities. Third-party service providers operate their own platforms that we access, and we are, therefore, vulnerable to their service interruptions. We may experience interruptions, delays and outages in service and availability from time to time as a result of problems with our third-party service providers’ infrastructure. Lack of availability of this infrastructure could be due to a number of potential causes including technical failures, natural disasters, fraud or security attacks that we cannot predict or prevent. Such outages could lead to the triggering of our service level agreements and the issuance of credits to our cloud-based product customers, which may impact our business and consolidated financial statements.\nIf we are unable to renew our agreements with our cloud service providers on commercially reasonable terms, or our agreement is prematurely terminated, or we need to add new cloud services providers to increase capacity and uptime, we could experience interruptions, downtime, delays, and additional expenses related to transferring to and providing support for these new platforms. Any of the above circumstances or events may harm our reputation and brand, reduce the availability or usage of our platforms and impair our ability to attract new users, any of which could adversely affect our business, financial condition and results of operations.\nWe may be unable to hire or retain personnel with the necessary skills to operate and grow our business, which could adversely affect our ability to compete.\nOur success depends upon our ability to attract and retain highly skilled managerial, sales and marketing, technical, financial and administrative personnel to operate and grow our business. Competition for such personnel in our industry is intense, particularly in the Boston, Massachusetts area where our global headquarters is located.\nThe technical personnel required to develop our products and solutions are in high demand, particularly technical personnel with augmented and virtual reality and analytics expertise as there are comparatively fewer persons with those skills. If we are unable to attract and retain technical personnel with the requisite skills, our product and solution development efforts could be delayed, which could adversely affect our ability to compete and thereby adversely affect our revenues and profitability.\nThe managerial, sales and marketing, financial and administrative personnel necessary to guide our operations, market and sell our solutions and support our business operations are also in high demand due to the intense competition in our industry.\nIf we are unable to attract and retain the personnel we need to develop compelling products and solutions, and guide, operate and support our business, we may be unable to successfully compete in the marketplace, which would adversely affect our revenues and profitability.\nThe extent to which the COVID-19 pandemic may impact our business is uncertain and it could materially adversely affect our financial condition and results of operations.\nThe COVID-19 pandemic continues to impact global economic activity and create macroeconomic uncertainty. Public and private sector policies and initiatives to reduce the transmission of COVID-19, such as the imposition of travel restrictions, temporary closures of businesses, and the adoption of remote working, have significantly changed the way we and our customers work. The effects and duration of this disruption remain uncertain.\nWhile PTC was able to transition to remote working without significant disruption to our day-to-day operations, disruption to our customers’ and our prospects’ operations and the way we work with them have adversely affected our business.\nDemand for our solutions declined and could decline further due to challenges associated with conducting in-person sales meetings and project scoping and implementation activities while social distancing measures are in place, which has deterred or prevented, and could further deter or prevent, customers from proceeding with new software purchases and deployments. Likewise, temporary plant closures, layoffs and furloughs at our customers and the challenges they face forecasting business needs in this time of global economic uncertainty have caused, and could continue to cause, our customers to delay or reduce new license purchases.\nLonger term plant closures and layoffs among our customer base could cause existing subscription customers to renew fewer existing licenses when their subscriptions come up for renewal and could cause existing support customers to discontinue support at the time of renewal. If churn increases in the future, our ARR and financial results and condition could be negatively impacted.\nReductions in new subscription sales and/or renewals and in professional services delivered could reduce our ARR growth or cause our ARR to decline, and would reduce our professional services revenue, all of which would adversely affect our revenue, earnings and cash flow. Further prolonged disruption could continue to negatively impact the businesses of our customers and prospective customers and, therefore, our business and financial condition.\nIf our business declines due to the factors above, we could be required to reduce our expenses, which could result in material restructuring charges and/or reduce or delay investments in our business, including hiring. Reductions in our workforce and/or investments in our business could hamper our ability to recover and compete successfully, which could adversely affect our business and results of operations.\nWe depend on sales within the discrete manufacturing sector and our business could be adversely affected if manufacturing activity does not grow, or if it contracts, or if manufacturers are adversely affected by other economic factors.\nA large amount of our sales are to customers in the discrete manufacturing sector. Manufacturers worldwide are facing increasing uncertainty about the global economic climate due to, among other factors, the COVID-19 pandemic and the geopolitical environment. In addition, within the technology industry the U.S. Administration’s focus on technology transactions with non-U.S. entities and potential expanded prohibitions has created additional uncertainty. In light of these concerns, customers may delay, reduce or forego purchases of our solutions, which would adversely affect our business and financial results.\nIf we fail to successfully manage our transition to a SaaS company, our business and financial results could be adversely affected.\nBecoming a SaaS company requires considerable additional investment in our organization. Whether our transition will be successful and will accomplish our business and financial objectives is subject to uncertainties, including but not limited to: customer demand, attach and renewal rates, channel adoption, our ability to further develop and scale infrastructure, our ability to include functionality and usability in such offerings that address customer requirements, and our costs. If we are unable to successfully establish these new offerings and navigate our business transition due to these risks and uncertainties, our business and financial results could be adversely impacted.\nBecause our sales and operations are globally dispersed, we face additional compliance risks and any compliance failure could adversely affect our business and financial results.\nWe sell and deliver software and services, and maintain support operations, in many countries whose laws and practices differ from one another and are subject to unexpected changes. Managing these geographically dispersed operations requires significant attention and resources to ensure compliance with laws of those countries and those of the U.S. governing our activities in non-U.S. countries.\nThose laws include, but are not limited to, anti-corruption laws and regulations (including the U.S. Foreign Corrupt Practices Act (FCPA) and the U.K. Bribery Act 2010), data privacy laws and regulations (including the European Union's General Data Privacy Regulation), and trade and economic sanctions laws and regulations (including laws administered by the U.S. Department of the Treasury’s Office of Foreign Assets Control, the U.S. State Department, the U.S. Department of Commerce, the United Nations Security Council and other relevant sanctions authorities). Our compliance risks are heightened due to the go-to-market approach for our business that relies heavily on a partner ecosystem, the fact that we operate in, and are expanding into, countries with a higher incidence of corruption and fraudulent business practices than others, the fact that we deal with governments and state-owned business enterprises, and the fact that global enforcement of laws has significantly increased.\nAccordingly, while we strive to maintain a comprehensive compliance program, we cannot guarantee that an employee, agent or business partner will not act in violation of our policies or U.S. or other applicable laws or that we may inadvertently violate such laws. Investigations of alleged violations of those laws can be expensive and disruptive. Violations of such laws can lead to civil and/or criminal prosecutions, substantial fines and other sanctions, including the revocation of our rights to continue certain operations, and also cause business and reputation loss, which could adversely affect our financial results and/or stock price.\nII.Risks Related to Acquisitions and Strategic Relationships\nBusinesses we acquire may not generate the revenue and earnings we anticipate and may otherwise adversely affect our business.\nWe have acquired, and intend to continue to acquire, new businesses and technologies. If we fail to successfully integrate and manage the businesses and technologies we acquire, if an acquisition does not further our business strategy as we expect, or if a business we acquire has unexpected legal or financial liabilities, our operating results will be adversely affected.\nThe types of issues that we may face in integrating and operating the acquired business include:\n•\ndifficulties managing an acquired company’s technologies or lines of business or entering new markets where we have limited or no prior experience or where competitors may have stronger market positions;\n•\nunanticipated operating difficulties in connection with the acquired entities, including potential declines in revenue of the acquired entity;\n•\ndiversion of management and employee attention;\n•\nloss of key personnel; and\n•\npotential incompatibility of business cultures.\nFurther, if we do not achieve the expected return on our investments it could impair the intangible assets and goodwill that we recorded as part of an acquisition, which could require us to record a reduction to the value of those assets.\nWe may incur significant debt or issue a material amount of debt or equity securities to finance an acquisition, which could adversely affect our operating flexibility and financial statements.\nIf we were to incur a significant amount of debt-whether by borrowing funds or issuing new debt securities-to finance an acquisition, our interest expense, debt service requirements and leverage would increase significantly. The increases in these expenses and in our leverage could adversely impact our ability to operate the company as we might otherwise and to borrow additional amounts.\nIf we were to issue a significant amount of equity securities in connection with an acquisition, existing stockholders would be diluted and earnings per share could decrease.\nOur inability to maintain or develop our strategic and technology relationships could adversely affect our business.\nWe have many strategic and technology relationships with other companies with which we work to offer complementary solutions and services, that market and sell our solutions, and that provide technologies that we embed in our solutions. We may not realize the expected benefits from these relationships and such relationships may be terminated by the other party. If these companies fail to perform or if a company terminates or substantially alters the terms of the relationship, we could suffer delays in product development, reduced sales or other operational difficulties and our business, results of operations and financial condition could be materially adversely affected.\nIII.Risks Related to Our Intellectual Property\nWe may be unable to adequately protect our proprietary rights, which could adversely affect our business and our ability to compete effectively.\nOur software products are proprietary. We protect our intellectual property rights in these items by relying on copyrights, trademarks, patents and common law safeguards, including trade secret protection, as well as restrictions on disclosures and transferability contained in our agreements with other parties. Despite these measures, the laws of all relevant jurisdictions may not afford adequate protection to our products and other intellectual property. In addition, we frequently encounter attempts by individuals and companies to pirate our software. If our measures to protect our intellectual property rights fail, others may be able to use those rights, which could reduce our competitiveness and revenues.\nIn addition, any legal action to protect our intellectual property rights that we may bring or be engaged in could be costly, may distract management from day-to-day operations and may lead to additional claims against us, and we may not succeed, all of which would materially adversely affect our operating results.\nIntellectual property infringement claims could be asserted against us, which could be expensive to defend and could result in limitations on our use of the claimed intellectual property.\nThe software industry is characterized by frequent litigation regarding copyright, patent and other intellectual property rights. If a lawsuit of this type is filed, it could result in significant expense to us and divert the efforts of our technical and management personnel. We cannot be sure that we would prevail against any such asserted claims. If we did not prevail, we could be prevented from using the claimed intellectual property or be required to enter into royalty or licensing agreements, which might not be available on terms acceptable to us. In addition to possible claims with respect to our proprietary products, some of our products contain technology developed by and licensed from third parties and we may likewise be susceptible to infringement claims with respect to these third-party technologies.\nIV.Risks Related to Our Indebtedness\nOur substantial indebtedness could adversely affect our business, financial condition and results of operations, as well as our ability to meet our payment obligations under our debt.\nWe have a significant amount of indebtedness. As of November 19, 2021, our total debt outstanding was approximately $1,450 billion, $1 billion of which was associated with the 3.625% Senior Notes and 4.000% Senior Notes (together, “Senior Notes”) issued February 2020, which mature in February 2025 and 2028, respectively, and are unsecured, and $450 million of which was borrowed under our credit facility, which matures in February 2025. All amounts outstanding under the credit facility and the Senior Notes will be due and payable in full on their respective maturity dates. As of November 19, 2021, we had unused commitments under our credit facility of $550 million. PTC Inc. and one of our foreign subsidiaries are eligible borrowers under the credit facility and certain other foreign subsidiaries may become borrowers under our credit facility in the future, subject to certain conditions.\nSpecifically, our level of debt could:\n•\nmake it more difficult for us to satisfy our debt obligations and other ongoing business obligations, which may result in defaults;\n•\nresult in an event of default if we fail to comply with the financial and other covenants contained in the agreements governing our debt instruments, which could result in all of our debt becoming immediately due and payable or require us to negotiate an amendment to financial or other covenants that could cause us to incur additional fees and expenses;\n•\nlimit our ability to obtain additional financing to fund future working capital, capital expenditures, acquisitions or other general corporate requirements;\n•\nreduce the availability of our cash to fund working capital, capital expenditures, acquisitions and other general corporate purposes and limit our ability to obtain additional financing for these purposes;\n•\nincrease our vulnerability to the impact of adverse economic and industry conditions;\n•\nexpose us to the risk of increased interest rates as certain of our borrowings, including borrowings under the credit facility, are at variable rates of interest;\n•\nlimit our flexibility in planning for, or reacting to, and increasing our vulnerability to, changes in our business, the industries in which we operate, and the overall economy;\n•\nplace us at a competitive disadvantage compared to other, less leveraged competitors; and\n•\nincrease our cost of borrowing.\nAny of the above-listed factors could have an adverse effect on our business, financial condition and results of operations and our ability to meet our payment obligations under our debt agreements.\nDespite our current level of indebtedness, we and our subsidiaries may still be able to incur substantially more debt and other obligations. This could further exacerbate the risks to our financial condition described above.\nWe and our subsidiaries may be able to incur significant additional indebtedness and other obligations in the future, including secured debt. Although the credit agreement governing our credit facility contains restrictions on the incurrence of additional indebtedness, these restrictions are subject to a number of qualifications and exceptions. The additional indebtedness incurred in compliance with these restrictions could be substantial. In addition, the credit agreement and the indenture governing the Senior Notes will not prevent us from incurring obligations that do not constitute indebtedness. If new debt is added to our current debt levels, or we incur other obligations, the related risks that we now face could intensify.\nWe may not be able to generate enough cash to service all our indebtedness and may be forced to take other actions to satisfy our obligations under our indebtedness, which may not be successful.\nOur ability to make scheduled payments on or refinance our debt obligations depends on our financial condition and operating performance, which are subject to prevailing economic and competitive conditions and to certain financial, business, legislative, regulatory and other factors, some of which are beyond our control. We may be unable to maintain a level of cash flows from operating activities sufficient to permit us to pay the principal, premium, if any, and interest on our indebtedness.\nIf our cash flows and capital resources are insufficient to fund our debt service obligations, we could face substantial liquidity problems and could be forced to reduce or delay investments and capital expenditures or to dispose of material assets or operations, seek additional debt or equity capital or restructure or refinance our indebtedness. We may not be able to effect any such alternative measures, if necessary, on commercially reasonable terms or at all and, even if successful, those alternative actions may not allow us to meet our scheduled debt service obligations. Our debt agreements restrict our ability to dispose of assets and use the proceeds from those dispositions and may also restrict our ability to raise debt or equity capital to be used to repay other indebtedness when it becomes due. We may not be able to consummate those dispositions or to obtain proceeds in an amount sufficient to meet any debt service obligations then due.\nOur inability to generate sufficient cash flows to satisfy our debt obligations, or to refinance our indebtedness on commercially reasonable terms or at all, would materially and adversely affect our financial position and results of operations and our ability to satisfy our debt obligations.\nIf we cannot make scheduled payments on our debt, we will be in default and the lenders under our credit facility could terminate their commitments to loan money, the lenders could foreclose against the assets securing their borrowings, the holders of our Senior Notes could declare all outstanding principal, premium, if any, and interest to be due and payable, and we could be forced into bankruptcy or liquidation. These events could result in a loss of your investment.\nWe are required to comply with certain financial and operating covenants under our debt agreements. Any failure to comply with those covenants could cause amounts borrowed to become immediately due and payable and/or prevent us from borrowing under the credit facility.\nWe are required to comply with specified financial and operating covenants under our debt agreements and to make payments under our debt, which limit our ability to operate our business as we otherwise might operate it. Our failure to comply with any of these covenants or to meet any debt payment obligations could result in an event of default which, if not cured or waived, would result in any amounts outstanding, including any accrued interest and/or unpaid fees, becoming immediately due and payable. We might not have enough working capital or liquidity to satisfy any repayment obligations if those obligations were accelerated. In addition, if we are not in compliance with the financial and operating covenants under the credit facility when we wish to borrow funds, we will be unable to borrow funds.\nIn addition, the financial and operating covenants under the credit facility may limit our ability to borrow funds, including for strategic acquisitions and share repurchases.\nOur credit facility has variable interest tied to LIBOR and we could become subject to higher interest rates if the replacement rate we agree on with our banks is higher.\nBorrowings under our revolving credit facility use the London Interbank Offering Rate (LIBOR) as a benchmark for establishing the interest rate. On March 5, 2021, the Intercontinental Exchange Benchmark Administration, the U.K. Financial Conduct Authority (FCA) regulated and authorized administrator of LIBOR, announced, and the FCA confirmed, that one week and two-month USD LIBOR settings will cease on December 31, 2021, and that the USD LIBOR panel for all other tenors will cease on June 30, 2023.\nThe credit facility provides a mechanism pursuant to which we and the administrative agent may agree, under certain circumstances, to transition to an alternate base rate borrowing or amend the\ncredit facility to establish an alternate interest rate to LIBOR that includes consideration of the then-prevailing market convention for determining interest rates for syndicated loans in the United States at that time.\nAlthough we believe the alternative rates will not materially increase the rates on our credit facility, the final agreed rate may increase the cost of our variable rate indebtedness.\nV.Risks Related to Our Common Stock and Common Stock of Public Companies We Own\nOur operating results fluctuate from quarter to quarter, making future operating results difficult to predict; failure to meet market expectations could cause the price of our securities to decline.\nOur quarterly operating results historically have fluctuated and are likely to continue to fluctuate depending on many factors, including:\n•\nvariability in our contracts, including timing of start dates, length of contracts, and mix of on-premises and cloud-based purchases, which would impact our revenue and earnings;\n•\na high percentage of our orders historically have been generated in the third month of each fiscal quarter and any failure to receive, complete or process orders at the end of any quarter could cause us to fall short of our financial targets;\n•\nour adoption of Accounting Standards Update 2014-09, Revenue from Contracts with Customers: Topic 606 in 2019 creates significant revenue volatility;\n•\na significant percentage of our orders comes from transactions with large customers, which tend to have long lead times that are less predictable;\n•\nbecause our operating expenses are largely fixed in the short term and are based on expected revenues, any failure to achieve our revenue targets could cause us to miss our earnings targets;\n•\nbecause a significant portion of our revenue and expenses are generated from outside the U.S., shifts in foreign currency exchange rates could adversely affect our reported results; and\n•\nwe may incur significant expenses in a quarter in connection with corporate development initiatives, restructuring efforts or the investigation, defense or settlement of legal actions that would increase our operating expenses and reduce our earnings for the quarter in which those expenses are incurred.\nAccordingly, our quarterly results are difficult to predict prior to the end of the quarter and we may be unable to confirm or adjust expectations with respect to our operating results for a quarter until that quarter has closed. Any failure to meet our quarterly revenue or earnings expectations could adversely impact the market price of our securities.\nOur stock price has been volatile, which may make it harder to resell shares at a favorable time and price.\nMarket prices for securities of software companies are generally volatile and are subject to significant fluctuations that may be unrelated or disproportionate to the operating performance of these companies. Further, our stock price has been more volatile than that of other software companies. Accordingly, the trading prices and valuations of software companies’ stocks, and of ours, may not be predictable. Negative changes in the public’s perception of the prospects of software companies, or of PTC or the markets we serve, could depress our stock price regardless of our operating results.\nAlso, a large percentage of our common stock is held by institutional investors and by Rockwell Automation. Purchases and sales of our common stock by these investors could have a significant impact on the market price of the stock. For more information about those investors, please see our proxy statement with respect to our most recent annual meeting of stockholders and Schedules 13D and 13G filed with the SEC with respect to our common stock.\nFrom time to time, we may acquire common stock in publicly traded companies as strategic investments. Owning such stock exposes us to the volatility, liquidity and other risks inherent in holding that stock.\nFrom time to time, we may own common stock of publicly traded companies. We are required to present the value of such stock on our Consolidated Balance Sheet at their fair value at the end of each reporting period. The fair value of those shares may fluctuate due to the volatility of the stock market, changes in general economic conditions, and the performance of these publicly traded companies. We recognize all changes in the fair value of the owned shares (whether realized or unrealized) as gains or losses in our Consolidated Statement of Operations. Accordingly, changes in the fair value of the owned shares can materially impact the earnings we report, which introduces volatility in our earnings that is not associated with the results of our business operations. In particular, significant declines in the fair value of the owned shares would produce significant declines in our reported earnings.\nThe reported value of the owned shares does not necessarily reflect their lowest current market price. If we were forced to sell some or all of the owned shares in the market, there can be no assurance that we would be able to sell them at prices equivalent to the value that we have reported on our Consolidated Balance Sheet, and we may be forced to sell them at significantly lower prices.\nVI.Risks Related to Our Senior Notes\nOur Senior Notes are unsecured and do not limit our ability to incur indebtedness, which could reduce any payments to holders of the Senior Notes in connection with any insolvency, liquidation, reorganization, dissolution or other winding up of PTC.\nUnlike the credit facility, which is secured, the Senior Notes are not secured. Although the indenture governing the Senior Notes limits our ability to incur secured debt, the covenant is subject to significant exceptions, and we may incur additional secured debt in the future. The effect of this subordination is that upon a default in payment on, or the acceleration of, any of our secured indebtedness, or in the event of bankruptcy, insolvency, liquidation, dissolution or reorganization of our company (collectively, “Adverse Events”), the proceeds from the sale of assets securing our secured indebtedness will be available to pay obligations on the Senior Notes only after all indebtedness under the credit facility and any other secured debt has been paid in full. As a result, the holders of the Senior Notes may receive less, ratably, than the holders of secured debt if an Adverse Event occurs.\nIn addition, the indenture governing the Senior Notes does not limit our ability to incur unsecured indebtedness. If we incur any additional indebtedness that ranks equally with the Senior Notes, subject to collateral arrangements, the holders of that debt will be entitled to share ratably with holders of the Senior Notes in any proceeds distributed in connection with any of the Adverse Events described above. This may reduce the amount of proceeds to holders of the Senior Notes.\nOur Senior Notes are not guaranteed by any of our subsidiaries, which could adversely affect our ability to pay interest on or redeem the Senior Notes when due.\nWe conduct a substantial portion of our operations through our subsidiaries, none of which currently guarantees the Senior Notes. Accordingly, payment of interest on the Senior Notes and redemption of the Senior Notes is dependent on the generation of cash flow by our subsidiaries and their ability to make such cash available to us, by dividend, debt repayment or otherwise. Unless they become guarantors of the Senior Notes, our subsidiaries do not have any obligation to pay amounts due on the Senior Notes or to make funds available for that purpose. Our subsidiaries may not be able to, or may not be permitted to, make distributions to enable us to make payments in respect of the Senior Notes. Each subsidiary is a distinct legal entity, and, under certain circumstances, legal and contractual restrictions may limit our\nability to obtain cash from our subsidiaries. If we do not receive distributions from our subsidiaries, we may be unable to make required payments of principal, premium, if any, and interest on the Senior Notes.\nOur Senior Notes are not listed on any national securities exchange or included in any automated quotation system, which could make it harder to resell the notes at a favorable time and price.\nOur Senior Notes are not listed on any national securities exchange or included in any automated quotation system. As a result, an active market for the notes may not exist or be maintained, which would adversely affect the market price and liquidity of the notes. In that case, holders may not be able to sell their notes when they want to or at a favorable price.\nThe market for non-investment grade debt historically has been subject to severe disruptions that have caused substantial volatility in the prices of securities similar to the notes. The market, if any, for the notes may experience similar disruptions and any such disruptions may adversely affect the liquidity in that market or the prices at which the notes may be sold.\nVII.General Risk Factors\nOur international businesses present economic and operating risks, which could adversely affect our business and financial results.\nWe expect that our international operations will continue to expand and to account for a significant portion of our total revenue. Because we transact business in various foreign currencies, the volatility of foreign exchange rates has had and may in the future have a material adverse effect on our revenue, expenses and operating results.\nOther risks inherent in our international operations include, but are not limited to, the following:\n•\ndifficulties in staffing and managing foreign sales and development operations;\n•\npossible future limitations upon foreign-owned businesses;\n•\nincreased financial accounting and reporting burdens and complexities;\n•\ninadequate local infrastructure; and\n•\ngreater difficulty in protecting our intellectual property.\nWe may have exposure to additional tax liabilities and our effective tax rate may increase or fluctuate, which could increase our income tax expense and reduce our net income.\nAs a multinational organization, we are subject to income taxes as well as non-income based taxes in the U.S. and in various foreign jurisdictions. Significant judgment is required in determining our worldwide income tax provision and other tax liabilities. In the ordinary course of a global business, there are many intercompany transactions and calculations where the ultimate tax determination is uncertain. Our tax returns are subject to review by various taxing authorities. Although we believe that our tax estimates are reasonable, the final determination of tax audits or tax disputes could be different from what is reflected in our historical income tax provisions and accruals.\nOur effective tax rate can be adversely affected by several factors, many of which are outside of our control, including:\n•\nchanges in tax laws, regulations, and interpretations in multiple jurisdictions in which we operate;\n•\nassessments, and any related tax interest or penalties, by taxing authorities;\n•\nchanges in the relative proportions of revenues and income before taxes in the various jurisdictions in which we operate that have differing statutory tax rates;\n•\nchanges to the financial accounting rules for income taxes;\n•\nunanticipated changes in tax rates; and\n•\nchanges to a valuation allowance on net deferred tax assets, if any.",
    "item_1B": "ITEM 1B.\nUnresolved Staff Comments\nNone.",
    "item_2": "ITEM 2.\nProperties\nWe currently have 86 office locations used in operations in the United States and internationally, predominately as sales and/or support offices and for research and development work. Of our total of approximately 1,270,000 square feet of leased facilities used in operations, approximately 527,000 square feet are located in the U.S., including 250,000 square feet at our headquarters facility located in Boston, Massachusetts, and approximately 260,000 square feet are located in India, where a significant amount of our research and development is conducted. In addition, approximately 210,000 feet are associated with facilities that have been restructured, primarily our previous headquarters facility in Needham, Massachusetts. We believe that our facilities are adequate for our present and foreseeable needs.",
    "item_3": "ITEM 3.\nLegal Proceedings\nInformation on legal proceedings can be found in Note 10. Commitments and Contingencies of Notes to Consolidated Financial Statements in this Form 10-K, which information is incorporated herein by reference.",
    "item_4": "ITEM 4.\nMine Safety Disclosures\nNot applicable.\nPART II",
    "item_5": "ITEM 5.\nMarket for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur common stock is traded on the Nasdaq Global Select Market under the symbol \"PTC.\"\nOn September 30, 2021, the close of our fiscal year, and on November 17, 2021, our common stock was held by 1,023 and 1,020 shareholders of record, respectively.\nThe table below shows the shares of our common stock we repurchased in the fourth quarter of 2021.\nPeriod\nTotal Number of Shares (or Units) Purchased\nAverage Price Paid per Share (or Unit)\nTotal Number of Shares (or Units) Purchased as Part of Publicly Announced Plans or Programs\nApproximate Dollar Value of Shares (or Units) that May Yet Be Purchased Under the Plans or Programs(1)\nJuly 2021\n-\n$\n-\n-\n$\n1,000,000,000\nAugust 2021\n225,909\n132.80\n225,909\n970,000,047\nSeptember 2021\n-\n-\n-\n970,000,047\nTotal\n225,909\n$\n132.80\n225,909\n$\n970,000,047\n(1)\nOn November 13, 2020, the Board of Directors authorized us to repurchase up to $1 billion of our common stock in the period November 13, 2020 through September 30, 2023.",
    "item_6": "ITEM 6.\n[Reserved]",
    "item_7": "ITEM 7.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nForward-Looking Statements\nStatements in this Annual Report about anticipated financial results, capital developments and growth, as well as about the development of our products, markets and workforce, are forward-looking statements that are based on our current plans and assumptions. Important information about the bases for these plans and assumptions and factors that may cause our actual results to differ materially from these statements is contained below and in Item 1A. “Risk Factors” of this Annual Report.\nUnless otherwise indicated, all references to a year reflect our fiscal year that ends on September 30.\nOperating and Non-GAAP Financial Measures\nOur discussion of results includes discussion of our ARR (Annual Run Rate) operating measure, non-GAAP financial measures, and disclosure of our results on a constant currency basis. ARR and our non-GAAP financial measures, including the reasons we use those measures, are described below in Results of Operations - Operating Measure and Results of Operations - Non-GAAP Financial Measures, respectively. The methodology used to calculate constant currency disclosures is described in Results of Operations - Impact of Foreign Currency Exchange on Results of Operations. You should read those sections to understand our operating measure, non-GAAP financial measures, and constant currency disclosures.\nExecutive Overview\nARR increased 16% (actual and constant currency) to $1,475 million in FY’21 compared to the end of FY’20. Excluding the impact of Arena, which was acquired in the second quarter of FY’21, our organic constant currency ARR growth was 12% in FY’21 compared to FY’20. Organic churn improved approximately 130 basis points year over year, primarily driven by strong execution in CAD, PLM, FSG and modest continued improvement in IoT and AR.\nFY’21 revenue of $1.81 billion increased 24% over FY’20 (20% in constant currency). Our FY’21 revenue was positively impacted by ASC 606 as longer contract durations and support to subscription conversions increased the amount of upfront subscription license revenue recognized in the year. FY’21 operating margin of 21% increased approximately 700 basis points over FY’20 due to strong revenue performance as strong product differentiation improved sales and renewals, while maintaining good discipline on our operating expense structure. FY’21 diluted EPS more than doubled year over year to $4.03, due in part to a gain of $69 million related to common stock we own in a publicly-traded company, the release of a $137 million valuation allowance related to our deferred tax assets in the U.S., and a non-cash tax benefit of $42 million related to our Arena acquisition.\nFY’21 operating cash flow of $369 million grew 58% over FY’20; FY’21 free cash flow of $344 million grew 61% over FY’20. Operating cash flow and free cash flow included an $18 million outflow related to a foreign tax dispute, $15 million of acquisition-related costs, and $15 million of restructuring payments. We ended FY’21 with cash and cash equivalents of $327 million. In addition, we held a $78 million equity investment in Matterport, Inc., currently subject to trading restrictions. We ended FY’21 with gross debt of $1.45 billion, with an aggregate interest rate of 3.2%.\nResults of Operations\nThe following table shows the financial measures that we consider the most significant indicators of our business performance. In addition to providing operating income, operating margin, diluted earnings per share and cash from operations as calculated under GAAP, we provide non-GAAP operating income, non-GAAP operating margin, non-GAAP diluted earnings per share, and free cash flow for the reported periods. We also provide a view of our actual results on a constant currency basis. These non-GAAP financial measures exclude the items described in Non-GAAP Financial Measures below. Investors should use these non-GAAP financial measures only in conjunction with our GAAP results.\nFor discussion of FY’20 results and comparison with FY’19 results, refer to Management's Discussion and Analysis of Financial Conditions and Results of Operations in our Annual Report on Form 10-K for the fiscal year ended September 30, 2020.\n(Dollar amounts in millions, except per share data)\nYear ended September 30,\nPercent Change\nActual\nConstant Currency(1)\nARR\n$\n1,474.7\n$\n1,270.0\n%\n%\nTotal recurring revenue\n$\n1,616.3\n$\n1,281.9\n%\n%\nPerpetual license\n33.0\n32.7\n%\n(1\n)%\nProfessional services\n157.8\n143.8\n%\n%\nTotal revenue\n1,807.2\n1,458.4\n%\n%\nTotal cost of revenue\n371.1\n334.3\n%\n%\nGross margin\n1,436.1\n1,124.1\n%\n%\nOperating expenses\n1,055.3\n913.2\n%\n%\nOperating income\n$\n380.7\n$\n210.9\n%\n%\nNon-GAAP operating income(1)\n$\n634.4\n$\n423.4\n%\n%\nOperating margin\n21.1\n%\n14.5\n%\nNon-GAAP operating margin(1)\n35.1\n%\n29.0\n%\nDiluted earnings per share\n$\n4.03\n$\n1.12\nNon-GAAP diluted earnings per share(1)(2)\n$\n3.97\n$\n2.57\nCash flow from operations(3)\n$\n368.8\n$\n233.8\nFree cash flow(4)\n$\n344.1\n$\n213.6\n(1)\nSee Non-GAAP Financial Measures below for a reconciliation of our GAAP results to our non-GAAP measures and Impact of Foreign Currency Exchange on Results of Operations below for a description of how we calculate our results on a constant currency basis.\n(2)\nIn FY’21 and FY’20 our GAAP results included tax benefits of $179.7 million and $21.2 million, respectively. The FY’21 results include a $137.4 million benefit related to the release of the valuation allowance on the majority of our U.S. deferred tax assets and a $42.3 million benefit related to the release of a valuation allowance resulting from the Arena acquisition. The FY’20 results include a $21.2 million benefit related to the release of a valuation allowance resulting from the Onshape acquisition. As the non-GAAP tax provision is calculated assuming that there is no valuation allowance, these benefits have been excluded. Income tax adjustments reflect the tax effects of non-GAAP adjustments which are calculated by applying the applicable tax rate by jurisdiction to the non-GAAP adjustments listed above. Additionally, our non-GAAP results for FY'21 exclude tax expense of $34.8 million related to a non-U.S. prior period tax exposure, primarily related to foreign withholding taxes.\n(3)\nCash flow from operations for FY’21 and FY’20 includes $14.5 million and $42 million of restructuring payments, respectively. Cash from operations for FY’21 and FY’20 includes $15.0 million and $9.6 million of acquisition-related payments, respectively. Cash from operations for FY’21 includes $17.9 million in un-forecasted payments related to the prior period tax exposure from a non-U.S. tax dispute.\n(4)\nFree cash flow is cash from operations net of capital expenditures of $24.7 million and $20.2 million in FY’21 and FY’20, respectively.\nImpact of Foreign Currency Exchange on Results of Operations\nApproximately 60% of our revenue and 40% of our expenses are transacted in currencies other than the U.S. dollar. Because we report our results of operations in U.S. Dollars, currency translation, particularly changes in the Euro, Yen, Shekel, and Rupee relative to the U.S. Dollar, affects our reported results. Our constant currency disclosures are calculated by multiplying the results in local currency for FY’21 and FY’20 by the exchange rates in effect on September 30, 2020, excluding the effect of any hedging. If FY'21 reported results were converted into U.S. dollars based on this methodology, FY'21 revenue would have been lower by $20 million and expenses would have been lower by $8 million. The net impact on year-over-year results would have been a decrease in operating income of $12 million in FY'21.\nThe results of operations in the table above and revenue by line of business, product group, and geographic region in the tables that follow present both actual percentage changes year over year and percentage changes on a constant currency basis.\nRevenue\nOur revenue results period to period are impacted by contract terms, including the duration and start dates of our subscription contracts, due to up-front recognition of subscription license revenue. We are expanding our SaaS offerings and are releasing additional cloud functionality into our products. As a\nresult, our revenue will be impacted over time as a higher portion of our sales will be from cloud services, which are recognized ratably.\nRevenue by Line of Business\n(Dollar amounts in millions)\nYear ended September 30,\nPercent Change\nActual\nConstant\nCurrency\nLicense (1)\n$\n738.1\n$\n509.8\n%\n%\nSupport (2) and cloud services\n911.3\n804.8\n%\n%\nTotal software revenue\n1,649.3\n1,314.6\n%\n%\nProfessional services\n157.8\n143.8\n%\n%\nTotal revenue\n$\n1,807.2\n$\n1,458.4\n%\n%\n(1)\nIncludes perpetual licenses and the license portion of subscription sales.\n(2)\nIncludes support on perpetual licenses and the support portion of subscription sales.\nSoftware revenue increased in FY’21 compared to FY’20 due to subscription revenue growth of 42% (38% constant currency), offset by an 18% decline in perpetual support revenue (21% constant currency) due to conversions of perpetual support contracts to subscriptions. Arena; acquired in the second quarter, contributed approximately $29 million in FY’21. In FY’21, license revenue growth was primarily driven by contracts with longer durations.\nProfessional services engagements typically result from sales of new licenses and software upgrades; revenue is recognized over the term of the engagement. Our expectation is that professional services revenue will trend flat-to-down over time due to our strategy to expand margins by migrating more services engagements to our partners and delivering products that require less consulting and training services.\nProfessional services revenue grew in FY’21 by 10% (5% constant currency); where FY’20 revenue was negatively impacted by the COVID-19 pandemic, FY’21 benefited from increased delivery activity associated with PLM deployments.\nRevenue and ARR by Product Group\nSoftware Revenue by Product Group\n(Dollar amounts in millions)\nYear ended September 30,\nPercent Change\nActual\nConstant\nCurrency\nCore (CAD and PLM)\n$\n1,161.7\n$\n947.1\n%\n%\nGrowth (IoT, AR, Onshape, Arena)\n277.4\n183.8\n%\n%\nFSG (Focused Solutions Group)\n210.2\n183.7\n%\n%\nTotal Software revenue\n$\n1,649.3\n$\n1,314.6\n%\n%\nCore product software revenue growth in FY’21 compared to FY’20 was driven by subscription revenue growth of 39% (34% constant currency), offset by expected declines in perpetual support revenue of 20% (23% constant currency) due in part to ongoing perpetual support contract conversions to subscription.\nARR increased 11% (12% constant currency) for FY’21 compared to FY’20, reflecting solid ARR growth for both PLM (13% actual,14% constant currency) and CAD (10% actual and constant currency) as customers pursue their digital transformation initiatives.\nGrowth product software revenue growth in FY’21 was driven by subscription revenue growth of 67% (63% constant currency) compared to the year-ago period, driven primarily by IoT and contribution from Arena.\nGrowth product ARR increased 50% (actual and constant currency) for FY’21 compared to FY’20, due in part to a $59 million contribution from Arena. Excluding Arena, organic ARR growth was 17% (18%\nconstant currency), reflecting 15% (16% constant currency) growth in IoT and 16% (actual and constant currency) growth in AR.\nFSG product software revenue growth in FY’21 compared to FY’20 was primarily driven by subscription revenue growth of 34% (31% constant currency), offset by a decline in perpetual support revenue of 15% (17% constant currency) due to conversions of perpetual support contracts to subscriptions.\nFSG product ARR increased 6% (actual and constant currency) for FY’21 compared to FY’20.\nSoftware Revenue & ARR by Geographic Region\nA significant portion of our software revenue is generated outside the U.S. In both FY’21 and FY’20, approximately 40% to 45% of software revenue was generated in the Americas, 35% to 40% in Europe, and 20% in Asia Pacific.\n(Dollar amounts in millions)\nYear ended September 30,\nPercent Change\nActual\nConstant\nCurrency\nAmericas\n$\n710.7\n$\n592.7\n%\n%\nEurope\n645.8\n482.5\n%\n%\nAsia Pacific\n292.8\n239.4\n%\n%\nTotal Software revenue\n$\n1,649.3\n$\n1,314.6\n%\n%\nAmericas software revenue growth in FY’21 was driven by growth in subscription revenue of 34% (actual and constant currency) as compared to FY’20, partially offset by a decline of 26% (actual and constant currency) in perpetual support revenue, due to conversions of perpetual support contracts to subscriptions, resulting in recurring revenue growth of 21% (actual and constant currency).\nAmericas ARR was up 19%, led by double-digit growth in Core products and Arena.\nEurope software revenue growth in FY’21 was driven by growth in subscription revenue of 56% (46% constant currency) as compared to FY’20, partially offset by a decline of 16% (21% constant currency) in perpetual support revenue, resulting in recurring revenue growth of 35% (26% constant currency).\nARR in Europe was up 13% constant currency, led by high-single digit growth in Core products, low-40s growth in Growth products, and double-digit growth in FSG.\nAsia Pacific software revenue growth in FY’21 was driven by subscription revenue growth of 36% (32% constant currency) as compared to FY’20, partially offset by a decline of 9% (12% constant currency) in perpetual support revenue, resulting in recurring revenue growth of 22% (18% constant currency).\nARR in Asia Pacific was up 17% constant currency, led by mid-teens growth in Core products and low-30s growth in Growth products.\nGross Margin\n(Dollar amounts in millions)\nYear ended September 30,\nPercent Change\nGross margin:\nLicense gross margin\n$\n676.3\n$\n456.6\n%\nLicense gross margin percentage\n%\n%\nSupport and cloud services gross margin\n$\n747.2\n$\n659.4\n%\nSupport and cloud services gross margin percentage\n%\n%\nProfessional services\n$\n12.6\n$\n8.1\n%\nProfessional services gross margin percentage\n%\n%\nTotal gross margin\n$\n1,436.1\n$\n1,124.1\n%\nTotal gross margin percentage\n%\n%\nNon-GAAP gross margin(1)\n$\n1,485.1\n$\n1,165.5\n%\nNon-GAAP gross margin percentage(1)\n%\n%\n(1)\nNon-GAAP financial measures are reconciled to GAAP results under Non-GAAP Financial Measures below.\nLicense gross margin increased in FY’21 compared to FY’20 due to subscription license revenue increasing significantly as a result of longer subscription term durations, offset by increased royalty expense due to the mix of products sold and higher intangible amortization due to the Arena acquisition.\nSupport and cloud services gross margin percentage is flat in FY’21 compared to FY’20, while gross margin contribution increased from FY’20 to FY’21 reflecting an increase in subscription support and cloud revenue, offset by a decrease in perpetual support revenue, higher compensation costs, and an increase in costs associated with our cloud services business due to greater demand for those services.\nProfessional services gross margin increased in FY’21 compared to FY’20 primarily due to the impact of the COVID-19 pandemic on FY’20 resulting in a year-over-year increase in revenue and lower travel costs in FY’21, partially offset by higher compensation and outside services costs.\nOperating Expenses\n(Dollar amounts in millions)\nYear ended September 30,\nPercent Change\nSales and marketing\n$\n517.8\n$\n435.5\n%\n% of total revenue\n%\n%\nResearch and development\n299.9\n256.6\n%\n% of total revenue\n%\n%\nGeneral and administrative\n206.0\n159.8\n%\n% of total revenue\n%\n%\nAmortization of acquired intangible assets\n29.4\n28.7\n%\n% of total revenue\n%\n%\nRestructuring and other charges, net\n2.2\n32.7\n(93\n)%\n% of total revenue\n%\n%\nTotal operating expenses\n$\n1,055.3\n$\n913.3\n%\nTotal headcount increased by 7.5% in FY’21 to 6,709 from 6,243 at the end of FY’20. Headcount at the end of FY’21 includes approximately 180 people from Arena and other smaller acquisitions.\nOperating expenses in FY'21 compared to FY'20 increased primarily due to the following:\n•\na $142.3 million increase in compensation expense (including benefit costs), primarily driven by:\n•\na $56.8 million (56%) increase in stock-based compensation expense,\n•\na $55.4 million (14%) increase in salaries due to higher headcount and merit increases as well as $10.3 million from Arena,\n•\na $15.8 million increase (17%) in benefits, of which $1.8 million is related to Arena,\n•\na $12.3 million (114%) increase in cash bonus expense due to higher attainment and includes $1.2 million from Arena,\n•\na $9.7 million (17%) increase in commissions due to additional amortization of capitalized commissions;\n•\na $7.8 million (39%) increase in professional fees;\n•\na $6.8 million (55%) increase in internal hosting costs;\n•\na $6.4 million increase in acquisition-related charges, which are included in general and administrative costs; and\n•\na $4.3 million (16%) increase in marketing expense;\npartially offset by:\n•\na $28.8 million decrease in restructuring charges.\nStock-based compensation was higher in FY’21 compared to FY’20 primarily due to higher estimated attainment under performance-based incentive compensation and more time-based awards outstanding in FY’21. Cash bonus expense was also higher in FY’21 compared to FY’20 due to higher attainment under the FY’21 bonus plan.\nInterest Expense\n(Dollar amounts in millions)\nYear ended September 30,\nPercent Change\nInterest and debt premium expense\n$\n(50.5\n)\n$\n(76.4\n)\n(34\n)%\nInterest expense includes interest under our credit facility and senior notes. Interest expense was lower in FY’21 as FY’20 included $15 million of expense related to penalties for the early redemption of the 6.000% Senior Notes due 2024, with higher balances in FY’21 partially offset by lower rates. We had $1,450 million of total debt at September 30, 2021, compared to $1,018 million at September 30, 2020. For additional detail on the changes in our debt structure, see Note 9. Debt, included in the Notes to Consolidated Financial Statements in this Annual Report.\nThe average interest rate on our total borrowings was 3.3% in FY'21 and 4.3% in FY'20.\nOther Income (Expense)\n(Dollar amounts in millions)\nYear ended September 30,\nPercent Change\nInterest income\n$\n1.8\n$\n3.8\n(54\n)%\nOther income (expense), net\n59.7\n(3.5\n)\n(1830\n)%\nOther income, net\n$\n61.5\n$\n0.3\n%\nInterest income represents earnings on the investment of our available cash and marketable securities.\nOther expense, net includes foreign currency gains and losses and other non-operating gains and losses. In FY’21, we recorded a $69 million non-operating gain related to an equity investment in Matterport, Inc., which will continue to fluctuate. Foreign currency gains and losses include costs of hedging contracts, certain realized and unrealized foreign currency transaction gains or losses, and foreign exchange gains or losses resulting from the required period-end currency remeasurement of the assets and liabilities of our subsidiaries that use the U.S. dollar as their functional currency.\nIncome Taxes\n(Dollar amounts in millions)\nYear ended September 30,\nPercent Change\nIncome before income taxes\n$\n391.8\n$\n134.7\n%\nProvision (benefit) for income taxes\n(85.2\n)\n4.0\n(2223\n)%\nEffective income tax rate\n(22\n)%\n%\nIn FY’21 and FY’20, our tax rate differed from the U.S. statutory federal income tax rate due to our corporate structure in which our foreign taxes are at a net effective tax rate lower than the U.S. rate. A significant amount of our foreign earnings is generated by our subsidiaries organized in Ireland and the Cayman Islands. In FY’21 and FY’20 the foreign rate differential predominantly relates to those earnings.\nIn FY’21, in addition to the foreign rate differential, our tax rate differed from the statutory federal income tax rate due to the release of the valuation allowance on the majority of our U.S. net deferred tax assets, the net effects of the Global Intangible Low-Taxed Income (GILTI) and Foreign Derived Intangible Income (FDII) regimes (together referred to as U.S. Tax reform), and the excess tax benefit related to stock-based compensation.\nIn FY’20, in addition to the foreign rate differential, our tax rate differed from the statutory federal income tax rate due to U.S. tax reform, the excess tax benefit related to stock-based compensation and the indirect effects of the adoption of ASC 606. Additionally, we recorded benefits for the reduction of the U.S. valuation allowance as a result of the Onshape acquisition. A further reduction to the valuation allowance was also recorded to reflect the impact from the scheduling of the reversal of existing temporary differences resulting in deferred tax liabilities that cannot be offset against deferred tax assets.\nOur results for the twelve months ended September 30, 2021 include a charge of $37.3 million related to the effects of a tax matter in the Republic of Korea (South Korea) of $34.4 million, and the resulting impact on U.S. income taxes of $2.9 million. The charge relates to an assessment with respect to various tax issues, primarily foreign withholding taxes, that was under appeal in South Korea. We received an assessment of approximately $12 million from the tax authorities in South Korea in the fourth quarter of 2016 for the years 2011 to 2015 and paid the assessment in the first quarter of 2017. We appealed that assessment to an intermediate appellate court. In December 2020, our appeal to that court - the Seoul High Court - was rejected. We appealed this decision to the Supreme Court of the Republic of Korea. In May 2021, the Supreme Court denied our request for a review of the case. Therefore, the decision of the Seoul High Court was deemed final. We made additional payments of approximately $20 million to the tax authorities in South Korea in FY’21 for the years 2016 to 2021 in settlement of the amounts previously accrued.\nOperating Measure\nARR\nARR (Annual Run Rate) represents the annualized value of our portfolio of active subscription software, cloud, SaaS, and support contracts as of the end of the reporting period. ARR includes orders placed under our Strategic Alliance Agreement with Rockwell Automation, including orders placed to satisfy contractual minimum commitments.\nWe believe ARR is a valuable operating metric to measure the health of a subscription business because it captures expected subscription and support cash generation from customers. Because this measure represents the annualized value of customer contracts as of a point in time, it does not represent revenue for any particular period or remaining revenue that will be recognized in future periods.\nNon-GAAP Financial Measures\nThe non-GAAP financial measures presented in the discussion of our results of operations and the respective most directly comparable GAAP measures are:\n•\nfree cash flow-cash flow from operations\n•\nnon-GAAP gross margin-GAAP gross margin\n•\nnon-GAAP operating income-GAAP operating income\n•\nnon-GAAP operating margin-GAAP operating margin\n•\nnon-GAAP net income-GAAP net income\n•\nnon-GAAP diluted earnings or loss per share-GAAP diluted earnings or loss per share\nFree cash flow is cash flow from operations net of capital expenditures, which are expenditures for property and equipment and consist primarily of facility improvements, office equipment, computer equipment, and software. We believe that free cash flow, in conjunction with cash from operations, is a useful measure of liquidity since capital expenditures are a necessary component of ongoing operations.\nThe non-GAAP financial measures other than free cash flow exclude, as applicable: stock-based compensation expense; amortization of acquired intangible assets; acquisition-related and other transactional charges included in general and administrative expenses; restructuring and other charges, net; non-operating charges; and income tax adjustments.\nThe items excluded from these non-GAAP financial measures are normally included in the comparable measures calculated and presented in accordance with GAAP. Our management excludes these items when evaluating our ongoing performance and/or predicting our earnings trends, and therefore excludes them when presenting non-GAAP financial measures. Management uses non-GAAP financial measures in conjunction with our GAAP results, as should investors.\nStock-based compensation is a non-cash expense relating to stock-based awards issued to executive officers, employees and outside directors, consisting of restricted stock units. We exclude this expense as it is a non-cash expense and we assess our internal operations excluding this expense and believe it facilitates comparisons to the performance of other companies in our industry.\nAmortization of acquired intangible assets is a non-cash expense that is impacted by the timing and magnitude of our acquisitions. We believe the assessment of our operations excluding these costs is relevant to our assessment of internal operations and comparisons to the performance of other companies in our industry.\nAcquisition-related and other transactional charges included in general and administrative expenses are direct costs of potential and completed acquisitions and expenses related to acquisition integration activities, including transaction fees, due diligence costs, severance and professional fees. Subsequent adjustments to our initial estimated amount of contingent consideration associated with specific acquisitions are also included within acquisition-related charges. Other transactional charges include third-party costs related to structuring unusual transactions. We do not include these costs when reviewing our operating results internally. The occurrence and amount of these costs will vary depending on the timing and size of acquisitions.\nRestructuring and other charges, net includes excess facility restructuring charges (credits); impairment and accretion expense charges related to the lease assets of exited facilities; sublease income from previously impaired facilities; and severance costs resulting from reductions of personnel and third-party professional consulting fees related to modifications of our business strategy. These costs may vary in size based on our restructuring plan.\nNon-operating charges (credits). In Q4’21, we recorded a $69 million gain related to our equity investment in Matterport, Inc., which will continue to fluctuate based on the market value of the investment. In FY’20, we incurred an early redemption interest penalty and wrote off debt issuance costs, both of which were related to the settlement of the 6.000% Senior Notes due 2024. These items are excluded from our non-GAAP financial measures as they are non-ordinary course in nature and not included in management’s review of our results.\nIncome tax adjustments include the tax impact of the items above and assumes that we are profitable on a non-GAAP basis in the U.S. and one foreign jurisdiction. It also eliminates the effect of the valuation allowance recorded against our net deferred tax assets in those jurisdictions. Additionally, we exclude other material tax items that we do not include when reviewing our operating results internally.\nWe use these non-GAAP financial measures, and we believe that they assist our investors, to make period-to-period comparisons of our operational performance because they provide a view of our operating results without items that are not, in our view, indicative of our core operating results. We believe that these non-GAAP financial measures help illustrate underlying trends in our business, and we use the measures to establish budgets and operational goals (communicated internally and externally) for managing our business and evaluating our performance. We believe that providing non-GAAP financial measures also affords investors a view of our operating results that may be more easily compared to the results of other companies in our industry that use similar financial measures to supplement their GAAP results.\nThe items excluded from the non-GAAP financial measures often have a material impact on our financial results and such items often recur. Accordingly, the non-GAAP financial measures included in this Annual Report should be considered in addition to, and not as a substitute for or superior to, the comparable measures prepared in accordance with GAAP. The following tables reconcile each of these non-GAAP financial measures to its most closely comparable GAAP measure on our financial statements.\n(in millions, except per share amounts)\nYear ended September 30,\nGAAP gross margin\n$\n1,436.1\n$\n1,124.1\nStock-based compensation\n19.3\n14.0\nAmortization of acquired intangible assets included in cost of revenue\n29.8\n27.4\nNon-GAAP gross margin\n$\n1,485.1\n$\n1,165.5\nGAAP operating income\n$\n380.7\n$\n210.9\nStock-based compensation\n177.3\n115.1\nAmortization of acquired intangible assets included in cost of revenue\n29.8\n27.4\nAmortization of acquired intangible assets\n29.4\n28.7\nAcquisition-related and other transactional charges included in general and administrative expenses\n15.0\n8.6\nRestructuring and other charges, net\n2.2\n32.7\nNon-GAAP operating income\n$\n634.4\n$\n423.4\nGAAP net income\n$\n476.9\n$\n130.7\nStock-based compensation\n177.3\n115.1\nAmortization of acquired intangible assets included in cost of revenue\n29.8\n27.4\nAmortization of acquired intangible assets\n29.4\n28.7\nAcquisition-related and other transactional charges included in general and administrative expenses\n15.0\n8.6\nRestructuring and other charges, net\n2.2\n32.7\nNon-operating charges (credits)(1)\n(68.8\n)\n18.5\nIncome tax adjustments(2)\n(191.6\n)\n(63.3\n)\nNon-GAAP net income\n$\n470.2\n$\n298.4\nGAAP diluted earnings per share\n$\n4.03\n$\n1.12\nStock-based compensation\n1.50\n0.99\nTotal amortization of acquired intangible assets\n0.50\n0.48\nAcquisition-related and other transactional charges included in general and administrative expenses\n0.13\n0.07\nRestructuring and other charges, net\n0.02\n0.28\nNon-operating charges (credits)(1)\n(0.58\n)\n0.16\nIncome tax adjustments(2)\n(1.62\n)\n(0.54\n)\nNon-GAAP diluted earnings per share\n$\n3.97\n$\n2.57\n(1)\nIn FY’21, we recorded a $69 million gain on common stock we own in a public company. In FY’20, we recognized $15 million of expense related to penalties for the early redemption of the 6.000% Senior Notes due in 2024 and wrote off approximately $3 million of related debt issuance costs.\n(2)\nIn FY’21 and FY’20 our GAAP results included tax benefits of $179.7 million and $21.2 million, respectively. The FY’21 results include a $137.4 million benefit related to the release of the valuation allowance on the majority of our U.S. deferred tax assets and a $42.3 million benefit related to the release of a valuation allowance resulting from the Arena acquisition. The FY’20 results include a $21.2 million benefit related to the release of a valuation allowance resulting from the Onshape acquisition. As the non-GAAP tax provision is calculated assuming that there is no valuation allowance, these benefits have been excluded.\nIncome tax adjustments reflect the tax effects of non-GAAP adjustments which are calculated by applying the applicable tax rate by jurisdiction to the non-GAAP adjustments listed above. Additionally, our non-GAAP results for FY'21 exclude tax expense of $34.8 million related to a non-U.S. prior period tax exposure, primarily related to foreign withholding taxes.\nOperating margin impact of non-GAAP adjustments:\nYear ended September 30,\nGAAP operating margin\n21.1\n%\n14.5\n%\nStock-based compensation\n9.8\n%\n7.9\n%\nTotal amortization of acquired intangible assets\n3.3\n%\n3.8\n%\nAcquisition-related and other transactional charges included in general and administrative expenses\n0.8\n%\n0.6\n%\nRestructuring and other charges, net\n0.1\n%\n2.2\n%\nNon-GAAP operating margin\n35.1\n%\n29.0\n%\nCritical Accounting Policies and Estimates\nWe have prepared our consolidated financial statements in accordance with accounting principles generally accepted in the United States of America. In preparing our financial statements, we make estimates, assumptions and judgments that can have a significant impact on our reported revenues, results of operations, and net income, as well as on the value of certain assets and liabilities on our balance sheet. These estimates, assumptions and judgments are made based on our historical experience and on other assumptions that we believe to be reasonable under the circumstances. These estimates may change as new events occur or additional information is obtained, and we may periodically be faced with uncertainties, the outcomes of which are not within our control and may not be known for a prolonged period of time.\nThe accounting policies, methods and estimates used to prepare our financial statements are described generally in Note 2. Summary of Significant Accounting Policies of Notes to Consolidated Financial Statements in this Annual Report. The most important accounting judgments and estimates that we made in preparing the financial statements involved:\n•\nrevenue recognition;\n•\naccounting for income taxes; and\n•\nvaluation of assets and liabilities acquired in business combinations.\nA critical accounting policy is one that is both material to the presentation of our financial statements and requires us to make subjective or complex judgments that could have a material effect on our financial condition and results of operations. Critical accounting policies require us to make assumptions about matters that are uncertain at the time of the estimate, and different estimates that we could have used, or changes in the estimates that are reasonably likely to occur, may have a material impact on our financial condition or results of operations. Because the use of estimates is inherent in the financial reporting process, actual results could differ from those estimates.\nAccounting policies, guidelines and interpretations related to our critical accounting policies and estimates are generally subject to numerous sources of authoritative guidance and are often reexamined by accounting standards rule makers and regulators. These rule makers and/or regulators may promulgate interpretations, guidance or regulations that may result in changes to our accounting policies, which could have a material impact on our financial position and results of operations.\nRevenue Recognition\nWe record revenues in accordance with the guidance provided by ASC 606, Revenue from Contracts with Customers. For a full description of our revenue accounting policy, refer to Note 2. Summary of Significant Accounting Policies, included in the Notes to Consolidated Financial Statements in this Annual Report.\nOur sources of revenue include: (1) subscriptions, (2) perpetual licenses, (3) support for perpetual licenses and (4) professional services. Subscriptions include term-based on-premises licenses, Software-as-a-Service (SaaS), and hosting services.\nJudgments and Estimates\nDetermination of performance obligations. Our subscriptions are frequently sold as a bundle of products and services, typically pairing on-premises term software licenses with support and/or cloud services over the same term. On-premises software is typically determined to be a distinct performance obligation and is thus recognized separately from the support and/or cloud components. On-premises license software revenue is generally recognized at the point in time that the software is made available to the customer, while the support and cloud software revenue components are recognized over the term of the contract. In cases where subscriptions include cloud functionality and on-premises software, an assessment has been performed to determine whether the cloud services are distinct from the on-premises software. In the substantial majority of instances, cloud services provide incremental functionality to customers and have been considered distinct and recognized separately from the on-premises software. This assessment could have a significant impact on the timing of revenue recognition and may change as our product offerings evolve.\nAllocation of transaction price. We estimate the standalone selling price of each identified performance obligation and use that estimate to allocate the transaction price among said performance obligations. The estimated standalone selling price is determined using all information reasonably available to us, including market conditions and other observable inputs. Significant judgment is used in determining the standalone selling prices of the on-premises license, support, and cloud components of our subscription products. These estimates are subject to change as our product offerings change and could have a significant impact due to the difference in the timing of revenue recognition for on-premises licenses and support and/or cloud.\nRight to exchange. Our multi-year, non-cancellable on-premises subscription contracts provide customers with an annual right to exchange software within the original subscription with other software. We account for this right as a refund liability. For most contracts, we use the expected value method to determine the refund liability associated with this right across a portfolio of contracts. Where contracts are outside of the standard portfolio of contracts due to contract size, longer contract duration, or other unique contractual terms, we use the most likely amount method to determine the refund liability for each individual contract. In both circumstances, the transaction price is constrained based on our estimates, which impacts the amount of revenue recognized. Changes in these estimates could significantly impact revenue for any given period.\nAccounting for Income Taxes\nAs part of the process of preparing our consolidated financial statements, we are required to calculate our income tax expense based on taxable income by jurisdiction. There are many transactions and calculations about which the ultimate tax outcome is uncertain; as a result, our calculations involve estimates by management. Some of these uncertainties arise as a consequence of revenue-sharing, cost-reimbursement and transfer pricing arrangements among related entities and the differing tax treatment of revenue and cost items across various jurisdictions. If we were compelled to revise or to account differently for our arrangements, that revision could affect our recorded tax liabilities.\nThe income tax accounting process also involves estimating our actual current tax liability, together with assessing temporary differences resulting from differing treatment of items for tax and accounting purposes. These differences result in deferred tax assets and liabilities, which are included within our consolidated balance sheets. We must then assess the likelihood that our deferred tax assets will be\nrecovered from future taxable income and, to the extent we believe that it is more likely than not that all or a portion of our deferred tax assets will not be realized, we must establish a valuation allowance as a charge to income tax expense.\nAs of September 30, 2021, we have a valuation allowance of $17.7 million against net deferred tax assets in the U.S. and a valuation allowance of $34.4 million against net deferred tax assets in certain foreign jurisdictions. We have concluded, based on the weight of available evidence, that a full valuation allowance is no longer required against our U.S. net deferred tax assets as they are more likely than not to be realized in the future. We will continue to reassess our valuation allowance requirements each financial reporting period.\nThe valuation allowance recorded against net deferred tax assets of certain foreign jurisdictions is established primarily for our capital loss carryforwards, the majority of which do not expire. However, there are limitations imposed on the utilization of such capital losses that could further restrict the recognition of any tax benefits.\nPrior to the passage of the U.S. Tax Act, the Company asserted that substantially all of the undistributed earnings of its foreign subsidiaries were considered indefinitely invested and accordingly, no deferred taxes were provided. Pursuant to the provisions of the U.S. Tax Act, these earnings were subjected to a one-time transition tax and there is therefore no longer a material cumulative basis difference associated with the undistributed earnings. We maintain our assertion to permanently reinvest these earnings outside the U.S. unless repatriation can be done substantially tax-free, with the exception of a foreign holding company formed in 2018 and our Taiwan subsidiary. If we decide to repatriate any additional non-U.S. earnings in the future, we may be required to establish a deferred tax liability on such earnings. The amount of unrecognized deferred tax liability on the undistributed earnings would not be material.\nIn the normal course of business, PTC and its subsidiaries are examined by various taxing authorities, including the Internal Revenue Service (IRS) in the U.S. We regularly assess the likelihood of additional assessments by tax authorities and provide for these matters as appropriate. We are currently under audit by tax authorities in several jurisdictions. Audits by tax authorities typically involve examination of the deductibility of certain permanent items, transfer pricing, limitations on net operating losses and tax credits. Although we believe our tax estimates are appropriate, the final determination of tax audits and any related litigation could result in material changes in our estimates.\nValuation of Assets and Liabilities Acquired in Business Combinations\nIn accordance with business combination accounting, we allocate the purchase price of acquired companies to the tangible and intangible assets acquired and liabilities assumed based on their estimated fair values. Determining these fair values requires management to make significant estimates and assumptions, especially with respect to intangible assets.\nOur identifiable intangible assets acquired consist of developed technology, core technology, tradenames, customer lists and contracts, and software support agreements and related relationships. Developed technology consists of products that have reached technological feasibility. Core technology represents a combination of processes, inventions and trade secrets related to the design and development of acquired products. Customer lists and contracts and software support agreements and related relationships represent the underlying relationships and agreements with customers of the acquired company’s installed base. We have generally valued intangible assets using a discounted cash flow model. Critical estimates in valuing certain of the intangible assets include but are not limited to:\n•\nfuture expected cash flows from software license sales, customer support agreements, customer contracts and related customer relationships and acquired developed technologies and trademarks and trade names and\n•\ndiscount rates used to determine the present value of estimated future cash flows.\nIn addition, we estimate the useful lives of our intangible assets based upon the expected period over which we anticipate generating economic benefits from the related intangible asset.\nNet tangible assets consist of the fair values of tangible assets less the fair values of assumed liabilities and obligations. Except for deferred revenues, net tangible assets were generally valued by us at the respective carrying amounts recorded by the acquired company, if we believed that their carrying values approximated their fair values at the acquisition date. The values assigned to deferred revenue reflect an amount equivalent to the estimated cost plus an appropriate profit margin to perform the services related to the acquired company’s software support contracts.\nIn addition, uncertain tax positions and tax-related valuation allowances assumed in connection with a business combination are initially estimated as of the acquisition date and we reevaluate these items quarterly with any adjustments to our preliminary estimates being recorded to goodwill provided that we are within the measurement period (up to one year from the acquisition date) and we continue to collect information in order to determine their estimated values. Subsequent to the measurement period or our final determination of the estimated value of uncertain tax positions or tax-related valuation allowances, whichever comes first, changes to these uncertain tax positions and tax-related valuation allowances will affect our provision for income taxes in our Consolidated Statements of Operations.\nOur estimates of fair value are based upon assumptions believed to be reasonable at that time, but which are inherently uncertain and unpredictable. Assumptions may be incomplete or inaccurate, and unanticipated events and circumstances may occur, which may affect the accuracy or validity of such assumptions, estimates or actual results.\nWhen events or changes in circumstances indicate that the carrying value of a finite-lived intangible asset may not be recoverable, we perform an assessment of the asset for potential impairment. This assessment is based on projected undiscounted future cash flows over the asset’s remaining life. If the carrying value of the asset exceeds its undiscounted cash flows, we record an impairment loss equal to the excess of the carrying value over the fair value of the asset, determined using projected discounted future cash flows of the asset.\nLiquidity and Capital Resources\n(in millions)\nSeptember 30,\nCash and cash equivalents\n$\n326.5\n$\n275.5\nRestricted cash\n0.5\n0.5\nMarketable securities\n-\n59.1\nTotal\n$\n327.0\n$\n335.1\nActivity for the year included the following:\nCash provided by operating activities\n$\n368.8\n$\n233.8\nCash used in investing activities\n(687.9\n)\n(526.0\n)\nCash provided by financing activities\n370.3\n297.4\nCash, cash equivalents and restricted cash\nWe invest our cash with highly rated financial institutions and in diversified domestic and international money market mutual funds. Cash and cash equivalents include highly liquid investments with original maturities of three months or less. At September 30, 2021, cash and cash equivalents totaled $327 million, compared to $275 million at September 30, 2020.\nA significant portion of our cash is generated and held outside the U.S. As of September 30, 2021, we had cash and cash equivalents of $37 million in the U.S., $111 million in Europe, $145 million in Asia Pacific (including India) and $34 million in other non-U.S. countries. All our marketable securities are held in the U.S. We have substantial cash requirements in the U.S., but we believe that the combination of our existing U.S. cash and cash equivalents, marketable securities, our ability to repatriate cash to the U.S. more cost effectively, future U.S. operating cash flows and cash available under our credit facility will be sufficient to meet our ongoing U.S. operating expenses and known capital requirements.\nCash provided by operating activities\nCash provided by operating activities was $369 million in FY'21 compared to $234 million in FY'20. The year-over-year increase is primarily due to approximately $190 million of higher cash collections and $20\nmillion in contribution from Arena, offset by $80 million more in salary and salary-related payment and an $18 million foreign tax payment.\nRestructuring payments totaled $14 million in FY’21, compared to $42 million in FY’20. Cash paid for income taxes was $58 million in FY’21 compared to $53 million in FY’20.\nCash used in investing activities\n(in millions)\nYear ended September 30,\nAdditions to property and equipment\n$\n(24.7\n)\n$\n(20.2\n)\nProceeds (purchases) of short- and long-term marketable securities, net\n58.4\n(1.8\n)\nAcquisitions of businesses, net of cash acquired\n(718.0\n)\n(483.5\n)\nPurchases of investments\n(4.0\n)\n-\nPurchase of intangible assets\n(0.6\n)\n(11.1\n)\nSettlement of net investment hedges\n1.0\n(9.4\n)\nNet cash used in investing activities\n$\n(687.9\n)\n$\n(526.0\n)\nCash used in investing activities reflects $718 million used for acquisitions in FY’21, primarily related to Arena compared to $483 million in FY’20 ($469 million of which related to Onshape). For additional detail on our acquisitions, see Note 6. Acquisitions, included in the Notes to Consolidated Financial Statements in this Annual Report. Our expenditures for property and equipment consist primarily of facility improvements, office equipment, computer equipment, and software.\nCash provided by financing activities\n(in millions)\nYear ended September 30,\nBorrowings on debt, net\n$\n432.0\n$\n344.9\nRepurchases of common stock\n(30.0\n)\n-\nProceeds from issuance of common stock\n21.6\n18.3\nDebt issuance costs\n-\n(17.1\n)\nDebt early redemption premium\n-\n(15.0\n)\nPayments of withholding taxes in connection with stock-based awards\n(53.0\n)\n(33.7\n)\nPayments of principal for financing leases\n(0.4\n)\n-\nNet cash provided by financing activities\n$\n370.3\n$\n297.4\nFY’21 net borrowings of $432 million were primarily used to fund the Arena acquisition. FY’20 net borrowings were primarily related to the acquisition of Onshape. FY’20 net borrowings reflect the issuance of $1 billion in new notes in February 2020 and the repayment of $500 million of earlier issued notes in May 2020, as well as net repayments of $155 million under our revolving credit facility.\nOutstanding Debt\nAs of September 30, 2021, we had:\n(in millions)\nSeptember 30, 2021\n4.000% Senior notes due 2028\n$\n500.0\n3.625% Senior notes due 2025\n500.0\nCredit facility revolver\n450.0\nTotal debt\n1,450.0\nUnamortized debt issuance costs for the Senior notes\n(10.5\n)\nTotal debt, net of issuance costs\n$\n1,439.5\nUndrawn under credit facility revolver\n$\n550.0\nUndrawn under credit facility revolver available for borrowing\n$\n533.7\nAs of September 30, 2021, we were in compliance with all financial and operating covenants of the credit facility and the note indentures. Any failure to comply with such covenants under the credit facility would prevent us from being able to borrow additional funds under the credit facility, and, as with any\nfailure to comply with such covenants under the note indentures, could constitute a default that could cause all amounts outstanding to become due and payable immediately.\nOur credit facility and our Senior Notes are described in Note 9. Debt to the Condensed Consolidated Financial Statements in this Form 10-K.\nShare Repurchase Authorization\nOur Articles of Organization authorize us to issue up to 500 million shares of our common stock. Our Board of Directors has authorized us to repurchase up to $1 billion of our common stock through September 30, 2023. We may use cash from operations and borrowings under our credit facility to make any such repurchases. All shares of our common stock repurchased are automatically restored to the status of authorized and unissued.\nIn FY’21, we repurchased approximately 226 thousand shares in the open market for $30 million. We did not repurchase any shares in FY’20.\nExpectations for Fiscal 2022\nWe believe that existing cash and cash equivalents, together with cash generated from operations and amounts available under the credit facility, will be sufficient to meet our working capital and capital expenditure requirements (which we expect to be approximately $30 million in FY’22) through at least the next twelve months and to meet our known long-term capital requirements. In FY’22 we expect to pay approximately $50 million to $55 million in restructuring cash payments related to our recently announced restructuring charge as well as previous restructuring charges. In FY’22, we expect to return approximately 25% of our estimated free cash flow excluding restructuring payments, which is expected to be approximately $450 million, to our shareholders through stock repurchases of our common stock.\nOur expected uses and sources of cash could change, our cash position could be reduced, and we could incur additional debt obligations if we decide to retire debt, engage in strategic transactions, or repurchase shares, any of which could be commenced, suspended or completed at any time. Any such repurchases or retirement of debt will depend on prevailing market conditions, our liquidity requirements, contractual restrictions and other factors. The amounts involved in any debt retirement or issuance, share repurchases, or strategic transactions may be material.\nContractual Obligations\nAt September 30, 2021, our future contractual obligations were related to debt, leases, pension liabilities, unrecognized tax benefits, and purchase obligations. See Note 9. Debt, Note 19. Leases, Note 14. Pension Plans, and Note 8. Income Taxes of Notes to Consolidated Financial Statements in this Annual Report for information about those obligations, which Notes are incorporated by reference into this section. Our purchase obligations were approximately $90.4 million, with $43.7 million expected to be paid in FY’22 and $46.8 million thereafter. Purchase obligations represent minimum commitments due to third parties, including royalty contracts, research and development contracts, telecommunication contracts, information technology maintenance contracts in support of internal-use software and hardware, financing leases, operating leases with original terms of less than 12 months, and other marketing and consulting contracts. Contracts for which our commitment is variable, based on volumes, with no fixed minimum quantities, and contracts that can be canceled without payment penalties are not included in the purchase obligation amounts above. The purchase obligations included above are in addition to amounts included in current liabilities and prepaid expenses recorded on our September 30, 2021 Consolidated Balance Sheet.\nAs of September 30, 2021, we had letters of credit and bank guarantees outstanding of approximately $16.3 million (of which $0.5 million was collateralized).\nOff-Balance Sheet Arrangements\nWe have not created, and are not party to, any special-purpose or off-balance sheet entities for the purpose of raising capital, incurring debt or operating parts of our business that are not consolidated (to\nthe extent of our ownership interest therein) into our financial statements. We have not entered into any transactions with unconsolidated entities whereby we have subordinated retained interests, derivative instruments or other contingent arrangements that expose us to material continuing risks, contingent liabilities, or any other obligation under a variable interest in an unconsolidated entity that provides financing, liquidity, market risk or credit risk support to us.\nRecent Accounting Pronouncements\nIn accordance with recently issued accounting pronouncements, we will be required to comply with certain changes in accounting rules and regulations, none of which are expected to have a material impact on our consolidated financial statements. Refer to Note 2. Summary of Significant Accounting Policies to the Condensed Consolidated Financial Statements in this Form 10-K for all recently issued accounting pronouncements, which is incorporated herein by reference.",
    "item_7A": "ITEM 7A.\nQuantitative and Qualitative Disclosures about Market Risk\nWe face exposure to financial market risks, including adverse movements in foreign currency exchange rates and changes in interest rates. These exposures may change over time as business practices evolve and could have a material adverse impact on our financial results.\nForeign currency exchange risk\nOur earnings and cash flows are subject to fluctuations due to changes in foreign currency exchange rates. Our most significant foreign currency exposures relate to Western European countries, Japan, Israel, China and Canada. We enter into foreign currency forward contracts to manage our exposure to fluctuations in foreign exchange rates that arise from receivables and payables denominated in foreign currencies. We do not enter into or hold foreign currency derivative financial instruments for trading or speculative purposes, nor do we enter into derivative financial instruments to hedge future cash flows or forecast transactions.\nOur non-U.S. revenues generally are transacted through our non-U.S. subsidiaries and typically are denominated in their local currency. In addition, expenses that are incurred by our non-U.S. subsidiaries typically are denominated in their local currency. Approximately 60% of our revenue and 40% of our expenses were transacted in currencies other than the U.S. dollar. Currency translation affects our reported results because we report our results of operations in U.S. Dollars. Historically, our most significant currency risk has been changes in the Euro and Japanese Yen relative to the U.S. Dollar. Based on current revenue and expense levels (excluding restructuring charges and stock-based compensation), a $0.10 change in the USD to EUR exchange rate and a 10 Yen change in the Yen to USD exchange rate would impact operating income by approximately $28 million and $10 million, respectively.\nOur exposure to foreign currency exchange rate fluctuations arises in part from intercompany transactions, with most intercompany transactions occurring between a U.S. dollar functional currency entity and a foreign currency denominated entity. Intercompany transactions typically are denominated in the local currency of the non-U.S. dollar functional currency subsidiary in order to centralize foreign currency risk. Also, both PTC (the parent company) and our non-U.S. subsidiaries may transact business with our customers and vendors in a currency other than their functional currency (transaction risk). In addition, we are exposed to foreign exchange rate fluctuations as the financial results and balances of our non-U.S. subsidiaries are translated into U.S. dollars (translation risk). If sales to customers outside of the United States increase, our exposure to fluctuations in foreign currency exchange rates will increase.\nOur foreign currency risk management strategy is principally designed to mitigate the future potential financial impact of changes in the U.S. dollar value of balances denominated in foreign currency, resulting from changes in foreign currency exchange rates. Our foreign currency hedging program uses forward contracts to manage the foreign currency exposures that exist as part of our ongoing business operations. The contracts are primarily denominated in Japanese Yen and European currencies, and have maturities of less than three months.\nGenerally, we do not designate foreign currency forward contracts as hedges for accounting purposes, and changes in the fair value of these instruments are recognized immediately in earnings.\nBecause we enter into forward contracts only as an economic hedge, any gain or loss on the underlying foreign-denominated balance would be offset by the loss or gain on the forward contract. Gains and losses on forward contracts and foreign currency denominated receivables and payables are included in foreign currency net losses.\nAs of September 30, 2021 and 2020, we had outstanding forward contracts for derivatives not designated as hedging instruments with notional amounts equivalent to the following:\nSeptember 30,\nCurrency Hedged (in thousands)\nCanadian / U.S. Dollar\n$\n4,894\n$\n6,847\nEuro / U.S. Dollar\n387,466\n390,673\nBritish Pound / U.S. Dollar\n23,141\n6,328\nIsraeli Shekel / U.S. Dollar\n10,475\n9,503\nJapanese Yen / U.S. Dollar\n46,450\n50,379\nSwiss Franc / U.S. Dollar\n18,039\n12,874\nSwedish Krona / U.S. Dollar\n34,196\n18,871\nSingapore Dollar / U.S. Dollar\n3,498\n3,281\nChinese Renminbi / U.S. Dollar\n23,297\n5,415\nNew Taiwan Dollar / U.S. Dollar\n3,369\n1,483\nRussian Ruble/ U.S. Dollar\n2,614\nAll other\n6,482\n6,499\nTotal\n$\n563,921\n$\n512,462\nDebt\nIn addition to the $1 billion due under our 2025 and 2028 Senior Notes, as of September 30, 2021, we had $450 million outstanding under our credit facility. Loans under the credit facility bear interest at variable rates which reset every 30 to 180 days depending on the rate and period selected by us. These loans are subject to interest rate risk as interest rates will be adjusted at each rollover date to the extent such amounts are not repaid. As of September 30, 2021, the annual rate on the credit facility loans was 1.69%. If there were a hypothetical 100 basis point change in interest rates, the annual net impact to earnings and cash flows would be $4.5 million. This hypothetical change in cash flows and earnings has been calculated based on the borrowings outstanding at September 30, 2021 and a 100 basis point per annum change in interest rate applied over a one-year period.\nCash and cash equivalents\nAs of September 30, 2021, cash equivalents were invested in highly liquid investments with maturities of three months or less when purchased. We invest our cash with highly rated financial institutions in North America, Europe and Asia Pacific and in diversified domestic and international money market mutual funds. At September 30, 2021, we had cash and cash equivalents of $37 million in the United States, $111 million in Europe, $145 million in Asia Pacific (including India), and $34 million in other non-U.S. countries. Given the short maturities and investment grade quality of the portfolio holdings at September 30, 2021, a hypothetical 10% change in interest rates would not materially affect the fair value of our cash and cash equivalents.\nOur invested cash is subject to interest rate fluctuations and, for non-U.S. operations, foreign currency risk. In a declining interest rate environment, we would experience a decrease in interest income. The opposite holds true in a rising interest rate environment. Over the past several years, the U.S. Federal Reserve Board, European Central Bank and Bank of England have changed certain benchmark interest rates, which has led to declines and increases in market interest rates. These changes in market interest rates have resulted in fluctuations in interest income earned on our cash and cash equivalents. Interest income will continue to fluctuate based on changes in market interest rates and levels of cash available for investment. Changes in foreign currencies relative to the U.S. dollar had an unfavorable impact of $0.1 million and $2.6 million on our consolidated cash balances in 2021 and 2019, respectively, in particular due to changes in the Euro and the Japanese Yen, and an immaterial impact in 2020.",
    "item_8": "ITEM 8.\nFinancial Statements and Supplementary Data\nThe consolidated financial statements and notes to the consolidated financial statements are attached as APPENDIX A.",
    "item_9": "ITEM 9.\nChanges in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "ITEM 9A.\nControls and Procedures\nEvaluation of Disclosure Controls and Procedures\nOur management maintains disclosure controls and procedures as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the “Exchange Act”) that are designed to provide reasonable assurance that information required to be disclosed in our reports filed or submitted under the Exchange Act is processed, recorded, summarized and reported within the time periods specified in the SEC’s rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer (our principal executive officer and principal financial officer, respectively), as appropriate, to allow for timely decisions regarding required disclosure.\nAs required by SEC Rule 15d-15(b), we carried out an evaluation, under the supervision and with the participation of management, including our principal executive and principal financial officers, of the effectiveness of the design and operation of our disclosure controls and procedures as of the end of the period covered by this Annual Report. Based on this evaluation, we concluded that our disclosure controls and procedures were effective at the reasonable assurance level as of September 30, 2021.\nManagement’s Annual Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act as a process designed by, or under the supervision of, our principal executive and principal financial officers and effected by our board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles and includes those policies and procedures that:\n•\nPertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of our assets;\n•\nProvide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and\n•\nProvide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate\nOur management assessed the effectiveness of our internal control over financial reporting as of September 30, 2021 using the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework (2013). Based on this assessment\nand those criteria, our management concluded that, as of September 30, 2021, our internal control over financial reporting was effective.\nManagement excluded Arena from our assessment of internal control over financial reporting as of September 30, 2021 because the Company acquired it in a business combination in 2021. Arena’s total assets and total revenues represent approximately 1% and 2%, respectively, of the Company’s total assets and total revenues, as of and for the year ended September 30, 2021.\nThe effectiveness of our internal control over financial reporting as of September 30, 2021 has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in their report, which appears under Item 8.\nChange in Internal Control over Financial Reporting\nThere was no change in our internal control over financial reporting that occurred during the quarter ended September 30, 2021 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.",
    "item_9B": "ITEM 9B.\nOther Information\nNone.\nITEM 9C.\nDisclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nPART III",
    "item_10": "ITEM 10.\nDirectors, Executive Officers and Corporate Governance\nThe information required by this item with respect to our directors and executive officers may be found in the sections captioned “Proposal 1: Election of Directors,” “Corporate Governance,” \"Our Executive Officers,\" and “Transactions with Related Persons” appearing in our 2022 Proxy Statement. Such information is incorporated into this Item 10 by reference.\nCode of Ethics for Senior Executive Officers\nWe have adopted a Code of Ethics for Senior Executive Officers that applies to our Chief Executive Officer, President, Chief Financial Officer, and Controller, as well as others. The Code is embedded in our Code of Business Conduct and Ethics applicable to all employees. A copy of the Code of Business Conduct and Ethics is publicly available on our website at www.ptc.com. If we make any substantive amendments to, or grant any waiver from, including any implicit waiver, the Code of Ethics for Senior Executive Officers to or for our Chief Executive Officer, President, Chief Financial Officer or Controller, we will disclose the nature of such amendment or waiver in a current report on Form 8-K.",
    "item_11": "ITEM 11.\nExecutive Compensation\nInformation with respect to director and executive compensation may be found under the headings “Director Compensation,” “Compensation Discussion and Analysis,” “Executive Compensation,” and “Compensation Committee Report” appearing in our 2022 Proxy Statement. Such information is incorporated herein by reference.",
    "item_12": "ITEM 12.\nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nInformation required by this item may be found under the heading “Information about PTC Common Stock Ownership” in our 2022 Proxy Statement. Such information is incorporated herein by reference.\nEQUITY COMPENSATION PLAN INFORMATION\nas of September 30, 2021\nPlan Category\nNumber of securities to be issued upon exercise of outstanding options, warrants and rights\nWeighted-average exercise price of outstanding options, warrants and rights\nNumber of securities remaining available for future issuance under equity compensation plans\nEquity compensation plans approved by security holders:\n2000 Equity Incentive Plan(1)\n3,215,849\n-\n(1)\n4,074,497\n2016 Employee Stock Purchase Plan(2)\n-\n-\n634,855\n(2)\nTotal\n3,215,849\n-\n4,709,352\n(1)\nAll of the shares issuable upon vesting are restricted stock units, which have no exercise price.\n(2)\nThis amount represents the total number of shares remaining available under the 2016 Employee Stock Purchase Plan, of which 110,363 shares are subject to purchase during the current offering period.",
    "item_13": "ITEM 13.\nCertain Relationships and Related Transactions, and Director Independence\nInformation with respect to this item may be found under the headings “Independence of Our Directors,” “Review of Transactions with Related Persons” and “Transactions with Related Persons” in our 2022 Proxy Statement. Such information is incorporated herein by reference.",
    "item_14": "ITEM 14.\nPrincipal Accounting Fees and Services\nInformation with respect to this item may be found under the headings “Engagement of Independent Auditor and Approval of Professional Services and Fees” and “PricewaterhouseCoopers LLP Professional Services and Fees” in our 2022 Proxy Statement. Such information is incorporated herein by reference.\nPART IV",
    "item_15": "ITEM 15.\nExhibits and Financial Statement Schedules\n(a) Documents Filed as Part of Form 10-K\n1.\nFinancial Statements\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of September 30, 2021 and 2020\nConsolidated Statements of Operations for the years ended September 30, 2021, 2020 and 2019\nConsolidated Statements of Comprehensive Income (Loss) for the years ended September 30, 2021, 2020 and 2019\nConsolidated Statements of Cash Flows for the years ended September 30, 2021, 2020 and 2019\nConsolidated Statements of Stockholders’ Equity for the years ended September 30, 2021, 2020 and 2019\nNotes to Consolidated Financial Statements\n2.\nFinancial Statement Schedules\nSchedules have been omitted since they are either not required, not applicable, or the information is otherwise included in the Financial Statements per Item 15(a)1 above.\n3.\nExhibits\nThe list of exhibits in the Exhibit Index is incorporated herein by reference.\n(b) Exhibits\nWe hereby file the exhibits listed in the attached Exhibit Index.\n(c) Financial Statement Schedules\nNone.\nITEM 16.\nForm 10-K Summary\nNone.\nEXHIBIT INDEX\nExhibit\nNumber\nExhibit\n3.1\n-\nRestated Articles of Organization of PTC Inc. adopted August 4, 2015 (filed as Exhibit 3.1 to our Annual Report on Form 10-K for the fiscal year ended September 30, 2015 (File No. 0-18059) and incorporated herein by reference).\n3.2\n-\nBy-Laws, as amended and restated, of PTC Inc. (filed as Exhibit 3.2 to our Quarterly Report on Form 10-Q for the fiscal quarter ended March 29, 2014 (File No. 0-18059) and incorporated herein by reference).\n3.3\n-\nAmendment to PTC By-Laws dated June 24, 2021 (filed as Exhibit 3.1 to our Current Report on Form 8-K filed on June 25, 2021 (File No. 0-18059) and incorporated herein by reference).\n4.1\n-\nIndenture, dated as of February 13, 2020, between PTC Inc. and Wells Fargo Bank, National Association, as trustee (filed as Exhibit 4.1 to our Current Report on Form 8-K filed on February 13, 2020 (File No. 0-18059) and incorporated herein by reference).\n4.2\n-\nForm of 3.625% senior unsecured notes due 2025 (filed as Exhibit 4.2 to our Current Report on Form 8-K filed on February 13, 2020 (File No. 0-18059) and incorporated herein by reference).\n4.3\n-\nForm of 4.000% senior unsecured notes due 2028 (filed as Exhibit 4.3 to our Current Report on Form 8-K filed on February 13, 2020 (File No. 0-18059) and incorporated herein by reference).\n4.4\n-\nDescription of Securities Registered under Section 12 of the Securities Exchange Act of 1934 (filed as Exhibit 4.4 to our Annual Report on Form 10-K for the year ended September 30, 2019 (File No. 0-18059) and incorporated herein by reference).\n10.1.1*\n-\n2000 Equity Incentive Plan (filed as Exhibit 10 to our Current Report on Form 8-K filed on March 8, 2019 (File No. 0-18059) and incorporated herein by reference.\n10.1.2\n-\nForm of Restricted Stock Unit Certificate (Non-U.S.) (filed as Exhibit 10.4 to our Quarterly Report on Form 10-Q for the fiscal quarter ended July 2, 2005 (File No. 0-18059) and incorporated herein by reference).\n10.1.3*\n-\nForm of Restricted Stock Unit Certificate (Non-Employee Director) (filed as Exhibit 10.1.1 to our Quarterly Report on Form 10-Q for the fiscal quarter ended March 30, 2013 (File No. 0-18059) and incorporated herein by reference).\n10.1.4\n-\nForm of Restricted Stock Unit Certificate (U.S.) (filed as Exhibit 10.1.9 to our Annual Report on Form 10-K for the fiscal year ended September 30, 2016 (File No. 0-18059) and incorporated herein by reference).\n10.1.5\n-\nForm of Restricted Stock Unit Certificate (U.S.) (filed as Exhibit 10.1.10 to our Annual Report on Form 10-K for the fiscal year ended September 30, 2016 (File No. 0-18059) and incorporated herein by reference).\n10.1.6\n-\nForm of Restricted Stock Unit Certificate (U.S.) (filed as Exhibit 10.1.11 to our Annual Report on Form 10-K for the fiscal year ended September 30, 2016 (File No. 0-18059) and incorporated herein by reference).\n10.1.7\n-\nForm of Restricted Stock Unit Certificate (U.S. EVP) (filed as Exhibit 10.1.12 to our Annual Report on Form 10-K for the fiscal year ended September 30, 2016 (File No. 0-18059) and incorporated herein by reference).\n10.1.8*\n-\nForm of Restricted Stock Unit Certificate (U.S. Section 16) (filed as Exhibit 10.1.13 to our Annual Report on Form 10-K for the fiscal year ended September 30, 2016 (File No. 0-18059) and incorporated herein by reference).\n10.1.9\n-\nForm of Restricted Stock Unit Certificate (U.S. EVP) (filed as Exhibit 10.1.14 to our Annual Report on Form 10-K for the fiscal year ended September 30, 2016 (File No. 0-18059) and incorporated herein by reference).\n10.1.10\n-\nForm of Restricted Stock Unit Certificate (U.S.) (filed as Exhibit 10.1.15 to our Annual Report on Form 10-K for the fiscal year ended September 30, 2016(File No. 0-18059) and incorporated herein by reference).\n10.1.11*\n-\nForm of Restricted Stock Unit Certificate (U.S. Section 16) (filed as Exhibit 10.1.16 to our Annual Report on Form 10-K for the fiscal year ended September 30, 2016 (File No. 0-18059) and incorporated herein by reference).\n10.1.12*\n-\nForm of Restricted Stock Unit Certificate (U.S. Section 16) (filed as Exhibit 10.1.17 to our Annual Report on Form 10-K for the fiscal year ended September 30, 2012 (File No. 0-18059) and incorporated herein by reference).\n10.2*\n-\n2016 Employee Stock Purchase Plan (filed as Exhibit 10.1 to our Quarterly Report on Form 10-Q for the fiscal quarter ended December 28, 2019 (File No. 0-18059) and incorporated herein by reference).\n10.3*\n-\nExecutive Agreement by and between the Company and James Heppelmann, President and Chief Executive Officer, dated September 30, 2020 (filed as Exhibit 10.1 to our Current Report on Form 8-K dated September 30, 2020 (File No. 0-18059) and incorporated herein by reference).\n10.4*\n-\nForm of Amended and Restated Executive Agreement between the Company and each of Kristian Talvitie and Aaron von Staats (filed as Exhibit 10.3 to PTC’s Quarterly Report on Form 10-Q for the period ended December 28, 2019 (File. 0-18059) and incorporated herein by reference).\n10.5*\n-\nForm of Executive Agreement between the Company and Michael DiTullio (filed as Exhibit 10.1 to PTC’s Quarterly Report on Form 10-Q for the period ended March 28, 2020 (File. No. 0-18059) and incorporated herein by reference).\n10.6*\n-\nExecutive Agreement between the Company and Troy Richardson dated November 16, 2020 (filed as Exhibit 10.6 to PTC’s Annual Report on Form 10-K for the period ended September 30, 2020 (File 0-18059) and incorporated herein by reference).\n10.7\n-\nLease dated December 14, 1999 by and between PTC Inc. and Boston Properties Limited Partnership (filed as Exhibit 10.21 to our Annual Report on Form 10-K for the fiscal year ended September 30, 2000 (File No. 0-18059) and incorporated herein by reference).\n10.8\n-\nThird Amendment to Lease Agreement dated as of October 27, 2010 by and between Boston Properties Limited Partnership and PTC Inc. (filed as Exhibit 10.1 to our Current Report on Form 8-K dated November 8, 2010 (File No. 0-18059) and incorporated herein by reference).\n10.9\n-\nFifth Amendment dated April 10, 2020 to Lease dated December 14, 1999 by and between PTC Inc. and Boston Properties Limited Partnership (filed as Exhibit 10.2 to PTC’s Quarterly Report on Form 10-Q for the period ended March 28, 2020 (File. No. 0-18059) and incorporated herein by reference).\n10.10\n-\nOffice Lease Agreement dated as of September 7, 2017 by and between PTC Inc. and SCD L2 Seaport Square LLC (filed as Exhibit 10 to our Current Report on Form 8-K filed on September 7, 2017 (File No. 0-18059) and incorporated herein by reference).\n10.11\n-\nFirst Amendment to Lease dated as of October 5, 2017 by and between PTC Inc. and SCD L2 Seaport Square LLC (filed as Exhibit 10.23 to our Annual Report on Form 10-K for the period ended September 30, 2017 (File No. 0-18059) and incorporated herein by reference).\n10.12***\n-\nThird Amended and Restated Strategic Alliance Agreement by and between PTC Inc. and Rockwell Automation, Inc. dated as of October 28, 2020 (filed as Exhibit 10.1 to our Current Report on Form 8-K dated October 28, 2020 (File No. 0-18059) and incorporated herein by reference).\n10.13\n-\nRegistration Rights Agreement by and between the Company and Rockwell Automation, Inc., dated July 19, 2018 (filed as Exhibit 10.1 in our Current Report on Form 8-K filed on July 19, 2018 (File No. 0-18059) and incorporated herein by reference).\n10.14\n-\nSecurities Purchase Agreement by and between PTC Inc. and Rockwell Automation, Inc., dated as of June 11, 2018 (filed as Exhibit 10.1 to our Current Report on Form 8-K filed on June 11, 2018 (File No. 0-18059) and incorporated herein by reference).\n10.15\n-\nAmendment No. 1 to Securities Purchase Agreement dated as of May 11, 2021 between PTC Inc. and Rockwell Automation, Inc. filed as Exhibit 10.1 to our Current Report on Form 8-K filed on May 13, 2021 (File No. 0-18059) and incorporated herein by reference).\n10.16\n-\nThird Amended and Restated Credit Agreement, by and among the Company, PTC (IFSC) Limited, the lenders listed thereto and JPMorgan Chase Bank, N.A., as administrative agent (filed as Exhibit 4.4 to our Current Report on Form 8-K filed on February 13, 2020 (File No. 0-18059) and incorporated herein by reference).\n21.1\n-\nSubsidiaries of PTC Inc.\n23.1\n-\nConsent of PricewaterhouseCoopers LLP, an independent registered public accounting firm.\n31.1\n-\nCertification of the Chief Executive Officer Pursuant to Exchange Act Rules 13(a)-14(a) and 15d-14(a).\n31.2\n-\nCertification of the Chief Financial Officer Pursuant to Exchange Act Rules 13(a)-14(a) and 15d-14(a).\n32**\n-\nCertification of Periodic Financial Report Pursuant to 18 U.S.C. Section 1350.\n-\nThe following materials from PTC Inc.'s Annual Report on Form 10-K for the year ended September 30, 2021, formatted in Inline XBRL (eXtensible Business Reporting Language): (i) Consolidated Balance Sheets as of September 30, 2021 and 2020; (ii) Consolidated Statements of Operations for the years ended September 30, 2021, 2020 and 2019; (iii) Consolidated Statements of Comprehensive Income for the years ended September 30, 2021, 2020 and 2019; (iv) Consolidated Statements of Cash Flows for the years ended September 30, 2021, 2020 and 2019; (v) Consolidated Statements of Stockholders’ Equity for the years ended September 30, 2021, 2020 and 2019; and (vi) Notes to Consolidated Financial Statements.\n-\nThe cover page of the Annual Report on Form 10-K formatted in Inline XBRL (included in Exhibit 101).\n*\nIdentifies a management contract or compensatory plan or arrangement in which an executive officer or director of PTC participates.\n**\nIndicates that the exhibit is being furnished with this report and is not filed as a part of it.\n***\nCertain information has been excluded from this exhibit because it is not material and would likely cause competitive harm to the registrant if publicly disclosed.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized on the 19th day of November, 2021.\nPTC Inc.\nBy:\n/s/ JAMES HEPPELMANN\nJames Heppelmann\nPresident and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities indicated below, on the 19th day of November, 2021.\nSignature\nTitle\n(i) Principal Executive Officer:\n/s/ JAMES HEPPELMANN\nPresident and Chief Executive Officer\nJames Heppelmann\n(ii) Principal Financial and Accounting Officer:\n/s/ KRISTIAN TALVITIE\nExecutive Vice President and Chief Financial Officer\nKristian Talvitie\n(iii) Board of Directors:\n/s/ ROBERT SCHECHTER\nChairman of the Board of Directors\nRobert Schechter\n/s/ MARK BENJAMIN\nDirector\nMark Benjamin\n/s/ JANICE CHAFFIN\nDirector\nJanice Chaffin\n/s/ JAMES HEPPELMANN\nDirector\nJames Heppelmann\n/s/ KLAUS HOEHN\nDirector\nKlaus Hoehn\n/s/ PAUL LACY\nDirector\nPaul Lacy\n/s/ CORINNA LATHAN\nDirector\nCorinna Lathan\n/s/ BLAKE MORET\nDirector\nBlake Moret\nAPPENDIX A\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Stockholders of PTC Inc.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of PTC Inc. and its subsidiaries (the “Company”) as of September 30, 2021 and 2020, and the related consolidated statements of operations, of comprehensive income (loss), of stockholders’ equity and of cash flows for each of the three years in the period ended September 30, 2021, including the related notes (collectively referred to as the “consolidated financial statements”). We also have audited the Company's internal control over financial reporting as of September 30, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of September 30, 2021 and 2020, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2021 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of September 30, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the COSO.\nChanges in Accounting Principles\nAs discussed in Note 2 to the consolidated financial statements, the Company changed the manner in which it accounts for leases in fiscal 2020 and the manner in which it accounts for revenues from contracts with customers in fiscal 2019.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Management’s Annual Report on Internal Control over Financial Reporting appearing under Item 9A. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing\nsuch other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nAs described in Management’s Annual Report on Internal Control over Financial Reporting, management has excluded Arena Holdings, Inc. from its assessment of internal control over financial reporting as of September 30, 2021 because it was acquired by the Company in a purchase business combination during fiscal 2021. We have also excluded Arena Holdings, Inc. from our audit of internal control over financial reporting. Arena Holdings, Inc. is a wholly-owned subsidiary whose total assets and total revenues excluded from management’s assessment and our audit of internal control over financial reporting represent approximately 1% and 2%, respectively, of the related consolidated financial statement amounts as of and for the year ended September 30, 2021.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that (i) relate to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nRevenue from Contracts with Customers - Identification of Distinct Performance Obligations\nAs described in Note 2 to the consolidated financial statements, the Company’s sources of revenue include: (1) subscriptions, (2) perpetual license, (3) support for perpetual licenses and (4) professional services. Revenue is derived from the licensing of computer software products and from related support and/or professional services contracts. During the year ended September 30, 2021, the Company recognized revenue from contracts with customers of $1,807.2 million. The Company’s contracts with customers for subscriptions typically include commitments to transfer term-based, on-premises software licenses bundled with support and/or cloud services. On-premises software is determined to be a distinct performance obligation from support. The corresponding revenues are recognized as the related performance obligations are satisfied.\nThe principal considerations for our determination that performing procedures relating to revenue recognition, specifically related to management’s identification of distinct performance obligations, is a critical audit matter are the significant judgment by management in the identification of distinct performance obligations, specifically the determination that the on-premises software is determined to\nbe a distinct performance obligation from support, which in turn led to a high degree of auditor judgment, subjectivity, and effort in performing procedures and evaluating audit evidence related to management’s identification of distinct performance obligations within contracts with customers.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to the revenue recognition process, including the identification of distinct performance obligations. These procedures also included, among others (i) evaluating the Company’s revenue recognition accounting policy and (ii) testing management’s identification of distinct performance obligations in its contracts with customers by examining revenue contracts on a sample basis and evaluating whether these performance obligations are satisfied at a point in time or satisfied over time.\nAcquisition of Arena Holdings, Inc. - Valuation of the Customer Relationships Intangible Asset\nAs described in Note 6 to the consolidated financial statements, the Company completed its acquisition of Arena Holdings, Inc. on January 15, 2021, for purchase consideration of approximately $715.0 million, net of cash acquired of $11.1 million. The acquisition of Arena Holdings, Inc. has been accounted for as a business combination. Assets acquired and liabilities assumed have been recorded at their estimated fair values as of the acquisition date. The purchase price allocation resulted in $155.0 million of customer relationships being recorded. Management estimated the fair value of the customer relationships intangible asset using a discounted cash flow model which included significant judgment and assumptions related to future revenues and costs.\nThe principal considerations for our determination that performing procedures relating to the valuation of the customer relationships intangible asset in the acquisition of Arena Holdings, Inc. is a critical audit matter are the significant judgment by management when estimating the fair value of the customer relationships intangible asset, which in turn led to a high degree of auditor judgment, subjectivity, and effort in performing procedures and evaluating audit evidence related to the discounted cash flow model utilized to value the customer relationships intangible asset and management’s assumptions related to future revenues and costs. In addition, the audit effort involved the use of professionals with specialized skill and knowledge.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to management’s determination of the fair value of the customer relationships intangible asset. These procedures also included, among others (i) reading the purchase agreement; (ii) testing management’s process for estimating the fair value of the customer relationships intangible asset; (iii) evaluating the appropriateness of the discounted cash flow model used by management; (iv) testing the completeness and accuracy of the underlying data used in the valuation; and (v) evaluating the reasonableness of the significant assumptions related to future revenues and costs. Evaluating management’s assumptions related to future revenues and costs involved evaluating whether the assumptions used by management were reasonable considering (i) the consistency with external economic and industry data and (ii) whether these assumptions were consistent with evidence obtained in other areas of the audit. Professionals with specialized skill and knowledge were used to assist in evaluating the appropriateness of the discounted cash flow model.\n/s/ PricewaterhouseCoopers LLP\nBoston, Massachusetts\nNovember 19, 2021\nWe have served as the Company’s auditor since 1992.\nPTC Inc.\nCONSOLIDATED BALANCE SHEETS\n(in thousands, except per share data)\nSeptember 30,\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n326,532\n$\n275,458\nShort-term marketable securities\n-\n28,129\nAccounts receivable, net of allowance for doubtful accounts of $304 and $543 at September 30, 2021 and September 30, 2020, respectively\n541,072\n415,221\nPrepaid expenses\n69,991\n69,408\nOther current assets\n135,415\n45,231\nTotal current assets\n1,073,010\n833,447\nProperty and equipment, net\n100,237\n101,499\nGoodwill\n2,191,887\n1,625,786\nAcquired intangible assets, net\n378,967\n237,570\nLong-term marketable securities\n-\n30,970\nDeferred tax assets\n297,789\n190,963\nOperating right-of-use lease assets\n152,337\n149,933\nOther assets\n313,333\n212,570\nTotal assets\n$\n4,507,560\n$\n3,382,738\nLIABILITIES AND STOCKHOLDERS’ EQUITY\nCurrent liabilities:\nAccounts payable\n$\n33,381\n$\n24,910\nAccrued expenses and other current liabilities\n113,067\n96,313\nAccrued compensation and benefits\n117,784\n101,087\nAccrued income taxes\n5,055\n7,011\nDeferred revenue\n482,131\n416,804\nShort-term lease obligations\n27,864\n34,635\nTotal current liabilities\n779,282\n680,760\nLong-term debt\n1,439,471\n1,005,314\nDeferred tax liabilities\n4,165\n12,431\nDeferred revenue\n15,546\n9,661\nLong-term lease obligations\n180,935\n180,388\nOther liabilities\n49,693\n55,936\nTotal liabilities\n2,469,092\n1,944,490\nCommitments and contingencies (Note 10)\nStockholders’ equity:\nPreferred stock, $0.01 par value; 5,000 shares authorized; none issued\n-\n-\nCommon stock, $0.01 par value; 500,000 shares authorized; 117,163 and 116,125 shares issued and outstanding at September 30, 2021 and September 30, 2020, respectively\n1,172\n1,161\nAdditional paid-in capital\n1,718,504\n1,602,728\nRetained earnings (Accumulated deficit)\n414,656\n(62,267\n)\nAccumulated other comprehensive loss\n(95,864\n)\n(103,374\n)\nTotal stockholders’ equity\n2,038,468\n1,438,248\nTotal liabilities and stockholders’ equity\n$\n4,507,560\n$\n3,382,738\nThe accompanying notes are an integral part of these consolidated financial statements.\nPTC Inc.\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(in thousands, except per share data)\nYear ended September 30,\nRevenue:\nLicense\n$\n738,053\n$\n509,792\n$\n324,400\nSupport and cloud services\n911,288\n804,825\n763,700\nTotal software revenue\n1,649,341\n1,314,617\n1,088,100\nProfessional services\n157,818\n143,798\n167,531\nTotal revenue\n1,807,159\n1,458,415\n1,255,631\nCost of revenue:\nCost of license revenue\n61,750\n53,195\n51,936\nCost of support and cloud services revenue\n164,108\n145,386\n133,478\nTotal cost of software revenue\n225,858\n198,581\n185,414\nCost of professional services revenue\n145,244\n135,690\n139,964\nTotal cost of revenue\n371,102\n334,271\n325,378\nGross margin\n1,436,057\n1,124,144\n930,253\nOperating expenses:\nSales and marketing\n517,779\n435,451\n417,449\nResearch and development\n299,917\n256,575\n246,888\nGeneral and administrative\n206,006\n159,826\n127,919\nAmortization of acquired intangible assets\n29,396\n28,713\n23,841\nRestructuring and other charges, net\n2,211\n32,716\n51,114\nTotal operating expenses\n1,055,309\n913,281\n867,211\nOperating income\n380,748\n210,863\n63,042\nInterest and debt premium expense\n(50,478\n)\n(76,428\n)\n(43,047\n)\nOther income, net\n61,485\nIncome before income taxes\n391,755\n134,706\n20,300\nProvision (benefit) for income taxes\n(85,168\n)\n4,011\n47,760\nNet income (loss)\n$\n476,923\n$\n130,695\n$\n(27,460\n)\nEarnings (loss) per share-Basic\n$\n4.08\n$\n1.13\n$\n(0.23\n)\nEarnings (loss) per share-Diluted\n$\n4.03\n$\n1.12\n$\n(0.23\n)\nWeighted-average shares outstanding-Basic\n116,836\n115,663\n117,724\nWeighted-average shares outstanding-Diluted\n118,367\n116,267\n117,724\nThe accompanying notes are an integral part of these consolidated financial statements.\nPTC Inc.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME (LOSS)\n(in thousands)\nYear ended September 30,\nNet income (loss)\n$\n476,923\n$\n130,695\n$\n(27,460\n)\nOther comprehensive income, net of tax:\nHedge gain (loss) arising during the period, net of tax of $0.4 million, $1.7 million, and $1.7 million in 2021, 2020, and 2019, respectively\n1,248\n(13,242\n)\n5,251\nNet hedge (loss) reclassified into earnings, net of tax of $0 million, $0 million, and $0.1 million in 2021, 2020, and 2019, respectively\n-\n-\n(549\n)\nRealized and unrealized gain (loss) on hedging instruments\n1,248\n(13,242\n)\n4,702\nForeign currency translation adjustment, net of tax of $0 for each period\n1,613\n22,076\n(24,755\n)\nUnrealized gain (loss) on marketable securities, net of tax of $0 for each period\n(307\n)\nAmortization of net actuarial pension gain included in net income, net of tax of $1.2 million, $0.9 million, and $0.7 million in 2021, 2020, and 2019, respectively\n2,930\n2,983\n1,691\nPension net gain (loss) arising during the period net of tax of $0.7 million, $0.7 million, and $3.6 million in 2021, 2020, and 2019, respectively\n1,891\n(2,791\n)\n(8,743\n)\nChange in unamortized pension gain (loss) during the period related to changes in foreign currency\n(1,878\n)\n1,450\nOther comprehensive income (loss)\n7,510\n7,336\n(25,125\n)\nComprehensive income (loss)\n$\n484,433\n$\n138,031\n$\n(52,585\n)\nThe accompanying notes are an integral part of these consolidated financial statements.\nPTC Inc.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in thousands)\nYear ended September 30,\nCash flows from operating activities:\nNet income (loss)\n$\n476,923\n$\n130,695\n$\n(27,460\n)\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization\n85,239\n80,817\n77,824\nAmortization of right-of-use lease assets\n37,295\n38,687\n-\nStock-based compensation\n177,289\n115,149\n86,400\nGain on investment\n(68,829\n)\n-\n-\nOther non-cash items, net\n(1,381\n)\n(3,167\n)\n(4,148\n)\nProvision (benefit) from deferred income taxes\n(158,105\n)\n(24,641\n)\n1,708\nChanges in operating assets and liabilities, excluding the effects of acquisitions:\nAccounts receivable\n(119,418\n)\n(32,365\n)\n29,446\nAccounts payable and accrued expenses\n25,096\n(5,135\n)\n16,200\nAccrued compensation and benefits\n16,775\n10,282\n(12,098\n)\nDeferred revenue\n58,702\n17,046\n45,875\nIncome taxes\n13,979\n(26,616\n)\nOther current assets and prepaid expenses\n(14,206\n)\n36,189\n(2,829\n)\nOperating lease liabilities\n(7,129\n)\n(11,110\n)\n-\nOther noncurrent assets and liabilities\n(153,421\n)\n(92,023\n)\n73,995\nNet cash provided by operating activities\n368,809\n233,808\n285,145\nCash flows from investing activities:\nAdditions to property and equipment\n(24,713\n)\n(20,196\n)\n(64,411\n)\nPurchases of short- and long-term marketable securities\n(7,562\n)\n(33,869\n)\n(33,027\n)\nProceeds from sales of short- and long-term marketable securities\n56,170\n1,521\n1,507\nProceeds from maturities of short- and long-term marketable securities\n9,861\n30,521\n30,469\nAcquisitions of businesses, net of cash acquired\n(718,030\n)\n(483,478\n)\n(86,737\n)\nPurchases of investments\n(4,000\n)\n-\n(7,500\n)\nPurchase of intangible assets\n(550\n)\n(11,050\n)\n-\nSettlement of net investment hedges\n(9,421\n)\n9,675\nNet cash used in investing activities\n(687,859\n)\n(525,972\n)\n(150,024\n)\nCash flows from financing activities:\nProceeds from issuance of Senior Notes\n-\n1,000,000\n-\nBorrowings under credit facility\n600,000\n455,000\n205,000\nRepayments of Senior Notes\n-\n(500,000\n)\n-\nRepayments of borrowings under credit facility\n(168,000\n)\n(610,125\n)\n(180,000\n)\nRepurchases of common stock\n(30,000\n)\n-\n(114,994\n)\nProceeds from issuance of common stock\n21,575\n18,382\n12,975\nDebt issuance costs\n-\n(17,107\n)\n-\nContingent consideration\n-\n-\n(1,575\n)\nDebt early redemption premium\n-\n(15,000\n)\n-\nPayments of withholding taxes in connection with stock-based awards\n(52,957\n)\n(33,740\n)\n(44,366\n)\nPayments of principal for financing leases\n(354\n)\n-\n-\nNet cash provided by (used in) financing activities\n370,264\n297,410\n(122,960\n)\nEffect of exchange rate changes on cash, cash equivalents and restricted cash\n(127\n)\n(2,565\n)\nNet change in cash, cash equivalents, and restricted cash\n51,087\n5,271\n9,596\nCash, cash equivalents, and restricted cash, beginning of period\n275,960\n270,689\n261,093\nCash, cash equivalents, and restricted cash, end of period\n$\n327,047\n$\n275,960\n$\n270,689\nSupplemental disclosure of non-cash financing activities:\nWithholding taxes in connection with stock-based awards, accrued\n-\n-\nThe accompanying notes are an integral part of these consolidated financial statements.\nPTC Inc.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\n(in thousands)\nCommon Stock\nAdditional\nRetained Earnings\nAccumulated Other\nTotal\nShares\nAmount\nPaid-In\nCapital\n(Accumulated\nDeficit)\nComprehensive\nLoss\nStockholders’\nEquity\nBalance as of September 30, 2018\n117,981\n$\n1,180\n$\n1,558,403\n$\n(599,409\n)\n$\n(85,585\n)\n$\n874,589\nASU 2016-16 adoption\n-\n-\n-\n72,261\n-\n72,261\nASC 606 adoption\n-\n-\n-\n363,218\n-\n363,218\nCommon stock issued for employee stock-based awards\n1,495\n(15\n)\n-\n-\n-\nShares surrendered by employees to pay taxes related to stock-based awards\n(504\n)\n(5\n)\n(44,361\n)\n-\n-\n(44,366\n)\nCommon stock issued\n-\n-\n(140\n)\n-\n-\n(140\n)\nCommon stock issued for employee stock purchase plan\n17,612\n-\n-\n17,615\nCompensation expense from stock-based awards\n-\n-\n86,400\n-\n-\n86,400\nNet loss\n-\n-\n-\n(27,460\n)\n-\n(27,460\n)\nRepurchases of common stock\n(4,348\n)\n(44\n)\n(114,950\n)\n-\n-\n(114,994\n)\nUnrealized loss on cash flow hedges, net of tax\n-\n-\n-\n-\n(385\n)\n(385\n)\nUnrealized gain on net investment hedges, net of tax\n-\n-\n-\n-\n5,087\n5,087\nForeign currency translation adjustment\n-\n-\n-\n-\n(24,755\n)\n(24,755\n)\nUnrealized gain on available-for-sale securities, net of tax\n-\n-\n-\n-\nChange in pension benefits, net of tax\n-\n-\n-\n-\n(5,602\n)\n(5,602\n)\nBalance as of September 30, 2019\n114,899\n$\n1,149\n$\n1,502,949\n$\n(191,390\n)\n$\n(110,710\n)\n$\n1,201,998\nASU 2016-02 (ASC 842) adoption\n-\n-\n-\n(1,572\n)\n-\n(1,572\n)\nCommon stock issued for employee stock-based awards\n1,392\n(14\n)\n-\n-\n-\nShares surrendered by employees to pay taxes related to stock-based awards\n(455\n)\n(4\n)\n(33,736\n)\n-\n-\n(33,740\n)\nCommon stock issued for employee stock purchase plan\n18,380\n-\n-\n18,382\nCompensation expense from stock-based awards\n-\n-\n115,149\n-\n-\n115,149\nNet income\n-\n-\n-\n130,695\n-\n130,695\nUnrealized loss on net investment hedges, net of tax\n-\n-\n-\n-\n(13,242\n)\n(13,242\n)\nForeign currency translation adjustment\n-\n-\n-\n-\n22,076\n22,076\nUnrealized gain on available-for-sale securities, net of tax\n-\n-\n-\n-\nChange in pension benefits, net of tax\n-\n-\n-\n-\n(1,686\n)\n(1,686\n)\nBalance as of September 30, 2020\n116,125\n$\n1,161\n$\n1,602,728\n$\n(62,267\n)\n$\n(103,374\n)\n$\n1,438,248\nCommon stock issued for employee stock-based awards\n1,490\n(15\n)\n-\n-\n-\nShares surrendered by employees to pay taxes related to stock-based awards\n(466\n)\n(4\n)\n(53,073\n)\n-\n-\n(53,077\n)\nCommon stock issued for employee stock purchase plan\n21,573\n-\n-\n21,575\nCompensation expense from stock-based awards\n-\n-\n177,289\n-\n-\n177,289\nNet income\n-\n-\n-\n476,923\n-\n476,923\nRepurchases of common stock\n(226\n)\n(2\n)\n(29,998\n)\n-\n-\n(30,000\n)\nUnrealized gain on net investment hedges, net of tax\n-\n-\n-\n-\n1,248\n1,248\nForeign currency translation adjustment\n-\n-\n-\n-\n1,613\n1,613\nUnrealized loss on available-for-sale securities, net of tax\n-\n-\n-\n-\n(307\n)\n(307\n)\nChange in pension benefits, net of tax\n-\n-\n-\n-\n4,956\n4,956\nBalance as of September 30, 2021\n117,163\n$\n1,172\n$\n1,718,504\n$\n414,656\n$\n(95,864\n)\n$\n2,038,468\nThe accompanying notes are an integral part of these consolidated financial statements.\nPTC Inc\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1. Description of Business and Basis of Presentation\nBusiness\nPTC Inc. was incorporated in 1985 and is headquartered in Boston, Massachusetts. PTC is a global software and services company that delivers a technology platform and solutions to help companies design, manufacture, operate, and service things for a smart, connected world.\nRisks and Uncertainties - COVID-19 Pandemic\nIn December 2019, the COVID-19 coronavirus surfaced. The virus has spread worldwide, including in the United States, and has been declared a pandemic by the World Health Organization. The COVID-19 pandemic significantly impacted global economic activity and continues to cause macroeconomic uncertainty.\nWe assessed certain accounting matters that generally require consideration of forecasted financial information in context with the information reasonably available to us and the unknown future impacts of COVID-19 as of September 30, 2021, and through the date of this report. The accounting matters assessed included, but were not limited to, our allowance for doubtful accounts, stock-based compensation, the carrying value of our goodwill and other long-lived assets, financial assets, valuation allowances for tax assets and revenue recognition. While our assessment did not result in a material impact to our consolidated financial statements as of and for the year ended September 30, 2021, our future assessment could result in material impacts to our consolidated financial statements in future reporting periods.\nBasis of Presentation\nOur fiscal year-end is September 30. The consolidated financial statements include PTC Inc. (the parent company) and its wholly owned subsidiaries, including those operating outside the U.S. All intercompany balances and transactions have been eliminated in the consolidated financial statements.\nWe prepare our financial statements under generally accepted accounting principles in the U.S. that require management to make estimates and assumptions that affect the amounts reported and the related disclosures. Actual results could differ from these estimates.\n2. Summary of Significant Accounting Policies\nForeign Currency Translation\nFor our non-U.S. operations where the functional currency is the local currency, we translate assets and liabilities at exchange rates in effect at the balance sheet date and record translation adjustments in stockholders’ equity. For our non-U.S. operations where the U.S. dollar is the functional currency, we remeasure monetary assets and liabilities using exchange rates in effect at the balance sheet date and non-monetary assets and liabilities at historical rates and record resulting exchange gains or losses in foreign currency net losses in the Consolidated Statements of Operations. We translate income statement amounts at average rates for the period. Transaction gains and losses are recorded in other income, net in the Consolidated Statements of Operations.\nRevenue Recognition\nWe adopted ASC 606, Revenue from Contracts with Customers, effective October 1, 2018, using the modified retrospective method.\nNature of Products and Services\nOur sources of revenue include: (1) subscriptions, (2) perpetual licenses, (3) support for perpetual licenses and (4) professional services. Revenue is derived from the licensing of computer software products and from related support and/or professional services contracts. In accordance with ASC 606,\nrevenue is recognized when a customer obtains control of promised products or services. The amount of revenue recognized reflects the consideration that we expect to be entitled to receive in exchange for these products or services. To achieve the core principle of this standard, we apply the following five steps:\n(1)\nidentify the contract with the customer,\n(2)\nidentify the performance obligations in the contract,\n(3)\ndetermine the transaction price,\n(4)\nallocate the transaction price to performance obligations in the contract, and\n(5)\nrecognize revenue when or as we satisfy a performance obligation.\nWe enter into contracts that include combinations of licenses, support and professional services, which are accounted for as separate performance obligations with differing revenue recognition patterns referenced below.\nPerformance Obligation\nWhen Performance Obligation is Typically Satisfied\nTerm-based subscriptions\nOn-premises software licenses\nPoint in Time: Upon the later of when the software is made available or the subscription term commences\nSupport and cloud-based offerings\nOver Time: Ratably over the contractual term; commencing upon the later of when the software is made available or the subscription term commences\nPerpetual software licenses\nPoint in Time: when the software is made available\nSupport for perpetual software licenses\nOver Time: Ratably over the contractual term\nProfessional services\nOver time: As services are provided\nJudgments and Estimates\nOur contracts with customers for subscriptions typically include commitments to transfer term-based, on-premise software licenses bundled with support and/or cloud services. On-premise software is determined to be a distinct performance obligation from support which is sold for the same term of the subscription. For subscription arrangements which include cloud services and on-premise licenses, we assess whether the cloud component is highly interrelated with the on-premise term-based software licenses. Other than a limited population of subscriptions, the cloud component is not currently deemed to be interrelated with the on-premise term software and, as a result, cloud services are accounted for as a distinct performance obligation from the software and support components of the subscription.\nJudgment is required to allocate the transaction price to each performance obligation. We use the estimated standalone selling price method to allocate the transaction price for items that are not sold separately. The estimated standalone selling price is determined using all information reasonably available to us, including market conditions and other observable inputs. The corresponding revenues are recognized as the related performance obligations are satisfied. Where subscriptions include on-premise software and support only, we determined that 55% of the estimated standalone selling price for subscriptions is attributable to software licenses and 45% is attributable to support for those licenses. Some of our subscription offerings include a combination of on-premise and cloud-based technology. In such cases, the cloud-based technology is considered distinct and receives an allocation of 5% to 50% of the estimated standalone selling price of the subscription. The amounts allocated to cloud are based on assessment of the relative value of the cloud functionality in the subscription, with the remaining amounts allocated between software and support.\nOur multi-year, non-cancellable on-premise subscription contracts provide customers with an annual right to exchange software within the original subscription with other software. Although the exchange right is limited to software products within a similar product grouping, the exchange right is not limited to products with substantially similar features and functionality as those originally delivered. We determined that this right to exchange previously delivered software for different software represents variable consideration to be accounted for as a liability. We have identified a standard portfolio of contracts with common characteristics and applied the expected value method of determining variable consideration\nassociated with this right. Additionally, where there are isolated situations that are outside of the standard portfolio of contracts due to contract size, longer contract duration, or other unique contractual terms, we use the most likely amount method to determine the amount of variable consideration. In both circumstances, the variable consideration included in the transaction price is constrained to the extent it is probable that a significant reversal in the amount of cumulative revenue recognized will not occur when the uncertainty associated with the variable consideration is subsequently resolved. As of September 30, 2021 and 2020, the total refund liability was $40.3 million and $34.5 million, respectively, primarily associated with the annual right to exchange on-premise subscription software.\nPractical Expedients\nWe have elected certain practical expedients associated with our revenue recognition policy. We do not account for significant financing components if the period between revenue recognition and when the customer pays for the products or services is one year or less. Additionally, we recognize revenue equal to the amount we have a right to invoice when the amount corresponds directly with the value to the customer of our performance to date.\nCash Equivalents\nOur cash equivalents are invested in money market accounts and time deposits of financial institutions. We have established guidelines relative to credit ratings, diversification and maturities that are intended to maintain safety and liquidity. Cash equivalents include highly liquid investments with maturity periods of three months or less when purchased.\nMarketable Securities\nAs of September 30, 2020, our investment portfolio consisted of certificates of deposit, commercial paper, corporate notes/bonds and government securities that had a maximum maturity of three years. In December 2020, we sold all our marketable securities to partially fund the Arena acquisition, resulting in proceeds of $56.2 million. Neither gross realized gains nor gross realized losses related to the sale were material.\nEquity Securities\nOn July 22, 2021, a company in which we were a preferred equity investor, Matterport, Inc., completed a business combination with a public company. The carrying value of our investment, which was classified as a non-marketable equity investment, was approximately $8.7 million prior to the business combination. Our preferred shares were converted into common shares of Matterport. The Matterport shares are considered equity securities and are included in other current assets. Any change to fair value will be recorded to the Consolidated Statements of Operations.\nAfter the date of the business combination, for a period of six months, subject to certain exceptions, we are restricted from selling the Matterport shares pursuant to Rule 144 under the Securities Act (Rule 144) and Matterport’s bylaws.\nThe fair value of the Matterport shares as of September 30, 2021 was $77.5 million and was determined using the closing price of Matterport’s common stock on the Nasdaq stock market as of September 30, 2021, less a temporary discount for lack of marketability. We recorded an unrealized gain on the appreciation of the value of the shares in other income, net on the Consolidated Statement of Operations. The discount for lack of marketability, which will reverse once the applicable restrictions are lifted, is calculated using a put-option model which includes observable and unobservable inputs. The methods used to determine fair value of the Matterport shares may produce a value that may not be indicative of net realizable value or reflective of future fair values. Furthermore, while we believe our valuation methods are appropriate and consistent with other market participants, the use of different methodologies or assumptions to determine the fair value of certain financial instruments could result in a different fair value measurement at the reporting date.\nWe also have non-marketable equity investments that we account for at cost, less any impairment, plus or minus adjustments resulting from observable price changes in orderly transactions for identical or\nsimilar investments of the same issuer. We monitor non-marketable equity investments for events that could indicate that the investments are impaired, such as deterioration in the investee's financial condition and business forecasts and lower valuations in recent or proposed financings. Changes in fair value of non-marketable equity investments are recorded in other income, net on the Consolidated Statements of Operations. In the years ended September 30, 2021and 2019, we did not record any impairment charges to our investments. In the year ended September 30, 2020, we recorded $0.5 million of impairment charges related to one of our investments. The carrying value of our non-marketable equity investments is recorded in other assets on the Consolidated Balance Sheets and totaled $2.2 million and $8.9 million as of September 30, 2021 and 2020, respectively.\nConcentration of Credit Risk and Fair Value of Financial Instruments\nThe amounts reflected in the Consolidated Balance Sheets for cash and cash equivalents, accounts receivable and accounts payable approximate their fair value due to their short maturities. Financial instruments that potentially subject us to concentration of credit risk consist primarily of investments, trade accounts receivable and foreign currency derivative instruments. Our cash, cash equivalents, and foreign currency derivatives are placed with financial institutions with high credit standings. Our credit risk for derivatives is also mitigated due to the short-term nature of the contracts. Our customer base consists of many geographically diverse customers dispersed across many industries. No individual customer comprised more than 10% of our trade accounts receivable as of September 30, 2021 or 2020 or more than 10% of our revenue for the years ended September 30, 2021, 2020 or 2019.\nFair Value Measurements\nFair value is defined as the price that would be received from selling an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. When determining the fair value measurements for assets and liabilities required to be recorded at fair value, we consider the principal or most advantageous market in which we would transact and consider assumptions that market participants would use when pricing the asset or liability, such as inherent risk, transfer restrictions, and risk of nonperformance. Generally accepted accounting principles prescribe a fair value hierarchy that requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. A financial instrument’s categorization within the fair value hierarchy is based upon the lowest level of input that is significant to the fair value measurement. Three levels of inputs that may be used to measure fair value:\n•\nLevel 1: quoted prices (unadjusted) in active markets for identical assets or liabilities;\n•\nLevel 2: inputs other than Level 1 that are observable, either directly or indirectly, such as quoted prices in active markets for similar assets or liabilities, quoted prices for identical or similar assets or liabilities in markets that are not active, or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities; or\n•\nLevel 3: unobservable inputs that are supported by little or no market activity and that are significant to the fair value of the assets or liabilities.\nA financial instrument’s level within the fair value hierarchy is based on the lowest level of any input that is significant to the fair value measurement.\nAllowance for Doubtful Accounts\nWe maintain allowances for doubtful accounts for estimated losses resulting from the inability of our customers to make required payments. Effective October 1, 2020, we adopted ASC 326, Financial Instruments-Credit Losses, which replaces the incurred loss impairment model with an expected loss model that requires the use of forward-looking information to calculate credit loss estimates. In determining the adequacy of the allowance for doubtful accounts, management specifically analyzes individual accounts receivable, historical bad debts, customer concentrations, customer credit-worthiness, current economic conditions, and accounts receivable aging trends. Our allowance for doubtful accounts on trade accounts receivable was $0.3 million as of September 30, 2021, $0.5 million as of September 30, 2020, and $0.7 million as of September 30, 2019. Uncollectible trade accounts\nreceivable written-off, net of recoveries, were $0.1 million, $0.2 million and $0.2 million in 2021, 2020 and 2019, respectively. Bad debt recoveries were $0.2 million in 2021, and bad debt expense was $0.0 million and $0.3 million in 2020 and 2019, respectively, and is included in general and administrative expenses in the accompanying Consolidated Statements of Operations.\nDerivatives\nGenerally accepted accounting principles require all derivatives, whether designated in a hedging relationship or not, to be recorded on the balance sheet at fair value. Our earnings and cash flows are subject to fluctuations due to changes in foreign currency exchange rates. Our most significant foreign currency exposures relate to Western European countries, Japan, China and Canada. Our foreign currency risk management strategy is principally designed to mitigate the future potential financial impact of changes in the U.S. dollar value of anticipated transactions and balances denominated in foreign currencies resulting from changes in foreign currency exchange rates. We enter into derivative transactions, specifically foreign currency forward contracts, to manage the exposures to foreign currency exchange risk to reduce earnings volatility. We do not enter into derivatives transactions for trading or speculative purposes. For a description of our non-designated hedge and net investment hedge activity see Note 17. Derivative Financial Instruments.\nNon-Designated Hedges\nWe hedge our net foreign currency monetary assets and liabilities primarily resulting from foreign currency denominated receivables and payables with foreign exchange forward contracts to reduce the risk that our earnings and cash flows will be adversely affected by changes in foreign currency exchange rates. These contracts have maturities of up to approximately three months. Generally, we do not designate these foreign currency forward contracts as hedges for accounting purposes and changes in the fair value of these instruments are recognized immediately in earnings. Because we enter into forward contracts only as an economic hedge, any gain or loss on the underlying foreign-denominated balance would be offset by the loss or gain on the forward contract. Gains or losses on the underlying foreign-denominated balance are offset by the loss or gain on the forward contract and are included in other income, net.\nNet Investment Hedges\nWe translate balance sheet accounts of subsidiaries with foreign functional currencies into U.S. Dollars using the exchange rate at each balance sheet date. Resulting translation adjustments are reported as a component of accumulated other comprehensive loss on the Consolidated Balance Sheet. We designate certain foreign exchange forward contracts as net investment hedges against exposure on translation of balance sheet accounts of Euro functional subsidiaries. Net investment hedges partially offset the impact of foreign currency translation adjustment recorded in accumulated other comprehensive loss on the Consolidated Balance Sheet. All foreign exchange forward contracts are carried at fair value on the Consolidated Balance Sheet and the maximum duration of foreign exchange forward contracts is approximately three months.\nNet investment hedge relationships are designated at inception, and effectiveness is assessed retrospectively on a quarterly basis using the net equity position of Euro functional subsidiaries. As the forward contracts are highly effective in offsetting exchange rate exposure, we record changes in these net investment hedges in accumulated other comprehensive loss and subsequently reclassify them to foreign currency translation adjustment in accumulated other comprehensive loss at the time of forward contract maturity. Changes in the fair value of foreign exchange forward contracts due to changes in time value are excluded from the assessment of effectiveness. Our derivatives are not subject to any credit contingent features. We manage credit risk with counterparties by trading among several counterparties, and we review our counterparties’ credit at least quarterly.\nLeases\nWe adopted ASC 842 effective October 1, 2019 (the effective date). ASC 842 requires a modified retrospective transition method that could either be applied at the earliest comparative period in the financial statements or in the period of adoption. We elected to use the period of adoption (October 1, 2019) transition method and therefore did not recast prior periods.\nWe determine if an arrangement is a lease at inception. Operating leases are included in operating lease right-of-use assets and operating lease obligations on our Consolidated Balance Sheets. Our operating leases are primarily for office space, cars, servers, and office equipment. We made an election not to separate lease components from non-lease components for office space, servers and office equipment. We combine fixed payments for non-lease components with lease payments and account for them together as a single lease component which increases the amount of our lease assets and liabilities. Finance leases are included in property and equipment, accrued expenses and other current liabilities, and other liabilities on our Consolidated Balance Sheets.\nRight-of-use assets represent our right to use an underlying asset for the lease term and lease liabilities represent our obligation to make lease payments arising from the leases. Right-of-use assets and liabilities are recognized at the lease commencement date based on the present value of lease payments over the lease term. As most of our leases do not provide an implicit rate, we generally use our incremental borrowing rate based on the estimated rate of interest for collateralized borrowing over a similar term as that of the lease payments at the commencement date. The right-of-use assets include any lease payments made and exclude lease incentives received. Operating lease expense is recognized on a straight-line basis over the lease term.\nOur lease terms include periods under options to extend or terminate the lease when it is reasonably certain that we will exercise that option. We generally use the base non-cancellable lease term when determining the lease assets and liabilities.\nCertain lease agreements contain variable payments, which are expensed as incurred and not included in the lease assets and liabilities. These variable payments include insurance, taxes, consumer price index payments, and payments for maintenance and utilities.\nOur operating leases expire at various dates through 2037.\nProperty and Equipment\nProperty and equipment are recorded at cost and depreciated using the straight-line method over their estimated useful lives. Computer hardware and software are typically amortized over three to five years, and furniture and fixtures over three to twelve years. Leasehold improvements are amortized over the shorter of their useful lives or the remaining terms of the related leases. Property and equipment under capital leases are amortized over the lesser of the lease term or their estimated useful lives. Maintenance and repairs are charged to expense when incurred; additions and improvements are capitalized. When an item is sold or retired, the cost and related accumulated depreciation is relieved, and the resulting gain or loss, if any, is recognized in income.\nSoftware Development Costs\nWe incur costs to develop computer software to be licensed or otherwise marketed to customers. Our research and development expenses consist principally of salaries and benefits, costs of computer equipment, and facility expenses. Research and development costs are expensed as incurred, except for costs of internally developed or externally purchased software that qualify for capitalization. Development costs for software to be sold externally incurred subsequent to the establishment of technological feasibility, but prior to the general release of the product, are capitalized and, upon general release, are amortized using the greater of either the straight-line method over the expected life of the related products or based upon the pattern in which economic benefits related to such assets are realized. The straight-line method is used if it approximates the same amount of expense as that calculated using the ratio that current period gross product revenues bear to total anticipated gross product revenues. No development costs for software to be sold externally were capitalized in 2021, 2020 or 2019. We purchased software of $0.6 million and $11.1 million in 2021 and 2020, respectively.\nAdditionally, we acquired capitalized software through business combinations (for further detail, see Note 6. Acquisitions). These assets are included in acquired intangible assets in the accompanying Consolidated Balance Sheets.\nBusiness Combinations\nWe allocate the purchase price of acquisitions to the tangible and intangible assets acquired and liabilities assumed based on their estimated fair value. Goodwill is measured as the excess of the purchase price over the value of net identifiable assets acquired. While best estimates and assumptions are used to accurately value assets acquired and liabilities assumed at the acquisition date as well as contingent consideration, where applicable, our estimates are inherently uncertain and subject to refinement. Any adjustments to estimated fair value are recorded to goodwill, provided that we are within the measurement period (up to one year from the acquisition date) and that we continue to collect information to determine estimated fair value. Subsequent to the measurement period or our final determination of estimated fair value, whichever comes first, adjustments are recorded in the Consolidated Statements of Operations.\nGoodwill, Acquired Intangible Assets and Long-lived Assets\nGoodwill is the amount by which the purchase price in a business acquisition exceeds the fair value of net identifiable assets on the date of purchase.\nGoodwill is evaluated for impairment annually as of the end of the third quarter, or more frequently if events or changes in circumstances indicate that the asset might be impaired. Factors we consider important, on an overall company basis and segment basis, when applicable, that could trigger an impairment review include significant under-performance relative to historical or projected future operating results, significant changes in our use of the acquired assets or the strategy for our overall business, significant negative industry or economic trends, a significant decline in our stock price for a sustained period and a reduction of our market capitalization relative to net book value.\nOur annual goodwill impairment test is based on either a quantitative or qualitative assessment. A quantitative assessment compares the fair value of the reporting unit to its carrying value. If the reporting unit’s carrying value exceeds its fair value, we record an impairment loss equal to the difference between the carrying value of goodwill and its estimated fair value. We estimate the fair values of our reporting units using discounted cash flow valuation models. Those models require estimates of future revenues, profits, capital expenditures, working capital, terminal values based on revenue multiples, and discount rates for each reporting unit. We estimate these amounts by evaluating historical trends; current budgets and operating plans, including consideration of the impact of the COVID-19 pandemic on our future results; and industry data. A qualitative assessment is designed to determine whether we believe it is more likely than not that the fair values of our reporting units exceed their carrying values. Qualitative assessment includes a review of qualitative factors, including company-specific (financial performance and long-range plans), industry, and macroeconomic factors, and a consideration of the fair value of each reporting unit at the last valuation date.\nWe completed our annual goodwill impairment review as of June 30, 2021, based on a qualitative assessment. Our qualitative assessment included company-specific (e.g., financial performance and long-range plans), industry, and macroeconomic factors, as well as consideration of the fair value of each reporting unit relative to its carrying value at the last valuation date which was June 27, 2020. Based on our qualitative assessment, we believe it is more likely than not that the fair values of our reporting units exceed their carrying values and no further impairment testing is required. Through September 30, 2021, there were no events or changes in circumstances that indicated that the carrying values of goodwill or acquired intangible assets may not be recoverable.\nLong-lived assets primarily include property and equipment and acquired intangible assets with finite lives (including purchased software, customer lists and trademarks). Purchased software is amortized over periods up to 16 years, customer lists are amortized over periods up to 13 years and trademarks are amortized over periods up to 12 years. We review long-lived assets for impairment when events or changes in business circumstances indicate that the carrying amount of the assets may not be fully recoverable or that the useful lives of those assets are no longer appropriate. An impairment test is based on a comparison of the undiscounted cash flows to the recorded value of the asset or asset group. If\nimpairment is indicated, the asset is written down to its estimated fair value based on a discounted cash flow analysis.\nAdvertising Expenses\nAdvertising costs are expensed as incurred. Total advertising expenses incurred were $7.1 million, $3.8 million and $3.6 million in 2021, 2020 and 2019, respectively and are included in sales and marketing expenses in the accompanying Consolidated Statements of Operations.\nIncome Taxes\nOur income tax expense includes U.S. and international income taxes. Certain items of income and expense are not reported in tax returns and financial statements in the same year. The tax effects of these differences are reported as deferred tax assets and liabilities. Deferred tax assets are recognized for the estimated future tax effects of deductible temporary differences and tax operating loss and credit carryforwards. Changes in deferred tax assets and liabilities are recorded in the provision for income taxes. We assess the likelihood that our deferred tax assets will be recovered from future taxable income and, to the extent we believe that it is more likely than not that all or a portion of deferred tax assets will not be realized, we establish a valuation allowance. To the extent we establish a valuation allowance or increase this allowance in a period, we include an expense within the tax provision in the Consolidated Statements of Operations.\nComprehensive Income (Loss)\nComprehensive income (loss) consists of net income (loss) and other comprehensive income (loss), which includes foreign currency translation adjustments, changes in unrecognized actuarial gains and losses (net of tax) related to pension benefits, unrealized gains and losses on hedging instruments and unrealized gains and losses on marketable securities. We do not record tax provisions or benefits for the net changes in the foreign currency translation adjustment, as we intend to reinvest permanently undistributed earnings of our foreign subsidiaries. Accumulated other comprehensive loss is reported as a component of stockholders’ equity and, as of September 30, 2021, was comprised of the following: cumulative translation adjustment losses of $67.5 million, unrecognized actuarial losses related to pension benefits of $30.2 million ($21.5 million net of tax), and accumulated net losses from net investment hedges of $6.5 million ($6.5 million net of tax). As of September 30, 2020, accumulated other comprehensive loss was comprised of the following: cumulative translation adjustment losses of $69.1 million, unrecognized actuarial losses related to pension benefits of $37.2 million ($26.4 million net of tax), unrecognized gains on available-for-sale securities of $0.3 million($0.3 million net of tax), and accumulated net gains from net investment hedges of $8.2 million ($8.2 million net of tax).\nEarnings (Loss) per Share (EPS)\nBasic EPS is calculated by dividing net income by the weighted average number of shares outstanding during the period. Diluted EPS is calculated by dividing net income by the weighted average number of shares outstanding plus the dilutive effect, if any, of outstanding stock options, restricted shares and restricted stock units using the treasury stock method. The calculation of the dilutive effect of outstanding equity awards under the treasury stock method includes consideration of proceeds from the assumed exercise of stock options, unrecognized compensation expense and any tax benefits as additional proceeds. Anti-dilutive shares excluded from the calculations of diluted EPS were immaterial in the years ended September 30, 2021 and 2020. Due to the net loss generated in the year ended September 30, 2019, approximately 1.0 million restricted stock units were excluded from the computation of diluted EPS in that year as the effect would have been anti-dilutive.\nThe following table presents the calculation for both basic and diluted EPS:\n(in thousands, except per share data)\nYear ended September 30,\nNet income (loss)\n$\n476,923\n$\n130,695\n$\n(27,460\n)\nWeighted average shares outstanding\n116,836\n115,663\n117,724\nDilutive effect of employee stock options, restricted shares and restricted stock units\n1,531\n-\nDiluted weighted average shares outstanding\n118,367\n116,267\n117,724\nBasic earnings (loss) per share\n$\n4.08\n$\n1.13\n$\n(0.23\n)\nDiluted earnings (loss) per share\n$\n4.03\n$\n1.12\n$\n(0.23\n)\nStock-Based Compensation\nWe measure the compensation cost of employee services received in exchange for an award of equity based on the grant-date fair value of the award. That cost is recognized over the period during which an employee is required to provide service in exchange for the award. See Note 12. Equity Incentive Plan for a description of the types of equity awards granted, the compensation expense related to such awards and detail of such awards outstanding. See Note 8. Income Taxes for detail of the tax benefit related to stock-based compensation recognized in the Consolidated Statements of Operations.\nRecently Adopted Accounting Pronouncements\nIntangibles-Goodwill and Other-Internal-Use Software\nIn August 2018, the FASB issued Accounting Standards Update (ASU) 2018-15, Intangibles-Goodwill and Other-Internal-Use Software (Subtopic 350-40): Customer's Accounting for Implementation Costs Incurred in a Cloud Computing Arrangement That is a Service Contract, which aligns the requirements for capitalizing implementation costs in cloud computing arrangements with the requirements for capitalizing implementation costs incurred to develop or obtain internal-use software. We adopted the new standard prospectively effective October 1, 2020. As a result of the adoption, we are required to capitalize certain costs related to the implementation of cloud computing arrangements. Capitalized costs related to cloud computing arrangements, which are included in other assets on the Consolidated Balance Sheets, were $2.8 million as of September 30, 2021.\nFinancial Instruments-Credit Losses\nIn June 2016, the FASB issued ASU 2016-13, Financial Instruments-Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments (ASC 326), which, along with subsequent amendments, replaces the incurred loss impairment methodology in current U.S. GAAP with a methodology that reflects expected credit losses and requires consideration of a broader range of reasonable and supportable information when recording credit loss estimates. We adopted the new standard effective October 1, 2020, with no impact on our consolidated financial statements.\nPending Accounting Pronouncements\nReference Rate Reform\nIn March 2020, the FASB issued ASU 2020-04, Reference Rate Reform (Topic 848): Facilitation of the Effects of Reference Rate Reform on Financial Reporting. The ASU provides optional guidance for contract modifications and certain hedging relationships associated with the transition from reference rates that are expected to be discontinued. ASU 2020-04 is effective for all entities upon issuance through December 31, 2022. We are still evaluating the impact, but do not expect the standard to have a material impact on our consolidated financial statements.\nIncome Taxes\nIn December 2019, the FASB issued Accounting Standards Update ASU 2019-12, Income Taxes (Topic 740) on Simplifying the Accounting for Income Taxes. The decisions reflected in ASU 2019-12 update specific areas of ASC 740, Income Taxes, to reduce complexity while maintaining or improving the usefulness of the information provided to users of financial statements. The new standard will be effective\nfor us in the first quarter of 2022 ending December 31, 2021. We do not expect this accounting standard to have a material impact on our consolidated financial statements.\nBusiness Combinations\nIn October 2021, the FASB issued Accounting Standards Update ASU 2021-08, Business Combinations (Topic 805) on Accounting for Contract Assets and Contract Liabilities from Contracts with Customers. This ASU is intended to improve the accounting for acquired revenue contracts with customers in a business combination by addressing diversity in practice and inconsistency related to 1) recognition of an acquired contract liability, and 2) payment terms and their effect on subsequent revenue recognized by the acquirer. ASU 2021-08 will be effective for us in the first quarter of 2024, though early adoption of the standard is permitted. We are currently evaluating the impact the standard will have on our consolidated financial statements, but at this time we do not expect it to be material for prior acquisitions; the impact in future periods will depend on the contract assets and contract liabilities acquired in future business combinations.\n3. Revenue from Contracts with Customers\nContract Assets and Contract Liabilities\n(in thousands)\nSeptember 30,\nContract asset\n$\n12,934\n$\n11,984\nDeferred revenue\n$\n497,677\n$\n426,465\nAs of September 30, 2021, $8.2 million of our contract assets are expected to be transferred to receivables within the next 12 months and therefore are included in other current assets. The remainder is included in other long-term assets and expected to be transferred within the next 24 months. As of September 30, 2020, $6.9 million of our contract asset balance was included in other current assets and $5.0 million was included in other long-term assets.\nApproximately $6.6 million of the September 30, 2020 contract asset balance was transferred to receivables during the year ended September 30, 2021 as a result of the right to payment becoming unconditional. The majority of the contract asset balance relates to two large professional services contracts with invoicing terms based on performance milestones. The net increase in contract assets of $0.9 million includes an increase of approximately $7.5 million related to revenue recognized in the period, net of billings.\nDuring the year ended September 30, 2021, we recognized $402.5 million of revenue that was included in deferred revenue as of September 30, 2020 and there were additional deferrals of $458.2 million, primarily related to new billings. In addition, deferred revenue increased by $15.5 million (net of a $10.4 million fair value adjustment) as a result of the acquisition of Arena. For subscription contracts, we generally invoice customers annually. The balance of total short- and long-term receivables as of September 30, 2021 was $744.6 million, compared to $511.3 million as of September 30, 2020.\nCosts to Obtain or Fulfill a Contract\nWe recognize an asset for the incremental costs of obtaining a contract with a customer if the benefit of those costs is expected to be longer than one year. These deferred costs (primarily commissions) are amortized proportionately related to revenue over 5 years, which is generally longer than the term of the initial contract because of anticipated renewals as commissions for renewals are not commensurate with commissions related to our initial contracts. As of September 30, 2021 and September 30, 2020, deferred costs of $40.2 million and $33.9 million, respectively, were included in other current assets and $81.1 million and $72.9 million, respectively, were included in other assets (non-current). Amortization expense related to costs to obtain a contract with a customer was $46.7 million and $36.2 million in the years ended September 30, 2021 and 2020, respectively. There were no impairments of the contract cost asset in the years ended September 30, 2021 and 2020.\nRemaining Performance Obligations\nOur contracts with customers include amounts allocated to performance obligations that will be satisfied at a later date. As of September 30, 2021, the amounts include additional performance obligations of $497.7 million recorded in deferred revenue and $987.3 million that are not yet recorded in the consolidated balance sheets. We expect to recognize approximately 82% of the total $1,485.0 million over the next 24 months, with the remaining amount thereafter.\nDisaggregation of Revenue\n(in thousands)\nYear ended September 30,\nTotal recurring revenue\n$\n1,616,328\n$\n1,281,949\n$\n1,017,398\nPerpetual license\n33,013\n32,668\n70,702\nProfessional services\n157,818\n143,798\n167,531\nTotal revenue\n$\n1,807,159\n$\n1,458,415\n$\n1,255,631\nFor further disaggregation of revenue by geographic region and product group see Note 18. Segment and Geographic Information.\n4. Restructuring and Other Charges\nRestructuring and other charges, net includes restructuring charges (credits), headquarters relocation charges, and impairment and accretion expense charges related to the lease assets of exited facilities. Refer to Note 19. Leases for additional information about exited facilities.\nIn 2021, restructuring and other charges, net totaled $2.2 million, of which $2.1 million is attributable to restructuring charges and $0.1 million is attributable to impairment and accretion expense related to exited lease facilities. We made cash payments related to restructuring charges of $6.7 million ($3.9 million related to the 2020 restructuring and $2.8 million in rent payments for the restructured facilities).\nIn 2020, restructuring and other charges, net totaled $32.7 million, of which $26.4 million is attributable to restructuring charges, $5.6 million is attributable to impairment and accretion expense related to exited lease facilities, and $0.7 million is attributable to accelerated depreciation related to the planned exit of a facility. We made cash payments related to restructuring charges of $31.5 million ($27.3 million related to the 2020 restructuring, $3.9 million related to the 2019 restructuring, and $0.3 million related to a prior restructuring).\nIn 2019, restructuring and other charges, net totaled $51.1 million, of which $48.6 million was attributable to restructuring charges ($0.2 million of which related to prior facility restructuring actions) and $2.5 million was attributable to headquarters relocation charges. We made cash payments related to restructuring charges of $24.7 million ($23.6 million related to the 2019 restructuring and $1.1 million related to a prior restructuring).\nRestructuring Charges\nIn anticipation of a potential restructuring action, we incurred $1.7 million of professional fees in the fourth quarter of 2021. Refer to Note 20. Subsequent Events for additional information about this restructuring charge.\nDuring the first quarter of 2020, we initiated a restructuring program as part of a realignment associated with expected synergies and operational efficiencies related to the Onshape acquisition. In the year ended September 30, 2020, we incurred $30.8 million in connection with this restructuring plan for termination benefits associated with approximately 250 employees. In the year ended September 30, 2021, we recorded $0.2 million of charges related to this restructuring plan.\nDuring the first quarter of 2019, we initiated a restructuring plan to realign our workforce to shift investment to support Industrial Internet of Things and Augmented Reality strategic opportunities. The restructuring plan was completed in the first quarter of 2019 and resulted in restructuring charges of $16.3 million for termination benefits associated with approximately 240 employees, substantially all of which\nhas been paid. In the year ended September 30, 2020, we recorded $0.1 million of credits related to this restructuring plan.\nDuring the second quarter of 2019, we relocated our worldwide headquarters to the Boston Seaport District. We incurred a restructuring charge for the former headquarters lease, which expires in November 2022. As a result, we bear overlapping rent obligations for those premises and, in 2019, we recorded restructuring charges of approximately $32.7 million, based on the net present value of remaining lease commitments net of estimated sublease income. Other costs associated with the move were recorded as incurred. In 2020, we recorded a $4.3 million net credit for accrued variable operating restructuring charges, primarily associated with the exit of a portion of our former headquarters lease under a partial buy-out agreement with the landlord. In 2021, we recorded restructuring charges of $0.3 million, primarily associated with maintenance and operating expenses.\nThe following table summarizes restructuring accrual activity for the three years ended September 30, 2021:\n(in thousands)\nEmployee severance\nand related benefits\nFacility closures\nand other costs\nConsolidated total\nBalance, September 30, 2018\n$\n-\n$\n2,415\n$\n2,415\nCharges to operations, net\n15,704\n32,908\n48,612\nCash disbursements\n(15,402\n)\n(9,319\n)\n(24,721\n)\nOther non-cash charges\n-\n4,812\n4,812\nForeign exchange impact\n(4\n)\n(28\n)\n(32\n)\nBalance, September 30, 2019\n30,788\n31,086\nASC 842 adoption\n-\n(16,462\n)\n(16,462\n)\nCharges (credits) to operations, net\n30,690\n(4,263\n)\n26,427\nCash disbursements\n(27,256\n)\n(4,246\n)\n(31,502\n)\nOther non-cash\n-\nForeign exchange impact\nBalance, September 30, 2020\n3,992\n5,995\n9,987\nCharges to operations, net\n1,887\n2,136\nCash disbursements\n(3,925\n)\n(2,756\n)\n(6,681\n)\nForeign exchange impact\nBalance, September 30, 2021\n$\n1,981\n$\n3,505\n$\n5,486\nThe accrual for employee severance and related benefits is included in accrued compensation and benefits in the Consolidated Balance Sheets.\nUpon adoption of ASC 842, $16.5 million of accrued expenses and other current liabilities, representing the present value of lease commitments net of estimated sublease income, were reclassified to lease assets and obligations: $7.6 million to lease assets, $9.2 million to short-term lease obligations and $14.9 million to long-term lease obligations.\nAs of September 30, 2021, the remaining restructuring facility accrual of $3.5 million relates to variable non-lease costs not subject to ASC 842, of which $2.6 million is included in accrued expenses and other current liabilities and $0.9 million is included in other liabilities in the Consolidated Balance Sheets.\nOf the accrual for facility closures and related costs, as of September 30, 2020, $2.8 million is included in accrued expenses and other current liabilities and $3.2 million is included in other liabilities in the Consolidated Balance Sheets.\nOther - Headquarters Relocation Charges\nHeadquarters relocation charges represent other expenses associated with exiting our prior Needham headquarters facility and relocating to our worldwide headquarters in the Boston Seaport District. In 2019, we recorded $1.9 million of accelerated depreciation expense related to shortening the estimated useful lives of leasehold improvements related to the Needham location. Headquarters relocation charges for 2019 also included $0.6 million of rental expense for the Needham facility that overlapped with rental expense for the new Seaport headquarters.\n5. Property and Equipment\nProperty and equipment consisted of the following:\n(in thousands)\nSeptember 30,\nComputer hardware and software\n$\n352,704\n$\n330,392\nFurniture and fixtures\n30,568\n30,251\nLeasehold improvements\n94,959\n99,883\nGross property and equipment\n478,231\n460,526\nAccumulated depreciation and amortization\n(377,994\n)\n(359,027\n)\nNet property and equipment\n$\n100,237\n$\n101,499\nDepreciation expense was $26.1 million, $24.7 million and $26.7 million in 2021, 2020 and 2019, respectively.\n6. Acquisitions\nAcquisition-related costs were $15.0 million, $8.6 million and $3.1 million in 2021, 2020 and 2019, respectively. Acquisition-related costs include direct costs of potential and completed acquisitions (e.g., investment banker fees and professional fees, including legal and valuation services) and expenses related to acquisition integration activities (e.g., professional fees and severance). In addition, subsequent adjustments to our initial estimated amount of contingent consideration associated with specific acquisitions are included within acquisition-related charges. These costs are classified in general and administrative expenses in the accompanying Consolidated Statements of Operations.\nOur results of operations include the results of acquired businesses beginning on their respective acquisition date. For all acquisitions made in 2021, our results of operations, if presented on a pro forma basis, would not differ materially from our reported results.\nArena\nOn January 15, 2021, we acquired Arena Holdings, Inc. (“Arena”) pursuant to an Agreement and Plan of Merger dated as of December 12, 2020 by and among PTC, Arena, Astronauts Merger Sub, Inc., and the Representative named therein, the material terms of which are described in the Form 8-K filed by PTC on December 14, 2020 and which is filed as Exhibit 1.1 to that Form 8-K. PTC paid approximately $715 million, net of cash acquired of $11.1 million, for Arena, which amount was financed with cash on hand and $600 million borrowed under our existing credit facility. Arena had approximately 170 employees on the close date. The acquisition of Arena added revenue of approximately $29.8 million in 2021, which is net of approximately $9.1 million in fair value adjustments related to purchase accounting for the acquisition.\nThe acquisition of Arena has been accounted for as a business combination. Assets acquired and liabilities assumed have been recorded at their estimated fair values as of the acquisition date. The fair values of intangible assets were based on valuations using a discounted cash flow model which requires the use of significant estimates and assumptions, including estimating future revenues and costs. The excess of the purchase price over the tangible assets, identifiable intangible assets and assumed liabilities was recorded as goodwill.\nThe purchase price allocation resulted in $562.8 million of goodwill, $155.0 million of customer relationships, $38.3 million of purchased software, $4.2 million of trademarks, $41.3 million of deferred tax liabilities, $15.5 million of deferred revenue, $11.4 million of accounts receivable, and $0.4 million of other net liabilities. The acquired customer relationships, purchased software, and trademarks are being amortized over useful lives of 13 years, 9 years, and 12 years, respectively, based on the expected economic benefit pattern of the assets. The acquired goodwill was allocated to our software products segment and will not be deductible for income tax purposes. The resulting amount of goodwill reflects the expected value that will be created by participation in expected future growth of the PLM SaaS market and expansion into the mid-market for PLM, where SaaS solutions are becoming the standard.\nOnshape\nOn November 1, 2019, we acquired Onshape Inc. pursuant to an Agreement and Plan of Merger dated as of October 23, 2019 by and among PTC, Onshape Inc., OPAL Acquisition Corporation and the Stockholder Representative named therein, the material terms of which are described in the Form 8-K filed by PTC on October 23, 2019 and which is filed as Exhibit 1.1 to that Form 8-K. PTC paid approximately $469 million, net of cash acquired of $7.5 million, for Onshape, which amount we borrowed under our existing credit facility. The acquisition of Onshape did not add material revenue in 2020.\nThe acquisition of Onshape has been accounted for as a business combination. Assets acquired and liabilities assumed have been recorded at their estimated fair values as of the acquisition date. The fair values of intangible assets were based on valuations using a discounted cash flow model which requires the use of significant judgment and assumptions, including estimating future revenues and costs. The excess of the purchase price over the tangible assets, identifiable intangible assets and assumed liabilities was recorded as goodwill.\nThe purchase price allocation resulted in $364.9 million of goodwill, $56.8 million of customer relationships, $47.3 million of purchased software, $3.6 million of trademarks and $4.1 million of other net liabilities. The acquired customer relationships, purchased software, and trademarks are being amortized over useful lives of 10 years, 16 years, and 15 years, respectively, based on the expected benefit pattern of the assets. The acquired goodwill was allocated to our software products segment and will not be deductible for income tax purposes. The resulting amount of goodwill reflects the expected value that will be created by the expected acceleration of CAD and PLM growth, especially in the low end of the market, and participation in expected future growth of the CAD and PLM SaaS market. In addition, over the longer term, we anticipate building products based on the Onshape SaaS technology platform.\nFrustum\nOn November 19, 2018, we acquired Frustum Inc. for $69.5 million (net of cash acquired of $0.7 million). We financed the acquisition with borrowings under our credit facility. Frustum engaged in next-generation computer-aided design, including generative design, an approach that leverages artificial intelligence to generate design options. At the time of the acquisition, Frustum had approximately 12 employees and historical annualized revenues were not material. The acquisition of Frustum did not add material revenue in 2019.\nThe acquisition of Frustum has been accounted for as a business combination. Assets acquired and liabilities assumed have been recorded at their estimated fair values as of the acquisition date. The fair values of intangible assets were based on valuations using a discounted cash flow model which requires the use of significant estimates and assumptions, including estimating future revenues and costs. The excess of the purchase price over the tangible assets, identifiable intangible assets and assumed liabilities was recorded as goodwill.\nThe purchase price allocation resulted in $53.7 million of goodwill, $17.9 million of purchased software and $2.1 million of other net liabilities. The acquired technology is being amortized over a useful life of 15 years based on the expected benefit pattern of the assets. The acquired goodwill was allocated to our software products segment and will not be deductible for income tax purposes. The resulting amount of goodwill reflects the expected value that will be created by integrating Frustum generative design technology into our CAD solutions.\nOther Acquisitions\nIn the fourth quarter of 2020, we completed an acquisition for $15.0 million (net of cash acquired of $0.1 million). At the time of acquisition, the company had approximately 20 employees and historical annualized revenues were not material. This acquisition did not add material revenue in 2020.\nThe acquisition was accounted for as a business combination. Assets acquired and liabilities assumed have been recorded at their estimated fair values as of the acquisition dates. The fair values of intangible assets were based on valuations using a discounted cash flow model which requires the use of significant estimates and assumptions, including estimating future revenues and costs. The excess of the purchase\nprice over the tangible assets, identifiable intangible assets and assumed liabilities was recorded as goodwill.\nThe purchase price allocation resulted in $12.3 million of goodwill, $3.4 million of purchased software, $0.7 of customer relationships and $1.4 million of other net liabilities. The purchased software and customer relationships are being amortized over useful lives of 7 years and 10 years, respectively, based on the expected benefit pattern of the assets. The acquired goodwill was allocated to our software segment and will not be deductible for income tax purposes.\n7. Goodwill and Acquired Intangible Assets\nWe have two operating and reportable segments: (1) Software Products and (2) Professional Services. We assess goodwill for impairment at the reporting unit level. Our reporting units are determined based on the components of our operating segments that constitute a business for which discrete financial information is available and for which operating results are regularly reviewed by segment management. Our reporting units are the same as our operating segments.\nAs of September 30, 2021, goodwill and acquired intangible assets in the aggregate attributable to our Software Products segment was $2,525.7 million and attributable to our Professional Services segment was $45.2 million. As of September 30, 2020, goodwill and acquired intangible assets in the aggregate attributable to our Software Products segment was $1,818.1 million and attributable to our Professional Services segment was $45.3 million.\nGoodwill and acquired intangible assets consisted of the following:\n(in thousands)\nSeptember 30, 2021\nSeptember 30, 2020\nGross\nCarrying\nAmount\nAccumulated\nAmortization\nNet Book\nValue\nGross\nCarrying\nAmount\nAccumulated\nAmortization\nNet Book\nValue\nGoodwill (not amortized)\n$\n2,191,887\n$\n1,625,786\nIntangible assets with finite lives (amortized)(1):\nPurchased software\n$\n483,771\n$\n338,542\n$\n145,229\n$\n443,275\n$\n309,124\n$\n134,151\nCapitalized software\n22,877\n22,877\n-\n22,877\n22,877\n-\nCustomer lists and relationships\n574,516\n350,648\n223,868\n418,953\n322,092\n96,861\nTrademarks and trade names\n26,906\n17,036\n9,870\n22,687\n16,129\n6,558\nOther\n4,000\n4,000\n-\n4,017\n4,017\n-\n$\n1,112,070\n$\n733,103\n$\n378,967\n$\n911,809\n$\n674,239\n$\n237,570\nTotal goodwill and acquired intangible assets\n$\n2,570,854\n$\n1,863,356\n(1)\nThe weighted-average useful lives of purchased software, customer lists and relationships, and trademarks and trade names with a remaining net book value are 10 years, 11 years, and 12 years, respectively.\nThe changes in the carrying amounts of goodwill from September 30, 2020 to September 30, 2021 are due to the impact of acquisitions and to foreign currency translation adjustments related to those asset balances that are recorded in non-U.S. currencies.\nChanges in goodwill presented by reportable segment were as follows:\n(in thousands)\nSoftware\nProducts\nProfessional\nServices\nTotal\nBalance, September 30, 2019\n$\n1,196,064\n$\n42,115\n$\n1,238,179\nOnshape Acquisition\n364,910\n-\n364,910\nOther acquisitions\n12,262\n-\n12,262\nForeign currency translation adjustments\n10,080\n10,435\nBalance, September 30, 2020\n$\n1,583,316\n$\n42,470\n$\n1,625,786\nArena acquisition\n563,620\n-\n563,620\nOther acquisitions\nForeign currency translation adjustments\n1,851\n1,900\nBalance, September 30, 2021\n$\n2,148,968\n$\n42,919\n$\n2,191,887\nThe aggregate amortization expense for intangible assets with finite lives recorded for the years ended September 30, 2021, 2020 and 2019 was reflected in our Consolidated Statements of Operations as follows:\n(in thousands)\nYear ended September 30,\nAmortization of acquired intangible assets\n$\n29,396\n$\n28,713\n$\n23,841\nCost of software revenue\n29,769\n27,391\n27,307\nTotal amortization expense\n$\n59,165\n$\n56,104\n$\n51,148\nThe estimated aggregate future amortization expense for intangible assets with finite lives remaining as of September 30, 2021 is $57.9 million for 2022, $49.5 million for 2023, $40.8 million for 2024, $34.6 million for 2025, $31.0 million for 2026 and $165.2 million thereafter.\n8. Income Taxes\nOur income (loss) before income taxes consisted of the following:\n(in thousands)\nYear ended September 30,\nDomestic\n$\n41,199\n$\n(73,865\n)\n$\n(112,077\n)\nForeign\n350,556\n208,571\n132,377\nTotal income before income taxes\n$\n391,755\n$\n134,706\n$\n20,300\nOur provision (benefit) for income taxes consisted of the following:\n(in thousands)\nYear ended September 30,\nCurrent:\nFederal\n$\n4,774\n$\n2,187\n$\n13,130\nState\n1,609\n1,266\n(945\n)\nForeign\n66,554\n25,199\n33,867\n72,937\n28,652\n46,052\nDeferred:\nFederal\n(152,311\n)\n(26,811\n)\n22,911\nState\n(27,228\n)\n(4,063\n)\n1,759\nForeign\n21,434\n6,233\n(22,962\n)\n(158,105\n)\n(24,641\n)\n1,708\nTotal provision (benefit) for income taxes\n$\n(85,168\n)\n$\n4,011\n$\n47,760\nTaxes computed at the statutory federal income tax rates are reconciled to the provision (benefit) for income taxes as follows:\n(in thousands)\nYear ended September 30,\nStatutory federal income tax rate\n$\n82,268\n%\n$\n28,288\n%\n$\n4,263\n%\nChange in valuation allowance\n(134,695\n)\n(34\n)%\n(16,489\n)\n(12\n)%\n66,417\n%\nState income taxes, net of federal tax benefit\n(28,768\n)\n(8\n)%\n(2,998\n)\n(2\n)%\n%\nFederal research and development credits\n(5,764\n)\n(2\n)%\n(5,483\n)\n(4\n)%\n(3,731\n)\n(18\n)%\nUncertain tax positions\n3,398\n%\n3,072\n%\n2,611\n%\nForeign tax credit\n(35,368\n)\n(9\n)%\n-\n-\n-\n-\nForeign rate differences\n(34,584\n)\n(9\n)%\n$\n(22,074\n)\n(16\n)%\n$\n(26,952\n)\n(133\n)%\nForeign tax on U.S. provision\n5,931\n%\n4,523\n%\n6,547\n%\nExcess tax benefits from restricted stock\n(6,141\n)\n(2\n)%\n(1,743\n)\n(1\n)%\n(5,940\n)\n(29\n)%\nAudits and settlements\n33,370\n%\n-\n-\n-\nU.S. permanent items\n18,389\n%\n6,590\n%\n2,483\n%\nBEAT\n2,936\n%\n(1,759\n)\n(1\n)%\n1,759\n%\nGILTI, net of foreign tax credits\n18,217\n%\n14,899\n%\n6,170\n%\nForeign-Derived Intangible Income (FDII)\n(4,428\n)\n(1\n)%\n(2,461\n)\n(2\n)%\n(6,409\n)\n(32\n)%\nOther, net\n-\n(354\n)\n(1\n)%\n(116\n)\n(1\n)%\nProvision (benefit) for income taxes\n$\n(85,168\n)\n(22\n)%\n$\n4,011\n%\n$\n47,760\n%\nIn 2021, 2020, and 2019, our tax rate differed from the U.S. statutory federal income tax rate due to our corporate structure in which our foreign taxes are at a net effective tax rate lower than the U.S. rate. A significant amount of our foreign earnings is generated by our subsidiaries organized in Ireland and the Cayman Islands. In 2021, 2020, and 2019, the foreign rate differential predominantly relates to these earnings.\nIn 2021, in addition to the foreign rate differential, our tax rate differed from the U.S. statutory federal income tax rate due to the release of the valuation allowance on the majority of our U.S. net deferred tax assets, the net effects of the Global Intangible Low-Taxed Income (GILTI) and Foreign Derived Intangible Income (FDII) regimes (together referred to as U.S. Tax reform), and the excess tax benefit related to stock-based compensation.\nIn 2020, in addition to the foreign rate differential, our tax rate differed from the statutory federal income tax rate due to U.S. tax reform, the excess tax benefit related to stock-based compensation and the indirect effects of the adoption of ASC 606. Additionally, we recorded benefits for the reduction of the U.S. valuation allowance as a result of the Onshape acquisition. A further reduction to the valuation allowance was also recorded to reflect the impact from the scheduling of the reversal of existing temporary differences resulting in deferred tax liabilities that cannot be offset against deferred tax assets.\nIn 2019, our effective tax rate was higher than the statutory federal income tax rate due in large part to the scheduling of the reversal of existing temporary differences resulting in deferred tax liabilities that cannot be offset against deferred tax assets requiring an increase to the U.S. valuation allowance, U.S. tax reform and foreign withholding taxes, an obligation of the U.S. parent. This is offset by foreign rate differences, the excess tax benefit related to stock-based compensation and the indirect effects of the adoption of ASC 606.\nAt September 30, 2021 and 2020, income taxes payable and income tax accruals recorded on the accompanying Consolidated Balance Sheets were $15.7 million ($5.0 million in accrued income taxes, $0.8 million in other current liabilities and $9.9 million in other liabilities) and $15.4 million ($7.0 million in accrued income taxes, $1.0 million in other current liabilities and $7.4 million in other liabilities), respectively. At September 30, 2021and 2020, prepaid taxes recorded in prepaid expenses on the accompanying Consolidated Balance Sheets were $15.4 million and $17.3 million, respectively. We made net income tax payments of $56.0 million, $52.6 million and $38.9 million in 2021, 2020 and 2019, respectively.\nThe significant temporary differences that created deferred tax assets and liabilities are shown below:\n(in thousands)\nSeptember 30,\nDeferred tax assets:\nNet operating loss carryforwards\n$\n65,383\n$\n61,495\nForeign tax credits\n36,287\n8,074\nCapitalized research and development\n27,546\n30,109\nPension benefits\n14,097\n14,370\nPrepaid expenses\n12,540\n13,579\nDeferred revenue\n2,274\n6,021\nStock-based compensation\n15,822\n13,630\nOther reserves not currently deductible\n16,796\n15,130\nAmortization of intangible assets\n147,385\n162,426\nResearch and development and other tax credits\n74,846\n70,695\nLease liabilities\n51,471\n52,224\nFixed assets\n53,025\n47,457\nCapital loss carryforward\n35,156\n35,851\nOther\n2,269\n1,849\nGross deferred tax assets\n554,897\n532,910\nValuation allowance\n(52,085\n)\n(205,423\n)\nTotal deferred tax assets\n502,812\n327,487\nDeferred tax liabilities:\nAcquired intangible assets not deductible\n(108,746\n)\n(65,894\n)\nLease assets\n(37,273\n)\n(35,885\n)\nPension prepayments\n(2,834\n)\n(1,155\n)\nDeferred revenue\n(2,662\n)\n(594\n)\nDepreciation\n(7,121\n)\n(7,481\n)\nUnbilled accounts receivable\n(6,391\n)\n(12,699\n)\nDeferred income\n(21,744\n)\n(5,821\n)\nPrepaid commissions\n(16,990\n)\n(17,124\n)\nOther\n(5,427\n)\n(2,302\n)\nTotal deferred tax liabilities\n(209,188\n)\n(148,955\n)\nNet deferred tax assets\n$\n293,624\n$\n178,532\nWe reassess our valuation allowance requirements each financial reporting period. We assess available positive and negative evidence to estimate whether sufficient future taxable income will be generated to use its existing deferred tax assets. In the assessment for the period ended September 30, 2021, we have concluded it is more likely than not that our deferred tax assets related to United States federal and state income will be realizable, and therefore, the United States federal and the majority of the state valuation allowances were released, which resulted in non-cash federal and state tax benefits of $109.4 million and $24.8 million, respectively, to earnings in this period. That determination was based, in part, on the Company’s cumulative profits before tax and permanent differences from the past three years, which became profitable during 2021, and projections of profits before tax and permanent differences in future years.\nFor U.S. tax return purposes, net operating loss (NOL) carryforwards and tax credits are generally available to be carried forward to future years, subject to certain limitations. At September 30, 2021, we had U.S. federal NOL carryforwards from acquisitions of $190.3 million, of which $32.5 million expire in 2023 to 2036. The remaining carryforwards of $157.8 million do not expire. The utilization of these NOL carryforwards is limited as a result of the change in ownership rules under Internal Revenue Code Section 382.\nAs of September 30, 2021, we had Federal R&D credit carryforwards of $54.1 million, which expire beginning in 2027 and ending in 2041, and Massachusetts R&D credit carryforwards of $24.2 million, which expire beginning in 2022 and ending in 2036. We also had foreign tax credits of $36.3 million, which expire beginning in 2025 and ending in 2031.\nWe also have NOL carryforwards in non-U.S. jurisdictions totaling $49.8 million, the majority of which do not expire, and non-U.S. tax credit carryforwards of $4.7 million that expire beginning in 2030 and ending in 2040. Additionally, we have amortization carryforwards of $1,084.6 million in a foreign\njurisdiction. There are limitations imposed on the utilization of such attributes that could restrict the recognition of any tax benefits.\nAs of September 30, 2021, we have a valuation allowance of $17.7 million against net deferred tax assets in the U.S. and a valuation allowance of $34.4 million against net deferred tax assets in certain foreign jurisdictions. The $17.7 million U.S. valuation allowance relates to Massachusetts tax credit carryforwards which we do not expect to realize a benefit from prior to expiration. The valuation allowance recorded against net deferred tax assets of certain foreign jurisdictions is established primarily for our capital loss carryforwards, the majority of which do not expire. However, there are limitations imposed on the utilization of such capital losses that could restrict the recognition of any tax benefits.\nThe changes to the valuation allowance were primarily due to the following:\n(in thousands)\nYear ended September 30,\nValuation allowance, beginning of year\n$\n205,423\n$\n177,663\n$\n141,950\nNet release of valuation allowance(1)\n(134,235\n)\n-\n(1,772\n)\nNet increase (decrease) in deferred tax assets with a full valuation allowance(2)\n(19,103\n)\n27,760\n37,485\nValuation allowance, end of year\n$\n52,085\n$\n205,423\n$\n177,663\n(1)\nIn 2021, this is attributable to the release in the U.S and in 2019, this is attributable to the release in foreign jurisdictions.\n(2)\nIn 2021, this change includes the loss of state attributes a upon merger of two wholly-owned subsidiaries. In 2020, this change is largely attributed to the Onshape acquisition, the adoption of ASC 842 and the impact to the change in scheduling of the reversal of existing temporary differences. In 2019, this is due in large part to a change in method of accounting for federal income tax purposes resulting in deferred tax liabilities that cannot be offset against available tax attributes in the scheduling of the reversal of existing temporary differences, and by the adoption of ASC 606.\nOur policy is to record estimated interest and penalties related to the underpayment of income taxes as a component of our income tax provision. In 2021, 2020 and 2019 we recorded interest expense of $2.2 million, $0.3 million and $0.1 million, respectively. In 2021, we had penalty expenses of $2.0 million. In 2020 and 2019 we had no tax penalty expense in our income tax provision. As of September 30, 2021 and 2020, we had accrued $0.7 million and $0.6 million of net estimated interest expense related to income tax accruals, respectively. We had no accrued tax penalties as of September 30, 2021, 2020 or 2019.\nYear ended September 30,\nUnrecognized tax benefits (in thousands)\nUnrecognized tax benefit, beginning of year\n$\n16,107\n$\n11,484\n$\n9,812\nTax positions related to current year:\nAdditions\n4,844\n2,173\n1,466\nTax positions related to prior years:\nAdditions\n30,130\n2,452\n1,375\nReductions\n(478\n)\n(2\n)\n(9\n)\nSettlements\n(29,437\n)\n-\n(1,160\n)\nUnrecognized tax benefit, end of year\n$\n21,166\n$\n16,107\n$\n11,484\nIf all of our unrecognized tax benefits as of September 30, 2021 were to become recognizable in the future, we would record a benefit to the income tax provision of $21.2 million (which would be partially offset by an increase in the U.S. valuation allowance of $4.5 million). Although we believe our tax estimates are appropriate, the final determination of tax audits and any related litigation could result in favorable or unfavorable changes in our estimates. We believe it is reasonably possible that within the next 12 months the amount of unrecognized tax benefits related to the resolution of multi-jurisdictional tax positions could be reduced by up to $1 million as audits close and statutes of limitations expire.\nOur results for the year ended September 30, 2021 include a charge of $37.3 million related to the effects of a tax matter in the Republic of Korea (South Korea) of $34.4 million, and the resulting impact on U.S. income taxes of $2.9 million. The charge relates to an assessment with respect to various tax issues, primarily foreign withholding taxes, that was under appeal in South Korea. We received an assessment of approximately $12 million from the tax authorities in South Korea in the fourth quarter of 2016 for the years 2011 to 2015 and paid the assessment in the first quarter of 2017. We appealed that assessment to an intermediate appellate court. In December 2020, our appeal to that court - the Seoul High Court - was rejected. We appealed this decision to the Supreme Court of the Republic of Korea. In May 2021, the Supreme Court denied our request for a review of the case. Therefore, the decision of the Seoul High Court was deemed final. We made additional payments of approximately $20 million to the tax authorities in South Korea in FY’21 for the years 2016 to 2021 in settlement of the amounts previously accrued.\nIn the normal course of business, PTC and its subsidiaries are examined by various taxing authorities, including the IRS in the U.S. We regularly assess the likelihood of additional assessments by tax authorities and provide for these matters as appropriate. We are currently under audit by tax authorities in several jurisdictions. Audits by tax authorities typically involve examination of the deductibility of certain permanent items, transfer pricing, limitations on net operating losses and tax credits. Although we believe our tax estimates are appropriate, the final determination of tax audits and any related litigation could result in material changes in our estimates. As of September 30, 2021, we remained subject to examination in the following major tax jurisdictions for the tax years indicated:\nMajor Tax Jurisdiction\nOpen Years\nUnited States\n2017 through 2021\nGermany\n2015 through 2021\nFrance\n2018 through 2021\nJapan\n2016 through 2021\nIreland\n2017 through 2021\nAdditionally, net operating loss and tax credit carryforwards from certain earlier periods in these jurisdictions may be subject to examination to the extent they are utilized in later periods.\nWe incurred expenses related to stock-based compensation in 2021, 2020 and 2019 of $177.3 million, $115.1 million and $86.4 million, respectively. Accounting for the tax effects of stock-based awards requires that we establish a deferred tax asset as the compensation is recognized for financial reporting prior to recognizing the tax deductions. The tax benefit recognized in the Consolidated Statements of Operations related to stock-based compensation totaled $39.9 million, $13.4 million and $16.6 million in 2021, 2020 and 2019, respectively. Upon the settlement of the stock-based awards (i.e., vesting), the actual tax deduction is compared with the cumulative financial reporting compensation cost and any excess tax deduction is considered a windfall tax benefit and is recorded to the tax provision. In 2021, 2020 and 2019, windfall tax benefits of $9.9 million, $1.3 million and $6.7 million were recorded to the tax provision. Prior to the adoption of ASU 2016-09, windfall tax benefits were recorded to APIC when they resulted in a reduction in taxes payable.\nPrior to the passage of the U.S. Tax Cuts and Jobs Act in December of 2017 (the Tax Act), we asserted that substantially all of the undistributed earnings of our foreign subsidiaries were considered indefinitely reinvested and accordingly, no deferred taxes were provided. Pursuant to the provisions of the U.S. Tax Act, these earnings were subjected to U.S. federal taxation via a one-time transition tax, and there is therefore no longer a material cumulative basis difference associated with the undistributed earnings. We maintain our assertion of our intention to permanently reinvest these earnings outside the U.S. unless repatriation can be done substantially tax-free, with the exception of a foreign holding company formed in 2018 and our Taiwan subsidiary. If we decide to repatriate any additional non-U.S. earnings in the future, we may be required to establish a deferred tax liability on such earnings. The amount of unrecognized deferred tax liability on the undistributed earnings would not be material.\n9. Debt\nAs of September 30, 2021 and 2020, we had the following long-term borrowing obligations:\n(in thousands)\nSeptember 30,\n4.000% Senior notes due 2028\n$\n500,000\n$\n500,000\n3.625% Senior notes due 2025\n500,000\n500,000\nCredit facility revolver(1)\n450,000\n18,000\nTotal debt\n1,450,000\n1,018,000\nUnamortized debt issuance costs for the senior notes(2)\n(10,529\n)\n(12,686\n)\nTotal debt, net of issuance costs(3)\n$\n1,439,471\n$\n1,005,314\n(1)\nUnamortized debt issuance costs related to the credit facility were $3.8 million and $4.9 million as of September 30, 2021 and 2020, respectively, and were included in other assets on the Consolidated Balance Sheets.\n(2)\nOf the $14.1 million in financing costs incurred in connection with the issuance of the 2028 and 2025 notes, unamortized debt issuance costs were $10.5 million and $12.7 million as of September 30, 2021 and 2020, respectively, and were included in long-term debt on the Consolidated Balance Sheet.\n(3)\nAs of September 30, 2021, and 2020, all debt was classified as long term.\nSenior Unsecured Notes\nIn February 2020, we issued $500 million in aggregate principal amount of 4.0% senior, unsecured long-term debt at par value, due in 2028 (the 2028 notes) and $500 million in aggregate principal amount of 3.625% senior, unsecured long-term debt at par value, due in 2025 (the 2025 notes).\nAs of September 30, 2021, the total estimated fair value of the 2028 and 2025 senior notes was approximately $513.7 million and $508.6 million respectively, based on quoted prices for the notes on that date.\nWe were in compliance with all the covenants for all of our senior notes as of September 30, 2021.\nTerms of the 2028 and 2025 Notes\nInterest on the 2028 and 2025 notes is payable semi-annually on February 15 and August 15. The debt indenture for the 2028 and 2025 notes includes covenants that limit our ability to, among other things, incur additional debt, grant liens on our properties or capital stock, enter into sale and leaseback transactions or asset sales, and make capital distributions.\nWe may, on one or more occasions, redeem the 2025 and 2028 notes in whole or in part at specified redemption prices. In certain circumstances constituting a change of control, we would be required to make an offer to repurchase the notes at a purchase price equal to 101% of the aggregate principal amount of the notes, plus accrued and unpaid interest. Our ability to repurchase the notes upon such event may be limited by law, by the indenture associated with the notes, by our then-available financial resources or by the terms of other agreements to which we may be party at such time. If we fail to repurchase the notes as required by the indenture, it would constitute an event of default under the indenture which, in turn, may also constitute an event of default under other obligations.\nCredit Agreement\nIn February 2020, we entered into a Third Amended and Restated Credit Agreement with JPMorgan Chase Bank, N.A., as Administrative Agent, for a new secured multi-currency bank credit facility with a syndicate of banks. We expect to use the credit facility for general corporate purposes, including acquisitions of businesses, share repurchases and working capital requirements.\nThe credit facility consists of a $1 billion revolving credit facility, which may be increased by up to an additional $500 million in the aggregate if the existing or additional lenders are willing to make such increased commitments. As of September 30, 2021, unused commitments under our credit facility were approximately $550.0 million. The maturity date of the credit facility is February 13, 2025, when all remaining amounts outstanding will be due and payable. The revolving loan commitment does not require amortization of principal and may be repaid in whole or in part prior to the scheduled maturity\ndate at our option without penalty or premium. As of September 30, 2021, the fair value of our credit facility approximates its book value.\nPTC and certain eligible foreign subsidiaries are eligible borrowers under the credit facility. Any borrowings by PTC Inc. under the credit facility would be guaranteed by PTC Inc.’s material domestic subsidiaries that become parties to the subsidiary guaranty, if any. As of the filing of this Form 10-K, there are no subsidiary guarantors of the obligations under the credit facility. Any borrowings by eligible foreign subsidiary borrowers would be guaranteed by PTC Inc. and any subsidiary guarantors. As of the filing of this Form 10-K, no funds were borrowed by an eligible foreign subsidiary borrower. In addition, owned property (including equity interests) of PTC and certain of its material domestic subsidiaries' owned property is subject to first priority perfected liens in favor of the lenders under this credit facility. 100% of the voting equity interests of certain of PTC’s domestic subsidiaries and 65% of its material first-tier foreign subsidiaries are pledged as collateral for the obligations under the credit facility.\nLoans under the credit facility bear interest at variable rates which reset every 30 to 180 days depending on the rate and period selected by PTC as described below. As of September 30, 2021, the annual rate for borrowing outstanding was 1.69%. Interest rates on borrowings outstanding under the credit facility range from 1.25% to 1.75% above an adjusted London Interbank Offering Rate (LIBOR) for Euro currency borrowings or range from 0.25% to 0.75% above the defined base rate (the greater of the Prime Rate, the NYFRB rate plus 0.5%, or an adjusted LIBOR plus 1%) for base rate borrowings, in each case based upon PTC’s total leverage ratio. Additionally, PTC may borrow certain foreign currencies at rates set in the same range above the respective LIBOR for those currencies, based on PTC’s total leverage ratio. A quarterly commitment fee on the undrawn portion of the credit facility is required, ranging from 0.175% to 0.30% per annum, based upon PTC’s total leverage ratio.\nThe credit facility limits PTC’s and its subsidiaries’ ability to, among other things: incur additional indebtedness; incur liens or guarantee obligations; pay dividends (other than to PTC) and make other distributions; make investments and enter into joint ventures; dispose of assets; and engage in transactions with affiliates, except on an arms-length basis. Under the credit facility, PTC and its material domestic subsidiaries may not invest cash or property in, or loan to, PTC’s foreign subsidiaries in aggregate amounts exceeding $100 million for any purpose and an additional $200 million for acquisitions of businesses. In addition, under the credit facility, PTC and its subsidiaries must maintain the following financial ratios:\n•\na total leverage ratio, defined as consolidated funded indebtedness to consolidated trailing four quarters EBITDA, not to exceed 4.50 to 1.00 as of the last day of any fiscal quarter;\n•\na senior secured leverage ratio, defined as senior consolidated total indebtedness (which excludes unsecured indebtedness) to the consolidated trailing four quarters EBITDA, not to exceed 3.00 to 1.00 as of the last day of any fiscal quarter; and\n•\nan interest coverage ratio, defined as the ratio of consolidated trailing four quarters EBITDA to consolidated trailing our quarters of cash basis interest expense, of not less than 3.00 to 1.00 as of the last day of any fiscal quarter.\nAs of September 30, 2021, our total leverage ratio was 2.23 to 1.00, our senior secured leverage ratio was 0.71 to 1.00, our interest coverage ratio was 13.64 to 1.00 and we were in compliance with all financial and operating covenants of the credit facility.\nAny failure to comply with the financial or operating covenants of the credit facility would prevent PTC from being able to borrow additional funds, and would constitute a default, permitting the lenders to, among other things, accelerate the amounts outstanding, including all accrued interest and unpaid fees, under the credit facility and to terminate the credit facility. A change in control of PTC, as defined in the agreement, also constitutes an event of default, permitting the lenders to accelerate the indebtedness and terminate the credit facility.\nWe incurred $2.0 million in financing costs in connection with the February 2020 credit facility and $1.0 million in connection with a November 2019 amendment to our prior credit facility. These origination\ncosts are recorded as deferred debt issuance costs and are included in other assets. Financing costs are expensed over the remaining term of the obligations.\nIn 2021, 2020 and 2019, we incurred interest expense of $50.5 million, $76.4 million, and $43.0 million, respectively, and paid $45.2 million, $60.6 million and $40.8 million, respectively, of interest on our debt. Additionally, in the third quarter of 2020, we paid $15.0 million in penalties for the early redemption of the 2024 notes. The average interest rate on borrowings outstanding during 2021, 2020 and 2019 was approximately 3.3%, 4.3% and 5.4%, respectively.\n10. Commitments and Contingencies\nAs of September 30, 2021and 2020, we had letters of credit and bank guarantees outstanding of $16.3 million (of which $0.5 million was collateralized) and $16.4 million (of which $0.5 million was collateralized), respectively, primarily related to our corporate headquarters lease.\nLegal and Regulatory Matters\nLegal Proceedings\nWith respect to legal proceedings and claims, we record an accrual for a contingency when it is probable that a liability has been incurred and the amount of the loss can be reasonably estimated.\n401(k) Plan\nOn September 17, 2020, three individual plaintiffs filed a putative class action lawsuit against PTC, the Investment Committee for the PTC Inc. 401(k) Plan (“Plan”), and the Board of Directors (collectively, the “PTC Defendants”) in the U.S. District Court for the District of Massachusetts alleging claims regarding the Plan. Plaintiffs allege that the defendants breached their fiduciary duties under the Employee Retirement Income Security Act of 1974 (\"ERISA\") in the oversight of the Plan, principally by allegedly selecting and retaining certain investment options despite their higher fees and costs than other available investment options, causing participants in the Plan to pay excessive recordkeeping fees and suffer lower returns on their investments, and by allegedly failing to monitor other fiduciaries. The plaintiffs seek unspecified damages on behalf of a class of Plan participants from September 17, 2014 through the date of any judgment. The plaintiffs and the PTC Defendants reached an agreement in principle to settle the lawsuit on September 22, 2021. It is expected that the Plaintiffs will file a motion for preliminary approval of the settlement on or before December 1, 2021. The ultimate outcome by judgment or settlement is not expected to be material to our financial position, results of operations or cash flows.\nOther Legal Proceedings\nIn addition to the matters listed above, we are subject to legal proceedings and claims against us in the ordinary course of business. As of September 30, 2021, we estimate that the range of possible outcomes for such matters is immaterial and we do not believe that resolving them will have a material adverse impact on our financial condition, results of operations or cash flows. However, the results of legal proceedings cannot be predicted with certainty. Should any of these legal proceedings and claims be resolved against us, the operating results for a reporting period could be adversely affected.\nGuarantees and Indemnification Obligations\nWe enter into standard indemnification agreements with our customers and business partners in the ordinary course of our business. Under such agreements, we typically indemnify, hold harmless, and agree to reimburse the indemnified party for losses suffered or incurred by the indemnified party, in connection with patent, copyright or other intellectual property infringement claims by any third party with respect to our products. Indemnification may also cover other types of claims, including claims relating to certain data breaches. Except for intellectual property infringement indemnification, the liability for which is uncapped, these agreements typically limit our liability with respect to other indemnification claims. Historically, our costs to defend lawsuits or settle claims relating to such indemnity agreements have been minimal and, accordingly, we believe the estimated fair value of liabilities under these agreements is immaterial.\nWe warrant that our software products will perform in all material respects in accordance with our standard published specifications during the term of the license/subscription. Additionally, we generally warrant that our consulting services will be performed consistent with generally accepted industry standards and, in the case of fixed price services, the agreed-upon specifications. In most cases, liability for these warranties is capped. If necessary, we would provide for the estimated cost of product and service warranties based on specific warranty claims and claim history; however, we have not incurred significant cost under our product or services warranties. As a result, we believe the estimated fair value of these liabilities is immaterial.\n11. Stockholders’ Equity\nPreferred Stock\nWe may issue up to 5.0 million shares of our preferred stock in one or more series. 0.5 million of these shares are designated as Series A Junior Participating Preferred Stock. Our Board of Directors is authorized to fix the rights and terms for any series of preferred stock without additional shareholder approval.\nCommon Stock\nOur Articles of Organization authorize us to issue up to 500 million shares of our common stock. Our Board of Directors has authorized us to repurchase up to $1 billion of our common stock in the period October 1, 2020 through September 30, 2023. We use cash from operations and borrowings under our credit facility to make such repurchases. All shares of our common stock repurchased are automatically restored to the status of authorized and unissued.\nIn 2021, we repurchased 0.2 million shares for $30 million. We did not repurchase any shares in 2020. In 2019, we repurchased 1.4 million shares for $115 million. In addition, in 2019, we repurchased 3.0 million shares, under an accelerated share repurchase (\"ASR\") agreement. On July 20, 2018, we entered into an ASR agreement with a major financial institution (“Bank”). The ASR allowed us to buy a large number of shares immediately at a purchase price determined by an average market price over a period of time. Under the ASR, we agreed to purchase $1 billion of our common stock, in total, with an initial delivery to us in July 2018 of 8.2 million shares, which represented the number of shares at the current market price equal to 80% of the total fixed purchase price of $1 billion. The remainder of the total purchase price of $200 million reflected the value of the stock held by the Bank pending final settlement in May 2019 and, accordingly, was recorded as a reduction to additional paid-in capital in 2018.\n12. Equity Incentive Plans\nOur 2000 Equity Incentive Plan (2000 Plan) provides for grants of nonqualified and incentive stock options, common stock, restricted stock, restricted stock units and stock appreciation rights to employees, directors, officers and consultants. We award restricted stock units (RSUs) as the principal equity incentive awards, including certain performance-based awards that are earned based on achieving performance criteria established by the Compensation Committee of our Board of Directors on or prior to the grant date. Each restricted stock unit represents the contingent right to receive one share of our common stock.\nIn the fourth quarter of 2020, we modified certain performance-based awards for executives by adjusting the performance criteria for the current and future periods, as well as removing certain provisions for catch up of unearned awards. There was not a material impact in 2020 due to the timing of the modifications, but there was an increase in stock-based compensation in 2021.\nThe fair value of RSUs granted in 2021, 2020 and 2019 was based on the fair market value of our stock on the date of grant for service- and certain performance- based RSUs and based on a Monte Carlo simulation model for relative total shareholder return (TSR) performance RSUs. The weighted average fair value per share of restricted stock units granted in 2021, 2020 and 2019 was $111.48, $77.57 and $82.77, respectively.\nWe account for forfeitures as they occur, rather than estimate expected forfeitures.\nThe following table shows total stock-based compensation expense recorded from our stock-based awards as reflected in our Consolidated Statements of Operations:\n(in thousands)\nYear ended September 30,\nCost of license revenue\n$\n$\n$\nCost of support and cloud services revenue\n9,900\n6,910\n5,004\nCost of professional services revenue\n9,263\n7,012\n6,426\nSales and marketing\n53,712\n37,351\n32,026\nResearch and development\n34,272\n27,005\n22,019\nGeneral and administrative\n70,042\n36,824\n20,416\nTotal stock-based compensation expense\n$\n177,289\n$\n115,149\n$\n86,400\nStock-based compensation expense in 2021, 2020 and 2019 includes $7.3 million, $5.8 million, and $6.2 million respectively, related to our employee stock purchase plan (ESPP).\nAs of September 30, 2021, total unrecognized compensation cost related to unvested restricted stock units expected to vest was approximately $190.3 million and the weighted average remaining recognition period for unvested awards was 17 months.\nAs of September 30, 2021, 4.1 million shares of common stock were available for grant under the 2000 Plan and 3.2 million shares of common stock were reserved for issuance upon vesting of restricted stock units granted and outstanding.\nOur ESPP allows eligible employees to contribute up to 10% of their base salary, up to a maximum of $25,000 per year and subject to any other plan limitations, toward the purchase of our common stock at a discounted price. The purchase price of the shares on each purchase date is equal to 85% of the lower of the fair market value of our common stock on the first and last trading days of each offering period. The ESPP is qualified under Section 423 of the Internal Revenue Code. We estimate the fair value of each purchase right under the ESPP on the date of grant using the Black-Scholes option valuation model and use the straight-line attribution approach to record the expense over the six-month offering period.\nRestricted stock unit activity for the year ended September 30, 2021\n(in thousands, except grant date fair value data)\nShares\nWeighted\nAverage\nGrant Date\nFair Value\nAggregate\nIntrinsic Value\nBalance of outstanding restricted stock units, October 1, 2020\n3,509\n$\n79.13\nGranted(1)\n1,480\n$\n111.48\nVested\n(1,488\n)\n$\n80.64\nForfeited or not earned\n(284\n)\n$\n90.99\nBalance of outstanding restricted stock units, September 30, 2021\n3,217\n$\n92.46\n$\n385,311\n(1)\nRSUs granted includes 33,000 shares from prior period Total Shareholder Return (TSR) awards that were earned upon achievement of the performance criteria and vested in November 2020.\nThe following table presents the number of RSU awards granted by award type:\n(in thousands)\nTwelve months ended\nSeptember 30, 2021\nPerformance-based RSUs(1)\nService-based RSUs(2)\n1,267\nTotal Shareholder Return RSUs(3)\n(1)\nThe performance-based RSUs were granted to our executives and are eligible to vest based upon annual performance measures over a three-year period. To the extent earned, those performance-based RSUs will vest in three substantially equal installments on November 15, 2021, 2022 and 2023, or the date the Compensation Committee determines the extent to which the applicable performance criteria have been achieved for each performance period. Up to a maximum of two times the number of RSUs can be earned (a maximum aggregate of 179,000 RSUs).\n(2)\nThe service-based RSUs were granted to employees, including our executive officers. Substantially all service-based RSUs will vest in three substantially equal annual installments on or about the anniversary of the date of grant.\n(3)\nThe Total Shareholder Return RSUs (TSR RSUs) were granted to our executives and are eligible to vest based on the performance of PTC stock relative to the stock performance of an index of companies established as of the grant date, as determined at the end of three measurement periods ending on September 30, 2021, 2022 and 2023, respectively. The RSUs earned for each period will vest on November 15, 2021, 2022, and 2023. Up to a maximum of two times the number of TSR RSUs eligible to be earned for the period (up to a maximum aggregate of 179,000 RSUs) may vest. If the return to PTC shareholders is\nnegative for a period but still meets or exceeds the group indexed return, a maximum of 100% of the eligible TSR RSUs may vest for the measurement period.\nAs of September 30, 2021, weighted average remaining vesting term for outstanding awards is 1.0 year.\nThe weighted-average fair value of the TSR RSUs was $124.04 per target RSU on the grant date. The fair value of the TSR RSUs was determined using a Monte Carlo simulation model, a generally accepted statistical technique used to simulate a range of possible future stock prices for PTC and the peer group. The method uses a risk-neutral framework to model future stock price movements based upon the risk-free rate of return, the historical volatility of each entity, and the pairwise correlations of each entity being modeled. The fair value for each simulation is the product of the payout percentage determined by PTC’s TSR rank against the peer group, the projected price of PTC stock, and a discount factor based on the risk-free rate.\nThe significant assumptions used in the Monte Carlo simulation model were as follows:\nAverage volatility of peer group\n41.5\n%\nRisk-free interest rate\n0.21\n%\nDividend yield\n-\n%\nTotal fair value of RSUs vested are as follows:\n(in thousands)\nYear ended September 30,\nValue of stock option and stock-based award activity\nTotal fair value of restricted stock unit awards vested\n$\n171,316\n$\n103,265\n$\n131,659\nIn 2021, shares issued upon vesting of restricted stock units were net of 0.5 million shares retained by us to cover employee tax withholdings of $53.1 million. In 2020, shares issued upon vesting of restricted stock units were net of 0.5 million shares retained by us to cover employee tax withholdings of $33.7 million. In 2019, shares issued upon vesting of restricted stock and restricted stock units were net of 0.5 million shares retained by us to cover employee tax withholdings of $44.4 million.\n13. Employee Benefit Plan\nWe offer a savings plan to eligible U.S. employees. The plan is intended to qualify under Section 401(k) of the Internal Revenue Code. Participating employees may defer a portion of their pre-tax compensation, as defined, but not more than statutory limits. We contribute 50% of the amount contributed by the employee, up to a maximum of 3% of the employee’s earnings. Our matching contributions vest immediately. We made matching contributions of $7.8 million, $6.7 million, and $6.0 million in 2021, 2020 and 2019, respectively.\n14. Pension Plans\nWe maintain several international defined benefit pension plans primarily covering certain employees of Computervision, which we acquired in 1998, and CoCreate, which we acquired in 2008, and covering employees in Japan. Benefits are based upon length of service and average compensation with vesting after one to five years of service. The pension cost was actuarially computed using assumptions applicable to each subsidiary plan and economic environment. We adjust our pension liability related to our plans due to changes in actuarial assumptions and performance of plan investments, as shown below. Effective in 1998, benefits under one of the international plans were frozen indefinitely.\nThe following table presents the actuarial assumptions used in accounting for the pension plans:\nWeighted average assumptions used to determine benefit obligations at September 30 measurement date:\nDiscount rate\n1.0\n%\n1.1\n%\n0.9\n%\nRate of increase in future compensation\n2.8\n%\n2.8\n%\n2.8\n%\nWeighted average assumptions used to determine net periodic pension cost for fiscal years ended September 30:\nDiscount rate\n1.1\n%\n0.9\n%\n1.9\n%\nRate of increase in future compensation\n2.8\n%\n2.8\n%\n3.0\n%\nRate of return on plan assets\n5.0\n%\n5.4\n%\n5.4\n%\nIn selecting the expected long-term rate of return on assets, we considered the current investment portfolio, and the investment return goals in the plans’ investment policy statements. We, with input from the plans’ professional investment managers and actuaries, also considered the average rate of earnings expected on the funds invested or to be invested to provide plan benefits. This process included determining expected returns for the various asset classes that comprise the plans’ target asset allocation. This basis for selecting the long-term asset return assumptions is consistent with the prior year. Using generally accepted diversification techniques, the plans’ assets, in aggregate and at the individual portfolio level, are invested so that the total portfolio risk exposure and risk-adjusted returns best meet the plans’ long-term liabilities to employees. Plan asset allocations are reviewed periodically and rebalanced to achieve target allocation among the asset categories when necessary. The discount rate is based on yield curves for highly rated corporate fixed income securities matched against cash flows for each future year.\nThe weighted long-term rate of return assumption, together with the assumptions used to determine the benefit obligations as of September 30, 2021 in the table above, will be used to determine our 2022 net periodic pension income, which we expect to be approximately $0.7 million.\nAs of September 30, 2021, the weighted average interest crediting rate used in our only cash balance pension plan is 6%.\nAll non-service net periodic pension costs are presented in other income, net on the Consolidated Statement of Operations. The actuarially computed components of net periodic pension cost recognized in our Consolidated Statements of Operations for each year are shown below:\n(in thousands)\nYear ended September 30,\nInterest cost of projected benefit obligation\n$\n$\n$\n1,199\nService cost\n1,127\n1,426\n1,372\nExpected return on plan assets\n(3,643\n)\n(3,878\n)\n(3,728\n)\nAmortization of prior service cost\n(5\n)\n(5\n)\n(5\n)\nRecognized actuarial loss\n4,139\n3,854\n2,390\nSettlement loss\n-\n-\n(30\n)\nNet periodic pension cost\n$\n2,310\n$\n1,924\n$\n1,198\nThe following tables display the change in benefit obligation and the change in the plan assets and funded status of the plans as well as the amounts recognized in our Consolidated Balance Sheets:\n(in thousands)\nYear ended September 30,\nChange in benefit obligation:\nProjected benefit obligation, beginning of year\n$\n97,832\n$\n94,983\nService cost\n1,127\n1,426\nInterest cost\nActuarial loss (gain)\n1,100\n(2,835\n)\nForeign exchange impact\n(1,562\n)\n6,452\nParticipant contributions\nBenefits paid\n(2,786\n)\n(2,234\n)\nCurtailments\n-\n(573\n)\nProjected benefit obligation, end of year\n$\n96,512\n$\n97,832\nChange in plan assets and funded status:\nPlan assets at fair value, beginning of year\n$\n72,063\n$\n69,879\nActual return on plan assets\n7,383\n(2,990\n)\nEmployer contributions\n3,049\n2,622\nParticipant contributions\nForeign exchange impact\n(1,433\n)\n4,700\nBenefits paid\n(2,786\n)\n(2,234\n)\nPlan assets at fair value-end of year\n78,385\n72,063\nProjected benefit obligation, end of year\n96,512\n97,832\nUnderfunded status\n$\n(18,127\n)\n$\n(25,769\n)\nAccumulated benefit obligation, end of year\n$\n95,090\n$\n96,270\nAmounts recognized in the balance sheet:\nNon-current asset\n$\n$\n-\nNon-current liability\n$\n(18,615\n)\n$\n(25,437\n)\nCurrent liability\n$\n(367\n)\n$\n(332\n)\nAmounts in accumulated other comprehensive loss:\nUnrecognized actuarial loss\n$\n30,213\n$\n37,175\nAs of September 30, 2021 and 2020 all of our pension plans had project benefit obligations and accumulated benefit obligations in excess of plan assets.\nThe following table shows the change in accumulated other comprehensive loss:\n(in thousands)\nYear ended September 30,\nAccumulated other comprehensive loss, beginning of year\n$\n37,175\n$\n34,920\nRecognized during year - net actuarial losses\n(4,135\n)\n(3,850\n)\nOccurring during year - net actuarial losses\n(2,640\n)\n3,460\nForeign exchange impact\n(187\n)\n2,645\nAccumulated other comprehensive loss, end of year\n$\n30,213\n$\n37,175\nIn 2021, our net actuarial gains were driven by the asset performance. In 2020 our net actuarial losses occurring during the year were primarily driven by poor asset performance due to COVID-19 pandemic, offset by favorable impact on liabilities due primarily to a higher assumed discount rate.\nThe following table shows the percentage of total plan assets for each major category of plan assets:\nSeptember 30,\nAsset category\nEquity securities\n%\n%\nFixed income securities\n%\n%\nCommodities\n%\n%\nInsurance company funds\n%\n%\nOptions\n%\n%\nCash\n%\n%\n%\n%\nWe periodically review the pension plans’ investments in the various asset classes. For the CoCreate plan in Germany, assets are actively allocated between equity and fixed income securities to achieve target return. For the other international plans, assets are allocated 100% to fixed income securities. The fixed income securities for the other international plans primarily include investments held with insurance companies with fixed returns. The plans’ investment managers are provided specific guidelines under which they are to invest the assets assigned to them. In general, investment managers are expected to remain fully invested in their asset class with further limitations on risk as related to investments in a single security, portfolio turnover and credit quality.\nThe German CoCreate plan's investment policy prohibits the use of derivatives associated with leverage and speculation or investments in securities issued by PTC, except through index-related strategies and/or commingled funds. An investment committee oversees management of the pension plans’ assets. Plan assets consist primarily of investments in equity and fixed income securities.\nIn 2021, 2020 and 2019 our actual return on plan assets was $7.4 million, $(3.0) million and $3.5 million, respectively.\nBased on actuarial valuations and additional voluntary contributions, we contributed $3.0 million, $2.6 million, and $2.6 million in 2021, 2020 and 2019, respectively, to the plans. We expect to pay $3.8 million in contributions in 2022, of which $0.8 million will be paid directly to the plans.\nAs of September 30, 2021, benefit payments expected to be paid over the next ten years are as follows:\n(in thousands)\nFuture Benefit Payments\n$\n4,297\n4,216\n4,860\n4,558\n4,638\n2027 to 2031\n24,407\nFair Value of Plan Assets\nThe international plan assets are comprised primarily of investments in a trust and an insurance company. The underlying investments in the trust are primarily publicly-traded equities and governmental fixed income securities. They are classified as Level 1 because the underlying units of the trust are traded in open public markets. The fair value of the underlying investments in equity securities and fixed income are based upon publicly-traded exchange prices.\n(in thousands)\nSeptember 30, 2021\nLevel 1\nLevel 2\nLevel 3\nTotal\nFixed income securities:\nGovernment\n$\n24,013\n$\n-\n$\n-\n$\n24,013\nCorporate investment grade\n2,924\n-\n-\n2,924\nLarge capitalization stocks\n27,078\n-\n-\n27,078\nCommodities\n8,558\n-\n-\n8,558\nInsurance company funds(1)\n-\n9,105\n-\n9,105\nOptions\n1,122\n-\n-\n1,122\nCash\n5,585\n-\n-\n5,585\nTotal plan assets\n$\n69,280\n$\n9,105\n$\n-\n$\n78,385\n(in thousands)\nSeptember 30, 2020\nLevel 1\nLevel 2\nLevel 3\nTotal\nFixed income securities:\nGovernment\n$\n20,663\n$\n-\n$\n-\n$\n20,663\nCorporate investment grade\n3,599\n-\n-\n3,599\nLarge capitalization stocks\n23,878\n-\n-\n23,878\nCommodities\n7,750\n-\n-\n7,750\nInsurance company funds(1)\n-\n9,131\n-\n9,131\nOptions\n1,126\n-\n-\n1,126\nCash\n5,916\n-\n-\n5,916\nTotal plan assets\n$\n62,932\n$\n9,131\n$\n-\n$\n72,063\n(1)\nThese investments are comprised primarily of funds invested with an insurance company in Japan with a guaranteed rate of return. The insurance company invests these assets primarily in government and corporate bonds.\n15. Fair Value Measurements\nMoney market funds, time deposits and corporate notes/bonds are classified within Level 1 of the fair value hierarchy because they are valued based on quoted market prices in active markets.\nCertificates of deposit, commercial paper and certain U.S. government agency securities are classified within Level 2 of the fair value hierarchy. These instruments are valued based on quoted prices in markets that are not active or based on other observable inputs consisting of market yields, reported trades and broker/dealer quotes.\nThe principal market in which we execute our foreign currency forward contracts is the institutional market in an over-the-counter environment with a relatively high level of price transparency. The market participants usually are large financial institutions. Our foreign currency forward contracts’ valuation inputs are based on quoted prices and quoted pricing intervals from public data sources and do not involve management judgment. These contracts are typically classified within Level 2 of the fair value hierarchy.\nOur investment in a non-marketable convertible note and shares of Matterport are classified within Level 3 of the fair value hierarchy as they are valued using inputs with little to no market activity. Refer to Note 2. Summary of Significant Accounting Policies for additional information about Matterport investment.\nOur significant financial assets and liabilities measured at fair value on a recurring basis as of September 30, 2021and 2020 were as follows:\n(in thousands)\nSeptember 30, 2021\nLevel 1\nLevel 2\nLevel 3\nTotal\nFinancial assets:\nCash equivalents(1)\n$\n114,375\n$\n-\n$\n-\n$\n114,375\nConvertible note\n-\n-\n2,000\n2,000\nEquity securities\n-\n-\n77,540\n77,540\nForward contracts\n-\n5,363\n-\n5,363\n$\n114,375\n$\n5,363\n$\n79,540\n$\n199,278\nFinancial liabilities:\nForward contracts\n-\n3,318\n-\n3,318\n$\n-\n$\n3,318\n$\n-\n$\n3,318\n(in thousands)\nSeptember 30, 2020\nLevel 1\nLevel 2\nLevel 3\nTotal\nFinancial assets:\nCash equivalents(1)\n$\n105,299\n$\n-\n$\n-\n105,299\nMarketable securities:\nCorporate notes/bonds\n59,099\n-\n-\n59,099\nForward contracts\n-\n-\n$\n164,398\n$\n$\n-\n$\n165,301\nFinancial liabilities:\nForward contracts\n-\n1,073\n-\n1,073\n$\n-\n$\n1,073\n$\n-\n$\n1,073\n(1)\nMoney market funds and time deposits.\nLevel 3 Investments\nConvertible Note\nIn the fourth quarter of 2021, we invested $2.0 million in a non-marketable convertible note. This debt security is classified as available-for-sale and is included in other assets on the Consolidated Balance Sheet.\nIn the first quarter of 2021, we invested $1.0 million into a non-marketable convertible note, which converted to preferred stock in the fourth quarter of 2021. At the time of conversion an unrealized gain of $0.2 million was recognized. This preferred stock investment is classified as non-marketable equity investment and is included in other assets on the Consolidated Balance Sheet.\nEquity Securities\nAs of September 30, 2021, we owned 4,316,301 common shares of Matterport, Inc., which are classified as Level 3 in the fair value hierarchy and are recognized at fair value of $77.5 million in other current assets on the Consolidated Balance Sheets. For the three months ended September 30, 2021, we recognized a gain of $68.8 million related to the shares in other income, net on the Consolidated Statements of Operations, which includes a gain of $72.9 million of gain on investment and a $4.1 million valuation adjustment due to lack of marketability.\nThe following table presents changes in fair value of our Level 3 investment in the Matterport, Inc. shares:\n(in thousands)\nSeptember 30, 2021\nFair Values\nBalance, July 22, 2021\n$\n8,711\nUnrealized gains\n72,910\nDiscount due to lack of marketability\n(4,081\n)\nBalance, September 30, 2021\n$\n77,540\n16. Marketable Securities\nWe did not hold any marketable securities as of September 30, 2021. In December 2020, we sold all our marketable securities to partially fund the Arena acquisition, resulting in proceeds of $56.2 million. Neither gross realized gains nor gross realized losses related to the sale were material. The amortized cost and fair value of marketable securities as of September 30, 2020 were as follows:\n(in thousands)\nSeptember 30, 2020\nAmortized\ncost\nGross\nunrealized\ngains\nGross\nunrealized\nlosses\nFair value\nCorporate notes/bonds\n$\n58,793\n$\n$\n(17\n)\n$\n59,099\nThe following tables summarize the fair value and gross unrealized losses aggregated by category and the length of time that individual securities had been in a continuous unrealized loss position as of September 30, 2020.\n(in thousands)\nSeptember 30, 2020\nLess than twelve\nmonths\nGreater than twelve\nmonths\nTotal\nFair value\nGross\nunrealized\nloss\nFair value\nGross\nunrealized\nloss\nFair value\nGross\nunrealized\nloss\nCorporate notes/bonds\n$\n9,841\n$\n(17\n)\n$\n-\n$\n-\n$\n9,841\n$\n(17\n)\nThe following table presents our available-for-sale marketable securities by contractual maturity date as of September 30, 2020.\n(in thousands)\nSeptember 30, 2020\nAmortized\ncost\nFair value\nDue in one year or less\n$\n27,727\n$\n27,899\nDue after one year through three years\n31,066\n31,200\n$\n58,793\n$\n59,099\n17. Derivative Financial Instruments\nNon-Designated Hedges\nAs of September 30, 2021 and 2020, we had outstanding forward contracts for derivatives not designated as hedging instruments with notional amounts equivalent to the following:\nSeptember 30,\nCurrency Hedged (in thousands)\nCanadian / U.S. Dollar\n$\n4,894\n$\n6,847\nEuro / U.S. Dollar\n387,466\n390,673\nBritish Pound / U.S. Dollar\n23,141\n6,328\nIsraeli Shekel / U.S. Dollar\n10,475\n9,503\nJapanese Yen / U.S. Dollar\n46,450\n50,379\nSwiss Franc / U.S. Dollar\n18,039\n12,874\nSwedish Krona / U.S. Dollar\n34,196\n18,871\nSingapore Dollar / U.S. Dollar\n3,498\n3,281\nChinese Renminbi / U.S. Dollar\n23,297\n5,415\nNew Taiwan Dollar / U.S. Dollar\n3,369\n1,483\nRussian Ruble/ U.S. Dollar\n2,614\nAll other\n6,482\n6,499\nTotal\n$\n563,921\n$\n512,462\nThe following table shows the effect of our non-designated hedges, all of which were forward contracts, on the Consolidated Statements of Operations for the years ended September 30, 2021, 2020 and 2019:\n(in thousands)\nYear ended September 30,\nLocation of gain (loss)\nNet realized and unrealized gain (loss), excluding the underlying foreign currency exposure being hedged\nOther income, net\n$\n(3,758\n)\n$\n3,518\n$\n(11,314\n)\nCash Flow Hedges\nWe stopped entering into cash flow hedges in the first quarter of 2019. We had no outstanding forward contracts designated as cash flow hedges as of either September 30, 2021, 2020 or 2019. For the year ended September 30, 2019, we had a gain of $0.2 million related to effective portion of the hedge recognized in other comprehensive income on the Consolidated Balance Sheet, and $0.6 million reclassified from other comprehensive income on the Consolidated Balance Sheet into software revenue on the Consolidated Statements of Operations.\nNet Investment Hedges\nAs of September 30, 2021 and 2020, we had outstanding forward contracts designated as net investment hedges with notional amounts equivalent to the following:\nSeptember 30,\nCurrency Hedged (in thousands)\nEuro / U.S. Dollar\n$\n128,103\n$\n164,885\nThe following table shows the effect of our derivative instruments designated as net investment hedges, all of which were forward contracts, on the Consolidated Statements of Operations for the years ended September 30, 2021, 2020, and 2019:\n(in thousands)\nYear ended September 30,\nLocation of gain (loss)\nGain (loss) recognized in OCI-effective portion\nOCI\n$\n$\n(5,483\n)\n$\n(2,925\n)\nGain (loss) reclassified from OCI-effective portion\nOCI\n$\n2,723\n$\n$\n(7,630\n)\nGain recognized-portion excluded from effectiveness testing\nOther income, net\n$\n1,249\n$\n3,506\n$\n4,598\nAs of September 30, 2021, we estimate that all amounts reported in accumulated other comprehensive loss will be applied against exposed balance sheet accounts upon translation within the next three months.\nThe following table shows our derivative instruments measured at gross fair value as reflected in the Consolidated Balance Sheets:\n(in thousands)\nFair Value of Derivatives\nDesignated As Hedging\nInstruments\nFair Value of Derivatives\nNot Designated As\nHedging Instruments\nSeptember 30,\nDerivative assets:(1)\nForward contracts\n$\n1,641\n$\n$\n3,722\n$\nDerivative liabilities:(2)\nForward contracts\n$\n-\n$\n$\n3,318\n$\n(1)\nAs of September 30, 2021 and 2020, current derivative assets of $5.4 million and $0.9 million, respectively, are recorded in other current assets on the Consolidated Balance Sheets.\n(2)\nAs of September 30, 2021 and 2020, current derivative liabilities of $3.3 million and $1.1 million, respectively, are recorded in accrued expenses and other current liabilities on the Consolidated Balance Sheets.\nOffsetting Derivative Assets and Liabilities\nWe have entered into master netting arrangements which allow net settlements under certain conditions. Although netting is permitted, it is currently our policy and practice to record all derivative assets and liabilities on a gross basis in the Consolidated Balance Sheets.\nThe following table sets forth the offsetting of derivative assets as of September 30, 2021:\n(in thousands)\nGross Amounts Offset in the Consolidated Balance Sheets\nGross Amounts Not Offset in the Consolidated Balance Sheets\nAs of September 30, 2021\nGross Amount of Recognized Assets\nGross Amounts Offset in the Consolidated Balance Sheets\nNet Amounts of Assets Presented in the Consolidated Balance Sheets\nFinancial Instruments\nCash Collateral Received\nNet Amount\nForward Contracts\n$\n5,363\n$\n-\n$\n5,363\n$\n(3,318\n)\n$\n-\n$\n2,045\nThe following table sets forth the offsetting of derivative liabilities as of September 30, 2021:\n(in thousands)\nGross Amounts Offset in the Consolidated Balance Sheets\nGross Amounts Not Offset in the Consolidated Balance Sheets\nAs of September 30, 2021\nGross Amount of Recognized Liabilities\nGross Amounts Offset in the Consolidated Balance Sheets\nNet Amounts of Liabilities Presented in the Consolidated Balance Sheets\nFinancial Instruments\nCash Collateral Pledged\nNet Amount\nForward Contracts\n$\n3,318\n$\n-\n$\n3,318\n$\n(3,318\n)\n$\n-\n$\n-\nNet gains and losses on foreign currency exposures, including realized and unrealized gains and losses on forward contracts, included in foreign currency net losses, were net losses of $8.0 million, $1.7 million and $3.2 million in 2021, 2020 and 2019, respectively. Net realized and unrealized gains and losses on forward contracts included in foreign currency net losses were a net loss of $4.9 million and $8.4 million in 2021 and 2019, and net gain of $7.0 million in 2020.\n18. Segment and Geographic Information\nWe operate within a single industry segment-computer software and related services. Operating segments as defined under GAAP are components of an enterprise about which separate financial information is available that is evaluated regularly by the chief operating decision maker, or decision-making group, in deciding how to allocate resources and in assessing performance. Our chief operating decision maker is our President and Chief Executive Officer. We have two operating and reportable segments: (1) Software Products, which includes license, subscription and related support revenue (including updates and technical support) for all our products; and (2) Professional Services, which includes consulting, implementation and training services. We do not allocate sales and marketing or general and administrative expense to our operating segments as these activities are managed on a consolidated basis. Additionally, segment profit does not include stock-based compensation, amortization of intangible assets, restructuring charges and certain other identified costs that we do not allocate to the segments for purposes of evaluating their operational performance.\nThe revenue and profit attributable to our operating segments are summarized below. We do not produce asset information by reportable segment; therefore, it is not reported.\n(in thousands)\nYear ended September 30,\nSoftware Products\nRevenue\n$\n1,649,341\n$\n1,314,617\n$\n1,088,100\nOperating costs(1)\n451,734\n393,803\n377,464\nProfit\n1,197,607\n920,814\n710,636\nProfessional Services\nRevenue\n157,818\n143,798\n167,531\nOperating costs(2)\n135,981\n128,678\n133,846\nProfit\n21,837\n15,120\n33,685\nTotal segment revenue\n1,807,159\n1,458,415\n1,255,631\nTotal segment costs\n587,715\n522,481\n511,310\nTotal segment profit\n1,219,444\n935,934\n744,321\nUnallocated operating expenses:(3)\nSales and marketing expenses\n464,067\n398,100\n385,423\nGeneral and administrative expenses\n120,954\n114,386\n104,393\nIntangibles amortization\n59,165\n56,104\n51,147\nRestructuring and other charges, net\n2,211\n32,716\n51,114\nStock-based compensation\n177,289\n115,149\n86,400\nOther unallocated operating expenses(4)\n15,010\n8,616\n2,802\nTotal operating income\n380,748\n210,863\n63,042\nInterest expense\n(50,478\n)\n(76,428\n)\n(43,047\n)\nOther income, net\n61,485\nIncome before income taxes\n$\n391,755\n$\n134,706\n$\n20,300\n(1)\nOperating costs for the Software Products segment include all costs of software revenue and research and development costs, excluding stock-based compensation and intangible amortization. Operating costs for the Software Products segment include depreciation of $4.0 million, $4.2 million and $4.6 million in 2021, 2020 and 2019, respectively.\n(2)\nOperating costs for the Professional Services segment include all costs of professional services revenue, excluding stock-based compensation, intangible amortization, and fair value adjustments for deferred services costs. The Professional Services segment includes depreciation of $1.1 million, $1.1 million and $1.4 million in 2021, 2020 and 2019, respectively.\n(3)\nUnallocated departments include depreciation of $21.0 million, $19.4 million and $20.6 million in 2021, 2020 and 2019, respectively.\n(4)\nOther unallocated operating expenses include acquisition-related and other transactional costs and fair value adjustments for deferred services costs.\nWe report revenue by the following three product groups:\n(in thousands)\nYear ended September 30,\nCore\n$\n1,257,827\n$\n1,025,668\n$\n868,970\nGrowth\n316,074\n222,646\n167,544\nFocused Solutions Group (FSG)\n233,258\n210,101\n219,117\nTotal revenue\n$\n1,807,159\n$\n1,458,415\n$\n1,255,631\nWe license products to customers worldwide. Our sales and marketing operations outside the United States are conducted principally through our international sales subsidiaries throughout Europe and the Asia Pacific region. Intercompany sales and transfers between geographic areas are accounted for at prices that are designed to be representative of unaffiliated party transactions. Our material long-lived assets primarily reside in the United States in 2021, 2020, and 2019. Our international revenue is presented based on the location of our customer. Revenue for the geographic regions in which we operate is presented below.\n(in thousands)\nYear ended September 30,\nRevenue:\nAmericas(1)\n$\n766,021\n$\n649,383\n$\n537,548\nEurope(2)\n722,977\n543,779\n464,666\nAsia Pacific\n318,161\n265,253\n253,417\nTotal revenue\n$\n1,807,159\n$\n1,458,415\n$\n1,255,631\n(1)\nIncludes revenue in the United States totaling $741.3 million, $621.8 million, and $514.4 million for 2021, 2020 and 2019, respectively.\n(2)\nIncludes revenue in Germany totaling $290.7 million, $198.7 million, and $185.4 million for 2021, 2020 and 2019, respectively.\n19. Leases\nOur headquarters are located at 121 Seaport Boulevard, Boston, Massachusetts (the Boston lease). The Boston lease is for approximately 250,000 square feet and runs from January 1, 2019 through June 30, 2037. Base rent for the first year of the lease is $11.0 million and will increase by $1 per square foot per year thereafter ($0.3 million per year). Base rent first became payable on July 1, 2020. In addition to the base rent, we are required to pay our pro rata portions of building operating costs and real estate taxes (together, “Additional Rent”). Annual Additional Rent is estimated to be approximately $7.1 million. The lease provides for $25 million in landlord funding for leasehold improvements ($100 per square foot). The leasehold improvement funding provision was fully utilized by us and was reflected as a derecognition adjustment to the right-of-use asset.\nThe components of lease cost reflected in the Consolidated Statement of Operations for the year ended September 30, 2021 were as follows:\n(in thousands)\nYear ended September 30, 2021\nOperating lease cost\n$\n37,295\nShort-term lease cost\n2,452\nVariable lease cost\n9,808\nSublease income\n(4,438\n)\nTotal lease cost\n$\n45,117\nSupplemental cash flow and right-of use assets information for the year ended September 30, 2021 was as follows:\n(in thousands)\nYear ended September 30, 2021\nCash paid for amounts included in the measurement of lease liabilities\nOperating cash flows from operating leases\n$\n50,299\nRight-of-use assets obtained in exchange for new operating lease liabilities\n$\n9,576\nRight-of-use assets obtained in exchange for new financing lease liabilities\n$\n1,146\nSupplemental balance sheet information related to the leases as of September 30, 2021 was as follows:\nAs of September 30, 2021\nWeighted-average remaining lease term - operating leases\n11.9 years\nWeighted-average remaining lease term - financing leases\n4 years\nWeighted-average discount rate - operating leases\n5.5\n%\nWeighted-average discount rate - financing leases\n3.0\n%\nMaturities of lease liabilities as of September 30, 2021 are as follows:\n(in thousands)\nOperating Leases\n$\n44,132\n28,988\n24,956\n21,760\n17,872\nThereafter\n157,358\nTotal future lease payments\n295,066\nLess: imputed interest\n(86,267\n)\nTotal\n$\n208,799\nExited (Restructured) Facilities\nAs of September 30, 2021, we have net liabilities of $3.6 million related to excess facilities (compared to $11.3 million at September 30, 2020), representing $1.2 million of right-of-use assets and $4.8 million of lease obligations, of which $4.2 million is classified as short term and $0.6 million is classified as long term.\nIn determining the amount of right-of-use assets for restructured facilities, we are required to estimate such factors as future vacancy rates, the time required to sublet properties, and sublease rates. Updates to these estimates may result in revisions to the value of right-of-use assets recorded. The amounts recorded are based on the net present value of estimated sublease income. As of September 30, 2021, the right-of-use assets for exited facilities reflect discounted committed sublease income of approximately $1.2 million. There was no uncommitted sublease income as of September 30, 2021. As a result of changes in our sublease income assumptions and an incremental obligation to exit a portion of our former headquarters facility early, in the year ended September 30, 2021, we recorded a facility impairment charge of $0.1 million.\nIn the year ended September 30, 2021, we made payments of $7.8 million related to lease costs for exited facilities.\n20. Subsequent Events\nEquity Grants\nIn November 2021, we granted shares valued at approximately $20.5 million to our employees, including our executive officers ($3.1 million), in payment of amounts earned under our annual Corporate Incentive Plan. We also granted service-based restricted stock units (RSUs) valued at approximately $47.0 million to employees, including our executive officers ($11.1 million), and performance-based RSUs valued at approximately $18.2 million to employees, including our executive officers ($11.1 million). The service-based RSUs will generally vest in three substantially equal annual installments on November 15, 2022, 2023 and 2024. Half of the performance-based RSUs are eligible to vest based upon annual cash flow performance measures, measured over a three-year period and will vest in three substantially equal annual installments on November 15, 2022, 2023 and 2024. The other half are relative Total Shareholder Return RSUs which are eligible to vest based on the performance of PTC stock relative to the stock performance of an index of software and services companies for the period ending September 30, 2024 and will vest to the extent earned on November 15, 2024.\nRestructuring\nOn November 3, 2021, we committed to a plan to restructure our workforce and consolidate select facilities to align our customer facing and product-related functions with SaaS industry best practices and accelerate the opportunity for our on-premise customers to move to the cloud. The expected savings from the restructuring will be re-invested in the business. The restructuring is expected to result in a charge and cash payments of approximately $45 million to $50 million in 2022. We anticipate additional cash restructuring payments of approximately $5 million related to past restructurings."
}