{
    "cik": "860731",
    "company": "TYLER TECHNOLOGIES INC",
    "filing_type": "10-K",
    "filing_date": "2021-02-19",
    "period_of_report": "2020-12-31",
    "sic": "7372",
    "state_of_inc": "DE",
    "state_location": "TX",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/860731/0000860731-21-000014-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/860731/000086073121000014/tyl-20201231.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/860731/0000860731-21-000014.txt",
    "filename": "860731_10K_2020_0000860731-21-000014.htm",
    "item_1": "ITEM 1. BUSINESS.\nDESCRIPTION OF BUSINESS\nTyler Technologies, Inc. (“Tyler”) is a major provider of integrated information management solutions and services for the public sector, with a focus on local governments. We partner with clients to make government more accessible to the public, more responsive to the needs of citizens and more efficient in its operations. We have a broad line of software solutions and services to address the information technology (“IT”) needs of major areas of operations for cities, counties, schools and other government entities. A majority of our clients have our software installed in-house. For clients who prefer not to physically acquire the software and hardware, most of our software applications can be delivered as software as a service (“SaaS”), which primarily utilize the Tyler private cloud. We provide professional IT services to our clients, including software and hardware installation, data conversion, training and, at times, product modifications. In addition, we are the nation’s largest provider of outsourced property appraisal services for taxing jurisdictions. We also provide continuing client support services to ensure product performance and reliability, which provides us with long-term client relationships and a significant base of recurring maintenance revenue. In addition, we provide electronic document filing (“e-filing”) solutions, which simplify the filing and management of court documents.\nMARKET OVERVIEW\nThe state and local government market is one of the largest and most decentralized IT markets in the country, consisting of all 50 states, approximately 3,000 counties, 36,000 cities and towns and 12,900 school districts. This market is also comprised of approximately 38,000 special districts and other agencies, each with specialized delegated responsibilities and unique information management requirements.\nTraditionally, local government bodies and agencies performed state-mandated duties, including property assessment, record keeping, road maintenance, law enforcement, administration of election and judicial functions, and the provision of welfare assistance. Today, a host of emerging and urgent issues are confronting local governments, each of which demands a service response. These areas include criminal justice and corrections, administration and finance, public safety, health and human services, planning, regulatory and maintenance and records and document management. Transfers of responsibility from the federal and state governments to county and municipal governments and agencies in these and other areas also place additional service and financial requirements on these local government units. In addition, constituents of local governments are increasingly demanding improved service and better access to information from public entities. As a result, local governments recognize the increasing value of information management systems and services to, among other things, improve revenue collection, provide increased access to information, and streamline delivery of services to their constituents. Local government bodies are now recognizing that “e-government” is an additional responsibility for community development. From integrated tax systems to integrated civil and criminal justice information systems, many counties and cities have benefited significantly from the implementation of jurisdiction-wide systems that allow different agencies or government offices to share data and provide a more comprehensive approach to information management. Many city and county governmental agencies also have unique individual information management requirements, which must be tailored to the specific functions of each particular office.\nMany local governments also have difficulties attracting and retaining the staff necessary to support their IT functions. As a result, they seek to establish long-term relationships with reliable providers of high quality IT products and services such as Tyler.\nAlthough local governments often face budgetary constraints in their operations, their primary revenue sources are usually property taxes, and to a lesser extent, utility billings and other fees, which historically tend to be relatively stable. In addition, the acquisition of new technology typically enables local governments to operate more efficiently, and often provides a measurable return on investment that justifies the purchase of software and related services.\nGartner, Inc., a leading information technology research and advisory company, estimates that state and local government application and vertical specific software spending will grow from $19.5 billion in 2021 to $25.1 billion in 2024. The professional services and support segments of the market are expected to expand from $29.0 billion in 2021 to $33.5 billion in 2024. Application and vertical specific software sales in the primary and secondary education segments of the market is expected to expand from $3.0 billion in 2021 to $4.3 billion in 2024 while professional services and support are expected to grow from $3.0 billion in 2021 to $3.7 billion in 2024.\nPRODUCTS AND SERVICES\nWe provide a comprehensive and flexible suite of products and services that addresses the information technology needs of cities, counties, schools and other local government entities. We derive our revenues from five primary sources:\n•Sales of software licenses and royalties\n•Subscription-based arrangements\n•Software services\n•Maintenance and support\n•Appraisal services\nWe design, develop, market and support a broad range of software solutions to serve mission-critical “back-office” functions of the public sector with focus on local governments. Many of our software applications include Internet-accessible solutions that allow for real-time public access to a variety of information or that allow the public to transact business with local governments via the Internet. Our software solutions and services are generally grouped in eight major areas:\n•Financial Management and Education\n•Courts and Justice\n•Public Safety\n•Property Appraisal and Tax\n•Planning, Regulatory and Maintenance\n•Land and Vital Records Management\n•Data and Insights\n•Platform Technologies\nEach of our core software systems consists of several fully integrated applications. For clients who acquire software for use on premises, we generally license our systems under standard perpetual license agreements that provide the client with a fully paid, nonexclusive, nontransferable right to use the software. In some of the product areas, such as financial management and education and property appraisal and tax, we offer multiple solutions designed to meet the needs of different sized governments.\nWe also offer SaaS arrangements, which generally utilize the Tyler private cloud, for clients who do not wish to maintain, update and operate these systems or to make up-front capital expenditures to implement these advanced technologies. For these clients, the software and client data are hosted at our data centers or at third-party locations, and clients typically sign multi-year contracts for these subscription-based services.\nHistorically, we have had a greater proportion of our annual revenues in the second half of our fiscal year due to governmental budget and spending cycles and the timing of system implementations for clients desiring to “go live” at the beginning of the calendar year.\nA description of our suites of products and services follows:\nSoftware Licenses\nFinancial Management and Education\nOur financial management and education solutions are enterprise resource planning systems for local governments, which integrate information across all facets of a client organization. Our financial management solutions include modular fund accounting systems that can be tailored to meet the needs of virtually any government agency or not-for-profit entity. Our financial management systems include modules for general ledger, budget preparation, fixed assets, requisitions, purchase orders, bid management, accounts payable, contract management, accounts receivable, investment management, inventory control, project and grant accounting, work orders, job costing, GASB reporting, payroll and human resources. All of our financial management systems are intended to conform to government auditing and financial reporting requirements and generally accepted accounting principles.\nWe sell utility billing systems that support the billing and collection of metered and non-metered services, along with multiple billing cycles. Our Web-enabled utility billing solutions allow clients to access information online such as average consumption and transaction history. In addition, our systems can accept secured Internet payments via credit cards and checks.\nWe also offer specialized products that automate numerous city and county functions, including municipal courts, parking tickets, equipment and project costing, animal licenses, business licenses, permits and inspections, code enforcement, citizen complaint tracking, ambulance billing, fleet maintenance, and cemetery records management.\nIn addition to providing financial management systems to K-12 schools, we sell student information systems for K-12 schools, which manage such activities as scheduling, grades and attendance. We also offer student transportation solutions to manage school bus routing optimization, fleet management, field trips and other related functions.\nTyler’s financial management and education solutions include Web components that enhance local governments’ service capabilities by facilitating online access to information for both employees and citizens and enabling online transactions.\nCourts and Justice\nWe offer a complete, fully integrated suite of judicial solutions designed to handle complex, multi-jurisdictional county or statewide implementations as well as single county systems. Our solutions help eliminate duplicate data entry, promote more effective business procedures, and improve efficiency across the entire justice process.\nOur unified court case management system is designed to automate the tracking and management of information involved in all case types, including criminal, traffic, civil, family, probate and juvenile courts. It also tracks the status of cases, processes fines and fees and generates the specialized judgment and sentencing documents, notices and forms required in the court process. Documents received by the court can be scanned into the electronic case file and easily retrieved for viewing. Documents generated by the court can be electronically signed and automatically attached to the electronic case file. Additional modules automate the management of court calendars, coordinate judges' schedules and generate court dockets. Our targeted courtroom technologies allow courts to rapidly review calendars, cases and view documents in the courtroom. Courts may also take advantage of our related jury management system. We also offer a solution for online dispute resolution that automates the flow and resolution of common and historically time-consuming disputes including debt, landlord, tenant, small claims, child custody and other case types.\nOur court and law enforcement systems allow the public to access, via the Internet, a variety of information, including non-confidential criminal and civil court records, jail booking and release information, bond and bondsmen information, and court calendars and dockets. In addition, our systems allow cities and counties to accept payments for traffic and parking tickets over the Internet, with a seamless and automatic interface to back-office justice and financial systems.\nOur prosecutor system enables state attorney offices to track and manage criminal cases, including detailed victim information and private case notes. Investigative reports and charging instrument documents can be generated and stored for later viewing. Prosecutors can schedule and record the outcome of grand jury hearings. When integrated with the court system, prosecutors can view the electronic case file and related documents, as well as manage witness lists and subpoenas needed for court hearings.\nOur supervision system allows pre-trial and probation offices to manage offender caseloads. Supervision officers can track contact schedules, risk/needs assessments and reassessments, detailed drug test results, employment histories, compliance with conditions and payments of fees and restitution. Documents and forms, like pre-sentence investigations or revocation orders, can be generated and stored for easy viewing. When integrated with the jail and court systems, supervision officers obtain easy access and quick notification of offenders that have court hearings scheduled, are arrested locally, and have new warrants issued.\nWe also offer a court case management solution that automates and tracks all aspects of municipal courts and offices. It is a fully integrated, graphical application that provides effective case management, document processing and cash/bond management. This system complies with all state reporting and conviction reports and includes electronic reporting and also integrates with certain of our financial management solutions and public safety solutions.\nPublic Safety\nOur public safety software is a fully unified and comprehensive solution for law enforcement, fire and EMS, including 911 / computer aided dispatch (“CAD”), records management, mobile computing, corrections management, Web-based information sharing and decision support. The modules are fully integrated, utilizing a common database and providing full functionality between modules, reducing data entry. The software provides fast, efficient dispatching, and quick access to records, reports and actionable information from an agency’s database.\nOur 911 / CAD solutions provide real-time, critical response dispatch functions in either single- or multi-jurisdictional environments. When integrated with our records management software, a vital link exists between dispatch and the most comprehensive records database available. Within seconds, the dispatch operator and the officer in the field can access critical information, such as prior incidents and outstanding warrants, increasing officer knowledge and safety. The solutions offer strong geographic information systems integration to help dispatchers quickly locate and send the best response during an emergency. Our 911 / CAD solutions dramatically improve performance, response time and unit safety.\nOur records management solutions for law enforcement and fire track statistical, operational, investigative and management data for inquiry and reporting. The systems create an efficient case processing workflow and help solve crimes with an accessible database that maintains central files on people, places, property, vehicles and criminal activity. Our public safety records management solutions enable easy access to information and simplify reporting.\nOur mobile computing solutions for law enforcement and fire provide instant access to local, state, regional and federal databases via mobile devices. Officers and firefighters can experience the benefits of obtaining critical, real-time information in the field, while saving time by preparing reports directly in their vehicles.\nOur jail management systems document and manage information that meets the requirements of a modern jail facility. This includes the booking and housing of persons in custody, supervising defendants on a pre-trial release, maintaining offenders sentenced to local incarceration and billing other agencies for housing inmates. Searching, reporting and tracking features are integrated, allowing reliable, up-to-date access to current arrest and incarceration data, including digital mug shots. Our systems also provide warrant checks for visitors or book-ins, inmate classification and risk assessment, commissary, property and medical processing, automation of statistics, and state and federal reporting.\nOur civil processing solutions manage civil process needs from document receipt through service, payment process and final closeout. We also have a mobile electronic citation solution through which law enforcement officers can easily enter citation information in a mobile device, which is automatically uploaded into the court or public safety records management systems, rather than hand-writing citations that must be re-entered into the systems.\nProperty Appraisal and Tax\nWe provide systems and software that automate the appraisal and assessment of real and personal property, including record keeping, mass appraisal, inquiry and protest tracking, appraisal and tax roll generation, tax statement processing, and electronic state-level reporting. These systems are image and video-enabled to facilitate the storage of and access to the many property-related documents and for the online storage of digital photographs of properties for use in defending values in protest situations. Other related tax applications are available for agencies that bill and collect taxes, including cities, counties, school tax offices, and special taxing and collection agencies. These systems support billing, collections, lock box operations, mortgage company electronic payments, and various reporting requirements.\nPlanning, Regulatory and Maintenance\nOur planning, regulatory and maintenance software solutions are designed for public sector agencies such as community development, planning, building, code enforcement, tax and revenues, public works, transportation, land control, environmental, fire safety, storm water management, regulatory controls and engineering. These solutions help public sector agencies better manage their day-to-day business functions while streamlining and automating the many aspects of their land management, permitting and planning systems. Our mobile solutions extend automation to the field and Web access brings online services to citizens 24 hours a day, 365 days a year.\nLand and Vital Records Management\nWe also offer a number of specialized software applications designed to help local governments enhance and automate operations involving records and document management. These systems record, scan and index information for the many documents maintained by local governments, such as deeds, mortgages, liens, UCC financing statements and vital records (birth, death and marriage certificates). These applications include fully integrated imaging systems with batch and scan processing capabilities and fully integrated receipting and cashiering systems, as well as Web-enabled public access.\nOur content management solutions allow state and local governments and school districts to capture, deliver, manage and archive electronic information. These solutions streamline the flow of digital information throughout the organization to increase efficiency by transforming paper forms and documents into electronic images that drive key business processes.\nData and Insights\nOur data and insights solutions make existing government data discoverable, usable, and actionable for government workers and the people they serve. The data and insights solution includes a data-as-a-service platform and cloud applications for open data and citizen engagement, exclusively for city, county, state, and federal government organizations. Our data and insights solutions allow government to analyze, visualize, and securely share data across multiple departments and programs. These solutions deliver data-driven innovation and cost-savings by bringing together disparate systems and leveraging the cloud to dramatically enhance the effectiveness of government programs, to improve quality of life for residents, to positively impact local economies, and to achieve excellence in government operations.\nPlatform Technologies\nWe offer a low-code application development platform solution for case management and business process management. Whether based on premises or in the cloud, its Data-First™ approach allows the application to be implemented immediately and configured continuously, enabling clients to get to work quickly while keeping costs low. Our low code application platform allows government agencies the ability to track, collaborate, and report on the data that drives activities forward.\nSubscription-Based Services\nSubscription-based revenue is primarily derived from our SaaS arrangements, which generally utilize the Tyler private cloud, as well as our transaction-based offerings such as e-filing solutions, online dispute resolution solutions, and online payment services.\nWe are able to provide the majority of our software products through our SaaS model. The clients who choose this model typically do not wish to maintain, update and operate these systems or make up-front capital expenditures to implement these advanced technologies. The contract terms for these arrangements range from one to 10 years but are typically contracted for initial periods of three to five years. The majority of our SaaS or hosting arrangements include additional professional services as well as maintenance and support services. In certain arrangements, the client may also acquire a license to the software.\nAs part of our subscription-based services, we provide e-filing solutions that simplify the filing and management of court related documents for courts and law offices. Revenues for e-filing are included in subscription-based revenues and are derived from transaction fees and in some cases, fixed fee arrangements. Other transaction-based fees primarily relate to online payment services, which are offered with the assistance of third-party vendors, and online dispute resolution solutions.\nSoftware Services\nWe provide a variety of professional services to clients who utilize our software products. Virtually all of our clients contract with us for installation, training, and data conversion services in connection with their implementation of Tyler’s software solutions. The complete implementation process for a typical system includes planning, design, data conversion, set-up and testing. At the culmination of the implementation process, a data implementation team is generally onsite at the client’s facility to ensure the smooth go-live with the new system. Implementation fees are charged separately to clients on either a fixed-fee or hourly charge basis, depending on the contract.\nBoth in connection with the installation of new systems and on an ongoing basis, we provide extensive training services and programs related to our products and services. Training can be provided in our training centers, onsite at clients’ locations, or at meetings and conferences and can be customized to meet clients’ requirements. The vast majority of our clients contract with us for training services, both to improve their employees’ proficiency and productivity and to fully utilize the functionality of our systems. Training services are generally billed on an hourly or daily basis, along with travel and other expenses.\nMaintenance and Support\nFollowing the implementation of our software systems, we provide ongoing software support services to assist our clients in operating the systems and to periodically update the software. Support is provided to clients over the phone or via the Web through help desks staffed by our client support representatives. For more complicated issues, our staff, with the clients' permission, can log on to clients’ systems remotely. We maintain our clients’ software largely through releases that contain improvements and incremental additions of features and functionality, along with updates necessary because of legislative or regulatory changes.\nVirtually all of our software clients contract with us for maintenance and support, which provides us with a significant source of recurring revenue. We generally provide maintenance and support for our on-premises clients under annual, or in some cases, multi-year contracts, with a typical fee based on a percentage of the software product’s license fee. These fees can generally be increased on renewal and may also increase as new license fees increase. Maintenance and support fees are generally paid annually in advance. Most maintenance contracts automatically renew unless the client or Tyler gives notice of termination prior to expiration. Similar support is provided to our SaaS clients and is included in their subscription fees, which are classified as subscription-based revenues.\nAppraisal Services\nWe are the nation’s largest provider of property appraisal outsourcing services for local government taxing authorities. These services include:\n•The physical inspection of commercial and residential properties\n•Data collection and processing\n•Sophisticated computer analyses for property valuation\n•Preparation of tax rolls\n•Community education regarding the assessment process\n•Arbitration between taxpayers and the assessing jurisdiction\nLocal government taxing authorities normally reappraise properties from time to time to update values for tax assessment purposes and to maintain equity in the taxing process. In some jurisdictions, law mandates reassessment cycles; in others, they are discretionary. While some taxing jurisdictions perform reappraisals in-house, many local governments outsource this function because of its cyclical nature and because of the specialized knowledge and expertise requirements associated with it. Our appraisal services business unit has operated in this business since 1938.\nIn some instances, we also provide property tax and/or appraisal software products in connection with appraisal outsourcing projects, while other clients may only engage us to provide appraisal services. Appraisal outsourcing services are somewhat seasonal in nature to the extent that winter weather conditions reduce the productivity of data collection activities in connection with those projects.\nSTRATEGY\nOur objective is to grow our revenue and earnings organically, supplemented by focused strategic acquisitions. The key components of our business strategy are to:\n•Provide high quality, value-added products and services to our clients. We compete on the basis of, among other things, delivering to clients our deep domain expertise in local government operations through the highest value products and services in the market. We believe we have achieved a reputation as a premium product and service provider to the local government market.\n•Continue to expand our product and service offerings. While we already have what we believe to be the broadest line of software products for local governments, we continually upgrade our core software applications and expand our complementary product and service offerings to respond to technological advancements and the changing needs of our clients. In 2010, we began providing e-filing for courts and law offices, which simplifies the filing and management of court related documents. We believe revenue from e-filing solutions will continue to grow over time as more local and state governments mandate electronic document filings. We also offer solutions that allow the public to access data and conduct transactions with local governments, such as paying traffic tickets, property taxes and utility bills online. We believe that the addition of such features enhances the market appeal of our core products. We have also broadened our offerings of consulting and business process reengineering services.\n•Expand our client base. We seek to establish long-term relationships with new clients primarily through our sales and marketing efforts. While we currently have clients in all 50 states, Canada, the Caribbean, the United Kingdom, Australia, and other international locations, not all of our solutions have achieved nationwide geographic penetration. We intend to continue to expand into new geographic markets by adding sales staff and targeting marketing efforts by solutions in those areas. We also intend to continue to expand our customer base to include more large governments. While our traditional market focus has primarily been on small and mid-sized governments, our increased size and market presence, together with the technological advances and improved scalability of certain of our solutions, are allowing us to achieve increasing success in selling to larger clients. We also expect to expand our presence in international markets by leveraging our leadership position in the United States through the disciplined pursuit of selected opportunities in other countries.\n•Expand our existing client relationships. Our existing customer base offers significant opportunities for additional sales of solutions and services that we currently offer, but that existing clients do not fully utilize. Add-on sales to existing clients typically involve lower sales and marketing expenses than sales to new clients.\n•Grow recurring revenues. We have a large recurring revenue base from maintenance and support and subscription-based services, which generated revenues of $818.2 million, or 73% of total revenues, in 2020. We have historically experienced very low customer turnover (approximately 2% annually) and recurring revenues continue to grow as the installed customer base increases. Subscription-based revenues have been our fastest growing revenue category over the past five years, increasing from $142.7 million in 2016 to $350.6 million in 2020.\n•Maximize economies of scale and take advantage of financial leverage in our business. We seek to build and maintain a larger client base to create economies of scale, enabling us to provide value-added products and services to our clients while expanding our operating margins. Because we sell primarily “off-the-shelf” software, increased sales of the same solutions result in incrementally higher gross margins. In addition, we believe that we have a marketing and administrative infrastructure in place that can be leveraged to accommodate significant long-term growth without proportionately increasing selling, general and administrative expenses.\n•Attract and retain highly qualified employees. We believe that the depth and quality of our management and staff is one of our significant strengths, and that the ability to retain such employees is crucial to our continued growth and success. We believe that our stable management team, financial strength and growth opportunities, as well as our leadership position in the local government market, enhance our attractiveness as an employer for highly skilled employees.\n•Pursue selected strategic acquisitions. While we expect to primarily grow internally, from time to time we selectively pursue strategic acquisitions that provide us with one or more of the following:\n•New products and services to complement our existing offerings\n•Entry into new markets related to the public sector\n•New clients and/or geographic expansion\n•Establish strategic alliances. In October 2019, we announced a strategic collaboration agreement with Amazon Web Services (\"AWS\") for cloud hosting services. This agreement brings together Tyler, the nation's largest software company exclusively focused on the public sector, and AWS, the broadest and deepest cloud platform. Specifically, the agreement with AWS provides the framework for development, training and collaboration in order to support next-generation applications that have the scalability, resiliency, and security AWS offers. It will assist Tyler in accelerating innovation and the development of strategic initiatives. These initiatives will bring the most advanced cloud-native services to Tyler clients, improving the flow of information and providing a better experience for state, local, and federal governments.\nSALES, MARKETING AND CLIENTS\nWe market our products and services through direct sales and marketing personnel located throughout the United States. Other in-house sales staff focus on add-on sales, professional services and support.\nSales of new systems are typically generated from referrals from other government offices or departments within a county or municipality, referrals from other local governments, relationships established between sales representatives and county or local officials, contacts at trade shows, direct mailings, and direct contact from prospects already familiar with us. We are active in numerous national, state, county, and local government associations, and participate in annual meetings, trade shows, and educational events.\nClients consist primarily of federal, state, county and municipal agencies, school districts and other local government offices. In counties, clients include the auditor, treasurer, tax assessor/collector, county clerk, district clerk, county and district court judges, probation officers, sheriff, and county appraiser. At municipal government sites, clients include directors from various departments, including administration, finance, utilities, public works, code enforcement, personnel, purchasing, taxation, municipal court and police. Contracts for software products and services are generally implemented over periods of three months to one year, although some complex implementations may span multiple years, with annually renewing maintenance and support update agreements thereafter. Although either the client or we can terminate these agreements, historically almost all support and maintenance agreements are automatically renewed annually. During 2020, approximately 42% of our revenue was attributable to ongoing support and maintenance agreements.\nCOMPETITION\nWe compete with numerous local, regional, and national firms that provide or offer some or many of the same solutions and services that we provide. Many of these competitors are smaller companies that may be able to offer less expensive solutions than ours. Many of these firms operate within a specific geographic area and/or in a narrow product or service niche. We also compete with national firms, some of which have greater financial and technical resources than we do, including Oracle Corporation, Infor, SAP AG, Workday, Inc., CentralSquare Technologies, Thomson Reuters Corporation, Motorola Solutions, Inc., Axon Enterprise, Inc., and Constellation Software, Inc. In addition, we sometimes compete with consulting and systems integration firms, which develop custom systems, primarily for larger governments. We also occasionally compete with central internal information service departments of local governments, which requires us to persuade the end-user department to discontinue service by its own personnel and outsource the service to us.\nWe compete on a variety of factors, including price, service, name recognition, reputation, technological capabilities, and the ability to modify existing products and services to accommodate the individual requirements of the client. Our ability to offer an integrated system of applications for several offices or departments is often a competitive advantage. Governmental units often are required to seek competitive proposals through a request for proposal process and some prospective clients use consultants to assist them with the proposal and vendor selection process.\nSUPPLIERS\nSubstantially all of the computers, peripherals, printers, scanners, operating system software, office automation software, and other equipment necessary for the implementation and provision of our software systems and services are presently available from several third-party sources. Hardware is purchased on original equipment manufacturer or distributor terms at discounts from retail. We have not experienced any significant supply problems.\nBACKLOG\nAt December 31, 2020, our revenue backlog was approximately $1.59 billion, compared to $1.46 billion at December 31, 2019. The backlog generally represents signed contracts under which the revenue has not been recognized as of year-end. Approximately $780.0 million, or 49%, of the backlog is expected to be recognized during 2021.\nINTELLECTUAL PROPERTY, PROPRIETARY RIGHTS, AND LICENSES\nWe regard certain features of our internal operations, software, and documentation as confidential and proprietary and rely on a combination of contractual restrictions, trade secret laws and other measures to protect our proprietary intellectual property. We generally do not rely on patents. We believe that, due to the rapid rate of technological change in the computer software industry, trade secrets and copyright protection are less significant than factors such as knowledge, ability and experience of our employees, frequent product enhancements, and timeliness and quality of support services. We typically license our software products under non-exclusive license agreements, which are generally non-transferable and have a perpetual term.\nHUMAN CAPITAL RESOURCES\nHuman Capital\nThe strength of our team is one of the most significant contributors to our success in empowering the public sector to create smarter, safer, and stronger communities. Our effectiveness in attracting, developing, engaging and retaining talented team members, many of whom spend the majority of their careers at Tyler serving our public sector clients, demonstrates our commitment to providing a welcoming and safe workplace, with equitable compensation, benefits and opportunities for our team members to continually grow and develop their careers within Tyler.\nAs of December 31, 2020, we had approximately 5,500 team members. Approximately 250 of these team members are located in Canada and the Philippines; the remainder work remotely in the U.S. or are based in one of our nearly 50 U.S. offices. No Tyler employees are represented by unions. We believe our efforts in managing and supporting our workforce are effective, as evidenced by current levels of applicants, team member tenure, and high levels of engagement reported through continuous survey feedback from Tyler team members. The COVID-19 pandemic had a significant impact on our human capital management practices as the majority of our workforce pivoted to work remotely in March 2020. Our team quickly adjusted to remotely develop for, sell to, implement and support our public sector clients.\nAt the end of 2020, Tyler’s U.S. workforce was 63% male and 37% female, and women represented 19% of Tyler’s leadership. In the U.S. our workforce was comprised as follows: 76% White, 8% Asian, 4% Hispanic or Latino, 5% Black or African American, and 7% Other. For our U.S. leadership, the breakdown was 86% White, 5% Asian, 3% Hispanic or Latino, 3% Black or African American, and 3% Other. We define leadership as positions which are one or two levels removed from our CEO with management responsibility. Race and gender reporting are based on information provided by team members. Voluntary workforce turnover (rolling 12-month attrition) was 6.5% as of December 31, 2020. The average tenure of our team members is approximately seven years and approximately 27% of our employees have been employed by Tyler for more than ten years.\nInvestments in Talent\nWe are committed to providing Tyler team members with the training and resources necessary to continually strengthen their skills. Our talent assessment and development programs provide managers and employees with the resources needed to achieve career goals, build management skills and lead their teams. Our TylerU online training platform provides team members with opportunities for continuous learning, professional training and development.\nOversight and Management\nOur Human Resources organization is tasked with leading our organization in managing employment-related matters, including recruiting and hiring, onboarding and training, compensation planning, talent management and development. Our executive team is responsible for periodically reviewing team member programs and initiatives, including healthcare and other benefits, as well as our management development and succession planning practices. Management periodically reports to the Board and its committees human capital measures and results that guide how we attract, retain and develop a workforce to enable our business strategies.\nHealth & Safety\nWe invest in the well-being of Tyler team members and their families. We provide a range of offerings in support of mental and emotional, financial, and physical health and wellness - not only for our team members, but also for the family members who depend on them. The COVID-19 pandemic created stressful conditions in 2020. In response to the pandemic, we implemented significant changes that we determined were in the best interest of our employees, including moving the vast majority of our employees to work from home, while implementing additional safety measures for employees continuing critical on-site work. In addition to safety protocols and the establishment of local site Return-To-Office teams, we:\na.Introduced enhanced mental health benefits and resources for team members and their families through our employee assistance programs in the U.S., Canada and the Philippines\nb.Covered telehealth visits for medical and mental health services at 100%\nc.Provided coverage of all COVID-19 testing and treatment under all Company medical plans at no cost to employees and dependents\nd.Provided unlimited paid time off for any team member who was awaiting or had received a positive COVID-19 test result or was unable to perform their duties from home, whether due to the nature of their work or a client request.\nDiversity and Inclusion\nWe believe that a diverse workforce is critical to our success, and we continue to monitor and improve the application of our hiring, retention, compensation and advancement processes for women and underrepresented populations across our workforce, including our team members of color, veterans and those who are LGBTQ. Our Women’s Leadership Network, Veteran’s Affinity groups, and local office diversity councils, among other programs, serve to enhance our inclusive and diverse culture. We continue to invest in recruiting diverse technical talent, in part through our partnership with the Ada Developer’s Academy, a non-profit, tuition-free coding school for women and gender diverse adults.\nIn 2020, our diversity, equity and inclusion (DEI) efforts included focused DEI discussions at the executive and local team levels, assessment of DEI effectiveness across the HR lifecycle, hiring manager training, the development of a Women’s Leadership Mentoring program, and support and advocacy for local DEI councils at Tyler. We encourage you to review our 2020 Corporate Responsibility Report located at http://www.tylertech.com for more detailed information regarding our Human Capital programs and initiatives.\nINTERNET WEBSITE AND AVAILABILITY OF PUBLIC FILINGS\nWe file annual, quarterly, current and other reports, proxy statements and other information with the Securities and Exchange Commission, or SEC, pursuant to the Securities Exchange Act. You may read and copy any materials we file with the SEC at the SEC’s Public Reference Room by calling the SEC at 1-800-732-0330. The SEC maintains an Internet site that contains reports, proxy and other information statements, and other information regarding issuers, including us, that file electronically with the SEC. The address of this site is http://www.sec.gov.\nWe also maintain a website at www.tylertech.com. We make available free of charge through this site our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Forms 4 and 5, Current Reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act as soon as reasonably practicable after we electronically file such material with, or furnish it to the SEC. In addition, copies of our annual report will be made available, free of charge, upon written request.\nOur “Code of Business Conduct and Ethics” is also available on our website. We intend to satisfy the disclosure requirements regarding amendments to, or waivers from, a provision of our Code of Business Conduct and Ethics by posting such information on our website.",
    "item_1A": "ITEM 1A. RISK FACTORS.\nAn investment in our common stock involves a high degree of risk. Investors evaluating our company should carefully consider the factors described below and all other information contained in this Annual Report. Any of the following factors could materially harm our business, operating results, and financial condition. Additional factors and uncertainties not currently known to us or that we currently consider immaterial could also harm our business, operating results, and financial condition. This section should be read in conjunction with the Financial Statements and related Notes and Management’s Discussion and Analysis of Financial Condition and Results of Operations included in this Annual Report. We may make forward-looking statements from time to time, both written and oral. We undertake no obligation to revise or publicly release the results of any revisions to these forward-looking statements. Our\nactual results may differ materially from those projected in any such forward-looking statements due to a number of factors, including those set forth below and elsewhere in this Annual Report.\nRisks Associated with Our Software Products\nCyber-attacks and security vulnerabilities can disrupt our business and harm our competitive position.\nThreats to IT security can take a variety of forms. Individuals and groups of hackers, and sophisticated organizations including state-sponsored organizations, may take steps that pose threats to our clients and our IT. They may, for example, develop and deploy malicious software to attack our products and services and/or gain access to our networks and data centers or act in a coordinated manner to launch distributed denial of service or other coordinated attacks. Cyber threats are constantly evolving, thereby increasing the difficulty of detecting and successfully defending against them. Cyber threats can have cascading impacts that unfold with increasing speed across our internal networks and systems and those of our partners and clients. Breaches of our network or data security could disrupt the security of our internal systems and business applications, impair our ability to provide services to our clients and protect the privacy of their data, result in product development delays, compromise confidential or technical business information harming our competitive position, result in theft or misuse of our intellectual property or other assets, require us to allocate more resources to improve technologies, or otherwise adversely affect our business. Our business policies and internal security controls may not keep pace with these evolving threats. Despite the network and application security, internal control measures, and physical security procedures we employ to safeguard our systems, we may still be vulnerable to a security breach, intrusion, loss or theft of confidential client data and transaction data or proprietary company information, which may harm our business, reputation and future financial results. The lost revenue and containment, remediation, investigation, legal and other costs could be significant and may exceed our insurance policy limits or may not be covered by insurance at all. Further, we may be subject to regulatory enforcement actions and litigation that could result in financial judgments or the payment of settlement amounts, and disputes with insurance carriers concerning coverage.\nOn September 29, 2020, we filed a Current Report on Form 8-K reporting a security incident (the \"Incident\") involving ransomware disrupting access to some of our internal IT systems and telephone systems. There is no evidence that the environments where we host client applications were affected, and our hosting services to those clients were not interrupted. There is also no evidence of malicious activity on client networks associated with the Incident. We contained the Incident and recovered from it, resuming normal operations with our clients. We will continue to deploy supplemental remediation efforts as necessary.\nAs part of our immediate response to the Incident, we (1) shut down points of access to external systems and began investigating and remediating the problem; (2) engaged outside IT security and forensics experts to conduct a detailed review and help securely restore affected systems; (3) implemented targeted monitoring systems to supplement the systems we already had in place; and (4) notified law enforcement. We have cooperated with their investigation throughout.\nWe promptly notified our clients of the Incident and provided timely updates to our clients through direct communications and updates to our website.\nAlthough we believe we have contained and recovered from the Incident, and that we have taken and will continue to take appropriate remediation steps, we are subject to risk and uncertainties as a result of the Incident. We believe we are in the final phases of our investigation, but there can be no assurance as to what the ongoing impact of the Incident will be, if any. The Incident caused an interruption in parts of our business. We incurred $4.2 million in third party costs associated with the Incident as of December 31, 2020. It is expected that we will continue to incur costs related to our response, remediation, and investigatory efforts relating to the Incident. We maintain cybersecurity insurance coverage in an amount that we believe is adequate.\nDisclosure of personally identifiable information and/or other sensitive client data could result in liability and harm our reputation.\nWe store and process increasingly large amounts of personally identifiable information and other confidential information of our clients. The continued occurrence of high-profile data breaches provides evidence of an external environment increasingly hostile to information security. Despite our efforts to improve security controls, it is possible our security controls over personal data, our training of employees on data security, and other practices we follow may not prevent the improper disclosure of sensitive client data that we store and manage. Disclosure of personally identifiable information and/or other sensitive client data could result in liability and harm our reputation.\nHosting services for some of our products are dependent upon the uninterrupted operation of data centers.\nA material portion of our business is provided through software hosting services. These hosting services depend on the uninterrupted operation of data centers and the ability to protect computer equipment and information stored in these data centers against damage that may be caused by natural disaster, fire, power loss, telecommunications or Internet failure, acts of terrorism, unauthorized intrusion, computer viruses, and other similar damaging events. If any of our data centers were to become inoperable for an extended period, we might be unable to fulfill our contractual commitments. Although we take what we believe to be reasonable precautions against such occurrences, we can give no assurance that damaging events such as these will not result in a prolonged interruption of our services, which could result in client dissatisfaction, loss of revenue, and damage to our business.\nWe run the risk of errors or defects with new products or enhancements to existing products.\nOur software products are complex and may contain errors or defects, especially when first introduced or when new versions or enhancements are released. Any such defects could result in a loss of revenues or delay market acceptance. Our license agreements typically contain provisions designed to limit our exposure to potential liability. However, it is possible we may not always successfully negotiate such provisions in our client contracts or the limitation of liability provisions may not be effective due to existing or future federal, state, or local laws, ordinances, or judicial decisions. Although we maintain errors and omissions and general liability insurance, and we try to structure contracts to limit liability, we cannot assure you that a successful claim could not be made or would not have a material adverse effect on our future operating results.\nWe must timely respond to technological changes to be competitive.\nThe market for our products is characterized by technological change, evolving industry standards in software technology, changes in client requirements, and frequent new product introductions and enhancements. The introduction of products embodying new technologies and the emergence of new industry standards can render existing products obsolete and unmarketable. As a result, our future success will depend, in part, upon our ability to enhance existing products and develop and introduce new products that keep pace with technological developments, satisfy increasingly sophisticated client requirements, and achieve market acceptance. We cannot assure you that we will successfully identify new product opportunities and develop and bring new products to market in a timely and cost-effective manner. The products, capabilities, or technologies developed by others could also render our products or technologies obsolete or noncompetitive. Our business may be adversely affected if we are unable to develop or acquire new software products or develop enhancements to existing products on a timely and cost-effective basis, or if such new products or enhancements do not achieve market acceptance.\nWe may be unable to protect our proprietary rights.\nMany of our product and service offerings incorporate proprietary information, trade secrets, know-how, and other intellectual property rights. We rely on a combination of contracts, copyrights, and trade secret laws to establish and protect our proprietary rights in our technology. We cannot be certain that we have taken all appropriate steps to deter misappropriation of our intellectual property. There has also been an apparent evolution in the legal standards and regulations courts and the U.S. patent office may apply in favorably evaluating software patent rights. We are not currently involved in any material intellectual property litigation; however, we may be a party to such litigation in the future to protect our proprietary information, trade secrets, know-how, and other intellectual property rights. We cannot assure you that third parties will not assert infringement or misappropriation claims against us with respect to current or future products. Any claims or litigation, with or without merit, could be time-consuming, costly, and a diversion to management. Any such claims and litigation could also cause product shipment delays or require us to enter into royalty or licensing arrangements. Such royalty or licensing arrangements, if required, may not be available on terms acceptable to us, if at all. Therefore, litigation to defend and enforce our intellectual property rights could have a material adverse effect on our business, regardless of the final outcome of such litigation.\nClients may elect to terminate our maintenance contracts and manage operations internally.\nIt is possible that our clients may elect to not renew maintenance contracts for our software, trying instead to maintain and operate the software themselves using their perpetual license rights (excluding software applications that we provide on a hosted or cloud basis). Alternatively, clients may elect to drop maintenance on certain modules that they ultimately decide not to use. This could adversely affect our revenues and profits. Additionally, they may inadvertently allow our intellectual property or other information to fall into the hands of third parties, including our competitors, which could adversely affect our business.\nMaterial portions of our business require the Internet infrastructure to be reliable.\nPart of our future success continues to depend on the use of the Internet as a means to access public information and perform transactions electronically, including, for example, electronic filing of court documents. This in part requires ongoing maintenance of the Internet infrastructure, especially to prevent interruptions in service, as well as additional development of that infrastructure. This requires a reliable network backbone with the necessary speed, data capacity, security, and timely development of complementary products for providing reliable Internet access and services. If this infrastructure fails to be sufficiently developed or be adequately maintained, our business would be harmed because users may not be able to access our government portals.\nRisks Associated with Selling Products and Services into the Public Sector Marketplace\nSelling products and services into the public sector poses unique challenges.\nWe derive substantially all of our revenues from sales of software and services to state, county, and city governments, other federal or municipal agencies, and other public entities. We expect that sales to public sector clients will continue to account for substantially all of our revenues in the future. We face many risks and challenges associated with contracting with governmental entities, including:\n•Resource limitations caused by budgetary constraints, which may provide for a termination of executed contracts due to a lack of future funding\n•Long and complex sales cycles\n•Contract payments at times being subject to achieving implementation milestones, and we may have differences with clients as to whether milestones have been achieved\n•Political resistance to the concept of contracting with third parties to provide IT solutions\n•Legislative changes affecting a local government’s authority to contract with third parties\n•Varying bid procedures and internal processes for bid acceptance\n•Various other political factors, including changes in governmental administrations and personnel\nEach of these risks is outside our control. If we fail to adequately adapt to these risks and uncertainties, our financial performance could be adversely affected.\nCOVID-19 will adversely affect our business and results of operations.\nWe expect that the continued global spread of COVID-19 (novel coronavirus) will negatively impact our business and financial results in fiscal year 2021. As the virus has spread, it has resulted in authorities implementing numerous measures to contain the virus, including travel bans and restrictions, quarantines, shelter-in-place orders, and business limitations and shutdowns. While we are unable to accurately predict the full impact that COVID-19 will have on our results from operations, financial condition, liquidity and cash flows due to numerous uncertainties, including the duration and severity of the pandemic and containment measures and associated compliance, we do expect the pandemic will continue to negatively impact our revenues and other financial results.\nBecause an increasing portion of our revenues are recurring, the effect of COVID-19 on our results of operations may also not be fully reflected for some time. We continue to see some impact on our business in the near term with delays in government procurement processes and uncertainty around public sector budgets, as well as delays in implementations caused by travel restrictions, closed offices, or clients shifting focus to more pressing issues.\nWe expect appraisal and software implementations projects to be delayed as clients put projects on hold or slow projects by extending go-live dates. While we have the ability to deliver most of our professional services remotely, some of our professional services, including appraisal assessments, are more effective when performed on-site, and certain clients may continue to insist on on-site services in any event. In addition, some professional services relate to training and require the availability of the client. We expect a negative impact on our software services and appraisal services revenues. Also, we expect software licenses and subscriptions revenues to be negatively affected due to delays in procurement processes. Some clients could request changes to payment terms, negatively impacting the timing of collections of accounts receivables in future periods. For the twelve months ended December 31, 2020, 73% of our total revenue and earnings are relatively predictable as a result of our subscription and maintenance revenue, which is recurring in nature; thus the effect of the COVID-19 pandemic will not be fully reflected in our results of operations and overall financial performance until future periods.\nWe perform our annual goodwill impairment analysis as of the first day of the second quarter of each year. Subsequent to our annual goodwill impairment analysis, we monitor for any events or changes in circumstances, such as significant adverse changes in business climate or operating results, changes in management’s business strategy, an inability to successfully introduce new products in the\nmarketplace, an inability to successfully achieve internal forecasts or significant declines in our stock price, which may represent an indicator of impairment. The occurrence of any of these events, which could be caused or impacted by the COVID-19 pandemic, may require us to record future goodwill impairment charges.\nA prolonged economic slowdown could harm our operations.\nA prolonged economic slowdown or recession could reduce demand for our software products and services. Governments may face financial pressures that could in turn affect our growth rate and profitability in the future. There is no assurance that government spending levels will be unaffected by declining or stagnant general economic conditions, and if budget shortfalls occur, they may negatively impact government IT spending and could adversely affect our business.\nThe open bidding process creates uncertainty in predicting future contract awards.\nMany governmental agencies purchase products and services through an open bidding process. Generally, a governmental entity will publish an established list of requirements requesting potential vendors to propose solutions for the established requirements. To respond successfully to these requests for proposals, we must accurately estimate our cost structure for servicing a proposed contract, the time required to establish operations for the proposed client, and the likely terms of any other third-party proposals submitted. We cannot guarantee that we will win any bids in the future through the request for proposal process, or that any winning bids will ultimately result in contracts on favorable terms. Our failure to secure contracts through the open bidding process, or to secure such contracts on favorable terms, may adversely affect our revenue and gross margins.\nWe face significant competition from other vendors and potential new entrants into our markets.\nWe believe we are a leading provider of integrated solutions for the public sector. However, we face competition from a variety of software vendors that offer products and services similar to those offered by us, as well as from companies offering to develop custom software. We compete based on a number of factors, including:\n•The attractiveness of our “evergreen” business strategy\n•The breadth, depth, and quality of our product and service offerings\n•The ability to modify our offerings to accommodate particular clients’ needs\n•Technological innovation\n•Name recognition, reputation and references\n•Price\n•Our financial strength and stability\nWe believe our market is highly fragmented with a large number of competitors that vary in size, product platform, and product scope. Our competitors include consulting firms, publicly held companies that focus on selected segments of the public sector market, and a significant number of smaller, privately held companies. Certain competitors have greater technical, marketing, and financial resources than we do. We cannot assure you that such competitors will not develop products or offer services that are superior to our products or services or that achieve greater market acceptance.\nWe also compete with internal, centralized IT departments of governmental entities, which requires us to persuade the end-user to stop the internal service and outsource to us. In addition, our clients and prospective clients could elect to provide information management services internally through new or existing departments, which could reduce the market for our services.\nWe could face additional competition as other established and emerging companies enter the public sector software application market and new products and technologies are introduced. Increased competition could result in pricing pressure, fewer client orders, reduced gross margins, and loss of market share. Current and potential competitors may make strategic acquisitions or establish cooperative relationships among themselves or with third parties, thereby increasing the ability of their products to address the needs of our prospective clients. It is possible that new competitors or alliances may emerge and rapidly gain significant market share. We cannot assure you that we will be able to compete successfully against current and future competitors, and the failure to do so would have a material adverse effect upon our business.\nFixed-price contracts may affect our profits.\nSome of our contracts are structured on a fixed-price basis, which can lead to various risks, including:\n•The failure to accurately estimate the resources and time required for an engagement\n•The failure to effectively manage our clients’ expectations regarding the scope of services delivered for a fixed fee\n•The failure to timely and satisfactorily complete fixed-price engagements within budget\nIf we do not adequately assess and manage these and other risks, we may be subject to cost overruns and penalties, which may harm our financial performance.\nChanges in the insurance markets may affect our business.\nSome of our clients, primarily those for our property appraisal services, require that we secure performance bonds before they will select us as their vendor. In addition, we have in the past been required to provide letters of credit as security for the issuance of a performance bond. We cannot guarantee that we will be able to secure such performance bonds in the future on terms that are favorable to us, if at all. Our inability to obtain performance bonds on favorable terms or at all could impact our future ability to win some contract awards, particularly large property appraisal services contracts, which could negatively impact revenues. In addition, the general insurance markets may experience volatility and/or restrictive coverage trends, which may lead to future increases in our general and administrative expenses and negatively impact our operating results.\nRisks Associated with Our Periodic Results and Stock Price\nFluctuations in quarterly revenue could adversely impact our operating results and stock price.\nOur revenues and operating results are difficult to predict and may fluctuate substantially from quarter to quarter for a variety of reasons, including:\n•Prospective clients’ contracting decisions are often made in the last few weeks of a quarter\n•The size of license transactions can vary significantly\n•Clients may unexpectedly postpone or cancel procurement processes due to changes in strategic priorities, project objectives, budget, or personnel\n•Client purchasing processes vary significantly and a client’s internal approval, expenditure authorization, and contract negotiation processes can be difficult and time consuming to complete, even after selection of a vendor\n•The number, timing, and significance of software product enhancements and new software product announcements by us and our competitors may affect purchase decisions\n•We may have to defer revenues under our revenue recognition policies and GAAP\n•Clients may elect subscription-based arrangements, which result in lower software license revenues in the initial year as compared to traditional, on-premise software license arrangements, but generate higher overall subscription-based revenues over the term of the contract\nIn each fiscal quarter, our expense levels, operating costs, and hiring plans are based to some extent on projections of future revenues and are relatively fixed. If our actual revenues fall below expectations, we could experience a reduction in operating results. Also, if actual revenues or earnings for any given quarter fall below expectations, it may lead to a decline in our stock price.\nIncreases in service revenue as a percentage of total revenues could decrease overall margins.\nWe realize lower margins on software and appraisal service revenues than on license revenue. The majority of our contracts include both software licenses and software services. Therefore, an increase in the percentage of software service and appraisal service revenue compared to license revenue could have a detrimental impact on our overall gross margins and could adversely affect operating results.\nIncreases in investment in research and development could decrease overall margins.\nAn important element of our corporate strategy is to continue to dedicate a significant amount of resources to research and development and related product and service opportunities both through internal investments and the acquisition of intellectual property from companies that we have acquired. We believe that we must continue to dedicate a significant amount of resources to our research and development efforts to maintain our competitive position and research and development expenses could adversely affect operating margins.\nOur stock price may be volatile.\nThe market price of our common stock may be volatile. Examples of factors that may significantly impact our stock price include:\n•Actual or anticipated fluctuations in our operating results\n•Announcements of technological innovations, new products, or new contracts by us or our competitors\n•Developments with respect to patents, copyrights, or other proprietary rights\n•Conditions and trends in the software and other technology industries\n•Adoption of new accounting standards\n•Changes in financial estimates by securities analysts\n•General market conditions and other factors\nIn addition, the stock market has from time to time experienced significant price and volume fluctuations that have particularly affected the market prices of technology company stocks and may in the future adversely affect the market price of our stock. Sometimes, securities class action litigation is filed following periods of volatility in the market price of a particular company’s securities. We cannot assure you that similar litigation will not occur in the future with respect to us. Such litigation could result in substantial costs and a diversion of management’s attention and resources, which could have a material adverse effect upon our financial performance.\nOur financial outlook may not be realized.\nFrom time to time, in press releases and otherwise, we may publish forecasts or other forward-looking statements regarding our results, including estimated revenues or earnings. Any forecast of our future performance reflects various assumptions. These assumptions are subject to significant uncertainties, and as a matter of course, any number of them may prove to be incorrect. Further, the achievement of any forecast depends on numerous risks and other factors (including those described in this discussion), many of which are beyond our control. As a result, we cannot be certain that our performance will be consistent with any management forecasts or that the variation from such forecasts will not be material and adverse. Current and potential stockholders are cautioned not to base their entire analysis of our business and prospects upon isolated predictions, but instead are encouraged to utilize our entire publicly available mix of historical and forward-looking information, as well as other available information regarding us, our products and services, and the software industry when evaluating our prospective results of operations.\nRisks Associated with Our Growth Strategy and Other General Corporate Risks\nWe may experience difficulties in executing our acquisition strategy.\nA material portion of our historical growth has resulted from strategic acquisitions. Although our focus is on internal growth, we will continue to identify and pursue strategic acquisitions with suitable candidates. These transactions involve significant challenges and risks, including risks that a transaction does not advance our business strategy; that we do not achieve the expected return on our investment; that we have difficulty integrating business systems and technology; that we have difficulty retaining or integrating new employees; that the transactions distract management from our other businesses; that we acquire unforeseen liabilities; and other unanticipated events. Our future success will depend, in part, on our ability to successfully integrate future acquisitions into our operations. It may take longer than expected to realize the full benefits of these transactions, such as increased revenue, enhanced efficiencies, or increased market share, or the benefits may be ultimately less than we expected. Although we conduct due diligence reviews of potential acquisition candidates, we may not identify all material liabilities or risks related to acquisition candidates. There can be no assurance that any such strategic acquisitions will be accomplished on favorable terms or will result in profitable operations.\nOur failure to properly manage growth could adversely affect our business.\nWe continue to expand our operations by pursuing existing and potential market opportunities. This growth places significant demands on management and operational resources. In order to manage growth effectively, we must implement and improve our operational systems, procedures, and controls on a timely basis. If we fail to implement these systems, our business may be materially adversely affected.\nWe may be unable to hire, integrate, and retain qualified personnel.\nOur continued success will depend upon the availability and performance of our key management, sales, marketing, client support, and product development personnel. The loss of key management or technical personnel could adversely affect us. We believe that our continued success will depend in large part upon our ability to attract, integrate, and retain such personnel. We have at times experienced and continue to experience challenges, in recruiting qualified personnel. Competition for qualified software development, sales, and other personnel is intense, and we cannot assure you that we will be successful in attracting and retaining such personnel.\nCompliance with changing regulation of corporate governance may result in additional expenses.\nChanging laws, regulations, and standards relating to corporate governance, compliance, and public disclosure can create uncertainty for public companies. The costs required to comply with such evolving laws across the various states and at the federal level are difficult to predict and/or harmonize. To maintain high standards of corporate governance, compliance, and public disclosure, we intend to invest all reasonably necessary resources to comply with evolving standards.This investment may result in an unforeseen increase in general and administrative expenses and a diversion of management’s time and attention from revenue-generating activities, which may harm our operating results.\nWe don’t foresee paying dividends on our common stock.\nWe have not declared nor paid a cash dividend since we entered the business of providing software solutions and services to the public sector in 1998. We intend to retain earnings for use in the operation and expansion of our business. We do not anticipate paying any cash dividends on our common stock in the foreseeable future.\nProvisions in our certificate of incorporation, bylaws, and Delaware law could deter takeover attempts.\nOur board of directors may issue up to 1,000,000 shares of preferred stock and may determine the price, rights, preferences, privileges, and restrictions, including voting and conversion rights, of these preferred shares. These determinations may be made without any further vote or action by our stockholders. The rights of the holders of our common stock will be subject to, and may be adversely affected by, the rights of the holders of any preferred stock that may be issued in the future. The issuance of preferred stock may make it more difficult for a third-party to acquire a majority of our outstanding voting stock. In addition, some provisions of our Certificate of Incorporation, Bylaws, and the Delaware General Corporation Law could also delay, prevent, or make more difficult a merger, tender offer, or proxy contest involving us.",
    "item_1B": "ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNot applicable.",
    "item_2": "ITEM 2. PROPERTIES.\nWe occupy a total of approximately 1.1 million square feet of office space, of which approximately 746,000 square feet is in various office facilities we own. We own or lease offices for our major operations in the states of Arizona, Arkansas, California, Colorado, Connecticut, Georgia, Illinois, Iowa, Maine, Massachusetts, Michigan, Missouri, Montana, New Hampshire, New York, North Carolina, Ohio, Tennessee, Texas, Virginia, Washington, Washington D.C., Wisconsin, Ontario and British Columbia, Canada, the Philippines and the Bahamas.",
    "item_3": "ITEM 3. LEGAL PROCEEDINGS.\nOther than routine litigation incidental to our business, there are no material legal proceedings pending to which we are party or to which any of our properties are subject.",
    "item_4": "ITEM 4. SUBMISSION OF MATTERS TO A VOTE OF SECURITY HOLDERS.\nNot applicable.\nPART II",
    "item_5": "ITEM 5. MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nOur common stock is traded on the New York Stock Exchange under the symbol “TYL”. At December 31, 2020, we had approximately 1,143 stockholders of record. Most of our stockholders hold their shares in street name; therefore, there are substantially more than 1,143 beneficial owners of our common stock.\nWe did not pay any cash dividends in 2020 or 2019. Our bank credit agreement contains restrictions on the payment of cash dividends. We intend to retain earnings for use in the operation and expansion of our business and do not anticipate paying a cash dividend in the foreseeable future.\nThe following table summarizes certain information related to our stock incentive plan, restricted stock units and our employee stock purchase plan. There are no warrants or rights related to our equity compensation plans as of December 31, 2020.\nNumber of securities to\nbe issued upon exercise\nof outstanding options, warrants, purchase rights\nand vesting of restricted stock units as of\nDecember 31, 2020\nWeighted average\nexercise price of outstanding options\nand unvested restricted stock units Number of securities remaining available for\nfuture issuance under\nequity compensation\nplans (excluding securities reflected in initial column\nas of December 31, 2020)\nPlan Category\nEquity compensation plans\napproved by security\nshareholders:\n2018 Incentive Stock Plan 2,763,414 $ 203.05 2,480,878\nEmployee Stock Purchase Plan 8,186 371.04 663,502\nEquity compensation plans not\napproved by security\nshareholders\n- - -\n2,771,600 $ 203.55 3,144,380\nAs of December 31, 2020, we had authorization to repurchase up to approximately 2.5 million additional shares of Tyler common stock. During 2020, we purchased approximately 59,000 shares of our common stock for an aggregate purchase price of $15.5 million.\nA summary of the repurchase activity during 2020 is as follows:\nPeriod Total number of shares repurchased Additional number of shares authorized that may be repurchased Average price paid per share Maximum number of shares that may be repurchased under current authorization\nThree months ended March 31 58,804 - $ 263.26 2,505,472\nThree months ended June 30 - - - 2,505,472\nThree months ended September 30 7 - 361.19 2,505,465\nOctober 1 through October 31 - - - 2,505,465\nNovember 1 through November 30 - - - 2,505,465\nDecember 1 through December 31 - - - 2,505,465\n58,811 - $ 263.27\nThe repurchase program, which was approved by our board of directors, was announced in October 2002, and was amended at various times from 2003 through 2019. There is no expiration date specified for the authorization, and we intend to repurchase stock under the program from time to time.\nAs of February 19, 2021, we had remaining authorization to repurchase up to 2.5 million additional shares of our common stock.\nPerformance Graph\nThe following Performance Graph and related information shall not be deemed “soliciting material” or to be “filed” with the Securities and Exchange Commission, nor shall such information be incorporated by reference into any future filing under the Securities Act of 1933 or Securities Exchange Act of 1934, each as amended, except to the extent that we specifically incorporate it by reference into such filing.\nThe following table compares total shareholder returns for Tyler over the last five years to the Standard and Poor’s 500 Stock Index and the Standard and Poor’s 600 Information Technology Index assuming a $100 investment made on December 31, 2015. Each of the three measures of cumulative total return assumes reinvestment of dividends. The stock performance shown on the graph below is not necessarily indicative of future price performance.\nCompany / Index 12/31/15 12/31/16 12/31/17 12/31/18 12/31/19 12/31/20\nTyler Technologies, Inc. 100 81.90 101.57 106.60 172.11 250.41\nS&P 500 Stock Index 100 111.96 136.40 130.42 171.49 203.04\nS&P 600 Information Technology Index 100 133.85 147.62 134.43 187.65 239.83",
    "item_6": "ITEM 6.\nThis section has been eliminated as a result of adopting the November 19, 2020 amendment to Item 301 of Regulation S-K.",
    "item_7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nThe following discussion and analysis should be read in conjunction with our consolidated financial statements and related notes included in Item 8 of this Annual Report on Form 10-K. For a comparison of our Results of Operations for the years ended December 31, 2019 and 2018 and our Cash Flow discussion for the year ended December 2019, see “Part II, Item 7. Management's Discussion and Analysis of Financial Conditions and Results of Operations” of our Annual Report on Form 10-K for the year ended December 2019 as filed with the SEC on February 20, 2020.\nFORWARD-LOOKING STATEMENTS\nThis document contains “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934 that are not historical in nature and typically address future or anticipated events, trends, expectations or beliefs with respect to our financial condition, results of operations or business. Forward-looking statements often contain words such as “believes,” “expects,” “anticipates,” “foresees,” “forecasts,” “estimates,” “plans,” “intends,” “continues,” “may,” “will,” “should,” “projects,” “might,” “could” or other similar words or phrases. Similarly, statements that describe our business strategy, outlook, objectives, plans, intentions or goals also are forward-looking statements. We believe there is a reasonable basis for our forward-looking statements, but they are inherently subject to risks and uncertainties and actual results could differ materially from the expectations and beliefs reflected in the forward-looking statements. We presently consider the following to be among the important factors that could cause actual results to differ materially from our expectations and beliefs: (1) the effects of the COVID-19 pandemic, including its potential effects on the economic environment, our customers and our operations, as well as any changes to federal, state or local government laws, regulations or orders in connection with the pandemic; (2) changes in the budgets or regulatory environments of our clients, primarily local and state governments, that could negatively impact information technology spending; (3) disruption to our business and harm to our competitive position resulting from cyber-attacks and security vulnerabilities; (4) our ability to protect client information from security breaches and provide uninterrupted operations of data centers; (5) our ability to achieve growth or operational synergies through the integration of acquired businesses, while avoiding unanticipated costs and disruptions to existing operations; (6) material portions of our business require the Internet infrastructure to be adequately maintained; (7) our ability to achieve our financial forecasts due to various factors, including project delays by our clients, reductions in transaction size, fewer transactions, delays in delivery of new products or releases or a decline in our renewal rates for service agreements; (8) general economic, political and market conditions; (9) technological and market risks associated with the development of new products or services or of new versions of existing or acquired products or services; (10) competition in the industry in which we conduct business and the impact of competition on pricing, client retention and pressure for new products or services; (11) the ability to attract and retain qualified personnel and dealing with the loss or retirement of key members of management or other key personnel; and (12) costs of compliance and any failure to comply with government and stock exchange regulations. A detailed discussion of these factors and other risks that affect our business are described in Item 1A, “Risk Factors”. We expressly disclaim any obligation to publicly update or revise our forward-looking statements.\nOVERVIEW\nGeneral\nWe provide integrated information management solutions and services for the public sector, with a focus on local governments. We develop and market a broad line of software products and services to address the IT needs of cities, counties, schools and other local government entities. In addition, we provide professional IT services to our clients, including software and hardware installation, data conversion, training and for certain clients, product modifications, along with continuing maintenance and support for clients using our systems. We also provide subscription-based services such as software as a service (“SaaS”), which primarily utilize the Tyler private cloud, and electronic document filing solutions (“e-filing”), which simplify the filing and management of court related documents. Revenues for e-filing are derived from transaction fees and, in some cases, fixed fee arrangements. Other transaction-based fees primary relate to online payment services. We also provide property appraisal outsourcing services for taxing jurisdictions.\nOur products generally automate eight major functional areas: (1) financial management and education, (2) courts and justice, (3) public safety, (4) property appraisal and tax, (5) planning, regulatory and maintenance, (6) land and vital records management, (7) data and insights and (8) platform technologies. We report our results in two segments. The Enterprise Software (\"ES\") segment provides public sector entities with software systems and services to meet their information technology and automation needs for mission-critical “back-office” functions such as: financial management and education, courts and justice, public safety, planning, regulatory and maintenance, data and insights and platform technologies. The Appraisal and Tax (“A&T”) segment provides systems and software that automate the appraisal and assessment of real and personal property, land and vital records management as well as property appraisal outsourcing services for local governments and taxing authorities. Property appraisal outsourcing services include: the physical inspection of commercial and residential properties; data collection and processing; computer analysis for property valuation; preparation of tax rolls; community education; and arbitration between taxpayers and the assessing jurisdiction.\nAs of January 1, 2020, the land and vital records management business unit, which was previously reported in the ES segment, was moved to the A&T segment to reflect changes in the way in which management makes operating decisions, allocates resources, and manages the growth and profitability of the Company. Prior year amounts for the ES and A&T segments have been adjusted to reflect the segment change. See Note 14 - \"Segment and Related Information\" in the notes to the consolidated financial statements for additional information.\nFor the twelve months ended December 31, 2020, total revenues increased 2.8% compared to the prior year. Excluding the impact of acquisitions, total revenues increased 1.4% compared to prior year. Revenues from acquisitions contributed 1.4% of growth for the twelve months ended December 31, 2020.\nSubscriptions revenue grew 18.3% for the twelve months ended December 31, 2020, due to a gradual shift toward cloud-based, software as a service business, as well as continued strong growth in our transaction-based revenues from online payments and e-filing revenues from courts. Excluding the impact of recent acquisitions, subscriptions revenue increased 17.2% for the twelve months ended December 31, 2020.\nOur backlog at December 31, 2020 was $1.59 billion, a 9.4% increase from last year.\nWe monitor and analyze several key performance indicators in order to manage our business and evaluate our financial and operating performance. These indicators include the following:\nRevenues - We derive our revenues from five primary sources: sale of software licenses and royalties; subscription-based arrangements; software services; maintenance; and appraisal services. Subscriptions and maintenance are considered recurring revenue sources and comprised approximately 73.3% of our revenue in 2020. The number of new SaaS clients and the number of existing clients who convert from our traditional software arrangements to our SaaS model are a significant driver of our revenue growth, together with new software license sales and maintenance rate increases. In addition, we also monitor our customer base and churn as we historically have experienced very low customer turnover. During 2020, based on our number of customers, turnover was approximately 2%.\nCost of Revenues and Gross Margins - Our primary cost component is personnel expenses in connection with providing software implementation, subscription-based services, maintenance and support, and appraisal services to our clients. We can improve gross margins by controlling headcount and related costs and by expanding our revenue base, especially from those products and services that produce incremental revenue with minimal incremental cost, such as software licenses and royalties, subscription-based services, and maintenance and support. Our appraisal projects are cyclical in nature, and we often employ appraisal personnel on a short-term basis to coincide with the life of a project. As of December 31, 2020, our total employee count increased to 5,536 from 5,368 at December 31, 2019.\nSelling, General and Administrative (“SG&A”) Expenses - The primary components of SG&A expenses are administrative and sales personnel salaries and commissions, share-based compensation expense, marketing expense, rent and professional fees. Sales commissions typically fluctuate with revenues and share-based compensation expense generally increases as the market price of our stock increases. Other administrative expenses tend to grow at a slower rate than revenues.\nLiquidity and Cash Flows - The primary driver of our cash flows is net income. Uses of cash include acquisitions, capital investments in property and equipment and discretionary purchases of treasury stock. Our working capital needs are fairly stable throughout the year with the significant components of cash outflows being payment of personnel expenses offset by cash inflows representing collection of accounts receivable and cash receipts from clients in advance of revenue being earned. In recent years, we have also received significant amounts of cash from employees exercising stock options and contributing to our Employee Stock Purchase Plan.\nBalance Sheet - Cash, accounts receivable and days sales outstanding and deferred revenue balances are important indicators of our business.\nImpact of the COVID-19 Pandemic\nIn March 2020, the World Health Organization declared the outbreak of a COVID-19 pandemic, which continues to spread throughout the U.S. and the world and has resulted in authorities implementing numerous measures to contain the virus, including travel bans and restrictions, quarantines, shelter-in-place orders, and business limitations and shutdowns. While we are unable to accurately predict the full impact that COVID-19 will have on our results from operations, financial condition, liquidity and cash flows due to numerous uncertainties, including the duration and severity of the pandemic and containment measures and associated compliance, the current environment has negatively impacted our revenues for fiscal year 2020.\nBecause an increasing portion of our revenues are recurring, the effect of COVID-19 on our results of operations may also not be fully reflected for some time. We continue to see some impact on our business in the near term with delays in government procurement processes and uncertainty around public sector budgets, as well as delays in implementations caused by travel restrictions, closed offices, or clients shifting focus to more pressing issues. We have addressed those challenges through adapting the way we do business - encouraging web and video conferencing, conducting virtual sales demonstrations and delivering professional services remotely.\nOur priorities during this crisis are protecting the health and safety of our employees and our clients. Our IT systems and applications support a remote workforce. Prior to the pandemic, many of our employees worked remotely. In response to the pandemic, we encouraged all employees who are able to do so to work from home, equipping them with resources necessary to continue uninterrupted. We were able to transition the vast majority of our employees to this work-from-home posture. This reduces the number of team members in our offices to those uniquely needed for essential on-site services, such as network operations support staff, and allows for “social distancing” as directed by the Centers for Disease Control (\"CDC\").\nThe pandemic has delayed some government procurement processes and is expected to impact our ability to complete certain implementations, negatively impacting our revenue. It could also negatively impact the timing of client payments to us. We continue to monitor these trends in order to respond to the ever-changing impact of COVID-19 on our clients and Tyler’s operations.\nFor the twelve months ended December 31, 2020, the impact of the COVID-19 pandemic resulted in lower revenues from software licenses, software services, appraisal services, and other revenues. Lower software licenses compared to prior periods are attributed to slower sales cycles as government procurement processes are delayed and contract signings have been pushed to future periods. Software services and appraisal services revenue declines are attributed to delays in implementations caused by travel restrictions and shelter-in-place orders in effect during the period. Other revenues were lower compared to prior periods primarily as a result of the cancellation of our 2020 Connect user conference. Lower revenues compared to prior periods were offset by cost savings attributed to lower spend on travel, user conferences and trade show expenses, health claims and other employee-related expenses. If and as travel restrictions are relaxed, we expect software services and appraisal services revenues to increase as the limited number of our clients who require that all or a portion of their services be delivered onsite will be able to receive those services. Also, we are adapting by changing the way we do business, encouraging web and video conferencing, conducting virtual sales demonstrations and delivering professional services remotely, which result in increases in staff utilization rates and billable time.\nRecurring revenues from subscriptions and maintenance comprised 73.3% of our total consolidated revenue for the twelve months ended December 31, 2020, and include transaction-based revenue streams such as e-filing and online payments. As of December 31, 2020, we had $758.5 million in cash and investments and no outstanding borrowings under our credit facility. We also have substantial additional liquidity available through our undrawn $400 million credit facility, which can be expanded through an accordion feature. During the second quarter of 2020, we completed our annual assessment of goodwill which did not result in an impairment charge. Since our assessment in the second quarter of 2020, we have recorded no impairment to goodwill as no triggering events or changes in circumstances occurred as of period-end. No impairments of other assets were recorded as of the balance sheet date as no triggering events or changes in circumstances indicating a potential impairment have occurred as of period-end to require such an impairment; however, due to significant uncertainty surrounding the pandemic and market conditions, management’s judgment regarding this could change in the future.\nSecurity Incident\nOn September 29, 2020, we filed a Current Report on Form 8-K reporting a security incident (the \"Incident\") involving ransomware disrupting access to some of our internal IT systems and telephone systems. There is no evidence that the environments where we host client applications were affected, and our hosting services to those clients were not interrupted. There is also no evidence of malicious activity on client networks associated with the Incident. We contained the Incident and recovered from it, resuming normal operations with our clients. We will continue to deploy supplemental remediation efforts as necessary.\nAs part of our immediate response to the Incident, we (1) shut down points of access to external systems and began investigating and remediating the problem; (2) engaged outside IT security and forensics experts to conduct a detailed review and help securely restore affected systems; (3) implemented targeted monitoring systems to supplement the systems we already had in place; and (4) notified law enforcement. We are have cooperated with their investigation throughout.\nWe promptly notified our clients of the Incident and provided timely updates to our clients through direct communications and updates to our website.\nAlthough we believe we have contained and recovered from the Incident, and that we have taken and will continue to take appropriate remediation steps, we are subject to risk and uncertainties as a result of the Incident. We believe we are in the final phases of our investigation, but there can be no assurance as to what the ongoing impact of the Incident will be, if any. The Incident caused an interruption in parts of our business. We estimate that as a result of the Incident, revenue (primarily software services) for the year ended December 31, 2020 was reduced by approximately $1.5 million; however, insurance reimbursements pertaining to lost revenue represent a contingent gain and any recovery of these revenues will be recorded when received. We incurred $4.2 million in costs associated with the Incident as of December 31, 2020. As of December 31, 2020, we have recorded $1.1 million of accrued insurance recoveries and received $2.4 million of insurance recoveries related to the Incident. The recorded costs consisted primarily of payments to third-party service providers and consultants, including legal fees, and enhancements to our cybersecurity measures. It is expected that we will continue to incur costs related to our response, remediation, and investigatory efforts relating to the Incident. We maintain cybersecurity insurance coverage in an amount that we believe is adequate.\nRecent adoption of new accounting pronouncements\nIn June 2016, the FASB issued ASU 2016-13, Financial Instruments - Credit Losses, (“ASU 2016-13”). ASU 2016-13 changes the impairment model for most financial assets and certain other instruments, including trade and other receivables, available for-sale debt securities, held-to-maturity debt securities and loans, and requires entities to use a new forward-looking expected loss model that will result in the earlier recognition of an allowance for losses. This update is effective for fiscal years beginning after December 15, 2019, including interim periods within those fiscal years. Early adoption is permitted for a fiscal year beginning after December 15, 2018, including interim periods within that fiscal year. Entities apply the standard’s provisions as a cumulative-effect adjustment to retained earnings as of the beginning of the first reporting period in which the guidance is adopted. As of January 1, 2020, we adopted the new standard with no material impact of credit losses to our trade and other receivables, held-to-maturity debt securities and retained earnings included in our consolidated financial statements.\nOn January 26, 2017, the FASB issued ASU No. 2017-04, Simplifying the Test for Goodwill Impairment. The new standard eliminates Step 2 from the goodwill impairment test. An entity should recognize a goodwill impairment charge for the amount by which the carrying amount exceeds the reporting unit's fair value. This standard is effective for public business entities in fiscal years beginning after December 15, 2019, and the standard was adopted and applied prospectively by the Company as of January 1, 2020, but it did not have a significant impact on the Company's financial statements and disclosures.\nRecent Accounting Guidance not yet Adopted\nIn December 2019, the FASB issued ASU 2019-12, Simplifying the Accounting for Income Taxes, (\"ASU 2019-12\") which simplifies the accounting for income taxes, eliminates certain exceptions within ASC 740, Income Taxes, and clarifies certain aspects of the current guidance to promote consistency among reporting entities. The new standard is effective for fiscal years beginning after December 15, 2020. Most amendments within the standard are required to be applied on a prospective basis, while certain amendments must be applied on a retrospective or modified retrospective basis. We do not expect adoption of this standard to have a material effect on our consolidated financial statements.\nOutlook\nThe local government software market continues to be active, and our backlog at December 31, 2020 reached $1.59 billion, a 9.4% increase from the prior year. We expect to continue to achieve solid growth in revenue and earnings. With our strong financial position and cash flow, we plan to continue to make significant investments in product development to better position us to continue to expand our addressable market and strengthen our competitive position in the public sector software market over the long term.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nOur discussion and analysis of financial condition and results of operations is based upon our financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States (“GAAP”). The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets and liabilities at the date of the financial statements, the reported amounts of revenues, cost of revenues and expenses during the reporting period, and related disclosure of contingencies. The Notes to the Financial Statements included as part of this Annual Report describe our significant accounting policies used in the preparation of the financial statements. Significant items subject to such estimates and assumptions include the application of the progress toward completion methods of revenue recognition, estimated standalone selling price (\"SSP\") for distinct performance obligations, the carrying amount and estimated useful lives of intangible assets, determination of share-based compensation expense and valuation allowance for receivables. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nWe believe the following critical accounting policies require significant judgments and estimates used in the preparation of our financial statements.\nRevenue Recognition. We earn revenue from software licenses, royalties, subscription-based services, software services, post-contract customer support (“PCS” or “maintenance”), hardware, and appraisal services. Revenue is recognized upon transfer of control of promised products or services to customers in an amount that reflects the consideration we expect to receive in exchange for those products or services. We determine revenue recognition through the following steps:\n•Identification of the contract, or contracts, with a customer\n•Identification of the performance obligations in the contract\n•Determination of the transaction price\n•Allocation of the transaction price to the performance obligations in the contract\n•Recognition of revenue when, or as, we satisfy a performance obligation\nMost of our software arrangements with customers contain multiple performance obligations that range from software licenses, installation, training, and consulting to software modification and customization to meet specific customer needs (services), hosting, and PCS. For these contracts, we account for individual performance obligations separately when they are distinct. We evaluate whether separate performance obligations can be distinct or should be accounted for as one performance obligation. Arrangements that include software services, such as training or installation, are evaluated to determine whether the customer can benefit from the services either on their own or together with other resources readily available to the customer and whether the services are separately identifiable from other promises in the contract. Many of our software arrangements involve “off-the-shelf” software. We recognize the revenue allocable to \"off-the-shelf\" software licenses and specified upgrades at a point in time when control of the software license transfers to the customer, unless the software is not considered distinct. We consider off-the-shelf software to be distinct when it can be added to an arrangement with minor changes in the underlying code, it can be used by the customer for the customer’s purpose upon installation, and remaining services such as training are not considered highly interdependent or highly interrelated to the product's functionality.\nFor arrangements that involve significant production, modification or customization of the software, or where software services are otherwise not considered distinct, we recognize revenue over time by measuring progress-to-completion. We measure progress-to-completion primarily using labor hours incurred as it best depicts the transfer of control to the customer which occurs as we incur costs on our contracts. These arrangements are often implemented over an extended period and occasionally require us to revise total cost estimates. Amounts recognized in revenue are calculated using the progress-to-completion measurement after giving effect to any changes in our cost estimates. Changes to total estimated contract costs, if any, are recorded in the period they are determined. Estimated losses on uncompleted contracts are recorded in the period in which we first determine that a loss is apparent. When software services are distinct, the fee allocable to the service element is recognized over the time we perform the services and is billed on a time and material or milestones basis.\nSubscription-based services consist of revenues derived from SaaS arrangements, which primarily utilize the Tyler private cloud, and electronic filing transactions. Revenue from subscription-based services is generally recognized over time on a ratable basis over the contract term, beginning on the date that our service is made available to the customer. For SaaS arrangements, we evaluate whether the customer has the contractual right to take possession of our software at any time during the hosting period without significant penalty and whether the customer can feasibly maintain the software on the customer’s hardware or enter into another arrangement with a third-party to host the software. We allocate contract value to each performance obligation of the arrangement that qualifies for treatment as a distinct element based on estimated SSP. We recognize SaaS arrangements ratably over the term of the arrangement, which range from one to ten years, but are typically for a period of three to five years. For software services associated with certain SaaS arrangements, we have concluded that the services are not distinct, and we recognize the revenue ratably over the remaining contractual period once we have provided the customer access to the software. We record amounts that have been invoiced in accounts receivable and in deferred revenue or revenues, depending on whether the revenue recognition criteria have been met.\nThe transaction price is allocated to the separate performance obligations on a relative SSP basis. We determine the SSP based on our overall pricing objectives, taking into consideration market conditions and other factors, including the value of our contracts, the applications sold, customer demographics, and the number and types of users within our contracts. We use a range of amounts to estimate SSP when we sell each of the products and services separately and need to determine whether there is a discount to be allocated based on the relative SSP of the various products and services. In instances where SSP is not directly observable, such as when we do not sell the product or service separately, we determine SSP using the expected cost-plus margin approach. Revenue is recognized net of allowances for sales adjustments and any taxes collected from customers, which are subsequently remitted to governmental authorities.\nTypically, the structure of our arrangements does not give rise to variable consideration. However, in those instances whereby variable consideration exists, we include in our estimates additional revenue for variable consideration when we believe we have an enforceable right, the amount can be estimated reliably and its realization is probable.\nWe maintain allowances for losses and sales adjustments, which are provided at the time the revenue is recognized. Since most of our customers are domestic governmental entities, we rarely incur a loss resulting from credit risk associated with the inability of a customer to make required payments. Events or changes in circumstances that indicate that the carrying amount for the allowances for losses and sales adjustments may require revision include, but are not limited to, deterioration of a customer’s financial condition, failure to manage our customer’s expectations regarding the scope of the services to be delivered, and defects or errors in new versions or enhancements of our software products. The allowance for losses and sales adjustments reflects our best estimate of probable losses inherent in the accounts receivable balance. We determine the allowance based on known troubled accounts, historical experience, and other currently available evidence. Our allowance for losses and sales adjustments of $9.3 million and $5.7 million at December 31, 2020, and December 31, 2019, respectively, does not include provisions for credit losses. As of January 1, 2020, we adopted ASU 2016-13 and primarily evaluated our historical experience with credit losses related to trade and other receivables. Because we have not experienced any historical credit losses with the majority of our clients, we have no basis to record a reserve for credit losses as defined by the standard.\nIn connection with certain of our contracts, we have recorded retentions receivable or unbilled receivables consisting of costs and estimated profit in excess of billings as of the balance sheet date. Many of the contracts which give rise to unbilled receivables at a given balance sheet date are subject to billings in the subsequent accounting period. We review unbilled receivables and related contract provisions to ensure we are justified in recognizing revenue prior to billing the customer and that we have objective evidence which allows us to recognize such revenue. In addition, we have a sizable amount of deferred revenue, which represents billings in excess of revenue earned. The majority of this liability consists of maintenance billings for which payments are made in advance and the revenue is ratably earned over the maintenance period, generally one year. We also have deferred revenue for those contracts in which we receive a deposit and the conditions in which to record revenue for the service or product have not been met. On a periodic basis, we review by customer the detail components of our deferred revenue to ensure our accounting remains appropriate.\nIntangible Assets and Goodwill. Our business acquisitions typically result in the creation of goodwill and other intangible asset balances, and these balances affect the amount and timing of future period amortization expense, as well as expense we could possibly incur as a result of an impairment charge. The cost of acquired companies is allocated to identifiable tangible and intangible assets based on estimated fair value, with the excess allocated to goodwill. Accordingly, we have a significant balance of acquisition date intangible assets, including software, customer related intangibles, trade name, leases and goodwill. These intangible assets (other than goodwill) are amortized over their estimated useful lives. We currently have no intangible assets with indefinite lives other than goodwill.\nWe assess goodwill for impairment annually as of April 1st, or more frequently whenever events or changes in circumstances indicate its carrying value may not be recoverable. We begin with the qualitative assessment of whether it is more likely than not that a reporting unit's fair value is less than its carrying value before applying the quantitative assessment described below. When testing goodwill for impairment quantitatively, we first compare the fair value of each reporting unit with its carrying amount. If the carrying amount of reporting unit goodwill exceeds the implied fair value of that goodwill, an impairment loss is recognized. The fair values calculated in our impairment tests are determined using discounted cash flow models involving several assumptions. The assumptions that are used are based upon what we believe a hypothetical marketplace participant would use in estimating fair value. We base our fair value estimates on assumptions we believe to be reasonable but that are unpredictable and inherently uncertain. We evaluate the reasonableness of the fair value calculations of our reporting units by comparing the total of the fair value of all of our reporting units to our total market capitalization.\nDuring the second quarter, as part of our annual impairment test, we performed qualitative assessments for all reporting units except for the data and insights reporting unit. As a result of these qualitative assessments, we determined that it was not more likely than not that an impairment existed; therefore, we did not perform a Step 1 quantitative impairment test. We did perform a quantitative assessment for goodwill of $75.7 million associated with our data and insights business unit and concluded no impairment existed as of our annual assessment date. For most of our reporting units, goodwill relates to a combination of legacy and acquired businesses and as a result those units have fair values that substantially exceed their underlying carrying values. For other reporting units, in particular our platform technologies and data and insights business units, goodwill entirely relates to recently acquired businesses, and as a result those units do not have significant excess fair values over carrying values. The platform technologies and data and insights business units combined goodwill was $152.0 million, or 18%, of total goodwill as of December 31, 2020. Our annual goodwill impairment analysis did not result in an impairment charge. During 2020, we have recorded no impairment to goodwill as no triggering events or changes in circumstances indicating a potential impairment have occurred as of period-end.\nDetermining the fair value of our reporting units involves the use of significant estimates and assumptions and considerable management judgment. We base our fair value estimates on assumptions we believe to be reasonable at the time, but such assumptions are subject to inherent uncertainty. Changes in market conditions or other factors outside of our control, such as the COVID-19 pandemic, could cause us to change key assumptions and our judgment about a reporting unit’s prospects. Similarly, in a specific period, a reporting unit could significantly underperform relative to its historical or projected future operating results. Either situation could result in a meaningfully different estimate of the fair value of our reporting units, and a consequent future impairment charge.\nAll intangible assets (other than goodwill) are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Recoverability of other intangible assets is measured by comparison of the carrying amount to estimated undiscounted future cash flows. The assessment of recoverability or of the estimated useful life for amortization purposes will be affected if the timing or the amount of estimated future operating cash flows is not achieved. Such indicators may include, among others: a significant decline in expected future cash flows; a sustained, significant decline in stock price and market capitalization; a significant adverse change in legal factors or in the business climate; unanticipated competition; and reductions in growth rates. In addition, products, capabilities, or technologies developed by others may render our software products obsolete or non-competitive. Any adverse change in these factors could have a significant impact on the recoverability of goodwill or other intangible assets. During 2020, we did not identify any triggering events that would indicate that the carrying amount of our intangible assets may not be recoverable.\nShare-Based Compensation. We have a stock incentive plan that provides for the grant of stock options, restricted stock units and performance stock units to key employees, directors and non-employee consultants. We estimate the fair value of share-based awards on the date of grant. Share-based compensation expense includes the estimated effects of forfeitures, which will be adjusted over the requisite service period to the extent actual forfeitures differ or are expected to differ from such estimates. Changes in estimated forfeitures are recognized in the period of change and will also impact the amount of expense to be recognized in future periods. Forfeiture rate assumptions are derived from historical data.\nWe estimate stock price volatility at the date of grant based on the historical volatility of our common stock. Estimated option life is determined using the weighted-average period the stock options are expected to be outstanding based primarily on the options’ vesting terms, remaining contractual life and the employees’ expected exercise based on historical patterns. Determining the appropriate fair-value model and calculating the fair value of share-based awards at the grant date requires considerable judgment, including estimating stock price volatility, expected option life and forfeiture rates.\nANALYSIS OF RESULTS OF OPERATIONS AND OTHER\nThe following discussion compares the historical results of operations on a basis consistent with GAAP for the years ended December 31, 2020, 2019 and 2018.\nPercentage of Total Revenues\nYears Ended December 31,\n2020 2019 2018\nRevenues:\nSoftware licenses and royalties 6.5 % 9.2 % 10.0 %\nSubscriptions 31.4 27.3 23.6\nSoftware services 16.7 19.6 20.5\nMaintenance 41.9 39.6 41.1\nAppraisal services 1.9 2.2 2.3\nHardware and other 1.6 2.1 2.5\nTotal revenues 100.0 100.0 100.0\nOperating expenses:\nCost of software licenses, royalties and\nacquired software\n3.2 3.2 2.9\nCost of subscriptions, software services and\nmaintenance\n45.8 46.2 46.9\nCost of appraisal services 1.4 1.4 1.5\nCost of hardware and other 1.1 1.6 1.7\nSelling, general and administrative expenses 23.2 23.7 22.2\nResearch and development expense 7.9 7.5 6.8\nAmortization of customer and trade name\nintangibles\n1.9 2.0 1.7\nOperating income 15.5 14.4 16.3\nOther income, net 0.2 0.3 0.4\nIncome before income taxes 15.7 14.7 16.7\nIncome tax (benefit) provision (1.8) 1.2 0.9\nNet income 17.5 % 13.5 % 15.8 %\n2020 Compared to 2019\nRevenues\nOn February 28, 2019, we acquired all of the capital stock of MicroPact, a leading provider of COTS solutions, including entellitrak®, a low-code application development platform for case management and business process management used extensively in the public sector. The following table details revenue for MicroPact for the periods presented as of December 31, 2020 and 2019, which is included in our consolidated statements of income from the date of acquisition:\n2020 2019\nRevenues:\nSoftware licenses and royalties $ 5,206 $ 8,737\nSubscriptions 10,823 7,472\nSoftware services 21,391 18,143\nMaintenance 39,701 28,642\nAppraisal services - -\nHardware and other 36 24\nTotal revenues $ 77,157 $ 63,018\nSoftware licenses and royalties.\nThe following table sets forth a comparison of our software licenses and royalties revenue for the years ended December 31:\nChange\n($ in thousands) 2020 2019 $ %\nES $ 64,200 $ 90,808 $ (26,608) (29) %\nA&T 8,964 9,397 (433) (5)\nTotal software licenses and royalties revenue $ 73,164 $ 100,205 $ (27,041) (27) %\nSoftware licenses and royalties revenue decreased 27% compared to the prior year. The decline is primarily due to longer sales cycles attributed to our ERP, public safety, and appraisal software products as the impact of COVID-19 has slowed government procurement processes and some contract signings have been pushed to future periods. Software licenses revenue was also negatively impacted by delayed deliveries attributed to the IT security incident that occurred in late September 2020. Also contributing to the decline is the shift in the mix of new software contracts toward more subscription-based agreements compared to the prior year. Our total new client mix in 2020 was approximately 38% perpetual software license arrangements and approximately 62% subscription-based arrangements compared to total new client mix in 2019 of approximately 46% perpetual software license arrangements and approximately 54% subscription-based arrangements.\nAlthough the mix of new contracts between subscription-based and perpetual license arrangements may vary from quarter to quarter and year to year, we expect our longer-term software license growth rate to be negatively impacted by a growing number of customers choosing our subscription-based options, rather than purchasing the software under a traditional perpetual software license arrangement. Subscription-based arrangements result in lower software license revenue in the initial year as compared to perpetual software license arrangements but generate higher overall revenue over the term of the contract.\nSubscriptions.\nThe following table sets forth a comparison of our subscriptions revenue for the years ended December 31:\nChange\n($ in thousands) 2020 2019 $ %\nES $ 326,284 $ 279,282 $ 47,002 17 %\nA&T 24,364 17,070 7,294 43\nTotal subscriptions revenue $ 350,648 $ 296,352 $ 54,296 18 %\nSubscription-based revenue primarily consists of revenue derived from our SaaS arrangements, which generally utilize the Tyler private cloud. As part of our subscription-based services, we also provide electronic document filing solutions (“e-filing”) that simplify the filing and management of court related documents for courts and law offices. E-filing revenue is derived from transaction fees and fixed fee arrangements.\nSubscription-based revenue increased 18% compared to 2019. New SaaS clients as well as existing clients who converted to our SaaS model provided the majority of the subscription revenue increase. In 2020, we added 488 new SaaS clients and 157 existing clients elected to convert to our SaaS model. Also, transaction-based fees contributed $7.7 million to the increase in subscription revenue due to the increased volumes of online payments from utility billings and slightly increased e-filing services volumes in 2020.\nSoftware services.\nThe following table sets forth a comparison of our software services revenue for the years ended December 31:\nChange\n($ in thousands) 2020 2019 $ %\nES $ 164,520 $ 179,865 $ (15,345) (9) %\nA&T 21,889 33,196 (11,307) (34)\nTotal software services revenue $ 186,409 $ 213,061 $ (26,652) (13) %\nSoftware services revenue primarily consists of professional services billed in connection with implementing our software, converting client data, training client personnel, custom development activities and consulting. New clients who purchase our proprietary software licenses or subscriptions generally also contract with us to provide for the related software services. Existing clients also periodically purchase additional training, consulting and minor programming services.\nSoftware services revenue decreased 13% compared to the prior year period. The decline in software services is due to delays in client implementations caused by COVID-19 travel restrictions and shelter-in-place orders and a decline in billable travel revenue, as most services are now being delivered virtually rather than on-site. Software services revenue was also lower due to interruptions caused by the IT security incident that occurred in late September 2020. We estimate that as a result of the Incident, revenue (primarily software services) was reduced by approximately $1.5 million in 2020; however, insurance reimbursements pertaining to lost revenue represent a contingent gain and any recovery of these revenues will be recorded when received. Also contributing to the decline is the increase of clients selecting our cloud solutions instead of our on-premises license arrangements which typically require more professional services.\nMaintenance.\nThe following table sets forth a comparison of our maintenance revenue for the years ended December 31:\nChange\n($ in thousands) 2020 2019 $ %\nES $ 429,224 $ 393,521 $ 35,703 9 %\nA&T 38,289 36,797 1,492 4\nTotal maintenance revenue $ 467,513 $ 430,318 $ 37,195 9 %\nWe provide maintenance and support services for our software products and certain third-party software. Maintenance revenue grew 9% compared to the prior year. Maintenance revenue increased mainly due to contributions of maintenance revenue from recent acquisitions and completing the recognition of the majority of acquisition-related deferred maintenance revenue that was fair valued at rates below Tyler's average maintenance rate in prior periods. The remainder of the increase is attributed to annual maintenance rate increases and growth in our installed customer base from new software license sales, partially offset by attrition and clients converting from on-premises license arrangements to SaaS.\nAppraisal services.\nThe following table sets forth a comparison of our appraisal services revenue for the years ended December 31:\nChange\n($ in thousands) 2020 2019 $ %\nES $ - $ - $ - - %\nA&T 21,127 23,479 (2,352) (10)\nTotal appraisal services revenue $ 21,127 $ 23,479 $ (2,352) (10) %\nIn 2020, appraisal services revenue decreased 10% compared to the prior year primarily due to the delays to several ongoing projects as a result of travel restrictions and shelter-in-place orders related to COVID-19. The appraisal services business is somewhat cyclical and driven in part by statutory revaluation cycles in various states.\nCost of Revenues and Gross Margins\nThe following table sets forth a comparison of the key components of our cost of revenues for the years ended December 31:\nChange\n($ in thousands) 2020 2019 $ %\nSoftware licenses and royalties $ 3,339 $ 3,938 $ (599) (15) %\nAcquired software 31,962 30,642 1,320 4\nSubscriptions, software services and maintenance 510,504 502,138 8,366 2\nAppraisal services 15,945 15,337 608 4\nHardware and other 12,401 17,472 (5,071) (29)\nTotal cost of revenues $ 574,151 $ 569,527 $ 4,624 1 %\nThe following table sets forth a comparison of gross margin percentage by revenue type for the years ended December 31:\nGross margin percentage 2020 2019 Change\nSoftware licenses, royalties and acquired software 51.8 % 65.5 % (13.7) %\nSubscriptions, software services and maintenance 49.2 46.6 2.6\nAppraisal services 24.5 34.7 (10.2)\nHardware and other 30.3 24.1 6.2\nOverall gross margin 48.6 % 47.6 % 1.0 %\nSoftware licenses, royalties and acquired software. Cost of software licenses, royalties and acquired software is primarily comprised of amortization expense for acquired software and third-party software costs. We do not have any direct costs associated with royalties. The gross margin decrease of 13.7% is due to lower revenue from software licenses compared to the prior period.\nSubscriptions, software services and maintenance. Cost of subscriptions, software services and maintenance primarily consists of personnel costs related to installation of our software, conversion of client data, training client personnel and support activities and various other services such as custom client development and on-going operation of SaaS and e-filing arrangements. In 2020, the subscriptions, software services and maintenance gross margin increased 2.6% compared to the prior year. Margins have increased primarily due to a reduction in software services revenues from reimbursable travel that has little to no margin, as well as improved utilization of our professional services staff resulting from the shift to virtual delivery of most implementation services, offset somewhat by the reduction in software services revenues as a result of the Incident in late September 2020. Our implementation and support staff grew by 131 employees since December 31, 2019, as we increased hiring to ensure that we are well-positioned to deliver our current backlog and anticipated new business. Costs related to maintenance and various other services such as SaaS and e-filing typically grow at a slower rate than related revenue due to leverage in the utilization of support and maintenance staff and economies of scale.\nAppraisal services. Appraisal services revenue comprised approximately 1.9% of total revenue. The appraisal services gross margin decreased 10.2% compared to 2019 due to lower staff utilization as a result of COVID-19 travel restrictions and shelter-in-place orders in place during the current period. The appraisal services business is somewhat cyclical and driven in part by statutory revaluation cycles in various states.\nOur 2020 blended gross margin increased 1.0% compared to 2019. The slight increase in overall gross margin is attributed to a higher revenue mix for subscription revenues compared to the prior year periods resulting in an increase in incremental margin related to subscriptions, software services and maintenance. Margins have also increased due a reduction in software services revenue from reimbursable travel that has little to no margin, as well as improved utilization of our professional services staff resulting from the shift to virtual delivery of most implementation services, offset somewhat by the reduction in software services revenues as a result of the Incident in late September 2020. Costs related to maintenance and various other services such as SaaS and e-filing typically grow at a slower rate than related revenue due to leveraging utilization of support and maintenance staff and economies of scale. In addition, the cancellation of our Connect user conference scheduled for April 2020 and the related elimination of approximately $6 million of revenues with no associated margin also had a positive impact on our overall gross margin. These increases in overall gross margins are partially offset by lower margins from software licenses due to lower software license revenue as well as lower staffing utilization attributable to appraisal services.\nSelling, General and Administrative Expenses\nSelling, general and administrative (“SG&A”) expenses consist primarily of salaries, employee benefits, travel, share-based compensation expense, commissions and related overhead costs for administrative and sales and marketing employees, as well as, professional fees, trade show activities, advertising costs and other marketing related costs. The following table sets forth a comparison of our SG&A expenses for the years ended December 31:\nChange\n($ in thousands) 2020 2019 $ %\nSelling, general and administrative expenses $ 259,561 $ 257,746 $ 1,815 1 %\nSG&A as a percentage of revenue was 23.2% in 2020 compared to 23.7% in 2019. SG&A expense increased approximately 1% compared to the prior year period. The increase in SG&A expense is attributed to increased stock compensation expense compared to the prior period. During 2020, stock compensation expense rose $4.3 million compared to 2019, primarily due to an increase in share-based awards issued in connection with our stock compensation plan coupled with the higher fair value of each share-based award due to the increase in our stock price. These increases in SG&A were offset by lower bonus and commission expense as a result of lower\nsales, lower travel expenses associated with sales and marketing activities, including trade shows, as a result of COVID-19 travel restrictions, and lower health claim expenses during the current period.\nResearch and Development Expense\nResearch and development expense consists primarily of salaries, employee benefits and related overhead costs associated with new product development. The following table sets forth a comparison of our research and development expense for the years ended December 31:\nChange\n($ in thousands) 2020 2019 $ %\nResearch and development expense $ 88,363 $ 81,342 $ 7,021 9 %\nResearch and development expense consists mainly of costs associated with development of new products and technologies from which we do not currently generate significant revenue.\nResearch and development expense increased 9% in 2020 compared to the prior year period, mainly due to a number of new Tyler product development initiatives across our product suites, including increased investments in research and development at recently acquired businesses. To support these initiatives, our research and development staff grew by 38 since December 31, 2019.\nAmortization of Customer and Trade Name Intangibles\nAcquisition intangibles are comprised of the excess of the purchase price over the fair value of net tangible assets acquired that is allocated to acquired software, leases and customer and trade name intangibles. The remaining excess purchase price is allocated to goodwill that is not subject to amortization. Amortization expense related to acquired software is included with cost of revenues, while amortization expense of customer and trade name intangibles is recorded as operating expense. The estimated useful lives of both customer and trade name intangibles range from five to 25 years. The following table sets forth a comparison of amortization of customer and trade name intangibles for the years ended December 31:\nChange\n($ in thousands) 2020 2019 $ %\nAmortization of customer and trade name intangibles $ 21,662 $ 21,445 $ 217 1 %\nAmortization of customer and trade name intangibles increased due to the impact of intangibles added with several acquisitions completed in 2019.\nEstimated annual amortization expense relating to customer and trade name acquisition intangibles, excluding acquired software for which the amortization expense is recorded as cost of revenues, for the next five years and thereafter is as follows (in thousands):\n2021 $ 21,317\n2022 20,827\n2023 20,753\n2024 20,201\n2025 19,672\nThereafter 116,779\nAmortization expense relating to acquired leases will be recorded as a reduction to hardware and other revenue and is expected to be $525,000 in 2021, $525,000 in 2022, $525,000 in 2023, $525,000 in 2024, $397,000 in 2025, and $114,000 thereafter.\nOther\nThe following table sets forth a comparison of other income, net for the years ended December 31:\nChange\n($ in thousands) 2020 2019 $ %\nOther income, net $ 2,116 $ 3,471 $ (1,355) (39)%\nOther income is comprised of interest income from invested cash net of interest expense and non-usage and other fees associated with our revolving credit agreement. The decrease in other income, net compared to the prior period is attributable to the significant decrease in interest rates on cash balances since March 2020, partially offset by higher levels of invested cash.\nIncome Tax Provision\nThe following table sets forth a comparison of our income tax provision for the years ended December 31:\nChange\n($ in thousands) 2020 2019 $ %\nIncome tax (benefit) provision $ (19,778) $ 13,311 $ (33,089) (249) %\nEffective income tax rate (11.3) % 8.3 %\nThe decrease in the income tax provision and the effective income tax rate in 2020 compared to the prior year is primarily due to higher excess tax benefits of share-based compensation in 2020. The share-based exercise and vesting activity in 2020 generated excess tax benefits of $60.2 million, while exercise and vesting activity in 2019 generated $29.8 million of excess tax benefits. Excluding the impact of the excess tax benefits, our income tax provision and effective tax rate in 2020 would have been $40.4 million and 23.1% and in 2019, would have been $43.1 million and 27.0%, respectively.\nThe Coronavirus Aid, Relief and Economic Security (\"CARES\") Act, which was signed into law on March 27, 2020, provides an estimated $2.2 trillion to fight the COVID-19 pandemic and stimulate the U.S. economy. The assistance includes tax relief and government loans, and investments and grants for entities in affected industries (e.g., health care, airlines). The business tax provisions of the CARES Act include temporary changes to income and non-income based tax laws, including the ability to utilize net operating losses, interest expense deductions, alternative minimum tax credit refunds, charitable contributions, and depreciation of qualified improvement property. Measures not related to income-based taxes include (1) allowing an employer to pay its share of Social Security payroll taxes that would otherwise be due from the date of enactment through December 31, 2020, over the following two years and (2) allowing eligible employers subject to closure due to the COVID-19 pandemic to receive a 50% credit on qualified wages against their employment taxes each quarter, with any excess credits eligible for refunds.\nThe most significant provision of the CARES Act impacting our accounting for income taxes is the five-year carryback allowance for taxable net operating losses generated in tax years in which the statutory federal income tax rate is 21.0% to periods in which the statutory federal income tax rate is 35.0%. We intend to carry back our 2020 taxable loss into our 2015 tax year, which results in a $3.4 million income tax benefit in the current year.\nThe effective income tax rates in both 2020 and 2019 differed from the United States federal statutory corporate income tax rate of 21% primarily due to state income taxes, the research tax credit, non-deductible share-based compensation expense, disqualifying incentive stock award dispositions, and other non-deductible business expenses. The 2020 effective income tax rate also includes the tax benefit of the five-year carryback of the federal net operating loss allowed under the CARES Act.\nFINANCIAL CONDITION AND LIQUIDITY\nAs of December 31, 2020, we had cash and cash equivalents of $603.6 million compared to $232.7 million at December 31, 2019. We also had $154.8 million invested in investment grade corporate bonds, municipal bonds and asset-backed securities as of December 31, 2020, compared to $81.6 million at December 31, 2019. These investments mature from 2021 through 2028 and we intend to hold these investments until maturity. Cash and cash equivalents consist of cash on deposit with several domestic banks and money market funds. As of December 31, 2020, we had no outstanding borrowings and one outstanding letter of credit totaling $2.0 million in favor of a client contract. We believe our revolving line of credit, cash from operating activities, cash on hand and access to the credit markets provide us with sufficient flexibility to meet our long-term financial needs.\nThe following table sets forth a summary of cash flows for the years ended December 31:\n($ in thousands) 2020 2019 2018\nCash flows provided (used) by:\nOperating activities $ 355,089 $ 254,720 $ 250,203\nInvesting activities (98,320) (245,015) (238,255)\nFinancing activities 114,172 88,698 (63,595)\nNet increase (decrease) in cash and cash equivalents $ 370,941 $ 98,403 $ (51,647)\nNet cash provided by operating activities continues to be our primary source of funds to finance operating needs and capital expenditures. Other potential capital resources include cash on hand, public and private issuances of debt or equity securities, and bank borrowings. It is possible that our ability to access the capital and credit markets in the future may be limited by economic conditions or other factors. We currently believe that cash provided by operating activities, cash on hand and available credit are sufficient to fund our working capital requirements, capital expenditures, income tax obligations, and share repurchases for at least the next twelve months.\nIn 2020, operating activities provided cash of $355.1 million compared to $254.7 million in 2019. Operating activities that provided cash were primarily comprised of net income of $194.8 million, non-cash depreciation and amortization charges of $81.7 million, non-cash share-based compensation expense of $67.4 million and non-cash decrease in operating lease right-of-use assets of $5.8 million. Working capital, excluding cash, decreased approximately $1.9 million due to higher accounts receivable resulting from an increase in unbilled receivables attributed to revenues recognized prior to billings, higher accounts receivable related to annual maintenance and subscription billings, timing of income tax payments, and the deferred taxes associated with stock option activity during the period. These increases were offset by the growth in deferred revenue balances and timing of payments of payroll related taxes and vendor invoices.\nIn general, changes in the balance of deferred revenue are cyclical and primarily driven by the timing of our maintenance and subscription billings. Our renewal dates occur throughout the year, but our largest maintenance renewal cycles occur in the second and fourth quarters.\nDays sales outstanding in accounts receivable were 121 days at December 31, 2020, compared to 117 days at December 31, 2019. The increase in our DSO is mainly due to an increase in unbilled receivables attributed to the increase in software license revenue for which we have recognized revenue at the point in time when the software is made available to the customer, but the billing has not yet been submitted to the customer. An increase in software services contracts accounted for using progress-to-completion method of revenue recognition in which the services are performed in one accounting period, but the billing normally occurs subsequently in another accounting period also contributed to the increase in DSO. Furthermore, our maintenance billing cycle typically peaks at its highest level in June and second highest level in December of each year and is followed by collections in the subsequent quarter. DSO is calculated based on quarter-end accounts receivable (excluding long-term receivables but including unbilled receivables) divided by the quotient of annualized quarterly revenues divided by 360 days.\nInvesting activities used cash of $98.3 million in 2020 compared to $245.0 million in 2019. We invested $156.6 million and received $82.7 million in proceeds from investment grade corporate bonds, municipal bonds and asset-backed securities with maturity dates ranging from 2021 through 2028. During 2020, we received $15.0 million in proceeds from the sale of the investment in convertible preferred stock representing a 20% interest in Record Holdings to BFTR, LLC, a wholly owned subsidiary of Bison Capital Partners V.L.P. During the same period, we purchased $10.0 million in common stock representing a 18% interest in BFTR, LLC. We paid $1.3 million in working capital and indemnity holdbacks in connection with the 2019 acquisition of Courthouse Technologies, Ltd. Approximately $22.7 million was invested in property and equipment, including $9.9 million related to real estate. In addition, approximately $5.8 million of software development was capitalized in 2020. The remaining additions were for computer equipment and furniture and fixtures in support of internal growth, particularly with respect to data centers supporting growth in our cloud-based offerings. These expenditures were funded from cash generated from operations.\nIn 2019, we invested $54.7 million and received $70.8 million in proceeds from investment grade corporate bonds, municipal bonds and asset-backed securities with maturity dates ranging from 2020 through 2023. On February 28, 2019, we acquired all of the capital stock of MicroPact. The total purchase price, net of cash acquired of $2.0 million, was approximately $202.2 million, including $198.2 million paid in cash and accrued contingent consideration of $6.0 million at December 31, 2019. On February 1, 2019, we acquired all the assets of MyCivic for the total purchase price of $3.7 million paid in cash. On October 30, 2019, we acquired certain assets of CHT. The total purchase price was approximately $20.5 million of which $19.1 million was paid in cash and approximately $1.4 million accrued for working capital and indemnity holdbacks, subject to certain post-closing adjustments. Approximately $37.2 million was invested in property and equipment, including $20.8 million related to real estate. In addition, approximately $4.8 million of software development was capitalized in 2019. The remaining additions were for computer equipment and furniture and fixtures in support of internal growth, particularly with respect to data centers supporting growth in our cloud-based offerings. These expenditures were funded from cash generated from operations.\nFinancing activities provided cash of $114.2 million in 2020 compared to $88.7 million in 2019. Financing activities in 2020 were primarily comprised of collections of $135.3 million from stock option exercises and employee stock purchase plan activity. We also purchased approximately 59,000 shares of our common stock for an aggregate purchase price of $15.5 million.\nFinancing activities provided cash of $88.7 million in 2019 compared to cash used of $63.6 million in 2018. Financing activities in 2019 were primarily comprised of collections of $106.5 million from stock option exercises and employee stock purchase plan activity. We also purchased approximately 72,000 shares of our common stock for an aggregate purchase price of $14.3 million.\nIn February 2019, our board of directors authorized the repurchase of an additional 1.5 million shares of Tyler common stock. The repurchase program, which was approved by our board of directors, was announced in October 2002, and was amended at various times from 2003 through 2019. As of February 19, 2021, we had remaining authorization to repurchase up to 2.5 million additional shares of our common stock. Our share repurchase program allows us to repurchase shares at our discretion. Market conditions influence the timing of the buybacks and the number of shares repurchased, as well as the volume of employee stock option exercises. Share repurchases are generally funded using our existing cash balances and borrowings under our credit facility and may occur through open market purchases and transactions structured through investment banking institutions, privately negotiated transactions and/or other mechanisms. There is no expiration date specified for the authorization and we intend to repurchase stock under the plan from time to time.\nOn September 30, 2019, we entered into a $400.0 million credit agreement (the “Credit Facility”) with the various lenders party thereto and Wells Fargo Bank, National Association, as Administrative Agent. The Credit Facility provides for an unsecured revolving credit line of up to $400.0 million, including a $25.0 million sublimit for letters of credit. The Credit Facility matures on September 30, 2024. Borrowings under the Credit Facility may be used for general corporate purposes, including working capital requirements, acquisitions and share repurchases. Borrowings under the Credit Facility bear interest at a rate of either (1) Wells Fargo Bank’s prime rate (subject to certain higher rate determinations) plus a margin of 0.125% to 0.75% or (2) the 30, 60, 90 or 180 day LIBOR rate plus a margin of 1.125% to 1.75%. As of December 31, 2020, our interest rate was 3.38% under the prime rate option or approximately 1.27% under the 30-day LIBOR option. The Credit Facility is unsecured by substantially all of our assets. The Credit Facility requires us to maintain certain financial ratios and other financial conditions and prohibits us from making certain investments, advances, cash dividends or loans, and limits incurrence of additional indebtedness and liens. As of December 31, 2020, we were in compliance with those covenants.\nAs of December 31, 2020, we had no outstanding borrowings and had unused borrowing capacity of $400.0 million under the Credit Facility. We paid interest of $610,000 in 2020, $1,750,000 in 2019, and $770,000 in 2018.\nWe paid income taxes, net of refunds received, of $3.3 million in 2020, $21.3 million in 2019, and $6.8 million in 2018. In 2020, we experienced significant stock option exercise activity that generated net tax benefits of $60.2 million and reduced tax payments accordingly. In 2019 and 2018, excess tax benefits were $29.8 million and $32.5 million, respectively.\nWe anticipate that 2021 capital spending will be between $39 million and $40 million, including approximately $3 million related to real estate and approximately $17 million of capitalized software development. We expect the majority of the other capital spending will consist of computer equipment and software for infrastructure replacements and expansion. Capital spending is expected to be funded from existing cash balances and cash flows from operations.\nFrom time to time we engage in discussions with potential acquisition candidates. In order to pursue such opportunities, which could require significant commitments of capital, we may be required to incur debt or to issue additional potentially dilutive securities in the future. No assurance can be given as to our future acquisition opportunities and how such opportunities will be financed. We lease office facilities for use in our operations, as well as transportation and other equipment. Most of our leases are non-cancelable operating lease agreements and they expire from one year to seven years. Some of these leases include options to extend for up to 10 years.\nCAPITALIZATION\nAt December 31, 2020, our capitalization consisted of no outstanding debt and $2.0 billion of shareholders’ equity.",
    "item_7A": "ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nMarket risk represents the risk of loss that may affect us due to adverse changes in financial market prices and interest rates.\nAs of December 31, 2020, our interest rate was 3.38% under the prime rate option or approximately 1.27% under the 30-day LIBOR option. Loans under the Credit Facility bear interest, at Tyler’s option, at a per annum rate of either (1) Wells Fargo Bank’s prime rate (subject to certain higher rate determinations) plus a margin of 0.125% to 0.75% or (2) the one-, two-, three-, or six-month LIBOR rate plus a margin of 1.125% to 1.75%.\nAs of December 31, 2020, we had no outstanding borrowings under the Credit Facility and therefore are not subject to any interest risk.",
    "item_8": "ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nThe reports of our independent registered public accounting firm and our financial statements, related notes, and supplementary data are included as part of this Annual Report beginning on page.",
    "item_9": "ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone.",
    "item_9A": "ITEM 9A. CONTROLS AND PROCEDURES.\nEvaluation of Disclosure Controls and Procedures - We maintain disclosure controls and procedures (as defined in Rule 13a-15(e) of the Securities Exchange Act) designed to provide reasonable assurance that the information required to be disclosed by us in the reports we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SEC’s rules and forms. These include controls and procedures designed to ensure that this information is accumulated and communicated to our management, including our chief executive officer and chief financial officer, as appropriate to allow timely decisions regarding required disclosures. Management, with the participation of the chief executive officer and chief financial officer, evaluated the effectiveness of our disclosure controls and procedures as of December 31, 2020. Based on this evaluation, the chief executive officer and chief financial officer have concluded that our disclosure controls and procedures were effective as of December 31, 2020.\nManagement’s Report on Internal Control Over Financial Reporting - Tyler’s management is responsible for establishing and maintaining effective internal control over financial reporting as defined in Securities Exchange Act Rule 13a-15(f). Tyler’s internal control over financial reporting is designed to provide reasonable assurance to Tyler’s management and board of directors regarding the preparation and fair presentation of published financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\nManagement assessed the effectiveness of Tyler’s internal control over financial reporting as of December 31, 2020. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). Based on our assessment, we concluded that, as of December 31, 2020, Tyler’s internal control over financial reporting was effective based on those criteria.\nTyler’s internal control over financial reporting as of December 31, 2020 has been audited by Ernst & Young LLP, the independent registered public accounting firm who also audited Tyler’s financial statements. Ernst & Young’s attestation report on Tyler’s internal control over financial reporting appears on page hereof.\nChanges in Internal Control Over Financial Reporting - During the quarter ended December 31, 2020, there were no changes in our internal control over financial reporting, as defined in Securities Exchange Act Rule 13a-15(f), that materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.",
    "item_9B": "ITEM 9B. OTHER INFORMATION.\nNone.\nPART III\nSee the information under the following captions in Tyler’s definitive Proxy Statement, which is incorporated herein by reference. Only those sections of the Proxy Statement that specifically address the items set forth herein are incorporated by reference. Such incorporation by reference does not include the Compensation Discussion and Analysis, the Compensation Committee Report or the Audit Committee Report, which are included in the Proxy Statement.\nHeadings in Proxy Statement",
    "item_10": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE.\n“Tyler Management” and “Corporate Governance Principles and Board Matters”",
    "item_11": "ITEM 11. EXECUTIVE COMPENSATION.\n“Executive Compensation”",
    "item_12": "ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\n“Security Ownership of Certain Beneficial Owners and Management”",
    "item_13": "ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\n\"Executive Compensation\" and\n“Certain Relationships and Related Transactions”",
    "item_14": "ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES.\nThe information required under this item may be found under the section captioned “Proposals For Consideration - Proposal Two - Ratification of Our Independent Auditors for Fiscal Year 2020” in our Proxy Statement when filed.\nPART IV",
    "item_15": "ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES.\nThe following documents are filed as part of this Annual Report:\n(a) (1) The financial statements are filed as part of this Annual Report.\nPage\nReports of Independent Registered Public Accounting Firm\nConsolidated Statements of Comprehensive Income for the years ended December 31, 2020, 2019 and 2018\nConsolidated Balance Sheets as of December 31, 2020 and 2019\nConsolidated Statements of Cash Flows for the years ended December 31, 2020, 2019 and 2018\nConsolidated Statements of Shareholders’ Equity for the years ended December 31, 2020, 2019 and 2018\nNotes to Consolidated Financial Statements\n(2) Financial statement schedules:\nThere are no financial statement schedules filed as part of this Annual Report, since the required information is included in the financial statements, including the notes thereto, or the circumstances requiring inclusion of such schedules are not present.\n(3) Exhibits\nCertain of the exhibits to this Annual Report are hereby incorporated by reference, as specified:\nExhibit\nNumber\nDescription\n3.1 Restated Certificate of Incorporation of Tyler Three, as amended through May 14, 1990, and Certificate of Designation of Series A Junior Participating Preferred Stock (filed as Exhibit 3.1 to our Form 10-Q for the quarter ended June 30, 1990, and incorporated by reference herein).\n3.2 Certificate of Amendment to the Restated Certificate of Incorporation (filed as Exhibit 3.1 to our Form 8-K, dated February 19, 1998, and incorporated by reference herein).\n3.3\nAmended and Restated By-Laws of Tyler Corporation, dated October 20, 2015 (filed as Exhibit 3.3 to our Form 10-Q for the quarter ended September 30, 2015, and incorporated by reference herein).\n3.4\nCertificate of Amendment dated May 19, 1999 to the Restated Certificate of Incorporation (filed as Exhibit 3.4 to our Form 10-K for the year ended December 31, 2000, and incorporated by reference herein).\n4.1 Specimen of Common Stock Certificate (filed as Exhibit 4.1 to our registration statement no. 33-33505 and incorporated by reference herein).\n4.2\nCredit Agreement dated September 30, 2019, among Tyler Technologies, Inc. and Wells Fargo Bank, N. A. as Administrative Agent and other lenders party hereto (filed as Exhibit 10.1 to our Form 8-K dated October 02, 2019, and incorporated by reference herein).\n4.3\nAgreement and Plan of Merger, dated February 9, 2021 by and among Tyler Technologies, Inc., Topos Acquisition, Inc., and NIC, Inc.(filed as Exhibit 2.1 to our Form 8-K, dated February 10, 2021, and incorporated by reference herein).\n10.1\nEmployee Stock Purchase Plan (filed as Exhibit 10.1 to our registration statement 333-182318 dated June 25, 2012 and incorporated by reference herein).\n10.2\nEmployment and Non-Competition Agreement between Tyler Technologies, Inc. and John S. Marr Jr. effective February 26, 2018 (filed as Exhibit 10.1 to our Form 8-K dated March 9, 2018 and incorporated by reference herein).\nExhibit\nNumber Description\n10.3\nEmployment and Non-Competition Agreement between Tyler Technologies, Inc. and Brian K. Miller effective February 26, 2018 (filed as Exhibit 10.3 to our Form 8-K dated March 9, 2018 and incorporated by reference herein).\n.\n10.4\nEmployment and Non-Competition Agreement between Tyler Technologies, Inc. and H. Lynn Moore, Jr effective February 26, 2018 (filed as Exhibit 10.2 to our Form 8-K dated March 9, 2018 and incorporated by reference herein).\n10.5\nAgreement and plan of merger by and among Tyler Technologies, Inc. TMP Subsidiary, Inc., MP Holding Parent, Inc. (filed as Exhibit 10.7 to our Form 10-K dated February 20, 2019 and incorporated by reference herein).\n10.6\nTyler Technologies, Inc. 2018 Stock Option Plan effective as of May 9, 2018 (filed as Appendix A to the registrant's Proxy Statement filed with the Commission on March 28, 2018 and incorporated by reference herein).\n*23\nConsent of Independent Registered Public Accounting Firm.\n*31.1\nRule 13a-14(a) Certification by Principal Executive Officer.(a) Certification by Principal Executive Officer.\n*31.2\nRule 13a-14(a) Certification by Principal Financial Officer.\n*32.1\nSection 1350 Certification of Principal Executive Officer and Principal Financial Officer.\n*101.INS Inline XBRL Instance Document - the Instance Document does not appear in the interactive data file because its XBRL tags, including Cover Page XBRL tags, are embedded within the Inline XBRL Document.\n*101.SCH\nInline XBRL Taxonomy Extension Schema Document.\n*101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n*101.LAB Inline XBRL Extension Labels Linkbase Document.\n*101.DEF Inline XBRL Taxonomy Extension Definition Linkbase Document.\n*101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\n104 Cover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n* - Filed herewith.\nA copy of each exhibit may be obtained at a price of 15 cents per page, with a $10.00 minimum order, by writing Investor Relations, 5101 Tennyson Parkway, Plano, Texas, 75024.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nTYLER TECHNOLOGIES, INC.\nDate: February 19, 2021 By: /s/ H. Lynn Moore, Jr.\nH. Lynn Moore, Jr.\nPresident and Chief Executive Officer\n(principal executive officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, the following persons on behalf of the registrant and in the capacities and on the dates indicated have signed this report below.\nDate: February 19, 2021 By: /s/ John S. Marr, Jr.\nJohn S. Marr, Jr.\nExecutive Chairman of the Board\nDirector\nDate: February 19, 2021 By: /s/ H. Lynn Moore, Jr.\nH. Lynn Moore, Jr.\nPresident and Chief Executive Officer\n(principal executive officer)\nDate: February 19, 2021 By: /s/ Brian K. Miller\nBrian K. Miller\nExecutive Vice President and Chief Financial Officer\n(principal financial officer)\nDate: February 19, 2021 By: /s/ W. Michael Smith\nW. Michael Smith\nChief Accounting Officer\n(principal accounting officer)\nDate: February 19, 2021 By: /s/ Donald R. Brattain\nDonald R. Brattain\nDirector\nDate: February 19, 2021 By: /s/ Glenn A. Carter\nGlenn A. Carter\nDirector\nDate: February 19, 2021 By: /s/ Brenda A. Cline\nBrenda A. Cline\nDirector\nDate: February 19, 2021 By: /s/ Mary Landrieu\nMary Landrieu\nDirector\nDate: February 19, 2021 By: /s/ Daniel M. Pope\nDaniel M. Pope\nDirector\nDate: February 19, 2021 By: /s/ Dustin R.Womble\nDustin R. Womble\nDirector\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Tyler Technologies, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Tyler Technologies, Inc. (the Company) as of December 31, 2020 and 2019, the related consolidated statements of comprehensive income, shareholders’ equity and cash flows for each of the three years in the period ended December 31, 2020, and the related notes (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2020 and 2019, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2020, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2020, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated February 19, 2021 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosure to which it relates.\nEstimation of hours for certain progress-to-completion (POC) arrangements\nDescription of\nthe Matter As described in Note 1 to the consolidated financial statements under “Revenue Recognition,” many of the Company’s software arrangements involve “off-the-shelf” software. For arrangements that involve significant production, modification or customization of the software, or where software services are otherwise not considered distinct, the Company recognizes revenue over time based on a measurement of progress-to-completion (POC). The Company measures POC primarily using labor hours incurred, believing it best depicts the pattern of transfer of control to the customer, which occurs as the Company incurs costs on its contracts. Estimates of budgeted total hours for these arrangements requires management judgment.\nAuditing management’s estimates of total budgeted contract hours required additional audit effort due to the existence of management judgment required to make these estimates for arrangements that are completed over an extended period. These estimates require ongoing monitoring by management and may require revision over time.\nHow We Addressed the Matter in Our Audit We obtained an understanding, evaluated the design, and tested the operating effectiveness of controls over the Company’s process to review contract progress-to-date and total budgeted hours, inclusive of executed contract amendments and change orders.\nTo test the appropriateness of management’s assessment of contract progress-to-date, our audit procedures included, among others, obtaining an understanding of any increase or decrease to budgeted hours via contract amendments or change orders, observing quarterly POC meetings where the Company discussed contract progress-to-date and evaluated the appropriateness of contract estimated hours to complete, reviewing signed Company attestations as to the contracts’ progress toward completion, performing a sensitivity analysis to assess the appropriateness of remaining budgeted hours and trend of progress on the contracts and performing an analysis of completed contracts to compare actual hours incurred upon completion to the original budget.\n/s/ ERNST & YOUNG LLP\nWe have served as the Company’s auditor since 1966.\nDallas, Texas\nFebruary 19, 2021\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Tyler Technologies, Inc.\nOpinion on Internal Control over Financial Reporting\nWe have audited Tyler Technologies, Inc.’s internal control over financial reporting as of December 31, 2020, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Tyler Technologies, Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2020, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), consolidated balance sheets of the Company as of December 31, 2020 and 2019, the related consolidated statements of comprehensive income, shareholders’ equity and cash flows for each of the three years in the period ended December 31, 2020, and the related notes and our report dated February 19, 2021 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ ERNST & YOUNG LLP\nDallas, Texas\nFebruary 19, 2021\nTyler Technologies, Inc.\nConsolidated Statements of Comprehensive Income\nFor the years ended December 31\n(In thousands, except per share amounts)\n2020 2019 2018\nRevenues:\nSoftware licenses and royalties $ 73,164 $ 100,205 $ 93,441\nSubscriptions 350,648 296,352 220,547\nSoftware services 186,409 213,061 191,269\nMaintenance 467,513 430,318 384,521\nAppraisal services 21,127 23,479 21,846\nHardware and other 17,802 23,012 23,658\nTotal revenues 1,116,663 1,086,427 935,282\nCost of revenues:\nSoftware licenses and royalties 3,339 3,938 3,802\nAcquired software 31,962 30,642 22,972\nSubscriptions, software services and maintenance 510,504 502,138 438,923\nAppraisal services 15,945 15,337 14,299\nHardware and other 12,401 17,472 15,708\nTotal cost of revenues 574,151 569,527 495,704\nGross profit 542,512 516,900 439,578\nSelling, general and administrative expenses 259,561 257,746 207,605\nResearch and development expense 88,363 81,342 63,264\nAmortization of customer and trade name intangibles 21,662 21,445 16,217\nOperating income 172,926 156,367 152,492\nOther income, net 2,116 3,471 3,378\nIncome before income taxes 175,042 159,838 155,870\nIncome tax (benefit) provision (19,778) 13,311 8,408\nNet income $ 194,820 $ 146,527 $ 147,462\nEarnings per common share:\nBasic $ 4.87 $ 3.79 $ 3.84\nDiluted $ 4.69 $ 3.65 $ 3.68\nSee accompanying notes.\nTyler Technologies, Inc.\nConsolidated Balance Sheets\n(In thousands, except par value and share amounts)\n12/31/2020 12/31/2019\nASSETS\nCurrent assets:\nCash and cash equivalents $ 603,623 $ 232,682\nAccounts receivable (less allowance for losses and sales adjustments of $9,255 in 2020 and $5,738 in 2019)\n382,319 374,089\nShort-term investments 72,187 39,399\nPrepaid expenses 30,864 24,717\nIncome tax receivable 21,598 6,482\nOther current assets 2,479 2,328\nTotal current assets 1,113,070 679,697\nAccounts receivable, long-term 21,417 22,432\nOperating lease right-of-use assets 18,734 18,992\nProperty and equipment, net 168,004 171,861\nOther assets:\nGoodwill 838,428 840,117\nOther intangibles, net 331,189 378,914\nNon-current investments 82,640 42,235\nOther non-current assets 33,792 37,366\n$ 2,607,274 $ 2,191,614\nLIABILITIES AND SHAREHOLDERS' EQUITY\nCurrent liabilities:\nAccounts payable $ 14,011 $ 14,977\nAccrued liabilities 83,084 75,234\nOperating lease liabilities 5,904 6,387\nDeferred revenue 461,278 412,495\nTotal current liabilities 564,277 509,093\nRevolving line of credit - -\nDeferred revenue, long-term 100 199\nDeferred income taxes 40,507 48,442\nOperating lease liabilities, long-term 16,279 16,822\nCommitments and contingencies - -\nShareholders' equity:\nPreferred stock, $10.00 par value; 1,000,000 shares authorized; none issued\n- -\nCommon stock, $0.01 par value; 100,000,000 shares authorized; 48,147,969 shares\nissued in 2020 and 2019\n481 481\nAdditional paid-in capital 905,332 739,478\nAccumulated other comprehensive loss, net of tax (46) (46)\nRetained earnings 1,112,156 917,336\nTreasury stock, at cost; 7,608,627 and 8,839,352 shares in 2020 and 2019, respectively\n(31,812) (40,191)\nTotal shareholders' equity 1,986,111 1,617,058\n$ 2,607,274 $ 2,191,614\nSee accompanying notes.\nTyler Technologies, Inc.\nConsolidated Statements of Cash Flows\nFor the years ended December 31\n(In thousands)\n2020 2019 2018\nCash flows from operating activities:\nNet income $ 194,820 $ 146,527 $ 147,462\nAdjustments to reconcile net income to cash provided by operations:\nDepreciation and amortization 81,657 76,672 61,759\nShare-based compensation expense 67,365 59,967 52,740\nProvision for losses and sales adjustments - accounts receivable 3,517 1,636 (569)\nOperating lease right-of-use assets - non cash 5,782 5,397 -\nDeferred income tax benefit (7,936) (6,088) (5,069)\nChanges in operating assets and liabilities, exclusive of effects of\nacquired companies:\nAccounts receivable (10,733) (65,738) (50,916)\nIncome tax receivable (15,117) (1,925) 6,642\nPrepaid expenses and other current assets (8,304) (8,976) (588)\nAccounts payable (967) 7,403 (2,416)\nOperating lease liabilities (6,549) (6,113) -\nAccrued liabilities 2,870 1,516 (2,445)\nDeferred revenue 48,684 44,442 43,603\nNet cash provided by operating activities 355,089 254,720 250,203\nCash flows from investing activities:\nAdditions to property and equipment (22,690) (37,236) (27,424)\nPurchase of marketable security investments (156,618) (54,742) (115,625)\nProceeds from marketable security investments 82,742 70,796 81,205\nPurchase of equity investment in common shares (10,000) - -\nProceeds from the sale of equity investment in preferred shares 15,000 - -\nCapitalized software development costs (5,776) (4,804) -\nCost of acquisitions, net of cash acquired (1,292) (218,734) (178,093)\nDecrease (increase) in other 314 (295) 1,682\nNet cash used by investing activities (98,320) (245,015) (238,255)\nCash flows from financing activities:\nDecrease in net borrowings on revolving line of credit - - -\nPurchase of treasury shares (15,484) (17,786) (146,553)\nPayment of contingent consideration (5,619) - -\nProceeds from exercise of stock options 124,363 96,908 74,907\nContributions from employee stock purchase plan 10,912 9,576 8,051\nNet cash provided (used) by financing activities 114,172 88,698 (63,595)\nNet increase (decrease) in cash and cash equivalents 370,941 98,403 (51,647)\nCash and cash equivalents at beginning of period 232,682 134,279 185,926\nCash and cash equivalents at end of period $ 603,623 $ 232,682 $ 134,279\nSee accompanying notes.\nTyler Technologies, Inc.\nConsolidated Statements of Shareholders’ Equity\nFor the years ended December 31, 2020, 2019, and 2018\n(In thousands)\nCommon Stock Additional\nPaid-in\nCapital Accumulated Other\nComprehensive\nIncome (Loss) Retained\nEarnings Treasury Stock Total\nShareholders'\nEquity\nShares Amount Shares Amount\nBalance at December 31, 2017 48,148 $ 481 $ 626,867 $ (46) $ 624,463 (10,262) $ (60,029) $ 1,191,736\nNet income - - - - 147,462 - - 147,462\nIssuance of shares pursuant to stock compensation plan\n- - 44,458 - - 1,126 30,449 74,907\nStock compensation - - 52,740 - - - - 52,740\nIssuance of shares pursuant to employee stock purchase plan\n- - 7,370 - - 45 681 8,051\nTreasury stock purchases - - - - - (781) (150,050) (150,050)\nBalance at December 31, 2018 48,148 481 731,435 (46) 771,925 (9,872) (178,949) 1,324,846\nNet income - - - - 146,527 - - 146,527\nRetained earnings adjustment-adoption of Topic 842 Leases, net of taxes\n- - - - (1,116) - - (1,116)\nExercise of stock options and vesting of restricted stock units - - (52,833) - - 1,075 149,741 96,908\nEmployee taxes paid for withheld shares for taxes upon equity award settlement - - - - - (23) (5,361) (5,361)\nStock compensation - - 59,967 - - - - 59,967\nIssuance of shares pursuant to employee stock purchase plan\n- - 909 - - 53 8,667 9,576\nTreasury stock purchases - - - - - (72) (14,289) (14,289)\nBalance at December 31, 2019 48,148 481 739,478 (46) 917,336 (8,839) (40,191) 1,617,058\nNet income - - - - 194,820 - - 194,820\nExercise of stock options and vesting of restricted stock units\n- - 90,636 - - 1,283 33,727 124,363\nEmployee taxes paid for withheld shares for taxes upon equity award settlement - - - - - (34) (12,923) (12,923)\nStock compensation - - 67,365 - - - - 67,365\nIssuance of shares pursuant to employee stock purchase plan\n- - 7,853 - - 40 3,059 10,912\nTreasury stock purchases - - - - - (59) (15,484) (15,484)\nBalance at December 31, 2020 48,148 $ 481 $ 905,332 $ (46) $ 1,112,156 (7,609) $ (31,812) $ 1,986,111\nSee accompanying notes.\nTyler Technologies, Inc.\nNotes to Consolidated Financial Statements\n(Tables in thousands, except per share data)\n(1)SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nDESCRIPTION OF BUSINESS\nWe provide integrated software systems and related services for the public sector, with a focus on local governments. We develop and market a broad line of software solutions and services to address the information technology (“IT”) needs primarily of cities, counties, schools and other local government entities. In addition, we provide professional IT services, including software and hardware installation, data conversion, training, and for certain customers, product modifications, along with continuing maintenance and support for customers using our systems. We also provide subscription-based services such as software as a service (“SaaS”) arrangements, which primarily utilize the Tyler private cloud, and electronic document filing solutions (“e-filing”). In addition, we provide property appraisal outsourcing services for taxing jurisdictions.\nImpact of the COVID-19 Pandemic\nIn March 2020, the World Health Organization declared the outbreak of a COVID-19 pandemic (\"COVID-19\"), which continues to spread throughout the U.S. and the world and has resulted in authorities implementing numerous measures to contain the virus, including travel bans and restrictions, quarantines, shelter-in-place orders, and business limitations and shutdowns. While we are unable to accurately predict the full impact that COVID-19 will have on our results from operations, financial condition, liquidity and cash flows due to numerous uncertainties, including the duration and severity of the pandemic and containment measures and associated compliance, the current environment has negatively impacted our revenues for fiscal year 2020.\nBecause an increasing portion of our revenues are considered recurring in nature, the effect of COVID-19 on our results of operations may also not be fully reflected for some time. We continue to see some impact on our business in the near term with delays in government procurement processes and uncertainty around public sector budgets, as well as delays in implementations caused by travel restrictions, closed offices, or clients shifting focus to more pressing issues. We have addressed those challenges through adapting the way we do business - encouraging web and video conferencing, conducting virtual sales demonstrations and delivering professional services remotely.\nOur priorities during this crisis are protecting the health and safety of our employees and our clients. Our IT systems and applications support a remote workforce. Prior to the pandemic, many of our employees worked remotely. In response to the pandemic, we encouraged all employees who are able to do so to work from home, equipping them with resources necessary to continue uninterrupted. We were able to transition the vast majority of our employees to this work-from-home posture. This reduces the number of team members in our offices to those uniquely needed for essential on-site services, such as network operations support staff, and allows for “social distancing” as directed by the Centers for Disease Control (\"CDC\").\nThe pandemic has delayed some government procurement processes and is expected to impact our ability to complete certain implementations, negatively impacting our revenue. It could also negatively impact the timing of client payments to us. We continue to monitor these trends in order to respond to the ever-changing impact of COVID-19 on our clients and Tyler’s operations.\nFor the twelve months ended December 31, 2020, the impact of the COVID-19 pandemic resulted in lower revenues from software licenses, software services, appraisal services, and other revenues. Lower software licenses compared to prior periods are attributed to slower sales cycles as government procurement processes are delayed and contract signings have been pushed to future periods. Software services and appraisal services revenue declines are attributed to delays in implementations caused by travel restrictions and shelter-in-place orders in effect during the period. Other revenues were lower compared to prior periods primarily as a result of the cancellation of our 2020 Connect user conference. Lower revenues compared to prior periods were offset by cost savings attributed to lower spend on travel, user conferences and trade show expenses, health claims and other employee-related expenses. If, and as travel restrictions are relaxed, we expect software services and appraisal services revenues to increase as the limited number of our clients who require that all or a portion of their services be delivered onsite will be able to receive those services. Also, we are adapting by changing the way we do business, encouraging web and video conferencing, conducting virtual sales demonstrations and delivering professional services remotely, which result in increases in staff utilization rates and billable time.\nRevenues from subscriptions and maintenance, which we consider recurring in nature, comprised 73% of our total consolidated revenue for the twelve months ended December 31, 2020, and include transaction-based revenue streams such as e-filing and online payments. As of December 31, 2020, we had $758.5 million in cash and investments and no outstanding borrowings under our credit facility. We also have substantial additional liquidity available through our undrawn $400 million credit facility, which can be expanded through an accordion feature. During the second quarter of 2020, we completed our annual assessment of goodwill which did not result in an impairment charge. Since our assessment in the second quarter of 2020, we identified no indicators of impairment to goodwill; therefore, we have recorded no impairment as of and for the period ended December 31, 2020. We identified no indicators of impairment to long-lived and other assets and therefore, no impairment was recorded as of and for the period ended December 31, 2020. However, due to significant uncertainty surrounding COVID-19 and market conditions, there are no assurances conditions will not deteriorate in the future.\nPRINCIPLES OF CONSOLIDATION\nThe consolidated financial statements include our parent company and eleven subsidiaries, which are wholly-owned. All significant intercompany balances and transactions have been eliminated in consolidation. Comprehensive income is defined as the change in equity of a business enterprise during a period from transactions, and other events and circumstances from non-owner sources and includes all components of net income and other comprehensive income. We had no items of other comprehensive income during the years ended December 31, 2020, 2019, and 2018.\nCASH AND CASH EQUIVALENTS\nCash in excess of that necessary for operating requirements is invested in short-term, highly liquid, income-producing investments. Investments with original maturities of three months or less are classified as cash and cash equivalents, which primarily consist of cash on deposit with several banks and money market funds. Cash and cash equivalents are stated at cost, which approximates market value.\nREVENUE RECOGNITION\nNature of Products and Services\nWe earn revenue from software licenses, royalties, subscription-based services, software services, post-contract customer support (“PCS” or “maintenance”), hardware and appraisal services. Revenue is recognized upon transfer of control of promised products or services to customers in an amount that reflects the consideration we expect to receive in exchange for those products or services. We determine revenue recognition through the following steps:\n•Identification of the contract, or contracts, with a customer\n•Identification of the performance obligations in the contract\n•Determination of the transaction price\n•Allocation of the transaction price to the performance obligations in the contract\n•Recognition of revenue when, or as, we satisfy a performance obligation\nMost of our software arrangements with customers contain multiple performance obligations that range from software licenses, installation, training, and consulting to software modification and customization to meet specific customer needs (services), hosting, and PCS. For these contracts, we account for individual performance obligations separately when they are distinct. We evaluate whether separate performance obligations can be distinct or should be accounted for as one performance obligation. Arrangements that include software services, such as training or installation, are evaluated to determine whether those services are highly interdependent or interrelated to the product’s functionality. The transaction price is allocated to the distinct performance obligations on a relative standalone selling price (“SSP”) basis. We determine the SSP based on our overall pricing objectives, taking into consideration market conditions and other factors, including the value of our contracts, the applications sold, customer demographics, and the number and types of users within our contracts. Revenue is recognized net of allowances for sales adjustments and any taxes collected from customers, which are subsequently remitted to governmental authorities.\nSoftware Arrangements:\nSoftware Licenses and Royalties\nMany of our software arrangements involve “off-the-shelf” software. We recognize the revenue allocable to \"off-the-shelf\" software licenses and specified upgrades at a point in time when control of the software license transfers to the customer, unless the software is not considered distinct. We consider \"off-the-shelf\" software to be distinct when it can be added to an arrangement with minor changes in the underlying code, it can be used by the customer for the customer’s purpose upon installation, and remaining services such as training are not considered highly interdependent or interrelated to the product's functionality.\nFor arrangements that involve significant production, modification or customization of the software, or where software services are otherwise not considered distinct, we recognize revenue over time by measuring progress-to-completion. We measure progress-to-completion primarily using labor hours incurred as it best depicts the transfer of control to the customer which occurs as we incur costs on our contracts. These arrangements are often implemented over an extended period and occasionally require us to revise total cost estimates. Amounts recognized in revenue are calculated using the progress-to-completion measurement after giving effect to any changes in our cost estimates. Changes to total estimated contract costs, if any, are recorded in the period they are determined. Estimated losses on uncompleted contracts are recorded in the period in which we first determine that a loss is apparent.\nSoftware license fees are billed in accordance with the contract terms. Typically, a majority of the fee is due when access to the software license is made available to the customer and the remainder of the fee due over a passage of time stipulated by the contract. We record amounts that have been invoiced in accounts receivable and in deferred revenue or revenues, depending on whether the revenue recognition criteria have been met.\nWe recognize royalty revenue when the sale occurs under the terms of our third-party royalty arrangements. Currently, our third-party royalties are recognized on an estimated basis and adjusted if needed, when we receive notice of amounts we are entitled to receive. We typically receive notice of royalty revenues we are entitled to and billed on a quarterly basis in the quarter immediately following the royalty reporting period.\nSoftware Services\nAs noted above, some of our software arrangements include services considered highly interdependent or highly interrelated or require significant customization to meet the customer's desired functionality. For these software arrangements, both the software licenses and related software services revenue are not distinct and are recognized over time using the progress-to-completion method. We measure progress-to-completion primarily using labor hours incurred as it best depicts the transfer of control to the customer which occurs as we incur costs on our contracts. Contract fees are typically billed on a milestone basis as defined within contract terms. We record amounts that have been invoiced in accounts receivable and in deferred revenue or revenues, depending on whether the revenue recognition criteria have been met. When software services are distinct, the fee allocable to the service element is recognized over the time we perform the services and is billed on a time and material basis.\nPost-Contract Customer Support\nOur customers generally enter into PCS agreements when they purchase our software licenses. PCS includes telephone support, bug fixes, and rights to upgrades on a when-and-if available basis. PCS is considered distinct when purchased with our software licenses. Our PCS agreements are typically renewable annually. PCS is recognized over time on a straight-line basis over the period the PCS is provided. All significant costs and expenses associated with PCS are expensed as incurred.\nComputer Hardware Equipment\nRevenue allocable to computer hardware equipment is recognized at a point in time when control of the equipment is transferred to the customer.\nSubscription-Based Services:\nSubscription-based services consist primarily of revenues derived from SaaS arrangements, typically utilizing the Tyler private cloud, and electronic filing transactions. Revenue from subscription-based services is generally recognized over time on a ratable basis over the contract term, beginning on the date that our service is made available to the customer. Our subscription contracts are generally three to five years or longer in length and billed annually in advance.\nFor SaaS arrangements, we evaluate whether the customer has the contractual right to take possession of our software at any time during the hosting period without significant penalty and whether the customer can feasibly maintain the software on the customer’s hardware or enter into another arrangement with a third-party to host the software. We allocate contract value to each performance obligation of the arrangement that qualifies for treatment as a distinct element based on estimated SSP. We recognize SaaS services ratably over the term of the arrangement, which range from one to ten years, but are typically for a period of three to five years. For software services associated with certain SaaS arrangements, we have concluded that the services are not distinct, and we recognize the revenue ratably over the remaining contractual period once we have provided the customer access to the software. We record amounts that have been invoiced in accounts receivable and in deferred revenue or revenues, depending on whether the revenue recognition criteria have been met.\nElectronic filing transaction fees primarily pertain to documents filed with the courts by attorneys and other third-parties via our e-filing services and retrieval of filed documents via our access services. For each document filed with a court, the filer generally pays a transaction fee and a court filing fee to us and we remit a portion of the transaction fee and the filing fee to the court. We record as revenue the transaction fee, while the portion of the transaction fee remitted to the courts is recorded as cost of revenues as we are acting as a principal in the arrangement. Court filing fees collected on behalf of the courts and remitted to the courts are recorded on a net basis and thus do not affect the statement of comprehensive income.\nOther transaction-based fees primarily relate to online payment services, which are offered with the assistance of third-party vendors. In general, when we are the principal in a transaction based on the factors identified in ASC 606-10-55-36 through 55-40, we record the revenue and related costs on a gross basis. Otherwise, we net the cost of revenue associated with the service against the gross revenue (amount billed to the customer) and record the net amount as revenue.\nFor e-filing transaction fees and certain other transaction-based revenues, we have the right to charge the customer an amount that directly corresponds with the value to the customer of our performance to date. Therefore, we recognize revenue for these services over time based on the amount billable to the customer in accordance with the 'as invoiced' practical expedient in ASC 606-10-55-18. In some cases, we are paid on a fixed fee basis and recognize the revenue ratably over the contractual period.\nCosts of performing services under subscription-based arrangements are expensed as incurred, except for certain direct and incremental contract origination and set-up costs associated with SaaS arrangements. Such direct and incremental costs are capitalized and amortized ratably over the useful life.\nAppraisal Services:\nFor our property appraisal projects, we recognize revenue using the progress-to-completion method since many of these projects are executed over one to three-year periods and consist of various unique activities. Appraisal services require a significant level of integration and interdependency with various individual service components; therefore, the service components are not considered distinct. Appraisal services are recognized over time by measuring progress-to-completion primarily using labor hours incurred as it best depicts the transfer of control to the customer which occurs as we incur costs on our contracts. These arrangements are often executed over an extended period and occasionally require us to revise total cost estimates. Amounts recognized in revenue are calculated using the progress-to-completion measurement after giving effect to any changes in our cost estimates. Changes to total estimated contract costs, if any, are recorded in the period they are determined. Estimated losses on uncompleted contracts are recorded in the period in which we first determine that a loss is apparent. Contract fees are typically billed on a milestone basis as defined within contract terms. We record amounts that have been invoiced in accounts receivable and in deferred revenue or revenues, depending on whether the revenue recognition criteria have been met.\nSignificant Judgments:\nOur contracts with customers often include multiple performance obligations to a customer. When a software arrangement (license or subscription) includes both software licenses and software services, judgment is required to determine whether the software license is considered distinct and accounted for separately, or not distinct and accounted for together with the software services and recognized over time.\nThe transaction price is allocated to the separate performance obligations on a relative SSP basis. We determine the SSP based on our overall pricing objectives, taking into consideration market conditions and other factors, including the value of our contracts, the applications sold, customer demographics, and the number and types of users within our contracts. We use a range of amounts to estimate SSP when we sell each of the products and services separately and need to determine whether there is a discount to be allocated based on the relative SSP of the various products and services. In instances where SSP is not directly observable, such as when we do not sell the product or service separately, we determine SSP using the expected cost-plus margin approach.\nFor arrangements that involve significant production, modification or customization of the software, or where software services otherwise cannot be considered distinct, we recognize revenue as control is transferred to the customer over time using progress-to-completion methods. Depending on the contract, we measure progress-to-completion primarily using labor hours incurred, or value added. The progress-to-completion method generally results in the recognition of reasonably consistent profit margins over the life of a contract because we can provide reasonably dependable estimates of contract billings and contract costs. We use the level of profit margin that is most likely to occur on a contract. If the most likely profit margin cannot be precisely determined, the lowest probable level of profit margin in the range of estimates is used until the results can be estimated more precisely. These arrangements are often implemented over an extended time period and occasionally require us to revise total cost estimates. Amounts recognized in revenue are calculated using the progress-to-completion measurement after giving effect to any changes in our cost estimates. Changes to total estimated contract costs, if any, are recorded in the period they are determined. Estimated losses on uncompleted contracts are recorded in the period in which we first determine that a loss is apparent.\nTypically, the structure of our arrangements does not give rise to variable consideration. However, in those instances whereby variable consideration exists, we include in our estimates, additional revenue for variable consideration when we believe we have an enforceable right, the amount can be estimated reliably and its realization is probable.\nRefer to Note 15 - \"Disaggregation of Revenue\" for further information, including the economic factors that affect the nature, amount, timing, and uncertainty of revenue and cash flows of our various revenue categories.\nContract Balances:\nAccounts receivable and allowance for losses and sales adjustments\nTiming of revenue recognition may differ from the timing of invoicing to customers. We record an unbilled receivable when revenue is recognized prior to invoicing, or deferred revenue when revenue is recognized subsequent to invoicing. For multi-year agreements, we generally invoice customers annually at the beginning of each annual coverage period. We record an unbilled receivable related to revenue recognized for on-premises licenses as we have an unconditional right to invoice and receive payment in the future related to those licenses.\nIn connection with our appraisal services contracts and certain software services contracts, we may perform work prior to when the software and services are billable and/or payable pursuant to the contract. Unbilled revenue is not billable at the balance sheet date but is recoverable over the remaining life of the contract through billings made in accordance with contractual agreements. The termination clauses in most of our contracts provide for the payment for the value of products delivered or services performed in the event of early termination. We have historically recorded such unbilled receivables (costs and estimated profit in excess of billings) in connection with (1) property appraisal services contracts accounted for using progress-to-completion method of revenue recognition using labor hours as a measure of progress towards completion in which the services are performed in one accounting period but the billing normally occurs subsequently and may span another accounting period; (2) software services contracts accounted for using progress-to-completion method of revenue recognition using labor hours as a measure of progress towards completion in which the services are performed in one accounting period but the billing for the software element of the arrangement may be based upon the specific phase of the implementation; (3) software revenue for which we have recognized revenue at the point in time when the software is made available to the customer but the billing has not yet been submitted to the customer; (4) some of our contracts which provide for an amount to be withheld from a progress billing (generally between 5% and 20% retention) until final and satisfactory project completion is achieved; and (5) in a limited number of cases, extended payment terms, which may be granted to customers with whom we generally have a long-term relationship and favorable collection history.\nAs of December 31, 2020, and December 31, 2019, total current and long-term accounts receivable, net of allowance for losses and sales adjustments, was $403.7 million and $396.5 million, respectively. We have recorded unbilled receivables of $140.8 million and $134.0 million at December 31, 2020, and December 31, 2019, respectively. Included in unbilled receivables are retention receivables of $13.1 million at December 31, 2020, and December 31, 2019, which become payable upon the completion of the contract or completion of our fieldwork and formal hearings. Unbilled receivables expected to be collected within one year have been included with accounts receivable, current portion in the accompanying consolidated balance sheets. Unbilled receivables and retention receivables expected to be collected past one year have been included with accounts receivable, long-term portion in the accompanying consolidated balance sheets.\nPayment terms and conditions vary by contract type, although terms generally include a requirement of payment within 30 to 90 days. In instances where the timing of revenue recognition differs from the timing of invoicing, we have determined our contracts generally do not include a significant financing component. The primary purpose of our invoicing terms is to provide customers with simplified and predictable ways of purchasing our products and services, not to receive financing from our customers or to provide customers with financing. Examples include invoicing at the beginning of a subscription term with revenue recognized ratably over the contract period, and multi-year on-premises term licenses that are invoiced annually with revenue recognized upfront.\nWe maintain allowances for losses and sales adjustments, which losses are recorded against revenue at the time the loss is incurred. Since most of our clients are domestic governmental entities, we rarely incur a credit loss resulting from the inability of a client to make required payments. Events or changes in circumstances that indicate the carrying amount for the allowances for losses and sales adjustments may require revision, include, but are not limited to, managing our client’s expectations regarding the scope of the services to be delivered and defects or errors in new versions or enhancements of our software products. Our allowance for losses and sales adjustments of $9.3 million and $5.7 million at December 31, 2020, and December 31, 2019, respectively, does not include provisions for credit losses. As of January 1, 2020, we adopted ASU 2016-13 and primarily evaluated our historical experience with credit losses related to trade and other receivables. Because we have not experienced any historical credit losses with the majority of our clients, we have no basis to record a reserve for credit losses as defined by the standard.\nThe following table summarizes the changes in the allowance for losses and sales adjustments:\nYears ended December 31,\n2020 2019 2018\nBalance at beginning of year $ 5,738 $ 4,647 $ 5,427\nProvisions for losses and sales adjustments - accounts receivable 3,517 1,636 (569)\nCollections of accounts previously written off - (545) (211)\nBalance at end of year $ 9,255 $ 5,738 $ 4,647\nDeferred Revenue\nThe majority of deferred revenue consists of deferred maintenance revenue that has been billed based on contractual terms in the underlying arrangement, with the remaining balance consisting of payments received in advance of revenue being earned under software licensing, subscription-based services, software and appraisal services and hardware installation. Refer to Note 16 - \"Deferred Revenue and Performance Obligations\" for further information, including deferred revenue by segment and changes in deferred revenue during the period.\nDeferred Commissions\nSales commissions earned by our sales force are considered incremental and recoverable costs of obtaining a contract with a customer. Sales commissions for initial contracts are deferred and then amortized commensurate with the recognition of associated revenue over a period of benefit that we have determined to be three to seven years. We utilized the \"portfolio approach\" practical expedient in ASC 606-10-10-4, which allows entities to apply the guidance to a portfolio of contracts with similar characteristics because the effects on the financial statements of this approach would not differ materially from applying the guidance to individual contracts. Using the \"portfolio approach\", we determined the period of benefit by taking into consideration our customer contracts, our technology life-cycle and other factors. Sales commissions for renewal contracts are generally not paid in connection with the renewal of a contract. In the small number of instances where a commission is paid on a renewal, it is not commensurate with the commission paid on the initial sale and is recognized over the term of renewal, which is generally one year. Amortization expense related to deferred commissions is included in selling, general and administrative expenses in the accompanying consolidated statements of income. Refer to Note 17 - \"Deferred Commissions\" for further information.\nPrepaid expenses and other current assets include direct and incremental costs such as commissions associated with arrangements for which revenue recognition has been deferred. Such costs are expensed at the time the related revenue is recognized.\nUSE OF ESTIMATES\nThe preparation of our financial statements in conformity with accounting principles generally accepted in the United States (“GAAP”) requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Significant items subject to such estimates and assumptions include revenue recognition, determining the nature and timing of satisfaction of performance obligations, determining the SSP of performance obligations, variable consideration, and other obligations such as returns and refunds; loss contingencies; the estimated useful life of deferred commissions; the carrying amount and estimated useful lives of intangible assets; the carrying amount of operating lease right-of-use assets and operating lease liabilities; determining share-based compensation expense; the allowance for losses and sales adjustments; and determining the potential outcome of future tax consequences of events that have been recognized on our consolidated financial statements or tax returns. Actual results could differ from estimates.\nPROPERTY AND EQUIPMENT, NET\nProperty, equipment and purchased software are recorded at original cost and increased by the cost of any significant improvements after purchase. We expense maintenance and repairs when incurred. Depreciation and amortization is calculated using the straight-line method over the shorter of the asset’s estimated useful life or the term of the lease in the case of leasehold improvements. For income tax purposes, we use accelerated depreciation methods as allowed by tax laws.\nRESEARCH AND DEVELOPMENT COSTS\nWe expensed research and development expense of $88.4 million in 2020, $81.3 million in 2019, and $63.3 million in 2018.\nINCOME TAXES\nIncome taxes are accounted for under the asset and liability method. Deferred taxes arise because of different treatment between financial statement accounting and tax accounting, known as “temporary differences\". We record the tax effect of these temporary differences as “deferred tax assets” (generally items that can be used as a tax deduction or credit in the future periods) and “deferred tax liabilities” (generally items that we received a tax deduction for, which have not yet been recorded in the income statement). The deferred tax assets and liabilities are measured using enacted tax rules and laws that are expected to be in effect when the temporary differences are expected to be recovered or settled. A valuation allowance would be established to reduce deferred tax assets if it is more likely than not that a deferred tax asset will not be \"realized\".\nSHARE-BASED COMPENSATION\nWe have a share-based award plan that provides for the grant of stock options, restricted stock units, and performance share units to key employees, directors and non-employee consultants. Stock options generally vest after three to six years of continuous service from the date of grant and have a contractual term of 10 years. Restricted stock unit grants generally vest ratably over three to five years of continuous service from the date of grant. Each performance share unit represents the right to receive one share of our common stock based on our achievement of certain financial performance targets during applicable performance periods. We account for share-based compensation utilizing the fair value recognition pursuant to ASC 718, Stock Compensation. See Note 9 - “Share-Based Compensation” for further information.\nGOODWILL AND OTHER INTANGIBLE ASSETS\nGoodwill\nGoodwill represents the excess of the purchase price over the fair value of net assets acquired, including identifiable intangible assets, in connection with our business combinations. Upon acquisition, goodwill is assigned to the reporting unit that is expected to benefit from the synergies of the business combination, which is the reporting unit to which the related acquired technology is assigned. A reporting unit is the operating segment, or a business unit one level below that operating segment, for which discrete financial information is prepared and regularly reviewed by executive management.\nWe assess goodwill for impairment annually as of April 1st, or more frequently whenever events or changes in circumstances indicate its carrying value may not be recoverable. We begin with the qualitative assessment of whether it is more likely than not that a reporting unit's fair value is less than its carrying value before applying the quantitative assessment described below. If it is determined through the evaluation of events or circumstances that the carrying value may not be recoverable, we perform a comparison of the estimated fair value of the reporting unit to which the goodwill has been assigned to the sum of the carrying value of the assets and liabilities of that unit. If the sum of the carrying value of the assets and liabilities of a reporting unit exceeds the estimated fair value of that reporting unit, an impairment charge is recorded against goodwill for the amount of that excess. The impairment is limited to the amount of goodwill in that reporting unit. The fair values calculated in our impairment tests are determined using discounted cash flow models involving several assumptions. The assumptions that are used are based upon what we believe a hypothetical marketplace participant would use in estimating fair value. We evaluate the reasonableness of the fair value calculations of our reporting units by comparing the total of the fair value of all of our reporting units to our total market capitalization.\nAs part of our annual impairment test, our qualitative assessments included our estimated effects of COVID-19 for all reporting units except for the data and insights reporting unit. As a result of these qualitative assessments, we determined that it was not more likely than not that an impairment existed; therefore, we did not perform a Step 1 quantitative impairment test. We did perform a quantitative assessment for goodwill of $75.7 million associated with our data and insights business unit and concluded no impairment existed as of our annual assessment date. For most of our reporting units, goodwill relates to a combination of legacy and acquired businesses and as a result those units have fair values that substantially exceed their underlying carrying values. For other reporting units, in particular our platform technologies and data and insights units, goodwill entirely relates to recently acquired businesses, and as a result those units do not have significant excess fair values over carrying values. The platform technologies and data and insights business units combined goodwill was $152.0 million, or 18%, of total goodwill as of December 31, 2020. Our annual goodwill impairment analysis did not result in an impairment charge. During 2020, we have recorded no impairment to goodwill as no triggering events or changes in circumstances indicating a potential impairment have occurred as of period-end. However, due to significant uncertainty surrounding COVID-19 and market conditions, there are no assurances conditions will not deteriorate in the future.\nDetermining the fair value of our reporting units involves the use of significant estimates and assumptions and considerable management judgment. We base our fair value estimates on assumptions we believe to be reasonable at the time, but such assumptions are subject to inherent uncertainty. Changes in market conditions or other factors outside of our control, such as a worsening of expected impact of COVID-19, could cause us to change key assumptions and our judgment about a reporting unit’s prospects. Similarly, in a specific period, a reporting unit could significantly underperform relative to its historical or projected future operating results. Either situation could result in a meaningfully different estimate of the fair value of our reporting units, and a consequent future impairment charge.\nThere have been no impairments to goodwill in any of the periods presented. See Note 4 - \"Goodwill and Other Intangible Assets\" for additional information.\nOther Intangible Assets\nWe make judgments about the recoverability of purchased intangible assets other than goodwill whenever events or changes in circumstances indicate that an impairment may exist. Customer base and acquired software each comprise approximately half of our purchased intangible assets other than goodwill. We review our customer turnover each year for indications of impairment. Our customer turnover has historically been very low. If indications of impairment are determined to exist, we measure the recoverability of assets by a comparison of the carrying amount of the asset to the estimated undiscounted future cash flows expected to be generated by the asset. If the carrying amount of the assets exceeds their estimated future cash flows, an impairment charge is recognized for the amount by which the carrying amount of the assets exceeds the fair value of the assets. There have been no impairments of intangible assets in any of the periods presented.\nIMPAIRMENT OF LONG-LIVED ASSETS\nWe periodically evaluate whether current facts or circumstances indicate that the carrying value of our property and equipment or other long-lived assets to be held and used may not be recoverable. If such circumstances are determined to exist, we measure the recoverability of assets to be held and used by a comparison of the carrying amount of the asset or appropriate grouping of assets and the estimated undiscounted future cash flows expected to be generated by the assets. If the carrying amount of the assets exceeds their estimated future cash flows, an impairment charge is recognized for the amount by which the carrying amount of the assets exceeds the fair value of the assets. Assets to be disposed of would be separately presented in the balance sheet and reported at the lower of the carrying amount or fair value less costs to sell and would no longer be depreciated. The assets and liabilities of a disposal group classified as held for sale would be presented separately in the appropriate asset and liability sections of the balance sheet. There was no impairment of long-lived assets in any of the periods presented.\nCOSTS OF COMPUTER SOFTWARE\nWe capitalize software development costs upon the establishment of technological feasibility and prior to the availability of the product for general release to customers. Software development costs primarily consist of personnel costs and rent for related office space. During the twelve months period ended December 31, 2020 and 2019, respectively, we capitalized approximately $5.8 million and $4.8 million 2019 of software development costs. We begin to amortize capitalized costs when a product is available for general release to customers. Amortization expense is determined on a product-by-product basis at a rate not less than straight-line basis over the product’s remaining estimated economic life of, generally, five years. Amortization of software development costs was approximately $1.2 million in 2020 and $0.3 million in 2019, and is included in cost of software license revenue in the accompanying consolidated statements of comprehensive income. We have not capitalized any internal use software development costs in any of the periods presented.\nCONTINGENT PURCHASE CONSIDERATION\nContingent future cash payments related to acquisitions are recognized at fair value as of the acquisition date and included in the determination of the acquisition date purchase price. Subsequent changes in the fair value of the contingent future cash payments are recognized in earnings in the period that the change occurs.\nFAIR VALUE OF FINANCIAL INSTRUMENTS\nCash and cash equivalents, accounts receivables, accounts payables, short-term obligations and certain other assets at cost approximate fair value because of the short maturity of these instruments. The fair value of our revolving line of credit would approximate book value as of December 31, 2020, because our interest rates reset approximately every 30 days or less. See Note 6 - “Revolving Line of Credit” for further discussion.\nAs of December 31, 2020, we have $154.8 million in investment grade corporate bonds, municipal bonds and asset-backed securities with maturity dates ranging from 2021 through 2028. We intend to hold these bonds to maturity and have classified them as such. We believe cost approximates fair value because of the relatively short duration of these investments. The fair values of these securities are considered Level II as they are based on inputs from quoted prices in markets that are not active or other observable market data. These investments are presented at amortized cost and are included in short-term investments and non-current investments in the accompanying condensed consolidated balance sheets. As of December 31, 2020, we have an accrued interest receivable balance of approximately $896,000 which is included in accounts receivable, net. We do not measure an allowance for credit losses for accrued interest receivables. We record any losses within the maturity period of the investment and any write-offs to accrued interest receivables are recorded as a reduction to interest income in the period of the loss. During the twelve months ended December 31, 2020, we have recorded no credit losses. Interest income and amortization of discounts and premiums are included in other income, net in the accompanying consolidated statements of income.\nDuring 2020, we sold our $15.0 million investment in convertible preferred stock representing a 20% interest in Record Holdings Pty Limited, a privately held Australian company specializing in digitizing the spoken word in court and legal proceedings to BFTR, LLC, a wholly owned subsidiary of Bison Capital Partners V L.P. During the same period, we purchased $10.0 million in common stock representing a 18% interest in BFTR, LLC. The investment in common stock is accounted under the cost method because we do not have the ability to exercise significant influence over the investee and the securities do not have readily determinable fair values. Our investment is carried at cost less any impairment write-downs. Periodically, our cost method investments are assessed for impairment. We do not reassess the fair value of cost method investments if there are no identified events or changes in circumstances that may have a significant adverse effect on the fair value of the investments. No events or changes in circumstances have occurred during the period that require reassessment. There has been no impairment of our cost method investment for the periods presented. This investment is included in non-current investments and other assets in the accompanying consolidated balance sheets.\nCONCENTRATIONS OF CREDIT RISK\nFinancial instruments that potentially subject us to significant concentrations of credit risk consist principally of cash and cash equivalents, accounts receivable from trade customers, and investments in marketable securities. Our cash and cash equivalents primarily consist of operating account balances and money market funds, which are maintained at several major domestic financial institutions and the balances often exceed insured amounts. As of December 31, 2020, we had cash and cash equivalents of $603.6 million. We perform periodic evaluations of the credit standing of these financial institutions.\nConcentrations of credit risk with respect to receivables are limited due to the size and geographical diversity of our customer base. Historically, our credit losses have not been significant. As a result, we do not believe we have any significant concentrations of credit risk as of December 31, 2020.\nWe maintain allowances for losses and sales adjustments, which are provided at the time the revenue is recognized. Since most of our customers are domestic governmental entities, we rarely incur a loss resulting from the inability of a customer to make required payments. Events or changes in circumstances that indicate the carrying amount for the allowances for losses and sales adjustments may require revision include, but are not limited to, deterioration of a customer’s financial condition, failure to manage our customer’s expectations regarding the scope of the services to be delivered, and defects or errors in new versions or enhancements of our software products.\nLEASES\nWe determine if an arrangement is a lease at inception. Operating leases are included in operating lease right-of-use (“ROU”) assets, and operating lease liabilities, current and long-term, on our consolidated balance sheets. We currently do not have any finance lease arrangements.\nOperating lease ROU assets and operating lease liabilities are recognized based on the present value of the future minimum lease payments over the lease term at commencement date. As most of our leases do not provide an implicit rate, we use our incremental borrowing rate based on the information available at commencement date of the lease in determining the present value of future payments. The operating lease ROU asset also includes any lease payments made and excludes lease incentives and initial direct costs incurred. Our lease terms may include options to extend or terminate the lease when it is reasonably certain that we will exercise that option. Lease expense for minimum lease payments is recognized on a straight-line basis over the lease term. Leases with an initial term of 12 months or less are not recorded on the balance sheet; we recognize lease expense for these leases on a straight-line basis over the lease term. We have lease agreements with lease and non-lease components, which are generally accounted for as a single lease component.\nINDEMNIFICATION\nMost of our software license agreements indemnify our customers in the event that the software sold infringes upon the intellectual property rights of a third-party. These agreements typically provide that in such event we will either modify or replace the software so that it becomes non-infringing or procure for the customer the right to use the software. We have recorded no liability associated with these indemnifications, as we are not aware of any pending or threatened infringement actions that are possible losses. We believe the estimated fair value of these intellectual property indemnification clauses is minimal.\nWe have also agreed to indemnify our officers and board members if they are named or threatened to be named as a party to any proceeding by reason of the fact that they acted in such capacity. We maintain directors’ and officers’ liability insurance coverage to protect against any such losses. We have recorded no liability associated with these indemnifications. Because of our insurance coverage, we believe the estimated fair value of these indemnification agreements is minimal.\nRECLASSIFICATIONS\nCertain amounts for previous years have been reclassified to conform to the current year presentation. As of January 1, 2020, the land and vital records management business unit, which was previously reported in the ES segment, was moved to the A&T segment to reflect changes in the way in which management makes operating decisions, allocates resources, and manages the growth and profitability of the Company. Prior year amounts for the ES and A&T segments have been adjusted to reflect the segment change. See Note 14 - \"Segment and Related Information\" for additional information.\nRECENTLY ADOPTED ACCOUNTING PRONOUNCEMENTS\nIn June 2016, the FASB issued ASU 2016-13, Financial Instruments - Credit Losses, (“ASU 2016-13”). ASU 2016-13 changes the impairment model for most financial assets and certain other instruments, including trade and other receivables, available for-sale debt securities, held-to-maturity debt securities and loans, and requires entities to use a new forward-looking expected loss model that will result in the earlier recognition of an allowance for losses. This update is effective for fiscal years beginning after December 15, 2019, including interim periods within those fiscal years. Early adoption is permitted for a fiscal year beginning after December 15, 2018, including interim periods within that fiscal year. Entities apply the standard’s provisions as a cumulative-effect adjustment to retained earnings as of the beginning of the first reporting period in which the guidance is adopted. As of January 1, 2020, we adopted the new standard with no material impact of credit losses to our trade and other receivables, held-to-maturity debt securities and retained earnings included in our condensed consolidated financial statements.\nOn January 26, 2017, the FASB issued ASU No. 2017-04, Simplifying the Test for Goodwill Impairment. The new standard eliminates Step 2 from the goodwill impairment test. An entity should recognize a goodwill impairment charge for the amount by which the carrying amount exceeds the reporting unit's fair value. This standard is effective for public business entities in fiscal years beginning after December 15, 2019, and the standard was adopted and applied prospectively by the Company as of January 1, 2020, but it did not have a significant impact on the Company's financial statements and disclosures.\nNEW ACCOUNTING PRONOUNCEMENTS\nIn December 2019, the FASB issued ASU 2019-12, Simplifying the Accounting for Income Taxes, (\"ASU 2019-12\") which simplifies the accounting for income taxes, eliminates certain exceptions within ASC 740, Income Taxes, and clarifies certain aspects of the current guidance to promote consistency among reporting entities. The new standard is effective for fiscal years beginning after December 15, 2020. Most amendments within the standard are required to be applied on a prospective basis, while certain amendments must be applied on a retrospective or modified retrospective basis. We do not expect adoption of this standard to have a material effect on our consolidated financial statements.\n(2)ACQUISITIONS\nOn October 30, 2019, we acquired certain assets of Courthouse Technologies, Ltd (\"CHT\"), an industry-leading provider of jury management systems that offers a fully integrated, end-to-end SaaS solution to manage all facets of juror management, from source list generation to juror processing and payment. The total purchase price was approximately $20.4 million paid in cash.\nIn 2020, our final valuation of the fair market value of CHT's assets and liabilities resulted in the adjustment to the preliminary opening balance sheet. These adjustments related to an increased allocation to customer related intangibles and reduction to goodwill of approximately $1.7 million.\nOn February 28, 2019, we acquired all of the capital stock of MP Holdings Parent, Inc. dba MicroPact (\"MicroPact\"), a leading provider of commercial off-the-shelf (\"COTS\") solutions, including entellitrak®, a low-code application development platform for case management and business process management used extensively in the public sector. The total purchase price, net of cash acquired of $2.0 million, was approximately $201.8 million consisting of $198.2 million paid in cash.\nIn 2020, we paid $5.6 million in contingent consideration. We have no contingent consideration accrued as of December 31, 2020.\nOn February 1, 2019, we acquired all the assets of Civic, LLC (\"MyCivic\"), a company that provides software solutions to connect communities. The total purchase price was $3.7 million in cash.\nAs of December 31, 2020, the purchase price allocations for CHT, MicroPact and MyCivic are complete. Our balance sheet as of December 31, 2020, reflects the allocation of the purchase price to the assets acquired based on their fair value at the date of each acquisition. The fair value of the assets and liabilities acquired are based on valuations using Level III, unobservable inputs that are supported by little or no market activity and that are significant to the fair value of the assets or liabilities.\nThe operating results of all 2019 acquisitions are included with the operating results of the Enterprise Software segment since their date of acquisition. In 2019, we incurred fees of approximately $1.1 million for financial advisory, legal, accounting, due diligence, valuation and other various services necessary to complete these acquisitions. These fees were expensed in 2019 and are included in selling, general and administrative expenses on the consolidated statement of comprehensive income.\n(3)PROPERTY AND EQUIPMENT, NET\nProperty and equipment, net consists of the following at December 31:\nUseful\nLives\n(years) 2020 2019\nLand - $ 18,653 $ 18,653\nBuilding and leasehold improvements 5-39\n147,729 137,448\nComputer equipment and purchased software 3-5\n108,571 99,435\nFurniture and fixtures 5 30,666 28,506\nTransportation equipment 5 295 402\n305,914 284,444\nAccumulated depreciation and amortization (137,910) (112,583)\nProperty and equipment, net $ 168,004 $ 171,861\nDepreciation expense was $25.5 million in 2020, $23.4 million in 2019, and $21.2 million in 2018.\nWe paid $9.9 million and $20.8 million for real estate and the expansion of existing buildings in 2020 and 2019, respectively.\n(4)GOODWILL AND OTHER INTANGIBLE ASSETS\nThe changes in the carrying amount of goodwill for the two years ended December 31, 2020 are as follows:\nEnterprise\nSoftware Appraisal\nand Tax Total\nBalance as of 12/31/2018 $ 739,550 $ 14,168 $ 753,718\nGoodwill acquired related to the purchase of MicroPact 76,319 - 76,319\nGoodwill acquired related to other acquisitions 10,080 - 10,080\nBalance as of 12/31/2019 825,949 14,168 840,117\nPurchase price adjustments related to CHT acquisition (1,689) - (1,689)\nBalance as of 12/31/2020 $ 824,260 $ 14,168 $ 838,428\nOther intangible assets and related accumulated amortization consists of the following at December 31:\n2020 2019\nGross carrying amount of other intangibles:\nCustomer related intangibles $ 322,619 $ 321,019\nAcquired software 262,286 262,286\nTrade names 22,905 22,905\nCapitalized software development costs 10,581 4,804\nLeases acquired 5,037 5,037\n623,428 616,051\nAccumulated amortization (292,239) (237,137)\nTotal other intangibles, net $ 331,189 $ 378,914\nAmortization expense for acquired software and capitalized software development costs are recorded to cost of revenues. Amortization expense for customer relationships and trade names are recorded to selling, general and administrative expenses. Total amortization expense for other intangibles was $55.1 million in 2020, $52.8 million in 2019, and $39.6 million in 2018.\nThe amortization periods of other intangible assets is summarized in the following table:\nDecember 31, 2020 December 31, 2019\nGross\nCarrying\nAmount Weighted\nAverage\nAmortization\nPeriod Accumulated Amortization Gross\nCarrying\nAmount Weighted\nAverage\nAmortization\nPeriod Accumulated Amortization\nNon-amortizable intangibles:\nGoodwill $ 838,428 - $ - $ 840,117 - $ -\nAmortizable intangibles:\nCustomer related intangibles $ 322,619 16 years $ 116,609 $ 321,019 16 years $ 97,320\nAcquired software 262,286 7 years 162,378 262,286 7 years 130,416\nTrade names 22,905 11 years 9,366 22,905 11 years 7,205\nCapitalized software development costs 10,581 5 years 1,460 4,804 5 years 296\nLeases acquired 5,037 9 years 2,426 5,037 9 years 1,900\nEstimated annual amortization expense related to acquired leases will be recorded as a reduction to hardware and other revenue and is expected to be $525,000 in 2021, $525,000 in 2022, $525,000 in 2023, $525,000 in 2024, $397,000 in 2025, and $114,000 thereafter.\nEstimated annual amortization expense related to other intangibles, including customer relationships, acquired software, trade names and capitalized software development costs. Capitalized software in progress of $4.5 million has been excluded from the estimated annual amortization expense table below:\n2021 $ 54,411\n2022 50,713\n2023 32,562\n2024 31,978\n2025 30,622\nThereafter 123,805\n$ 324,091\n(5)ACCRUED LIABILITIES\nAccrued liabilities consist of the following at December 31:\n2020 2019\nAccrued wages, bonuses and commissions $ 63,814 $ 49,126\nOther accrued liabilities 19,270 26,108\n$ 83,084 $ 75,234\n(6)REVOLVING LINE OF CREDIT\nOn September 30, 2019, we entered into a $400 million credit agreement (the “Credit Facility”) with the various lenders party thereto and Wells Fargo Bank, National Association, as Administrative Agent. The Credit Facility provides for unsecured revolving credit in an aggregate principal amount of up to $400 million, including a $25 million sublimit for letters of credit. The Credit Facility matures on September 30, 2024. Borrowings under the Credit Facility may be used for general corporate purposes, including working capital requirements, acquisitions and share repurchases.\nBorrowings under the Credit Facility bear interest at a rate of either (1) Wells Fargo Bank’s prime rate (subject to certain higher rate determinations) plus a margin of 0.125% to 0.75% or (2) the 30, 60, 90 or 180-day LIBOR rate plus a margin of 1.125% to 1.75%. As of December 31, 2020, our interest rate was 3.38% under the prime rate option or approximately 1.27% under the 30-day LIBOR option. The Credit Facility requires us to maintain certain financial ratios and other financial conditions and prohibits us from making certain investments, advances, cash dividends or loans, and limits incurrence of additional indebtedness and liens. As of December 31, 2020, we were in compliance with those covenants.\nAt December 31, 2020, we had no outstanding borrowings and had unused borrowing capacity of $400 million under the Credit Facility. In addition, as of December 31, 2020, we had one outstanding standalone letter of credit totaling $2 million in favor of a client contract. The letter of credit guarantees our performance under the contract and expires in 2021.\nWe paid interest of $610,000 in 2020, $1,750,000 in 2019, and $770,000 in 2018.\n(7)INCOME TAX\nIncome tax (benefit) provision on income from operations consists of the following:\nYears Ended December 31,\n2020 2019 2018\nCurrent:\nFederal $ (10,538) $ 12,814 $ 9,110\nState (1,304) 6,585 4,367\n(11,842) 19,399 13,477\nDeferred (7,936) (6,088) (5,069)\n$ (19,778) $ 13,311 $ 8,408\nReconciliation of the U.S. statutory income tax rate to our effective income tax expense rate for operations follows:\nYears Ended December 31,\n2020 2019 2018\nFederal income tax expense at statutory rate $ 36,759 $ 33,566 $ 32,733\nState income tax, net of federal income tax benefit 6,677 6,999 7,953\nNet operating loss carryback (3,445) - -\nExcess tax benefits of share-based compensation (60,190) (29,819) (32,487)\nAdjustments from the 2017 Tax Cuts and Jobs Act - - (1,750)\nTax credits (3,867) (3,446) (3,715)\nNon-deductible business expenses 4,199 6,011 5,655\nOther, net 89 - 19\n$ (19,778) $ 13,311 $ 8,408\nThe Coronavirus Aid, Relief and Economic Security (\"CARES\") Act, which was signed into law on March 27, 2020, provides an estimated $2.2 trillion to fight the COVID-19 pandemic and stimulate the U.S. economy. The assistance includes tax relief and government loans, and investments and grants for entities in affected industries (e.g., health care, airlines). The business tax provisions of the CARES Act include temporary changes to income and non-income based tax laws, including the ability to utilize net operating losses, interest expense deductions, alternative minimum tax credit refunds, charitable contributions, and depreciation of qualified improvement property. Measures not related to income-based taxes include (1) allowing an employer to pay its share of Social Security payroll taxes that would otherwise be due from the date of enactment through December 31, 2020, over the following two years and (2) allowing eligible employers subject to closure due to the COVID-19 pandemic to receive a 50% credit on qualified wages against their employment taxes each quarter, with any excess credits eligible for refunds.\nThe most significant provision of the CARES Act impacting our accounting for income taxes is the five-year carryback allowance for taxable net operating losses generated in tax years in which the statutory federal income tax rate is 21.0%, to periods in which the statutory federal income tax rate is 35.0%. We intend to carry back our 2020 taxable loss into our 2015 tax year, which results in a $3.4 million income tax benefit in the current year.\nThe tax effects of the major items recorded as deferred tax assets and liabilities as of December 31 are:\n2020 2019\nDeferred income tax assets:\nOperating expenses not currently deductible $ 9,084 $ 10,214\nStock option and other employee benefit plans 17,446 19,308\nLoss and credit carryforwards 27,199 23,841\nTotal deferred income tax assets 53,729 53,363\nValuation allowance (1,490) (1,923)\nTotal deferred income tax assets, net of valuation allowance 52,239 51,440\nDeferred income tax liabilities:\nIntangible assets (76,766) (84,019)\nProperty and equipment (9,918) (9,265)\nPrepaid expenses (6,869) (4,922)\nDeferred revenue 807 (1,676)\nTotal deferred income tax liabilities (92,746) (99,882)\nNet deferred income tax liabilities $ (40,507) $ (48,442)\nAs of December 31, 2020, we had federal net operating loss carryforwards of approximately $81.5 million, after-tax state net operating loss carryforwards of approximately $3.5 million, and tax credit carryforwards of approximately $8.6 million. The federal net operating loss carryforward will begin to expire in 2032 if not utilized, and a portion of the state net operating loss and tax credit carryforwards begin expiring in 2021 if not utilized.\nThe acquired carryforwards are subject to an annual limitation but are expected to be realized with the exception of certain state net operating loss and tax credit carryforwards. The valuation allowance disclosed in the table above relates to state net operating losses and tax credit carryforwards that are likely to expire before utilization. We believe it is more likely than not that all other deferred tax assets will be realized. However, the amount of the deferred tax asset considered realizable could be adjusted in the future if estimates of reversing taxable temporary differences are revised.\nIn connection with the acquisition of Socrata in 2018, we recorded a $1.9 million liability for an uncertain tax position associated with acquired tax credit carryforwards. The unrecognized tax benefits are included in deferred income taxes in our consolidated balance sheets. The entire amount, if recognized, would affect the effective tax rate. There was no change in the balance of unrecognized tax benefits during 2020. Based on the information currently available, we do not anticipate a significant increase or decrease to our tax contingencies for these issues for the next 12 months.\nWe are subject to U.S. federal income tax, as well as income tax of multiple state, local and foreign jurisdictions. We are routinely subject to income tax examinations by these taxing jurisdictions, but we do not have a history of, nor do we expect, any material adjustments as a result of these examinations. With few exceptions, major U.S. federal, state, local and foreign jurisdictions are no longer subject to examination for years before 2015. As of February 19, 2021, no significant adjustments have been proposed by any taxing jurisdiction.\nWe paid income taxes, net of refunds received, of $3.3 million in 2020, $21.3 million in 2019, and $6.8 million in 2018.\n(8)SHAREHOLDERS’ EQUITY\nThe following table details activity in our common stock:\nYears Ended December 31,\n2020 2019 2018\nShares Amount Shares Amount Shares Amount\nStock option exercises 1,174 $ 124,363 999 $ 96,908 1,126 $ 74,907\nPurchases of common stock (59) (15,484) (72) (14,289) (781) (150,050)\nEmployee stock plan purchases 40 10,912 53 9,576 45 8,051\nRestricted stock units vested, net of withheld shares upon award settlement 76 (12,923) 53 (5,361) - -\nAs of February 19, 2021, we had authorization from our board of directors to repurchase up to 2.5 million additional shares of our common stock.\n(9)SHARE-BASED COMPENSATION\nShare-Based Compensation Plan\nIn May 2018, stockholders approved the Tyler Technologies, Inc. 2018 Stock Incentive Plan (\"the 2018 Plan\") which amended and restated the existing Tyler Technologies, Inc. 2010 Stock Option Plan (\"the 2010 Plan\"). Upon stockholder approval of the 2018 Plan, the remaining shares available for grant under the 2010 Plan were added to the shares authorized for grant under the 2018 Plan. Additionally, any awards previously granted under the 2010 Plan that expire unexercised or are forfeited are added to the shares authorized for grant under the 2018 Plan.\nDuring fiscal year 2020, we granted stock awards under the 2018 Plan in the form of stock options, restricted stock units and performance share units. Stock options generally vest after three to six years of continuous service from the date of grant and have a contractual term of 10 years. Once options become exercisable, the employee can purchase shares of our common stock at the market price on the date we granted the option. Restricted stock unit grants generally vest ratably over three to five years of continuous service from the date of grant. Each performance share unit represents the right to receive one share of our common stock based on our achievement of certain financial performance targets during applicable performance periods. We account for share-based compensation utilizing the fair value recognition pursuant to ASC 718, Stock Compensation.\nAs of December 31, 2020, there were 2.5 million shares available for future grants under the plan from the 22.9 million shares previously approved by the shareholders.\nDetermining Fair Value of Stock Compensation\nValuation and Amortization Method. We estimate the fair value of stock option awards granted using the Black-Scholes option valuation model. For restricted stock unit and performance stock unit awards, we amortize the fair value of all awards on a straight-line basis over the requisite service periods, which are generally the vesting periods.\nExpected Life. The expected life of awards granted represents the period of time that they are expected to be outstanding. The expected life represents the weighted-average period the stock options are expected to be outstanding based primarily on the options’ vesting terms, remaining contractual life and the employees’ expected exercise based on historical patterns.\nExpected Volatility. Using the Black-Scholes option valuation model, we estimate the volatility of our common stock at the date of grant based on the historical volatility of our common stock.\nRisk-Free Interest Rate. We base the risk-free interest rate used in the Black-Scholes option valuation model on the implied yield currently available on U.S. Treasury zero-coupon issues with an equivalent remaining term equal to the expected life of the award.\nExpected Dividend Yield. We have not paid any cash dividends on our common stock in more than ten years and we do not anticipate paying any cash dividends in the foreseeable future. Consequently, we use an expected dividend yield of zero in the Black-Scholes option valuation model.\nExpected Forfeitures. We use historical data to estimate pre-vesting option forfeitures. We record share-based compensation only for those awards that are expected to vest.\nThe following weighted average assumptions were used for options granted:\nYears Ended December 31,\n2020 2019 2018\nExpected life (in years) 5.0 6.0 6.0\nExpected volatility 27.0 % 26.6 % 26.7 %\nRisk-free interest rate 0.4 % 1.8 % 2.7 %\nExpected forfeiture rate - % - % - %\nShare-Based Award Activity\nThe following table summarizes restricted stock unit and performance stock unit activity during fiscal year 2020 (shares in thousands):\nNumber of Shares Weighted Average Grant Date Fair Value per Share\nUnvested at January 1, 2019 334 $ 221.25\nGranted 256 241.19\nVested (76) 221.15\nForfeited (14) 229.75\nUnvested at December 31, 2019 500 231.57\nGranted 204 379.94\nVested (110) 232.59\nForfeited (7) 266.94\nUnvested at December 31, 2020 587 $ 282.45\nOptions granted, exercised, forfeited and expired are summarized as follows:\nNumber of\nShares Weighted\nAverage Exercise\nPrice Weighted\nAverage\nRemaining\nContractual Life\n(Years) Aggregate\nIntrinsic Value\nOutstanding at December 31, 2017 4,817 $ 107.91\nGranted 432 208.21\nExercised (1,126) 66.53\nForfeited (31) 158.80\nOutstanding at December 31, 2018 4,092 129.51\nGranted 162 251.58\nExercised (999) 96.92\nForfeited (29) 174.54\nOutstanding at December 31, 2019 3,226 145.27\nGranted 128 403.99\nExercised (1,174) 105.97\nForfeited (3) 165.93\nOutstanding at December 31, 2020 2,177 $ 181.63 6 $ 554,709\nExercisable at December 31, 2020 1,424 $ 155.06 6 $ 400,814\nWe had unvested options to purchase approximately 752,000 shares with a weighted average grant date exercise price of $231.93 as of December 31, 2020, and unvested options to purchase approximately 1.2 million shares with a weighted average grant date exercise price of $188.48 as of December 31, 2019.\nOther information pertaining to option activity was as follows during the twelve months ended December 31:\n2020 2019 2018\nWeighted average grant-date fair value of stock options granted $ 98.69 $ 74.54 $ 66.52\nTotal intrinsic value of stock options exercised $ 292,394 $ 155,899 $ 176,716\nShare-Based Compensation Expense\nThe following table summarizes share-based compensation expense related to share-based awards which is recorded in the consolidated statements of comprehensive income:\nYears Ended December 31,\n2020 2019 2018\nCost of subscriptions, software services and maintenance $ 18,125 $ 15,002 $ 13,588\nSelling, general and administrative expenses 49,240 44,965 39,152\nTotal share-based compensation expenses 67,365 59,967 52,740\nExcess tax benefit (60,190) (29,819) (32,487)\nNet decrease in net income $ 7,175 $ 30,148 $ 20,253\nAs of December 31, 2020, we had $164.0 million of total unrecognized compensation cost related to unvested options and restricted stock units, net of expected forfeitures, which is expected to be amortized over a weighted average amortization period of 3.12 years.\nEmployee Stock Purchase Plan\nUnder our Employee Stock Purchase Plan (“ESPP”) participants may contribute up to 15% of their annual compensation to purchase common shares of Tyler. The purchase price of the shares is equal to 85% of the closing price of Tyler shares on the last day of each quarterly offering period. As of December 31, 2020, there were 664,000 shares available for future issuances under the ESPP from the 2.0 million shares previously approved by the stockholders.\n(10)EARNINGS PER SHARE\nBasic earnings and diluted earnings per share data were computed as follows:\nYears Ended December 31,\n2020 2019 2018\nNumerator for basic and diluted earnings per share:\nNet income $ 194,820 $ 146,527 $ 147,462\nDenominator:\nWeighted-average basic common shares outstanding 40,035 38,640 38,445\nAssumed conversion of dilutive securities:\nShare-based awards 1,491 1,465 1,678\nDenominator for diluted earnings per share\n- Adjusted weighted-average shares\n41,526 40,105 40,123\nEarnings per common share:\nBasic $ 4.87 $ 3.79 $ 3.84\nDiluted $ 4.69 $ 3.65 $ 3.68\nShare-based awards representing the right to purchase common stock of 132,000 shares in 2020, 633,000 shares in 2019, and 888,000 shares in 2018 were not included in the computation of diluted earnings per share because their inclusion would have had an anti-dilutive effect.\n(11) LEASES\nWe lease office facilities for use in our operations, as well as transportation and other equipment. Most of our leases are non-cancelable operating lease agreements and they expire in one year to seven years. Some of these leases include options to extend for up to 10 years. We had no finance leases and no related party lease agreements as of December 31, 2020. Operating lease costs were approximately $10.2 million in 2020, $9.9 million in 2019, and $7.4 million in 2018.\nThe components of operating lease expense were as follows (in thousands):\nLease Costs Financial Statement Classification For the year ended For the year ended\n2020 2019\nOperating lease cost Selling, general and administrative expenses $ 6,524 $ 6,379\nShort-term lease cost Selling, general and administrative expenses 1,940 2,269\nVariable lease cost Selling, general and administrative expenses 1,760 1,274\nNet lease cost $ 10,224 $ 9,922\nAs of December 31, ROU lease assets and lease liabilities for our operating leases were recorded in the consolidated balance sheet as follows (in thousands):\n2020 2019\nAssets:\nOperating lease right-of-use assets $ 18,734 $ 18,992\nLiabilities:\nOperating leases, short-term 5,904 6,387\nOperating leases, long-term 16,279 16,822\nTotal lease liabilities $ 22,183 $ 23,209\nSupplemental information related to leases was as follows:\nOther Information For the year ended For the year ended\n2020 2019\nCash Flows (in thousands):\nCash paid amounts included in the measurement of lease liabilities:\nOperating cash outflows from operating leases $ 8,131 $ 7,267\nRight-of-use assets obtained in exchange for lease obligations (non-cash):\nOperating leases $ 5,524 $ 3,466\nLease Term and Discount Rate:\nWeighted average remaining lease term (years) 3 4\nWeighted average discount rate 3.28 % 4.00 %\nAs of December 31, 2020, maturities of lease liabilities were as follows (in thousands):\nYear ending December 31, Amount\n2021 $ 7,015\n2022 4,853\n2023 3,826\n2024 3,337\n2025 2,198\nThereafter 2,537\nTotal lease payments 23,766\nLess: Interest (1,583)\nPresent value of operating lease liabilities $ 22,183\nRental Income from third parties\nWe own office buildings in Bangor, Falmouth and Yarmouth, Maine; Lubbock and Plano, Texas; Troy, Michigan; Latham, New York; and Moraine, Ohio. We lease space in some of these buildings to third-party tenants. The property we lease to others under operating leases consists primarily of specific facilities where one tenant obtains substantially all of the economic benefit from the asset and has the right to direct the use of the asset. These non-cancelable leases expire between 2021 and 2025, some of which have options to extend the lease for up to five years. We determine if an arrangement is a lease at inception. None of our leases allow the lessee to purchase the leased asset.\nRental income from third-party tenants was $1.1 million in 2020, $1.1 million in 2019, and $1.2 million in 2018. Rental income is included in hardware and other revenue on the consolidated statements of comprehensive income. Future minimum operating rental income based on contractual agreements is as follows (in thousands):\nYear ending December 31, Amount\n2021 $ 1,372\n2022 1,402\n2023 1,432\n2024 1,462\n2025 858\nThereafter -\nTotal $ 6,526\nAs of December 31, 2020, we had no additional significant operating or finance leases that had not yet commenced.\n(12)EMPLOYEE BENEFIT PLANS\nWe provide a defined contribution plan for the majority of our employees meeting minimum service requirements. Eligible employees can contribute up to 30% of their current compensation to the plan subject to certain statutory limitations. We contribute up to a maximum of 3% of an employee’s compensation to the plan. We made contributions to the plan and charged operating results $12.7 million in 2020, $11.5 million in 2019, and $9.3 million in 2018.\n(13)COMMITMENTS AND CONTINGENCIES\nSecurity Incident\nOn September 29, 2020, we filed a Current Report on Form 8-K reporting a security incident (the \"Incident\") involving ransomware disrupting access to some of our internal IT systems and telephone systems. There is no evidence that the environments where we host client applications were affected, and our hosting services to those clients were not interrupted. There is also no evidence of malicious activity on client networks associated with the Incident. We contained the Incident and recovered from it, resuming normal operations with our clients. We will continue to deploy supplemental remediation efforts as necessary.\nAs part of our immediate response to the Incident, we (1) shut down points of access to external systems and began investigating and remediating the problem; (2) engaged outside IT security and forensics experts to conduct a detailed review and help securely restore\naffected systems; (3) implemented targeted monitoring systems to supplement the systems we already had in place; and (4) notified law enforcement. We have cooperated with their investigation throughout.\nWe promptly notified our clients of the Incident and provided timely updates to our clients through direct communications and updates to our website.\nAlthough we believe we have contained and recovered from the Incident, and that we have taken and will continue to take appropriate remediation steps, we are subject to risk and uncertainties as a result of the Incident. We believe we are in the final phases of our investigation, but there can be no assurance as to what the ongoing impact of the Incident will be, if any. The Incident caused an interruption in parts of our business. We have made insurance claims for lost revenue related to the Incident, (primarily software services revenue) for the year ended December 31, 2020. Insurance reimbursements pertaining to lost revenue represent a contingent gain and any recovery of these revenues will be recorded when received. We do not expect such gains to be material. We incurred $4.2 million in costs associated with the Incident as of December 31, 2020. As of December 31, 2020, we have recorded $1.1 million of accrued insurance recoveries and received $2.4 million of insurance recoveries related to the Incident. The recorded costs consisted primarily of payments to third-party service providers and consultants, including legal fees, and enhancements to our cybersecurity measures. It is expected that we will continue to incur costs related to our response, remediation, and investigatory efforts relating to the Incident. We maintain cybersecurity insurance coverage in an amount that we believe is adequate.\nLitigation\nOther than routine litigation incidental to our business, there are no material legal proceedings pending to which we are party or to which any of our properties are subject.\n(14)SEGMENT AND RELATED INFORMATION\nWe provide integrated information management solutions and services for the public sector, with a focus on local governments.\nWe provide our software systems and services and appraisal services through six business units, which focus on the following products:\n•financial management, education and planning, regulatory and maintenance software solutions;\n•financial management, municipal courts, planning, regulatory and maintenance, and land and vital records management software solutions;\n•courts and justice and public safety software solutions;\n•data and insights solutions;\n•platform technologies; and\n•appraisal and tax software solutions and property appraisal services.\nIn accordance with ASC 280-10, Segment Reporting, we report our results in two segments. The financial management, education and planning, regulatory and maintenance software solutions unit; financial management, municipal courts, planning, regulatory and maintenance, and land and vital records management software solutions unit; courts and justice and public safety software solutions unit; the data and insights solutions unit; and platform technologies solutions unit meet the criteria for aggregation and are presented in one reportable segment, Enterprise Software (“ES”). The ES segment provides public sector entities with software systems and services to meet their information technology and automation needs for mission-critical “back-office” functions such as: financial management and education, courts and justice, public safety, planning, regulatory and maintenance, land and vital records management, data and insights and platform technologies processes. The Appraisal and Tax (“A&T”) segment provides systems and software that automate the appraisal and assessment of real and personal property, land and vital records management as well as property appraisal outsourcing services for local governments and taxing authorities. Property appraisal outsourcing services include: the physical inspection of commercial and residential properties; data collection and processing; computer analysis for property valuation; preparation of tax rolls; community education; and arbitration between taxpayers and the assessing jurisdiction.\nWe evaluate performance based on several factors, of which the primary financial measure is business segment operating income. We define segment operating income for our business units as income before noncash amortization of intangible assets associated with their acquisition, interest expense and income taxes. Segment operating income includes intercompany transactions. The majority of intercompany transactions relate to contracts involving more than one unit and are valued based on the contractual arrangement. Segment operating income for corporate primarily consists of compensation costs for the executive management team and certain accounting and administrative staff and share-based compensation expense for the entire company. Corporate segment operating income also includes revenues and expenses related to a company-wide user conference. Due to the shelter-in-place orders caused by the COVID-19 pandemic, we cancelled our company-wide user conference for the current year. The accounting policies of the reportable segments are the same as those described in Note 1, “Summary of Significant Accounting Policies”.\nAs of January 1, 2020, the land and vital records management business unit, which was previously reported in the ES segment, was moved to the A&T segment to reflect changes in the way in which management makes operating decisions, allocates resources, and manages the growth and profitability of the Company. Prior year amounts for the ES and A&T segments have been adjusted to reflect the segment change.\nSegment assets primarily consist of net accounts receivable, prepaid expenses and other current assets and net property and equipment, and capitalized software development costs. Corporate assets primarily consist of cash and investments, prepaid insurance, intangibles associated with acquisitions, deferred income taxes and net property and equipment mainly related to unallocated information and technology assets.\nES segment capital expenditures included $6.6 million in 2020 and $12.6 million in 2019 for the expansion of existing buildings and purchases of buildings and land. A&T segment capital expenditures included $3.3 million in 2020 and $8.2 million in 2019 for the expansion of existing buildings.\nFor the year ended December 31, 2020 Enterprise\nSoftware Appraisal\nand Tax Corporate Totals\nRevenues\nSoftware licenses and royalties $ 64,200 $ 8,964 $ - $ 73,164\nSubscriptions 326,284 24,364 - 350,648\nSoftware services 164,520 21,889 - 186,409\nMaintenance 429,224 38,289 - 467,513\nAppraisal services - 21,127 - 21,127\nHardware and other 17,670 121 11 17,802\nIntercompany 19,061 70 (19,131) -\nTotal revenues $ 1,020,959 $ 114,824 $ (19,120) $ 1,116,663\nDepreciation and amortization expense 67,411 1,055 13,191 81,657\nSegment operating income 285,271 27,383 (86,104) 226,550\nCapital expenditures 11,099 3,823 6,826 21,748\nSegment assets $ 847,672 $ 94,149 $ 1,665,453 $ 2,607,274\nFor the year ended December 31, 2019 Enterprise\nSoftware Appraisal\nand Tax Corporate Totals\nRevenues\nSoftware licenses and royalties $ 90,808 $ 9,397 $ - $ 100,205\nSubscriptions 279,282 17,070 - 296,352\nSoftware services 179,865 33,196 - 213,061\nMaintenance 393,521 36,797 - 430,318\nAppraisal services - 23,479 - 23,479\nHardware and other 16,553 203 6,256 23,012\nIntercompany 15,290 206 (15,496) -\nTotal revenues $ 975,319 $ 120,348 $ (9,240) $ 1,086,427\nDepreciation and amortization expense 64,245 970 11,457 76,672\nSegment operating income 255,365 26,918 (73,829) 208,454\nCapital expenditures 19,283 8,436 10,379 38,098\nSegment assets $ 833,203 $ 91,343 $ 1,267,068 $ 2,191,614\nFor the year ended December 31, 2018 Enterprise\nSoftware Appraisal\nand Tax Corporate Totals\nRevenues\nSoftware licenses and royalties $ 81,299 $ 12,142 $ - $ 93,441\nSubscriptions 205,193 15,354 - 220,547\nSoftware services 161,612 29,657 - 191,269\nMaintenance 349,387 35,134 - 384,521\nAppraisal services - 21,846 - 21,846\nHardware and other 18,387 390 4,881 23,658\nIntercompany 12,764 391 (13,155) -\nTotal revenues $ 828,642 $ 114,914 $ (8,274) $ 935,282\nDepreciation and amortization expense 49,921 1,123 10,715 61,759\nSegment operating income 231,819 28,434 (68,572) 191,681\nCapital expenditures 9,918 1,241 13,973 25,132\nSegment assets $ 554,960 $ 64,810 $ 1,171,193 $ 1,790,963\nReconciliation of reportable segment operating Years Ended December 31,\nincome to the Company's consolidated totals: 2020 2019 2018\nTotal segment operating income $ 226,550 $ 208,454 $ 191,681\nAmortization of acquired software (31,962) (30,642) (22,972)\nAmortization of customer and trade name intangibles (21,662) (21,445) (16,217)\nOther income, net 2,116 3,471 3,378\nIncome before income taxes $ 175,042 $ 159,838 $ 155,870\n(15) DISAGGREGATION OF REVENUE\nThe tables below show disaggregation of revenue into categories that reflect how economic factors affect the nature, amount, timing, and uncertainty of revenue and cash flows.\nTiming of Revenue Recognition\nTiming of revenue recognition by revenue category during the period is as follows:\nFor the year ended December 31, 2020 Products and services transferred at a point in time Products and services transferred over time Total\nRevenues:\nSoftware licenses and royalties $ 62,029 $ 11,135 $ 73,164\nSubscriptions - 350,648 350,648\nSoftware services - 186,409 186,409\nMaintenance - 467,513 467,513\nAppraisal services - 21,127 21,127\nHardware and other 17,802 - 17,802\nTotal $ 79,831 $ 1,036,832 $ 1,116,663\nFor the year ended December 31, 2019 Products and services transferred at a point in time Products and services transferred over time Total\nRevenues:\nSoftware licenses and royalties $ 84,900 $ 15,305 $ 100,205\nSubscriptions - 296,352 296,352\nSoftware services - 213,061 213,061\nMaintenance - 430,318 430,318\nAppraisal services - 23,479 23,479\nHardware and other 23,012 - 23,012\nTotal $ 107,912 $ 978,515 $ 1,086,427\nFor the year ended December 31, 2018 Products and services transferred at a point in time Products and services transferred over time Total\nRevenues:\nSoftware licenses and royalties $ 75,188 $ 18,253 $ 93,441\nSubscriptions - 220,547 220,547\nSoftware services - 191,269 191,269\nMaintenance - 384,521 384,521\nAppraisal services - 21,846 21,846\nHardware and other 23,658 - 23,658\nTotal $ 98,846 $ 836,436 $ 935,282\nRecurring Revenue\nThe majority of our revenue is comprised of recurring revenues from maintenance and subscriptions. Virtually all of our on-premises software clients contract with us for maintenance and support, which provides us with a significant source of recurring revenue. We generally provide maintenance and support for our on-premises clients under annual, or in some cases, multi-year contracts. The contract terms for subscription arrangements range from one to 10 years but are typically contracted for initial periods of three to five years. Non-recurring revenues are derived from all other revenue categories.\nRecurring revenues and non-recurring revenues recognized during the period are as follows:\nFor the year ended December 31, 2020 Enterprise\nSoftware Appraisal and Tax Corporate Totals\nRecurring revenues $ 755,508 $ 62,652 $ - $ 818,160\nNon-recurring revenues 246,390 52,102 11 298,503\nIntercompany 19,061 70 (19,131) -\nTotal revenues $ 1,020,959 $ 114,824 $ (19,120) $ 1,116,663\nFor the year ended December 31, 2019 Enterprise\nSoftware Appraisal and Tax Corporate Totals\nRecurring revenues $ 672,804 $ 53,866 $ - $ 726,670\nNon-recurring revenues 287,225 66,276 6,256 359,757\nIntercompany 15,290 206 (15,496) -\nTotal revenues $ 975,319 $ 120,348 $ (9,240) $ 1,086,427\nFor the year ended December 31, 2018 Enterprise\nSoftware Appraisal and Tax Corporate Totals\nRecurring revenues $ 554,581 $ 50,488 $ - $ 605,069\nNon-recurring revenues 261,297 64,035 4,881 330,213\nIntercompany 12,764 391 (13,155) -\nTotal revenues $ 828,642 $ 114,914 $ (8,274) $ 935,282\n(16) DEFERRED REVENUE AND PERFORMANCE OBLIGATIONS\nTotal deferred revenue, including long-term, by segment is as follows:\nDecember 31, 2020 December 31, 2019\nEnterprise Software $ 422,742 $ 375,838\nAppraisal and Tax 36,945 35,487\nCorporate 1,691 1,369\nTotals $ 461,378 $ 412,694\nChanges in total deferred revenue, including long-term, were as follows:\nBalance at beginning of year $ 412,694\nDeferral of revenue 1,094,185\nRecognition of deferred revenue (1,045,501)\nBalance at end of year $ 461,378\nTransaction Price Allocated to the Remaining Performance Obligations\nThe aggregate amount of transaction price allocated to the remaining performance obligations represents contracted revenue that has not yet been recognized (\"Backlog\"), which includes deferred revenue and amounts that will be invoiced and recognized as revenue in future periods. Backlog as of December 31, 2020 was $1.59 billion, of which we expect to recognize approximately 49% as revenue over the next 12 months and the remainder thereafter.\n(17) DEFERRED COMMISSIONS\nSales commissions earned by our sales force are considered incremental and recoverable costs of obtaining a contract with a customer. Sales commissions for initial contracts are deferred and then amortized commensurate with the recognition of associated revenue over a period of benefit that we have determined to be generally three to seven years. Deferred commissions were $32.3 million, $29.8 million, as of December 31, 2020, and 2019 respectively. Amortization expense was $11.9 million, $11.5 million, and $9.6 million for the twelve months ended December 31, 2020, 2019, and 2018, respectively. There were no indicators of impairment in relation to the costs capitalized for the periods presented. Deferred commissions have been included with prepaid expenses in the accompanying consolidated balance sheets. Amortization expense related to deferred commissions is included in selling, general and administrative expenses in the accompanying consolidated statements of comprehensive income.\n(18) SUBSEQUENT EVENTS\nThe following events or transactions have occurred subsequent to December 31, 2020.\nNIC, Inc.\nOn February 9, 2021, Tyler Technologies, Inc. (the “Company”) entered into an Agreement and Plan of Merger (the “Merger Agreement”) by and among the Company, Topos Acquisition, Inc., a Delaware corporation and wholly owned subsidiary of the Company (“Merger Sub”), and NIC Inc., a Delaware corporation (“NIC”). Pursuant to the Merger Agreement, and upon the terms and subject to the conditions therein, Merger Sub will merge with and into NIC (the “Merger”), with NIC surviving the Merger and continuing as a wholly owned subsidiary of the Company.\nSubject to the terms and conditions of the Merger Agreement, at the effective time of the Merger (the “Effective Time”), each issued and outstanding share of Common Stock prior to the Effective Time, par value $0.0001 per share, of NIC (the “NIC Common Stock”) other than (i) shares of NIC Common Stock owned directly or indirectly by the Company, NIC or any of their respective subsidiaries immediately prior to the Effective Time, including shares of NIC held as treasury stock, (ii) shares of NIC Common Stock as to which dissenters’ rights have been properly perfected, and (iii) shares of NIC Common Stock covered by unvested NIC restricted stock awards) will be converted in the Merger into the right to receive $34.00 in cash, without interest (the “Merger Consideration”).\nUnder the terms of the Merger Agreement, the completion of the Merger is subject to certain customary closing conditions, including, among others: (i) adoption of the Merger Agreement by the affirmative vote of the holders of at least a majority of the voting power of the outstanding shares of NIC Common Stock; (ii) the accuracy of the parties’ respective representations and warranties in the Merger Agreement, subject to specified materiality qualifications; (iii) compliance by the parties with their respective covenants in the Merger Agreement in all material respects; (iv) the absence of any order restraining, enjoining, or otherwise prohibiting the consummation of the Merger; and (v) the expiration of the waiting period applicable to the Merger under the Hart-Scott-Rodino Antitrust Improvements Act of 1976, as amended.\nThe Merger Consideration is expected to be financed with a combination of new debt and cash on the Company’s balance sheet. In connection with its entry into the Merger Agreement, the Company obtained a commitment from Goldman Sachs Bank USA for a $1.6 billion 364-day senior unsecured bridge loan facility, subject to customary conditions.\nThe Merger Agreement and the consummation of the transactions contemplated thereby have been unanimously approved by the NIC board of directors, and the NIC board of directors has resolved to recommend to the stockholders of NIC to adopt the Merger Agreement, subject to its terms and conditions.\nThe Merger Agreement provides that, at the Effective Time, with respect to NIC restricted stock awards, (i) each vested restricted stock award will be converted into the right to receive the Merger Consideration with respect to each share of NIC Common Stock subject to such awards, less applicable withholding of taxes and other authorized deductions, (ii) each outstanding unvested performance-based restricted stock award will automatically vest in full, in accordance with the terms of its award agreement, and be converted into the right to receive the Merger Consideration with respect to such number of shares of NIC Common Stock, less applicable withholding of taxes and other authorized deductions, and (iii) each outstanding unvested time-based restricted stock will be assumed by the Company and converted into corresponding awards relating to the Company’s Common Stock in accordance with the terms set forth in the Merger Agreement.\nThe Merger Agreement contains customary representations, warranties and covenants made by each of the Company, Merger Sub, and NIC, including, among others, covenants by NIC regarding the conduct of its business during the pendency of the transactions contemplated by the Merger Agreement, public disclosures and other matters. NIC is required, among other things, not to solicit alternative business combination transactions and, subject to certain exceptions, not to engage in discussions or negotiations regarding an alternative business combination transaction.\nBoth the Company and NIC may terminate the Merger Agreement under certain specified circumstances, including (i) if the Merger is not consummated by June 30, 2021, subject to an extension of up to three months in order to obtain required regulatory approval, (ii) if the approval of the NIC stockholders is not obtained, and (iii) if NIC’s board makes an adverse recommendation change with respect to the proposed transaction or approve or recommend a superior acquisition proposal. In certain circumstances in connection with the termination of the Merger Agreement, including if NIC’s board of directors changes or withdraws its recommendation of the Merger to its stockholders, fails to include its recommendation to shareholders in NIC’s proxy statement, or terminates the Merger Agreement to enter into an agreement with respect to a “superior proposal,” NIC will be required to pay the Company a termination fee of $55 million in cash.\nThe foregoing description of the Merger Agreement does not purport to be complete and is qualified in its entirety by the full text of the Merger Agreement, a copy of which is filed as Exhibit 2.1 to our Form 8-K, dated February 10, 2021, is incorporated by reference herein.\n(19) QUARTERLY FINANCIAL INFORMATION (unaudited)\nThe following table contains selected financial information from unaudited statements of income for each quarter of 2020 and 2019:\nQuarters Ended\n2020 2019\nDec. 31 Sept. 30 June 30 Mar. 31 Dec. 31 Sept. 30 June 30 Mar. 31\nRevenues $ 283,285 $ 285,746 $ 271,091 $ 276,541 $ 288,837 $ 275,400 $ 275,124 $ 247,066\nGross profit 138,669 143,509 131,203 129,131 142,275 130,717 127,860 116,048\nIncome before income taxes 48,412 49,936 41,811 34,883 47,790 40,552 36,419 35,077\nNet income 54,094 39,284 53,892 47,550 46,790 40,390 31,999 27,348\nEarnings per diluted share $ 1.29 $ 0.94 $ 1.30 $ 1.16 $ 1.15 $ 1.00 $ 0.80 $ 0.69\nShares used in computing diluted\nearnings per share 41,925 41,606 41,416 41,144 40,736 40,280 39,813 39,585"
}