{
    "cik": "8670",
    "company": "AUTOMATIC DATA PROCESSING INC",
    "filing_type": "10-K",
    "filing_date": "2021-08-04",
    "period_of_report": "2021-06-30",
    "sic": "7374",
    "state_of_inc": "DE",
    "state_location": "NJ",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/8670/0000008670-21-000027-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/8670/000000867021000027/adp-20210630.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/8670/0000008670-21-000027.txt",
    "filename": "8670_10K_2021_0000008670-21-000027.htm",
    "item_1": "Item 1. Business\nCORPORATE BACKGROUND\nGeneral\nIn 1949, our founders established ADP to shape the world of work with a simple, innovative idea: help clients focus on their business by freeing them up from certain non-core tasks such as payroll. Today, we are one of the world’s leading providers of cloud-based human capital management (HCM) solutions to employers, offering solutions to businesses of all sizes, whether they have simple or complex needs. We serve over 920,000 clients and pay over 38 million workers in 140 countries and territories. Our common stock is listed on the NASDAQ Global Select Market® under the symbol “ADP.”\nWhen we refer to “we,” “us,” “our,” “ADP,” or the “Company” in this Annual Report on Form 10-K, we mean Automatic Data Processing, Inc. and its consolidated subsidiaries.\nBUSINESS OVERVIEW\nADP’s Mission\nAs digital technology, globalization, new business models and other significant events and disruptions reshape the way people work, our mission is to power organizations with insightful solutions that meet the changing needs of our clients and their workers. Our HCM technology, industry and compliance expertise and data insights deliver measurable results, peace-of-mind and an engaged, productive workforce. Our leading technology and commitment to service excellence is at the core of our relationship with each one of our clients, whether it's a small, mid-sized or large organization operating in one or multiple countries around the world. We are constantly designing better ways to work through cutting-edge products, premium services and exceptional experiences that enable people to reach their full potential.\nADP’s Strategy\nOur Strategic Pillars. Our business strategy is based on three strategic pillars, which are designed to position us as the global market leader in HCM technology and services:\n• Grow a complete suite of cloud-based HCM solutions (HCM Solutions). We develop cloud-based software and offer comprehensive solutions that assist employers of all types and sizes in managing the entire worker spectrum and employment cycle - from full-time to freelancer and from hire to retire.\n• Grow and scale our market-leading HR Outsourcing solutions (HRO Solutions). We offer comprehensive HRO solutions in which we provide complete management solutions for HR administration, payroll administration, talent management, employee benefits, benefits administration, employer liability management, and other HCM and employee benefits functions.\n• Leverage our global presence to offer clients HCM solutions wherever they do business (Global Solutions). We are expanding our international HCM and HRO businesses, comprised of our established local, in-country solutions and our market-leading, cloud-based multi-country solutions.\nWith a large and growing addressable market, we are strongly positioned to continue delivering sustainable long-term value across our strategic pillars. We are doing this by successfully executing on product and technology innovation, providing industry-leading service and compliance expertise, and enhancing our world-class distribution.\nWe are focused on, and investing in, our world-class and next-gen platforms that are built for the future of work, and on providing market-leading HCM product and technology solutions that solve the needs of our clients today, and anticipate the needs of our clients tomorrow. Our world-class platforms and multi-national solutions provide our clients with comprehensive HR and payroll capabilities that drive productivity and enable compliance globally. Our cloud-based next-gen platforms are built to be person-centric, serve all worker types, support flexible work and on-demand pay, and deliver seamless global capabilities to dynamic, team-based organizations.\nDigital technology is transforming today's workplace and workforce. We are accelerating our own digital transformation and leveraging digital technology to change how we engage with our clients and how their workers engage with us - and an important part of this includes delivering solutions wherever they are, whether at work or on the go.\nWe offer the broadest suite of complete HRO solutions coupled with dedicated and strategic HR services and deep local expertise. These offerings can be tailored to meet the increasingly complex and sophisticated needs of our clients and their workers.\nOur global footprint in the HCM industry is unmatched and, together with world-class technology and deep in-country compliance expertise, we are strongly positioned to continue to drive growth by delivering solutions to clients of all sizes wherever they do business.\nInnovation at ADP\nInnovation is in our DNA. For over 70 years, we have reimagined the world of work by designing cutting-edge products, robust services and exceptional experiences that touch millions of people’s lives daily. We pioneered HCM automation, HCM in the cloud, mobile HCM and a digital HCM marketplace. As the business and digital technology landscape rapidly evolves, what “work” means, how and where it gets done, and how workers are paid is changing as well. We innovate by anticipating the future of work, the future of HCM and the future of pay in order to meet the evolving and unique needs of our clients and their workers.\nOur next-gen platforms are built for the ever-changing world of work. Designed from the ground up to be cloud-native, global, scalable and secure, our next-gen platforms provide our clients with the flexibility they need to address today’s and tomorrow’s workplace challenges. Our award winning next-gen HCM platform enables our clients to personalize their experience based on their needs. Built for dynamic teams, our next-gen HCM platform provides our clients with visibility into where work actually happens rather than into rigid organizational hierarchies and worker types. With our “HR your way” approach, clients can easily tailor the solution to their needs by deploying low-code applications.\nIn 2020, our next-gen payroll solution was named “Top HR Product” at the annual HR Technology Conference, marking the sixth consecutive year ADP has been honored for its innovative technology, an unprecedented achievement. Recently expanded across North America to Canada and Mexico, this next-gen payroll solution supports workers of all types and enables real-time, transparent, continuous payroll calculations. Our next-gen payroll solution also unlocks flexible pay choices for our clients so they can provide the best pay experience for their workers. As the regulatory environment rapidly changes, making it harder for companies to navigate the complexities of payroll, our next-gen payroll solution’s built-in compliance capabilities enable our clients to focus on managing their business. Our next-gen platforms are designed to meet the needs of our clients in an ever-changing world of work.\nIn February 2021, we launched the “Roll™ by ADP” mobile-first solution - reimagining how small businesses do payroll. This groundbreaking payroll solution utilizes an AI-powered chat interface to turn traditional payroll management into an intuitive conversation that can complete payroll in under a minute. Leveraging ADP’s long-standing payroll expertise and data security, small business owners can download and self-purchase Roll and run payroll anywhere, anytime, quickly and compliantly, with no experience or training needed. The conversational experience runs off simple chat prompts such as “Run my payroll,” offering a frictionless experience that also allows\nclients to confidently handle compliance matters like tax filing and deposits.\nToday, big data provides a real competitive advantage. That is why we have accelerated the deployment of machine learning (ML) against our unmatched HCM dataset - the same HCM dataset that drives our renowned ADP National Employment Report®. We are leading this innovation effort with ADP® DataCloud, our award-winning ML and workforce analytics platform which is by far one of the largest repositories of payroll information available. DataCloud analyzes aggregated, anonymized and timely HCM and compensation data from more than 920,000 organizations across the country, powering solutions that provide clients with in-depth workforce and business insights that enable critical HR decisions. ADP DataCloud's Skills Graph, our proprietary data structure, is based on more than 30 million employee records, 50 million resumes and 5 million job postings across more than 20 industries and 500 geographic areas, and extracts, aligns and normalizes key information such as skills, job titles and levels, education and qualifications from non-structured data and infers missing skills and qualifications from context. Skills Graph powers ADP’s Candidate Profile Relevancy tool to help score, assess and predict candidates who are the best fit for a job opening, as well as our new Organizational Benchmarking Dashboard which enables companies to decide how best to deploy their workers by comparing organizational metrics like headcount, labor costs and turnover against other similar businesses. We offer similar solutions to clients outside the United States.\nADP’s Model-Based Benchmarks, powered by Skills Graph, also extend benchmarks to include compensation for up to 150 million workers. Model-Based Benchmarks are driven by a set of deep learning models that extract patterns and knowledge from millions of payroll records and job profiles to provide accurate information that reflects the reality of the position being shown. ADP’s Pay Equity Storyboard combines analytics and benchmarking to help employers better understand potential pay gaps and provide them with real, up-to-date, aggregated and anonymized market data to understand how their compensation for a particular job compares to other similar employers. We continue to leverage the powerful DataCloud platform to provide clients with relevant, actionable insights. These insights are particularly important with respect to Diversity and Inclusion and, as part of our commitment to Diversity and Inclusion, this year we introduced the Diversity, Equity and Inclusion (DEI) Dashboard which can help businesses focus on the DEI issues that are most important to them by analyzing their diversity landscape through a simple question-and-answer format and easy-to-navigate user interface that allows them to better set, track and expand their DEI goals. These innovative offerings combine HR expertise and data transparency in a way that connects HR to the bottom line. In harnessing the power of big data through ML, ADP recognizes the importance of accountability, transparency, privacy, explainability and governance, and in furtherance of those goals has established an active AI & Data Ethics Committee, comprised of both industry leaders and ADP experts, which advises on emerging industry trends and concerns and provides guidance with respect to compliance with the principles that ADP should follow while developing products, systems and applications that involve artificial intelligence, ML and big data.\nWorkMarket, a cloud-based workforce management solution, provides robust freelancer management functionality and reporting insights, enabling clients to organize, manage and pay their extended workforce.\nOur innovative Wisely® payment offerings support an employer’s need for flexible payment solutions in order to meet the individual needs of its workers. The Wisely® Pay payroll card is a network-branded payroll card and digital account that enables employers to pay their employees, and enables employees to access their payroll funds immediately, including via a network member bank or an ATM, make purchases or pay bills, load additional funds onto the card, such as tax refunds and military pensions, and transfer funds to a bank account in the United States. We also offer Wisely® Direct, a network-branded general purpose reloadable card and digital account, which provides similar features and functionality as Wisely Pay but is offered directly to consumers. Our digital card offerings are true banking alternatives that feature innovative services such as savings, budgeting and cash-back rewards, are digital wallet-enabled and, through the companion myWisely app, offer other personal financial management features.\nIn addition, our ADP Mobile apps simplify how work gets done by enabling clients to process their payroll anywhere, and giving millions of their employees worldwide convenient access to their payroll and HR information in 28 languages.\nWe have also given third-party developers and system integrators access to some of our platforms’ API (application programming interface) libraries through ADP Marketplace in order to enable secure data sharing between ADP and other solutions across the HR and business ecosystem. ADP Marketplace is a digital HR storefront where clients can discover the best-fit apps for their industry; browse by solution-types such as learning management, financial wellness, time and attendance, and benefits administration; or connect HR software they already use. The pre-built integrations help clients simplify their processes, create a single system of record, and reduce data errors, freeing up time and resources to focus on growing their business and taking care of their people. With approximately 600 apps and integrations to choose from, ADP Marketplace offers ADP clients a modern HR experience that they can tailor to their specific needs.\nHelping Clients and their Employees Emerge Stronger from the COVID-19 Global Pandemic\nThe COVID-19 global pandemic has continued to create extremely challenging circumstances for our clients and their employees, and our priority has been to provide the support they need to navigate these challenges. As they pivot their focus from seeking essential relief to evolving their business models and operations to address changes in the economy and workplace, we continue to provide trusted solutions, data and expertise to help them emerge stronger.\nAt the onset of the pandemic, we quickly developed and provided - at no charge - reporting capabilities designed to provide clients around the world with data they needed to benefit from legislation providing financial assistance to enable them to stay in business. We were one of the first HCM companies to provide tools and reports that enabled our clients to apply for Paycheck Protection Program loans under the Coronavirus Aid, Relief and Economic Security (CARES) Act of more than $115 billion - ultimately helping approximately 400,000 employers apply for this essential assistance. To help employers confidently manage compliance, our teams analyzed more than 2,000 legislative updates associated with COVID-19 across the globe in order to provide them with easy to understand and actionable guidance and updated reporting tools.\nAs COVID-19 restrictions ease, many employers are returning to the workplace and designing new policies that reflect the demand for remote and hybrid work models, we are supporting their efforts by providing our clients with tools that can help them manage compliance confidently, achieve business continuity, and support employee wellness and engagement.\nOur Return to Workplace dashboard powered by ADP DataCloud uses data analytics and employee surveys to allow clients to monitor workforce trends including availability, health attestation results, and worker readiness and sentiment toward returning to the workplace; identify and schedule workers based on availability, location, job title and other attributes; track vaccination status; and facilitate contact tracing, in order to help transition workers back to workplaces with more clarity and confidence.\nWith ADP® Compliance on Demand, clients can easily tap into a knowledge base for compliance - from new leave laws and time tracking requirements, to record-keeping and more.\nThe new ADP Time Kiosk helps employers manage safe levels of occupancy by equipping workers with time & attendance tracking without touching a device. The Time Kiosk uses optional facial recognition to log workers in compliantly and voice activation to start/end a shift, take a meal break, transfer jobs and more.\nAs the economy recovers and the way people work is reshaped, our teams continue to swiftly adapt and adjust workflows to deliver the content, resources and support that employers and their workforce need, when they need it. Our expertise, innovative technology and data, as well as established financial relationships with our clients, financial institutions and employees, make ADP the partner that clients trust as they adapt to new world of work and create workplaces where everyone can thrive.\nReportable Segments\nOur two reportable business segments are Employer Services and Professional Employer Organization (“PEO”). For financial data by segment and by geographic area, see Note 16 to the “Consolidated Financial Statements” contained in this Annual Report on Form 10-K.\nEmployer Services. Our Employer Services segment serves clients ranging from single-employee small businesses to large enterprises with tens of thousands of employees around the world, offering a comprehensive range of technology-based HCM solutions, including our strategic, cloud-based platforms, and HRO (other than PEO) solutions. These solutions address critical client needs and include: Payroll Services, Benefits Administration, Talent Management, HR Management, Workforce Management, Compliance Services, Insurance Services and Retirement Services.\nProfessional Employer Organization. Our PEO business, called ADP TotalSource®, provides clients with comprehensive employment administration outsourcing solutions through a relationship in which employees who work for a client (referred to as “worksite employees”) are co-employed by us and the client.\nOur reportable segments are based on the way that management reviews the performance of, and makes decisions about, our business. Our strategic pillars represent the strategic growth areas for our business. The results of our business related to products and solutions within the HCM Solutions pillar, the HRO Solutions pillar (other than PEO products and solutions) and the Global Solutions pillar are contained within our Employer Services segment. The results of our business within the HRO Solutions pillar related to our PEO products and solutions are contained within our PEO segment.\nPRODUCTS AND SOLUTIONS\nIn order to serve the unique needs of diverse types of businesses and workforce models, we provide a range of solutions which businesses of all types and sizes and across geographies can use to recruit, pay, manage, and retain their workforce. We address these broad market needs with our cloud-based strategic platforms: RUN Powered by ADP®, serving approximately 750,000 small businesses; ADP Workforce Now®, serving over 75,000 mid-sized and large businesses across our strategic pillars; and ADP Vantage HCM®, serving over 500 large enterprise businesses. All of these solutions can be combined with ADP SmartCompliance® to address the increasingly broad and complex needs of employers. Outside the United States, we address the needs of over 60,000 clients with premier global solutions consisting of in-country solutions and multinational offerings, including ADP GlobalView®, ADP Celergo®/Streamline® and ADP iHCM.\nStrategic Cloud-based Products and Solutions Across Client Size and Geography\nHCM Solutions\nIntegrated HCM Solutions. Our premier suite of HCM products offers complete solutions that assist employers of all types and sizes in all stages of the employment cycle, from recruitment to retirement.\nOur suite of HCM solutions are powered by our strategic, cloud-based, award-winning platforms:\n• RUN Powered by ADP combines a software platform for small business payroll, HR management and tax compliance administration, with 24/7 service and support from our team of small business experts. RUN Powered by ADP also integrates with other ADP solutions, such as workforce management, workers’ compensation insurance premium payment plans, and retirement plan administration systems.\n• ADP Workforce Now is a flexible HCM solution used across mid-sized and large businesses in North America to manage their employees. More businesses use ADP Workforce Now in North America than any other HCM solution designed for both mid-sized and large businesses.\n• ADP Vantage HCM is a solution for large enterprises in the United States. It offers a comprehensive set of HCM capabilities within a single solution that unifies the five major areas of HCM: HR management, benefits administration, payroll services, time and attendance management, and talent management.\nPayroll Services. We pay over 23 million (approximately 1 out of every 6) workers in the United States. We provide flexible payroll services to employers of all sizes, including the preparation of employee paychecks, pay statements, supporting journals, summaries, and management reports.\nWe provide employers with a wide range of payroll options, including using mobile technology, connecting their major enterprise resource planning (“ERP”) applications with ADP’s payroll services or outsourcing their entire payroll process to us. Employers can choose a variety of payroll payment options including ADP’s electronic wage payment and, in the United States, payroll card solutions and digital accounts. On behalf of our clients in the United States, we prepare and file federal, state and local payroll tax returns, and quarterly and annual Social Security, Medicare, and federal, state and local income tax withholding reports.\nBenefits Administration. In the United States, we provide powerful and agile solutions for employee benefits administration. These options include health and welfare administration services, leave administration services, insurance carrier enrollment services, employee communication services, and dependent verification services. In addition, ADP benefits administration solutions offer employers a simple and flexible cloud-based eligibility and enrollment system that provides their employees with tools, communications, and other resources they need to understand their benefits options and make informed choices.\nTalent Management. ADP’s Talent Management solutions simplify and improve the talent acquisition, management, and activation process from recruitment to ongoing employee engagement and development. Employers can also outsource their internal recruitment function to ADP. Our solutions provide performance, learning, succession and compensation management tools that help employers align goals to outcomes, and enable managers to identify and mitigate potential retention risks. Our talent activation solutions include StandOut® powered by ADP, which provides team leaders with data and\ninsights to drive employee engagement and leadership development, which in turn help drive employee performance.\nWorkforce Management. ADP’s Workforce Management offers a range of solutions to over 100,000 employers of all sizes, including time and attendance, absence management and scheduling tools. Time and attendance solutions include time capture via online timesheets, timeclocks with badge readers, biometrics and touch-screens, telephone/interactive voice response, and mobile smartphones and tablets. These tools automate the calculation and reporting of hours worked, helping employers prepare payroll, control costs and overtime, and manage compliance with wage and hour regulations. Absence management tools include accrued time off, attendance policy and leave case management modules. Our employee scheduling tools simplify visibility, offer shift-swapping capabilities and can assist managers with optimizing schedules to boost productivity and minimize under- and over-staffing. We also offer analytics and reporting tools that provide clients with insights, benchmarks and performance metrics so they can better manage their workforce. In addition, industry-specific modules are available for labor forecasting, budgeting, activity and task management, grant and project tracking, and tips management.\nCompliance Solutions. ADP’s Compliance Solutions provides industry-leading expertise in payment compliance and employment-related tax matters that complement the payroll, HR and ERP systems of its clients. In our fiscal year ended June 30, 2021, in the United States, we processed and delivered more than 69 million employee year-end tax statements, and moved more than $2.3 trillion in client funds to taxing and other agencies and to our clients’ employees and other payees.\n• ADP SmartCompliance. In the United States, ADP SmartCompliance integrates client data delivered from our integrated HCM platforms or third-party payroll, HR and financial systems into a single, cloud-based solution. Our specialized teams use the data to work with clients to help them manage changing and complex regulatory landscapes and improve business processes. ADP SmartCompliance includes HCM-related compliance solutions such as Employment Tax and Wage Payments, as well as Tax Credits, Health Compliance, Wage Garnishments, Employment Verifications, Unemployment Claims and W-2 Management.\n• ADP SmartCompliance Employment Tax. As part of our full-service employment tax services in the United States, we prepare and file employment tax returns on our clients’ behalf and, in connection with these stand-alone services, collect employment taxes from clients and remit these taxes to more than 8,000 federal, state and local tax agencies.\n• ADP SmartCompliance Wage Payments. In the United States, we offer compliant pay solutions for today's workforce, including electronic payroll disbursement options such as payroll cards, digital accounts and direct deposit, as well as traditional payroll checks, which can be integrated with clients’ ERP and payroll systems.\nHuman Resources Management. Commonly referred to as Human Resource Information Systems, ADP’s Human Resources Management Solutions provide employers with a single system of record to support the entry, validation, maintenance, and reporting of data required for effective HR management, including employee names, addresses, job types, salary grades, employment history, and educational background.\nInsurance Services. ADP’s Insurance Services business, in conjunction with our licensed insurance agency,\nAutomatic Data Processing Insurance Agency, Inc., facilitates access in the United States to workers’ compensation and group health insurance for small and mid-sized clients through a variety of insurance carriers. Our automated Pay-by-Pay® premium payment program calculates and collects workers’ compensation premium payments each pay period, simplifying this task for employers.\nRetirement Services. ADP Retirement Services helps employers in the United States administer various types of retirement plans, such as traditional and Roth 401(k)s, profit sharing (including new comparability), SIMPLE and SEP IRAs, and executive deferred compensation plans. ADP Retirement Services offers a full service 401(k) plan program which provides recordkeeping and administrative services, combined with an investment platform offered through ADP Broker-Dealer, Inc. that gives our clients’ employees access to a wide range of non-proprietary investment options and online tools to monitor the performance of their investments. In addition, ADP Retirement Services offers investment management services to retirement plans through ADP Strategic Plan Services, LLC, an SEC registered investment adviser under the Investment Advisers Act of 1940. ADP Retirement Services also offers trustee services through a third party.\nHRO Solutions\nAs a leader in the growing HR Outsourcing market, we partner with our clients to offer a full range of seamless technology and service solutions for HR administration, workforce management, payroll services, benefits administration and talent management. From small businesses to enterprises with thousands of employees, with HRO our clients gain proven technology and processes and robust service and support. Whether a client chooses our PEO or other HR Outsourcing solutions, we offer solutions tailored to a client’s specific needs and preferences - designed to meet the client’s needs today, and as its business and needs evolve.\nProfessional Employer Organization. ADP TotalSource is enabled by ADP Workforce Now and offers small and mid-sized businesses a comprehensive HR outsourcing solution through a co-employment model. With a PEO, both ADP and the client have a co-employment relationship with the client’s employees. We assume certain employer responsibilities such as payroll processing and tax filings, and the client maintains control of its business and all management responsibilities. ADP TotalSource clients are able to offer their employees services and benefits on par with those of much larger enterprises, without the need to staff a full HR department. With our cloud-based HCM software at the core, we serve more than 14,500 clients and\nmore than 620,000 worksite employees in all 50 U.S. states. ADP TotalSource is the largest PEO certified by the Internal Revenue Service as meeting the requirements to operate as a Certified Professional Employer Organization under the Internal Revenue Code. As a full-service PEO, ADP TotalSource provides a broad range of HR administrative services, including payroll and payroll tax, employer compliance, HR guidance, employee benefits and benefit administration, talent strategies, and workers’ compensation insurance including risk and claims management. Some of the rich offerings available through ADP TotalSource to address today’s workplace challenges include:\n• Better Employee Benefits: Through our PEO, many of our clients discover that they can offer a richer overall benefits package than they could afford to offer on their own. We give clients access to a new patent-pending approach to help them target the best benefit plan offerings for their employees. They can compare plan options and make more educated decisions about what plan offering is best for their company and budget. In addition, ADP TotalSource integrates with our award-winning ADP Marketplace to further tailor offerings, such as helping employees pay off student loans with payroll contributions and integrating a client’s U.S. PEO population with its global workforce’s HR system of record.\n• Protection and Compliance: ADP TotalSource HR experts help clients manage the risks of being an employer by advising how to handle properly a range of issues - from HR and safety compliance to employee-relations. This includes access to workers' compensation coverage and expertise designed to help them handle both routine and unexpected incidents, including discrimination and harassment claims.\n• Talent Engagement: Featuring a talent blueprint, ADP TotalSource HR experts work with clients to help them better engage and retain their workforce through solutions that support the core needs of an employee at work. In addition, our full-service recruitment team is dedicated to helping our clients find and hire new talent, while reducing the stress of uncovering top talent.\n• Expertise: Each client is assigned a designated HR specialist for day-to-day and strategic guidance. Clients can also access data-driven benchmarks in areas such as turnover and overtime, staffing and understanding profit leaks, and have their ADP HR expert help tailor recommendations to continue to drive their business forward. A payroll specialist is also available to clients to help them ensure their workers are paid correctly, on time and in compliance.\nADP Comprehensive Services. Leveraging our market-leading ADP Workforce Now platform, ADP Comprehensive Services partners with clients of all types and sizes to tackle their HR, talent, benefits administration\nand pay challenges with help from our proven expertise, deep experience and best practices. ADP Comprehensive Services is flexible - enabling clients to partner with us for managed services for one, some or all areas across HR, talent, benefits administration and pay. We provide outsourced execution that combines processes, technology and a robust service and support team that acts as an extension of our client’s in-house resources - so their HCM and pay operations are executed with confidence.\nADP Comprehensive Outsourcing Services (ADP COS). Enabled by ADP Vantage HCM, ADP COS is designed for large business outsourcing for payroll, HR administration, workforce management, benefits administration and talent management. With COS, the day-to-day payroll process becomes our responsibility, freeing up clients to address critical issues like employee engagement and retention. The combination of technology, deep expertise and data-driven insights that COS offers is powerful, allowing clients to focus on strategy and results.\nADP Recruitment Process Outsourcing Services (ADP RPO®). ADP RPO provides deep talent insights to help drive targeted recruitment strategies for attracting top talent. With global, customizable recruitment services, ADP RPO enables organizations to find and hire the best candidates for hourly, professional or executive positions. In addition, we also deliver market analytics, sourcing strategies, candidate screening, selection and on-boarding solutions to help organizations connect their talent strategy to their business's priorities.\nGlobal Solutions\nOur premier global solutions consist of multi-country and local in-country solutions for employers of any type or size. We partner with clients to help them navigate the most complex HR and payroll scenarios using tailored and scalable technology supported by our deep compliance expertise.\nADP Global Payroll is a solution for multinational organizations of all sizes, empowering them to harmonize HCM strategies in 140 countries globally. This improves visibility, control and operational efficiency, giving organizations the insight and confidence to adapt to changing local needs, while helping to drive overall organizational agility and engagement.\nWe also offer comprehensive, country-specific HCM solutions that combine innovative technology with deep local expertise. By operating a flexible service model, we help customers manage various combinations of payroll services, HR management, time and attendance management, talent management and benefits management, depending on the country in which the solution is provided.\nWe pay over 14 million workers outside the United States with our in-country solutions and with ADP GlobalView, ADP Celergo/Streamline and ADP iHCM - our simplified and intuitive multi-country payroll solutions. As part of our global payroll services, we supply year-end regulatory and legislative tax statements and other forms to our clients’ employees. Our global talent management solutions elevate the employee experience, from recruitment to ongoing employee engagement and development. Our comprehensive HR solutions combined with our deep expertise make our clients’ global HR management strategies a reality. Our configurable, automated time and attendance tools help global clients understand the work being performed and the resources being used, and help ensure the right people are in the right place at the right time.\nMARKETS AND SALES\nOur HCM solutions are offered in 140 countries and territories across North America, Latin America, Europe, Asia and Africa. The most material markets for HCM Solutions, Global Solutions and HRO Solutions (other than PEO) are the United States, Canada and Europe. In each market, we have both country-specific solutions and multi-country solutions, for employers of all sizes and complexities. The major components of our offerings throughout these geographies are payroll, HR outsourcing and time and attendance management. In addition, we offer wage and tax collection and/or remittance services in the United States, Canada, the United Kingdom, Australia, India and China. Our PEO business offers services exclusively in the United States.\nWe market our solutions primarily through our direct sales force. We also market HCM Solutions, Global Solutions and HRO Solutions through indirect sales channels, such as marketing relationships with certified public accountants and banks, among others. None of our major business units has a single homogeneous client base or market. While concentrations of clients exist in specific industries, no one client, industry or industry group is material to our overall\nrevenues. We are a leader in each of our major service offerings and do not believe any of our major services or business units is subject to unique market risk.\nCOMPETITION\nThe industries in which we operate are highly competitive. We know of no reliable statistics by which we can determine the number of our competitors, but we believe that we are one of the largest providers of HCM solutions in the world. HCM Solutions, Global Solutions and HRO Solutions (other than PEO) compete with other business outsourcing companies, companies providing ERP services, providers of cloud-based HCM solutions and financial institutions. Our PEO business competes with other PEOs providing similar services, as well as business outsourcing companies, companies providing ERP services and providers of cloud-based HCM solutions. Other competitive factors include a company’s in-house function, whereby a company installs and operates its own HCM system.\nCompetition for business outsourcing solutions is primarily based on product and service quality, reputation, ease of use and accessibility of technology, breadth of offerings, and price. We believe that we are competitive in each of these areas and that our leading-edge technology, together with our commitment to service excellence, distinguishes us from our competitors.\nINDUSTRY REGULATION\nOur business is subject to a wide range of complex U.S. and foreign laws and regulations. In addition, many of our solutions are designed to assist clients with their compliance with certain U.S. and foreign laws and regulations that apply to them. We have, and continue to enhance, compliance programs and policies to monitor and address the legal and regulatory requirements applicable to our operations and client solutions, including dedicated compliance personnel and training programs.\nAs one of the world’s largest providers of HCM solutions, our systems contain a significant amount of sensitive data related to clients, employees of our clients, vendors and our employees. We are, therefore, subject to compliance obligations under federal, state and foreign privacy, data protection and cybersecurity-related laws, including federal, state and foreign security breach notification laws with respect to both client employee data and our own employee data. The changing nature of these comprehensive laws in the United States, Europe and elsewhere, including the European Union’s (the “EU”) General Data Protection Regulation (the “GDPR”) and the California Consumer Privacy Act (the “CCPA”), which will be replaced by the voter-approved California Privacy Rights Act of 2020 (the “CPRA”), impact our processing of personal information of our employees and on behalf of our clients. The GDPR imposes strict and comprehensive requirements on us as both a data controller and a data processor. As part of our overall data protection compliance program, including with respect to data protection laws in the EU, we are one of the few companies in the world to have implemented Binding Corporate Rules (“BCRs”). Compliance with our BCRs permits us to process and transfer personal data across borders in accordance with the GDPR and other data protection laws in the EU. The CCPA and CPRA require companies to provide new data disclosure, access, deletion and opt-out rights to consumers in California. In addition, in the United States, the Health Insurance Portability and Accountability Act of 1996 applies to our insurance services businesses and ADP TotalSource.\nAs part of our payroll and payroll tax management services, we move client funds to taxing authorities, our clients’ employees and other payees via electronic transfer, direct deposit, prepaid access and ADPCheck. In 2019, the Office of the Comptroller of Currency (the “OCC”) authorized us to open ADP Trust Company, National Association (the “ADP Trust Bank”), via a national trust bank charter pursuant to the National Bank Act. The ADP Trust Bank is the sole trustee of ADP Client Trust, our grantor trust which holds client funds, and is responsible for the oversight and management of those client funds. The ADP Trust Bank, and all of its fiduciary activities including the U.S. money movement it oversees and manages via ADP Client Trust, is subject to comprehensive ongoing oversight and regulation by the OCC. We have surrendered all state money transmitter licenses as the activity previously managed through those licenses was moved into the ADP Client Trust managed by ADP Trust Bank, which is federally exempt from state money transmitter regulation with respect to the client money movement activity that it manages. In addition, our U.S. money movement managed by the ADP Trust Bank and our U.S. prepaid access offering are subject to the anti-money laundering and reporting provisions of The Bank Secrecy Act of 1970, as amended by the USA PATRIOT Act of 2001 (the “BSA”). Elements of our money\nmovement activities outside of the United States are subject to licensing and similar anti-money laundering and reporting laws and requirements in the countries in which we provide such services. Our employee screening and selection services business offers background checking services that are subject to the Fair Credit Reporting Act. ADP TotalSource is subject to various state licensing requirements and maintains certifications with the Internal Revenue Service. Because ADP TotalSource is a co-employer with respect to its clients’ worksite employees, we may be subject to limited obligations and responsibilities of an employer under federal and state tax, insurance and employment laws. Our registered investment adviser provides certain investment management and advisory services to retirement plan administrators under a heightened “fiduciary” standard and is regulated by the SEC and the U.S. Department of Labor. ADP Broker-Dealer, Inc., which supports our Retirement Services business, is a registered broker-dealer regulated by the SEC and the Financial Industry Regulatory Authority (FINRA).\nIn addition, many of our businesses offer solutions that assist our clients in complying with certain U.S. and foreign laws and regulations that apply to them. Although these laws and regulations apply to our clients and not to ADP, changes in such laws or regulations may affect our operations, products and services. For example, our payroll services are designed to facilitate compliance with state laws and regulations applicable to the payment of wages. In addition, our HCM solutions help clients manage their compliance with certain requirements of the Affordable Care Act in the United States. Similarly, our Tax Credit Services business, which helps clients in the United States take advantage of tax credit opportunities in connection with the hiring of new employees and certain other activities, is based on federal, state or local tax laws and regulations allowing for tax credits, which are subject to renewal, amendment or rescission.\nWe believe that key components of our compliance programs provide real competitive differentiators. For instance, our BCRs have enabled ADP to apply a global standard of data protection, simplifying data transfer processes and assisting our clients in meeting the demanding standards of data protection expected in Europe - a solution that most competitors cannot provide. Similarly, the ADP Client Trust and ADP Trust Bank provide client funds with a level of protection that most competitors cannot offer. We continue to expand our approach to compliance and are adopting “Compliance by design” as a tenet that prioritizes compliance in designing and developing new solutions to support our clients.\nThe foregoing description does not include an exhaustive list of the laws and regulations governing or impacting our business. See the discussion contained in the “Risk Factors” section in Part I,",
    "item_1A": "Item 1A. Risk Factors\nOur businesses routinely encounter and address risks, some of which may cause our future results to be different than we currently anticipate. The risk factors described below represent our current view of some of the most important risks facing our businesses and are important to understanding our business. The following information should be read in conjunction with Management’s Discussion and Analysis of Financial Condition and Results of Operations, Quantitative and Qualitative Disclosures About Market Risk and the consolidated financial statements and related notes included in this Annual Report on Form 10-K. This discussion includes a number of forward-looking statements. You should refer to the description of the qualifications and limitations on forward-looking statements in the first paragraph under Management’s Discussion and Analysis of Financial Condition and Results of Operations included in this Annual Report on Form 10-K. The level of importance of each of the following risks may vary from time to time, and any of these risks may have a materially adverse effect on our business, results of operations, financial condition or reputation.\nLEGAL AND COMPLIANCE RISKS\nFailure to comply with, or changes in, laws and regulations applicable to our businesses could have a materially adverse effect on our reputation, results of operations or financial condition, or have other adverse consequences\nOur business is subject to a wide range of complex U.S. and foreign laws and regulations, including, but not limited to, the laws and regulations described in the “Industry Regulation” section in Part I, Item 1 of this Annual Report on Form 10-K. Failure to comply with laws and regulations applicable to our operations or client solutions and services could cause us to incur substantial costs or could result in the suspension or revocation of licenses or registrations, the limitation, suspension or termination of services, the imposition of consent orders or civil and criminal penalties, including fines, and lawsuits, including class actions, that could damage our reputation and have a materially adverse effect on our results of operation or financial condition.\nIn addition, changes in laws or regulations, or changes in the interpretation of laws or regulations by a regulatory authority, may decrease our revenues and earnings and may require us to change the manner in which we conduct some aspects of our business. For example, a change in regulations either decreasing the amount of taxes to be withheld or allowing less time to remit taxes to government authorities would adversely impact average client balances and, thereby, adversely impact interest income from investing client funds before such funds are remitted to the applicable taxing authorities. Changes in U.S. or foreign\ntax laws, regulations or rulings or the interpretation thereof could adversely affect our effective tax rate and our net income. Changes in laws that govern the co-employment arrangement between a professional employer organization and its worksite employees may require us to change the manner in which we conduct some aspects of our PEO business. Health care reform under the Affordable Care Act, related state laws, and the regulations thereunder, as well as the uncertainty surrounding the Affordable Care Act, have the potential to further impact the demand for our health care compliance solutions. We are unable to determine the additional impact that any of this will have on our PEO business, our ability to attract and retain PEO clients or demand for our health care compliance solutions.\nFailure to comply with anti-corruption laws and regulations, economic and trade sanctions, anti-money laundering laws and regulations, and similar laws could have a materially adverse effect on our reputation, results of operations or financial condition, or have other adverse consequences\nRegulators worldwide continue to exercise a high level of scrutiny with respect to anti-corruption, economic and trade sanctions, and anti-money laundering laws and regulations. Such scrutiny has resulted in aggressive investigations and enforcement of such laws and burdensome regulations, any of which could materially adversely impact our business. We operate our business around the world, including in numerous developing economies where companies and government officials are more likely to engage in business practices that are prohibited by domestic and foreign laws and regulations, including the United States Foreign Corrupt Practices Act and the U.K. Bribery Act. Such laws generally prohibit improper payments or offers of payments to foreign government officials and leaders of political parties and, in some cases, to other persons, for the purpose of obtaining or retaining business. We are also subject to economic and trade sanctions programs, including those administered by the U.S. Treasury Department’s Office of Foreign Assets Control, which prohibit or restrict transactions or dealings with specified countries, their governments and, in certain circumstances, their nationals, and with individuals and entities that are specially designated, including narcotics traffickers and terrorists or terrorist organizations, among others. In addition, some of our businesses and entities in the U.S. and a number of other countries in which we operate are subject to anti-money laundering laws and regulations, including, for example, The Bank Secrecy Act of 1970, as amended by the USA PATRIOT Act of 2001 (the “BSA”). Among other things, the BSA requires certain financial institutions, including banks and money services businesses (such as national trust banks and providers of prepaid access like us), to develop and implement risk-based anti-money laundering programs, report large cash transactions and suspicious activity, and maintain transaction records. We have registered our payroll card\nbusiness as a provider of prepaid access, and registered our ADP Trust Bank with the Treasury Department’s Financial Crimes Enforcement Network (FinCEN).\nWe have implemented policies and procedures to monitor and address compliance with applicable anti-corruption, economic and trade sanctions and anti-money laundering laws and regulations, and we regularly review, upgrade and enhance our policies and procedures. However, there can be no assurance that our employees, consultants or agents will not take actions in violation of our policies for which we may be ultimately responsible, or that our policies and procedures will be adequate or will be determined to be adequate by regulators. Any violations of applicable anti-corruption, economic and trade sanctions or anti-money laundering laws or regulations could limit certain of our business activities until they are satisfactorily remediated and could result in civil and criminal penalties, including fines, which could damage our reputation and have a materially adverse effect on our results of operation or financial condition. Further, bank regulators, including the OCC which regulates the ADP Trust Bank, continue to impose additional and stricter requirements on banks to ensure they are meeting their BSA obligations, and banks are increasingly viewing money services businesses, as a class, to be higher risk customers for money laundering. As a result, our banking partners that assist in processing our money movement transactions may limit the scope of services they provide to us or may impose additional material requirements on us. These regulatory restrictions on banks and changes to banks’ internal risk-based policies and procedures may result in a decrease in the number of banks that may do business with us, may require us to materially change the manner in which we conduct some aspects of our business, may decrease our revenues and earnings and could have a materially adverse effect on our results of operations or financial condition.\nFailure to comply with privacy, data protection and cyber security laws and regulations could have a materially adverse effect on our reputation, results of operations or financial condition, or have other adverse consequences\nThe collection, storage, hosting, transfer, processing, disclosure, use, security and retention and destruction of personal information required to provide our services is subject to federal, state and foreign privacy, data protection and cyber security laws. These laws, which are not uniform, generally do one or more of the following: regulate the collection, storage, hosting, transfer (including in some cases, the transfer outside the country of collection), processing, disclosure, use, security and retention and destruction of personal information; require notice to individuals of privacy practices; give individuals certain access and correction rights with respect to their personal information; and regulate the use or disclosure of personal information for secondary purposes such as marketing. Under certain circumstances, some of these\nlaws require us to provide notification to affected individuals, clients, data protection authorities and/or other regulators in the event of a data breach. In many cases, these laws apply not only to third-party transactions, but also to transfers of information among the Company and its subsidiaries. The European Union (the “EU”) General Data Protection Regulation (the “GDPR”), and state consumer privacy laws like the California Consumer Protection Act (the “CCPA”), which will be replaced by the voter-approved California Privacy Rights Act of 2020 (the “CPRA”), are among the most comprehensive of these laws, and more and more jurisdictions are adopting similarly comprehensive laws that impose new data privacy protection requirements and restrictions. As part of our overall data protection compliance program in connection with the GDPR, we implemented Binding Corporate Rules (“BCRs”) as both a data processor and data controller, which permits us to process and transfer personal data across borders in compliance with EU data protection laws.\nWe believe that providing insights from data, including artificial intelligence and machine learning, will become increasingly important to the value that our solutions and services deliver to our customers. However, the ability to provide data-driven insights may be constrained by current or future regulatory requirements or ethical considerations that could restrict or impose burdensome and costly requirements on our ability to leverage data in innovative ways.\nComplying with privacy, data protection and cyber security laws and requirements, including the enhanced obligations imposed by the GDPR, our BCRs and the CCPA and CPRA, may result in significant costs to our business and require us to amend certain of our business practices. Further, enforcement actions and investigations by regulatory authorities related to data security incidents and privacy violations continue to increase. The future enactment of more restrictive laws, rules or regulations and/or future enforcement actions or investigations could have a materially adverse impact on us through increased costs or restrictions on our businesses and noncompliance could result in significant regulatory penalties and legal liability and damage our reputation. In addition, data security events and concerns about privacy abuses by other companies are changing consumer and social expectations for enhanced privacy and data protection. As a result, even the perception of noncompliance, whether or not valid, may damage our reputation.\nIf we fail to protect our intellectual property rights, it could materially adversely affect our business and our brand\nOur ability to compete and our success depend, in part, upon our intellectual property. We rely on patent, copyright, trade secret and trademark laws, and\nconfidentiality or license agreements with our employees, customers, vendors, partners and others to protect our intellectual property rights. We may need to devote significant resources, including cybersecurity resources, to monitoring our intellectual property rights. In addition, the steps we take to protect our intellectual property rights may be inadequate or ineffective, or may not provide us with a significant competitive advantage. Our intellectual property could be wrongfully acquired as a result of a cyber-attack or other wrongful conduct by third parties or our personnel. Litigation brought to protect and enforce our intellectual property rights could be costly and time-consuming. Furthermore, our efforts to enforce our intellectual property rights may be met with defenses, counterclaims, and countersuits attacking the validity and enforceability of our intellectual property rights, which may be successful.\nWe may be sued by third parties for infringement of their proprietary rights, which could have a materially adverse effect on our business, financial condition or results of operations\nThere is considerable intellectual property development activity in our industry. Third parties, including our competitors, may own or claim to own intellectual property relating to our products or services and may claim that we are infringing their intellectual property rights. We may be found to be infringing upon such rights, even if we are unaware of their intellectual property rights. Any claims or litigation could cause us to incur significant expenses and, if successfully asserted against us or if we decide to settle, could require that we pay substantial damages or ongoing royalty payments, obtain licenses, modify applications, prevent us from offering our services, or require that we comply with other unfavorable terms. We may also be obligated to indemnify our customers, vendors or partners in connection with any such claim or litigation. Even if we were to prevail in such a dispute, any litigation regarding our intellectual property could be costly and time-consuming.\nSECURITY AND TECHNOLOGY RISKS\nOur businesses collect, host, store, transfer, process, disclose, use, secure and retain and dispose of personal and business information, and collect, hold and transmit client funds, and a security or privacy breach may damage or disrupt our businesses, result in the disclosure of confidential information, damage our reputation, increase our costs, cause losses and materially adversely affect our results of operations\nIn connection with our business, we collect, host, store, transfer, process, disclose, use, secure and retain and dispose of large amounts of personal and business information about our clients, employees of our clients, our vendors and our employees, contractors and temporary\nstaff, including payroll information, health care information, personal and business financial data, social security numbers and their foreign equivalents, bank account numbers, tax information and other sensitive personal and business information. We also collect significant amounts of funds from the accounts of our clients and transmit them to their employees, taxing authorities and others.\nWe are focused on ensuring that we safeguard and protect personal and business information and client funds, and we devote significant resources to maintain and regularly update our systems and processes. Nonetheless, the global environment continues to grow increasingly hostile as attacks on information technology systems continue to grow in frequency, complexity and sophistication, and we are regularly targeted by unauthorized parties using malicious tactics, code and viruses. Certain of these malicious parties may be state-sponsored and supported by significant financial and technological resources. Although this is a global problem, it may affect our businesses more than other businesses because malevolent parties (including our personnel) may focus on the amount and type of personal and business information that our businesses collect, host, store, transfer, process, disclose, use, secure and retain and dispose of, and the client funds that we collect and transmit.\nWe have programs and processes in place to prevent, detect and respond to data or cyber security incidents. However, because the techniques used to obtain unauthorized access, disable or degrade service, or sabotage systems change frequently, are increasingly more complex and sophisticated and may be difficult to detect for long periods of time, we may be unable or fail to anticipate these techniques or implement adequate or timely preventive or responsive measures. Our ability to address cyber security incidents may also depend on the timing and nature of assistance that may be provided from relevant governmental or law enforcement agencies. Hardware, software, applications or services that we develop or procure from third parties, or are required by third parties such as foreign governments to install on our systems, may contain defects in design or manufacture or other problems that could (or, in respect of third-party software, may be designed to) compromise the confidentiality, integrity or availability of data or our systems. Unauthorized parties also attempt to gain access to our systems or facilities, or those of third parties with whom we do business, through fraud, trickery, or other methods of deceiving these third parties or our personnel, including phishing and other social engineering techniques whereby attackers use end-user behaviors to distribute computer viruses and malware into our systems or otherwise compromise the confidentiality, integrity or availability of data on our systems. As these threats continue to evolve and increase, we continue to invest significant resources, and may be required to invest\nsignificant additional resources, to modify and enhance our information security and controls and to investigate and remediate any security vulnerabilities. In addition, while our operating environments are designed to safeguard and protect personal and business information, we may not have the ability to monitor the implementation or effectiveness of any safeguards by our clients, vendors or partners and, in any event, third parties may be able to circumvent those security measures. Information obtained by malevolent parties resulting from successful attacks against our clients, vendors, partners or other third parties may, in turn, be used to attack our information technology systems.\nAny cyberattack, unauthorized intrusion, malicious software infiltration, network disruption, denial of service, corruption of data, theft of non-public or other sensitive information, or similar act by a malevolent party (including our personnel), or inadvertent acts or inactions by our vendors, partners or personnel, could result in the loss, disclosure or misuse of confidential personal or business information or the theft of client or ADP funds, and could have a materially adverse effect on our business or results of operations or that of our clients, result in liability, litigation, regulatory investigations and sanctions or a loss of confidence in our ability to serve clients, or cause current or potential clients to choose another service provider. As the global environment continues to grow increasingly hostile, the security of our operating environment is ever more important to our clients and potential clients. As a result, the breach or perceived breach of our security systems could result in a loss of confidence by our clients or potential clients and cause them to choose another service provider, which could have a materially adverse effect on our business.\nAlthough we believe that we maintain a robust program of information security and controls and none of the data or cyber security incidents that we have encountered to date have materially impacted us, a data or cyber security incident could have a materially adverse effect on our business, results of operations, financial condition and reputation. While ADP maintains insurance coverage that, subject to policy terms and conditions and a significant self-insured retention, is designed to address losses or claims that may arise in connection with certain aspects of data and cyber risks, such insurance coverage may be insufficient to cover all losses or all types of claims that may arise in the continually evolving area of data and cyber risk.\nOur systems, applications, solutions and services may be subject to disruptions that could have a materially adverse effect on our business and reputation\nMany of our businesses are highly dependent on our ability to process, on a daily basis, a large number of complicated transactions. We rely heavily on our payroll, financial,\naccounting, and other data processing systems. We need to properly manage our systems, applications and solutions, and any upgrades, enhancements and expansions we may undertake from time to time, in order to ensure they properly support our businesses. If any of these systems, applications or solutions fails to operate properly or becomes disabled even for a brief period of time, whether due to malevolent acts, errors, defects or any other factor(s), we could suffer financial loss, a disruption of our businesses, liability to clients, loss of clients, regulatory intervention or damage to our reputation, any of which could have a materially adverse effect on our results of operation or financial condition. We have disaster recovery, business continuity, and crisis management plans and procedures designed to protect our businesses against a multitude of events, including natural disasters, military or terrorist actions, power or communication failures, or similar events. Despite our preparations, our plans and procedures may not be successful in preventing or mitigating the loss of client data, service interruptions, disruptions to our operations, or damage to our important facilities.\nA disruption of the data centers or cloud-computing services that we utilize could have a materially adverse effect on our business\nWe host our applications and serve our clients with data centers that we operate, and with data centers that are operated, and cloud-computing services that are provided, by third-party vendors. If any of these data centers or cloud-computing services fails, becomes disabled or is disrupted, even for a limited period of time, our businesses could be disrupted and we could suffer financial loss, liability to clients, loss of clients, regulatory intervention or damage to our reputation, any of which could have a material adverse effect on our results of operation or financial condition. In addition, our third-party vendors may cease providing data center facilities or cloud-computing services, elect to not renew their agreements with us on commercially reasonable terms or at all, breach their agreements with us or fail to satisfy our expectations, which could disrupt our operations and require us to incur costs which could materially adversely affect our results of operation or financial condition.\nBUSINESS AND INDUSTRY RISKS\nIf we fail to upgrade, enhance and expand our technology and services to meet client needs and preferences, the demand for our solutions and services may materially diminish\nOur businesses operate in industries that are subject to rapid technological advances and changing client needs and preferences. In order to remain competitive and responsive to client demands, we continually upgrade, enhance, and expand our technology, solutions and\nservices. If we fail to respond successfully to technology challenges and client needs and preferences, the demand for our solutions and services may diminish. In addition, investment in product development often involves a long return on investment cycle. We have made and expect to continue to make significant investments in product development. We must continue to dedicate a significant amount of resources to our development efforts before knowing to what extent our investments will result in products the market will accept. In addition, our business could be adversely affected in periods surrounding our new product introductions if customers delay purchasing decisions to evaluate the new product offerings. Furthermore, we may not execute successfully on our product development strategy, including because of challenges with regard to product planning and timing and technical hurdles that we fail to overcome in a timely fashion.\nWe may not realize or sustain the expected benefits from our business transformation initiatives, and these efforts could have a materially adverse effect on our business, operations, financial condition, results of operations and competitive position\nWe have been and will be undertaking certain transformation initiatives, which are designed to streamline our organization, extend our world-class distribution and strengthen our talent and culture, while supporting our revenue growth, margin improvement and productivity. If we do not successfully manage and execute these initiatives, or if they are inadequate or ineffective, we may fail to meet our financial goals and achieve anticipated benefits, improvements may be delayed, not sustained or not realized and our business, operations and competitive position could be adversely affected. These initiatives, or our failure to successfully manage them, could result in unintended consequences or unforeseen costs, including distraction of our management and employees, attrition, inability to attract or retain key personnel, and reduced employee productivity, which could adversely affect our business, financial condition, and results of operations.\nA major natural disaster or catastrophic event could have a materially adverse effect on our business, financial condition and results of operations, or have other adverse consequences\nOur business, financial condition, results of operations, access to capital markets and borrowing costs may be adversely affected by a major natural disaster or catastrophic event, including civil unrest, geopolitical instability, war, terrorist attack, pandemics or other (actual or threatened) public health emergencies such as the recent COVID-19 outbreak, or other events beyond our control, and measures taken in response thereto.\nThe COVID-19 outbreak created, and such other events may create, significant volatility and uncertainty and economic and financial market disruption. The extent of any such impact depends on developments which are highly uncertain and cannot be predicted, including the duration and scope of the event; the governmental and business actions taken in response thereto; actions taken by the Company in response thereto and the related costs; the impact on economic activity and employment levels; the effect on our clients, prospects, suppliers and partners; our ability to sell and provide our solutions and services, including due to travel restrictions, business and facility closures, and employee remote working arrangements; the ability of our clients or prospects to pay for our services and solutions; and how quickly and to what extent normal economic and operating conditions can resume. In addition, clients or prospects may delay decision making, demand pricing and other concessions, reduce the value or duration of their orders, delay planned work or seek to terminate existing agreements. Our business is also impacted by employment levels across our clients, as we have varied contracts throughout our business that blend base fees and per-employee fees. The COVID-19 outbreak had a significant impact on our clients and, as a result, negatively impacted our revenue and new business bookings. Our bookings were also adversely affected by the impact of the outbreak on the buying behavior of our clients and prospects, coupled with the inability of our sales force to engage with clients and prospects on an in-person basis and instead primarily leveraging virtual interactions. The COVID-outbreak pandemic may also have long-term effects on the nature of the office environment and remote working, which may present operational and workplace culture challenges that may adversely affect our business.\nPolitical, economic and social factors may materially adversely affect our business and financial results\nTrade, monetary and fiscal policies, and political and economic conditions may substantially change, and credit markets may experience periods of constriction and volatility. When there is a slowdown in the economy, employment levels and interest rates may decrease with a corresponding impact on our businesses. Clients may react to worsening conditions by reducing their spending on HCM services or renegotiating their contracts with us, which may adversely affect our business and financial results.\nWe invest our funds held for clients in liquid, investment-grade marketable securities, money market securities, and other cash equivalents. Nevertheless, such investments are subject to general market, interest rate, credit and liquidity risks. These risks may be exacerbated, individually or together, during periods of unusual financial market volatility.\nIn addition, as part of our client funds investment strategy, we extend the maturities of our investment portfolio for client funds and utilize short-term financing arrangements to satisfy our short-term funding requirements related to client funds obligations. In order to satisfy these short-term funding requirements, we maintain access to various sources of liquidity, including borrowings under our commercial paper program and our committed credit facilities, our ability to execute reverse repurchase transactions and corporate cash balances. A reduction in the availability of any such financing during periods of disruption in the financial markets or otherwise may increase our borrowing costs and/or require us to sell available-for-sale securities in our funds held for clients to satisfy our short-term funding requirements. When there is a reduction in employment levels due to a slowdown in the economy, the Company may experience a decline in client fund obligations and may also sell available-for-sale securities in our funds held for clients in order to reduce the size of the funds held for clients to correspond to client fund obligations. A sale of such available-for-sale securities may result in the recognition of losses and reduce the interest income earned on funds held for clients, either or both of which may adversely impact our results of operations, financial condition and cash flow.\nWe are dependent upon various large banks to execute electronic payments and wire transfers as part of our client payroll, tax and other money movement services. While we have contingency plans in place for bank failures, a systemic shutdown of the banking industry would impede our ability to process funds on behalf of our payroll, tax and other money movement services clients and could have an adverse impact on our financial results and liquidity.\nWe derive a significant portion of our revenues and operating income outside of the United States and, as a result, we are exposed to market risk from changes in foreign currency exchange rates that could impact our results of operations, financial position and cash flows.\nWe publicly share certain information about our environmental, social and governance (“ESG”) initiatives. We may face increased scrutiny related to these activities, including from the investment community, and our failure to achieve progress in these areas on a timely basis, if at all, could impact our reputation, business, including employee retention, and growth.\nChange in our credit ratings could adversely impact our operations and lower our profitability\nThe major credit rating agencies periodically evaluate our creditworthiness and have given us strong, investment-grade long-term debt ratings and high commercial paper ratings. Failure to maintain high credit ratings on long-term and short-term debt could increase our cost of borrowing, reduce our ability to obtain intra-day borrowing required\nby our Employer Services business, and adversely impact our results of operations.\nOur business could be negatively impacted as a result of actions by activist stockholders or others\nWe may be subject to actions or proposals from activist stockholders or others that may not align with our business strategies or the interests of our other stockholders. Responding to such actions could be costly and time-consuming, disrupt our business and operations, and divert the attention of our Board of Directors and senior management from the pursuit of our business strategies. Activist stockholders may create perceived uncertainties as to the future direction of our business or strategy, including with respect to our ESG efforts, which may be exploited by our competitors and may make it more difficult to attract and retain qualified personnel, potential customers and business partners and may affect our relationships with current customers, vendors, investors and other third parties. In addition, actions of activist stockholders may cause periods of fluctuation in our stock price based on temporary or speculative market perceptions or other factors that do not necessarily reflect the underlying fundamentals and prospects of our business.\nWe may be unable to attract and retain qualified personnel\nOur ability to grow and provide our clients with competitive services is partially dependent on our ability to attract and retain highly motivated people with the skills to serve our clients and reflecting diverse perspectives and the diversity of our communities and clients. Competition for skilled employees in the outsourcing and other markets in which we operate is intense and, if we are unable to attract and retain highly skilled, motivated and diverse personnel, results of our operations and culture may suffer.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNone.",
    "item_2": "Item 2. Properties\nADP owns 7 of its processing/print centers, and 12 other operational offices, sales offices, and its corporate headquarters in Roseland, New Jersey, which aggregate approximately 3,070,644 square feet. None of ADP's owned facilities is subject to any material encumbrances. ADP leases space for some of its processing centers, other operational offices, and sales offices. All of these leases, which aggregate approximately 5,366,245 square feet worldwide, expire at various times up to the year 2031. ADP believes its facilities are currently adequate for their intended purposes and are adequately maintained.",
    "item_3": "Item 3. Legal Proceedings\nIn the normal course of business, ADP is subject to various claims and litigation. While the outcome of any litigation is inherently unpredictable, ADP believes that it has valid defenses with respect to the legal matters pending against it and that the ultimate resolution of these matters will not have a materially adverse impact on its financial condition, results of operations, or cash flows.",
    "item_4": "Item 4. Mine Safety Disclosures\nNot applicable.\nPart II",
    "item_5": "Item 5. Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket for Registrant's Common Equity\nThe principal market for the Company’s common stock is the NASDAQ Global Select Market under the symbol ADP. As of June 30, 2021, there were 34,701 holders of record of the Company’s common stock. As of such date, 1,051,941 additional holders held their common stock in “street name.”\nIssuer Purchases of Equity Securities\nPeriod Total Number of Shares Purchased (1) Average Price Paid per Share Total Number of Shares Purchased as Part of the Publicly Announced Common Stock Repurchase Plan (2) Maximum Approximate Dollar Value\nof Shares that\nmay yet be\nPurchased under\nthe Common Stock\nRepurchase Plan (2)\nApril 1, 2021 to\nApril 30, 2021\n703,968 $190.81 702,309 $3,414,959,644\nMay 1, 2021 to\nMay 31, 2021\n846,225 $193.80 845,310 $3,251,138,425\nJune 1, 2021 to\nJune 30, 2021\n893,690 $197.42 891,590 $3,075,122,616\nTotal 2,443,883 2,439,209\n(1) Pursuant to the terms of the Company’s restricted stock program, the Company purchased 4,674 shares at the then-market value of the shares to satisfy certain tax withholding requirements for employees upon the vesting of their restricted shares.\n(2) The Company received the Board of Directors' approval to repurchase shares of the Company's common stock as follows:\nDate of Approval\nNovember 2019 $5 billion\nThere is no expiration date for the common stock repurchase authorization.\nFor equity compensation plan information, please refer to Item 12 in Part III of this Annual Report or Form 10-K.\nPerformance Graph\nThe following graph compares the cumulative return on the Company’s common stock for the most recent five years with the cumulative return on the S&P 500 Index, a Peer Group Index,(a) and the Old Peer Group Index,(b) assuming an initial investment of $100 on June 30, 2016, with all dividends reinvested. The Company reassessed its peer group and determined that the companies included in the Nasdaq Dividend Achievers Select Index more closely match our Company characteristics than the companies previously included in the Old Peer Group Index based on their commitment to increasing annual regular dividend payments, maturity and stable and positive earnings growth profile. The stock price performance shown on this graph may not be indicative of future performance.\n(a) We use the Nasdaq Dividend Achievers Select Index as our Peer Group Index. The Nasdaq Dividend Achievers Select Index is a select group of companies, that includes the Company, with at least ten consecutive years of increasing annual regular dividend payments.\n(b) The Old Peer Group Index was the S&P 500 Information Technology Index.",
    "item_6": "Item 6. Selected Financial Data\nNot applicable.",
    "item_7": "Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nTabular dollars are presented in millions, except per share amounts\nThe following section discusses our year ended June 30, 2021 (“fiscal 2021”), as compared to year ended June 30, 2020 (“fiscal 2020”). A detailed review of our fiscal 2020 performance compared to our fiscal 2019 performance is set forth in Part II, Item 7 of our Form 10-K for the fiscal year ended June 30, 2020.\nFORWARD-LOOKING STATEMENTS\nThis document and other written or oral statements made from time to time by ADP may contain “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Statements that are not historical in nature and which may be identified by the use of words like “expects,” “assumes,” “projects,” “anticipates,” “estimates,” “we believe,” “could” “is designed to” and other words of similar meaning, are forward-looking statements. These statements are based on\nmanagement’s expectations and assumptions and depend upon or refer to future events or conditions and are subject to risks and uncertainties that may cause actual results to differ materially from those expressed. Factors that could cause actual results to differ materially from those contemplated by the forward-looking statements or that could contribute to such difference include: ADP's success in obtaining and retaining clients, and selling additional services to clients; the pricing of products and services; the success of our new solutions; compliance with existing or new legislation or regulations; changes in, or interpretations of, existing legislation or regulations; overall market, political and economic conditions, including interest rate and foreign currency trends and inflation; competitive conditions; our ability to maintain our current credit ratings and the impact on our funding costs and profitability; security or cyber breaches, fraudulent acts, and system interruptions and failures; employment and wage levels; changes in technology; availability of skilled technical associates; the impact of new acquisitions and divestitures; the adequacy, effectiveness and success of our business transformation initiatives; and the impact of any uncertainties related to major natural disasters or catastrophic events, including the coronavirus (“COVID-19”) pandemic. ADP disclaims any obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law. These risks and uncertainties, along with the risk factors discussed under “Item 1A. Risk Factors,” and in other written or oral statements made from time to time by ADP, should be considered in evaluating any forward-looking statements contained herein.\nNON-GAAP FINANCIAL MEASURES\nIn addition to our U.S. GAAP results, we use adjusted results and other non-GAAP metrics to evaluate our operating performance in the absence of certain items and for planning and forecasting of future periods. Adjusted EBIT, adjusted EBIT margin, adjusted net earnings, adjusted diluted earnings per share, adjusted effective tax rate and organic constant currency are all non-GAAP financial measures. Please refer to the accompanying financial tables in the “Non-GAAP Financial Measures” section for a discussion of why ADP believes these measures are important and for a reconciliation of non-GAAP financial measures to their comparable GAAP financial measures.\nEXECUTIVE OVERVIEW\nHighlights from the year ended June 30, 2021 include:\n3% 60 basis points\n6%\nRevenue Growth Earnings Before Income Taxes Margin Expansion Diluted EPS Growth\n2% (40) basis points\n2%\nOrganic Constant Currency\nRevenue Growth Adjusted EBIT Margin Expansion Adjusted Diluted EPS Growth\n23% Employer Services\nNew Business Bookings Growth 2% PEO Services\nAverage Worksite Employee Growth\n$3.0B\nCash Returned via Shareholder Friendly Actions\n$1.6B Dividends | $1.4B Share Repurchases\nWe are a leading global provider of cloud-based Human Capital Management (“HCM”) technology solutions to employers around the world. The global COVID-19 pandemic has had a significant impact on the global business environment and on our clients, but our priority has been and continues to be the safety of our associates and the needs of our clients. We have continued to provide HCM services, including the processing of payroll and tax obligations, to our clients during this time. ADP's efforts have also been focused on providing information and tools to help clients understand and navigate the governmental relief that has been adopted globally. In addition, we released a Return to Workplace solution that assists our clients in bringing their employees back to work safely through a comprehensive set of tools designed to streamline the entire process.\nDuring the fiscal year, we continued to advance our market-leading solutions and achieved some new milestones. Earlier this year, our next-gen payroll solution earned ADP its 6th consecutive “Top HR Product Award” at the annual HR Technology Conference. This solution features a highly scalable, policy-based framework that enables easy self-service and powerful transparency. In February, we announced the launch of Roll, a new mobile-first payroll and tax filing product aimed at small businesses, which combines an AI-driven chat-based interface with the power and scale of our payroll and tax filing expertise. We continued to add to our robust DataCloud platform by introducing the Diversity, Equity and Inclusion (DEI) Dashboard which can help businesses analyze their diversity landscape through a simple Q&A format and user interface that allows them to better set, track and expand their DEI goals. For our RUN platform, which is a leading solution in the market with approximately 750,000 clients, we began to roll out a new user experience and launched TimeKeeping Plus, an entirely new, native workforce management solution. This year, we reached 100,000 clients across our workforce management solutions for the first time, as the pandemic reinforced the need for robust workforce management solutions for our clients while they navigate the new norm of increasingly flexible schedules and work arrangements.\nOur suite of HRO solutions also continued to deliver steady growth this year, despite the dynamic economic environment. Within PEO, the average worksite employee count grew 12% in the fourth quarter resulting in annual growth of 2%. We also have over 2 million worksite employees on our other HRO solutions within our Employer Services segment, as clients look for ways to outsource parts of the HR function to a best-in-class provider like ADP.\nWe continue to drive innovation by anticipating our clients' evolving needs and always designing for people as the world of work changes. We lead the HCM industry by driving growth through our strategic, cloud-based HCM solutions and developing innovations like our next gen platforms. We further enable these solutions by supplementing them with organic, differentiated investments such as the ADP Datacloud and ADP Marketplace, and through our compliance expertise.\nFor fiscal 2021, we drove solid revenue growth of 3% for the year, continued to invest for sustainable growth despite market conditions, and managed any non-essential spend prudently. Employer Services New Business Bookings was up 23% for fiscal 2021. In addition, the Employer Services client revenue retention rate for fiscal 2021 improved 170 basis points to 92.2% as compared to our rate for fiscal 2020. The PEO average number of Worksite Employees increased 2% for fiscal 2021. Our pays per control metric, which represents the number of employees on ADP clients' payrolls in the United States when measured on a same-store-sales basis for a subset of clients ranging from small to large businesses, turned positive in the fourth quarter resulting in annual growth of negative 3% for fiscal 2021.\nWe have a strong business model, a highly cash generative business with low capital intensity, and offer a suite of products that provide critical support to our clients’ HCM functions. We generate sufficient free cash flow to satisfy our cash dividend and our modest debt obligations, which enables us to absorb the impact of downturns and remain steadfast in our reinvestments, our longer term strategy, and our commitments to shareholder friendly actions. We are committed to building upon our past successes by investing in our business through enhancements in research and development and by driving meaningful transformation in the way we operate. Our financial condition remains solid at June 30, 2021 and we remain well positioned to support our associates and our clients.\nRESULTS AND ANALYSIS OF CONSOLIDATED OPERATIONS\nTotal Revenues\nFor the year ended June 30, respectively:\ná 3% YoY Growth\ná 2% YoY Growth, Organic Constant Currency\nRevenues for fiscal 2021 increased due to strong retention, new business started from New Business Bookings, an increase in zero-margin benefits pass-throughs and one percentage point of favorability from foreign currency. This increase is partially offset by a one percentage point of pressure from our interest earned on funds held for clients discussed below. Refer to “Analysis of Reportable Segments” for additional discussion of the increases in revenue for both of our reportable segments, Employer Services and Professional Employer Organization (“PEO”) Services.\nTotal revenues in fiscal 2021 include interest on funds held for clients of $422.4 million, as compared to $545.2 million in fiscal 2020. The decrease in the consolidated interest earned on funds held for clients resulted from the decrease in our average interest rate earned to 1.5% in fiscal 2021, as compared to 2.1% in fiscal 2020. The decrease is partially offset by an increase in our average client funds balances of 5.2% to $27.4 billion in fiscal 2021 as compared to fiscal 2020.\nTotal Expenses\nYears Ended\nJune 30,\n2021 2020 %\nChange\nCosts of revenues:\nOperating expenses $ 7,520.7 $ 7,404.1 2 %\nSystems development and programming costs 716.6 674.1 6 %\nDepreciation and amortization 403.0 366.9 10 %\nTotal costs of revenues 8,640.3 8,445.1 2 %\nSelling, general and administrative expenses 3,040.5 3,003.0 1 %\nInterest expense 59.7 107.1 (44) %\nTotal expenses $ 11,740.5 $ 11,555.2 2 %\nFor the year ended June 30, 2021, operating expenses increased due to the increase in our PEO Services zero-margin benefits pass-through costs to $3,092.0 million from $2,907.7 million for the year ended June 30, 2021 and 2020, respectively, the impact of foreign currency, and an increase in incentive compensation costs due to decreases in the prior year. These increases were partially offset by reduced costs as a result of our broad-based transformation initiatives and excess capacity headcount actions in the prior year, a change of $52.5 million in our estimated losses related to ADP Indemnity compared to prior year, reduced travel expenses and decreased pension costs as a result of U.S. pension service costs that were eliminated with the July 1, 2020 cessation of U.S. participants accruing any future service benefits (“U.S. pension freeze”).\nSystems development and programming costs increased for fiscal 2021 due to increased investments and costs to develop, support, and maintain our products, partially offset by capitalization of costs related to our strategic projects, including our next gen platforms.\nDepreciation and amortization expense increased related to the amortization of our acquisitions of intangibles and internally developed software.\nSelling, general and administrative expenses increased for the year ended June 30, 2021 due to an increase in\nincentive compensation costs, investments in our sales organization, and the impact of foreign currency, partially offset by a decrease in charges related to transformation initiatives, reduced costs as a result of our broad-based transformation initiatives and excess capacity headcount actions in the prior year for non-sales associates, capitalization of costs to obtain a contract under ASC 606, reduced travel expenses, legal settlements, and a decrease in bad debt expense.\nInterest expense decreased for the year ended June 30, 2021 primarily due to a decrease in average interest rates for commercial paper borrowings to 0.1% for the year ended June 30, 2021, as compared to 1.6% for the year ended June 30, 2020. This was coupled with a decrease in average daily borrowings under our commercial paper program to $1.6 billion for the year ended June 30, 2021, as compared to $2.7 billion for the year ended June 30, 2020.\nOther (Income)/Expense, net\n(In millions)\nYears ended June 30, 2021 2020 $ Change\nInterest income on corporate funds $ (36.5) $ (84.5) $ (48.0)\nRealized (gains)/losses on available-for-sale securities, net (11.3) (12.9) (1.6)\nImpairment of assets 19.9 29.9 10.0\nGain on sale of assets (8.1) (5.8) 2.3\nGain on sale of investment (1.7) (0.2) 1.5\nNon-service components of pension income, net (58.6) (74.5) (15.9)\nOther (income)/expense, net $ (96.3) $ (148.0) $ (51.7)\nOther (income)/expense, net, decreased $51.7 million in fiscal 2021, as compared to fiscal 2020 as a result of a decrease in interest income on corporate funds due to lower interest rates earned and the change in non-service components of pension income, net, and the items described below. See Note 10 of our Consolidated Financial Statements for further details on non-service components of pension income, net.\nIn fiscal 2021, the Company recorded impairment charges of $19.9 million which is comprised of a write down of $10.5 million related to internally developed software which was determined to have no future use, impairment charges of $9.4 million related to operating right-of-use assets and certain related fixed assets associated with vacating certain leased locations early, and recognizing certain owned facilities at fair value given intent to sell and accordingly classified as held for sale.\nIn fiscal 2020, the Company recorded impairment charges of $29.9 million, which is comprised of $25.3 million as a result of recognizing certain owned facilities at fair value given intent to sell and accordingly classified as held for sale and vacating certain leased locations early and recorded total impairment charges of $4.6 million related to operating right-of-use assets and certain related fixed assets associated with the vacated locations.\nEarnings Before Income Taxes\nFor the year ended June 30, respectively:\ná 6% YoY Growth\ná 60 bps YoY Growth\nEarnings before income taxes increased in fiscal 2021 due to the increases in revenues partially offset by the increases in expenses discussed above.\nOverall margin increased in fiscal 2021 as a result of operational efficiencies, coupled with a decrease in charges related to transformation initiatives, legal settlements, reduced costs as a result of our broad-based transformation initiatives and excess capacity headcount actions in the prior year, a change of $52.5 million in our estimated losses related to ADP Indemnity compared to prior year, decreased selling expense, and decreased interest expense. These were partially offset by an increase in incentive compensation costs, a decrease in interest earned on funds held for clients, and incremental pressure from growth in our zero-margin benefits pass-throughs.\nAdjusted Earnings before certain Interest and Taxes (\"Adjusted EBIT\")\nFor the year ended June 30, respectively:\ná 1% YoY Growth\nâ 40 bps YoY Growth\nAdjusted EBIT and Adjusted EBIT margin exclude certain interest amounts, legal settlements, gain on sale of assets, net charges related to our broad-based transformation initiatives and the impact of the net severance charges as applicable in the respective periods.\nProvision for Income Taxes\nThe effective tax rate in fiscal 2021 and 2020 was 22.7% and 22.5%, respectively. The increase in the effective tax rate is primarily due to combined benefits from a valuation allowance release related to foreign tax credit carryforwards and a foreign tax law change during fiscal 2020 as well as a decrease in the excess tax benefit on stock-based compensation, partially offset by favorable adjustments to prior year tax liabilities during fiscal 2021. Refer to Note 11, Income Taxes, within the Notes to the Consolidated Financial Statements for further discussion.\nAdjusted Provision for Income Taxes\nThe adjusted effective tax rate in fiscal 2021 and 2020 was 22.7% and 22.6%, respectively. The drivers of the adjusted effective tax rate are the same as the drivers of the effective tax rate discussed above.\nNet Earnings and Diluted Earnings per Share\nFor the year ended June 30, respectively:\ná 5% YoY Growth\ná 6% YoY Growth\nFor fiscal 2021, adjusted net earnings and adjusted diluted EPS reflect the changes in components described above.\nFor fiscal 2021, diluted EPS increased as a result of the impact of fewer shares outstanding resulting from the repurchase of approximately 8.2 million shares during fiscal 2021 and 6.2 million shares during fiscal 2020, partially offset by the issuances of shares under our employee benefit plans.\nAdjusted Net Earnings and Adjusted Diluted Earnings per Share\nFor the year ended June 30, respectively:\ná 1% YoY Growth\ná 2% YoY Growth\nFor fiscal 2021, adjusted net earnings and adjusted diluted EPS reflect the changes in components described above.\nANALYSIS OF REPORTABLE SEGMENTS\nRevenues\nYears Ended\nJune 30, % Change\n2021 2020 As Reported Organic Constant Currency\nEmployer Services $ 10,195.2 $ 10,086.6 1 % - %\nPEO Services 4,818.3 4,511.5 7 % 7 %\nOther (8.1) (8.3) n/m n/m\n$ 15,005.4 $ 14,589.8 3 % 2 %\nEarnings before Income Taxes\nYears Ended\nJune 30, % Change\n2021 2020 As Reported\nEmployer Services $ 3,052.1 $ 3,058.2 - %\nPEO Services 718.8 609.3 18 %\nOther (409.7) (484.9) n/m\n$ 3,361.2 $ 3,182.6 6 %\nn/m - not meaningful\nEmployer Services\nRevenues\nRevenues increased in fiscal 2021 due to strong retention, business started from New Business Bookings and one percentage point of favorability from foreign currency. Employer Services client revenue retention rate for fiscal 2021 improved 170 basis points to 92.2% as compared to our rate for fiscal 2020. Increases in revenues were partially offset by a decrease in interest earned on funds held for clients.\nEarnings before Income Taxes\nEmployer Services’ earnings before income taxes was flat in fiscal 2021 due to increased revenues discussed above offset by increases in expenses. The increases in expenses were due to an increase in incentive compensation costs, investments in our sales organization, an increase in amortization expense, and the impact of foreign currency. The increases in expenses were offset by reduced costs as a result of our broad-based transformation initiatives and excess capacity headcount actions for non-sales associates, reduced travel expenses, and a decrease in bad debt expense.\nFor the year ended June 30, respectively:\nâ 40 bps YoY Growth\nEmployer Services' overall margin decreased for fiscal 2021 due to an increase in incentive compensation costs, a decrease in interest earned on funds held for clients, and an increase in amortization expense. This decrease was partially offset by reduced costs as a result of our broad-based transformation initiatives and excess capacity headcount actions in the prior year, and a decrease in bad debt expense.\nRevenues\nPEO Revenues\nYears Ended Change\nJune 30,\n2021 2020 $ %\nPEO Services' revenues $ 4,818.3 $ 4,511.5 $ 306.8 7 %\nLess: PEO zero-margin benefits pass-throughs 3,092.0 2,907.7 184.3 6 %\nPEO Services' revenues excluding zero-margin benefits pass-throughs $ 1,726.3 $ 1,603.8 $ 122.5 8 %\nPEO Services' revenues increased 7% and PEO Services' revenues excluding zero-margin benefits pass-through costs increased 8% in fiscal 2021. PEO Services' revenues increased due to a 2% increase in the average number of Worksite Employees in fiscal 2021 driven by an increase in the number of new PEO Services clients, partially offset by a modest decline in pays per control.\nEarnings before Income Taxes\nPEO Services’ earnings before income taxes increased 18% in fiscal 2021 due to increased revenues discussed above, partially offset by increases in expenses. The increases in expenses were due to the increase in zero-margin benefits pass-through costs of $184.3 million described above, partially offset by a change of $52.5 million in our estimated losses related to ADP Indemnity compared to the prior year, and a decrease in selling expenses.\nFor the year ended June 30, respectively:\ná 140 bps YoY Growth\nPEO Services' overall margin increased for fiscal 2021 due to an increase in revenues as discussed above, a change in our estimated losses related to ADP Indemnity compared to the prior year, and a decrease in selling expenses.\nADP Indemnity provides workers’ compensation and employer’s liability deductible reimbursement insurance protection for PEO Services’ worksite employees up to $1 million per occurrence. PEO Services has secured a workers’ compensation and employer’s liability insurance policy that caps the exposure for each claim at $1 million per occurrence and has also secured aggregate stop loss insurance that caps aggregate losses at a certain level in fiscal years 2012 and prior from an admitted and licensed insurance company of AIG. We utilize historical loss experience and actuarial judgment to determine the estimated claim liability, and changes in estimated ultimate incurred losses are included in the PEO segment.\nAdditionally, starting in fiscal year 2013, ADP Indemnity paid premiums to enter into reinsurance arrangements with ACE American Insurance Company, a wholly-owned subsidiary of Chubb Limited (“Chubb”), to cover substantially all losses incurred by the Company up to the $1 million per occurrence related to the workers' compensation and employer's liability deductible reimbursement insurance protection for PEO Services' worksite employees. Each of these reinsurance arrangements limits our overall exposure incurred up to a certain limit. The Company believes the likelihood of ultimate losses exceeding this limit is remote. During fiscal 2021, ADP Indemnity paid a premium of $240 million to enter into a reinsurance arrangement with Chubb to cover substantially all losses incurred by ADP Indemnity for the fiscal 2021 policy year up to $1 million per occurrence. ADP Indemnity recorded a pre-tax benefit of approximately $32 million in fiscal 2021 and a pre-tax loss of approximately $20 million in fiscal 2020, which were primarily a result of changes in our estimated actuarial losses. ADP Indemnity paid a premium of $260 million in July 2021 to enter into a reinsurance agreement with Chubb to cover substantially all losses incurred by ADP Indemnity for fiscal 2022 policy year on terms substantially similar to the fiscal 2021 reinsurance policy.\nOther\nThe primary components of “Other” are certain corporate overhead charges and expenses that have not been allocated to the reportable segments, including corporate functions, costs related to our transformation office, legal settlements, severance costs, non-recurring gains and losses, the elimination of intercompany transactions, and other interest expense.\nNon-GAAP Financial Measures\nIn addition to our GAAP results, we use the adjusted results and other non-GAAP metrics set forth in the table below to evaluate our operating performance in the absence of certain items and for planning and forecasting of future periods:\nAdjusted Financial Measures U.S. GAAP Measures\nAdjusted EBIT Net earnings\nAdjusted provision for income taxes Provision for income taxes\nAdjusted net earnings Net earnings\nAdjusted diluted earnings per share Diluted earnings per share\nAdjusted effective tax rate Effective tax rate\nOrganic constant currency Revenues\nWe believe that the exclusion of the identified items helps us reflect the fundamentals of our underlying business model and analyze results against our expectations and against prior period, and to plan for future periods by focusing on our underlying operations. We believe that the adjusted results provide relevant and useful information for investors because it allows investors to view performance in a manner similar to the method used by management and improves their ability to understand and assess our operating performance. The nature of these exclusions is for specific items that are not fundamental to our underlying business operations. Since these adjusted financial measures and other non-GAAP metrics are not measures of performance calculated in accordance with U.S. GAAP, they should not be considered in isolation from, as a substitute for, or superior to their corresponding U.S. GAAP measures, and they may not be comparable to similarly titled measures at other companies.\nYears Ended\nJune 30, % Change\n2021 2020 As Reported\nNet earnings $ 2,598.5 $ 2,466.5 5 %\nAdjustments:\nProvision for income taxes 762.7 716.1\nAll other interest expense (a) 57.3 59.2\nAll other interest income (a) (6.5) (20.5)\nGain on sale of assets - (0.2)\nTransformation initiatives (b) - 77.4\nExcess capacity severance charges (c) 2.9 25.4\nLegal settlements (d) (30.7) 25.0\nAdjusted EBIT $ 3,384.2 $ 3,348.9 1 %\nAdjusted EBIT Margin 22.6 % 23.0 %\nProvision for income taxes $ 762.7 $ 716.1 7 %\nAdjustments:\nGain on sale of assets (e) - (0.1)\nTransformation initiatives (e) - 19.2\nExcess capacity severance charges (e) 0.5 6.3\nLegal settlements (e) (7.5) 6.2\nAdjusted provision for income taxes $ 755.7 $ 747.7 1 %\nAdjusted effective tax rate (f) 22.7 % 22.6 %\nNet earnings $ 2,598.5 $ 2,466.5 5 %\nAdjustments:\nGain on sale of assets - (0.2)\nIncome tax provision on gain on sale of assets (e) - 0.1\nTransformation initiatives (b) - 77.4\nIncome tax benefit for transformation initiatives (e) - (19.2)\nExcess capacity severance charges (c) 2.9 25.4\nIncome tax benefit for excess capacity severance charges (e) (0.5) (6.3)\nLegal settlements (d) (30.7) 25.0\nIncome tax provision/ (benefit) for legal settlements (e) 7.5 (6.2)\nAdjusted net earnings $ 2,577.7 $ 2,562.5 1 %\nDiluted EPS $ 6.07 $ 5.70 6 %\nAdjustments:\nGain on sale of assets (e) - -\nTransformation initiatives (b) (e) - 0.13\nExcess capacity severance charges (c) (e) 0.01 0.04\nLegal settlements (d) (e) (0.05) 0.04\nAdjusted diluted EPS $ 6.02 $ 5.92 2 %\n(a) We include the interest income earned on investments associated with our client funds extended investment strategy and interest expense on borrowings related to our client funds extended investment strategy as we believe these amounts to be fundamental to the underlying operations of our business model. The adjustments in the table above represent the interest income and interest expense that are not related to our client funds extended investment strategy and are labeled as “All other interest expense” and “All other interest income.”\n(b) In fiscal 2021, transformation initiatives include impairment charges as a result of recognizing certain owned facilities at fair value given intent to sell and accordingly classified as held for sale and lease asset impairment charges, offset by gain on sale of assets and net reversals of charges related to other transformation initiatives, including severance.\nUnlike other severance charges which are not included as an adjustment to get to adjusted results, these specific charges relate to actions taken as part of our broad-based, company-wide transformation initiative.\n(c) Represents net severance cost related to excess capacity. Unlike certain other severance charges in prior periods that are not\nincluded as an adjustment to get to adjusted results, these specific charges relate to actions that are part of our broad-based,\ncompany-wide initiatives to address excess capacity across our business and functions, including charges in fiscal 2020 due to the COVID-19 pandemic.\n(d) Represents legal settlements including an insurance recovery in fiscal 2021.\n(e) The income tax provision/(benefit) was calculated based on the marginal rate in effect for the year ended June 30, 2021.\n(f) The Adjusted effective tax rate is calculated as our Adjusted provision for income taxes divided by the sum of our Adjusted net earnings plus our Adjusted provision for income taxes.\nThe following table reconciles our reported growth rates to the non-GAAP measure of organic constant currency, which excludes the impact of acquisitions, the impact of dispositions, and the impact of foreign currency. The impact of acquisitions and dispositions is calculated by excluding the current year revenues of acquisitions until the one-year anniversary of the transaction and by excluding the prior year revenues of divestitures for the one-year period preceding the transaction. The impact of foreign currency is determined by calculating the current year result using foreign exchange rates consistent with the prior year. The PEO segment is not impacted by acquisitions, dispositions or foreign currency.\nYear Ended\nJune 30,\nConsolidated revenue growth as reported 3 %\nAdjustments:\nImpact of acquisitions\n- %\nImpact of foreign currency\n(1) %\nConsolidated revenue growth, organic constant currency 2 %\nEmployer Services revenue growth as reported 1 %\nAdjustments:\nImpact of acquisitions\n- %\nImpact of foreign currency\n(1) %\nEmployer Services revenue growth, organic constant currency - %\nFINANCIAL CONDITION, LIQUIDITY AND CAPITAL RESOURCES\nAs of June 30, 2021, cash and cash equivalents were $2.6 billion, which were primarily invested in time deposits and money market funds.\nFor corporate liquidity, we expect existing cash, cash equivalents, long-term marketable securities, cash flow from operations together with our $9.7 billion of committed credit facilities and our ability to access both long-term and short-term debt financing from the capital markets will be adequate to meet our operating, investing, and financing activities such as regular quarterly dividends, share repurchases, and capital expenditures for the foreseeable future. Our financial condition remains solid at June 30, 2021 and we have sufficient liquidity as noted above; however, given the uncertainty in the rapidly changing market and economic conditions related to the COVID-19 pandemic, we will continue to evaluate the nature and extent of the impact to our financial condition and liquidity.\nFor client funds liquidity, we have the ability to borrow through our financing arrangements under our U.S. short-term commercial paper program and our U.S., Canadian and United Kingdom short-term reverse repurchase agreements, together with our $9.7 billion of committed credit facilities and our ability to use corporate liquidity when necessary to meet short-term funding requirements related to client funds obligations. Please see “Quantitative and Qualitative Disclosures about Market Risk” for a further discussion of the risks, including with respect to the COVID-19 pandemic, related to our client funds extended investment strategy. See Note 8 of our Consolidated Financial Statements for a description of our short-term financing including commercial paper.\nOperating, Investing and Financing Cash Flows\nOur cash flows from operating, investing, and financing activities, as reflected in the Statements of Consolidated Cash Flows are summarized as follows:\nYears ended June 30,\n2021 2020 $ Change\nCash provided by (used in):\nOperating activities $ 3,093.3 $ 3,026.2 $ 67.1\nInvesting activities (3,515.0) 3,156.3 (6,671.3)\nFinancing activities 6,437.5 (5,890.6) 12,328.1\nEffect of exchange rate changes on cash, cash equivalents, restricted cash, and restricted cash equivalents 73.8 (34.5) 108.3\nNet change in cash, cash equivalents, restricted cash, and restricted cash equivalents $ 6,089.6 $ 257.4 $ 5,832.2\nNet cash flows provided by operating activities increased due to a net favorable change in the components of operating assets and liabilities as compared to the year ended June 30, 2020.\nNet cash flows from investing activities changed due to the timing of proceeds and purchases of corporate and client funds marketable securities of $6,771.2 million.\nNet cash flows from financing activities changed due to a net increase in the cash flow from client funds obligations of $11,549.4 million, which is due to the timing of impounds from our clients and payments to our clients' employees and other payees, and proceeds from debt issuances. These were partially offset by payments of debt, more cash returned to shareholders via share repurchases and dividends, and settlement of cash flow hedges in fiscal 2021.\nWe purchased approximately 8.2 million shares of our common stock at an average price per share of $170.04 during fiscal 2021, as compared to purchases of 6.2 million shares at an average price per share of $160.61 during fiscal 2020. From time to time, the Company may repurchase shares of its common stock under its authorized share repurchase program. The Company considers several factors in determining when to execute share repurchases, including, among other things, actual and potential acquisition activity, cash balances and cash flows, issuances due to employee benefit plan activity, and market conditions.\nCapital Resources and Client Fund Obligations\nWe have $3.0 billion of senior unsecured notes with maturity dates in 2025, 2028, and 2030. We may from time to time revisit the long-term debt market to refinance existing debt, finance investments including acquisitions for our growth, and maintain the appropriate capital structure. However, there can be no assurance that volatility in the global capital and credit markets would not impair our ability to access these markets on terms acceptable to us, or at all. See Note 9 of our Consolidated Financial Statements for a description of our notes.\nOur U.S. short-term funding requirements related to client funds are sometimes obtained on an unsecured basis through the issuance of commercial paper, rather than liquidating previously-collected client funds that have already been invested in available-for-sale securities. This commercial paper program provides for the issuance of up to $9.7 billion in aggregate maturity value. Our commercial paper program is rated A-1+ by Standard and Poor’s, Prime-1 (“P-1”) by Moody’s and+ by Fitch. These ratings denote the highest quality commercial paper securities. Maturities of commercial paper can range from overnight to up to 364 days. At June 30, 2021 and 2020, we had no commercial paper borrowing outstanding. Details of the borrowings under the commercial paper program are as follows:\nYears ended June 30, 2021 2020\nAverage daily borrowings (in billions) $ 1.6 $ 2.7\nWeighted average interest rates 0.1 % 1.6 %\nWeighted average maturity (approximately in days) 1 day 2 days\nOur U.S., Canadian, and United Kingdom short-term funding requirements related to client funds obligations are sometimes obtained on a secured basis through the use of reverse repurchase agreements, which are collateralized principally by\ngovernment and government agency securities, rather than liquidating previously-collected client funds that have already been invested in available-for-sale securities. These agreements generally have terms ranging from overnight to up to five business days. We have successfully borrowed through the use of reverse repurchase agreements on an as-needed basis to meet short-term funding requirements related to client funds obligations. At June 30, 2021 and 2020, there were $23.5 million and $13.6 million, respectively, of outstanding obligations related to the reverse repurchase agreements. Details of the reverse repurchase agreements are as follows:\nYears ended June 30, 2021 2020\nAverage outstanding balances $ 136.7 $ 263.4\nWeighted average interest rates 0.2 % 1.6 %\nWe vary the maturities of our committed credit facilities to limit the refinancing risk of any one facility. We have a $3.75 billion, 364-day credit agreement that matures in June 2022 with a one year term-out option. In addition, we have a five-year $2.75 billion credit facility and a five-year $3.2 billion credit facility maturing in June 2024 and June 2026, respectively, each with an accordion feature under which the aggregate commitment can be increased by $500 million, subject to the availability of additional commitments. The primary uses of the credit facilities are to provide liquidity to the commercial paper program and funding for general corporate purposes, if necessary. We had no borrowings through June 30, 2021 under the credit facilities. We believe that we currently meet all conditions set forth in the revolving credit agreements to borrow thereunder, and we are not aware of any conditions that would prevent us from borrowing part or all of the $9.7 billion available to us under the revolving credit agreements. See Note 8 of our Consolidated Financial Statements for a description of our short-term financing including credit facilities.\nOur investment portfolio does not contain any asset-backed securities with underlying collateral of sub-prime mortgages, alternative-A mortgages, sub-prime auto loans or sub-prime home equity loans, collateralized debt obligations, collateralized loan obligations, credit default swaps, derivatives, auction rate securities, structured investment vehicles or non-investment grade fixed-income securities. We own AAA-rated senior tranches of primarily fixed rate auto loan, credit card, equipment lease, and rate reduction receivables, secured predominantly by prime collateral. All collateral on asset-backed securities is performing as expected through June 30, 2021. In addition, we own U.S. government securities which primarily include debt directly issued by Federal Farm Credit Banks and Federal Home Loan Banks. Our client funds investment strategy is structured to allow us to average our way through an interest rate cycle by laddering the maturities of our investments out to five years (in the case of the extended portfolio) and out to ten years (in the case of the long portfolio). This investment strategy is supported by our short-term financing arrangements necessary to satisfy short-term funding requirements relating to client funds obligations. See Note 4 of our Consolidated Financial Statements for a description of our corporate investments and funds held for clients.\nCapital expenditures for fiscal 2021 were $178.3 million, as compared to $168.3 million for fiscal 2020. We expect capital expenditures in fiscal 2022 to be between $200 million and $225 million.\nContractual Obligations\nThe following table provides a summary of our contractual obligations at June 30, 2021:\n(In millions) Payments due by period\nContractual Obligations Less than\n1 year 1-3\nyears 3-5\nyears More than\n5 years Unknown Total\nDebt Obligations (1) $ 64.2 $ 128.5 $ 1,111.8 $ 2,092.1 $ - $ 3,396.6\nOperating Lease Obligations (2) $ 103.2 $ 160.7 $ 102.5 $ 100.9 $ - $ 467.3\nPurchase Obligations (3) $ 448.5 $ 184.8 $ 25.3 $ - $ - $ 658.6\nObligations Related to Unrecognized\nTax Benefits (4) $ 14.8 $ - $ - $ - $ 85.1 $ 99.9\nOther Long-Term Liabilities Reflected\non our Consolidated Balance Sheets:\nCompensation and Benefits (5) $ 49.0 $ 64.9 $ 57.4 $ 267.2 $ 33.9 $ 472.4\nTotal $ 679.7 $ 538.9 $ 1,297.0 $ 2,460.2 $ 119.0 $ 5,094.8\n(1)These amounts represent the principal and interest payments of our debt.\n(2)Included in these amounts are various facilities and equipment leases. We enter into operating leases in the normal course of business relating to facilities and equipment. The majority of our lease agreements have fixed payment terms based on the passage of time. Certain facility and equipment leases require payment of maintenance and real estate taxes and contain escalation provisions based on future adjustments in price indices. Our future operating lease obligations could change if we exit certain contracts or if we enter into additional operating lease agreements.\n(3)Purchase obligations are comprised of a $260 million reinsurance premium with Chubb for the fiscal 2022 policy year, as well as obligations related to software subscription licenses and purchase and maintenance agreements on our software, equipment, and other assets.\n(4)Based on current estimates, we expect to make cash payments up to $14.8 million in the next twelve months for obligations related to unrecognized tax benefits across various jurisdictions and tax periods. For $85.1 million of obligations related to unrecognized tax benefits we are unable to make reasonably reliable estimates as to the period in which cash payments are expected to be paid.\n(5)Compensation and benefits primarily relates to amounts associated with our employee benefit plans and other compensation arrangements. These amounts exclude the estimated contributions to our defined benefit plans, which are expected to be $10.0 million in fiscal 2022.\nIn addition to the obligations quantified in the table above, we had obligations for the remittance of funds relating to our payroll and payroll tax filing services. As of June 30, 2021, the obligations relating to these matters, which are expected to be paid in fiscal 2022, total $34,403.8 million and were recorded in client funds obligations on our Consolidated Balance Sheets. We had $34,905.8 million of cash and cash equivalents and marketable securities that were impounded from our clients to satisfy such obligations recorded in funds held for clients on our Consolidated Balance Sheets as of June 30, 2021.\nSeparately, ADP Indemnity paid a premium of $260 million in July 2021 to enter into a reinsurance agreement with Chubb to cover substantially all losses incurred by ADP Indemnity for the fiscal 2022 policy year. At June 30, 2021, ADP Indemnity had total assets of $564.2 million to satisfy the actuarially estimated unpaid losses of $487.4 million for the policy years since July 1, 2003. ADP Indemnity paid claims of $3.3 million and $4.4 million, net of insurance recoveries, in fiscal 2021 and 2020, respectively. Refer to the “Analysis of Reportable Segments - PEO Services” above for additional information regarding ADP Indemnity.\nIn the normal course of business, we also enter into contracts in which we make representations and warranties that relate to the performance of our services and products. We do not expect any material losses related to such representations and warranties.\nQuantitative and Qualitative Disclosures about Market Risk\nOur overall investment portfolio is comprised of corporate investments (cash and cash equivalents, short-term and long-term marketable securities) and client funds assets (funds that have been collected from clients but have not yet been remitted to the applicable tax authorities or client employees).\nOur corporate investments are invested in cash and cash equivalents and highly liquid, investment-grade marketable securities. These assets are available for our regular quarterly dividends, share repurchases, capital expenditures and/or acquisitions, as well as other corporate operating purposes. All of our short-term and long-term fixed-income securities are classified as available-for-sale securities.\nOur client funds assets are invested with safety of principal, liquidity, and diversification as the primary objectives. Consistent with those objectives, we also seek to maximize interest income and to minimize the volatility of interest income. Client funds assets are invested in highly liquid, investment-grade marketable securities, with a maximum maturity of 10 years at the time of purchase, and money market securities and other cash equivalents.\nWe utilize a strategy by which we extend the maturities of our investment portfolio for funds held for clients and employ short-term financing arrangements to satisfy our short-term funding requirements related to client funds obligations. Our client funds investment strategy is structured to allow us to average our way through an interest rate cycle by laddering the maturities of our investments out to five years (in the case of the extended portfolio) and out to ten years (in the case of the long portfolio). As part of our client funds investment strategy, we use the daily collection of funds from our clients to satisfy other unrelated client funds obligations, rather than liquidating previously-collected client funds that have already been invested in available-for-sale securities. In circumstances where we experience a reduction in employment levels due to a slowdown in the economy, we may make tactical decisions to sell certain securities in order to reduce the size of the funds held for clients to correspond to client funds obligations. We minimize the risk of not having funds collected from a client available at the time such client’s obligation becomes due by impounding, in virtually all instances, the client’s funds in advance of the timing of payment of such client’s\nobligation. As a result of this practice, we have consistently maintained the required level of client funds assets to satisfy all of our obligations.\nThere are inherent risks and uncertainties involving our investment strategy relating to our client funds assets. Such risks include liquidity risk, including the risk associated with our ability to liquidate, if necessary, our available-for-sale securities in a timely manner in order to satisfy our client funds obligations. However, our investments are made with the safety of principal, liquidity, and diversification as the primary goals to minimize the risk of not having sufficient funds to satisfy all of our client funds obligations. We also believe we have significantly reduced the risk of not having sufficient funds to satisfy our client funds obligations by consistently maintaining access to other sources of liquidity, including our corporate cash balances, available borrowings under our $9.7 billion commercial paper program (rated A-1+ by Standard and Poor’s, P-1 by Moody’s, and+ by Fitch, the highest possible short-term credit ratings), and our ability to engage in reverse repurchase agreement transactions and available borrowings under our $9.7 billion committed credit facilities. The reduced availability of financing during periods of economic turmoil, including the COVID-19 pandemic, even to borrowers with the highest credit ratings, may limit our ability to access short-term debt markets to meet the liquidity needs of our business. In addition to liquidity risk, our investments are subject to interest rate risk and credit risk, as discussed below.\nWe have established credit quality, maturity, and exposure limits for our investments. The minimum allowed credit rating at time of purchase for corporate, Canadian government agency and Canadian provincial bonds is BBB, for asset-backed securities is AAA, and for municipal bonds is A. The maximum maturity at time of purchase for BBB-rated securities is 5 years, for single A rated securities is 10 years, and for AA-rated and AAA-rated securities is 10 years. Time deposits and commercial paper must be rated A-1 and/or P-1. Money market funds must be rated AAA/Aaa-mf.\nDetails regarding our overall investment portfolio are as follows:\nYears ended June 30, 2021 2020\nAverage investment balances at cost:\nCorporate investments $ 3,525.6 $ 4,560.3\nFunds held for clients 27,353.1 25,990.3\nTotal $ 30,878.7 $ 30,550.6\nAverage interest rates earned exclusive of realized\n(gains)/losses on:\nCorporate investments 1.0 % 1.9 %\nFunds held for clients 1.5 % 2.1 %\nTotal 1.5 % 2.1 %\nNet realized (gains)/losses on available-for-sale securities $ (11.3) $ (12.9)\nAs of June 30:\nNet unrealized pre-tax gains on available-for-sale securities $ 502.2 $ 876.8\nTotal available-for-sale securities at fair value $ 24,371.7 $ 21,576.6\nWe are exposed to interest rate risk in relation to securities that mature, as the proceeds from maturing securities are reinvested. Factors that influence the earnings impact of interest rate changes include, among others, the amount of invested funds and the overall portfolio mix between short-term and long-term investments. This mix varies during the fiscal year and is impacted by daily interest rate changes. The annualized interest rate earned on our entire portfolio decreased from 2.1% for fiscal 2020 to 1.5% for fiscal 2021. A hypothetical change in both short-term interest rates (e.g., overnight interest rates or the federal funds rate) and intermediate-term interest rates of 25 basis points applied to the estimated average investment balances and any related short-term borrowings would result in approximately a $22 million impact to earnings before income taxes over the ensuing twelve-month period ending June 30, 2022. A hypothetical change in only short-term interest rates of 25 basis points applied to the estimated average short-term investment balances and any related short-term borrowings would result in approximately an $10 million impact to earnings before income taxes over the ensuing twelve-month period ending June 30, 2022.\nWe are exposed to credit risk in connection with our available-for-sale securities through the possible inability of the borrowers to meet the terms of the securities. We limit credit risk by investing in investment-grade securities, primarily AAA-rated and AA- rated securities, as rated by Moody’s, Standard & Poor’s, DBRS for Canadian dollar denominated securities, and Fitch for asset-backed and commercial-mortgage-backed securities. Approximately 72% of our available-for-sale securities held a AAA-rating or AA-rating at June 30, 2021. In addition, we limit amounts that can be invested in any security other than U.S. government and government agency, Canadian government, and United Kingdom government securities.\nWe operate and transact business in various foreign jurisdictions and are therefore exposed to market risk from changes in foreign currency exchange rates that could impact our consolidated results of operations, financial position, or cash flows. We manage our exposure to these market risks through our regular operating and financing activities and, when deemed appropriate, through the use of derivative financial instruments. We may use derivative financial instruments as risk management tools and not for trading purposes.\nRECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS\nSee Note 1, Recently Issued Accounting Pronouncements, of Notes to the Consolidated Financial Statements for a discussion of recent accounting pronouncements.\nCRITICAL ACCOUNTING POLICIES\nOur Consolidated Financial Statements and accompanying notes have been prepared in accordance with U.S. GAAP. The preparation of these financial statements requires management to make estimates, judgments, and assumptions that affect reported amounts of assets, liabilities, revenues, expenses and other comprehensive income. We continually evaluate the accounting policies and estimates used to prepare the Consolidated Financial Statements. The estimates are based on historical experience and assumptions believed to be reasonable under current facts and circumstances. Actual amounts and results could differ from these estimates made by management. In addition, as the duration and severity of COVID-19 pandemic are uncertain, certain of our estimates could require further judgment or modification and therefore carry a higher degree of variability and volatility. As events continue to evolve, our estimates may change materially in future periods. Certain accounting policies that require significant management estimates and are deemed critical to our results of operations or financial position are Revenue Recognition (including Deferred Costs), Goodwill and Income Taxes. Refer to Note 1, Summary of Significant Accounting Policies, of Notes to the Consolidated Financial Statements for discussion of our policies for Revenue Recognition (including Deferred Costs), Goodwill and Income Taxes.\nGoodwill. Goodwill represents the excess of purchase price over the value assigned to the net tangible and identifiable intangible assets of businesses acquired. Goodwill is tested annually for impairment or more frequently when an event or circumstance indicates that goodwill might be impaired.\nThe Company’s annual goodwill impairment assessment as of June 30, 2021 was performed for all reporting units using a quantitative approach by comparing the fair value of each reporting unit to its carrying value. We estimated the fair value of each reporting unit using, as appropriate, the income approach, which is derived using the present value of future cash flows discounted at a risk-adjusted weighted-average cost of capital, and the market approach, which is based upon using market multiples of companies in similar lines of business. Significant assumptions used in determining the fair value of our reporting units include projected revenue growth rates, profitability projections, working capital assumptions, the weighted average cost of capital, the determination of appropriate market comparison companies, and terminal growth rates. Several of these assumptions including projected revenue growth rates and profitability projections are dependent on our ability to upgrade, enhance, and expand our technology and services to meet client needs and preferences. As such, the determination of fair value requires management to make significant estimates and assumptions related to forecasts of future revenue and operating margins. Based upon the quantitative assessment, the Company has concluded that goodwill is not impaired. As the assumptions used in the income approach and market approach can have a material impact on the fair value determinations, we performed a sensitivity analysis and determined that a one percentage point increase in the weighted-average cost of capital would not result in an impairment of goodwill for all reporting units and their fair values substantially exceeded their carrying values.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nThe information called for by this item is provided under the caption “Quantitative and Qualitative Disclosures About Market Risk” under “Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operation.”",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of\nAutomatic Data Processing, Inc.\nRoseland, New Jersey\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Automatic Data Processing, Inc. and subsidiaries (the \"Company\") as of June 30, 2021 and 2020, and the related statements of consolidated earnings, comprehensive income, stockholders' equity, and cash flows for each of the three years in the period ended June 30, 2021, and the related notes and the schedule listed in the Index at Item 15(a)2 (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2021 and 2020, and the results of its operations and its cash flows for each of the three years in the period ended June 30, 2021, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of June 30, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated August 4, 2021, expressed an unqualified opinion on the Company’s internal control over financial reporting.\nChange in Accounting Principle\nAs discussed in Note 1 to the financial statements, effective July 1, 2019, the Company adopted FASB Accounting Standards Update 2016-02, Leases (ASC 842), under the optional transition method.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risk of material misstatements of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current-period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nGoodwill - Employer Services Reportable Segment- Refer to Notes 1 and 7 to the financial statements\nCritical Audit Matter Description\nThe Company’s evaluation of goodwill for impairment involves the comparison of the fair value of each reporting unit to its carrying value. The Company uses the discounted cash flow model to estimate fair value, which requires management to make significant estimates and assumptions related to forecasts of future revenue and operating margin. In addition, the discounted cash flow model requires the Company to select an appropriate weighted average cost of capital based on current market conditions as of June 30, 2021. Changes in these assumptions could have a significant impact on either the fair value, the amount of any goodwill impairment charge, or both.\nForecasts of future revenue and operating margin from the Company’s next-gen platform, for which there is limited historical data, contribute significantly to the estimate of fair value of a reporting unit within the Employer Services reportable segment with approximately $678 million of goodwill as of June 30, 2021. Given the limited historical data associated with the Company’s next-gen platform, significant management judgment was required to forecast future revenue and operating margin to estimate the fair value of the reporting unit. In turn, a high degree of auditor judgment and an increased extent of audit effort were required when performing audit procedures to evaluate the reasonableness of management’s estimates and assumptions related to the forecasts of revenue and operating margin and the selection of the weighted average cost of capital, including the involvement of our fair value specialists.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the forecasts of future revenue and operating margin and the selection of the weighted average cost of capital used by management to estimate the fair value contributed by the next-gen platform included the following, among others:\n•We tested the effectiveness of controls over management’s goodwill impairment evaluation, including those over the determination of the fair value of the reporting unit within the Employer Services reportable segment, such as controls related to management’s forecasts of future revenue and operating margin and the selection of the weighted average cost of capital.\n•With the assistance of our fair value specialists, we evaluated the reasonableness of the valuation models, methodology, and significant assumptions used by the Company, specifically the weighted average cost of capital including:\n◦Testing the mathematical accuracy of the Company’s calculation of the weighted average cost of capital.\n◦Developing a range of independent estimates and compared to the weighted average cost of capital selected by management.\n•We evaluated management’s ability to accurately forecast future revenue and operating margin by comparing actual results to management’s historical forecasts. Due to the limited historical data for the next-gen platform, we evaluated the reasonableness of management’s revenue and operating margin forecasts by comparing the forecasts to (1) the historical operating results of the Company’s similar existing platforms, (2) the limited operating results to date of the next-gen platform, (3) internal communications to management and the board of directors, and (4) external communications made by management to analysts and investors.\nClient Funds Obligations - Refer to Note 4 to the financial statements\nCritical Audit Matter Description\nClient funds obligations represent the Company's contractual obligations to remit funds to satisfy clients' payroll, tax and other payee payment obligations and are recorded as a liability at the time that the Company impounds funds from clients (i.e., money movement). The Company has reported client funds obligations as a current liability in the consolidated financial statements totaling $34,403.8 million as of June 30, 2021. This money movement activity involves significant amounts of client funds being impounded and remitted to third parties and results in a high volume of transactions.\nTo validate the accuracy and completeness of the client funds obligations reported as of period end, the Company performs complex data extracts in order to reconcile the transactional data to the client funds obligations and funds held for clients balances reported at period end. Given the significant volume of data used in the reconciliation, the complexity of the data extraction, and the reconciliation of the data extracts to the client funds obligations balance reported, auditing the client funds obligations is complex and requires the involvement of data specialists to independently reperform the reconciliation and assist with testing of the completeness and accuracy of client funds obligations reported as of period end, including identifying the manual adjustments identified in management’s reconciliation process.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the Company's client funds obligations included the following, among others:\n•We tested the effectiveness of general information technology controls over the applications relevant to the money movement reconciliation process.\n•We tested the effectiveness of (1) management’s controls over the client funds obligations data reconciliation and (2) management’s control to reconcile the consolidated client funds obligations to the corresponding consolidated funds held for clients balance.\n•We involved data specialists to (1) independently reperform management’s client funds obligations reconciliation and (2) perform data analyses to identify and evaluate recurring and new adjustments to the data extracts in the current period.\n•For a selection of client funds obligations transactions, we evaluated whether the funds were impounded prior to June 30, 2021, agreed the liability to the corresponding asset balance, and evaluated whether the funds were properly included or excluded from the client funds obligations.\n•We made a selection of adjustments identified by management’s reconciliation of the transactional data to the client funds obligations balance reported at period end and evaluated whether the adjustments were supported and appropriate to reconcile and validate the client funds obligations balance reported at period end.\n•We made a selection of disbursements to third parties subsequent to the balance sheet date to evaluate whether they were properly included or excluded from client funds obligations.\n•We tested the Company’s reconciliation of the consolidated client funds obligations to funds held for clients.\n/s/ Deloitte & Touche LLP\nParsippany, New Jersey\nAugust 4, 2021\nWe have served as the Company’s auditor since 1968.\nStatements of Consolidated Earnings\n(In millions, except per share amounts)\nYears ended June 30, 2021 2020 2019\nREVENUES:\nRevenues, other than interest on funds held\nfor clients and PEO revenues $ 9,768.6 $ 9,538.1 $ 9,375.8\nInterest on funds held for clients 422.4 545.2 561.9\nPEO revenues (A) 4,814.4 4,506.5 4,172.5\nTOTAL REVENUES 15,005.4 14,589.8 14,110.2\nEXPENSES:\nCosts of revenues:\nOperating expenses 7,520.7 7,404.1 7,080.9\nSystems development and programming costs 716.6 674.1 636.3\nDepreciation and amortization 403.0 366.9 304.4\nTOTAL COSTS OF REVENUES 8,640.3 8,445.1 8,021.6\nSelling, general, and administrative expenses 3,040.5 3,003.0 3,064.2\nInterest expense 59.7 107.1 129.9\nTOTAL EXPENSES 11,740.5 11,555.2 11,215.7\nOther (income)/expense, net (96.3) (148.0) (111.1)\nEARNINGS BEFORE INCOME TAXES 3,361.2 3,182.6 3,005.6\nProvision for income taxes 762.7 716.1 712.8\nNET EARNINGS $ 2,598.5 $ 2,466.5 $ 2,292.8\nBASIC EARNINGS PER SHARE $ 6.10 $ 5.73 $ 5.27\nDILUTED EARNINGS PER SHARE $ 6.07 $ 5.70 $ 5.24\nBasic weighted average shares outstanding 426.3 430.8 435.0\nDiluted weighted average shares outstanding 428.1 432.7 437.6\n(A) For the years ended June 30, 2021 (“fiscal 2021”), June 30, 2020 (“fiscal 2020”), and June 30, 2019 (“fiscal 2019”), Professional Employer Organization (“PEO”) revenues are net of direct pass-through costs, primarily consisting of payroll wages and payroll taxes, of $51,362.3 million, $45,826.1 million, and $42,688.8 million, respectively.\nSee notes to the Consolidated Financial Statements.\nStatements of Consolidated Comprehensive Income\n(In millions)\nYears ended June 30, 2021 2020 2019\nNet earnings $ 2,598.5 $ 2,466.5 $ 2,292.8\nOther comprehensive income/(loss):\nCurrency translation adjustments 95.4 (53.0) (42.2)\nUnrealized net gains/(losses) on available-for-sale securities (363.3) 602.2 642.4\nTax effect 82.6 (136.4) (144.4)\nReclassification of net losses/(gains) on available-for-sale securities to net earnings (11.3) (12.9) 0.9\nTax effect 2.5 2.9 (0.3)\nUnrealized (losses)/gains on cash flow hedging activities (3.3) (40.3) -\nTax effect 0.8 10.0 -\nAmortization of unrealized losses on cash flow hedging activities 3.8 - -\nTax effect (0.9) - -\nPension net (losses)/gains arising during the year 281.5 (160.8) (84.7)\nTax effect (69.0) 39.5 20.0\nReclassification of pension liability adjustment to net earnings 9.3 (11.8) 40.3\nTax effect (2.7) 3.1 (9.5)\nOther comprehensive income/(loss), net of tax 25.4 242.5 422.5\nComprehensive income $ 2,623.9 $ 2,709.0 $ 2,715.3\nSee notes to the Consolidated Financial Statements.\nConsolidated Balance Sheets\n(In millions, except per share amounts)\nJune 30, 2021 2020\nAssets\nCurrent assets:\nCash and cash equivalents $ 2,575.2 $ 1,908.5\nAccounts receivable, net of allowance for doubtful accounts of $79.6 and $92.5, respectively\n2,727.4 2,441.3\nOther current assets 533.4 506.2\nTotal current assets before funds held for clients 5,836.0 4,856.0\nFunds held for clients 34,905.8 26,708.1\nTotal current assets 40,741.8 31,564.1\nLong-term receivables, net of allowance for doubtful accounts of $0.3 and $0.5, respectively\n11.5 18.6\nProperty, plant and equipment, net 684.5 703.9\nOperating lease right-of-use asset 462.2 493.7\nDeferred contract costs 2,498.2 2,401.6\nOther assets 825.8 458.4\nGoodwill 2,338.4 2,309.4\nIntangible assets, net 1,210.1 1,215.8\nTotal assets $ 48,772.5 $ 39,165.5\nLiabilities and Stockholders' Equity\nCurrent liabilities:\nAccounts payable $ 141.1 $ 102.0\nAccrued expenses and other current liabilities 1,963.3 1,980.7\nAccrued payroll and payroll-related expenses 910.2 557.0\nDividends payable 390.8 387.3\nShort-term deferred revenues 203.9 212.5\nObligations under reverse repurchase agreements (A) 23.5 13.6\nShort-term debt - 1,001.8\nIncome taxes payable 58.2 40.1\nTotal current liabilities before client funds obligations 3,691.0 4,295.0\nClient funds obligations 34,403.8 25,831.6\nTotal current liabilities 38,094.8 30,126.6\nLong-term debt 2,985.0 1,002.8\nOperating lease liabilities 343.2 344.4\nOther liabilities 834.1 837.0\nDeferred income taxes 482.9 731.9\nLong-term deferred revenues 362.4 370.6\nTotal liabilities 43,102.4 33,413.3\nCommitments and Contingencies (Note 12)\nStockholders' equity:\nPreferred stock, $1.00 par value: Authorized, 0.3 shares; issued, none\n- -\nCommon stock, $0.10 par value: authorized,1,000.0 shares; issued, 638.7 shares at June 30, 2021 and June 30, 2020;\noutstanding, 423.7 and 429.9 shares at June 30, 2021 and June 30, 2020, respectively\n63.9 63.9\nCapital in excess of par value 1,531.3 1,333.8\nRetained earnings 19,451.1 18,436.3\nTreasury stock - at cost: 215.0 and 208.9 shares at June 30, 2021 and June 30, 2020, respectively\n(15,386.8) (14,067.0)\nAccumulated other comprehensive income (loss) 10.6 (14.8)\nTotal stockholders’ equity 5,670.1 5,752.2\nTotal liabilities and stockholders’ equity $ 48,772.5 $ 39,165.5\n(A) As of June 30, 2021, $23.5 million of long-term marketable securities have been pledged as collateral under the Company's reverse repurchase agreements. As of June 30, 2020, $13.6 million of long-term marketable securities have been pledged as collateral under the Company's reverse repurchase agreements (see Note 8).\nSee notes to the Consolidated Financial Statements.\nStatements of Consolidated Stockholders' Equity\n(In millions, except per share amounts)\nCommon Stock Capital in Excess of Par Value Retained Earnings Treasury Stock Accumulated Other Comprehensive Income/(Loss)\nShares Amount\nBalance at June 30, 2018 638.7 $ 63.9 $ 1,014.8 $ 16,546.6 $ (12,209.6) $ (679.8)\nNet earnings - - - 2,292.8 - -\nOther comprehensive income - - - - - 422.5\nStock-based compensation expense - - 144.2 - - -\nIssuances relating to stock compensation plans - - 24.2 - 124.1 -\nTreasury stock acquired (6.5 million shares repurchased)\n- - - - (1,005.0) -\nDividends ($3.06 per share)\n- - - (1,338.8) - -\nBalance at June 30, 2019 638.7 $ 63.9 $ 1,183.2 $ 17,500.6 $ (13,090.5) $ (257.3)\nNet earnings - - - 2,466.5 - -\nOther comprehensive income - - - - - 242.5\nStock-based compensation expense - - 117.8 - - -\nIssuances relating to stock compensation plans - - 32.8 - 112.9 -\nTreasury stock acquired (6.2 million shares repurchased)\n- - - - (1,089.4) -\nDividends ($3.52 per share)\n- - - (1,523.9) - -\nOther - - - (6.9) - -\nBalance at June 30, 2020 638.7 $ 63.9 $ 1,333.8 $ 18,436.3 $ (14,067.0) $ (14.8)\nNet earnings - - - 2,598.5 - -\nOther comprehensive income - - - - - 25.4\nStock-based compensation expense - - 156.3 - - -\nIssuances relating to stock compensation plans - - 41.2 - 111.4 -\nTreasury stock acquired (8.2 million shares repurchased)\n- - - - (1,431.2) -\nDividends ($3.70 per share)\n- - - (1,583.7) - -\nBalance at June 30, 2021 638.7 $ 63.9 $ 1,531.3 $ 19,451.1 $ (15,386.8) $ 10.6\nSee notes to the Consolidated Financial Statements.\nStatements of Consolidated Cash Flows\n(In millions)\nYears ended June 30, 2021 2020\nCash Flows from Operating Activities:\nNet earnings $ 2,598.5 $ 2,466.5 $ 2,292.8\nAdjustments to reconcile net earnings to cash flows provided by operating activities:\nDepreciation and amortization 510.7 480.0 409.0\nAmortization of deferred contract costs 935.3 915.0 874.0\nDeferred income taxes (251.1) 26.0 9.3\nStock-based compensation expense 175.3 130.8 167.3\nNet pension (income)/expense (52.8) (11.6) 55.4\nNet amortization of premiums and accretion of discounts on available-for-sale securities 69.5 50.2 50.1\nImpairment of assets 19.9 29.9 12.1\nGain on sale of assets (9.8) (6.0) (19.8)\nOther 35.2 65.4 43.9\nChanges in operating assets and liabilities:\nIncrease in accounts receivable (339.8) (113.8) (473.9)\nIncrease in other assets (1,029.4) (910.4) (987.2)\nIncrease/(Decrease) in accounts payable 36.9 (18.3) (10.7)\nIncrease/(Decrease) in accrued expenses and other liabilities 394.9 (77.5) 266.0\nNet cash flows provided by operating activities 3,093.3 3,026.2 2,688.3\nCash Flows from Investing Activities:\nPurchases of corporate and client funds marketable securities (9,266.3) (3,905.1) (4,422.6)\nProceeds from the sales and maturities of corporate and client funds marketable securities 6,238.4 7,648.4 2,909.0\nCapital expenditures (178.6) (172.7) (162.0)\nAdditions to intangibles (327.3) (443.7) (404.5)\nAcquisitions of businesses, net of cash acquired - - (125.5)\nProceeds from the sale of property, plant, and equipment and other assets 18.8 29.4 7.9\nNet cash flows (used in)/provided by investing activities (3,515.0) 3,156.3 (2,197.7)\nCash Flows from Financing Activities:\nNet increase /(decrease) in client funds obligations 8,336.2 (3,213.2) 1,696.0\nPayments of debt (1,001.8) (2.2) (2.1)\nProceeds from the issuance of debt 1,981.5 - -\nSettlement of cash flow hedges (44.6) - -\nRepurchases of common stock (1,372.3) (1,006.3) (937.7)\nNet proceeds from stock purchase plan and stock-based compensation plans 104.1 50.0 72.9\nDividends paid (1,575.5) (1,470.5) (1,293.0)\nNet proceeds/(payments) related to reverse repurchase agreements 9.9 (248.4) 262.0\nOther - - (5.8)\nNet cash flows provided by/(used in) financing activities 6,437.5 (5,890.6) (207.7)\nEffect of exchange rate changes on cash, cash equivalents, restricted cash, and restricted cash equivalents 73.8 (34.5) (28.8)\nNet change in cash, cash equivalents, restricted cash, and restricted cash equivalents 6,089.6 257.4 254.1\nCash, cash equivalents, restricted cash, and restricted cash equivalents, beginning of year 7,053.6 6,796.2 6,542.1\nCash, cash equivalents, restricted cash, and restricted cash equivalents, end of year $ 13,143.2 $ 7,053.6 $ 6,796.2\nReconciliation of cash, cash equivalents, restricted cash, and restricted cash equivalents to the Consolidated Balance Sheets\nCash and cash equivalents $ 2,575.2 $ 1,908.5 $ 1,949.2\nRestricted cash and restricted cash equivalents included in funds held for clients (A) 10,568.0 5,145.1 4,847.0\nTotal cash, cash equivalents, restricted cash, and restricted cash equivalents $ 13,143.2 $ 7,053.6 $ 6,796.2\nSupplemental disclosures of cash flow information:\nCash paid for interest $ 53.1 $ 104.8 $ 127.5\nCash paid for income taxes, net of income tax refunds $ 973.7 $ 677.1 $ 633.8\n(A) See Note 4 for a reconciliation of restricted cash and restricted cash equivalents in funds held for clients on the Consolidated Balance Sheets.\nSee notes to the Consolidated Financial Statements.\nNotes to Consolidated Financial Statements\n(Tabular dollars in millions, except per share amounts)\nNOTE 1. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nA. Basis of Preparation. The accompanying Consolidated Financial Statements and footnotes thereto of Automatic Data Processing, Inc., its subsidiaries and variable interest entity (“ADP” or the “Company”) have been prepared in accordance with accounting principles generally accepted in the United States of America (“U.S. GAAP”). Intercompany balances and transactions have been eliminated in consolidation.\nThe Company has a grantor trust, which holds the majority of the funds provided by its clients pending remittance to employees of those clients, tax authorities, and other payees. The Company is the sole beneficial owner of the trust. The trust meets the criteria in Accounting Standards Codification (“ASC”) 810, “Consolidation” to be characterized as a variable interest entity (“VIE”). The Company has determined that it has a controlling financial interest in the trust because it has both (1) the power to direct the activities that most significantly impact the economic performance of the trust (including the power to make all investment decisions for the trust) and (2) the right to receive benefits that could potentially be significant to the trust (in the form of investment returns) and therefore, consolidates the trust. Further information on these funds and the Company’s obligations to remit to its clients’ employees, tax authorities, and other payees is provided in Note 4, “Corporate Investments and Funds Held for Clients.”\nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and\nassumptions that affect the assets, liabilities, revenues, expenses, and other comprehensive income that are reported in the\nConsolidated Financial Statements and footnotes thereto. Actual results may differ from those estimates.\nCertain amounts from the prior year's financial statements have been reclassified in order to conform to the current year's\npresentation.\nB. Description of Business. The Company is a provider of cloud-based Human Capital Management (“HCM”) solutions. The Company classifies its operations into the following two reportable segments: Employer Services and Professional Employer Organization (“PEO”) Services. The primary components of the “Other” segment are certain corporate overhead charges and expenses that have not been allocated to the reportable segments, including corporate functions, costs related to our transformation office, legal settlements, severance costs, non-recurring gains and losses, the elimination of intercompany transactions, and interest expense.\nC. Revenue Recognition. Revenues are primarily attributable to fees for providing services (e.g., Employer Services' payroll processing fees), investment income on payroll funds, payroll tax filing funds, other Employer Services' client-related funds, and fees charged to implement clients on the Company's solutions. The Company enters into agreements for a fixed fee per transaction (e.g., number of payees or number of payrolls processed).\nThe Company enters into service agreements with clients that include anywhere from one service to a full suite of services. The Company’s agreements vary in duration having a legally enforceable term of 30 days to 5 years. The performance obligations in the agreements are generally combined into one performance obligation, as they are considered a series of distinct services, and are satisfied over time because the client simultaneously receives and consumes the benefits provided as the Company performs the services. The Company uses the output method based on a fixed fee per employee serviced to recognize revenue, as the value to the client of the goods or services transferred to date (e.g. number of payees or number of payrolls processed) appropriately depicts our performance towards complete satisfaction of the performance obligation. The fees are typically billed in the period in which services are performed.\nPEO, a component of the HR Outsourcing (“HRO”) strategic pillar, provides a comprehensive human resources outsourcing solution, including offering benefits, providing workers’ compensation insurance, and administering state unemployment insurance, among other human resources functions. Amounts collected from PEO worksite employers include payroll, fees for benefits, and an administrative fee that also includes payroll taxes, fees for workers’ compensation and state unemployment taxes.\nThe payroll and payroll taxes collected from the worksite employers are presented in revenue net, as the Company does not retain risk and acts as an agent with respect to this aspect of the PEO arrangement. With respect to the payroll and payroll taxes, the worksite employer is primarily responsible for providing the service and has discretion in establishing wages.\nThe fees collected from the worksite employers for benefits (i.e., PEO zero-margin benefits pass-throughs), workers’ compensation and state unemployment taxes are presented in revenues and the associated costs of benefits, workers’ compensation and state unemployment taxes are included in operating expenses, as the Company does retain risk and acts as a principal with respect to this aspect of the arrangement. With respect to these fees, the Company is primarily responsible for fulfilling the service and has discretion in establishing price.\nWe recognize client fund interest income on collected but not yet remitted funds held for clients in revenues as earned, as the collection, holding and remittance of these funds are critical components of providing these services.\nSet up fees received from certain clients to implement the Company's solutions are considered a material right. Therefore, the Company defers revenue associated with these set up fees and records them over the period in which such clients are expected to benefit from the material right, which is approximately five to seven years.\nCollection of consideration the Company expects to receive typically occurs within 30 to 60 days of billing. We assess the collectability of revenues based primarily on the creditworthiness of the customer as determined by credit checks and analysis, as well as the customer's payment history and their intention to pay the consideration.\nD. Deferred Costs.\nIncremental Costs of Obtaining a Contract\nIncremental costs of obtaining a contract (e.g., sales commissions) that are expected to be recovered are capitalized and amortized on a straight-line basis over a period of three to eight years, depending on the Company's business unit. Incremental costs of obtaining a contract include only those costs the Company incurs to obtain a contract that it would not have incurred if the contract had not been obtained. These costs are included in selling, general and administrative expenses.\nCosts to fulfill a Contract\nThe Company capitalizes costs incurred to fulfill its contracts that i) relate directly to the contract ii) are expected to generate resources that will be used to satisfy the Company's performance obligations under the contract and iii) are expected to be recovered through revenue generated under the contract. Costs incurred to implement clients on our solutions (e.g., direct labor) are capitalized and amortized on a straight-line basis over the expected client relationship period if the Company expects to recover those costs. The expected client relationship period ranges from three to eight years. These costs are included in operating expenses.\nThe Company has estimated the amortization periods for the deferred costs by using its historical retention by business units to estimate the pattern during which the service transfers.\nE. Cash and Cash Equivalents. Highly liquid investment securities with a maturity of ninety days or less at the time of purchase are considered cash equivalents. The fair value of our cash and cash equivalents approximates carrying value.\nF. Corporate Investments and Funds Held for Clients. All of the Company's marketable securities are considered to be “available-for-sale” and, accordingly, are carried on the Consolidated Balance Sheets at fair value. Unrealized gains and losses, net of the related tax effect, are excluded from earnings and are reported as a separate component of accumulated other comprehensive income (loss) on the Consolidated Balance Sheets until realized. Realized gains and losses from the sale of available-for-sale securities are determined on an aggregate approach basis and are included in other (income)/expense, net on the Statements of Consolidated Earnings.\nIf the fair value of an available-for-sale debt security is below its amortized cost, the Company assesses whether it intends to sell the security or if it is more likely than not the Company will be required to sell the security before recovery. If either of those two conditions is met, the Company would recognize a charge in earnings equal to the entire difference between the security's amortized cost basis and its fair value. If the Company does not intend to sell a security or it is not more likely than not that it will be required to sell the security before recovery, the unrealized loss is separated into an amount representing the credit loss, which is recognized in earnings, and the amount related to all other factors, which is recognized in accumulated other comprehensive income (loss).\nPremiums and discounts are amortized or accreted over the life of the related available-for-sale security as an adjustment to yield using the effective-interest method. Dividend and interest income are recognized when earned.\nG. Fair Value Measurements. Fair value is defined as the price that would be received to sell an asset or paid to transfer a liability (an exit price) in an orderly transaction between market participants at the measurement date and is based upon the Company’s principal, or most advantageous, market for a specific asset or liability.\nU.S. GAAP provides for a three-level hierarchy of inputs to valuation techniques used to measure fair value, defined as follows:\nLevel 1 Fair value is determined based upon quoted prices for identical assets or liabilities that are traded in active markets.\nLevel 2 Fair value is determined based upon inputs other than quoted prices included in Level 1 that are observable for the asset or liability, either directly or indirectly, for substantially the full term of the asset or liability, including:\n· quoted prices for similar assets or liabilities in active markets;\n· quoted prices for identical or similar assets or liabilities in markets that are not active;\n· inputs other than quoted prices that are observable for the asset or liability; or\n· inputs that are derived principally from or corroborated by observable market data by correlation or other means.\nLevel 3 Fair value is determined based upon inputs that are unobservable and reflect the Company’s own assumptions about the assumptions that market participants would use in pricing the asset or liability based upon the best information available in the circumstances (e.g., internally derived assumptions surrounding the timing and amount of expected cash flows).\nThe Company's corporate investments and funds held for clients (see Note 4) are measured at fair value on a recurring basis as described below. Over 99% of the Company's available-for-sale securities included in Level 2 are valued based on prices obtained from an independent pricing service. To determine the fair value of the Company's Level 2 investments, the independent pricing service uses pricing models for each asset class that are consistent with what other market participants would use, including the market approach. Inputs and assumptions to the pricing model used by the independent pricing service are derived from market observable sources including: benchmark yields, reported trades, broker/dealer quotes, issuer spreads, benchmark securities, bids, offers and other market-related data. Since many fixed income securities do not trade on a daily basis, the independent pricing service applies available information, as applicable, through processes such as benchmark curves, benchmarking of like securities, sector groupings and matrix pricing to prepare valuations. For the purposes of valuing the Company’s asset-backed securities and mortgage-backed securities that are included within Other securities in Note 4, the independent pricing service includes additional inputs to the model such as monthly payment information, new issue data, and collateral performance. For the purposes of valuing the Company’s Municipal bonds, the independent pricing service includes quoted prices for similar assets, benchmark yield curves, and market corroborated inputs. While the Company is not provided access to the proprietary models of the third party pricing service, each quarterly reporting period, the Company reviews the inputs utilized by the independent pricing service and compares the valuations received from the independent pricing service to valuations from at least one other observable source for reasonableness. The Company has not adjusted the prices obtained from the independent pricing service and the Company believes the prices received from the independent pricing service are representative of the prices that would be received to sell the assets at the measurement date (exit price). The Company had no available-for-sale securities included in Level 1 and Level 3 at June 30, 2021.\nIn fiscal 2021, the Company issued two series of fixed-rate notes with staggered maturities of 7 and 10-years totaling $2.0 billion, and in fiscal 2016 the Company issued fixed rate notes with a 10-year maturity of $1.0 billion, for an aggregate principal amount of $3.0 billion (collectively the “Notes”). The fair value of the Notes are estimated in Note 9 utilizing a variety of inputs obtained from an independent pricing service, including benchmark yields, reported trades, non-binding broker/dealer quotes, issuer spreads, two-sided markets, benchmark securities, bids, offers, and reference data. The Notes are senior unsecured obligations, and interest is payable in arrears, semi-annually. The Company reviews the values generated by the independent pricing service for reasonableness by comparing the valuations received from the independent pricing service to valuations from at least one other observable source. The Company has not adjusted the prices obtained from the independent pricing service.\nThe Company's assessment of the significance of a particular input to the fair value measurement requires judgment and may affect the classification of assets and liabilities within the fair value hierarchy. In certain instances, the inputs used to measure fair value may meet the definition of more than one level of the fair value hierarchy. The significant input with the lowest level priority is used to determine the applicable level in the fair value hierarchy.\nH. Property, Plant and Equipment. Property, plant and equipment is stated at cost less accumulated depreciation on the Consolidated Balance Sheets. Depreciation is recognized over the estimated useful lives of the assets using the straight-line method. Leasehold improvements are amortized over the shorter of the term of the lease or the estimated useful lives of the\nimprovements. The estimated useful lives of assets are primarily as follows:\nData processing equipment 5 to 10 years\nBuildings 20 to 40 years\nFurniture and fixtures 4 to 7 years\nI. Leases. Operating lease right-of-use (“ROU”) assets and operating lease liabilities are recognized at the lease commencement date based on the present value of the lease payments over the lease term. The lease liabilities are measured by discounting future lease payments at the Company’s collateralized incremental borrowing rate for financing instruments of a similar term, unless the implicit rate is readily determinable. ROU assets also include adjustments related to prepaid or deferred lease payments and lease incentives. Lease ROU assets are amortized over the life of the lease and tested for impairment in the same manner as long-lived assets as described below.\nJ. Goodwill. Goodwill represents the excess of purchase price over the value assigned to the net tangible and identifiable intangible assets of businesses acquired. Goodwill is tested annually for impairment or more frequently when an event or circumstance indicates that goodwill might be impaired.\nThe Company’s annual goodwill impairment assessment as of June 30, 2021 was performed for all reporting units using a quantitative approach by comparing the fair value of each reporting unit to its carrying value. We estimated the fair value of each reporting unit using, as appropriate, the income approach, which is derived using the present value of future cash flows discounted at a risk-adjusted weighted-average cost of capital, and the market approach, which is based upon using market multiples of companies in similar lines of business. Significant assumptions used in determining the fair value of our reporting units include projected revenue growth rates, profitability projections, working capital assumptions, the weighted average cost of capital, the determination of appropriate market comparison companies, and terminal growth rates. Several of these assumptions including projected revenue growth rates and profitability projections are dependent on our ability to upgrade, enhance, and expand our technology and services to meet client needs and preferences. As such, the determination of fair value requires management to make significant estimates and assumptions related to forecasts of future revenue and operating margins. Based upon the quantitative assessment, the Company has concluded that goodwill is not impaired.\nK. Impairment of Long-Lived Assets. Long-lived assets are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Recoverability of assets to be held and used is measured by a comparison of the carrying amount of an asset to estimated undiscounted future cash flows expected to be generated by the asset. If the carrying amount of an asset exceeds its estimated future cash flows, an impairment charge is recognized for the amount by which the carrying amount of the asset exceeds the fair value of the asset.\nL. Foreign Currency. The net assets of the Company's foreign subsidiaries are translated into U.S. dollars based on exchange rates in effect for each period, and revenues and expenses are translated at average exchange rates in the periods. Gains or losses from balance sheet translation are included in accumulated other comprehensive income (loss) on the Consolidated Balance Sheets. Currency transaction gains or losses, which are included in the results of operations, are not significant for all periods presented.\nM. Foreign Currency Risk Management Programs and Derivative Financial Instruments. The Company transacts business in various foreign jurisdictions and is therefore exposed to market risk from changes in foreign currency exchange rates that could impact its consolidated results of operations, financial position, or cash flows. The Company manages its exposure to these market risks through its regular operating and financing activities and, when deemed appropriate, through the use of derivative financial instruments. The Company does not use derivative financial instruments for trading purposes.\nN. Earnings per Share (“EPS”). The Company computes EPS in accordance with ASC 260.\nThe calculations of basic and diluted EPS are as follows:\nYears ended June 30, Basic Effect of Employee Stock Option Shares Effect of\nEmployee\nRestricted\nStock\nShares Diluted\nNet earnings $ 2,598.5 $ 2,598.5\nWeighted average shares (in millions) 426.3 0.8 1.0 428.1\nEPS $ 6.10 $ 6.07\nNet earnings $ 2,466.5 $ 2,466.5\nWeighted average shares (in millions) 430.8 0.9 1.0 432.7\nEPS $ 5.73 $ 5.70\nNet earnings $ 2,292.8 $ 2,292.8\nWeighted average shares (in millions) 435.0 1.0 1.6 437.6\nEPS $ 5.27 $ 5.24\nOptions to purchase 1.1 million, 1.2 million, and 0.7 million shares of common stock for fiscal 2021, 2020, and 2019, respectively, were excluded from the calculation of diluted earnings per share because their inclusion would have been anti-dilutive.\nO. Stock-Based Compensation. The Company recognizes stock-based compensation expense in net earnings based on the fair value of the award on the date of the grant, and in the case of international units settled in cash, adjusts this fair value based on changes in the Company's stock price during the vesting period. Restricted stock units and restricted stock awards are valued based on the closing price of the Company's common stock on the date of the grant and, in the case of performance based restricted stock units and restricted stock, are adjusted for changes to probabilities of achieving performance targets. International restricted stock units are settled in cash and are marked-to-market based on changes in the Company's stock price. See Note 10 for additional information on the Company's stock-based compensation programs.\nP. Internal Use Software. Expenditures for major software purchases and software developed or obtained for internal use are capitalized and amortized generally over a three to five-year period on a straight-line basis. Software developed as part of the Company's next-generation platforms are depreciated over ten years. The Company begins to capitalize costs incurred for computer software developed for internal use when the preliminary development efforts are successfully completed, management has authorized and committed to funding the project, and it is probable that the project will be completed and the software will be used as intended. Capitalization ceases when a computer software project is substantially complete and ready for its intended use.\nThe Company's policy provides for the capitalization of external direct costs of materials and services associated with developing or obtaining internal use computer software. In addition, the Company also capitalizes certain payroll and payroll-related costs for employees who are directly associated with internal use computer software projects. The amount of capitalizable payroll costs with respect to these employees is limited to the time directly spent on such projects. Costs associated with preliminary project stage activities, training, maintenance, and all other post-implementation stage activities are expensed as incurred. The Company also expenses internal costs related to minor upgrades and enhancements, as it is impractical to separate these costs from normal maintenance activities.\nFees related to cloud-based subscriptions for which the Company has the right to take possession of the software at any time during the hosting period (without significant penalty) and can run the software on internal hardware, or through contract with a third party vendor to host the software, is recognized as an intangible asset and capitalized following the Internal Use Software guidance under ASC 350-40. Subscriptions where the Company accesses the software through the cloud but cannot take\npossession of the software during the hosting period is treated as a service contract, and as such hosting fees are treated as expense.\nQ. Acquisitions. Assets acquired and liabilities assumed in business combinations are recorded on the Company’s Consolidated Balance Sheets as of the respective acquisition dates based upon their estimated fair values at such dates. The results of operations of businesses acquired by the Company are included in the Statements of Consolidated Earnings since their respective dates of acquisition. The excess of the purchase price over the estimated fair values of the underlying assets acquired and liabilities assumed is allocated to goodwill. In certain circumstances, the allocations of the excess purchase price are based upon preliminary estimates and assumptions and subject to revision when the Company receives final information, including appraisals and other analysis. Accordingly, the measurement period for such purchase price allocations will end when the information, or the facts and circumstances, becomes available, but will not exceed twelve months.\nR. Income Taxes. The objectives of accounting for income taxes are to recognize the amount of taxes payable or refundable for the current year and deferred tax liabilities and assets for the future tax consequences of events that have been recognized in an entity's financial statements or tax returns. Judgment is required in addressing the future tax consequences of events that have been recognized in our Consolidated Financial Statements or tax returns (e.g., realization of deferred tax assets, changes in tax laws or interpretations thereof). The Company is subject to the continuous examination of our income tax returns by the Internal Revenue Service (“IRS”) and other tax authorities. A change in the assessment of the outcomes of such matters could materially impact our Consolidated Financial Statements.\nThere is a financial statement recognition threshold and measurement attribute for tax positions taken or expected to be taken in a tax return. Specifically, the likelihood of an entity's tax benefits being sustained must be “more likely than not,” assuming that these positions will be examined by taxing authorities with full knowledge of all relevant information prior to recording the related tax benefit in the financial statements. If a tax position drops below the “more likely than not” standard, the benefit can no longer be recognized. Assumptions, judgment, and the use of estimates are required in determining if the “more likely than not” standard has been met when developing the provision for income taxes. As of June 30, 2021 and 2020, the Company's liabilities for unrecognized tax benefits, which include interest and penalties, were $99.9 million and $62.3 million, respectively.\nIf certain pending tax matters settle within the next twelve months, the total amount of unrecognized tax benefits may increase or decrease for all open tax years and jurisdictions. See Note 11 for additional details.\nS. Workers' Compensation Costs. The Company employs a third-party actuary to assist in determining the estimated claim liability related to workers' compensation and employer's liability coverage for PEO Services worksite employees. In estimating ultimate loss rates, we utilize historical loss experience, exposure data, and actuarial judgment, together with a range of inputs which are primarily based upon the worksite employee's job responsibilities, their location, the historical frequency and severity of workers' compensation claims, and an estimate of future cost trends. For each reporting period, changes in the actuarial assumptions resulting from changes in actual claims experience and other trends are incorporated into our workers' compensation claims cost estimates. PEO Services has secured a workers’ compensation and employer’s liability insurance policy that caps the exposure for each claim at $1 million per occurrence and has also secured aggregate stop loss insurance that caps aggregate losses at a certain level in fiscal years 2012 and prior from an admitted and licensed insurance company of AIG. The Company has obtained approximately $273 million of irrevocable standby letters of credit in favor of licensed insurance companies of AIG to secure TotalSource workers’ compensation obligations if ADP were to fail to reimburse AIG for workers’ compensation payments. The Company had no drawdowns during June 30, 2021 and 2020 under the letters of credit.\nAdditionally, starting in fiscal 2013, ADP Indemnity paid premiums to enter into reinsurance arrangements with ACE American Insurance Company a wholly-owned subsidiary of Chubb Limited to cover substantially all losses incurred by the Company up to the $1 million per occurrence related to workers' compensation and employer's liability deductible reimbursement insurance protection for PEO services worksite employees. Each of these reinsurance arrangements limit our overall exposure incurred up to a certain limit. The Company believes the likelihood of ultimate losses exceeding this limit is remote. ADP Indemnity paid a premium of $240 million to enter into a reinsurance arrangement with Chubb Limited to cover substantially all losses incurred by ADP Indemnity for the fiscal 2021 policy year up to $1 million per occurrence. ADP Indemnity paid a premium of $260 million in July 2021 to enter into a reinsurance arrangement to cover substantially all losses for the fiscal 2022 policy year on terms substantially similar to the fiscal 2021 policy.\nT. Contingencies. In the normal course of business, the Company is subject to loss contingencies, such as claims and assessments arising from litigation and other legal proceedings, contractual indemnities, and tax matters. Accruals for loss contingencies are recorded when the Company determines that it is both probable that a liability has been incurred and the amount of loss can be reasonably estimated. If the estimate of the amount of the loss is a range and some amount within the range appears to be a better estimate than any other amount within the range, that amount is accrued as a liability. If no amount\nwithin the range is a better estimate than any other amount, the minimum amount of the range is accrued as a liability. These accruals are adjusted periodically as assessments change or additional information becomes available. The loss contingencies are included in Selling, general and administrative expenses.\nIf no accrual is made for a loss contingency because the amount of loss cannot be reasonably estimated, the Company will disclose contingent liabilities when there is at least a reasonable possibility that a loss or an additional loss may have been incurred.\nLegal fees and other costs related to litigation and other legal proceedings or services are expensed as incurred and are included in Selling, general and administrative expenses.\nAny claim for insurance recovery is recognized only when realization becomes probable.\nU. Recently Issued Accounting Pronouncements.\nRecently Adopted Accounting Pronouncements\nEffective July 1, 2020, the Company adopted accounting standard update (“ASU”) 2018-13, “Fair Value Measurement.” The update modifies the disclosure requirements on fair value measurements. The adoption of ASU 2018-13 modified the disclosures in Note 6 but did not have an impact on the Company's consolidated results of operations, financial condition, or cash flows.\nEffective July 1, 2020, the Company adopted ASU 2016-13, “Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments.” This update introduces the current expected credit loss (“CECL”) model, which requires an entity to measure credit losses based on expected losses rather than incurred losses for certain financial instruments and financial assets, including trade receivables. The adoption of ASU 2016-13 did not have a material impact on the Company's consolidated results of operations, financial condition, or cash flows.\nRecently Issued Accounting Pronouncements\nThe following table summarizes recent ASU's issued by the Financial Accounting Standards Board (“FASB”) which have been assessed and are applicable to the Company:\nStandard Description Effective Date Effect on Financial Statements or Other Significant Matters\nASU 2018-14 Compensation-Retirement Benefits-Defined Benefit Plans This update modifies the disclosure requirements for employers that sponsor defined benefit pension or other post-retirement plans by removing and adding certain disclosures for these plans. The eliminated disclosures include (a) the amounts in accumulated other comprehensive income expected to be recognized in net periodic benefit costs over the next fiscal year, and (b) the effects of a one percentage point change in assumed health care cost trend rates on the net periodic benefit costs and the benefit obligation for post-retirement health care benefits. Additional disclosures include descriptions of significant gains and losses affecting the benefit obligation for the period. The amendments in ASU 2018-14 would need to be applied on a retrospective basis. July 1, 2021\n(Fiscal 2022) The adoption of this guidance will modify disclosures but will not have an impact on the Company's consolidated results of operations, financial condition, or cash flows.\nNOTE 2. REVENUE\nBased upon similar operational and economic characteristics, the Company’s revenues are disaggregated by its three strategic pillars: Human Capital Management (“HCM”), HR Outsourcing (“HRO”), and Global (“Global”) Solutions, with separate disaggregation for PEO zero-margin benefits pass-through revenues and client fund interest revenues. The Company believes\nthese revenue categories depict how the nature, amount, timing, and uncertainty of its revenue and cash flows are affected by economic factors.\nThe following tables provide details of revenue by our strategic pillars and includes a reconciliation to the Company’s reportable segments:\nYears Ended\nJune 30,\nTypes of Revenues 2021 2020 2019\nHCM $ 6,629.1 $ 6,540.9 $ 6,441.8\nHRO, excluding PEO zero-margin benefits pass-throughs 2,694.8 2,543.2 2,444.4\nPEO zero-margin benefits pass-throughs 3,092.0 2,907.7 2,647.5\nGlobal 2,167.1 2,052.8 2,014.6\nInterest on funds held for clients 422.4 545.2 561.9\nTotal Revenues $ 15,005.4 $ 14,589.8 $ 14,110.2\nReconciliation of disaggregated revenue to our reportable segments for the fiscal year ended June 30, 2021:\nTypes of Revenues Employer Services PEO Other Total\nHCM $ 6,634.6 $ - $ (5.5) $ 6,629.1\nHRO, excluding PEO zero-margin benefits pass-throughs 975.0 1,722.4 (2.6) 2,694.8\nPEO zero-margin benefits pass-throughs - 3,092.0 - 3,092.0\nGlobal 2,167.1 - - 2,167.1\nInterest on funds held for clients 418.5 3.9 - 422.4\nTotal Segment Revenues $ 10,195.2 $ 4,818.3 $ (8.1) $ 15,005.4\nReconciliation of disaggregated revenue to our reportable segments for the fiscal year ended June 30, 2020:\nTypes of Revenues Employer Services PEO Other Total\nHCM $ 6,546.4 $ - $ (5.5) $ 6,540.9\nHRO, excluding PEO zero-margin benefits pass-throughs 947.2 1,598.8 (2.8) 2,543.2\nPEO zero-margin benefits pass-throughs - 2,907.7 - 2,907.7\nGlobal 2,052.8 - - 2,052.8\nInterest on funds held for clients 540.2 5.0 - 545.2\nTotal Segment Revenues $ 10,086.6 $ 4,511.5 $ (8.3) $ 14,589.8\nReconciliation of disaggregated revenue to our reportable segments for the fiscal year ended June 30, 2019:\nTypes of Revenues Employer Services PEO Other Total\nHCM $ 6,447.5 $ - $ (5.7) $ 6,441.8\nHRO, excluding PEO zero-margin benefits pass-throughs 924.0 1,525.0 (4.6) 2,444.4\nPEO zero-margin benefits pass-throughs - 2,647.5 - 2,647.5\nGlobal 2,014.6 - - 2,014.6\nInterest on funds held for clients 556.7 5.2 - 561.9\nTotal Segment Revenues $ 9,942.8 $ 4,177.7 $ (10.3) $ 14,110.2\nContract Balances\nThe timing of revenue recognition for our HCM, HRO and Global Solutions is consistent with the invoicing of clients, as invoicing occurs in the period the services are provided. Therefore, the Company does not recognize a contract asset or liability resulting from the timing of revenue recognition and invoicing.\nChanges in deferred revenue related to set up fees for the twelve months ended June 30, 2021 were as follows:\nContract Liability\nContract liability, July 1, 2020 $ 522.7\nRecognition of revenue included in beginning of year contract liability (163.3)\nContract liability, net of revenue recognized on contracts during the period 130.2\nCurrency translation adjustments 26.5\nContract liability, June 30, 2021 $ 516.1\nDeferred costs\nThe balance is as follows:\nJune 30, 2021 2020\nDeferred costs to obtain a contract $ 1,055.7 $ 977.8\nDeferred costs to fulfill a contract 1,442.5 1,423.8\nTotal deferred contract costs (1) $ 2,498.2 $ 2,401.6\n(1) The amount of total deferred costs amortized during the twelve months ended June 30, 2021, June 30, 2020, and June 30, 2019 were $935.3 million, $915.0 million, and $874.0 million, respectively.\nDeferred costs are periodically reviewed for impairment. There were no impairment losses incurred during the period.\nNOTE 3. OTHER (INCOME)/EXPENSE, NET\nOther (income)/expense, net consists of the following:\nYears ended June 30, 2021 2020 2019\nInterest income on corporate funds $ (36.5) $ (84.5) $ (97.6)\nRealized (gains)/losses on available-for-sale securities, net (11.3) (12.9) 0.9\nImpairment of assets 19.9 29.9 12.1\nGain on sale of assets (8.1) (5.8) (4.1)\nGain on sale of investment (1.7) (0.2) (15.7)\nNon-service components of pension income, net (see Note 10) (58.6) (74.5) (6.7)\nOther (income)/expense, net $ (96.3) $ (148.0) $ (111.1)\nIn fiscal 2021, the Company recorded impairment charges of $19.9 million which is comprised of a write down of $10.5 million related to internally developed software which was determined to have no future use, impairment charges of $9.4 million related to operating right-of-use assets and certain related fixed assets associated with vacating certain leased locations early, and recognizing certain owned facilities at fair value given intent to sell and accordingly classified as held for sale.\nIn fiscal 2020, the Company recorded impairment charges of $25.3 million as a result of recognizing certain owned facilities at fair value given intent to sell and accordingly classified as held for sale. In addition, the Company vacated certain leased locations early and recorded total impairment charges of $4.6 million related to operating right-of-use assets and certain related fixed assets associated with the vacated locations.\nIn fiscal 2019, the Company wrote down $12.1 million of internally developed software which was determined to have no future use due to redundant software identified as part of a recent acquisition.\nIn fiscal 2019, the Company recognized a gain of $15.7 million in relation to the sale of an investment held at cost acquired in\nprior years and subsequently sold during fiscal 2019.\nNOTE 4. CORPORATE INVESTMENTS AND FUNDS HELD FOR CLIENTS\nCorporate investments and funds held for clients at June 30, 2021 and 2020 were as follows:\nJune 30, 2021\nAmortized\nCost Gross\nUnrealized\nGains Gross\nUnrealized\nLosses Fair Value (A)\nType of issue:\nMoney market securities, cash and other cash equivalents $ 13,143.2 $ - $ - $ 13,143.2\nAvailable-for-sale securities:\nCorporate bonds 11,732.3 321.9 (38.5) 12,015.7\nU.S. Treasury securities 4,036.9 64.8 (9.3) 4,092.4\nAsset-backed securities 2,279.8 60.9 (0.9) 2,339.8\nCanadian government obligations and\nCanadian government agency obligations\n1,542.3 15.0 (9.0) 1,548.3\nU.S. government agency securities 1,446.3 22.5 (9.4) 1,459.4\nCanadian provincial bonds 956.3 22.7 (5.3) 973.7\nCommercial mortgage-backed securities 793.4 41.2 - 834.6\nOther securities 1,082.2 30.9 (5.3) 1,107.8\nTotal available-for-sale securities 23,869.5 579.9 (77.7) 24,371.7\nTotal corporate investments and funds held for clients $ 37,012.7 $ 579.9 $ (77.7) $ 37,514.9\n(A) Included within available-for-sale securities are corporate investments with fair values of $33.9 million and funds held for clients with fair values of $24,337.8 million. All available-for-sale securities are included in Level 2 of the fair value hierarchy.\nJune 30, 2020\nAmortized\nCost Gross\nUnrealized\nGains Gross\nUnrealized\nLosses Fair Value (B)\nType of issue:\nMoney market securities, cash and other cash equivalents $ 7,053.6 $ - $ - $ 7,053.6\nAvailable-for-sale securities:\nCorporate bonds 9,188.7 473.4 - 9,662.1\nAsset-backed securities 3,274.6 96.0 (0.5) 3,370.1\nU.S. Treasury securities\n3,580.6 120.8 - 3,701.4\nU.S. government agency securities 1,128.2 35.6 - 1,163.8\nCanadian government obligations and\nCanadian government agency obligations\n1,018.7 23.1 - 1,041.8\nCommercial mortgage-backed securities 814.3 53.9 - 868.2\nCanadian provincial bonds 676.6 33.6 - 710.2\nOther securities 1,018.1 41.1 (0.2) 1,059.0\nTotal available-for-sale securities 20,699.8 877.5 (0.7) 21,576.6\nTotal corporate investments and funds held for clients $ 27,753.4 $ 877.5 $ (0.7) $ 28,630.2\n(B) Included within available-for-sale securities are corporate investments with fair values of $13.6 million and funds held for clients with fair values of $21,563.0 million. All available-for-sale securities were included in Level 2 of the fair value hierarchy.\nFor a description of the fair value hierarchy and the Company's fair value methodologies, including the use of an independent third-party pricing service, see Note 1 “Summary of Significant Accounting Policies.” The Company concurred with and did not adjust the prices obtained from the independent pricing service. The Company had no available-for-sale securities included in Level 1 or Level 3 at June 30, 2021.\nThe unrealized losses and fair values of available-for-sale securities that have been in an unrealized loss position for a period of less than and greater than 12 months as of June 30, 2021, are as follows:\nJune 30, 2021\nSecurities in unrealized loss position less than\n12 months Securities in unrealized loss position greater than 12 months Total\nGross Unrealized\nLosses Fair Market\nValue Gross Unrealized\nLosses Fair Market\nValue Gross\nUnrealized\nLosses Fair\nMarket Value\nCorporate bonds $ (38.5) $ 3,539.6 $ - $ - $ (38.5) $ 3,539.6\nU.S. Treasury securities (9.3) 580.9 - - (9.3) 580.9\nAsset-backed securities (0.9) 160.9 - - (0.9) 160.9\nCanadian government obligations and\nCanadian government agency obligations\n(9.0) 721.3 - - (9.0) 721.3\nU.S. government agency securities\n(9.4) 749.7 - - (9.4) 749.7\nCanadian provincial bonds (5.3) 253.7 - - (5.3) 253.7\nCommercial mortgage-backed securities - 16.7 - - - 16.7\nOther securities (5.2) 308.5 (0.1) 1.9 (5.3) 310.4\n$ (77.6) $ 6,331.3 $ (0.1) $ 1.9 $ (77.7) $ 6,333.2\nThe unrealized losses and fair values of available-for-sale securities that have been in an unrealized loss position for a period of less than and greater than 12 months as of June 30, 2020 are as follows:\nJune 30, 2020\nSecurities in unrealized loss position less than\n12 months Securities in unrealized loss position greater than 12 months Total\nGross Unrealized\nLosses Fair Market\nValue Gross Unrealized\nLosses Fair Market\nValue Gross\nUnrealized\nLosses Fair\nMarket Value\nCorporate bonds $ - $ - $ - $ - $ - $ -\nAsset-backed securities (0.5) 43.9 - - (0.5) 43.9\nU.S. Treasury securities\n- 2.0 - - - 2.0\nU.S. government agency securities\n- - - - - -\nCanadian government obligations and\nCanadian government agency obligations\n- - - - - -\nCommercial mortgage-backed securities - - - 1.5 - 1.5\nCanadian provincial bonds - - - - - -\nOther securities (0.2) 17.1 - - (0.2) 17.1\n$ (0.7) $ 63.0 $ - $ 1.5 $ (0.7) $ 64.5\nAt June 30, 2021, Corporate bonds include investment-grade debt securities, with a wide variety of issuers, industries, and sectors, primarily carry credit ratings of A and above, and have maturities ranging from July 2021 through July 2031.\nAt June 30, 2021, asset-backed securities include AAA-rated senior tranches of securities with predominately prime collateral of fixed-rate auto loan, credit card, equipment lease and rate reduction receivables with fair values of $1,247.4 million, $759.5 million, $263.5 million, and $68.7 million, respectively. These securities are collateralized by the cash flows of the underlying\npools of receivables. The primary risk associated with these securities is the collection risk of the underlying receivables. All collateral on such asset-backed securities has performed as expected through June 30, 2021.\nAt June 30, 2021, U.S. government agency securities primarily include debt directly issued by Federal Farm Credit Banks and Federal Home Loan Banks with fair values of $827.3 million and $536.8 million, respectively. U.S. government agency securities represent senior, unsecured, non-callable debt that primarily carry ratings of Aaa by Moody's and AA+ by Standard & Poor's, with maturities ranging from July 2021 through June 2031.\nAt June 30, 2021, U.S. government agency commercial mortgage-backed securities of $834.6 million include those issued by Federal Home Loan Mortgage Corporation and Federal National Mortgage Association.\nAt June 30, 2021, other securities primarily include municipal bonds, diversified with a variety of issuers, with credit ratings of A and above, with fair values of $569.5 million and AA-rated United Kingdom Gilt securities of $237.5 million.\nClassification of corporate investments on the Consolidated Balance Sheets is as follows:\nJune 30, 2021 2020\nCorporate investments:\nCash and cash equivalents $ 2,575.2 $ 1,908.5\nShort-term marketable securities (a) 10.4 -\nLong-term marketable securities (b) 23.5 13.6\nTotal corporate investments $ 2,609.1 $ 1,922.1\n(a) - Short-term marketable securities are included within Other current assets on the Consolidated Balance Sheets.\n(b) - Long-term marketable securities are included within Other assets on the Consolidated Balance Sheets.\nFunds held for clients represent assets that, based upon the Company's intent, are restricted for use solely for the purposes of satisfying the obligations to remit funds relating to the Company’s payroll and payroll tax filing services, which are classified as client funds obligations on our Consolidated Balance Sheets.\nFunds held for clients have been invested in the following categories:\nJune 30, 2021 2020\nFunds held for clients:\nRestricted cash and cash equivalents held to satisfy client funds obligations $ 10,568.0 $ 5,145.1\nRestricted short-term marketable securities held to satisfy client funds obligations 3,743.3 5,541.2\nRestricted long-term marketable securities held to satisfy client funds obligations 20,594.5 16,021.8\nTotal funds held for clients $ 34,905.8 $ 26,708.1\nClient funds obligations represent the Company's contractual obligations to remit funds to satisfy clients' payroll, tax and other payee payment obligations and are recorded on the Consolidated Balance Sheets at the time that the Company impounds funds from clients. The client funds obligations represent liabilities that will be repaid within one year of the balance sheet date. The Company has reported client funds obligations as a current liability on the Consolidated Balance Sheets totaling $34,403.8 million and $25,831.6 million as of June 30, 2021 and 2020, respectively. The Company has classified funds held for clients as a current asset since these funds are held solely for the purposes of satisfying the client funds obligations. Of the Company’s funds held for clients at June 30, 2021, $31,092.3 million are held in the grantor trust. The liabilities held within the trust are intercompany liabilities to other Company subsidiaries and eliminate in consolidation.\nThe Company has reported the cash flows related to the purchases of corporate and client funds marketable securities and related to the proceeds from the sales and maturities of corporate and client funds marketable securities on a gross basis in the investing section of the Statements of Consolidated Cash Flows. The Company has reported the cash and cash equivalents related to client funds investments with original maturities of ninety days or less, within the beginning and ending balances of cash, cash equivalents, restricted cash, and restricted cash equivalents. The Company has reported the cash flows related to the cash received from and paid on behalf of clients on a net basis within net increase in client funds obligations in the financing activities section of the Statements of Consolidated Cash Flows.\nApproximately 72% of the available-for-sale securities held a AAA-rating or AA-rating at June 30, 2021, as rated by Moody's, Standard & Poor's, DBRS for Canadian dollar-denominated securities, and Fitch for asset-backed and commercial mortgage-backed securities. All available-for-sale securities were rated as investment grade at June 30, 2021.\nExpected maturities of available-for-sale securities at June 30, 2021 are as follows:\nOne year or less $ 3,753.8\nOne year to two years 4,644.3\nTwo years to three years 2,940.3\nThree years to four years 3,393.5\nAfter four years 9,639.8\nTotal available-for-sale securities $ 24,371.7\nNOTE 5. PROPERTY, PLANT AND EQUIPMENT\nProperty, plant and equipment at cost and accumulated depreciation at June 30, 2021 and 2020 are as follows:\nJune 30, 2021 2020\nProperty, plant and equipment:\nLand and buildings $ 686.5 $ 737.2\nData processing equipment 902.0 847.9\nFurniture, leaseholds and other 656.0 643.6\n2,244.5 2,228.7\nLess: accumulated depreciation (1,560.0) (1,524.8)\nProperty, plant and equipment, net $ 684.5 $ 703.9\nDepreciation of property, plant and equipment was $183.3 million, $192.8 million, and $180.6 million for fiscal 2021, 2020 and 2019, respectively.\nThe Company has certain assets classified as held for sale given intent to sell. The fair value of these assets was approximately $29.8 million and $6.7 million as of June 30, 2021and 2020, respectively, and it is not material for reclassification separately on the Consolidated Balance Sheets.\nNOTE 6. LEASES\nThe Company records leases on the Consolidated Balance Sheets as operating lease ROU assets, records the current portion of operating lease liabilities within accrued expenses and other current liabilities and, separately, records long-term operating lease liabilities. The difference between total ROU assets and total lease liabilities are primarily attributable to pre-payments of our obligations and the recognition of various lease incentives.\nThe Company has entered into operating lease agreements for facilities and equipment. The Company's leases have remaining lease terms of up to approximately eleven years.\nThe components of operating lease expense were as follows:\nYear ended\nJune 30,\n2021 2020\nOperating lease cost $ 157.8 $ 163.7\nShort-term lease cost 1.3 6.1\nVariable lease cost 7.6 6.7\nTotal operating lease cost $ 166.7 $ 176.5\nThe following table provides supplemental cash flow information related to the Company's leases:\nYear ended\nJune 30,\n2021 2020\nCash paid for operating lease liabilities $ 142.2 $ 224.7\nOperating lease ROU assets obtained in exchange for new operating lease liabilities $ 120.2 $ 160.4\nOther information related to our operating lease liabilities is as follows:\nJune 30, June 30,\n2021 2020\nWeighted-average remaining lease term (in years) 6 6\nWeighted-average discount rate 2.2 % 2.3 %\nCurrent operating lease liability $ 94.7 $ 95.5\nAs of June 30, 2021, maturities of operating lease liabilities are as follows:\nTwelve months ending June 30, 2022 $ 103.2\nTwelve months ending June 30, 2023 90.4\nTwelve months ending June 30, 2024 70.3\nTwelve months ending June 30, 2025 55.3\nTwelve months ending June 30, 2026 47.2\nThereafter 100.9\nTotal undiscounted lease obligations 467.3\nLess: Imputed interest (29.4)\nNet lease obligations $ 437.9\nNOTE 7. GOODWILL AND INTANGIBLE ASSETS, NET\nChanges in goodwill for the fiscal years ended June 30, 2021 and 2020 are as follows:\nEmployer\nServices PEO\nServices Total\nBalance at June 30, 2019 $ 2,318.2 $ 4.8 $ 2,323.0\nAdditions and other adjustments (2.5) - (2.5)\nCurrency translation adjustments (11.1) - (11.1)\nBalance at June 30, 2020 $ 2,304.6 $ 4.8 $ 2,309.4\nCurrency translation adjustments 29.0 - 29.0\nBalance at June 30, 2021 $ 2,333.6 $ 4.8 $ 2,338.4\nComponents of intangible assets, net, are as follows:\nJune 30, 2021 2020\nIntangible assets:\nSoftware and software licenses $ 2,950.8 $ 2,719.1\nCustomer contracts and lists 1,062.2 1,021.2\nOther intangibles 239.0 239.2\n4,252.0 3,979.5\nLess accumulated amortization:\nSoftware and software licenses (2,090.4) (1,912.0)\nCustomer contracts and lists (723.4) (628.3)\nOther intangibles (228.1) (223.4)\n(3,041.9) (2,763.7)\nIntangible assets, net $ 1,210.1 $ 1,215.8\nOther intangibles consist primarily of purchased rights, purchased content, trademarks and trade names (acquired directly or through acquisitions). All intangible assets have finite lives and, as such, are subject to amortization. The weighted average remaining useful life of the intangible assets is 6 years (6 years for software and software licenses, 4 years for customer contracts and lists, and 3 years for other intangibles). Amortization of intangible assets was $327.4 million, $287.2 million, and $228.4 million for fiscal 2021, 2020, and 2019, respectively.\nEstimated future amortization expenses of the Company's existing intangible assets are as follows:\nAmount\nTwelve months ending June 30, 2022 $ 312.0\nTwelve months ending June 30, 2023 $ 249.6\nTwelve months ending June 30, 2024 $ 200.1\nTwelve months ending June 30, 2025 $ 139.2\nTwelve months ending June 30, 2026 $ 89.4\nNOTE 8. SHORT TERM FINANCING\nThe Company has a $3.75 billion, 364-day credit agreement that matures in June 2022 with a one year term-out option. The Company also has a $2.75 billion five year credit facility that matures in June 2024 that also contains an accordion feature under which the aggregate commitment can be increased by $500 million, subject to the availability of additional commitments. In addition, the Company has a five year $3.2 billion credit facility maturing in June 2026 that contains an accordion feature under which the aggregate commitment can be increased by $500 million, subject to the availability of additional commitments. The interest rate applicable to committed borrowings is tied to LIBOR, the effective federal funds rate, or the prime rate depending on the notification provided by the Company to the syndicated financial institutions prior to borrowing. The Company is also required to pay facility fees on the credit agreements. The primary uses of the credit facilities are to provide liquidity to the commercial paper program and funding for general corporate purposes, if necessary. The Company had no borrowings through June 30, 2021 and 2020 under the credit agreements.\nThe Company's U.S. short-term funding requirements related to client funds are sometimes obtained on an unsecured basis through the issuance of commercial paper, rather than liquidating previously-collected client funds that have already been invested in available-for-sale securities. This commercial paper program provides for the issuance of up to $9.7 billion in aggregate maturity value. The Company’s commercial paper program is rated A-1+ by Standard & Poor’s, Prime-1 (“P-1”) by Moody’s and+ by Fitch. These ratings denote the highest quality commercial paper securities. Maturities of commercial paper can range from overnight to up to 364 days. At June 30, 2021 and June 30, 2020, the Company had no commercial paper borrowing outstanding. Details of the borrowings under the commercial paper program are as follows:\nYears ended June 30, 2021 2020\nAverage daily borrowings (in billions) $ 1.6 $ 2.7\nWeighted average interest rates 0.1 % 1.6 %\nWeighted average maturity (approximately in days) 1 day 2 days\nThe Company’s U.S., Canadian and United Kingdom short-term funding requirements related to client funds obligations are sometimes obtained on a secured basis through the use of reverse repurchase agreements, which are collateralized principally by government and government agency securities, rather than liquidating previously-collected client funds that have already been invested in available-for-sale securities. These agreements generally have terms ranging from overnight to up to five business days. At June 30, 2021 and 2020, there were $23.5 million and $13.6 million, respectively, of outstanding obligations related to the reverse repurchase agreements. Details of the reverse repurchase agreements are as follows:\nYears ended June 30, 2021 2020\nAverage outstanding balances $ 136.7 $ 263.4\nWeighted average interest rates 0.2 % 1.6 %\nNOTE 9. DEBT\nIn fiscal 2021, the Company issued two series of fixed-rate notes with staggered maturities of 7 and 10-years totaling $2.0 billion, and in fiscal 2016 the Company issued fixed rate notes with a 10-year maturity of $1.0 billion, for an aggregate principal amount of $3.0 billion (collectively the “Notes”). The Notes are senior unsecured obligations, and interest is payable in arrears, semi-annually.\nIn August 2020, the Company redeemed $1.0 billion of senior notes bearing a fixed interest rate of 2.25%. In addition, the Company terminated several derivative contracts in place to hedge exposure in changes in benchmark interest rates for the senior notes issued in August 2020 with an aggregate notional amount totaling $1.0 billion (of which $400.0 million were entered into during fiscal year 2020 and $600.0 million were entered into on the day of issuance). Since these derivative contracts were classified as cash flow hedges, the unamortized loss of $43.6 million was deferred in accumulated other comprehensive income (loss) and will be amortized to earnings over the life of the senior notes due in 2030 as the interest payments are made.\nThe principal amounts and associated effective interest rates of the Notes and other debt as of June 30, 2021 and 2020 are as follows:\nDebt instrument Effective Interest Rate June 30, 2021 June 30, 2020\nFixed-rate 2.250% notes due September 15, 2020\n2.37% $ - $ 1,000.0\nFixed-rate 3.375% notes due September 15, 2025\n3.47% 1,000.0 1,000.0\nFixed-rate 1.250% notes due September 1, 2030\n1.83% 1,000.0 -\nFixed-rate 1.700% notes due May 15, 2028\n1.85% 1,000.0 -\nOther 6.9 8.4\n3,006.9 2,008.4\nLess: current portion (a) (1.2) (1,001.8)\nLess: unamortized discount and debt issuance costs (20.7) (3.8)\nTotal long-term debt $ 2,985.0 $ 1,002.8\n(a) - Current portion of long-term debt as of June 30, 2021 is included within Accrued expenses and other current liabilities on the Consolidated Balance Sheets.\nThe effective interest rates for the Notes include the interest on the Notes and amortization of the discount and debt issuance costs.\nAs of June 30, 2021, the fair value of the Notes, based on Level 2 inputs, was $3,060.4 million. For a description of the fair value hierarchy and the Company's fair value methodologies, including the use of an independent third-party pricing service, see Note 1 “Summary of Significant Accounting Policies.”\nNOTE 10. EMPLOYEE BENEFIT PLANS\nA. Stock-based Compensation Plans. Stock-based compensation consists of the following:\n•Stock Options. Stock options are granted to employees at exercise prices equal to the fair market value of the Company's common stock on the dates of grant. Stock options generally vest ratably over 4 years and have a term of 10 years. Compensation expense is measured based on the fair value of the stock option on the grant date and recognized on a straight-line basis over the vesting period. Stock options are generally forfeited if the employee ceases to be employed by the Company prior to vesting. The Company determines the fair value of stock options issued using a binomial option-pricing model. The binomial option-pricing model considers a range of assumptions related to volatility, dividend yield, risk-free interest rate, and employee exercise behavior. Expected volatilities utilized in the binomial option-pricing model are based on a combination of implied market volatilities, historical volatility of the Company's stock price, and other factors. Similarly, the dividend yield is based on historical experience and expected future changes. The risk-free rate is derived from the U.S. Treasury yield curve in effect at the time of grant. The binomial option-pricing model also incorporates exercise and forfeiture assumptions based on an analysis of historical data. The expected life of a stock option grant is derived from the output of the binomial model and represents the period of time that options granted are expected to be outstanding.\n•Restricted Stock.\n•Time-Based Restricted Stock and Time-Based Restricted Stock Units. Time-based restricted stock and time-based restricted stock units generally vest ratably over 3 years. Awards are forfeited if the employee ceases to be employed by the Company prior to vesting.\nTime-based restricted stock cannot be transferred during the vesting period. Compensation expense relating to the issuance of time-based restricted stock is measured based on the fair value of the award on the grant date and recognized on a straight-line basis over the vesting period. Dividends are paid on shares awarded under the time-based restricted stock program.\nTime-based restricted stock units are settled in cash and cannot be transferred during the vesting period. Compensation expense relating to the issuance of time-based restricted stock units is recorded over the vesting period and is initially based on the fair value of the award on the grant date and is subsequently remeasured at each reporting date during the vesting period based on the change in the ADP stock price. No dividend equivalents are paid on units awarded under the time-based restricted stock unit program.\n•Performance-Based Restricted Stock and Performance-Based Restricted Stock Units. Performance-based restricted stock and performance-based restricted stock units generally vest over a one to three year performance period and a subsequent service period of up to 38 months. Under these programs, the Company communicates “target awards” at the beginning of the performance period with possible payouts at the end of the performance period ranging from 0% to 150% of the “target awards.” Awards are generally forfeited if the employee ceases to be employed by the Company prior to vesting.\nPerformance-based restricted stock cannot be transferred during the vesting period. Compensation expense relating to the issuance of performance-based restricted stock is recognized over the vesting period based on the fair value of the award on the grant date with subsequent adjustments to the number of shares awarded during the performance period based on probable and actual performance against targets. After the performance period, if the performance targets are achieved, employees are eligible to receive dividends during the remaining vesting period on shares awarded under the performance-based restricted stock program.\nPerformance-based restricted stock units cannot be transferred and are settled in either cash or stock, depending on the employee's home country. Compensation expense relating to the issuance of performance-based restricted stock units settled in cash is recognized over the vesting period initially based on the fair value of the award on the grant date with subsequent adjustments to the number of units awarded during the performance period based on probable and actual performance against targets. In addition, compensation expense is remeasured at each reporting period during the vesting period based on the change in the ADP stock price. Compensation expense relating to the issuance of performance-based restricted stock units settled in stock is recorded over the vesting period based on the fair value of the award on the grant date with subsequent adjustments to the number of units awarded based on the probable and actual performance against targets. Dividend equivalents are paid on awards under the performance-based restricted stock unit program.\n•Employee Stock Purchase Plan. The Company offers an employee stock purchase plan that allows eligible employees to purchase shares of common stock at a price equal to 95% of the market value for the Company's common stock on the last day of the offering period. This plan has been deemed non-compensatory and, therefore, no compensation expense has been recorded.\nThe Company currently utilizes treasury stock to satisfy stock option exercises, issuances under the Company's employee stock purchase plan, and restricted stock awards. From time to time, the Company may repurchase shares of its common stock under its authorized share repurchase program. The Company repurchased 8.2 million shares in fiscal 2021 as compared to 6.2 million shares repurchased in fiscal 2020. The Company considers several factors in determining when to execute share repurchases, including, among other things, actual and potential acquisition activity, cash balances and cash flows, issuances due to employee benefit plan activity, and market conditions. Cash payments related to the settlement of vested time-based restricted stock units and performance-based restricted stock units were approximately 10.7 million, 34.6 million, and 26.6 million during fiscal years 2021, 2020, and 2019, respectively.\nThe following table represents stock-based compensation expense and related income tax benefits in each of fiscal 2021, 2020, and 2019, respectively:\nYears ended June 30, 2021 2020 2019\nOperating expenses $ 17.9 $ 13.7 $ 16.9\nSelling, general and administrative expenses 133.9 99.1 131.2\nSystem development and programming costs 23.5 18.0 19.2\nTotal pretax stock-based compensation expense $ 175.3 $ 130.8 $ 167.3\nIncome tax benefit $ 43.0 $ 32.2 $ 41.6\nAs of June 30, 2021, the total remaining unrecognized compensation cost related to non-vested stock options, restricted stock units, and restricted stock awards amounted to $19.2 million, $43.5 million, and $113.1 million, respectively, which will be amortized over the weighted-average remaining requisite service periods of 2.2 years, 1.6 years, and 1.8 years, respectively.\nIn fiscal 2021, the following activity occurred under the Company’s existing plans.\nStock Options:\nNumber\nof Options\n(in thousands) Weighted\nAverage Price\n(in dollars)\nOptions outstanding at July 1, 2020 3,510 $ 126\nOptions granted 1,153 $ 139\nOptions exercised (865) $ (102)\nOptions forfeited/cancelled (93) $ (147)\nOptions outstanding at June 30, 2021 3,705 $ 135\nOptions exercisable at June 30, 2021 1,433 $ 117\nShares available for future grants, end of year 22,985\nShares reserved for issuance under stock option plans, end of year 26,690\nTime-Based Restricted Stock and Time-Based Restricted Stock Units:\nNumber of Shares\n(in thousands) Number of Units\n(in thousands)\nRestricted shares/units outstanding at July 1, 2020 905 180\nRestricted shares/units granted 685 105\nRestricted shares/units vested (375) (74)\nRestricted shares/units forfeited (74) (11)\nRestricted shares/units outstanding at June 30, 2021 1,141 200\nPerformance-Based Restricted Stock and Performance-Based Restricted Stock Units:\nNumber of Shares\n(in thousands) Number of Units\n(in thousands)\nRestricted shares/units outstanding at July 1, 2020 179 851\nRestricted shares/units granted 156 177\nRestricted shares/units vested (70) (290)\nRestricted shares/units forfeited (18) (38)\nRestricted shares/units outstanding at June 30, 2021 247 700\nThe aggregate intrinsic value of outstanding stock options and exercisable stock options as of June 30, 2021 was $237.0 million and $116.9 million, respectively, which have a remaining life of 7 years and 6 years, respectively. The aggregate intrinsic value for stock options exercised in fiscal 2021, 2020, and 2019 was $58.6 million, $78.0 million, and $78.2 million, respectively.\nThe fair value for stock options granted was estimated at the date of grant using the following assumptions:\n2021 2020 2019\nRisk-free interest rate 0.1 % 1.4 % 2.7 %\nDividend yield 2.6 % 1.9 % 1.9 %\nWeighted average volatility factor 25.8 % 19.3 % 20.9 %\nWeighted average expected life (in years) 5.4 5.4 5.4\nWeighted average fair value (in dollars) $ 21.66 $ 24.40 $ 26.60\nThe weighted average fair values of shares granted were as follows:\nYear ended June 30, 2021 2020 2019\n(in dollars)\nPerformance-based restricted stock $ 138.53 $ 169.84 $ 146.93\nTime-based restricted stock $ 141.52 $ 167.16 $ 146.80\nB. Pension Plans\nThe Company has a defined benefit cash balance pension plan. The U.S. pension plan, which is currently closed to new entrants, was frozen effective July 1, 2020. As of July 1, 2020 and onward, participants will retain their accrued benefits and will not accrue any future benefits due to pay and/or service. The plan interest credit rate varies from year-to-year based on the ten-year U.S. Treasury rate. The Company's policy is to make contributions within the range determined by generally accepted actuarial principles.\nThe Company also has various retirement plans for its non-U.S. employees and maintains a Supplemental Officers Retirement Plan (“SORP”). The SORP is a defined benefit plan pursuant to which the Company pays supplemental pension benefits to certain corporate officers upon retirement based upon the officers' years of service and compensation. The SORP, which is currently closed to new entrants, was frozen effective July 1, 2019, with no future accruals due to pay and/or service.\nA June 30 measurement date was used in determining the Company's benefit obligations and fair value of plan assets.\nThe Company is required to (a) recognize in its Consolidated Balance Sheets an asset for a plan's net overfunded status or a liability for a plan's net underfunded status, (b) measure a plan's assets and its obligations that determine its funded status as of the end of the employer's fiscal year, and (c) recognize changes in the funded status of a defined benefit plan in the year in which the changes occur in accumulated other comprehensive income (loss).\nThe Company's pension plans' funded status as of June 30, 2021 and 2020 is as follows:\nJune 30, 2021 2020\nChange in plan assets:\nFair value of plan assets at beginning of year $ 1,988.8 $ 1,910.5\nActual return on plan assets 385.2 172.1\nEmployer contributions 10.9 9.8\nCurrency translation adjustments 21.8 (3.5)\nBenefits paid (100.4) (100.1)\nFair value of plan assets at end of year $ 2,306.3 $ 1,988.8\nChange in benefit obligation:\nBenefit obligation at beginning of year $ 2,180.1 $ 1,951.2\nService cost 4.9 59.7\nInterest cost 51.4 61.8\nActuarial loss (11.8) 210.7\nCurrency translation adjustments 25.1 (3.6)\nPlan changes - 0.4\nBenefits paid (100.4) (100.1)\nProjected benefit obligation at end of year $ 2,149.3 $ 2,180.1\nFunded status - plan assets less benefit obligations $ 157.0 $ (191.3)\nThe amounts recognized on the Consolidated Balance Sheets as of June 30, 2021 and 2020 consisted of:\nJune 30, 2021 2020\nNoncurrent assets $ 320.5 $ 19.8\nCurrent liabilities (6.0) (5.4)\nNoncurrent liabilities (157.5) (205.7)\nNet amount recognized $ 157.0 $ (191.3)\nThe accumulated benefit obligation for all defined benefit pension plans was $2,135.0 million and $2,167.5 million at June 30, 2021 and 2020, respectively.\nThe Company's pension plans with accumulated benefit obligations in excess of plan assets as of June 30, 2021 and 2020 had the following projected benefit obligation, accumulated benefit obligation, and fair value of plan assets:\nJune 30, 2021 2020\nProjected benefit obligation $ 182.2 $ 2,046.5\nAccumulated benefit obligation $ 168.3 $ 2,034.4\nFair value of plan assets $ 18.7 $ 1,835.4\nThe components of net pension (income)/ expense were as follows:\n2021 2020 2019\nService cost - benefits earned during the period $ 4.9 $ 59.7 $ 59.8\nInterest cost on projected benefits 51.4 61.8 78.6\nExpected return on plan assets (121.3) (117.9) (131.8)\nNet amortization and deferral 9.3 6.8 0.1\nSpecial termination benefits, plan curtailments, and settlement charges 2.9 (22.0) 48.7\nNet pension (income)/expense $ (52.8) $ (11.6) $ 55.4\nAs a result of the freeze of the U.S. pension plan, described above, the Company recognized $17.0 million of prior service credits during fiscal 2020 within Other (income)/expense, net, which were previously recognized within accumulated other comprehensive income (loss) (see Note 13).\nIn fiscal 2018, the Company offered a Voluntary Early Retirement Program (“VERP”) to certain eligible U.S. based associates aged 55 or above with at least 10 years of service. In fiscal 2019, the Company recorded $48.2 million of non-cash settlement charges and special termination benefits.\nThe net actuarial loss and prior service cost for the defined benefit pension plans that are included in accumulated other comprehensive income (loss) that have not yet been recognized as components of net periodic benefit cost are $145.8 million and $2.5 million, respectively, at June 30, 2021. There is no remaining transition obligation for the defined benefit pension plans included in accumulated other comprehensive income (loss). The estimated net actuarial loss and prior service cost for the defined benefit pension plans that will be amortized from accumulated other comprehensive income (loss) into net periodic pension cost in fiscal 2022 are $6.6 million and $0.3 million, respectively.\nAssumptions used to determine the actuarial present value of benefit obligations were:\nYears ended June 30, 2021 2020\nDiscount rate 2.55 % 2.45 %\nIncrease in compensation levels N/A 4.00 %\nAssumptions used to determine the net pension expense generally were:\nYears ended June 30, 2021 2020 2019\nDiscount rate 2.45 % 3.40 % 4.10 %\nExpected long-term rate of return on assets 6.75 % 6.75 % 6.75 %\nIncrease in compensation levels 4.00 % 4.00 % 4.00 %\nThe discount rate is based upon published rates for high-quality fixed-income investments that produce cash flows that approximate the timing and amount of expected future benefit payments.\nThe expected long-term rate of return on assets is determined based on historical and expected future rates of return on plan assets considering the target asset mix and the long-term investment strategy.\nPlan Assets\nThe Company's pension plans' asset allocations at June 30, 2021 and 2020 by asset category were as follows:\n2021 2020\nCash and cash equivalents 1 % 1 %\nFixed income securities 38 % 44 %\nU.S. equity securities 19 % 17 %\nInternational equity securities 15 % 13 %\nGlobal equity securities 27 % 25 %\n100 % 100 %\nThe Company's pension plans' asset investment strategy is designed to ensure prudent management of assets, consistent with long-term return objectives and the prompt fulfillment of all pension plan obligations. The investment strategy and asset mix were developed in coordination with an asset liability study conducted by external consultants to maximize the funded ratio with the least amount of volatility.\nThe pension plans' assets are currently invested in various asset classes with differing expected rates of return, correlations, and volatilities, including large capitalization and small capitalization U.S. equities, international equities, U.S. fixed income securities, and cash.\nThe target asset allocation ranges for the U.S. plan are generally as follows:\nU.S. fixed income securities 35% - 45%\nU.S. equity securities 14% - 24%\nInternational equity securities 11% - 21%\nGlobal equity securities 20% - 30%\nAs of June 30, 2021 and June 30, 2020, the U.S. pension plan asset allocation is within the target ranges.\nThe pension plans' fixed income portfolio is designed to match the duration and liquidity characteristics of the pension plans' liabilities. In addition, the pension plans invest only in investment-grade debt securities to ensure preservation of capital. The pension plans' equity portfolios are subject to diversification guidelines to reduce the impact of losses in single investments. Investment managers are prohibited from buying or selling commodities and from the. short selling of securities.\nNone of the pension plans' assets are directly invested in the Company's stock, although the pension plans may hold a minimal amount of Company stock to the extent of the Company's participation in equity indices.\nThe pension plans' investments included in Level 1 are valued using closing prices for identical instruments that are traded on active exchanges. The pension plans' investments included in Level 2 are valued utilizing inputs obtained from an independent pricing service, which are reviewed by the Company for reasonableness. To determine the fair value of our Level 2 plan assets, a variety of inputs are utilized, including benchmark yields, reported trades, non-binding broker/dealer quotes, issuer spreads, two-sided markets, benchmark securities, bids, offers, reference data, new issue data, and monthly payment information. The pension plans have no Level 3 investments at June 30, 2021.\nThe following table presents the investments of the pension plans measured at fair value at June 30, 2021:\nLevel 1 Level 2 Level 3 Total\nCommingled trusts $ - $ 1,060.2 $ - $ 1,060.2\nGovernment securities - 426.2 - 426.2\nMutual funds 10.2 345.7 - 355.9\nCorporate and municipal bonds - 417.2 - 417.2\nMortgage-backed security bonds - 38.6 - 38.6\nTotal pension asset investments $ 10.2 $ 2,287.9 $ - $ 2,298.1\nIn addition to the investments in the above table, the pension plans also held cash and cash equivalents of $8.2 million as of June 30, 2021, which have been classified as Level 1 in the fair value hierarchy.\nThe following table presents the investments of the pension plans measured at fair value at June 30, 2020:\nLevel 1 Level 2 Level 3 Total\nCommingled trusts $ - $ 798.6 $ - $ 798.6\nU.S. government securities - 414.7 - 414.7\nMutual funds 7.3 274.8 - 282.1\nCorporate and municipal bonds - 434.8 - 434.8\nMortgage-backed security bonds - 38.5 - 38.5\nTotal pension asset investments $ 7.3 $ 1,961.4 $ - $ 1,968.7\nIn addition to the investments in the above table, the pension plans also held cash and cash equivalents of $20.1 million as of June 30, 2020, which have been classified as Level 1 in the fair value hierarchy.\nContributions\nDuring fiscal 2021, the Company contributed $10.9 million to the pension plans. The Company expects to contribute $10.0 million to the pension plans during fiscal 2022.\nEstimated Future Benefit Payments\nThe benefits expected to be paid in each year from fiscal 2022 to the year ended June 30, 2026 are $120.4 million, $112.9 million, $120.0 million, $111.0 million, and $115.7 million, respectively. The aggregate benefits expected to be paid in the five fiscal years from the year ended June 30, 2027 to the year ended June 30, 2031 are $643.7 million. The expected benefits to be paid are based on the same assumptions used to measure the Company's pension plans' benefit obligations at June 30, 2021 and includes estimated future employee service.\nC. Retirement and Savings Plan. The Company has a 401(k) retirement and savings plan, which allows eligible employees to contribute up to 50% of their compensation annually and allows highly compensated employees to contribute up to 12% of their compensation annually. The Company matches a portion of employee contributions, which amounted to approximately $130.8 million, $112.7 million, and $110.9 million for the calendar years ended December 31, 2020, 2019, and 2018, respectively.\nNOTE 11. INCOME TAXES\nEarnings before income taxes shown below are based on the geographic location to which such earnings are attributable.\nYears ended June 30, 2021 2020 2019\nEarnings before income taxes:\nUnited States $ 3,010.9 $ 2,815.4 $ 2,584.6\nForeign 350.3 367.2 421.0\n$ 3,361.2 $ 3,182.6 $ 3,005.6\nThe provision (benefit) for income taxes consists of the following components:\nYears ended June 30, 2021 2020 2019\nCurrent:\nFederal $ 749.3 $ 468.3 $ 464.3\nForeign 121.9 119.5 129.1\nState 142.6 102.3 110.1\nTotal current 1,013.8 690.1 703.5\nDeferred:\nFederal (182.6) 23.7 7.9\nForeign (19.1) (5.4) 12.8\nState (49.4) 7.7 (11.4)\nTotal deferred (251.1) 26.0 9.3\nTotal provision for income taxes $ 762.7 $ 716.1 $ 712.8\nA reconciliation between the Company's effective tax rate and the U.S. federal statutory rate is as follows:\nYears ended June 30, 2021 % 2020 % 2019 %\nProvision for taxes at U.S. statutory rate $ 705.9 21.0 $ 668.4 21.0 $ 631.2 21.0\nIncrease/(decrease) in provision from:\nState taxes, net of federal tax benefit 67.2 2.0 85.6 2.7 80.7 2.7\nValuation allowance release on foreign tax credits - - (20.3) (0.6) - -\nForeign rate differential 34.0 1.0 44.9 1.4 46.9 1.6\nExcess tax benefit - Stock-based compensation (8.8) (0.2) (26.9) (0.8) (29.8) (1.0)\nOther (35.6) (1.1) (35.6) (1.2) (16.2) (0.6)\n$ 762.7 22.7 $ 716.1 22.5 $ 712.8 23.7\nThe effective tax rate in fiscal 2021 and 2020 was 22.7% and 22.5%, respectively. The increase in the effective tax rate is primarily due to combined benefits from a valuation allowance release related to foreign tax credit carryforwards and a foreign tax law change during fiscal 2020 as well as a decrease in the excess tax benefit on stock-based compensation, partially offset by favorable adjustments to prior year tax liabilities during fiscal 2021.\nThe effective tax rate for fiscal 2020 and 2019 was 22.5% and 23.7%, respectively. The decrease in the effective tax rate is primarily due to the release of a valuation allowance related to foreign tax credit carryforwards, a reduction in the operating tax rate due to the mix between domestic and foreign earnings, the benefit of a foreign tax law change and lower reserves for uncertain tax positions during fiscal 2020 partially offset by favorable adjustments to prior year tax liabilities during fiscal 2019.\nThe significant components of deferred income tax assets and liabilities and their balance sheet classifications are as follows:\nYears ended June 30, 2021 2020\nDeferred tax assets:\nAccrued expenses not currently deductible $ 244.2 $ 203.0\nStock-based compensation expense 38.4 33.8\nForeign tax credits 21.3 20.1\nNet operating losses 46.3 52.0\nRetirement benefits - 46.0\nOther 34.7 25.9\n384.9 380.8\nLess: valuation allowances (13.4) (12.0)\nDeferred tax assets, net $ 371.5 $ 368.8\nDeferred tax liabilities:\nDeferred revenue $ 494.5 $ 475.0\nFixed and intangible assets 119.4 288.2\nPrepaid expenses 27.9 82.3\nPrepaid retirement benefits 37.7 -\nUnrealized investment gains, net 101.7 187.9\nTax on unrepatriated earnings 11.4 22.2\nOther 13.6 6.4\nDeferred tax liabilities 806.2 1,062.0\nNet deferred tax liabilities $ 434.7 $ 693.2\nThere are $48.3 million and $38.8 million of long-term deferred tax assets included in other assets on the Consolidated Balance Sheets at June 30, 2021 and 2020, respectively.\nIncome taxes have not been provided on undistributed earnings of certain foreign subsidiaries in an aggregate amount of approximately $291.1 million as the Company considers such earnings to be permanently reinvested outside of the United States. As of June 30, 2021, it is not practicable to estimate the unrecognized tax liability that would occur upon distribution.\nThe Company has estimated foreign net operating loss carry-forwards of approximately $61.8 million as of June 30, 2021, of which $1.1 million expire through June 2031 and $60.7 million have an indefinite utilization period. As of June 30, 2021, the Company has approximately $31.3 million of federal net operating loss carry-forwards from acquired companies. The net operating losses have an annual utilization limitation pursuant to section 382 of the Internal Revenue Code and expire through June 2036.\nThe Company has state net operating loss carry-forwards of approximately $348.7 million as of June 30, 2021, which expire through June 2040. The Company has recorded valuation allowances of $13.4 million and $12.0 million at June 30, 2021 and 2020, respectively, to reflect the estimated amount of domestic and foreign deferred tax assets that may not be realized.\nIncome tax payments were approximately $973.7 million, $677.1 million, and $633.8 million for fiscal 2021, 2020, and 2019, respectively.\nAs of June 30, 2021, 2020, and 2019 the Company's liabilities for unrecognized tax benefits, which include interest and penalties, were $99.9 million, $62.3 million, and $54.2 million respectively. The amount that, if recognized, would impact the effective tax rate is $68.5 million, $49.9 million, and $43.3 million, respectively. The remainder, if recognized, would principally impact deferred taxes.\nA reconciliation of the beginning and ending amounts of unrecognized tax benefits is as follows:\n2021 2020 2019\nUnrecognized tax benefits at beginning of the year $ 62.3 $ 54.2 $ 45.2\nAdditions for tax positions 18.8 13.2 9.5\nAdditions for tax positions of prior periods 32.5 6.3 18.3\nReductions for tax positions of prior periods (11.0) (4.3) (7.7)\nSettlement with tax authorities (1.3) (4.0) (10.3)\nExpiration of the statute of limitations (1.5) (2.8) (0.6)\nImpact of foreign exchange rate fluctuations 0.1 (0.3) (0.2)\nUnrecognized tax benefit at end of year $ 99.9 $ 62.3 $ 54.2\nInterest expense and penalties associated with uncertain tax positions have been recorded in the provision for income taxes on the Statements of Consolidated Earnings. During the fiscal years 2021, 2020, and 2019, the Company recorded interest expense of $10.8 million, $1.6 million, and $1.9 million, respectively. During fiscal year 2021, the Company recorded penalties of $0.3 million, penalties recorded during fiscal years 2020, and 2019 were not significant.\nAt June 30, 2021, the Company had accrued interest of $19.2 million recorded on the Consolidated Balance Sheets, of which $3.9 million was recorded within income taxes payable, and the remainder was recorded within other liabilities. At June 30, 2020, the Company had accrued interest of $8.8 million recorded on the Consolidated Balance Sheets, of which $1.0 million was recorded within income taxes payable, and the remainder was recorded within other liabilities. At June 30, 2021, the Company’s accrued penalties of $0.3 million was recorded on the Consolidated Balance Sheets within income taxes payable. At June 30, 2020, the Company's accrued penalties recorded on the Consolidated Balance Sheets within other liabilities were not material.\nThe Company is routinely examined by the IRS and tax authorities in foreign countries in which it conducts business, as well as tax authorities in states in which it has significant business operations. The tax years currently under examination vary by jurisdiction. Examinations in progress in which the Company has significant business operations are as follows:\nTaxing Jurisdiction Fiscal Years under Examination\nIllinois 2017 - 2018\nMassachusetts 2013 - 2014, 2016 - 2018\nTexas 2016 - 2018\nMichigan 2012 - 2018\nNew York State 2016 - 2018\nNew York City 2016 - 2017\nIndia 2004 - 2011, 2013 - 2018\nThe Company regularly considers the likelihood of assessments resulting from examinations in each of the jurisdictions. The resolution of tax matters is not expected to have a material effect on the consolidated financial condition of the Company, although a resolution could have a material impact on the Company's Statements of Consolidated Earnings for a particular future period and on the Company's effective tax rate.\nIf certain pending tax matters settle within the next twelve months, the total amount of unrecognized tax benefits may increase or decrease for all open tax years and jurisdictions. Based on current estimates, settlements related to various jurisdictions and tax periods could increase earnings up to $3 million and expected cash payments could be up to $15 million in the next twelve months. The liability related to cash payments expected to be paid within the next 12 months has been reclassified from other liabilities to current liabilities on the Consolidated Balance Sheets. Audit outcomes and the timing of audit settlements are subject to significant uncertainty. We continually assess the likelihood and amount of potential adjustments and adjust the income tax provision, the current tax liability and deferred taxes in the period in which the facts that give rise to a revision become known.\nNOTE 12. COMMITMENTS AND CONTINGENCIES\nAs of June 30, 2021, the Company has purchase commitments of approximately $658.6 million, including a reinsurance premium with Chubb for the fiscal 2022 policy year, as well as obligations related to software license agreements and purchase and maintenance agreements on our software, equipment, and other assets, of which $448.5 million relates to fiscal 2022, $184.8 million relates to the fiscal year ending June 30, 2023, and the remaining relates to fiscal years ending June 30, 2024 through fiscal 2026.\nIn June 2018, a potential class action complaint was filed against the Company in the Circuit Court of Cook County, Illinois asserting that ADP violated the Illinois Biometric Privacy Act in connection with its collection, use and storage of biometric data of employees of its clients who are residents of Illinois. In addition, similar potential class action complaints have been filed in Illinois state courts against ADP and/or certain of its clients with respect to the collection, use and storage of biometric data of the employees of these clients. In June 2020, the Company reached a settlement of all outstanding claims against ADP for $25.0 million, In February 2021, the court granted final approval of the $25.0 million settlement. The Company does not expect that any of the remaining cases against ADP's clients will result in any material liabilities to the Company. In June 2021, the Company received a $15 million insurance recovery related to this litigation.\nIn May 2020, two potential class action complaints were filed against ADP, TotalSource and related defendants in the U.S. District Court, District of New Jersey. The complaints assert violations of the Employee Retirement Income Security Act of 1974 (“ERISA”) in connection with the ADP TotalSource Retirement Savings Plan’s fiduciary administrative and investment decision-making. The complaints seek statutory and other unspecified monetary damages, injunctive relief and attorney’s fees. These claims are still in their earliest stages and the Company is unable to estimate any reasonably possible loss, or range of loss, with respect to these matters. The Company intends to vigorously defend against these lawsuits.\nThe Company is subject to various claims, litigation, and regulatory compliance matters in the normal course of business. When a loss is considered probable and reasonably estimable, the Company records a liability in the amount of its best estimate for the ultimate loss. Management currently believes that the resolution of these claims, litigation and regulatory compliance matters against us, individually or in the aggregate, will not have a material adverse impact on our consolidated results of operations, financial condition or cash flows. These matters are subject to inherent uncertainties and management's view of these matters may change in the future.\nIt is not the Company’s business practice to enter into off-balance sheet arrangements. In the normal course of business, the Company may enter into contracts in which it makes representations and warranties that relate to the performance of the Company’s services and products. The Company does not expect any material losses related to such representations and warranties.\nNOTE 13. RECLASSIFICATION OUT OF ACCUMULATED OTHER COMPREHENSIVE INCOME (\"AOCI\")\nComprehensive income is a measure of income that includes both net earnings and other comprehensive income (loss). Other comprehensive income (loss) results from items deferred on the Consolidated Balance Sheets in stockholders' equity. Other comprehensive income (loss) was $25.4 million, $242.5 million, and $422.5 million in fiscal 2021, 2020, and 2019, respectively. Changes in Accumulated Other Comprehensive Income (“AOCI”) by component are as follows:\nCurrency Translation Adjustment Net Gains on Available-for-sale Securities Cash Flow Hedging Activities Pension Liability Accumulated Other Comprehensive (Loss) /Income\nBalance at June 30, 2018 $ (227.0) $ (274.0) $ - $ (178.8) $ (679.8)\nOther comprehensive income/(loss) before reclassification adjustments (42.2) 642.4 - (84.7) 515.5\nTax effect - (144.4) - 20.0 (124.4)\nReclassification adjustments to net earnings - 0.9 (A) - 40.3 (B) 41.2\nTax effect - (0.3) - (9.5) (9.8)\nBalance at June 30, 2019 $ (269.2) $ 224.6 $ - $ (212.7) $ (257.3)\nOther comprehensive income/(loss) before reclassification adjustments (53.0) 602.2 (40.3) (160.8) 348.1\nTax effect - (136.4) 10.0 39.5 (86.9)\nReclassification adjustments to net earnings - (12.9) (A) - (11.8) (B) (24.7)\nTax effect - 2.9 - 3.1 6.0\nBalance at June 30, 2020 $ (322.2) $ 680.4 $ (30.3) $ (342.7) $ (14.8)\nOther comprehensive income/(loss) before reclassification adjustments 95.4 (363.3) (3.3) 281.5 10.3\nTax effect - 82.6 0.8 (69.0) 14.4\nReclassification adjustments to net earnings - (11.3) (A) 3.8 (C) 9.3 (B) 1.8\nTax effect - 2.5 (0.9) (2.7) (1.1)\nBalance at June 30, 2021 $ (226.8) $ 390.9 $ (29.9) $ (123.6) $ 10.6\n(A) Reclassification adjustments out of AOCI are included within Other (income)/expense, net, on the Statements of Consolidated Earnings.\n(B) Reclassification adjustments out of AOCI are included in net pension (income)/expense (see Note 10). In fiscal 2020, reclassification includes $17.0 million of prior service credits which were recognized as a component of net pension (income)/expense as a result of the U.S. pension plan freeze.\n(C) Reclassification adjustments out of AOCI are included in Interest expense on the Statements of Consolidated Earnings (see Note 9).\nNOTE 14. FINANCIAL DATA BY SEGMENT AND GEOGRAPHIC AREA\nBased upon similar economic and operational characteristics, the Company’s strategic business units have been aggregated into the following two reportable segments: Employer Services and PEO Services. The primary components of the “Other” segment are certain corporate overhead charges and expenses that have not been allocated to the reportable segments, including corporate functions, costs related to our transformation office, legal settlements, severance costs, non-recurring gains and losses, the elimination of intercompany transactions, and interest expense. Certain revenues and expenses are charged to the reportable segments at a standard rate for management reasons. Other costs are recorded based on management responsibility. The Company made changes to the allocation methodology for certain corporate allocations, in both the current period and the prior period in the table below, which did not materially affect reportable segment results.\nEmployer Services PEO Services Other Total\nYear ended June 30, 2021\nRevenues $ 10,195.2 $ 4,818.3 $ (8.1) $ 15,005.4\nEarnings before income taxes 3,052.1 718.8 (409.7) 3,361.2\nAssets 50,279.3 1,543.4 (3,050.2) 48,772.5\nCapital expenditures 116.7 - 61.6 178.3\nDepreciation and amortization 421.7 7.4 81.6 510.7\nYear ended June 30, 2020\nRevenues $ 10,086.6 $ 4,511.5 $ (8.3) $ 14,589.8\nEarnings before income taxes 3,058.2 609.3 (484.9) 3,182.6\nAssets 37,071.7 1,443.2 650.6 39,165.5\nCapital expenditures 115.7 - 52.6 168.3\nDepreciation and amortization 388.0 3.4 88.6 480.0\nYear ended June 30, 2019\nRevenues $ 9,942.8 $ 4,177.7 $ (10.3) $ 14,110.2\nEarnings before income taxes 2,954.2 613.3 (561.9) 3,005.6\nAssets 34,606.3 1,584.1 5,697.3 41,887.7\nCapital expenditures 98.2 - 64.5 162.7\nDepreciation and amortization 321.0 3.5 84.5 409.0\nUnited States Europe Canada Other Total\nYear ended June 30, 2021\nRevenues $ 13,081.7 $ 1,307.9 $ 337.3 $ 278.5 $ 15,005.4\nAssets $ 42,137.1 $ 2,425.1 $ 3,360.5 $ 849.8 $ 48,772.5\nYear ended June 30, 2020\nRevenues $ 12,740.1 $ 1,236.3 $ 329.8 $ 283.6 $ 14,589.8\nAssets $ 33,891.0 $ 2,162.7 $ 2,435.3 $ 676.5 $ 39,165.5\nYear ended June 30, 2019\nRevenues $ 12,262.6 $ 1,236.8 $ 326.6 $ 284.2 $ 14,110.2\nAssets $ 36,508.3 $ 2,807.9 $ 1,950.5 $ 621.0 $ 41,887.7",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A. Controls and Procedures\nAttached as Exhibits 31.1 and 31.2 to this Annual Report on Form 10-K are certifications of ADP's Chief Executive Officer and Chief Financial Officer, which are required by Rule 13a-14(a) of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). This “Controls and Procedures” section should be read in conjunction with the report of Deloitte & Touche LLP that appears in this Annual Report on Form 10-K and is hereby incorporated herein by reference.\nManagement's Evaluation of Disclosure Controls and Procedures\nThe Company carried out an evaluation (the “evaluation”), under the supervision and with the participation of the Company's management, including its Chief Executive Officer and Chief Financial Officer, of the effectiveness of the Company's disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by the Company in the reports that it files or submits under the Exchange Act is accumulated and communicated to the Company's management, including its Chief Executive Officer and Chief Financial Officer, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure. Based on the evaluation, the Company's Chief Executive Officer and Chief Financial Officer have concluded that the Company's disclosure controls and procedures were effective as of June 30, 2021 in ensuring that (i) information required to be disclosed by the Company in reports that it files or submits under the Exchange Act is accumulated and communicated to the Company's management, including its Chief Executive Officer and Chief Financial Officer, to allow timely decisions regarding required disclosure and (ii) such information is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission's rules and forms.\nManagement's Report on Internal Control over Financial Reporting\nIt is the responsibility of Automatic Data Processing, Inc.'s (“ADP”) management to establish and maintain effective internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act). Internal control over financial reporting is designed to provide reasonable assurance to ADP's management and board of directors regarding the preparation of reliable financial statements for external purposes in accordance with generally accepted accounting principles.\nADP's internal control over financial reporting includes those policies and procedures that: (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of ADP; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of ADP are being made only in accordance with authorizations of management and directors of ADP; and (iii) provide reasonable assurance regarding the prevention or timely detection of unauthorized acquisition, use or disposition of ADP's assets that could have a material effect on the financial statements of ADP.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\nManagement has performed an assessment of the effectiveness of ADP’s internal control over financial reporting as of June 30, 2021 based upon criteria set forth in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this assessment, management determined that ADP’s internal control over financial reporting was effective as of June 30, 2021.\nDeloitte & Touche LLP, the independent registered public accounting firm that audited and reported on the consolidated financial statements of ADP included in this Annual Report on Form 10-K, has issued an attestation report on the operating effectiveness of ADP's internal control over financial reporting. The Deloitte & Touche LLP attestation report is set forth below.\n/s/ Carlos A. Rodriguez\nCarlos A. Rodriguez\nPresident and Chief Executive Officer\n/s/ Kathleen A. Winters\nKathleen A. Winters\nChief Financial Officer\nRoseland, New Jersey\nAugust 4, 2021\nChanges in Internal Control over Financial Reporting\nThere were no changes in ADP's internal control over financial reporting that occurred during the quarter ended June 30, 2021 that have materially affected, or are reasonably likely to materially affect, ADP's internal control over financial reporting.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of\nAutomatic Data Processing, Inc.\nRoseland, New Jersey\nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of Automatic Data Processing, Inc. and subsidiaries (the “Company”) as of June 30, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of June 30, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by COSO.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended June 30, 2021, of the Company and our report dated August 4, 2021, expressed an unqualified opinion on those financial statements and included an explanatory paragraph regarding the Company’s adoption of a new accounting standard.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management's Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Deloitte & Touche LLP\nParsippany, New Jersey\nAugust 4, 2021",
    "item_9B": "Item 9B. Other Information\nNone.\nPart III",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nThe executive officers of the Company, their ages, positions, and the period during which they have been employed by ADP are as follows:\nEmployed by\nName Age Position ADP Since\nBrock Albinson 46 Corporate Controller and Principal Accounting Officer 2007\nJohn Ayala 54 President, Employer Services North America 2002\nMaria Black 47 President, Worldwide Sales and Marketing 1996\nMichael A. Bonarti 55 Chief Administrative Officer 1997\nLaura Brown 49 President, Major Account Services and ADP Canada 2000\nChris D'Ambrosio 40 Chief Strategy Officer 2014\nJoe DeSilva 46 President, Small Business Services, Retirement Services and 2003\nInsurance Services\nDeborah L. Dyson 55 President, National Accounts Services 1988\nMichael C. Eberhard 59 Vice President and Treasurer 1998\nSreeni Kutam 51 Chief Human Resources Officer 2014\nDavid Kwon 51 Chief Legal Officer/General Counsel 2011\nDon McGuire 61 President, Employer Services International 1998\nBrian Michaud 53 President, Smart Compliance Solutions 1991\nAlex Quevedo 49 President, Human Resource Outsourcing 1997\nCarlos A. Rodriguez 57 President and Chief Executive Officer 1999\nStuart Sackman 60 Corporate Vice President, Global Shared Services 1992\nDonald Weinstein 52 Corporate Vice President, Global Product and Technology 2006\nKathleen A. Winters 53 Chief Financial Officer 2019\nBrock Albinson joined ADP in 2007. Prior to his appointment as Corporate Controller and Principal Accounting Officer in March 2015, he served as Assistant Corporate Controller from December 2011 to February 2015, as Vice President, Corporate Finance from January 2011 to December 2011, and as Vice President, Financial Policy from March 2007 to January 2011.\nJohn Ayala joined ADP in 2002. Prior to his appointment as President, Employer Services North America, he served as President, Major Account Services and ADP Canada from January 2017 to February 2020, as President, Small Business Services, Retirement Services and Insurance Services from July 2014 to December 2016, as Vice President, Client Experience and Continuous Improvement from November 2012 to June 2014, as Senior Vice President, Services and Operations - Small Business Services from February 2012 to October 2012, as President, TotalSource from July 2011 to January 2012, and as Senior Vice President, Service and Operations, TotalSource from June 2008 to June 2011.\nMaria Black joined ADP in 1996. Prior to her appointment as President, Worldwide Sales and Marketing, she served as President, Small Business Solutions and Human Resources Outsourcing from January 2017 to February 2020, as President, ADP TotalSource from July 2014 to December 2016, as General Manager, ADP United Kingdom from April 2013 to June 2014, and as General Manager, Employer Services - TotalSource Western Central Region from January 2008 to March 2013.\nMichael A. Bonarti joined ADP in 1997. Prior to his appointment as Chief Administrative Officer in July 2021, he served as Corporate Vice President, General Counsel and Secretary from July 2010 to June 2021.\nLaura Brown joined ADP in 2000. Prior to her appointment as President, Major Account Services and ADP Canada in March 2020, she served as Senior Vice President/General Manager, Next Gen Human Capital Management from March 2019 to March 2020, as Senior Division Vice President, Major Account Services from September 2016 to March 2019, and Division Vice President/General Manager, Small Business Services from April 2014 to August 2016.\nChris D’Ambrosio joined ADP in 2014. Prior to his appointment as Chief Strategy Officer in June 2021, he served as Senior Vice President, General Manager, Insurance Services, Small Business Services from January 2019 to June 2021, and as Senior Division Vice President of Strategy and Business Development, Small Business Services and Human Resources Outsourcing from December 2017 to January 2019, as Division Vice President of Strategy and Business Development, Human Resources Outsourcing from February 2017 to December 2017, and Division Vice President of Strategy, Human Resources Outsourcing from March 2016 to February 2017.\nJoe DeSilva joined ADP in 2003. Prior to his appointment as President, Small Business Services, Retirement Services and Insurance Services in February 2020, he served as Senior Vice President, Services & Operations, Small Business Services from May 2017 to February 2020, as Senior Vice President/General Manager, Retirement Services from June 2015 to May 2017, and as Senior Vice President, Sales, Retirement Services from May 2013 to June 2015.\nDeborah L. Dyson joined ADP in 1988. Prior to her appointment as President, National Accounts Services in August 2017, she served as Corporate Vice President, Client Experience and Continuous Improvement from July 2014 to June 2018, as Division Vice President / General Manager, Employer Services - Major Account Services South Service Center from July 2012 to June 2014, and as Division Vice President / General Manager, Employer Services - Major Account Services Northwest Service Center from July 2006 to June 2012.\nMichael C. Eberhard joined ADP in 1998. He has served as Vice President and Treasurer since November 2009.\nSreeni Kutam joined ADP in 2014. Prior to his appointment as Chief Human Resources Officer in June 2018, he served as Interim Chief Human Resources Officer from January 2018 to June 2018, as Division Vice President, Human Resources, Major Account Services from May 2016 to January 2018, and as Vice President, HR Strategy and Planning from January 2014 to April 2016. Prior to joining ADP, he was an HR consultant.\nDavid Kwon joined ADP in 2011. Prior to his appointment as Corporate Vice President, Chief Legal Officer/General Counsel in July 2021, he served as Staff Vice President and Associate General Counsel - Global Compliance from March 2019 to June 2021, and as Staff Vice President and Associate General Counsel - Litigation from July 2012 to March 2019.\nDon McGuire joined ADP in 1998. Prior to his appointment as President, Employer Services International in June 2018, he served as President, Global Enterprise Solutions EMEA/Streamline from July 2016 to June 2018, as Senior Vice President, General Manager, Asia Pacific Region from December 2012 to June 2016, and as General Manager, ADP United Kingdom/Ireland from September 2007 to December 2012.\nBrian Michaud joined ADP in 1991. Prior to his appointment as President, Smart Compliance Solutions in July 2021, he served as President, Human Resources Outsourcing from February 2020 to June 2021, as Senior Vice President, TotalSource from August 2016 to February 2020, as Senior Vice President, Client Services from June 2015 to August 2016, and as General Manager, Northeast from September 2011 to June 2015.\nAlex Quevedo joined ADP in 1997. Prior to his appointment as President, Human Resources Outsourcing in July 2021, he served as Senior Vice President, Human Resources Outsourcing Sales from September 2018 to June 2021, as Senior Vice President/General Manager, Insurance Services from December 2015 to August 2018, and as Division Vice President, Insurance Services Sales from December 2011 to December 2015.\nCarlos A. Rodriguez joined ADP in 1999. Prior to his appointment in November 2011 to President and Chief Executive Officer, he served as President and Chief Operating Officer from May 2011 to November 2011, and as President, Employer Services International - National Account Services, ADP Canada, and GlobalView and Employer Services International, from March 2010 to May 2011.\nStuart Sackman joined ADP in 1992. Prior to his appointment as Corporate Vice President, Global Shared Services in July 2018, he served as Corporate Vice President, Global Product and Technology from March 2015 to June 2018, as Corporate Vice President and General Manager of Multinational Corporations Services from June 2012 to February 2015, and as Division Vice President and General Manager of the National Account Services’ East National Service Center from February 2008 to May 2012.\nDonald Weinstein joined ADP in 2006. Prior to his appointment as Corporate Vice President, Global Product and Technology in July 2018, he served as Chief Strategy Officer from December 2015 to June 2018, as Senior Vice President,\nProduct Management from October 2010 to November 2015, and as Division Vice President, Strategy & Marketing from September 2007 to September 2010.\nKathleen A. Winters joined ADP in April 2019 as Chief Financial Officer. Prior to joining ADP, she was Chief Financial Officer and Treasurer of MSCI Inc. from May 2016 to March 2019. Prior to joining MSCI Inc., she served in various positions of increasing responsibility at Honeywell International, Inc. from 2002 to 2016, most recently as Vice President and Chief Financial Officer of the Performance Materials and Technologies operating segment.\nDirectors\nSee “Election of Directors” in the Proxy Statement for the Company’s 2021 Annual Meeting of Stockholders, which information is incorporated herein by reference.\nCode of Ethics\nADP has adopted a code of ethics that applies to its principal executive officer, principal financial officer, principal accounting officer and persons performing similar functions. The code of ethics may be viewed online on ADP’s website at www.adp.com under “Investor Relations” in the “Corporate Governance” section. Any amendment to or waivers from the code of ethics will be disclosed on our website within four business days following the date of the amendment or waiver.\nAudit Committee; Audit Committee Financial Expert\nSee “Corporate Governance - Committees of the Board of Directors” and “Audit Committee Report” in the Proxy Statement for the Company’s 2021 Annual Meeting of Stockholders, which information is incorporated herein by reference.",
    "item_11": "Item 11. Executive Compensation\nSee “Corporate Governance,” “Compensation Discussion and Analysis,” “Compensation Committee Report,” “Compensation of Executive Officers” and “Compensation of Non-Employee Directors” in the Proxy Statement for the Company’s 2021 Annual Meeting of Stockholders, which information is incorporated herein by reference.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nSee “Security Ownership of Certain Beneficial Owners and Management” and “Equity Compensation Plan Information” in the Proxy Statement for the Company’s 2021 Annual Meeting of Stockholders, which information is incorporated herein by reference.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nSee “Election of Directors” and “Corporate Governance” in the Proxy Statement for the Company’s 2021 Annual Meeting of Stockholders, which information is incorporated herein by reference.",
    "item_14": "Item 14. Principal Accounting Fees and Services\nSee “Independent Registered Public Accounting Firm's Fees” in the Proxy Statement for the Company's 2021 Annual Meeting of Stockholders, which information is incorporated herein by reference.\nPart IV\n1.",
    "item_15": ""
}