{
    "cik": "922521",
    "company": "FALCONSTOR SOFTWARE INC",
    "filing_type": "10-K",
    "filing_date": "2021-03-10",
    "period_of_report": "2020-12-31",
    "sic": "7372",
    "state_of_inc": "DE",
    "state_location": "NY",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/922521/0001628280-21-004460-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/922521/000162828021004460/falc-20201231.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/922521/0001628280-21-004460.txt",
    "filename": "922521_10K_2020_0001628280-21-004460.htm",
    "item_1": "Item 1. Business\nOVERVIEW\nFalconStor is a data protection leader that enables enterprises to modernize their data backup and archival operations across sites and public clouds, delivering increased data security and providing fast recovery from a ransomware attack while driving down costs by up to 90 percent. A proven technology leader with 47 patents and patent applications, FalconStor has over an exabyte of data under management and is trusted by more than 600 enterprise customers and an ecosystem of managed service providers and resellers worldwide.\nOur products are utilized by enterprises and managed service providers across the globe and address two key areas of enterprise data protection; long-term data retention and recovery, and business continuity driven data replication. Our innovative integration with modern cloud-based data storage environments, such as AWS and Microsoft Azure, enables our customers to significantly reduce costs, and improve the portability, security, and accessibility of their enterprise data. This accessibility is key in our modern world, where data is not only protected, but also intelligently leveraged to facilitate learning, improve product design, and drive competitive advantage. Our products are software-defined, which means that our technology allows our solutions to be hardware, cloud, and source-data agnostic, giving our customers maximum leverage of existing hardware and software investments.\nThe enterprise data protection segments in which we focus our attention are critical to the data protection plans of any enterprise. First, the absolute foundation of any enterprise data protection plan is based on long-term data archive, as this segment represents up to 80% of an enterprise’s data according to a 2019 Horizon Information Strategies study. Whether in the form of application databases, documents, emails, or digital media files, an enterprise is mandated to preserve these information assets for lengthy periods of time to fulfill operational, legal, and regulatory requirements. In fact, expanding government and industry regulations continue to increase mandated retention periods, which now exceed one hundred years in certain cases. In addition, beyond fundamental data retention, modern enterprises desire to leverage their long-term archives for strategic analysis and to unlock new revenue streams. As a result, enterprises are challenged with securely and cost effectively managing this data, while also adopting flexible and scalable cloud-based storage environments. Our long-term data retention products enable our customers to reduce their data storage footprint by up to 95% and seamlessly transition data to a wide-array of hybrid-cloud and public-cloud storage, including AWS and Microsoft Azure.\nSecond, in addition to their long-term data archive foundation, an enterprise must maintain operational data redundancy for specific data assets to ensure near real-time business continuity. Our data replication products and associated technologies allow an enterprise to capture snapshots of selected data or entire systems at user-defined intervals and include the ability to replicate data continuously as it is written or modified in real-time. These solutions allow our enterprise customers to recover data back to a specific millisecond in time to completely recover from operational data loss or corruption, including ransomware. As with our long-term data retention products, our business continuity driven data replication products are designed to leverage existing enterprise hardware and software investments, while seamlessly enabling the use of new cloud-based data storage technologies.\nOur products are available and supported worldwide by a network of leading service providers, systems integrators, resellers, managed services providers, and OEMs.\nINDUSTRY BACKGROUND\nEnterprises of all sizes are increasingly challenged to securely archive, replicate, and make available their data assets. Their challenge is increased as business pressures to reduce cost and increase efficiency push the enterprise to adopt cloud-based technologies, which are critical to handling the growth in data and strategic uses of enterprise data.\nLong-term data archive is the fastest-growing segment of an enterprise’s data assets. This growth is accelerating as enterprises are increasingly subject to complex regulatory compliance, such as that driven by the Food and Drug Administration (FDA), the Health Insurance Portability and Accountability Act (HIPAA), European Union’s General Data Protection Regulation (GDPR), and the Sarbanes-Oxley Act. As the volume of long-term archive continues to expand, the need for enterprises to securely and cost-effectively store the associated data will only increase.\nTraditionally, enterprises have stored their long-term archives within physical tape libraries or on disc-based storage connected directly to internal servers. However, new distributed storage technologies, and hybrid and public cloud-based\nenvironments, such as AWS and Microsoft Azure, have created additional cost-effective and scalable options for archive storage. Movement to the cloud can be inhibited by many factors, but dealing with the complexity of the legacy environment, and the costs of data storage in the cloud are two areas where we provide differentiated capability built over many years of customer engagement and innovation. We believe for larger enterprise clients that this represents a significant portion of the available market.\nThe introduction of new long-term archive storage options has also given rise to a growth in managed service providers (MSPs) remotely managing data protection, primarily to smaller enterprises with a less complex array of data assets. The MSPs are able to leverage modern broadband connectivity and offer more scalable long-term storage options, which will serve to reduce data protection costs for their customers. We believe this trend to outsourced long-term archive data protection will continue.\nOUR SOFTWARE PRODUCTS AND SUPPORTING TECHNOLOGY\nFalconStor’s software products create investment protection, flexibility, and leverage of modern cloud-based technologies, through software-defined functionality that provides backup and long-term retention, and business continuity driven data replication. As a result, our enterprise clients are able to utilize the underlying storage hardware, media, or environment (on-premise or cloud) that best aligns with their strategic needs. Our customers utilize our products to protect data residing in physical, virtual, private-cloud, public-cloud, and multi-cloud environments, and give our them the freedom to optimize their data protection infrastructure and eliminate costly hardware-vendor, cloud, and form-factor lock-in.\nLong-Term Data Retention and Recovery Products\nFalconStor Virtual Tape Library (“VTL”) - FalconStor was an early innovator in Virtual Tape Library (“VTL”) technology, which allows enterprise customers to emulate and replace cumbersome legacy physical tape libraries for archive related data preservation, without being forced to replace their enterprise backup and archive software and associated processes.\nOur VTL product continues to be a leading virtual tape library solution, and we believe it is unmatched in terms of performance and scalability. With VTL, our enterprise customers are able to complete their data archive operations more reliably, with minimal change needed to the legacy archive environment. They are also able to leverage sophisticated physical tape emulation, advanced data security, data-deduplication, and public- or private-cloud based virtual tape archive storage, which are all now seamlessly integrated into our solution. We are dedicated to providing our enterprise customers with the highest performing VTL product in the industry. As such, we subject our VTL solution to independent performance testing, which has demonstrated that our product is 25% faster than the closest competitor and can be executed on hardware that is 1/3 the cost of that required by our closest competitor.\nBeyond allowing our customers to benefit from sheer data archive speed, we also enable them to dramatically reduce the amount of data that needs to be archived, by processing their archive data through our integrated data deduplication engine. By eliminating redundant archive data, the archive storage capacity required can be reduced by as much as 95%. Our technology allows our enterprise customers to significantly reduce the cost of storing the ever-growing volume of data subject to long-term archive data protection mandates.\nFalconStor StorSafeTM (“StorSafe”) - Traditionally, enterprises have had limited choice and have been forced to store their archive data on physical tape or within storage arrays installed in an internal data center. Our newest and most innovative long-term archive data management software product, StorSafe, breaks these traditional storage limitations and enables enterprises to securely and cost effectively leverage a wide array of storage options, including ultra efficient and scalable cloud-based storage environments, such as AWS and Azure.\nLaunched in 2020, StorSafe, like our proven VTL solution, provides sophisticated physical tape emulation and seamless integration with an enterprise’s legacy backup and archive software and processes. In addition, StorSafe includes our advanced data deduplication technology. However, StorSafe takes long-term archive storage optimization to an entirely new and innovative level. By leveraging patent pending industry-standard Container technology to enable persistent long-term archive storage, our StorSafe solution dramatically improves archive data portability, accessibility, security, and integrity validation, especially as it relates to multi-cloud data storage leverage. As a result, a full spectrum of archive data storage options is made available to our enterprise customers to efficiently utilize essentially any storage environment, while confidently ensuring data security and efficient archive access.\nWe have designed StorSafe to significantly reduce long-term archive data storage and legal or regulatory mandated compliance costs and redefine long-term archive storage optimization and accessibility for the next decade.\nBusiness Continuity Driven Data Replication Products\nThe FalconStor StorGuardTM (“StorGuard”) Suite includes the functionality of the following point solutions.\nFalconStor Continuous Data Protector (“CDP”)\nIn addition to retaining long-term archive data, enterprises routinely maintain short-term copies, or backups, of data generated by various user applications, to protect against data loss or natural disaster. FalconStor CDP technology reinvents the way data replication and recovery are implemented and performed. Moving beyond once-a-day backup models, CDP combines local and remote protection into a cost-effective, unified, disk-based solution that allows organizations to recover data back to the most recent transaction. Combining application-aware snapshot agents and continuous journaling functions, CDP enables customers to recover data effectively at any point in time. CDP delivers instant data availability and reliable recovery, bringing business applications back online in a matter of minutes after a failure. CDP protects application-specific data for Microsoft, Oracle, SAP, and other business applications, ensuring high performance and stability for even the most complex business environments.\nFalconStor Network Storage Server (“NSS”)\nThe ever expanding capacity of data managed by enterprises creates a continual challenge in ensuring the organization has an adequate amount of available storage. FalconStor NSS is a scalable, highly available solution that enables data storage virtualization and business continuity in heterogeneous environments. Supporting existing third-party disk arrays, NSS eliminates storage boundaries and vendor lock-in, providing fast and secure data storage provisioning and migration. From a small iSCSI virtual server lab to an enterprise-class Fiber Channel SAN running Tier-1 database applications, NSS is designed to meet the data storage needs of any enterprise.\nMoving data between different data storage platforms can be complex, complicated, time-consuming, and disruptive to business operations. Our core storage virtualization technology provides a non-disruptive approach to data mobility across different SAN protocols and vendors. With NSS, it becomes a simple operation to move data from older platforms to newer ones or to introduce new storage capacity and tiers. This allows enterprises to respond to evolving performance and capacity requirements, as well as changing data protection mandates.\nOur products are sold as stand-alone software, but can also be bundled with standard hardware configurations to simplify implementation for our customers.\nSupporting Technology\nOur core long-term archive and business continuity driven products are complemented by a set of underlying technologies that streamline usability and overall solution performance.\nFalconStor StorSightTM (“StorSight”)\nStorSight gives our enterprise customers and MSPs the ability to administer long-term archive and business continuity driven data replication from one centralized management point and to easily test additional FalconStor products they may not be currently licensing. Prior to Q4 2019, our products were managed through two different user consoles; a Java-based console for VTL, and a modern HTML-based console (branded initially as FreeStorTM) for CDP and NSS. To simplify our development efforts and to enable broader use of our products by our enterprise customers, we have unified all user management into our modern HTML-based console and rebranded that unified tool as StorSight. As a result, StorSight is now our unified data protection console used to administer our VTL, StorSafe, CDP, and NSS products.\nOur StorSight user console provides deep analytics relative to each FalconStor product as they are utilized in production. StorSight also includes a full array of functionality key to our MSP customers, such as multi-tenancy and charge-back.\nStorSight usage licensing is included when customers and MSPs license any FalconStor product.\nFalconStor RecoverTracTM (“RecoverTrac”) Disaster Recovery Technology\nOur patented RecoverTrac technology streamlines the implementation, testing, and execution of disaster recovery operations. It minimizes service failover time between sites and reduces disaster recovery costs by offering full recovery from physical-to-physical, virtual-to-virtual, and physical-to-virtual server infrastructures. This technology is a disaster recovery automation service, and is included as a standard feature of the FalconStor NSS and the FalconStor CDP products to automate complex, time-consuming, and error-prone failover and failback operations of systems, applications, services, and entire data centers. This technology can also work across those environments, enabling organizations to seamlessly migrate locally, remotely, or to and from cloud environments.\nFalconStor MicroScanTM (“MicroScan”) Technology\nThe patented FalconStor MicroScan technology minimizes the amount of data transferred during replication by eliminating inefficiencies at the application and file system layer. Data changes are replicated at the smallest possible level of granularity, reducing LAN/WAN bandwidth and associated storage costs for disaster recovery (DR), and any time data is replicated from one source to another. Typical storage array-based solutions replicate changes track-by-track. This means that even when the smallest possible data change is made (512 bytes or one disk sector), the file system will write 8K of data, and the array will send the entire track (typically 32KB in size) or four times more than the file system change. In contrast, if MicroScan scans 8K of “new” data and concludes that only 512 bytes (1 disk sector) have truly changed. Only the 512-byte change is sent over the LAN/WAN network, making it 64 times more efficient than sending the full track. As a result, for every one terabyte needing to be sent over the network, FalconStor CDP or FalconStor NSS only needs to send 16 gigabytes. MicroScan is an integral part of the FalconStor replication option for CDP and NSS.\nBUSINESS STRATEGY\nFalconStor‘s products and supporting technologies serve enterprise IT organizations and managed service providers worldwide and are guided by the following strategies.\nProvide a Bridge to Cloud-Based Data Storage, While Protecting Investments\nAs enterprise IT organizations look to modernize their long-term archive and business continuity related data replication, they are challenged by the cost, risk, and disruption upgrades and migrations can cause. Because FalconStor abstracts the data protection services from the physical storage infrastructure, additional capabilities can be added to legacy hardware, eliminating the need and cost to replace that hardware. This delivers discrete value in terms of lowering capital and operational costs, reduced risk and disruption, and significantly faster time to deployment. For IT organizations wishing to deploy new hardware or storage paradigms, including the utilization of private- or public-cloud based storage, such as AWS or Azure, our products enable the migration and on-going optimization of data storage to and on those new platforms, versus being forced to start with a new or “greenfield” deployment required by many of the latest hardware vendors. FalconStor offers these organizations a path forward with an approach that minimizes or eliminates risk and disruption to business processes and workflows while lowering both capital and operational costs.\nFalconStor intends to continue leveraging the protocol-independent, full featured, unified architecture, analytics, and robust open data services technology of its products to maintain a leadership position in the enterprise storage software market. With the addition of StorSafe, and its associated storage container technology, FalconStor has joined and is dedicated to the Open Source community, which has accelerated development and integration efforts across our entire product suite. FalconStor plans to continue its leadership in this market by delivering technical innovation that creates investment protection, flexibility, and leverage of modern cloud-based technologies for our enterprise customers.\nEnable Managed Service Providers\nAs the managed service provider segment continues to grow, they increasingly have a need to support heterogeneous storage environments across their own data centers and their customer’s environments. Further, MSPs often have different hardware and software capabilities, making it significantly challenging to offer consistent data services across these environments. We believe FalconStor offers several strategic benefits for MSPs:\n•Enables the seamless and non-disruptive movement of data from the customer premise to the service provider’s hosted environment;\n•Offers common data services across customer’s environments regardless of underlying hardware or technology;\n•Allows for the introduction and ability to monetize additional data services they may not have previously been able to offer;\n•Provides a low-cost growth opportunity due to the flexibility of StorSight licensing, while eliminating the need to have multiple feature licenses array by array;\n•Enables reduced storage management complexity and costs within their infrastructure by eliminating silos, reducing licensing costs and optimizing hardware;\n•Optimizes storage hardware based on price/performance needs of customers; and\n•Provides analytics for necessary real-time and historical information to achieve SLA's and make economic decisions.\nExpand Software and Hardware Strategic Alliances with Industry Leaders\nThe Flash/SSD, High-Density Shingle Disk, and Cloud Data Archival markets should be key opportunities for us on two fronts: targeting customers wanting to integrate new Flash/SSD, High-Density Shingle Disk, Cloud Data Archival technology into existing IT environments, and OEMs needing to enhance their software stack in order to offer data movement and protection services on their platform. Cloud Service Providers (CSPs) such as AWS, Azure, Wasabi, and Aliyun also represent a growth opportunity. Our mutual customers and partners need help moving data from the customer site to their own facilities as well as a way to deliver common data services across disparate and often incompatible hardware typically found across the provider and end customer environments. We believe FalconStor is positioned to continue to take advantage of these key opportunities in the global marketplace. Our strategic relationships with Hitachi Data Systems, Hitachi Vantara, Fujitsu, DSI, and others should fuel growth across all three major geographies.\nExpanded Existing Product Offerings\nWe will continue to enhance our products to address the ever-changing market dynamics to ensure that FalconStor can be a leader in the data protection marketplace.\nStorSafe is the newest innovation from FalconStor. It leverages the latest industry-standard software container technology that utilizes virtualization at the application layer versus the systems layer. This powerful differentiator allows StorSafe, the first enterprise-class, persistent storage container, to disaggregate data storage from the system-level components. With FalconStor's successful adaptation of transient container technology, it delivers a persistent, long-term data protection container that is agnostic, heterogeneous, and highly portable, as well as backward compatible and compatible with future technology advancements. It also delivers the capability to seamlessly operate across data centers, and public, private, hybrid, and multi-cloud data storage environment(s). Leveraging the power of container technologies has also allowed the development of robust active and passive features and functionality that are necessary to meet integrity, validation, and journal-based auditing. These advancements are essential to meet the chain of custody mandates that are inherent in long-term data retention plans subject to compliance, regulatory, legal discovery, and privacy laws that continue to evolve and mature.\nMarket Approach\nFalconStor continues to focus on enterprise customers, managed service providers, cloud service providers, as well as OEM partners. These markets offer the most significant opportunity and are best suited to realize the value of FalconStor products, and provide an efficient and effective access to broad, worldwide markets.\nGrowth Drivers\nNew regulations and laws governing the processing, storage, retention, protection, and reinstatement of high-value information assets are driving double-digit growth in the data protection markets. Additionally, we believe that data archives will play an increasing role in training and validating AI and Machine Learning algorithms and optimizing strategic analytic model outcomes. Given FalconStor's long history and deep skillset of the unique challenges associated with long-term storage, we feel we are in an excellent position to capitalize on data assets that are subject to new protection requirements with our existing product portfolio. Our innovative StorSafe product is designed and architected to leverage the scale-up and scale-out capabilities found in today's public and private clouds to support the expanding long-term data protection market demand that is estimated to grow into the Zettabyte (10^21) range by 2030 (IDC). In addition, we believe our innovative integration of long-term archive storage into modern cloud-based technologies will enable our customers to dramatically improve the portability, security, and accessibility of their enterprise data. We believe, this accessibility will be key in our modern world, where data is not only protected, but also intelligently leveraged to facilitate learning, improve product design, and drive competitive advantage.\nSALES ROUTES TO MARKET\nFalconStor continues to sell products through:\n•Authorized partners, value-added resellers (VARs), solution providers, and large system integrators\n•Direct Market Resellers (DMRs) and Distributors\n•Managed Service Providers (MSPs) and Cloud Service Providers (CSPs)\n•Original Equipment Manufacturers (OEMs)\nProfessional Services\nFalconStor’s Professional Services personnel are also available to assist customers and partners throughout the lifecycle of FalconStor product deployments. The Professional Services team includes experienced Storage Architects (expert field engineers) who can assist in the assessment, planning/design, implementation, and test phases of the deployment project, and a Technical Support Group for post-deployment assistance and ongoing support.\nMARKETING\nWe focus our efforts to increase awareness and demand for FalconStor products by targeting our efforts at our extensive global installed base and the expanding awareness in the emerging long-term data protection market.\nPRODUCT LICENSING\nHistorically, the majority of our software licenses have been sold on a per terabyte capacity basis and have included a perpetual right to use the licensed capacity. We now also offered our capacity-based licenses on a subscription or term-based model, which gives a customer the right to utilize the licensed terabyte capacity over a designated period of time. We expect revenue from subscription-based per terabyte licensing to increase over the next several years.\nCOMPETITION\nLong-Term Data Retention and Recovery\nWe believe our VTL and StorSafe products are positioned well in the marketplace. Given the fact that these products are designed to integrate with an enterprise’s legacy backup and archive software and processes, the level of competition we typically face is limited to DellEMC’s Data Domain virtual tape library product.\nOne could argue that we also compete with legacy backup and archive vendors such as Veritas, and Commvault; however, in practice, our products are more complimentary to their solutions than competitive, as our solutions do not require their solutions to be retired or replaced. In fact, our enterprise customers view the ability to maintain their legacy software solutions and processes as a key differentiator for selecting FalconStor, as it is common for them to use backup and archive products from multiple vendors. By inserting our VTL or StorSafe product, they are able to aggregate all of their archive data easily and control global data deduplication and archive storage from one central point.\nWe believe our enterprise customers also view the fact that our VTL and StorSafe products operate effectively with Windows, Linux, and IBM i operating system (OS) environments as a key differentiator. As a result, we execute specific go-to-market efforts to identify enterprise customers that have multiple OS environments in production.\nBeyond the differentiation our VTL and StorSafe products provide related to existing infrastructure integration, we also believe the innovations we are delivering to improve backup and long-term retention dramatically, will serve as important competitive differentiators for FalconStor over the next several years. This belief is founded on the fact that our new innovations are designed to significantly improve archive data portability, security, and integrity validation. In addition, our new innovations are designed to allow our enterprise customers to seamlessly leverage multiple private- or public-clouds at one time to significantly reduce archive data storage costs.\nBusiness Continuity Driven Data Replication\nCompetition within the business continuity driven data replication space is significant and includes products from Veeam, Rubrik, Cohesity, Commvault, Veritas, DellEMC, DataCore, and others. As a result, it is imperative that we carefully select the areas in which we will compete to ensure they are aligned with our key product differentiations. Accordingly, our two areas of\nfocus within this space are on-premise storage virtualization and granular application-aware data replication snapshots that enable our enterprise customers to recover data back to a specific millisecond in time for near real-time recovery time objectives (RTO).\nINTELLECTUAL PROPERTY\nFalconStor’s success is dependent in part upon its proprietary technology. We currently have forth seven patents and pending patent applications. The Company has multiple registered trademarks - including “FalconStor Software”, “StorSight”, “StorSafe”, and “Intelligent Abstraction” - as well as pending trademark applications related to FalconStor and its products.\nFalconStor seeks to protect its proprietary rights and other intellectual property through a combination of copyright, patents, trademark, and trade secret protection, as well as through contractual protections such as proprietary information agreements and nondisclosure agreements. The technological and creative skills of its personnel, new product developments, frequent product enhancements, and reliable product maintenance are essential to establishing and maintaining a technology leadership.\nFalconStor generally enters into confidentiality or license agreements with employees, consultants, and corporate partners and generally controls access to and distribution of its software, documentation, and other proprietary information. Despite the Company’s efforts to protect its proprietary rights, unauthorized parties may attempt to copy or otherwise obtain and use FalconStor’s products or technology. Monitoring unauthorized use of FalconStor’s products is difficult, and there can be no assurance that the steps FalconStor has taken will prevent misappropriation of its technology, particularly in foreign countries where laws may not protect its proprietary rights as fully as do the laws of the United States.\nMAJOR CUSTOMERS\nFor the year ended December 31, 2020, we had two customers that accounted for 10% or more of total revenue. For the year ended December 31, 2019, we had two customers that accounted for 10% or more of total revenue.\nAs of December 31, 2020 and 2019, we had one customer who accounted for more than 10% of our gross accounts receivable balance, respectively.\nEMPLOYEES\nAs of December 31, 2020, we had 44 full-time and part-time employees, consisting of 16 in research & development, 8 in sales & marketing, 15 in service, and 5 in general and administrative. We are not subject to any collective bargaining agreements and we believe that our employee relations are good.\nINTERNET ADDRESS AND AVAILABILITY OF FILINGS\nOur internet address is www.falconstor.com. The Company makes available free of charge, on or through its Internet website, the Company’s Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, current Reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Sections 13(a) or (15)(d) of the Securities Exchange Act of 1934, as amended, as soon as reasonably practicable after the Company electronically files such material with, or furnishes it to, the Securities and Exchange Commission. The Company complied with this policy for every Exchange Act (the \"Exchange Act\"), report filed during the year ended December 31, 2020.\nRECENT DEVELOPMENTS\nGiven the commercial uncertainty caused by the novel coronavirus pandemic, or COVID-19, the Company developed and implemented an even more aggressive expense control plan in March 2020, that it kept in place for the remainder of 2020. This plan reduced the Company's annual cash expense run rate by $4.0 million or 29%. The Company has furloughed 21 positions worldwide, and 20 of these positions were reinstated by the fourth quarter of 2020. We believe the reduced expense level should enable FalconStor to remain profitable during 2021, even with a prolonged impact of COVID-19 well into 2021.",
    "item_1A": "Item 1A. Risk Factors\nWe are affected by risks specific to us as well as factors that affect all businesses operating in a global market. The significant factors known to us that could materially adversely affect our business, financial condition, or operating results are set forth below.\nRisks Related to Our Financial Condition\nWe have had limited liquidity as evidenced by our working capital deficiency of $4.5 million at December 31, 2020 and our future prospects are dependent on our ability to execute our business plan of which there can be no assurance.\nWhile we had net income for the year ended December 31, 2020, we have incurred operating losses in ten of the previous eleven years and negative cash flow from operations in eight of the previous eleven years.\nAs of December 31, 2020, we had a working capital deficiency of $4.5 million, which is inclusive of current deferred revenue of $4.6 million, and a stockholders' deficit of $14.6 million. Our cash and cash equivalents at December 31, 2020 was $1.9 million, an increase of $0.4 million compared to December 31, 2019 and such amount at December 31, 2020 includes net proceeds that we received from our previously announced Amendment, which provided for the 2019 Term Loan.\nThe holders of our outstanding Series A redeemable convertible preferred stock (the “Series A Preferred Stock”), the majority of which is held by Hale Capital Partners and affiliated entities (\"HCP\"), have a mandatory redemption right as of July 30, 2021 which as of December 31, 2020 would require the payment of approximately $12.9 million if the mandatory redemption right is exercised in full. In addition, as of December 31, 2020 we have outstanding indebtedness of approximately $3.5 million which matures on June 30,2021 pursuant to the terms of our Amended and Restated Term Loan Credit Agreement, dated as of February 23,2018, as amended December 27,2019 by and among FalconStor Software, Inc., HCP-FVA, LLC, EW Capital, LLC, the lenders party thereto and the other loan parties named therein (the “Amended and Restated Loan Agreement”).\nIf the holders of the Series A Preferred Stock elect to exercise their rights to require the Company to redeem the Series A Preferred Stock on or prior to July 30, 2021 or we are unable to satisfy our obligations under our Amended and Restated Term Loan Credit Agreement, we will be unable to meet our operating cash needs. The Company intends to renegotiate with HCP, if necessary, and extend the maturity dates of the loan balances and the redemption date of the Series A Preferred Stock to at least April 1, 2022. The Company believes its current cash balances together with anticipated cash flows from operating activities, and its plans to extend the maturity of its borrowings and preferred stock will be sufficient to meet its working capital requirements for at least one year from the date the consolidated financial statements were available to be issued.\nThere is no assurance that we will be successful in receiving extensions of the maturity date of the Amended and Restated Loan Agreement and the mandatory redemption date of the Series A Preferred Stock or executing our business plan either through generating sufficient revenue or continuing to reduce operating costs. The failure to receive the extensions or otherwise execute our business plan would have a material adverse effect on our results of operations and or our ability to continue operations. In addition, to the extent that we continue to incur losses or want to expand our operations, we may need to seek additional financing. There can be no assurance that we will be able to obtain additional financing. Moreover, it is likely that the terms of the Amended and Restated Loan Agreement and Series A Preferred Stock will make it more difficult for us to obtain additional financing and any additional financing could be dilutive to our stockholders.\nOur revenues decreased in 2020 compared to 2019. There is no guarantee that we will be able or to maintain, profitability.\nDespite generating $1.1 million in GAAP Net Income for the fiscal year ended December 31, 2020, our revenues decreased to $14.8 million for the year ended December 31, 2020, as compared with $16.5 million for the year ended December 31, 2019. If we are unable to stabilize or increase revenue, we will be unable to maintain profitability, we will deplete our available cash and we may not be able to continue to fund effective sales and marketing or research and development activities on which we are dependent.\nWe have undertaken a restructuring and other cost reduction initiatives to reduce our expenses and to better align our expenses with our business. There can be no assurance that we have made enough reductions or the right reductions.\nFor the past several years, we have taken several actions to reduce expenses significantly in an attempt to help return the Company to profitability. These actions include a reduction in personnel; closing offices in geographic locations where our expenses have continued to outpace our revenue; and reducing other expenditures. To date, the reduction in expenses has not\nbeen sufficient to ensure that the Company can meet its ongoing cash needs for the foreseeable future. In addition, there can be no assurance that the reductions we have made are the right reductions for our business going forward. There is a risk that the restructuring, cost cutting initiatives and reduction in personnel will continue to make it more difficult to grow the business and service our customers.\nIf actual results or events differ materially from our estimates and assumptions, our reported financial condition and results of operations for future periods could be materially affected.\nThe preparation of consolidated financial statements and related disclosure in accordance with generally accepted accounting principles requires management to establish policies that contain estimates and assumptions that affect the amounts reported in the consolidated financial statements and the accompanying notes. Note 1 to the Consolidated Financial Statements in our Annual Report on Form 10-K for the fiscal year ended December 31, 2020 describes the significant accounting policies and estimates essential to preparing our financial statements. The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenue and expenses, and related disclosures. We base our estimates on historical experience and assumptions that we believe to be reasonable under the circumstances. Actual future results may differ materially from these estimates. We evaluate, on an ongoing basis, our estimates and assumptions.\nRisks Related to Our Business\nOur future business, financial and operating results are substantially dependent on the market acceptance of our products.\nWe have spent considerable resources, both financially and in our research and development efforts, developing VTL, StorSafe, CDP, and NSS. We currently do not have any other products in our pipeline with the same expectations that we had or which we believe have the same potential for market acceptance as VTL, StorSafe, CDP, and NSS. If (i) either VTL, StorSafe, CDP, and NSS do not gain additional market acceptance, (ii) sales of either VTL, StorSafe, CDP, and NSS do not increase, or (iii) the ongoing future feature/functionality sets of both products are delayed, our results may suffer and it could have a material adverse effect on our business, financial condition and operating results.\nThe effects of the COVID-19 pandemic have materially affected and will continue to materially affect how we and our customers are operating our businesses, and the duration and extent to which this will impact our future results of operations and overall financial performance remains uncertain.\nAs a result of the COVID-19 pandemic, we temporarily closed our office locations, introduced remote working for many of our employees that remains in effect, and implemented certain travel restrictions, all of which has caused disruptions to how we operate our business. Our operations have been negatively affected by a range of external factors related to the COVID-19 pandemic that are not within our control. Many of our customers are non-essential businesses within the meaning of applicable regulations that have been forced, in some jurisdictions, to temporarily suspend or greatly reduce operations resulting in a lay off or termination of workers, which has a direct impact on our revenue, as this results in a decrease in overall payroll spend by our customers. Additionally, we have shifted certain of our customer events to virtual-only experiences and we may deem it advisable to similarly alter, postpone or cancel entirely additional customer, employee or industry events in the future. The conditions caused by the COVID-19 pandemic have affected and may continue to affect the rate of IT spending and our customer's ability or willingness to attend our events or to purchase our offerings, our prospective customers' purchasing decisions, our ability to provide on-site consulting services to our customers and the provisioning of our offerings, and may lengthen payment terms, reduce the value or duration of our contracts, or affect attrition rates, all of which has and may continue to adversely affect our future sales, operating results and overall financial information.\nThe loss of any of our key personnel could harm our business.\nOur success depends upon the continued contributions of our key employees, many of whom would be extremely difficult to replace. We do not have key person life insurance on any of our personnel. Worldwide competition for skilled employees in the network storage software industry is extremely intense. In particular, our success is dependent on our executive management team, including Todd Brooks, our Chief Executive Officer. If we are unable to retain existing employees or hire and integrate new employees, our business, financial condition and operating results could suffer.\nDue to the uncertain and shifting development of the data protection and network storage software markets and our reliance on our partners, we may have difficulty accurately predicting revenue for future periods and appropriately budgeting for expenses.\nThe rapidly evolving nature of the data protection and network storage software markets in which we sell our products, the degrees of effort and success of our partners’ sales and marketing efforts, and other factors that are beyond our control, reduce our ability to accurately forecast our quarterly and annual revenue. However, we must use our forecasted revenue to establish our expense budget. Most of our expenses are fixed in the short term or incurred in advance of anticipated revenue. As a result, we may not be able to decrease our expenses in a timely manner to offset any shortfall in revenue.\nIf we are unable to develop new products that achieve acceptance in the data protection and the network storage software markets, our operating results may suffer.\nThe data protection and the network storage software markets continue to evolve and as a result there is continuing demand for new products. Accordingly, we may need to develop new products that address additional data protection or network storage software market segments and emerging technologies to remain competitive in the data storage software industry. We are uncertain whether we will successfully qualify new data protection or network storage software products with our customers by meeting customer performance and quality specifications. Any failure to address additional market segments could harm our business, financial condition and operating results.\nOur products must conform to industry standards in order to be accepted by customers in our markets.\nOur current products are only one part of a storage system. All components of these systems must comply with the same industry standards in order to operate together efficiently. We depend on companies that provide other components of these systems to conform to industry standards. Some industry standards may not be widely adopted or implemented uniformly, and competing standards may emerge that may be preferred by OEM customers or end users. If other providers of components do not support the same industry standards as we do, or if competing standards emerge, our products may not achieve market acceptance, which would adversely affect our business.\nOur products handle mission-critical data for our end-customers and are highly technical in nature. If our products have defects, failures occur or end-customer data is lost or corrupted, our reputation and business could be harmed.\nOur products are highly technical and complex and are involved in storing and replicating mission-critical data for our end-customers. Our products may contain undetected defects and failures when they are first introduced or as new versions are released. We have in the past and may in the future discover software errors in new versions of our existing products, new products or product enhancements after their release or introduction, which could result in lost revenue. Despite testing by us and by current and potential end-customers, errors might not be found in new releases or products until after commencement of commercial shipments, resulting in loss of or delay in market acceptance. Our products may have security vulnerabilities and be subject to intentional attacks by viruses that seek to take advantage of these bugs, errors or other weaknesses. If defects or failures occur in our products, a number of negative effects in our business could result, including:\n•lost revenue or lost end-customers;\n•increased costs, including warranty expense and costs associated with end-customer support;\n•delays, cancellations, reductions or rescheduling of orders or shipments;\n•product returns or discounts;\n•diversion of management resources;\n•legal claims for breach of contract, product liability, tort or breach of warranty; and\n•damage to our reputation and brand.\nBecause our end-customers use our products to manage and protect their data, we could face claims resulting from any loss or corruption of our end-customers’ data due to a product defect. While our sales contracts contain provisions relating to warranty disclaimers and liability limitations, these provisions might not be upheld. Defending a lawsuit, regardless of its merit, is costly and may divert management’s attention from our business and could result in public perception that our products are not effective, even if the occurrence is unrelated to the use of our products. In addition, our business liability insurance coverage might not be adequate to cover such claims. If any data is lost or corrupted in connection with the use or support of our products, our reputation could be harmed and market acceptance of our products could suffer.\nWe rely on our resellers and our OEM partners for most of our sales.\nThe vast majority of our sales come from sales to end users of our products by our resellers and by our OEM partners. These resellers and OEM partners have limited resources and sales forces and sell many different products, both in the data protection and the network storage software markets and in other markets. The resellers and OEM partners may choose to focus their sales efforts on other products in the data protection and the network storage software markets or other markets. The OEM\npartners might also choose not to continue to develop or to market products which include our products. This would likely result in lower revenue to us and would impede our ability to grow our business.\nThe failure of our resellers to sell our products effectively could have a material adverse effect on our revenue and results of operations.\nWe rely significantly on our value-added resellers, direct market resellers, systems integrators and corporate resellers, which we collectively refer to as resellers, for the marketing and distribution of our software products and our services. However, our agreements with resellers are generally not exclusive, are generally renewable annually and in many cases may be terminated by either party without cause. Many of our resellers carry products that are competitive with ours. These resellers may give a higher priority to other products, including those of our competitors, or may not continue to carry our products at all. If a number of resellers were to discontinue or reduce the sales of our products, or were to promote our competitors’ products in lieu of ours, it would have a material adverse effect on our future revenue. Events or occurrences of this nature could seriously harm our sales and results of operations. In addition, we expect that a significant portion of our sales growth will depend upon our ability to identify and attract new reseller partners. The use of resellers is an integral part of our distribution network. We believe that our competitors also use reseller arrangements. Our competitors may be more successful in attracting reseller partners and could enter into exclusive relationships with resellers that make it difficult to expand our reseller network. Any failure on our part to expand our network of resellers could impair our ability to grow revenue in the future.\nOur growth depends in part on the success of our strategic relationships with third parties.\nOur future growth will depend on our ability to enter into successful strategic relationships with third parties. For example, our strategic relationships with DSI, Fujitsu, Hitachi Data Systems, are intended to enhance their software stack in order to offer data movement and protection services on their platform. In addition, we work with global distributors to streamline and grow our sales channel. These relationships may not result in additional customers or enable us to generate significant revenue. These relationships are typically non-exclusive and do not prohibit the other party from working with our competitors or from offering competing services. If we are unsuccessful in establishing or maintaining our relationships with these third parties, our ability to compete in the marketplace or to grow our revenue could be impaired and our operating results could suffer.\nWe rely on channel partners to sell our solutions, and disruptions to, or our failure to develop and manage our channel partners would harm our business.\nOur future success is partially dependent upon establishing and maintaining successful relationships with the right channel partners. A majority of our revenue is generated by sales through our channel partners, and we expect channel sales to continue to make up the majority of our total revenue in the future. Accordingly, our revenue is largely dependent on the effective sales and lead generation activities of these channel partners.\nRecruiting and retaining qualified channel partners and training them in our technology and product offerings requires significant time and resources. In order to develop and expand our distribution channel, we must continue to scale and improve our processes and procedures that support our channel, including investment in systems and training. Those processes and procedures may become increasingly complex and difficult to manage as we grow our organization. We have no minimum purchase commitments from any of our channel partners, and our contracts with these channel partners do not prohibit them from offering products or services that compete with ours. Our competitors may provide incentives to existing and potential channel partners to favor their products or to prevent or reduce sales of our solutions. Our channel partners may choose not to offer our solutions exclusively or at all. Establishing relationships with channel partners who have a history of selling our competitors’ products may also prove to be difficult. In addition, some of our channel partners are also competitors. Our failure to establish and maintain successful relationships with channel partners would harm our business and operating results.\nWe face intense competition in our market, especially from larger, well-established companies, and we may lack sufficient financial or other resources to maintain or improve our competitive position.\nA number of very large corporations have historically dominated the data management market. We consider our primary competitors to be companies that provide enterprise storage products, including Dell Inc., Hitachi Data Systems, Hewlett-Packard Company, IBM, CommVault, DataCore and Nexenta. We also compete to a lesser extent with a number of other private companies and certain other well-established companies. Some of our competitors have made acquisitions of businesses that allow them to offer more directly competitive and comprehensive solutions than they had previously offered. In addition, the emergence of cloud computing and software-defined-storage may impact both short-term and long-term growth patterns in\nthe markets in which we compete. We expect to encounter new competitors domestically and internationally as other companies enter our market or if we enter new markets.\nMany of our existing competitors have, and some of our potential competitors could have, substantial competitive advantages such as:\n•potential for broader market acceptance of their storage architectures and solutions;\n•greater name recognition and longer operating histories;\n•larger sales and marketing and customer support budgets and resources;\n•broader distribution and established relationships with distribution partners and end-customers;\n•the ability to bundle storage products with other technology products and services, or offer a broader range of storage solutions to better fit certain customers’ needs;\n•lower labor and development costs;\n•larger and more mature intellectual property portfolios;\n•substantially greater financial, technical and other resources; and\n•greater resources to make acquisitions.\nOur ability to sell our products is highly dependent on the quality of our services offerings, and our failure to offer high quality support and professional services would have a material adverse effect on our sales of our products and results of operations.\nOur services include the assessment and design of solutions to meet our customers’ data protection and storage management requirements and the efficient installation and deployment of our products based on specified business objectives. Further, once our products are deployed, our customers depend on us to resolve issues relating to our products. A high level of service is critical for the successful marketing and sale of our software. If our partners or we do not effectively install or deploy our applications, or succeed in helping our customers quickly resolve post-deployment issues, it would adversely affect our ability to sell software products to existing customers and could harm our reputation with potential customers. As a result, our failure to maintain high quality support and professional services would have a material adverse effect on our sales of our products and results of operations.\nFailure to achieve anticipated growth could harm our business and operating results.\nAchieving our anticipated growth will depend on a number of factors, some of which include:\n•retention of key management, marketing and technical personnel;\n•our ability to increase our customer base and to increase the sales of our products; and\n•competitive conditions in the network storage infrastructure software market.\nWe cannot assure you that the anticipated growth will be achieved. The failure to achieve anticipated growth could harm our business, financial condition and operating results.\nAdverse economic conditions or reduced IT spending may adversely impact our business.\nOur business depends on the overall demand for IT and on the economic health of our current and prospective customers. In general, worldwide economic conditions remain unstable, and these conditions make it difficult for our current and prospective customers and us to forecast and plan future business activities accurately, and they could cause our customers or prospective customers to reevaluate their decision to purchase our products or services. Also, global or national health concerns, including the outbreak of pandemic or contagious disease such as the recent coronavirus outbreak, can negatively impact the global economy and demand for our services. Weak global economic conditions, or a reduction in IT spending even if economic conditions improve, could adversely impact our business and operating results in a number of ways, including longer sales cycles, lower prices for our products, reduced bookings and lower or no growth.\nOur future quarterly results may fluctuate significantly, which could cause our stock price to decline.\nOur previous results are not necessarily indicative of our future performance and our future quarterly results may fluctuate significantly. Our future performance will depend on many factors, including:\n•fluctuations in the economy;\n•the timing of securing software license contracts and the delivery of software and related revenue recognition;\n•the seasonality of information technology, including network storage products, spending;\n•the average unit selling price of our products;\n•existing or new competitors introducing better products at competitive prices before we do;\n•our ability to manage successfully the complex and difficult process of qualifying our products with our customers;\n•new products or enhancements from us or our competitors;\n•our ability to release new and innovative products;\n•import or export restrictions on our proprietary technology; and\n•personnel changes.\nMany of our expenses are relatively fixed and difficult to reduce or modify. As a result, the fixed nature of our expenses will magnify any adverse effect of a decrease in revenue on our operating results.\nThe ability to predict our future effective tax rates could impact our ability to accurately forecast future earnings.\nWe are subject to income taxes in both the United States and the various foreign jurisdictions in which we operate. Judgment is required in determining our provision for income taxes and there are many transactions and calculations where the tax determination may be uncertain. Our future effective tax rates could be affected by changes in our (i) earnings or losses; (ii) changes in the valuation of our deferred tax assets; (iii) changes in tax laws; and (iv) other factors. Our ability to correctly predict our future effective tax rates based upon these possible changes could significantly impact our forecasted earnings.\nOur business could be materially affected as a result of a natural disaster, terrorist acts, or other catastrophic events.\nWhile our headquarters facilities contain redundant power supplies and generators, our domestic and foreign operations, and the operations of our industry partners, remain susceptible to fire, floods, power loss, power shortages, telecommunications failures, break-ins and similar events. Terrorist actions domestically or abroad could lead to business disruptions or to cancellations of customer orders or a general decrease in corporate spending on information technology, or could have direct impact on our marketing, administrative or financial functions and our financial condition could suffer. We continually look for alternatives to help mitigate any supply chain disruptions due to natural disasters, terrorist acts or other catastrophic events, including public health epidemics such as the recent outbreak of coronavirus, first identified in China. However, our failure to mitigate these supply chain disruptions could impact our ability to procure and deliver products to our customers, which could adversely impact our overall financial condition.\nWe are dependent on a variety of IT and telecommunications systems, and any failure of these systems could adversely impact our business and operating results.\nWe depend on IT and telecommunications systems for our operations. These systems support a variety of functions including order processing, shipping, shipment tracking, billing, support center and internal information exchange.\nFailures or significant downtime of our IT or telecommunications systems could prevent us from taking customer orders, shipping products, billing customers, handling support calls, or communication among our offices. The Internet and individual websites have experienced a number of disruptions and slowdowns, some of which were caused by organized attacks. In addition, some websites have experienced security breakdowns. If we were to experience a security breakdown, disruption or breach that compromised sensitive information, it could harm our relationship with our customers. Our support centers are dependent upon telephone and data services provided by third party telecommunications service vendors and our IT and telecommunications system. Any significant increase in our IT and telecommunications costs or temporary or permanent loss of our IT or telecommunications systems could harm our relationships with our customers. The occurrence of any of these events could have an adverse effect on our operations and financial results.\nUnited States Government export restrictions could impede our ability to sell our software to certain end users.\nCertain of our products include the ability for the end user to encrypt data. The United States, through the Bureau of Industry Security, places restrictions on the export of certain encryption technology. These restrictions may include: the requirement to have a license to export the technology; the requirement to have software licenses approved before export is allowed; and outright bans on the licensing of certain encryption technology to particular end users or to all end users in a particular country. Certain of our products are subject to various levels of export restrictions. These export restrictions could negatively impact our business.\nThe international nature of our business could have an adverse effect on our operating results.\nWe sell our products worldwide. Accordingly, our operating results could be materially adversely affected by various factors including regulatory, political, or economic conditions in a specific country or region, trade protection measures and other regulatory requirements, and acts of terrorism and international conflicts.\nAdditional risks inherent in our international business activities generally include, among others, longer accounts receivable payment cycles, difficulties in managing international operations, decreased flexibility in matching workforce needs as compared with the U.S., and potentially adverse tax consequences. Such factors could materially adversely affect our future international sales and, consequently, our operating results.\nForeign currency fluctuations may impact our revenue.\nOur licenses and services in Japan are sold in Yen. Many of our licenses and services in Australia, Canada, and in Europe are sold in Australian dollars, Canadian dollars and European Monetary Units (“Euros”), respectively. Changes in economic or political conditions globally and in any of the countries in which we operate could result in exchange rate movements, new currency or exchange controls or other restrictions being imposed on our operations.\nFluctuations in the value of the U.S. dollar may adversely affect our results of operations. Because our consolidated financial results are reported in U.S. dollars, translation of sales or earnings generated in other currencies into U.S. dollars can result in a significant increase or decrease in the reported amount of those sales or earnings. Significant changes in the value of these foreign currencies relative to the U.S. dollar could have a material adverse effect on our financial condition or results of operations. For example, the U.S. dollar has weakened against the Japanese Yen by 5% from December 31, 2019 to December 31, 2020.\nFluctuations in currencies relative to currencies in which our earnings are generated make it more difficult to perform period- to-period comparisons of our reported results of operations. For purposes of accounting, the assets and liabilities of our foreign operations, where the local currency is the functional currency, are translated using period-end exchange rates, and the revenue, expenses and cash flows of our foreign operations are translated using average exchange rates during each period.\nIn addition to currency translation risks, we incur currency transaction risk whenever we enter into either a purchase or a sales transaction using a currency other than the local currency of the transacting entity. Given the volatility of exchange rates, we cannot be assured we will be able to effectively manage our currency transaction and/or translation risks. Volatility in currency exchange rates may have a material effect on our financial condition or results of operations. Currency exchange rate fluctuations have not, in the past, resulted in a material impact on earnings. However, we may experience at times in the future an impact on earnings as a result of foreign currency exchange rate fluctuations.\nIf we are unable to protect our intellectual property, our business will suffer.\nOur success is dependent upon our proprietary technology. We have 47 patents and patent applications, numerous trademarks registered and multiple pending trademark applications related to our products. We cannot predict whether we will receive patents for our pending or future patent applications, and any patents that we own or that are issued to us may be invalidated, circumvented or challenged. In addition, the laws of certain countries in which we sell our products, including various countries in Asia, may not protect our products and intellectual property rights to the same extent as the laws of the United States.\nWe also rely on trade secret, copyright and trademark laws, as well as the confidentiality and other restrictions contained in our respective sales contracts and confidentiality agreements to protect our proprietary rights. These legal protections afford only limited protection and if we are unable to protect our intellectual property our business and operating results may suffer.\nOur efforts to protect our intellectual property may cause us to become involved in costly and lengthy litigation, which could seriously harm our business.\nIn recent years, there has been significant litigation in the United States involving patents, trademarks and other intellectual property rights.\nAny litigation, regardless of its outcome, would likely be time consuming and expensive to resolve and would divert management’s time and attention and might subject us to significant liability for damages or invalidate our intellectual property rights. Any potential intellectual property litigation against us could force us to take specific actions (any of which could have a material adverse effect on our business), including:\n•cease selling our products that use the challenged intellectual property;\n•obtain from the owner of the infringed intellectual property right a license to sell or use the relevant technology or trademark, which license may not be available on reasonable terms, or at all; or\n•redesign those products that use infringing intellectual property or cease to use an infringing product or trademark.\nCyber-attacks and breaches could cause operational disruptions, fraud or theft of sensitive information.\nAspects of our operations are reliant upon internet-based activities, such as ordering supplies and back-office functions such as accounting and transaction processing, making and accepting payments, processing payroll and other administrative functions, etc. Although we have taken measures to protect our technology systems and infrastructure, including employee education programs regarding cybersecurity, a breach of the security surrounding these functions could result in operational disruptions, theft or fraud, or exposure of sensitive information to unauthorized parties. Such events could result in additional costs related to operational inefficiencies, or damages, claims or fines.\nDevelopments limiting the availability of Open Source software could impact our ability to deliver products and could subject us to costly litigation.\nMany of our products are designed to include software or other intellectual property licensed from third parties, including “Open Source” software. At least one intellectual property rights holder has alleged that it holds the rights to software traditionally viewed as Open Source. In addition, United States courts have not interpreted the terms of many open source licenses, and there is a risk that such licenses could be construed in a manner that could impose unanticipated conditions or restrictions on our ability to commercialize our appliances. We could be required to seek licenses from third parties in order to continue offering our software, to re-engineer our software, to discontinue the sale of our software in the event re-engineering cannot be accomplished on a timely basis or to litigate any disputes relating to our use of open source software, any of which could harm our business. There can be no assurance that the necessary licenses would be available on acceptable terms, if at all. The inability to obtain certain licenses or other rights or to obtain such licenses or rights on favorable terms, or the need to engage in litigation regarding these matters, could have a material adverse effect on our business, operating results, and financial condition. Moreover, the inclusion in our products of software or other intellectual property licensed from third parties on a nonexclusive basis could limit our ability to protect our proprietary rights in our products.\nRisks Related to Our Capitalization\nOur redemption obligation under the Series A Preferred Stock and indebtedness could adversely affect our financial health.\nOur redemption obligation and indebtedness could have important consequences to you. For example, it could:\n•increase our vulnerability to general adverse economic and industry conditions;\n•make it more difficult for us to satisfy our other financial obligations;\n•restrict us from making strategic acquisitions or cause us to make non-strategic divestitures;\n•require us to dedicate a substantial portion of our cash flow from operations to payments on our indebtedness, thereby reducing the availability of our cash flow to fund working capital, capital expenditures and other general corporate purposes;\n•make it more difficult for us to satisfy our obligations to our lenders, resulting in possible defaults on and acceleration of such indebtedness;\n•limit our flexibility in planning for, or reacting to, changes in our business and the industry in which we operate;\n•place us at a competitive disadvantage compared to our competitors that have less debt; and\n•limit our ability to borrow additional funds or increase our cost of borrowing.\nIn addition, the terms of the Amended and Restated Term Loan Credit Agreement contain restrictive covenants that limit our ability to engage in activities that may be in our long-term best interests which could have a material adverse effect on our business, financial condition or prospects.\nTo service our indebtedness, we will require a significant amount of cash. Our ability to generate cash depends on many factors beyond our control. As such, we may not be able to generate sufficient cash to service the Term Notes or our other indebtedness, and may be forced to take other actions to satisfy our obligations under our indebtedness, which may not be successful.\nOur ability to make payments on and to refinance the Amended and Restated Term Loan Agreement, to fund planned capital expenditures, maintain sufficient working capital and fund any redemption of the Series A Preferred Stock will depend\non our ability to generate cash in the future. This, to a certain extent, is subject to general economic, financial, competitive, legislative, regulatory and other factors that are beyond our control.\nWe cannot assure you that our business will generate sufficient cash flow from operations or future borrowings from other sources in an amount sufficient to enable us to service our obligations under the the Amended and Restated Term Loan Agreement, or to fund our other liquidity needs. If our cash flows and capital resources are insufficient to allow us to make scheduled payments on our indebtedness, we may need to reduce or delay capital expenditures, sell assets, seek additional capital, restructure or refinance the Amended and Restated Term Loan Agreement, on or before the maturity thereof or seek a waiver of any redemption rights, any of which could have a material adverse effect on our operations. We cannot assure you that we will be able to refinance the Amended and Restated Term Loan Agreement, on commercially reasonable terms or at all, or that the terms of that indebtedness will allow any of the above alternative measures or that these measures would satisfy our scheduled debt service obligations. If we are unable to generate sufficient cash flow to repay or refinance our debt on favorable terms, it could significantly adversely affect our financial condition, and our ability to make any required cash payments under the Term Notes or fund any redemption of the Series A Preferred Stock. Our ability to restructure or refinance our debt will depend on the condition of the capital markets and our financial condition at that time. Any refinancing of our debt could be at higher interest rates and may require us to comply with more onerous covenants, which could further restrict our business operations. In addition, any future credit facility may be secured by a priority lien on substantially all of our assets. As such, our ability to refinance the Term Notes or seek additional financing could be impaired as a result of such security interest.\nWe are subject to a number of covenants and other conditions, which may restrict our business and financing activities.\nThe Amended and Restated Term Loan Credit Agreement has customary representations, warranties and affirmative and negative covenants. The Amended and Restated Term Loan Credit Agreement also contains customary events of default, including but not limited to payment defaults, cross defaults with certain other indebtedness, breaches of covenants, bankruptcy events and a change of control. In the case of an event of default, as administrative agent under the Loan Agreement, HCP-FVA may (and upon the written request of lenders holding in excess of 50% of the Term Loan, which must include HCP-FVA, is required to) accelerate payment of all obligations under the Loan Agreement, and seek other available remedies.\nThe restrictions in the Amended and Restated Term Loan Credit Agreement may prevent us from taking actions that we believe would be in the best interests of our business, and may make it difficult for us to successfully execute our business strategy or effectively compete with companies that are not similarly restricted. In addition, our ability to comply with the financial and other covenants and restrictions in the Amended and Restated Term Loan Credit Agreement will largely depend on the pricing of our products and services, and our ability to successfully implement our overall business strategy. We cannot assure you that we will be granted waivers or amendments to the Amended and Restated Term Loan Credit Agreement if for any reason we are unable to comply with these covenants and restrictions. The breach of any of these covenants and restrictions could result in a default under the Amended and Restated Term Loan Credit Agreement, which could result in an acceleration of our indebtedness.\nThe likelihood of a change of control in our company could be impacted by the fact that we have a significant amount of authorized but unissued preferred stock, protective provisions in our charter, outstanding Series A Preferred Stock, a staggered Board of Directors and change of control agreements as well as certain provisions under Delaware law.\nOur Board of Directors has the authority, without further action by our common stockholders, to issue up to an additional 1,100,000 shares of preferred stock on such terms and with such rights, preferences and designations, including, without limitation restricting dividends on our common stock, dilution of the voting power of our common stock and impairing the liquidation rights of the holders of our common stock, as the Board may determine without any vote of our common stockholders. Issuance of such preferred stock, depending upon the rights, preferences and designations thereof may have the effect of delaying, deterring or preventing a change in control. Moreover, our outstanding Series A Preferred Stock provides the holders with certain rights in the event of a merger with a third party and if we are unable to redeem the Series A Preferred Stock prior to July 30, 2021 or if the holders of the Series A Preferred Stock elect to exercise their rights to require the Company to redeem the Series A Preferred Stock due to the failure of the Company to comply with the financial covenants covering the Series A Preferred Stock. In addition, our Restated Certificate of Incorporation, as amended, includes certain provisions that restrict transfers of our common stock in order to protect the Company's net operating losses if the effect of such transfers would be to increase the direct or indirect ownership of stockholder from less than 4.99% to 4.99% or more of our common stock, or increase the ownership percentage of stockholder owning 4.99% or more of our common stock. Certain “antitakeover” provisions of the Delaware General Corporation Law, among other things, may restrict the ability of our stockholders to authorize a merger, business combination or change of control. Further, we have a staggered Board of Directors and have entered into change of control agreements through employment agreements with certain executives. In addition, generally proceeds received upon a change of control will be used first to repay outstanding principal and interest on the Term\nLoans and then to the holders of the Series A Preferred Stock, prior to the holders of the common stock, in an amount equal to the amount of unpaid principal and interest on the Term Loans and 100% of the stated value plus accrued and unpaid dividends with respect to the Series A Preferred Stock. As a result of the foregoing, our stockholders may lose opportunities to dispose of their shares at favorable prices generally available in takeover attempts or that may be available under a merger proposal and the market price of our common stock and the voting and other rights of our stockholders may also be affected.\nThe conversion and exercise of our outstanding securities and the anticipated grant of restricted stock to our employees will dilute the then-existing stockholders’ percentage ownership of our common stock.\nWe have outstanding options to purchase 9,780 shares of our common stock, an aggregate of 1,386,213 outstanding unvested restricted shares and outstanding Series A Preferred Stock convertible into 87,815 shares of our common stock. Over the next several years a significant number of shares of common stock are potentially issuable as dividends with respect to the Series A Preferred Stock (including 4,354 share of common stock reserved for issuance related to the accrued dividend as of December 31, 2020).\nThe exercise of all of the outstanding warrants, options and/or the vesting of all outstanding restricted shares, the conversion of our outstanding Series A Preferred Stock into common stock, the payment of dividends on our Series A Preferred Stock through the issuance of common stock and/or the grant and exercise of additional options and/or the grant and vesting of restricted stock and restricted stock units to our employees would dilute the then-existing stockholders’ percentage ownership of common stock, and any sales in the public market of the common stock issuable upon such exercise could adversely affect prevailing market prices for the common stock. Moreover, the terms upon which we would be able to obtain additional equity capital could be adversely affected because the holders of such securities can be expected to exercise or convert them at a time when we would, in all likelihood, be able to obtain any needed capital on terms more favorable than those provided by such securities.\nIf the Small Business Administration does not grant forgiveness of our loan under the Paycheck Protection Program, our business operations and cash flow likely will be adversely affected, and we may be limited in our ability to grow our operations until the unforgiven portion of this loan is repaid.\nOn April 28, 2020, we received a loan in the aggregate principal amount of $754,000 (the “PPP Loan”) from Peapack-Gladstone Bank pursuant to the Paycheck Protection Program under Title 1 of the Coronavirus Aid, Relief and Economic Security Act .The PPP Loan bears interest at a fixed rate of 1.00% per annum and matures on April 28, 2022.\nUnder the terms of the Paycheck Protection Program, the principal balance and interest due under the promissory note will be forgiven if we meet certain conditions related to the use of the loan proceeds. While we expect that the entire loan will be materially forgiven, we cannot be certain that the Small Business Administration will grant forgiveness of our entire loan. If we do not receive forgiveness of our entire loan, we will be obligated to start making payments on the portion of the principal and interest that is not forgiven so that it will be fully repaid no later than April 28, 2022, unless we are able to negotiate new payment terms with Peapack-Gladstone Bank. Amendments to the terms of our PPP Loan are subject to the consent of our senior lender. We do not expect to have a decision from the SBA regarding the forgiveness of the PPP Loan until sometime in the first or second quarter of 2021.\nTo the extent we have unforgiven debt, the monthly principal and interest payments on the unforgiven debt may negatively affect our ability to grow our operations, service other indebtedness, including the indebtedness under our Amended and Restated Credit Agreement or our redemption obligations for the Series A Preferred Stock.\nThere may be a limited public market for our securities; we presently fail to qualify for listing on any national securities exchanges.\nTrading in our common stock is conducted in the over-the-counter market. In addition, we currently fail to qualify for listing on either the NASDAQ Capital Market or the NYSE American. As a result, an investor may find it difficult to dispose of or to obtain accurate quotations as to the market value of our common stock, and our common stock may be less attractive for margin loans, for investment by larger financial institutions, as consideration in possible future acquisition transactions or other purposes.\nOur stock price may be volatile.\nThe market price of our common stock has been volatile in the past and may be volatile in the future. For example, during the twelve months ended December 31, 2020, the closing market price of our common stock as quoted on the OTC MKTS\nfluctuated between $1.95 and $8.30 and recently the closing trading price has been $6.00. The market price of our common stock may be significantly affected by the following factors:\n•actual or anticipated fluctuations in our operating results, including changes in the timing of when we recognize revenue;\n•failure to meet financial estimates;\n•changes in market valuations of other technology companies, particularly those in the network storage software market;\n•the announcement of any strategic alternatives;\n•announcements by us or our competitors of significant technical innovations, acquisitions, strategic partnerships, strategic alternatives, joint ventures or capital commitments;\n•loss of one or more key customers;\n•the conversion or exercise into common stock of stock options, the vesting of restricted stock and the anticipated grant of equity to employees;\n•the issuance of additional shares of the Series A Preferred Stock pursuant to dividend rights; and\n•departures of key personnel.\nThe stock market has experienced extreme volatility that often has been unrelated to the performance of particular companies. These market fluctuations may cause our stock price to fall regardless of our performance.\nOur agreements with the holders of the Series A Preferred Stock and/or the Term Loans contain covenants that could limit our ability to obtain financing using our equity. In addition, if we engage in future financings, we may have to use the proceeds to redeem the preferred stock held by such holders. This could cause us to have difficulty in obtaining capital necessary to run our business.\nOur agreements with the holders of the Series A Preferred Stock and /or the Term Loans give such holders veto power over certain future financings, and give such holders certain rights to participate in any subsequent financing, whether through debt or equity (subject to certain exclusions). These participation rights could discourage a potential investor or a potential lender from making financing available to us on favorable terms. Because of these covenants, if we determine that we are in need of additional capital, we might not be able to obtain it. In addition, our agreements with the holders of the Series A Preferred Stock provide that if, at the time of certain future debt or equity financings, the proceeds of which exceed $5 million, the holders of the Series A Preferred Stock still have outstanding Series A Preferred Stock, then we must offer to repurchase their Series A Preferred Stock. The holders of the Series A Preferred Stock have the right to accept the offer or to retain their Series A Preferred Stock. If we do a financing, and the holders of the Series A Preferred Stock elect to have their Series A Preferred Stock repurchased, then the capital raised in excess of $5 million will go to repurchase the holders’ Series A Preferred Stock, instead of being able to be used for our business.\nOur agreements with the holders of the Series A Preferred Stock and/or the Term Loans prevent us from undertaking certain transactions or incurring certain indebtedness without such holders’ consent or unless the Series A Preferred Stock held by such holders is repurchased and or the Term Loans are repaid. This could hurt our ability to sell underperforming assets or lines of business or to obtain financing.\nOur agreements with the holders of the Series A Preferred Stock and/or the Term Loans prevent us from undertaking certain transactions or incurring certain debt without such holders’ consent or unless the Series A Preferred Stock held by such holders’ is repurchased and or the Term Loans are repaid. These transactions include, but are not limited to:\n•A merger with, or the sale of substantially all of the Company’s assets or capital stock, to a third party;\n•Assumption of indebtedness in excess of 80% of the Company’s accounts receivable; and\n•The sale, license or other disposition of 10% or more of the tangible assets or capital stock of the Company.\nThis could limit our ability to sell off underperforming assets or business lines. It could also prevent us from obtaining financing we may need to run or to grow our business.\nThe holders of the Series A Preferred Stock are entitled to dividends on the Series A Preferred Stock they hold. Depending on whether these dividends are paid in cash or stock, the payment of these dividends will either decrease cash that is available to us to invest in our business or dilute the holdings of all other stockholders.\nOur agreements with the holders of the Series A Preferred Stock provide that such holders will receive quarterly dividends on the Series A Preferred Stock at prime rate plus 5%, subject to a maximum dividend rate of 10%. We also have the ability to\naccrue and roll over dividends. Due to the lack of sufficient surplus to pay dividends as required by the Delaware General Corporation Law, the Company was not permitted to pay the fourth quarter 2016 dividend in cash or common stock and has been accruing its quarterly dividends since then. As of December 31, 2020, the Company’s liability for dividends to the holders of the Series A Preferred Stock totaled $4.4 million. While the Term Loans are outstanding, we are only permitted to pay in-kind dividends on the Series A Preferred Stock. If in the future we pay cash dividends on the Series A Preferred Stock, it will reduce the cash that we have available to invest in our business. There can be no assurance that we will have enough cash to pay future dividends in cash. If future dividends are paid in kind, it will dilute the holdings of all other stockholders.\nThe potential concentration of equity ownership by Hale Capital and ESW Capital LLC may limit your ability to influence corporate matters.\nHale Capital currently owns approximately 61.5% of our outstanding common stock and ESW currently owns approximately 22.2% of our outstanding common stock. In addition, the beneficial ownership of Hale Capital and ESW Capital LLC is higher when calculated in accordance with Section 13(d) of the Exchange Act due to their ownership of derivative securities. In addition, Hale Capital and ESW have additional rights through their ownership of Series A Preferred Stock and their holdings of Company debt.\nSuch ownership could enable Hale Capital and ESW to exert significant influence over all corporate activities, including the election or removal of directors and the outcome of tender offers, mergers, proxy contests or other purchases of common stock that could give our stockholders the opportunity to realize a premium over the then-prevailing market price for their shares of common stock. This concentrated control will limit your ability to influence corporate matters and, as a result, we may take actions that our stockholders do not view as beneficial. In addition, such concentrated control could discourage others from initiating changes of control. In such cases, the perception of our prospects in the market may be adversely affected and the market price of our common stock may decline.\nUnknown Factors\nAdditional risks and uncertainties of which we are unaware or which currently we deem immaterial also may become important factors that affect us.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNone",
    "item_2": "Item 2. Properties\nThe Company’s headquarters are located in an approximately 3,711 square foot facility in Austin, Texas. Offices are also leased for development, support, and sales and marketing personnel, which total an aggregate of approximately 68,496 square feet in Melville, N.Y.; Munich, Germany; and Taichung, Taiwan. Initial lease terms range from one to two years.",
    "item_3": "Item 3. Legal Proceedings\nIn view of the inherent difficulty of predicting the outcome of litigation, particularly where the claimants seek very large or indeterminate damages, we generally cannot predict what the eventual outcome of the pending matters will be, what the timing of the ultimate resolution of these matters will be, or what the eventual loss, fines or penalties related to each pending matter may be.\nIn accordance with the authoritative guidance issued by the Financial Accounting Standards Board (\"FASB\") on contingencies, we accrue anticipated costs of settlement, damages and losses for claims to the extent specific losses are probable and estimable. We record a receivable for insurance recoveries when such amounts are probable and collectable. In such cases, there may be an exposure to loss in excess of any amounts accrued. If, at the time of evaluation, the loss contingency related to a litigation is not both probable and estimable, the matter will continue to be monitored for further developments that would make such loss contingency both probable and estimable and, we will expense these costs as incurred. If the estimate of a probable loss is a range and no amount within the range is more likely, we will accrue the minimum amount of the range.\nOther Claims\nWe are subject to various legal proceedings and claims, asserted or unasserted, which arise in the ordinary course of business. While the outcome of any such matters cannot be predicted with certainty, such matters are not expected to have a material adverse effect on our financial condition or operating results.\nWe continue to assess certain litigation and claims to determine the amounts, if any, that we believe may be paid as a result of such claims and litigation and, therefore, additional losses may be accrued and paid in the future, which could materially adversely impact our financial results, cash flows and cash reserves.",
    "item_4": "Item 4. Mine Safety Disclosures\nNot applicable\nPART II",
    "item_5": "Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nOur common stock is quoted on the OTC Markets’ OTCQB under the symbol “FALC”.\nHolders\nWe had approximately 46 holders of record of common stock as of February 28, 2021. This does not reflect persons or entities that hold common stock in nominee or “street” name through various brokerage firms.\nDividends\nWe have not paid any cash dividends on our common stock since inception. We expect to reinvest any future earnings to finance growth, and therefore do not intend to pay cash dividends on our common stock in the foreseeable future. In addition, the terms of our Series A Preferred Stock and the Amended and Restated Term Loan Credit Agreement restrict our ability to pay dividends on our common stock. Our board of directors may determine to pay future cash dividends on our common stock if it determines that dividends are an appropriate use of Company capital.\nHolders of the Series A Preferred Stock are entitled to receive quarterly dividends at the Prime Rate (Wall Street Journal Eastern Edition) plus 5% (up to a maximum amount of 10%), payable in cash, provided, that if we will not have at least $1.0 million in positive cash flow for any calendar quarter after giving effect to the payment of such dividends, we, at our election, can pay such dividends in whole or in part in cash, provided that cash flow from operations is not negative, and the remainder can be accrued or paid in common stock to the extent certain equity conditions are satisfied. Due to the lack of sufficient surplus to pay dividends as required by the Delaware General Corporation Law, the Company was not permitted to pay the fourth quarter 2016 dividend in cash or common stock and has been accruing its quarterly dividends since then. As of December 31, 2020, the Company’s liability for dividends to the holders of the Series A Preferred Stock totaled $4.4 million. While the Term Loans are outstanding, we are only permitted to pay in-kind dividends on the Series A Preferred Stock.\nEquity Compensation Plan Information\nNumber of securities to be issued upon exercise of outstanding options and restricted stock (1)\nWeighted-average exercise price of outstanding options and restricted stock (1)\nNumber of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in column (a)) (1)\nPlan Category (a) (b) (c)\nEquity compensation plans approved by security holders 1,395,993 $0.80 1,421,240\n(1)As of December 31, 2020 we had 1,421,240 shares of our common stock reserved for issuance under our stock plans with respect to outstanding options and restricted stock that have not been granted. See Note (10) Share-Based Payment Arrangements to our consolidated financial statements for further information.\nIssuer Purchases of Equity Securities\nNone\nUnregistered Sales of Equity Securities and Use of Proceeds\nNone",
    "item_6": "Item 6. Selected Financial Data\nWe are a smaller reporting company as defined by Rule 12-b-2 of the Exchange Act and are not required to provide the information required under this Item.",
    "item_7": "ITEM 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations contains “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. These forward-looking statements can be identified by the use of predictive, future-tense or forward-looking terminology, such as “believes,” “anticipates,” “expects,” “estimates,” “plans,” “may,” “intends,” “will,” or similar terms. Investors are cautioned that any forward-looking statements are not guarantees of future performance and involve significant risks and uncertainties, and that actual results may differ materially from those projected in the forward-looking statements. The following discussion should be read together with the consolidated financial statements and notes to those financial statements included elsewhere in this report.\nOVERVIEW\nFalconStor is a data protection leader that enables enterprises to modernize their data backup and archival operations across sites and public clouds, delivering increased data security and providing the fastest recovery from a ransomware attack while driving down costs by up to 95 percent. A proven technology leader with 47 patents and patent applications, FalconStor has over an exabyte of data under management and is trusted by more than 600 enterprise customers and an ecosystem of managed service providers and resellers worldwide.\nOur products are utilized by enterprises and managed service providers across the globe and address two key areas of enterprise data protection; long-term data retention and recovery, and business continuity driven data replication. Our innovative integration with modern cloud-based data storage environments, such as AWS and Microsoft Azure, enables our customers to significantly reduce costs, and improve the portability, security, and accessibility of their enterprise data. This accessibility is key in our modern world, where data is not only protected, but also intelligently leveraged to facilitate learning, improve product design, and drive competitive advantage. Our products are software-defined, which means that our technology allows our solutions to be hardware, cloud, and source-data agnostic, giving our customers maximum leverage of existing hardware and software investments.\nIn 2020, we focused our go to market efforts on long-term data retention and recovery data protection segment, building on the momentum we generated in 2019 and increasing profitability. We increased our go-to-market investment within our core regions of the Americas, EMEA, Japan, Korea, and Southeast Asia, and we released StorSafe, the next generation of our Virtual Tape Library (“VTL”) product family built for the cloud, while carefully managing operating expenses.\nDuring 2020, we delivered 26% year-over-year new customer bookings growth despite the economic turmoil caused by the global COVID-19 pandemic. While uncertainties continue to exist as a result of COVID-19, we have seen our customers and prospects continue to invest in the business critical area of data production in which we sell our solutions.\nGAAP revenue decreased by $1.8 million during the year, compared to 2019. However, the proactive expense management plan we implemented at the end of Q1, allowed us to deliver $1.1 million of net income in the quarter, compared to a net loss of $1.8 million in 2019. Our significantly improved profitability has allowed us to make additional targeted investments, primarily related to Sales, R&D, and Support personnel, while maintaining a profitable expense base.\nDuring 2020, our strategy was to continue focus within our core regions of the Americas, EMEA, Japan, Korea, and Southeast Asia. As result of this strategy, we delivered:\n•26% increase in new customer bookings year-over-year across all product lines,\n•A reduction in our commercial exposure in China to less than 3% of total sales.\nDuring 2020, we continued to deliver innovation and enhance each of our products. Our StorSafe solution is a vital backup long-term archive retention tool in enterprise IT departments’ data protection arsenal. It enables them to modernize their backup and archive environments, leverage efficient hybrid- and public-cloud storage environments, such as those provided by AWS and Microsoft Azure, save operational costs, and improve restore performance for rapid remote disaster recovery.\nThrough StorSafe, we are making significant progress expanding our technology to deliver an enterprise-class, highly flexible backup and archive data storage optimization solution.\nBy leveraging patent pending industry-standard container technology to enable persistent long-term archive storage, StorSafe not only retains the data reduction delivered as it exports data to lower cost on premise repositories and industry\nleading cloud providers like AWS, Microsoft Azure and IBM but also enables archive data portability, accessibility, security, and integrity validation. As a result, a full spectrum of archive data storage options will be made available to our enterprise customers to efficiently utilize essentially any storage environment, while confidently ensuring data security and efficient archive access.\nBeyond our long-term archive retention and reinstatement products, our NSS and CDP business continuity driven data replication products give our customers the ability to move workloads to the right destination, on-premise or in the cloud, with advanced insight. These products are designed for organizations with complex, heterogeneous IT environments and the full spectrum of data management use cases, including but not limited to large enterprises, universities, health care entities and governmental institutions. These products are modern, comprehensive and easy-to-use software solutions that enable IT professionals to have complete insight into and control over their organization’s data. Data is an organization’s most precious resource which, if managed and protected properly, can help an enterprise unlock competitive advantage, whether by gaining a better understanding of customers, uncovering ways to improve operations and reduce costs, or inventing new products, services and business models.\nTo provide for greater ease of use for all our products, we also made significant enhancements to our central data management console, now called StorSightTM, to interface with each of our products to provide a holistic view of an enterprise’s entire data protection environment - whether legacy data centers, hyper-converged infrastructure, cloud and/or hybrids.\nFalconStor continues to focus on enterprise customers, managed service providers, and OEM partners. These markets offer the most significant opportunity and are best suited to realize the value of FalconStor products, and provide an efficient and effective access to broad, worldwide markets. Most of our revenue comes from sales to enterprise customers through resellers. As service providers to companies, resellers’ reputations are dependent on satisfying their customers’ needs efficiently and effectively. Resellers have wide choices in fulfilling their customers’ needs. If resellers determine that a product they have been providing to their customers is not functioning as promised, or is not providing adequate return on investment, or if the customers are not satisfied with the level of support they are receiving from the suppliers, the resellers will move quickly to offer different solutions to their customers. Additional sales by resellers are therefore an important indicator of our business prospects.\nOur “Business Partner” program for our resellers provides financial incentives, for those resellers that are willing to make a commitment to FalconStor through training, marketing and revenue. As part of our review of all of our operations to maximize savings without sacrificing sales, and in connection with our Business Partner program, we continually review our relationship with each of our resellers in all regions. We decided to focus on only those resellers who have the expertise, personnel and networks to identify potential customers and to service our end users.\nHistorically, the majority of our software licenses have been sold on a capacity basis and have included a perpetual right to use the licensed capacity. Now, we also offer our capacity-based licenses on a subscription or term-based model, which gives a customer the right to utilize the licensed terabyte capacity over a designated period of time. We expect revenue from subscription-based capacity licensing to increase over the next several years.\nFluctuation in our revenue is driven by the volume and mix of sales from period to period. Revenue allocated to perpetual and term software licenses are recognized at a point in time upon electronic delivery of the download link and the license keys, as these products have significant standalone functionality. Product maintenance and support services are satisfied over time as they are stand-ready obligations throughout the support period. As a result, revenues associated with maintenance services are deferred and recognized as revenue ratably over the term of the contract. Revenues associated with professional services are recognized at a point in time upon customer acceptance.\nRESULTS OF OPERATIONS - FOR THE YEAR ENDED DECEMBER 31, 2020 COMPARED WITH THE YEAR ENDED DECEMBER 31, 2019\nFor the year ended December 31, 2020, we recognized $14.8 million in revenue, as compared to $16.5 million during the prior year period. While revenue benefited from a 26% increase in new customer bookings, this benefit was offset by an overall decline in support and services revenue, and revenue from China in 2020.\nTotal cost of revenue for the year ended December 31, 2020 decreased 37% to $1.8 million for the year ended December 31, 2020, compared with $2.9 million for the year ended December 31, 2019. Total gross profit decreased $0.7\nmillion, or 5%, to $12.9 million for the current year, compared with $13.6 million for 2019. Total gross margin increased to 88% for the current year, compared with 82% for 2019. The increase in our total gross margin percentage was primarily due to product mix, and as a result of an intentional shift away from selling hardware, which yields significantly lower profit margins, compared to our key proprietary software license offerings. Generally, our total gross profits and total gross margins fluctuate based on several factors, including (i) revenue growth levels, (ii) changes in personnel headcount and related costs, and (iii) our product offerings and mix of sales.\nOverall, our total operating expenses decreased 22.1% from $14.3 million for the year ended December 31, 2019 to $11.1 million for the year ended December 31, 2020. This decrease was primarily attributable to our tighter expense controls and overall operational efficiencies which better align our current business plan on a run-rate basis. These efficiencies include among other items, stream-lined personnel related costs, global overhead costs and efficiencies realized on our redesigned go-to-market coverage models. We will continue to evaluate the appropriate headcount levels to properly align our resources with our current and long-term outlook and to take actions in areas of the Company that are not performing.\nOur net income for the year ended December 31, 2020 was $1.1 million, compared with a net loss of $1.8 million for the previous year.\nNet loss attributable to common stockholders, which includes the effects of the Series A Preferred Stock dividends (including accrued dividends) and accretion, was $0.5 million for the year ended December 31, 2020, compared with a net loss of $3.3 million for the year ended December 31, 2019.\nWe ended the year with $1.9 million of cash and cash equivalents, compared to $1.5 million at December 31, 2019 and deferred revenue of $6.4 million as of December 31, 2020, compared with $7.4 million as of December 31, 2019.\nRevenue\nYear ended December 31,\n2020 2019\nRevenue:\nProduct revenue $ 7,097,695 $ 6,767,595\nSupport and services revenue 7,670,998 9,775,976\nTotal Revenue $ 14,768,693 $ 16,543,571\nYear-over-year percentage change\nProduct revenue 5 % 17 %\nSupport and services revenue (22) % (19) %\nTotal percentage change (11) % (7) %\nProduct revenue\nProduct revenue is comprised of sales of both licenses for our software solutions and sales of the platforms on which the software is installed. This includes stand-alone software applications and software integrated with industry standard hardware, sold as one complete integrated solution or sold on a subscription or consumption basis. The products are sold through our OEMs, and through (i) value-added resellers, (ii) distributors, and/or (iii) directly to end-users (collectively “non-OEMs”). These revenues are recognized when all the applicable criteria under accounting principles generally accepted in the United States are met.\nProduct revenue increased 5% from $6.8 million for the year ended December 31, 2019 to $7.1 million for the year ended December 31, 2020. Product revenue represented 48% and 41% of our total revenue for the years ended December 31, 2020 and 2019, respectively.\nWe continue to invest in our product portfolio by refreshing and updating our existing product lines and developing our next generation of innovative product offerings to drive our sales volume in support of our long-term outlook.\nSupport and services revenue\nSupport and services revenue is comprised of revenue from (i) maintenance and technical support services, (ii) professional services primarily related to the implementation of our software, and (iii) engineering services. Revenue derived from maintenance and technical support contracts are deferred and recognized ratably over the contractual maintenance term. Revenues associated with professional and engineering services are recognized at a point in time upon customer acceptance. Support and services revenue decreased 22% from $9.8 million for the year ended December 31, 2019 to $7.7 million for the year ended December 31, 2020. The decrease in support and services revenue was attributable to a decreases in both maintenance and technical support services revenue and professional services revenue from legacy contracts which have termed.\nMaintenance and technical support services revenue decreased from $9.4 million for the year ended December 31, 2019 to $7.5 million for the year ended 2020. Our maintenance and technical support service revenue results primarily from (i) the purchase of maintenance and support contracts by our customers, and (ii) the renewal of maintenance and support contracts by our existing and new customers after their initial contracts expire. The decrease in maintenance and technical support service revenue over the previous year reflects a decline in maintenance renewals revenue as a result of customer conversion to subscription contracts and customer attrition.\nProfessional services revenue decreased from $0.4 million for the year ended December 31, 2019 to $0.2 million for the year ended December 31, 2020. Professional services revenue can vary from period to period based upon (i) the number of solutions sold during the existing and previous periods, (ii) the number of our customers who elect to purchase professional services, (iii) the number of professional services contracts that are performed during the period, and (iv) the number of customers who elect to purchase engineering services. We expect professional services revenue to continue to vary from period to period based upon the number of customers who elect to utilize our professional services upon purchasing any of our solutions.\nCost of revenue\nYear ended December 31,\n2020 2019\nCost of revenue:\nProduct $ 297,555 $ 721,122\nSupport and service 1,529,923 2,191,865\nTotal cost of revenue $ 1,827,478 $ 2,912,987\nTotal Gross Profit $ 12,941,215 $ 13,630,584\nGross Margin:\nProduct 96% 89%\nSupport and service 80% 78%\nTotal gross margin 88% 82%\nCost of revenue, gross profit and gross margin\nCost of product revenue consists primarily of personnel costs and amortization of capitalized software costs. Cost of support and service consists primarily of personnel and other costs associated with providing software implementations, technical support under maintenance contracts and training.\nCost of product revenue for the year ended December 31, 2020 decreased $0.4 million, or 59%, to $0.3 million, compared with $0.7 million for the same period in 2019. Product gross margin increased to 96% for the year ended December 31, 2020, compared with 89% for the same period in 2019. The decrease in cost of product revenue and increase in product gross margin for the current year was primarily due to an intentional shift away from hardware sales in the current period, compared to the prior year period. Our cost of support and service revenue for the year ended December 31, 2020 decreased $0.7 million, or 30%, to $1.5 million, compared with $2.2 million for the same period in 2019. Support and service gross margin increased to 80% for the year ended December 31, 2020 from 78% for the same period in 2019. The increase in support and service gross margin, as compared to the previous year, was primarily attributable to an increase in maintenance and support services revenue that was greater in proportion to the increase in costs, year over year.\nTotal gross profit decreased $0.7 million, or 5%, from $13.6 million for the year ended December 31, 2019, to $12.9 million for the year ended December 31, 2020. Total gross margin increased to 88% for the year ended December 31, 2020, compared with 82% for the year ended December 31, 2019. The increase in our total gross margin was primarily due to product mix, as a result of an intentional shift away from selling hardware, which yields significantly lower profit margins, compared to our key proprietary software license offerings. Generally, our total gross profits and total gross margins fluctuate based on several factors, including (i) revenue growth levels, (ii) changes in personnel headcount and related costs, and (iii) our product offerings and mix of sales.\nOperating Expenses\nResearch and Development Costs\nResearch and development costs consist primarily of personnel costs for product development, and other related costs associated with the development of new products, enhancements to existing products, quality assurance and testing. Research and development costs decreased $0.7 million, or 23%, to $2.5 million for the year ended December 31, 2020, from $3.2 million in 2019. The decrease was primarily related to a decrease in personnel related costs resulting from our realignment and reduction in workforce and continued efforts to allocate the appropriate level of resources based upon the product development roadmap schedule. We continue to provide substantial resources in support of our research and development activities to continue to enhance and to test our core products and in the development of new innovative products, features and options.\nSelling and Marketing\nSelling and marketing expenses consist primarily of sales and marketing personnel and related costs, travel, public relations expense, marketing literature and promotions, commissions, trade show expenses, and the costs associated with our foreign sales offices. Selling and marketing expenses increased $0.3 million, or 6%, to $4.6 million for the year ended December 31, 2020, from $4.3 million for the year ended December 31, 2019. The increase in selling and marketing expenses was primarily attributable to increased investments made in the Americas and EMEA.\nGeneral and Administrative\nGeneral and administrative expenses consist primarily of personnel costs of general and administrative functions, public company related costs, directors’ and officers’ insurance, legal and professional fees, and other general corporate overhead costs. General and administrative expenses decreased $2.6 million, or 46%, to $3.0 million for the year ended December 31, 2020, from $5.6 million for the year ended December 31, 2019. The decrease in general and administrative expenses was due primarily to positions eliminated and facilities closed as part of the Company's restructuring plans. For further information, refer to Note (14) Restructuring Costs, to our consolidated financial statements.\nRestructuring costs\nIn June 2017, the Board approved a comprehensive plan to increase operating performance (the “2017 Plan”). The 2017 Plan resulted in a realignment and reduction in workforce. The 2017 Plan was substantially completed by the end of our fiscal year ended December 31, 2017 and when combined with previous workforce reductions in the second quarter of Fiscal 2017 reduced our workforce to approximately 81 employees at December 31, 2017. As part of this consolidation effort, the Company vacated a portion of the Melville, NY office space during the three months ended June 30, 2018. In accordance with accounting standards governing costs associated with exit or disposal activities, expenses related to future rental payments for which the Company no longer intends to receive any economic benefit are accrued, net of any anticipated sublease income, when the Company ceases use of the leased space. During the years ended December 31, 2020 and 2019, the Company incurred lease disposal-related costs for this property of $1.0 million and $0.9 million, respectively. As of December 31, 2019, $0.1 million of the Company's remaining accrued lease disposal cost has been recorded as a component of operating lease liabilities.\nDuring the three months ended September 30, 2019, the Company adopted a plan to better align the Company’s cost structure with the skills and resources required to more effectively execute the Company’s long-term growth strategy and to support revenue levels the Company expected to achieve on a go forward basis (the \"2019 Plan\"), implemented tighter expense controls, ceased non-core activities and downsized several facilities. During the three months ended ended March 31, 2020, the Company incurred $0.1 million in severance expense as a result of this action. The 2019 Plan was substantially completed by March 31, 2020.\nGiven the commercial uncertainty caused by the novel coronavirus pandemic, or COVID-19, the Company developed and implemented an even more aggressive expense control plan in March 2020, that it is kept in place for the remainder of 2020 (the \"2020 Plan\"). The 2020 Plan reduced the Company's annual cash expense run rate by $4.0 million or 29%. The Company furloughed 21 positions worldwide, and 20 of these positions were reinstated by the fourth quarter of 2020. As a result, in part from the reduced expense level, FalconStor was able to generate net income for the year ended December 31, 2020.\nRestructuring expense decreased $0.1 million for the year ended December 31, 2020 to $1.0 million, compared to a $1.1 million restructuring charge in the prior year period. For further information, refer to Note (14) Restructuring Costs, to our consolidated financial statements.\nInterest and Other Expense\nInterest and other expense increased $0.1 million for the year ended December 31, 2020 to $0.7 million, compared to $0.6 million for the year ended December 31, 2019. Interest and other expense is comprised of interest expense on our term loan, foreign currency gains and losses and the change in fair value our embedded derivatives.\nIncome Taxes\nFor the year ended December 31, 2020, we recorded an income tax benefit of $14,319, consisting of federal, state and local and foreign taxes. Our effective tax rate for the year ended December 31, 2020 was (1.3)%.\nLIQUIDITY AND CAPITAL RESOURCES\nPrincipal Sources of Liquidity\nOur principal sources of liquidity are our cash, cash equivalents generated from operating, investing and financing activities. Our cash and cash equivalents balance as of December 31, 2020 totaled $1.9 million, compared with $1.5 million as of December 31, 2019.\nOn December 27, 2019, the Company entered into an amendment to the Amended and Restated Term Loan Agreement. Such an amendment was by and among the Company, certain of the Company’s affiliates in their capacities as guarantors, HCP-FVA, as administrative agent for the Lenders party thereto, ESW, as co-agent, and the Lenders, and provides for, among other things, a new $2,500,000 term loan facility to the Company. The Amendment also provides for certain financial covenants. On December 27, 2019, the Company drew down $1,000,000 of the 2019 Term Loan which required a fixed amount of interest on such advance equal to 15% of the principal amount advanced. Pursuant to the Amendment, we were required to repay such $1,000,000 advance by September 27, 2020 (as may be extended pursuant to the terms of Amendment). On September 27, 2020, the Company paid the 2019 Term Loan in full.\nThe Amended and Restated Term Loan Credit Agreement has customary representations, warranties and affirmative and negative covenants. The negative covenants include financial covenants by the Company to maintain minimum cash denominated in U.S. dollars plus accounts receivable outstanding for less than 90 days of $2 million to maintain liquidity at least at $300,000 until the 2019 Term Loan is repaid, other financial covenants relating to In-Force annual contract value. The Amended and Restated Term Loan Credit Agreement also contains customary events of default, including but not limited to payment defaults, cross defaults with certain other indebtedness, breaches of covenants, bankruptcy events and a change of control. In the case of an event of default, as administrative agent under the Amended Restated Term Loan Credit Agreement, HCP-FVA, an affiliate of Hale Capital may (and upon the written request of lenders holding in excess of 50% of the Term Loans, which must include HCP-FVA, is required to) accelerate payment of all obligations under the Amended and Restated Term Loan Credit Agreement, and seek other available remedies.\nThe restrictions in the Amended and Restated Term Loan Credit Agreement may prevent us from taking actions that we believe would be in the best interests of our business, and may make it difficult for us to successfully execute our business strategy or effectively compete with companies that are not similarly restricted. In addition, our ability to comply with the financial and other covenants and restrictions in the Amended and Restated Term Loan Credit Agreement will largely depend on the pricing of our products and services, and our ability to successfully implement our overall business strategy. We cannot assure you that we will be granted waivers or amendments to the Amended and Restated Term Loan Credit Agreement if for any reason we are unable to comply with these covenants and restrictions. The breach of any of these covenants and restrictions could result in a default under the Amended and Restated Term Loan Credit Agreement, which could result in an acceleration of our indebtedness.\nHale Capital Partners and affiliated entities (“HCP”) has agreed if necessary to renegotiate or extend the maturity date of the Company’s outstanding debt under Amendment No. 1 to the Amended and Restated Term Loan Credit Agreement dated December 27, 2019 by and among FalconStor Software, Inc., HCP-FVA, EW Capital, LLC and the other lender parties thereto (the “Loan Agreement”) so that the maturity date of the outstanding promissory notes issued pursuant to the Loan Agreement is extended from June 30, 2021 to April 1, 2022. Similarly, HCP has agreed if necessary to extend the mandatory redemption date of the Company’s Series A Convertible Preferred Stock (the “Preferred Stock”) from July 31,2021 to at least April 1, 2022. Other than the extension, it is the intention of HCP and the Company that the terms of the Loan Agreement and the Preferred Stock would have substantially similar terms as are currently in effect.\nAs described in Part II, Item 8, Note (7) \"Notes Payable and Stock Warrants\", to help ensure adequate liquidity during this period and in light of uncertainties posed by the COVID-19 pandemic, the Company entered into a loan with Peapack-Gladstone Bank on April 28, 2020 (the “Loan”), pursuant to the Paycheck Protection Program (the “PPP”) under the Coronavirus Aid, Relief, and Economic Security Act. The Loan has an aggregate principal amount of $754,000. Subject to the terms and limitations of the PPP, the Loan may be forgiven in whole or in part. Our intent is that the entire loan amount will be used to fund our payroll, rent and utilities.\nLiquidity\nAs of December 31, 2020, we had a working capital deficiency of $4.5 million, which is inclusive of current deferred revenue of $4.6 million, and a stockholders' deficit of $14.6 million. Our cash and cash equivalents at December 31, 2020 was $1.9 million, an increase of $0.4 million as compared to December 31, 2019. On April 28, 2020, the Company entered into a loan with Peapack-Gladstone Bank in an aggregate principal amount of $754,000 (the \"Loan\"), pursuant to the Paycheck Protection Program (the \"PPP\") under the Coronavirus Aid, Relief, and Economic Security Act (the \"CARES Act\").\nIn the third quarter of 2019, the Company adopted a plan to better align the Company’s cost structure with the skills and resources required to more effectively execute the Company’s long-term growth strategy and to support revenue levels the Company expected to achieve on a go forward basis (the \"2019 Plan\"). In connection with the 2019 Plan, the Company eliminated 23 positions worldwide, implemented tighter expense controls, ceased non-core activities and downsized several facilities. As of December 31, 2020, the 2019 Plan is considered to be completed.\nOn December 27, 2019, the Company entered into Amendment No. 1 to Amended and Restated Term Loan Credit Agreement (the “Amendment”), by and among the Company, certain of the Company’s affiliates in their capacities as guarantors, HCP-FVA, LLC (“HCP-FVA”) as administrative agent for the lenders party thereto (the “Lenders”), ESW Capital, LLC (“ESW”), as co-agent, and the Lenders, to provide for, among other things, a new $2,500,000 term loan facility to the Company with an interest rate of 15% (the “2019 Term Loan”). The Amendment also provides for certain financial covenants. On December 27, 2019, the Company drew down $1,000,000 of the 2019 Term Loan which required a fixed amount of interest on such advance equal to 15% of the principal amount advanced. The Company paid the 2019 Term Loan in full on September 27, 2020.\nGiven the commercial uncertainty caused by the novel coronavirus pandemic, or COVID-19, the Company developed and implemented an even more aggressive expense control plan in March 2020 (the \"2020 Plan\"), that it kept in place for the remainder of 2020. This plan reduced the Company's annual cash expense run rate by $4.0 million or 29%. The Company has furloughed 21 positions worldwide, and 20 of these positions were reinstated by December 31, 2020. The 2020 Plan was completed on December 31, 2020.\nBased on its projected cash flows from operations, commitments from HCP, ongoing financing activities, cost cutting measures in place and existing cash on hand, the Company is projecting to have sufficient liquidity and to be cash flow positive through March 10, 2022.\nCash Flow Analysis\nCash flow information is as follows:\nYears Ended December 31,\n2020 2019\nCash provided by (used in):\nOperating activities $ 706,063 $ (1,899,877)\nInvesting activities (29,076) (142,864)\nFinancing activities (246,000) 455,286\nEffect of exchange rate changes 14,503 2,944\nNet increase (decrease) in cash and cash equivalents $ 445,490 $ (1,584,511)\nNet cash provided by operating activities totaled $0.7 million for the year ended December 31, 2020 compared with $1.9 million of net cash used in operating activities in the prior year period. The changes in net cash provided by and used by operating activities for each of the years ended December 31, 2020 and 2019, were primarily due to our net income (loss) and adjustments for net changes in operating assets and liabilities, primarily changes in our accounts receivable, deferred revenue, prepaid expenses, inventory, other assets, accounts payable, and other accrued expenses.\nNet cash used in investing activities totaled $0.0 million for the year ended December 31, 2020, compared with net cash used in investing activities of $0.1 million for the prior year period. Included in investing activities for the years ended December 31, 2020 and 2019 are purchases of property and equipment, intangible assets and cash received from security deposits.\nNet cash used in financing activities totaled $0.2 million for the year ended December 31, 2020, compared with net cash provided by financing activities of $0.5 million for the prior year period. Included in financing activities for the year ended December 31, 2020 are $0.8 million in proceeds from the PPP loan and the $1.0 million payoff of the term loan. Included in financing activities for the year ended December 31, 2019 are $0.9 million in proceeds from the issuance of our 2019 Term Loan in December 2019 and the partial repayment of $$0.5 million of principal under our Term Loan in January 2019.\nContractual Obligations\nAs of December 31, 2020, our significant commitments related to (i) the Amended and Restated Term Loan Credit Agreement, (ii) our operating leases for our office facilities, (iii) dividends (including accrued dividends) on our Series A Preferred Stock, and (iv) the potential redemption of the Series A Preferred Stock as discussed above.\nThe following is a schedule summarizing our significant obligations to make future payments under contractual obligations as of December 31, 2020 (at such date, the holders of the Series A Preferred Stock had not exercised their redemption rights):\nOperating Leases Note Payable (a) Interest Payments (a) Long-Term Income Tax Payable (b) Series A Preferred Stock Mandatory Redemption Dividends on Series A Preferred Stock\n2021 659,754 3,510,679 70,214 - - -\n2022 - 754,000 - - - -\nOther (b) - - - 513,027 9,000,000 4,906,673\nTotal contractual obligations $ 659,754 $ 4,264,679 $ 70,214 $ 513,027 $ 9,000,000 $ 4,906,673\nSublease income (530,447) - - - - -\nNet contractual obligations $ 129,307 $ 4,264,679 $ 70,214 $ 513,027 $ 9,000,000 $ 4,906,673\n(a) See Note (7) Notes Payable and Stock Warrants to our consolidated financial statements for further information.\n(b) Represents our liability for uncertain tax positions. We are unable to make a reasonably reliable estimate of the timing of payments due to uncertainties in the timing of tax audit outcomes.\nOff-Balance Sheet Arrangements\nAs of December 31, 2020 and 2019, we had no off-balance sheet arrangements.\nCritical Accounting Policies and Estimates\nOur critical accounting policies and estimates are those related to revenue recognition, accounts receivable allowances, deferred income taxes, accounting for share-based payments, goodwill and other intangible assets, software development costs, fair value measurements and litigation.\nRevenue Recognition. Our contracts with customers often include promises to transfer multiple products and services to a customer. Determining whether products and services are considered distinct performance obligations that should be accounted for separately versus together may require significant judgment.\nJudgment is required to determine the standalone selling price (“SSP”) for each distinct performance obligation. For products and services aside from maintenance and support, we estimate SSP by adjusting the list price by historical discount percentages. SSP for software and hardware maintenance and support fees is based on the stated percentages of the fees charged for the respective products.\nOur perpetual and term software licenses have significant standalone functionality and therefore revenue allocated to these performance obligations are recognized at a point in time upon electronic delivery of the download link and the license keys.\nProduct maintenance and support services are satisfied over time as they are stand-ready obligations throughout the support period. As a result, revenues associated with maintenance services are deferred and recognized as revenue ratably over the term of the contract.\nRevenues associated with professional services are recognized at a point in time upon customer acceptance.\nAccounts Receivable. We review accounts receivable to determine which receivables are doubtful of collection. In making the determination of the appropriate allowance for uncollectible accounts and returns, we consider (i) historical return rates, (ii) specific past due accounts, (iii) analysis of our accounts receivable aging, (iv) customer payment terms, (v) historical collections, write-offs and returns, (vi) changes in customer demand and relationships, (vii) actual cash collections on our accounts receivables and (viii) concentrations of credit risk and customer credit worthiness. When determining the appropriate allowance for uncollectable accounts and returns each period, the actual customer collections of outstanding account receivable balances impact the required allowance for returns. We recorded an expense of $0.0 million and $0.1 million for the years ended December 31, 2020 and 2019, respectively. These amounts are included within our consolidated statement of operations in each respective year. Changes in the product return rates, credit worthiness of customers, general economic conditions and other factors may impact the level of future write-offs, revenue and our general and administrative expenses.\nIncome Taxes. As discussed further in Note (5) Income Taxes, to our consolidated financial statements, in accordance with the authoritative guidance issued by the FASB on income taxes, we regularly evaluate our ability to recover deferred tax assets, and report such deferred tax assets at the amount that is determined to be more-likely-than-not recoverable. The Company records income taxes under the asset and liability method. Deferred tax assets and liabilities are recognized for future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be realized or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. In determining the period in which related tax benefits are realized for financial reporting purposes, excess share-based compensation deductions included in net operating losses are realized after regular net operating losses are exhausted.\nWe account for uncertain tax positions in accordance with the authoritative guidance issued by the FASB on income taxes, which addresses the determination of whether tax benefits claimed or expected to be claimed on a tax return, should be recorded in the financial statements. Pursuant to the authoritative guidance, we may recognize the tax benefit from an uncertain tax position only if it meets the “more likely than not” threshold that the position will be sustained on examination by the taxing authority, based on the technical merits of the position or under statute expirations. The tax benefits recognized in the financial statements from such a position should be measured based on the largest benefit that has a greater than fifty percent likelihood\nof being realized upon ultimate settlement. In addition, the authoritative guidance addresses de-recognition, classification, interest and penalties on income taxes, accounting in interim periods, and also requires increased disclosures.\nAccounting for Share-Based Payments. As discussed further in Note (10) Share-Based Payment Arrangements, to our consolidated financial statements, we account for share-based awards in accordance with the authoritative guidance issued by the FASB on stock compensation.\nWe have used and expect to continue to use the Black-Scholes option-pricing model to compute the estimated fair value of share-based compensation expense. We have used the Monte Carlo simulation model to compute the estimated fair value of share-based compensation expense for awards with a market condition. The Black-Scholes option-pricing model includes assumptions regarding dividend yields, expected volatility, expected option term and risk-free interest rates. The Monte Carlo simulation model includes assumptions regarding expected volatility, expected option term and risk-free interest rates. The assumptions used in computing the fair value of share-based compensation expense reflect our best estimates, but involve uncertainties relating to market and other conditions, many of which are outside of our control. We estimate expected volatility based primarily on historical daily price changes of our stock and other factors. The expected option term is the number of years that we estimate that the stock options will be outstanding prior to exercise. The estimated expected term of the stock awards issued has been determined pursuant to SEC Staff Accounting Bulletin SAB No. 110. If other assumptions or estimates had been used, the share-based compensation expense that was recorded for the years ended December 31, 2020 and 2019 could have been materially different. Furthermore, if different assumptions or estimates are used in future periods, share-based compensation expense could be materially impacted in the future.\nGoodwill. As discussed further in Note (1) Summary of Significant Accounting Policies, to our consolidated financial statements, we account for goodwill and other intangible assets in accordance with the authoritative guidance issued by the FASB on goodwill and other intangibles. The authoritative guidance requires an impairment-only approach to accounting for goodwill and other intangibles with an indefinite life. Absent any prior indicators of impairment, we perform an annual impairment analysis during the fourth quarter of each of our fiscal years.\nAs of both December 31, 2020 and 2019, we had $4.2 million of goodwill. As of both December 31, 2020 and 2019, we had $0.1 million (net of accumulated amortization), respectively, of other identifiable intangible assets. We do not amortize goodwill, but we assess for impairment at least annually on December 31st and more often if a trigger event occurs. In accordance with FASB Accounting Standards Codification (\"ASC\") 350, \"Goodwill and Other\" (\"ASC 350\") our goodwill impairment test includes only one step, which is a comparison of the carrying value of our one reporting unit to its fair value. Pursuant to ASC 350, any excess carrying value, up to the amount of goodwill allocated to that reporting unit, is impaired. At December 31, 2020 and 2019, the fair value of the Company's single reporting unit for purposes of its goodwill impairment test exceeded it carrying value and thus the Company determined there was no impairment of goodwill.\nSoftware Development Costs. As discussed further in Note (1) Summary of Significant Accounting Policies, to our consolidated financial statements, we account for software development costs in accordance with the authoritative guidance issued by the FASB on costs of software to be sold, leased or marketed.\nAs of December 31, 2020 and 2019, we had $0.0 million and $0.0 million, respectively, of software development costs, net of amortization. The authoritative guidance requires that the costs associated with the development of new software products and enhancements to existing software products be expensed as incurred until technological feasibility of the product has been established. Once technological feasibility is established, all software costs are capitalized until the product is available for general release to customers. Judgment is required in determining when technological feasibility of a product is established and assumptions are used that reflect our best estimates. If other assumptions had been used in the current period to estimate technological feasibility, the reported product development and enhancement expense could have been affected. Annual amortization of capitalized software costs is the greater of the amount computed using the ratio that current gross revenue for a product bear to the total of current and anticipated future gross revenue for that product or the straight-line method over the remaining estimated economic life of the software product, generally estimated to be five years from the date the product became available for general release to customers. Software development costs are reported at the lower of amortized cost or net realizable value. Net realizable value is computed as the estimated gross future revenue from each software solution less the amount of estimated future costs of completing and disposing of that product. Because the development of projected net future revenue related to our software solutions used in our net realizable value computation is based on estimates, a significant reduction in our future revenue could impact the recovery of our capitalized software development costs.\nFair Value Measurement. As discussed further in Note (3) Fair Value Measurements, to our consolidated financial statements, we determine fair value measurements of both financial and nonfinancial assets and liabilities in accordance with the authoritative guidance issued by the FASB on fair value measurements and disclosures. The FASB authoritative guidance establishes three levels of inputs that may be used to measure fair value. Each level of input has different levels of subjectivity and difficulty involved in determining fair value.\nLevel 1-Valuations based on quoted prices for identical assets and liabilities in active markets.\nLevel 2-Valuations based on observable inputs other than quoted prices included in Level 1, such as quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets and liabilities in markets that are not active, or other inputs that are observable or can be corroborated by observable market data.\nLevel 3-Valuations based on unobservable inputs reflecting our own assumptions, consistent with reasonably available assumptions made by other market participants. These valuations require significant judgment.\nOther-Than-Temporary Impairment\nAfter determining the fair value of our available-for-sale debt instruments, gains or losses on these investments are recorded to other comprehensive income, until either the investment is sold or we determine that the decline in value is other-than-temporary. Determining whether the decline in fair value is other-than-temporary requires management judgment based on the specific facts and circumstances of each investment. For investments in debt instruments, these judgments primarily consider the financial condition and liquidity of the issuer, the issuer’s credit rating, and any specific events that may cause us to believe that the debt instrument will not mature and be paid in full; and our ability and intent to hold the investment to maturity.\nLitigation. As discussed further in Note (13) Litigation, to our consolidated financial statements, in accordance with the authoritative guidance issued by the FASB on contingencies, we accrue anticipated costs of settlement, damages and losses for claims to the extent specific losses are probable and estimable. We record a receivable for insurance recoveries when such amounts are probable and collectable. In such cases, there may be an exposure to loss in excess of any amounts accrued. If, at the time of evaluation, the loss contingency related to a litigation is not both probable and estimable, the matter will continue to be monitored for further developments that would make such loss contingency both probable and estimable and, we will expense these costs as incurred. If the estimate of a probable loss is a range and no amount within the range is more likely, we will accrue the minimum amount of the range.\nImpact of Recently Issued Accounting Pronouncements\nSee Item 8 of Part II, Consolidated Financial Statements - Note (1) Summary of Significant Accounting Policies - Recently Issued Accounting Pronouncements.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nForeign Currency Risk. We have several offices outside the United States. Accordingly, we are subject to exposure from adverse movements in foreign currency exchange rates. For the years ended December 31, 2020 and 2019, approximately 64%, and 74%, respectively, of our sales were from outside North America. Not all of these transactions were made in foreign currencies. Our primary exposure is to fluctuations in exchange rates for the U.S. Dollar versus the Euro and the Japanese Yen, and to a lesser extent the Canadian Dollar, the Korean Won and the British Pound. Changes in exchange rates in the functional currency for each geographic area’s revenues are primarily offset by the related expenses associated with such revenues. However, changes in exchange rates of a particular currency could impact the re-measurement of such balances on our balance sheets.\nIf foreign currency exchange rates were to change adversely by 10% from the levels at December 31, 2020, the effect on our results before taxes from foreign currency fluctuations on our balance sheet would be approximately $1.9 million. The above analysis disregards the possibility that rates for different foreign currencies can move in opposite directions and that losses from one currency may be offset by gains from another currency.",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nIndex to Consolidated Financial Statements Page\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of December 31, 2020 and 2019\nConsolidated Statements of Operations for the years ended December 31, 2020 and 2019\nConsolidated Statements of Comprehensive Income (Loss) for the years ended December 31, 2020 and 2019\nConsolidated Statements of Stockholders’ Deficit for the years ended December 31, 2020 and 2019\nConsolidated Statements of Cash Flows for the years ended December 31, 2020 and 2019\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and Board of Directors of\nFalconStor Software, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of FalconStor Software, Inc. (the “Company”) as of December 31, 2020 and 2019, the related consolidated statements of operations, comprehensive income (loss), stockholders’ deficit and cash flows for each of the two years in the period ended December 31, 2020, and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2020 and 2019, and the results of its operations and its cash flows for each of the two years in the period ended December 31, 2020, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company's internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nRevenue from Contracts with Customers - Identification of Distinct Performance Obligations and Estimate of Standalone Selling Price\nAs described in Note 1 to the consolidated financial statements, the Company derives its revenue from sales of its products, support and services. Product revenue consists of the Company’s software integrated with industry standard hardware and sold as complete turn-key integrated solutions, as stand-alone software applications or sold on a subscription or consumption basis. Customers may purchase perpetual licenses or subscribe to licenses, which provide customers with the same functionality and differ mainly in the duration over which the customer benefits from the software. Licenses for on-premises software provide the customer with a right to use the software as it exists when made available to the customer. The Company’s contracts with customers often include promises to transfer multiple products and services to a customer. Determining whether products and services are considered distinct performance obligations that should be accounted for separately versus together may require significant judgment. Judgment is required to determine the standalone selling price (“SSP”) for each distinct performance obligation. For products and services aside from maintenance and support, the Company estimates SSP by adjusting the list price by historical discount percentages. SSP for software and hardware maintenance and support fees is based on the stated percentages of the fees charged for the respective products.\nThe principal considerations for our determination that performing procedures relating to revenue recognition, specifically related to management’s identification of distinct performance obligations and their estimate of standalone selling price, is a critical audit matter are that there was significant judgment by management in both the identification of distinct performance obligations, specifically the determination that the on-premises software is determined to be a distinct performance obligation from support, and in estimating the standalone selling price using market pricing conditions and other observable inputs, such as historical pricing practices, for each distinct performance obligation. This in turn led to a high degree of auditor judgment, subjectivity and effort in performing procedures and evaluating audit evidence related to management’s identification of distinct performance obligations within contracts with customers and the judgments made by management used to estimate the standalone selling price used to allocate the transaction price to the distinct performance obligations.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included, among others, (i) evaluating the Company’s revenue recognition accounting policy; (ii) testing management’s identification of distinct performance obligations in its contracts with customers; (iii) testing management’s process for estimating standalone selling price which included testing the completeness and accuracy of input data used and evaluating the reasonableness of significant assumptions used by management, principally market and pricing conditions and other observable inputs such as historical pricing practices; and (iv) evaluation of the accuracy of management’s allocation of transaction price to the performance obligations contained within a sample of contracts with customers.\n/s/ Marcum llp\nMarcum llp\nWe have served as the Company’s auditor since 2019.\nCosta Mesa, CA\nMarch 10, 2021\nFALCONSTOR SOFTWARE, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nDecember 31,\n2020 2019\nAssets\nCurrent assets:\nCash and cash equivalents $ 1,920,656 $ 1,475,166\nAccounts receivable, net of allowances 2,836,571 3,406,550\nPrepaid expenses and other current assets 1,837,596 2,252,372\nInventory 15,275 30,014\nContract assets 254,483 749,515\nTotal current assets 6,864,581 7,913,617\nProperty and equipment, net of accumulated depreciation and amortization 197,020 369,273\nOperating lease right-of-use assets, net 536,272 1,842,254\nDeferred tax assets 330,552 258,841\nSoftware development costs, net 19,278 27,012\nOther assets 863,964 829,335\nGoodwill 4,150,339 4,150,339\nOther intangible assets, net 100,134 57,718\nLong-term contract assets 343,934 327,757\nTotal assets $ 13,406,074 $ 15,776,146\nLiabilities and Stockholders' Deficit\nCurrent liabilities:\nAccounts payable $ 453,791 $ 1,302,290\nAccrued expenses 2,293,765 2,533,824\nCurrent portion of operating lease liabilities 665,074 1,655,522\nShort-term loan, net of debt issuance costs and discounts 3,320,863 947,501\nDeferred revenue, net 4,603,270 5,270,190\nTotal current liabilities 11,336,763 11,709,327\nOther long-term liabilities 703,889 745,254\nNotes payable, net of debt issuance costs and discounts 754,000 2,906,133\nOperating lease liabilities, less current portion - 624,859\nDeferred tax liabilities 513,027 432,520\nDeferred revenue 1,765,859 2,085,080\nTotal liabilities 15,073,538 18,503,173\nCommitments and contingencies (Note 11)\nSeries A redeemable convertible preferred stock, $0.001 par value, 2,000,000 shares authorized, 900,000 shares issued and outstanding, redemption value of $13,346,577 and $12,262,685, respectively\n12,940,722 11,304,279\nStockholders' equity:\nCommon stock - $0.001 par value, 30,000,000 shares authorized, 5,949,463 and 5,918,733 shares issued and outstanding, respectively\n5,949 5,919\nAdditional paid-in capital 110,107,170 111,727,888\nAccumulated deficit (122,733,344) (123,871,853)\nAccumulated other comprehensive loss, net (1,987,961) (1,893,260)\nTotal stockholders' deficit (14,608,186) (14,031,306)\nTotal liabilities and stockholders' deficit $ 13,406,074 $ 15,776,146\nSee accompanying notes to consolidated financial statements.\nFALCONSTOR SOFTWARE, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYears Ended December 31,\n2020 2019\nRevenue:\nProduct revenue $ 7,097,695 $ 6,767,595\nSupport and services revenue 7,670,998 9,775,976\nTotal revenue 14,768,693 16,543,571\nCost of revenue:\nProduct 297,555 721,122\nSupport and service 1,529,923 2,191,865\nTotal cost of revenue 1,827,478 2,912,987\nGross profit 12,941,215 13,630,584\nOperating expenses:\nResearch and development costs 2,467,783 3,208,921\nSelling and marketing 4,601,228 4,337,054\nGeneral and administrative 3,022,350 5,635,273\nRestructuring costs 1,032,826 1,104,318\nTotal operating expenses 11,124,187 14,285,566\nOperating income (loss) 1,817,028 (654,982)\nInterest and other expense (692,838) (604,647)\nIncome (loss) before income taxes 1,124,190 (1,259,629)\nIncome tax expense (benefit) (14,319) 492,325\nNet income (loss) $ 1,138,509 $ (1,751,954)\nLess: Accrual of Series A redeemable convertible preferred stock dividends 1,083,892 1,157,762\nLess: Accretion to redemption value of Series A redeemable convertible preferred stock 552,551 389,811\nNet income (loss) attributable to common stockholders $ (497,934) $ (3,299,527)\nBasic net income (loss) per share attributable to common stockholders $ (0.08) $ (0.56)\nDiluted net income (loss) per share attributable to common stockholders $ (0.08) $ (0.56)\nWeighted average basic shares outstanding 5,920,517 5,900,621\nWeighted average diluted shares outstanding 5,920,517 5,900,621\nSee accompanying notes to consolidated financial statements.\nFALCONSTOR SOFTWARE, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME (LOSS)\nYears Ended December 31,\n2020 2019\nNet income (loss) $ 1,138,509 $ (1,751,954)\nOther comprehensive income (loss), net of applicable taxes:\nForeign currency translation (68,854) (4,921)\nNet minimum pension liability (25,847) 6,763\nTotal other comprehensive income (loss), net of applicable taxes (94,701) 1,842\nTotal comprehensive income (loss) $ 1,043,808 $ (1,750,112)\nLess: Accrual of Series A redeemable convertible preferred stock dividends 1,083,892 1,157,762\nLess: Accretion to redemption value of Series A redeemable convertible preferred stock 552,551 389,811\nTotal comprehensive income (loss) attributable to common stockholders $ (592,635) $ (3,297,685)\nSee accompanying notes to consolidated financial statements.\nFALCONSTOR SOFTWARE, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS' DEFICIT\nCommon Stock Outstanding Common Stock Additional Paid-In Capital Accumulated Deficit Accumulated Other Comprehensive Loss, Net Total Stockholders' Deficit\nBalance at December 31, 2018 5,872,552 $ 5,873 $ 113,243,227 $ (122,119,899) $ (1,895,102) $ (10,765,901)\nNet income (loss) (1,751,954) (1,751,954)\nRestricted stock issued 31,000 31 (31) -\nWarrants exercised 15,181 15 (15) -\nShare-based compensation 32,280 32,280\nAccretion of Series A redeemable convertible preferred stock (389,811) (389,811)\nDividends on Series A redeemable convertible preferred stock (1,157,762) (1,157,762)\nForeign currency translation (4,921) (4,921)\nNet minimum pension liability 6,763 6,763\nBalance at December 31, 2019 5,918,733 $ 5,919 $ 111,727,888 $ (123,871,853) $ (1,893,260) $ (14,031,306)\nNet income (loss) 1,138,509 1,138,509\nRestricted stock issued 30,730 30 (30) -\nShare-based compensation 15,755 15,755\nAccretion of Series A redeemable convertible preferred stock (552,551) (552,551)\nDividends on Series A redeemable convertible preferred stock (1,083,892) (1,083,892)\nForeign currency translation (68,854) (68,854)\nNet minimum pension liability (25,847) (25,847)\nBalance at December 31, 2020 5,949,463 $ 5,949 $ 110,107,170 $ (122,733,344) $ (1,987,961) $ (14,608,186)\nSee accompanying notes to consolidated financial statements.\nFALCONSTOR SOFTWARE, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYears Ended December 31,\n2020 2019\nCash flows from operating activities:\nNet income (loss) $ 1,138,509 $ (1,751,954)\nAdjustments to reconcile net income (loss) to net cash provided by (used in) operating activities:\nDepreciation and amortization 224,518 399,798\nShare-based payment compensation 15,755 32,280\nProvision for returns and doubtful accounts 4,464 148,624\nAmortization of debt discount on notes payable 467,229 273,521\nAmortization of right of use assets 1,305,982 1,049,479\nDeferred income tax provision 8,820 412,445\nChanges in operating assets and liabilities:\nAccounts receivable 577,259 54,857\nPrepaid expenses and other current assets 353,689 (337,712)\nContract assets 478,855 76,549\nInventory 15,889 (14,305)\nOther assets (389) 1,403\nAccounts payable (911,352) 730,324\nAccrued expenses and other long-term liabilities (339,399) (413,998)\nDeferred revenue (1,018,459) (1,238,212)\nOperating lease liabilities (1,615,307) (1,322,976)\nNet cash provided by (used in) operating activities 706,063 (1,899,877)\nCash flows from investing activities:\nPurchases of property and equipment - (171,680)\nSecurity deposits 51,734 84,678\nPurchase of intangible assets (80,810) (55,862)\nNet cash provided by (used in) investing activities (29,076) (142,864)\nCash flows from financing activities:\nProceeds from issuance of short-term debt, net of issuance costs - 944,607\nProceeds from issuance PPP Loan 754,000 -\nPayments of long term-debt (1,000,000) (489,321)\nNet cash provided by (used in) financing activities (246,000) 455,286\nEffect of exchange rate changes on cash and cash equivalents 14,503 2,944\nNet increase (decrease) in cash and cash equivalents 445,490 (1,584,511)\nCash and cash equivalents, beginning of year 1,475,166 3,059,677\nCash and cash equivalents, end of year $ 1,920,656 $ 1,475,166\nSupplemental Disclosures:\nCash paid for interest $ 291,821 $ 237,176\nCash paid for income taxes, net $ - $ -\nNon-cash financing activities:\nUndistributed Series A redeemable convertible preferred stock dividends $ 1,083,892 $ 1,157,762\nAccretion of Series A redeemable convertible preferred stock $ 552,551 $ 389,811\nSee accompanying notes to consolidated financial statements.\nFALCONSTOR SOFTWARE, INC. AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nDecember 31, 2020\n(1) Summary of Significant Accounting Policies\n(a)The Company and Nature of Operations\nFalconStor Software, Inc., a Delaware corporation (the \"Company\" or \"FalconStor\"), is a leading storage software company offering a converged data services software platform that is hardware agnostic. The Company develops and sells data migration, business continuity, disaster recovery, optimized backup and de-duplication solutions and provides the related maintenance, implementation and engineering services.\n(b)Liquidity\nAs of December 31, 2020, we had a working capital deficiency of $4.5 million, which is inclusive of current deferred revenue of $4.6 million, and a stockholders' deficit of $14.6 million. During the year ended December 31, 2020, while we had net income of $1.1 million and positive cash flow from operations of $0.7 million. Our cash and cash equivalents at December 31, 2020 was $1.9 million, an increase of $0.4 million as compared to December 31, 2019. On April 28, 2020, the Company entered into a loan with Peapack-Gladstone Bank in an aggregate principal amount of $754,000 (the \"Loan\"), pursuant to the Paycheck Protection Program (the \"PPP\") under the Coronavirus Aid, Relief, and Economic Security Act (the \"CARES Act\").\nThe Company’s principal sources of liquidity at December 31, 2020 consisted of cash and future cash anticipated to be generated from operations. The Company generated positive net income and cash flows from operations during the year ended December 31, 2020. Although the Company reported negative working capital as of December 31, 2020, it was primarily due to notes payable and deferred revenue. The Company’s loan agreement with Hale Capital Partners and affiliated entities (“HCP”) mature in June 2021 and the Series A Convertible Preferred Stock, also held by HCP, is subject to redemption in July 2021. The Company intends to renegotiate with HCP, if necessary, and extend the maturity dates of the loan balances and the redemption date of the Series A Preferred Stock to at least April 1, 2022. The Company believes its current cash balances together with anticipated cash flows from operating activities, and its plans to extend the maturity of its borrowings and preferred stock will be sufficient to meet its working capital requirements for at least one year from the date the consolidated financial statements were available to be issued.\n(c)Impact of the COVID-19 Pandemic\nWe are continuing to monitor the impact of COVID-19, on all aspects of our business. The outbreak of COVID-19 has caused and may continue to cause travel bans or disruptions, and in some cases, prohibitions of non-essential activities, disruption and shutdown of businesses and greater uncertainty in global financial markets. The impact of COVID-19 is fluid and uncertain, but it has caused and may continue to cause various negative effects, including an inability to meet with actual or potential customers, our end customers deciding to delay or abandon their planned purchases or failing to make payments, and delays or disruptions in our or our partners’ supply chains. As a result, we may experience extended sales cycles, our ability to close transactions with new and existing customers and partners may be negatively impacted, our ability to recognize revenue from software transactions we do close may be negatively impacted, our demand generation activities, and the efficiency and effect of those activities, may be negatively affected, and it has been and, until the COVID-19 outbreak is contained, will continue to be more difficult for us to forecast our operating results. These uncertainties have, and may continue to, put pressure on global economic conditions and overall IT spending and may cause our end customers to modify spending priorities or delay or abandon purchasing decisions, thereby lengthening sales cycles and potentially lowering prices for our solutions, and may make it difficult for us to forecast our sales and operating results and to make decisions about future investments, any of which could materially harm our business, operating results and financial condition.\nFurther, our management team is focused on addressing the impacts of COVID-19 on our business, which has required and will continue to require, a large investment of their time and resources and may distract our management team or disrupt our 2021 operating plans. The extent to which COVID-19 ultimately impacts our results of operations, cash flow and financial position will depend on future developments, which are uncertain and cannot be predicted, including, but not limited to, the duration and spread of the outbreak, its severity, the actions taken by governments and authorities to contain the virus or treat its impact, and how quickly and to what extent normal economic and operating conditions can resume. Even after the\nCOVID-19 pandemic has subsided, we may continue to experience materially adverse impacts to our business as a result of its global economic impact, including as a result of any recession that may occur.\n(d)Principles of Consolidation\nThe consolidated financial statements include the accounts of the Company and its wholly-owned subsidiaries. All significant intercompany balances and transactions have been eliminated in consolidation.\n(e) Use of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America (\"GAAP\") requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. The Company’s significant estimates include those related to revenue recognition, accounts receivable allowances, share-based payment compensation, valuation of derivatives, capitalizable software development costs, valuation of goodwill and other intangible assets and income taxes. During the first quarter of 2018, the Company also had significant estimates in the determination of the fair value of Series A Redeemable Convertible Preferred Stock (\"Series A Preferred Stock\"), notes payable and warrants issued. Actual results could differ from those estimates.\nThe financial market volatility in many countries where the Company operates has impacted and may continue to impact the Company’s business. Such conditions could have a material impact on the Company’s significant accounting estimates discussed above.\n(f)Fair Value of Financial Instruments\nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. To increase the comparability of fair value measurements, a three-tier fair value hierarchy, which prioritizes the inputs used in the valuation methodologies, is as follows:\nLevel 1-Valuations based on quoted prices for identical assets and liabilities in active markets.\nLevel 2-Valuations based on observable inputs other than quoted prices included in Level 1, such as quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets and liabilities in markets that are not active, or other inputs that are observable or can be corroborated by observable market data.\nLevel 3-Valuations based on unobservable inputs reflecting our own assumptions, consistent with reasonably available assumptions made by other market participants. These valuations require significant judgment.\nAs of December 31, 2020 and 2019, the fair value of the Company’s financial instruments including cash and cash equivalents, accounts receivable, accounts payable and accrued expenses approximated carrying value due to the short maturity of these instruments. See Note (3) Fair Value Measurements for additional information.\n(g)Derivative Financial Instruments\nThe Company does not use derivative instruments to hedge exposures to cash flow, market or foreign currency risk. Terms of convertible preferred stock are reviewed to determine whether or not they contain embedded derivative instruments that are required under Financial Accounting Standards Board (\"FASB\") Accounting Standards Codification (\"ASC\") 815 “Derivatives and Hedging” (“ASC 815”) to be accounted for separately from the host contract, and recorded on the balance sheet at fair value. The fair value of derivatives are required to be revalued at each reporting date, with corresponding changes in fair value recorded in current period operating results. See Note (12) Derivative Financial Instruments for additional information.\n(h)Revenue from Contracts with Customers and Associated Balances\nThe Company derives its revenue from sales of its products, support and services. Product revenue consists of the Company’s software integrated with industry standard hardware and sold as complete turn-key integrated solutions, as stand-alone software applications or sold on a subscription or consumption basis. Depending on the nature of the arrangement revenue, related to turn-key solutions and stand-alone software applications are generally recognized upon shipment and\ndelivery of license keys. For certain arrangements revenue is recognized based on usage or ratably over the term of the arrangement. Support and services revenue consists of both maintenance revenues and professional services revenues. Revenue is recorded net of applicable sales taxes.\nIn accordance with the authoritative guidance issued by the FASB on revenue recognition, the Company recognizes revenue when persuasive evidence of an arrangement exists, the fee is fixed or determinable, delivery has occurred, and collection of the resulting receivable is deemed probable. Products delivered to a customer on a trial basis are not recognized as revenue until the trial period has ended and acceptance has occurred by the customer. Reseller and distributor customers typically send the Company a purchase order when they have an end user identified.\nNature of Products and Services\nLicenses for on-premises software provide the customer with a right to use the software as it exists when made available to the customer. Customers may purchase perpetual licenses or subscribe to licenses, which provide customers with the same functionality and differ mainly in the duration over which the customer benefits from the software. Revenue from distinct on-premises licenses is recognized upfront at the point in time when the software is made available to the customer. Revenue allocated to software maintenance and support services is recognized ratably over the contractual support period.\nHardware products consist primarily of servers and associated components and function independently of the software products and as such as accounted for as separate performance obligations. Revenue allocated to hardware maintenance and support services is recognized ratably over the contractual support period.\nProfessional services are primarily related to software implementation services and associated revenue is recognized upon customer acceptance.\nContract Balances\nTiming of revenue recognition may differ from the timing of invoicing to customers. The Company records a contract asset or receivable when revenue is recognized prior to invoicing, or unearned revenue when revenue is recognized subsequent to invoicing. For perpetual licenses with multi-year product maintenance agreements, the Company generally invoices customers at the beginning of the coverage period. For multi-year subscription licenses, the Company generally invoices customers annually at the beginning of each annual coverage period. The Company records a contract asset related to revenue recognized for multi-year on-premises licenses as its right to payment is conditioned upon providing product support and services in future years.\nAs of December 31, 2020 and 2019, accounts receivable, net of allowance for doubtful accounts, was $2.8 million and $3.4 million, respectively. Our allowance for doubtful accounts on accounts receivable was $0.2 million as of December 31, 2020 and 2019. As of December 31, 2020 and 2019, short and long-term contract assets, net of allowance for doubtful accounts, was $0.6 million and $1.1 million, respectively. Our allowance for doubtful accounts on contract assets as of December 31, 2020 was nil.\nThe allowances for doubtful accounts reflect the Company’s best estimates of probable losses inherent in the accounts receivable and contract assets’ balances. The Company determines the allowances based on known troubled accounts, historical experience, and other currently available evidence. Write-offs in the accounts receivable and contract assets allowance accounts during the years ended December 31, 2020 and 2019 were $0.1 million and $0.0 million, respectively.\nDeferred revenue is comprised mainly of unearned revenue related maintenance and technical support on term and perpetual licenses. Maintenance and technical support revenue is recognized ratably over the coverage period. Deferred revenue also includes contracts for professional services to be performed in the future which are recognized as revenue when the company delivers the related service pursuant to the terms of the customer arrangement.\nChanges in deferred revenue were as follows:\nTwelve Months Ended December 31, 2020\nBalance at December 31, 2019 $ 7,355,270\nDeferral of revenue 13,773,421\nRecognition of revenue (14,768,693)\nChange in reserves 9,131\nBalance at December 31, 2020 $ 6,369,129\nDeferred revenue includes invoiced revenue allocated to remaining performance obligations that has not yet been recognized and will be recognized as revenue in future periods. Deferred revenue was $6.4 million as of December 31, 2020, of which the Company expects to recognize approximately 72.3% of the revenue over the next 12 months and the remainder thereafter.\nApproximately $2.1 million of revenue is expected to be recognized from remaining performance obligations for unbilled support and services as of December 31, 2020. We expected to recognize revenue on approximately 36% of these remaining performance obligations over the next twelve months, with the balance recognized thereafter.\nPayment terms and conditions vary by contract type, although terms generally include a requirement of payment within 30 to 90 days. In instances where the timing of revenue recognition differs from the timing of invoicing, the Company has determined its contracts generally do not include a significant financing component. The primary purpose of the Company’s invoicing terms is to provide customers with simplified and predictable ways of purchasing its products and services, not to receive financing from our customers or to provide customers with financing. Examples include invoicing at the beginning of a subscription term with maintenance and support revenue recognized ratably over the contract period, and multi-year on-premises licenses that are invoiced annually with product revenue recognized upon delivery.\nSignificant Judgments\nThe Company’s contracts with customers often include promises to transfer multiple products and services to a customer. Determining whether products and services are considered distinct performance obligations that should be accounted for separately versus together may require significant judgment.\nJudgment is required to determine the standalone selling price (“SSP”) for each distinct performance obligation. For products and services aside from maintenance and support, the Company estimates SSP by adjusting the list price by historical discount percentages. SSP for software and hardware maintenance and support fees is based on the stated percentages of the fees charged for the respective products.\nThe Company’s perpetual and term software licenses have significant standalone functionality and therefore revenue allocated to these performance obligations are recognized at a point in time upon electronic delivery of the download link and the license keys.\nProduct maintenance and support services are satisfied over time as they are stand-ready obligations throughout the support period. As a result, revenues associated with maintenance services are deferred and recognized as revenue ratably over the term of the contract.\nRevenues associated with professional services are recognized at a point in time upon customer acceptance.\nDisaggregation of Revenue\nPlease refer to the consolidated statements of operations and note 16, segment reporting and concentrations, for discussion on revenue disaggregation by product type and by geography. The Company believes this level of disaggregation sufficiently depicts how the nature, amount, timing and uncertainty of our revenue and cash flows are affected by economic factors.\nAssets Recognized from Costs to Obtain a Contract with a Customer\nThe Company recognizes an asset for the incremental costs of obtaining a contract with a customer if it expects the benefit of those costs to be longer than one year. The Company has determined that its sales commission program meets the requirements for cost capitalization. Total capitalized costs to obtain a contract were immaterial during the periods presented and are included in other current and long-term assets on our consolidated balance sheets. The Company applies a practical\nexpedient to expense costs as incurred for costs to obtain a contract with a customer when the amortization period would have been one year or less.\n(i)Leases\nWe have entered into operating leases for our various facilities. We determine if an arrangement is a lease at inception. Operating leases are included in Right-of-Use (\"ROU\") assets, and lease liability obligations in our condensed consolidated balance sheets. ROU assets represent our right to use an underlying asset for the lease term and lease liability obligations represent our obligation to make lease payments arising from the lease. ROU assets and liabilities are recognized at commencement date based on the present value of lease payments over the lease term. We have lease agreements with lease and non-lease components and account for such components as a single lease component. As most of our leases do not provide an implicit rate, we estimated our incremental borrowing rate based on the information available at commencement date in determining the present value of lease payments. We use the implicit rate when readily determinable. The ROU asset also includes any lease payments made and excludes lease incentives and lease direct costs. Our lease terms may include options to extend or terminate the lease. Such extended terms have been considered in determining the ROU assets and lease liability obligations when it is reasonably certain that we will exercise that option. Lease expense is recognized on a straight-line basis over the lease term.\nRight of Use Assets and Liabilities\nWe have various operating leases for office facilities that expire through 2021. Below is a summary of our right of use assets and liabilities as of December 31, 2020.\nRight of use assets $ 536,272\nLease liability obligations, current 665,074\nLease liability obligations, less current portion -\nTotal lease liability obligations $ 665,074\nWeighted-average remaining lease term 0.44\nWeighted-average discount rate 5.95 %\nOur operating lease costs for the year ended December 31, 2020 were as follows:\nYears Ended December 31,\n2020 2019\nComponents of lease expense:\nOperating lease cost 1,794,187 2,495,865\nSublease income (505,626) (623,776)\nNet lease cost $ 1,288,561 $ 1,872,089\nDuring the year ended December 31, 2020, operating cash flows from operating leases was approximately $1.5 million.\nApproximate future minimum lease payments for our right of use assets over the remaining lease periods as of December 31, are as follows:\n2021 659,754\nTotal minimum lease payments 659,754\nLess interest 5,320\nPresent value of lease liabilities 665,074\n(j)Property and Equipment\nProperty and equipment are recorded at cost. Depreciation is recognized using the straight-line method over the estimated useful lives of the assets (3 to 7 years). Leasehold improvements are amortized on a straight-line basis over the terms of the respective leases or over their estimated useful lives, whichever is shorter.\n(k)Goodwill and Other Intangible Assets\nGoodwill represents the excess of the purchase price over the estimated fair value of net tangible and identifiable intangible assets acquired in business combinations. The Company has not amortized goodwill related to its acquisitions, but instead tests the balance for impairment. The Company evaluates goodwill for impairment annually or more frequently when an event occurs or circumstances change that indicate that the carrying value may not be recoverable. The Company tests goodwill for impairment by first comparing the book value of net assets to the fair value of the reporting unit. If the fair value is determined to be less than the book value or qualitative factors indicate that it is more likely than not that goodwill is impaired, a second step is performed to compute the amount of impairment as the difference between the estimated fair value of goodwill and the carrying value.\nThe fair value of the Company's single reporting unit for purposes of its goodwill impairment test exceeded its carrying value as of December 31, 2020 and 2019 and thus the Company determined there was no impairment of goodwill. As of December 31, 2020 and 2019, the Company's single reporting unit for purposes of its goodwill impairment test had a negative carrying value and thus the Company determined there was no impairment of goodwill.\nIdentifiable intangible assets include (i) assets acquired through business combinations, which include customer contracts and intellectual property, and (ii) patents amortized over three years using the straight-line method.\nThe gross carrying amount and accumulated amortization of goodwill and other intangible assets as of December 31, 2020 and 2019 are as follows:\nDecember 31, 2020 December 31, 2019\nGoodwill $ 4,150,339 $ 4,150,339\nOther intangible assets:\nGross carrying amount $ 4,027,912 $ 3,947,103\nAccumulated amortization (3,927,778) (3,889,385)\nNet carrying amount $ 100,134 $ 57,718\nFor the years ended December 31, 2020 and 2019, amortization expense was $38,393 and $89,478, respectively. As of December 31, 2020, amortization expense for existing identifiable intangible assets is expected to be $56,747, $30,220 and $13,167 for the years ended December 31, 2021, 2022 and 2023, respectively. Such assets will be fully amortized at December 31, 2023.\n(l)Software Development Costs and Purchased Software Technology\nIn accordance with the authoritative guidance issued by the FASB on costs of software to be sold, leased, or marketed, costs associated with the development of new software products and enhancements to existing software products are expensed as incurred until technological feasibility of the product has been established. Based on the Company’s product development process, technological feasibility is established upon completion of a working model. Amortization of software development costs is recorded at the greater of the straight-line basis over the product’s estimated life, or the ratio of current period revenue of the related products to total current and anticipated future revenue of these products. The gross carrying amount and accumulated amortization of software development costs as of December 31, 2020 and 2019 are as follows:\nDecember 31, 2020 December 31, 2019\nSoftware development costs:\nGross carrying amount $ 2,950,132 $ 2,950,132\nAccumulated amortization (2,930,854) (2,923,120)\nSoftware development costs, net $ 19,278 $ 27,012\nDuring the years ended December 31, 2020 and 2019, the Company recorded $7,734 and $61,756, respectively, of amortization expense related to capitalized software costs. As of December 31, 2020, amortization expense for software development costs is expected to be $6,583, $6,583 and $6,112 for the years ended December 31, 2021, 2022 and 2023, respectively. Such assets will be fully amortized at December 31, 2023.\n(m)Income Taxes\nThe Company records income taxes under the asset and liability method. Deferred tax assets and liabilities are recognized for future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be realized or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. In determining the period in which related tax benefits are realized for financial reporting purposes, excess share-based compensation deductions included in net operating losses are realized after regular net operating losses are exhausted.\nThe Company accounts for uncertain tax positions in accordance with the authoritative guidance issued by the FASB on income taxes, which addresses the determination of whether tax benefits claimed or expected to be claimed on a tax return, should be recorded in the financial statements. Pursuant to the authoritative guidance, the Company may recognize the tax benefit from an uncertain tax position only if it meets the “more likely than not” threshold that the position will be sustained on examination by the taxing authority, based on the technical merits of the position or under statute expirations. The tax benefits recognized in the financial statements from such a position should be measured based on the largest benefit that has a greater than fifty percent likelihood of being realized upon ultimate settlement. In addition, the authoritative guidance addresses de-recognition, classification, interest and penalties on income taxes, accounting in interim periods, and also requires increased disclosures. See Note (5) Income Taxes Taxes for additional information.\n(n)Long-Lived Assets\nThe Company reviews its long-lived assets for impairment whenever events or changes in circumstances indicate that the carrying amount of the asset may not be recoverable. If the sum of the expected future cash flows, undiscounted and without interest, is less than the carrying amount of the asset, an impairment loss is recognized as the amount by which the carrying amount of the asset exceeds its fair value.\n(o)Share-Based Payments\nThe Company accounts for share-based payments in accordance with the authoritative guidance issued by the FASB on share-based compensation, which establishes the accounting for transactions in which an entity exchanges its equity instruments for goods or services. Under the provisions of the authoritative guidance, share-based compensation expense is measured at the grant date, based on the fair value of the award, and is recognized as an expense over the requisite employee service period (generally the vesting period), net of actual forfeitures. For share-based payment awards that contain performance criteria share-based compensation, expense is recorded when the achievement of the performance condition is considered probable of achievement and is recorded on a straight-line basis over the requisite service period. If such performance criteria are not met, no compensation cost is recognized and any recognized compensation cost is reversed. The Company estimates the fair value of share-based payments using the Black-Scholes option-pricing model or the Monte Carlo simulation model if a market condition exists. Share-based compensation expense for a share-based payment award with a market condition is recorded on a straight-line basis over the longer of the explicit service period or the service period derived from the Monte Carlo simulation. Additionally, share-based awards to non-employees are expensed over the period in which the related services are rendered at their fair value. All share-based awards are expected to be fulfilled with new shares of common stock.\n(p)Foreign Currency\nAssets and liabilities of foreign operations are translated at rates of exchange at the end of the period, while results of operations are translated at average exchange rates in effect for the period. Gains and losses from the translation of foreign assets and liabilities from the functional currency of the Company’s subsidiaries into the U.S. dollar are classified as accumulated other comprehensive loss in stockholders’ deficit. Gains and losses from foreign currency transactions are included in the consolidated statements of operations within interest and other loss, net. During the years ended December 31, 2020 and 2019, foreign currency transactional losses totaled approximately $7,963 and $158,148, respectively.\n(q)Earnings Per Share (EPS)\nBasic EPS is computed based on the weighted average number of shares of common stock outstanding. Diluted EPS is computed based on the weighted average number of common shares outstanding increased by dilutive common stock equivalents, attributable to stock option awards, restricted stock awards and Series A redeemable convertible preferred stock outstanding.\nThe following represents the common stock equivalents that were excluded from the computation of diluted shares outstanding because their effect would have been anti-dilutive for the years ended December 31, 2020 and 2019:\nYear Ended December 31,\n2020 2019\nStock options, warrants and restricted stock 1,395,993 1,263,009\nSeries A redeemable convertible preferred stock 87,815 87,815\nTotal anti-dilutive common stock equivalents 1,483,808 1,350,824\nThe following represents a reconciliation of the numerators and denominators of the basic and diluted EPS computation:\nYear Ended December 31,\n2020 2019\nNumerator:\nNet income (loss) $ 1,138,509 $ (1,751,954)\nEffects of Series A redeemable convertible preferred stock:\nLess: Accrual of Series A redeemable convertible preferred stock dividends 1,083,892 1,157,762\nLess: Accretion to redemption value of Series A redeemable convertible preferred stock 552,551 389,811\nNet income (loss) attributable to common stockholders $ (497,934) $ (3,299,527)\nDenominator:\nWeighted average basic shares outstanding 5,920,517 5,900,621\nWeighted average diluted shares outstanding 5,920,517 5,900,621\nEPS:\nBasic net income (loss) per share attributable to common stockholders $ (0.08) $ (0.56)\nDiluted net income (loss) per share attributable to common stockholders $ (0.08) $ (0.56)\n(r)Investments\nAs of December 31, 2020 and 2019, the Company did not have any cost-method investments.\n(s) Recently Issued Accounting Pronouncements\nIn August 2018, the FASB issued ASU 2018-14, Compensation-Retirement Benefits-Defined Benefit Plans-General: Disclosure Framework-Changes to the Disclosure Requirements for Defined Benefit Plans. The objective of the guidance is to improve the effectiveness of disclosure requirements on defined benefit pension plans and other postretirement plans. The guidance is effective for fiscal years beginning after December 15, 2020. The Company does not expect adoption of the new standard to have a material impact on its Condensed Consolidated Financial Statements.\nIn December 2019, the FASB released ASU 2019-12, which affects general principles within Topic 740, Income Taxes. The amendments of ASU 2019-12 are meant to simplify and reduce the cost of accounting for income taxes. The amendments in ASU 2019-12 are effective for public business entities for fiscal years beginning after December 15, 2020, including interim periods therein. Early adoption of the standard is permitted, including adoption in interim or annual periods for which financial statements have not yet been issued. The Company does not expect adoption of the new standard to have a material impact on its Condensed Consolidated Financial Statements.\nIn August 2020, the Financial Accounting Standards Board, or FASB, issued ASU 2020-06, regarding ASC Topic 470 “Debt” and ASC Topic 815 “Derivatives and Hedging,” which reduces the number of accounting models for convertible instruments and amends the calculation of diluted earnings per share for convertible instruments, among other changes. The guidance is effective for smaller reporting companies as defined by the SEC, for annual reporting periods beginning after December 15, 2023, including interim periods within that reporting period. Early adoption is permitted. We are currently evaluating the impact of the adoption of this standard on our consolidated financial statements.\n(2) Property and Equipment\nProperty and equipment consist of the following:\nDecember 31, 2020 December 31, 2019\nComputer hardware and software $ 16,456,790 $ 16,418,916\nFurniture and equipment 604,300 601,928\nLeasehold improvements 1,730,751 1,715,041\nProperty and equipment, gross 18,791,841 18,735,885\nLess accumulated depreciation and amortization (18,594,821) (18,366,612)\nProperty and equipment, net $ 197,020 $ 369,273\nDuring the years ended December 31, 2020 and December 31, 2019, the Company did not write off fixed assets or related accumulated depreciation.\nDepreciation and amortization expense was $178,391 and $248,564 in 2020 and 2019, respectively.\n(3) Fair Value Measurements\nThe Company measures its cash equivalents, marketable securities and derivative instruments at fair value. Fair value is an exit price, representing the amount that would be received on the sale of an asset or that would be paid to transfer a liability in an orderly transaction between market participants. As a basis for considering such assumptions, the Company utilizes a three-tier fair value hierarchy, which prioritizes the inputs used in the valuation methodologies in measuring fair value.\nFair Value Hierarchy\nThe methodology for measuring fair value specifies a hierarchy of valuation techniques based upon whether the inputs to those valuation techniques reflect assumptions other market participants would use based upon market data obtained from independent sources (observable inputs) or reflect the Company’s own assumptions of market participant valuation (unobservable inputs). As a result, observable and unobservable inputs have created the following fair value hierarchy:\n•Level 1 - Quoted prices in active markets that are unadjusted and accessible at the measurement date for identical, unrestricted assets or liabilities. At December 31, 2020 and 2019, the Level 1 category included money market funds and commercial paper, which are included within “cash and cash equivalents” in the consolidated balance sheets.\n•Level 2 - Quoted prices for identical assets and liabilities in markets that are not active, quoted prices for similar assets and liabilities in active markets or financial instruments for which significant inputs are observable, either directly or indirectly. The Company had no Level 2 securities at December 31, 2020 and 2019.\n•Level 3 - Prices or valuations that require inputs that are both significant to the fair value measurement and unobservable. At December 31, 2020 and 2019, the Level 3 category included derivatives, which are included in \"other long-term liabilities\" in the consolidated balance sheets with the change in fair value from the period included in \"interest and other loss, net\" in the consolidated statement of operations. The Company did not hold any cash, cash equivalents or marketable securities categorized as Level 3 as of December 31, 2020 or 2019.\nMeasurement of Fair Value\nThe Company measures fair value as an exit price using the procedures described below for all assets and liabilities measured at fair value. When available, the Company uses unadjusted quoted market prices to measure fair value and classifies such items within Level 1. If quoted market prices are not available, fair value is based upon financial models that use, when possible, current market-based or independently-sourced market parameters such as interest rates and currency rates. Items valued using financial generated models are classified according to the lowest level input or value driver that is significant to the valuation. Thus, an item may be classified in Level 3 even though there may be inputs that are readily observable. If quoted market prices are not available, the valuation model used generally depends on the specific asset or liability being valued. The determination of fair value considers various factors including interest rate yield curves and time value underlying the financial instruments.\nThe fair value of the Company’s investments in corporate debt and government securities have been determined utilizing third party pricing services and reviewed by management. The pricing services use inputs to determine fair value which are derived from observable market sources including reportable trades, benchmark curves, credit spreads, broker/dealer quotes, bids, offers, and other industry and economic events. These investments are included in Level 2 of the fair value hierarchy.\nThe fair value of the Company’s derivatives were valued using the Black-Scholes pricing model adjusted for probability assumptions, with all significant inputs, except for the probability and volatility assumptions, derived from or corroborated by observable market data such as stock price and interest rates. The probability and volatility assumptions are both significant to the fair value measurement and unobservable. These embedded derivatives are included in Level 3 of the fair value hierarchy.\nThe fair value of the Company’s short-term loan was based upon current rates offered for similar financial instruments to the Company.\nItems Measured at Fair Value on a Recurring Basis\nThe following table presents the Company’s liabilities that are measured at fair value on a recurring basis at December 31, 2020:\nFair Value Measurements at Reporting Date Using\nTotal Quoted Prices in Active Markets for Identical Assets\n(Level 1) Significant other\nInputs\n(Level 2) Significant\nUnobservable\nInputs\n(Level 3)\nDerivative liabilities:\nDerivative Instruments 472,851 - - 472,851\nTotal derivative liabilities 472,851 - - 472,851\nTotal assets and liabilities measured at fair value $ 472,851 $ - $ - $ 472,851\nThe derivative liabilities above are classified as other long-term liabilities in the December 31, 2020 consolidated balance sheet.\nThe following table presents the Company’s liabilities that are measured at fair value on a recurring basis at December 31, 2019:\nFair Value Measurements at Reporting Date Using\nTotal Quoted Prices in Active Markets for Identical Assets\n(Level 1) Significant other\nInputs\n(Level 2) Significant\nUnobservable\nInputs\n(Level 3)\nDerivative liabilities:\nDerivative Instruments 483,804 - - 483,804\nTotal derivative liabilities 483,804 - - 483,804\nTotal assets and liabilities measured at fair value $ 483,804 $ - $ - $ 483,804\nThe derivative liabilities above are classified as other long-term liabilities in the December 31, 2019 consolidated balance sheet.\nThe fair value of the Company’s derivatives were valued using the Black-Scholes pricing model adjusted for probability assumptions, with all significant inputs, except for the probability and volatility assumptions, derived from or corroborated by observable market data such as stock price and interest rates. The probability and volatility assumptions are both significant to the fair value measurement and unobservable. These embedded derivatives are included in Level 3 of the fair value hierarchy.\nThe following table presents the Company’s liabilities measured at fair value on a recurring basis using significant unobservable inputs (Level 3) as of each of the years ended December 31, 2020 and 2019:\nFair Value Measurements Using\nSignificant Unobservable Inputs\n(Level 3)\nDecember 31, 2020 December 31, 2019\nBeginning Balance $ 483,804 $ 498,086\nTotal (earnings) loss recognized in earnings (10,953) (14,282)\nEnding Balance $ 472,851 $ 483,804\nEarnings and losses resulting from changes in the fair value of the derivative instruments above are recorded as a component of interest and other expense.\n(4) Accrued Expenses\nAccrued expenses are comprised of the following:\nDecember 31, 2020 December 31, 2019\nAccrued compensation $ 100,102 $ 141,233\nAccrued consulting and professional fees 1,403,445 1,603,914\nOther accrued expenses - 48,784\nAccrued taxes 550,774 446,094\nAccrued restructuring costs 239,444 293,799\n$ 2,293,765 $ 2,533,824\n(5) Income Taxes\nInformation pertaining to the Company’s income (loss) before income taxes and the applicable provision for income taxes is as follows:\nDecember 31,\n2020 2019\nIncome (loss) before income taxes:\nDomestic income (loss) $ 923,144 $ (1,847,586)\nForeign income (loss) 201,046 587,957\nTotal income (loss) before income taxes: 1,124,190 (1,259,629)\nProvision (benefit) for income taxes:\nCurrent:\nFederal $ (116,504) $ (116,504)\nState and local 10,928 (40,860)\nForeign 82,437 237,244\n(23,139) 79,880\nDeferred:\nFederal $ 131,036 $ 121,898\nState and local (6,209) 12,700\nForeign (116,007) 277,847\n8,820 412,445\nTotal provision (benefit) for income taxes: $ (14,319) $ 492,325\nDuring 2020 and 2019, the Company recorded a tax provision (benefit) of $(14,319) and $492,325, respectively, related to federal, state and local and foreign income taxes. The tax provisions include a tax benefit related to our Minimum Tax Credit carryforwards which are now realizable on a more-likely-than-not basis as such amounts will be refundable under the Tax Cuts and Jobs Act, partially offset with the accrual of foreign withholding taxes as the Company is no longer permanently reinvesting its foreign earnings.\nThe Coronavirus Aid, Relief, and Economic Security (CARES) Act, was enacted March 27, 2020. Among the business provisions, the CARES Act provided for various payroll tax incentives, changes to net operating loss carryback and carryforward rules, business interest expense limitation increases, and bonus depreciation on qualified improvement property. Additionally, the Consolidated Appropriations Act of 2021 was signed on December 27, 2020 which provided additional COVID relief provisions for businesses. The Company has evaluated the impact of both the Acts and has determined that any impact is not material to its financial statements.\nDeferred income taxes reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and for income tax purposes. Significant components of the Company’s deferred tax assets and liabilities are as follows:\nDecember 31,\n2020 2019\nDeferred Tax Assets:\nAllowance for receivables $ 34,820 $ 52,439\nDeferred revenue 352,087 383,920\nShare-based compensation 23,647 25,127\nAccrued expenses and other liabilities 331,497 232,777\nDomestic net operating loss carryforwards 20,072,283 20,761,781\nForeign net operating loss carryforwards 187,114 187,328\nTax credit carryforwards 3,106,022 3,106,022\nAMT tax credit carryforwards - 116,504\nCapital loss carryforwards 34,254 32,109\nFixed assets 155,942 179,534\nInterest expense carryforwards - 94,674\nLease liability 134,522 494,030\nIntangibles 113,932 176,210\nSub-total 24,546,120 25,842,455\nValuation allowance (23,222,032) (23,613,642)\nTotal Deferred Tax Assets 1,324,088 2,228,813\nDeferred Tax Liabilities:\nPrepaid commissions and other (113,706) (134,618)\nTax method changes (429,836) (913,496)\nRight of use asset (105,116) (387,740)\nDeferred state income tax (408,089) (470,545)\nForeign withholding taxes (449,816) (496,093)\nTotal Deferred Tax Liabilities (1,506,563) (2,402,492)\nNet Deferred Tax Liabilities $ (182,475) $ (173,679)\nAs of each reporting date, the Company considers new evidence, both positive and negative, that could affect its view of the future realization of deferred tax assets. In assessing the Company’s ability to recover its deferred tax assets, the Company evaluated whether it is more likely than not that some portion or the entire deferred tax asset will be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income in those periods in which temporary differences become deductible and/or net operating losses can be utilized. The Company considered all positive and negative evidence when determining the amount of the net deferred tax assets that are more likely than not to be realized. This evidence includes, but is not limited to, historical earnings, scheduled reversal of taxable temporary differences, tax planning strategies and projected future taxable income. Based on these factors the Company determined that its U.S. deferred tax assets with the exception of its Minimum Tax Credit are not realizable on a more-likely-than-not basis and has recorded a full valuation allowance against such net deferred tax assets. The Company’s valuation allowance decreased by $0.4 million due to operations.\nAs of December 31, 2020, the Company had approximately $86.4 million, of federal net operating loss carryforwards, of which $81.8 million are set to expire beginning in 2030, if not utilized, and the remaining $4.6 million of which can be carryforward indefinitely. As of December 31, 2020, the Company had approximately $3.1 million of research and development tax credit carryforwards which expire at various dates beginning in 2023, if not utilized. Utilization of the net operating losses and credit carryforwards may be subject to a substantial annual limitation due to the \"change in ownership\" provisions of the Internal Revenue Code of 1986. The annual limitation may result in the expiration of net operating losses and credit carryforwards before utilization.\nThe effective tax rate before income taxes varies from the current statutory federal income tax rate as follows:\nDecember 31,\n2020 2019\nTax at Federal statutory rate $ 236,080 $ (264,522)\nIncrease (reduction) in income taxes resulting from:\nState and local taxes 242,992 (675,527)\nNon-deductible expenses 5,702 9,100\nGILTI - 208,632\nStock compensation - 6,236\nNet effect of foreign operations (96,210) (10,012)\nUncertain tax positions (1,706) (71,119)\nChange in valuation allowance (474,956) 1,188,639\nForeign withholding taxes 19,299 165,099\nOther 54,480 (64,201)\n$ (14,319) $ 492,325\nDue to the change in U.S. federal tax law, the Company does not intend to indefinitely reinvest any of its unremitted foreign earnings. As of December 31, 2020, the Company has provided for additional foreign withholding taxes totaling approximately $0.4 million on approximately $4.3 million of undistributed earnings of its subsidiaries operating outside of the United States for which withholding tax applies.\nA reconciliation of the beginning and ending amount of unrecognized tax benefits, excluding interest and penalties, is as follows:\n2020 2019\nBalance at January 1, $ 81,400 $ 134,246\nIncreases to tax positions taken in prior years - -\nExpiration of statutes of limitation (5,894) (42,207)\nTranslation - (10,639)\nBalance at December 31, $ 75,506 $ 81,400\nAt December 31, 2020, $110,846 including interest, if recognized, would reduce the Company’s annual effective tax rate. As of December 31, 2020, the Company had approximately $35,340 of accrued interest. The Company believes it is reasonably possible that $6,462 of its unrecognized tax benefits will reverse within the next 12 months due to expiring statute of limitations. The Company records any interest and penalties related to unrecognized tax benefits in income tax expense.\nThe Company files federal, state, and foreign income tax returns in jurisdictions with varying statutes of limitations. The 2017 through 2020 tax years generally remain subject to examination by federal and most state tax authorities. In addition to the U.S., the Company’s major taxing jurisdictions include China, Taiwan, Japan, France and Germany.\n(6) Accumulated Other Comprehensive Loss\nThe changes in Accumulated Other Comprehensive Loss, net of applicable tax, for December 31, 2020 are as follows:\nForeign\nCurrency\nTranslation Net\nMinimum\nPension\nLiability Total\nAccumulated other comprehensive income (loss) at December 31, 2019 $ (1,926,826) $ 33,566 $ (1,893,260)\nOther comprehensive income (loss)\nOther comprehensive income (loss) before reclassifications (68,854) (24,997) (93,851)\nAmounts reclassified from accumulated other comprehensive income - (850) (850)\nTotal other comprehensive income (loss) (68,854) (25,847) (94,701)\nAccumulated other comprehensive income (loss) at December 31, 2020 $ (1,995,680) $ 7,719 $ (1,987,961)\nThe changes in Accumulated Other Comprehensive Loss, net of applicable tax, for December 31, 2019 are as follows:\nForeign\nCurrency\nTranslation Net\nMinimum\nPension\nLiability Total\nAccumulated other comprehensive income (loss) at December 31, 2018 $ (1,921,905) $ 26,803 $ (1,895,102)\nOther comprehensive income (loss)\nOther comprehensive income (loss) before reclassifications (4,921) 7,008 2,087\nAmounts reclassified from accumulated other comprehensive income - (245) (245)\nTotal other comprehensive income (loss) (4,921) 6,763 1,842\nAccumulated other comprehensive income (loss) at December 31, 2019 $ (1,926,826) $ 33,566 $ (1,893,260)\nFor the year ended December 31, 2020 and 2019, the amounts reclassified to net income (loss) related to the Company’s defined benefit plan and maturities of marketable securities. These amounts are included within “Operating income (loss)\" within the consolidated statement of operations.\n(7) Notes Payable and Stock Warrants\nOn November 17, 2017, HCP-FVA, an entity affiliated with Martin Hale, a director of the Company, provided a commitment, whereby it agreed to finance up to $3 million to the Company on the terms, and subject to the conditions, set forth in the commitment (the \"Commitment\"). As part of the Commitment, on November 17, 2017, the Company entered into a Loan Agreement with Lender and certain other loan parties named therein, pursuant to which the Lender made a Short Term Loan to the Company in the principal amount of $500,000. Pursuant to the Short Term Loan, HCP-FVA received warrants to purchase 138,591 shares of the Company's common stock at a nominal exercise price (\"Backstop Warrants\").\nOn February 23, 2018, the Company closed on the Commitment from HCP-FVA to purchase up to $3 million of Units (the \"Financing\"). HCP-FVA subscribed for the full $3 million of Units (at the Company’s election) in the Commitment by payment of $2.5 million in cash and the conversion of the $500,000 Short-Term Loan into Units. In consideration for HCP-FVA’s subscription of 3 million of Units, HCP-FVA was issued Financing Warrants (as hereinafter defined) to purchase 3,669,900 shares of the Company’s common stock for a nominal exercise price.\nIn the Financing, the Company agreed to offer FalconStor stockholders as of November 17, 2017 who were accredited investors the opportunity to purchase up to a total of 40 million Units (inclusive of subscriptions by HCP-FVA). Each Unit had a purchase price of $0.371063 and consisted of the following (each, a “Unit”):\ni.$0.10 in senior secured debt (for a total of $4 million of senior secured debt assuming full subscription of the Financing), secured by all of the assets of the Company and guaranteed by each of the Company’s domestic subsidiaries, having an interest rate of prime plus 0.75% and a maturity date of June 30, 2021 (the “Term Loan”);\nii.warrants to purchase 0.12233 shares of the Company’s common stock for a nominal exercise price (for a total of 4.8932 million shares assuming full subscription of the Financing) (the “Financing Warrants”); and\niii.0.0225 shares of Series A Preferred Stock at a per Unit price of $0.271063 (subject to increase to take into account accretion of the Series A Preferred Stock after December 31, 2020), all such shares to be acquired directly from their current holder, HCP-FVA.\nThe closing of the Commitment effectively constituted HCP-FVA’s purchase of 30 million Units in the Financing. As a result, the maximum additional funds that the Company could receive in the Financing was $1,000,000 through the purchase of 10 million Units by other eligible stockholders. In exchange for serving as the backstop for the Financing, upon the closing of the Commitment, HCP-FVA received additional Backstop Warrants to purchase 415,774 shares of the Company’s common stock for a nominal exercise price, in addition to the 138,591 Backstop Warrants issued to HCP-FVA in connection with the making of the Short Term Loan.\nOn February 23, 2018, in connection with HCP-FVA’s subscription in the Financing, the Company entered into an Amended and Restated Term Loan Credit Agreement, dated as of the same date (the “Amended and Restated Loan Agreement”), with HCP-FVA and certain other loan parties named therein setting forth the terms of the Term Loan. The Amended and Restated Loan Agreement amended and restated the Loan Agreement.\nUnder the Amended and Restated Loan Agreement, in the event the Term Loan is prepaid for any reason, such prepayment will be subject to the payment of a premium in an amount equal to 5% of the principal amount prepaid. The Term Loan is required to be prepaid upon the occurrence of certain events, including but not limited to certain asset dispositions, the incurrence of additional indebtedness, the receipt of insurance proceeds, and a change of control, subject to certain exceptions.\nThe Amended and Restated Loan Agreement has customary representations, warranties and affirmative and negative covenants. The negative covenants include financial covenants by the Company to maintain minimum cash denominated in U.S. dollars plus accounts receivable outstanding for less than 90 days of $2 million. The Amended and Restated Loan Agreement also contains customary events of default, including but not limited to payment defaults, cross defaults with certain other indebtedness, breaches of covenants, bankruptcy events and a change of control. In the case of an event of default, as administrative agent under the Loan Agreement, HCP-FVA may (and upon the written request of lenders holding in excess of 50% of the Term Loan, which must include HCP-FVA, is required to accelerate payment of all obligations under the Loan Agreement, and seek other available remedies).\nOn April 23, 2018, HCP-FVA exercised most of its Backstop Warrants on a cash-less basis and was issued 533,706 shares of the Company's common stock. HCP-FVA exercised its remaining Backstop Warrants to purchase 15,436 shares of common stock on May 21, 2019.\nThe Commitment and the Financing were approved by the Company’s Board of Directors, based on a recommendation of a special committee of independent directors, with Mr. Hale recusing himself.\nOn October 9, 2018, FalconStor closed on the final tranche of its Financing of Units to certain eligible stockholders of the Company. As a result, the Company received an additional $1,000,000 of gross proceeds from new investors (the “New Investors”) which is in addition to the $3,000,000 of gross proceeds previously received from HCP-FVA through the subscription of 30,000,000 Units pursuant to the Commitment on February 23, 2018.\nIn addition to providing the Company with $1,000,000 of gross proceeds, the New Investors purchased $520,000 of the Term Loan held by HCP-FVA and 342,000 of the 900,000 shares of Series A Preferred Stock held by HCP-FVA. Financing Warrants to purchase 636,109 shares of Common Stock held by HCP-FVA were also cancelled. Accordingly, the New Investors held Financing Warrants to purchase 1,859,420 shares of Common Stock and HCP-FVA then held Financing Warrants to purchase 3,033,791 shares of Common Stock. The transfer of securities by HCP-FVA to New Investors was subject to certain transfer limitations to ensure the preservation of the Company’s net operating loss carry forward.\nIn December 2018, the Company received proceeds of approximately $489,321 from the exercise of Financing Warrants. In January of 2019, these proceeds were applied as a partial repayment of principle under the Term Loan.\nOn December 27, 2019, the Company entered into Amendment No. 1 to Amended and Restated Term Loan Credit Agreement, by and among the Company, certain of the Company’s affiliates in their capacities as guarantors, HCP-FVA as administrative agent for the lenders party thereto (the “Lenders”), ESW Capital, LLC (“ESW”), as co-agent, and the Lenders, to provide for, among other things, a new $2,500,000 term loan facility to the Company (the “2019 Term Loan”). The Amendment also provides for certain financial covenants. On December 27, 2019, the Company drew down $1,000,000 of the 2019 Term Loan and the Company has paid a fixed amount of interest on such advance equal to 15% of the principal amount advanced. On September 27, 2020, the Company paid the 2019 Term Loan in full.\nASC 470-20-25-2 requires that debt or stock with detachable warrants issued in a bundled transaction with debt and equity proceeds be accounted for separately, based on the relative fair values of each instrument. The proceeds allocated to the Backstop Warrants and Financing Warrants were valued at $4,143,000.\nDerivative treatment did not apply to the warrants issued in association with the restructuring based upon the warrants being penny warrants (pre-paid stock).\nThe initial transaction was recorded as follows:\nAt Inception February 23, 2018\nBasis Fair Value\nSeries A redeemable convertible preferred stock, net $ 10,312,113 $ 8,709,684\nNotes payable, net 2,728,778 2,457,249\nWarrant liability - 4,143,000\nTotal $ 13,040,891 $ 15,309,933\nDeemed dividend $ 2,269,042\nThe Series A Preferred Stock consists of the following:\nSeries A redeemable convertible preferred stock principal balance $ 9,000,000\nAccrued dividends 1,312,112\nDiscount (1,602,428)\nTotal Series A redeemable convertible preferred stock, net at inception on February 23, 2018 8,709,684\nAccrued dividends 683,742\nAccretion of preferred stock 363,280\nTotal Series A redeemable convertible preferred stock, net at December 31, 2018 9,756,706\nAccrued dividends 1,157,762\nAccretion of preferred stock 389,811\nTotal Series A redeemable convertible preferred stock, net at December 31, 2019 11,304,279\nAccrued dividends 1,083,892\nAccretion of preferred stock 552,551\nTotal Series A redeemable convertible preferred stock, net at December 31, 2020 $ 12,940,722\nThe notes payable balance consists of the following:\nNotes payable principal balance $ 3,000,000\nDeferred issuance costs (254,247)\nDiscount (288,504)\nTotal notes payable, net at inception on February 23, 2018 2,457,249\nProceeds from issuance of long-term debt 1,000,000\nRevaluation of long-term debt (447,008)\nAccretion of discount 202,195\nDeferred issuance costs (87,609)\nTotal notes payable, net at December 31, 2018 3,124,827\nRepayment of long-term debt (489,321)\nProceeds from issuance of short-term debt 1,000,000\nDiscount and accretion of discount 273,521\nDeferred issuance costs (55,393)\nTotal notes payable, net at December 31, 2019 $ 3,853,634\nAccretion of discount 467,229\nProceeds from issuance of the PPP loan 754,000\nRepayment of short-term debt (1,000,000)\nTotal notes payable, net at December 31, 2020 $ 4,074,863\nThe $4 million senior secured debt bears interest at prime plus 0.75% and matures on June 30, 2021. As of December 31, 2020, the Company was in compliance with the financial covenants contained in the Amended and Restated Term Loan Credit Agreement.\nLoan under the Paycheck Protection Program\nOn April 28, 2020, the Company entered into the Loan with Peapack-Gladstone Bank in an aggregate principal amount of $754,000, pursuant to the PPP under the CARES Act.\nThe Loan is evidenced by a promissory note (the “Note”) dated April 28, 2020. The Loan matures two years from the disbursement date and bears interest at a rate of 1.000% per annum, with the first six months of interest deferred. Principal and interest are payable monthly commencing six months after the disbursement date and may be prepaid by the Company at any time prior to maturity with no prepayment penalties.\nUnder the terms of the CARES Act, PPP loan recipients can apply for and be granted forgiveness for all or a portion of loans granted under the PPP. The Loan is subject to forgiveness to the extent proceeds are used for payroll costs, including\npayments required to continue group health care benefits, and certain rent, utility, and mortgage interest expenses (collectively, “Qualifying Expenses”), pursuant to the terms and limitations of the PPP. The Company has used a significant majority of the Loan amount for Qualifying Expenses. However, no assurance is provided that the Company will obtain forgiveness of the Loan in whole or in part.\nThe Loan is included in notes payable, net of debt issuance costs and discounts in the accompanying condensed consolidated balance sheet..\n(8) Series A Redeemable Convertible Preferred Stock\nThe Company has 900,000 shares of Series A Preferred Stock outstanding. Pursuant to the Amended and Restated Certificate of Designations, Preferences and Rights for the Series A Preferred Stock (the ”Certificate of Designations”), each share of Series A Preferred Stock can be converted into shares of the Company’s common stock, at an initial conversion price equal to $102.49 per share, subject to appropriate adjustments for any stock dividend, stock split, stock combination, reclassification or similar transaction, (i) at any time at the option of the holder or (ii) by the Company if, following the first anniversary of the issuance of the Series A Preferred Stock (subject to extension under certain circumstances), the volume weighted average trading price per share of the Company’s common stock for sixty (60) consecutive trading days exceeds 250% of the conversion price and continues to exceed 225% of the conversion price through the conversion date, subject at all times to the satisfaction of, and the limitations imposed by, the equity conditions set forth in the Certificate of Designations (including, without limitation, the volume limitations set forth therein).\nPursuant to the Certificate of Designations, the holders of the Series A Preferred Stock are entitled to receive quarterly dividends at the prime rate (provided in the Wall Street Journal Eastern Edition) plus 5% (up to a maximum dividend rate of 10%), payable in cash or in kind (i.e., through the issuance of additional shares of Series A Preferred Stock), except that the Company is not permitted to pay such dividends in cash while any indebtedness under the Company’s Amended and Restated Term Loan and Credit Agreement remains outstanding without the consent of the holders of the Series A Preferred Stock. In addition, the declaration and payment of dividends is subject to compliance with applicable law and unpaid dividends will accrue. A holder’s right to convert its shares of Series A Preferred Stock and receive dividends in the form of common stock is subject to certain limitations including, among other things, that the shares of common stock issuable upon conversion or as dividends will not, prior to receipt of stockholder approval, result in any holder beneficially owning greater than 9.99% of the Company’s currently outstanding shares of common stock.\nThe Series A Preferred Stock dividends shall accrue whether or not the declaration or payment of such Series A Preferred Stock dividends are prohibited by applicable law, whether or not the Company has earnings, whether or not there are funds legally available for the payment of such dividends and whether or not such dividends are authorized or declared.\nUpon certain triggering events, such as bankruptcy, insolvency or a material adverse effect or failure of the Company to issue shares of common stock upon conversion of the Series A Preferred Stock in accordance with its obligations, the holders may require the Company to redeem all or some of the Series A Preferred Stock at a price per share equal to the greater of (i) the sum of 100% of the stated value of a share of Series A Preferred Stock plus accrued and unpaid dividends with respect thereto, and (ii) the product of the number of shares of common stock underlying a share of Series A Preferred Stock and the closing price as of the occurrence of the triggering event. On or after July 30, 2021, each holder of Series A Preferred Stock can also require the Company to redeem its Series A Preferred Stock in cash at a per share price equal to 100% of the stated value of a share of Series A Preferred Stock plus accrued and unpaid dividends with respect thereto. Notwithstanding the forgoing, no holder of Series A Preferred Stock is permitted to exercise any rights or remedies upon a Breach Event or to exercise any redemption rights under the Certificate of Designations, unless approved by the holders of a majority of the then outstanding shares of Series A Preferred Stock.\nUpon consummation of a fundamental sale transaction, the Series A Preferred Stock shall be redeemed at a per share redemption price equal to the greater of (y) 250% of the per share purchase price of the Series A Preferred Stock and (z) the price payable in respect of such share of Series A Preferred Stock if such share of Series A Preferred Stock had been converted into such number of shares of common stock in accordance with the Certificate of Designations (but without giving effect to any limitations or restrictions contained therein) immediately prior to such fundamental sale transaction; provided however that the 250% threshold is changed to 100% if the fundamental sale transaction is approved by the two Series A Directors (as defined in the Certificate of Designations). In addition, if the Company consummates an equity or debt financing that results in more than $5.0 million of net proceeds to the Company and/or its subsidiaries, the holders of Series A Preferred Stock will have the right, but not the obligation, to require the Company to use the net proceeds in excess of $5.0 million to repurchase all or a portion of the Series A Preferred Stock at a per share price equal to the greater of (i) the sum of 100% of the stated value of such share of Series A Preferred Stock plus accrued and unpaid dividends with respect thereto, and (ii) the number of shares of\ncommon stock into which such share of Series A Preferred Stock is then convertible multiplied by the greater of (y) the closing price of the Common Stock on the date of announcement of such financing or (z) the closing price of the common stock on the date of consummation of such financing.\nEach holder of Series A Preferred Stock has a vote equal to the number of shares of common stock into which its Series A Preferred Stock would be convertible as of the record date. In addition, the holders of a majority of the Series A Preferred Stock must approve certain actions, including approving any amendments to the Company’s Restated Certificate of Incorporation as amended or Amended and Restated Bylaws that adversely affects the voting powers, preferences or other rights of the Series A Preferred Stock; payment of dividends or distributions; any liquidation, capitalization, reorganization or any other fundamental transaction of the Company; issuance of any equity security senior to or on parity with the Series A Preferred Stock as to dividend rights, redemption rights, liquidation preference and other rights; issuances of equity below the conversion price; any liens or borrowings other than non-convertible indebtedness from standard commercial lenders which does not exceed 80% of the Company’s accounts receivable; and the redemption or purchase of any of the capital stock of the Company.\nThe Company has classified the Series A Preferred Stock as temporary equity in the financial statements as it is subject to redemption at the option of the holder under certain circumstances. As a result of the Company’s analysis of all the embedded conversion and put features within the Series A Preferred Stock, the contingent redemption put options in the Series A Preferred Stock were determined to not be clearly and closely related to the debt-type host and also did not meet any other scope exceptions for derivative accounting. Therefore, the contingent redemption put options are being accounted for as derivative instruments and the fair value of these derivative instruments was bifurcated from the Series A Preferred Stock and recorded as a liability.\nAs of December 31, 2020 and December 31, 2019 the fair value of these derivative instruments was $472,851 and $483,804, respectively, and were included in \"other long-term liabilities\" within the consolidated balance sheets. The gain on the change in fair value of these derivative instruments for the twelve months ended December 31, 2020 and December 31, 2019 of $10,953 and $14,282, respectively, were included in “interest and other expense” within the consolidated statement of operations.\nThe fair value of these derivative instruments and the loss recorded on the change in the fair value of these derivative instruments, which was included in “interest and other expense” within the consolidated statement of operations, for the twelve months ended December 31, 2020 and 2019, were as follows:\nYears Ended December 31,\n2020 2019\nBeginning Balance $ 483,804 $ 498,086\nTotal (gain) loss recognized in earnings (10,953) (14,282)\nEnding Balance $ 472,851 $ 483,804\nThe Company’s derivatives were valued using the Black-Scholes pricing model adjusted for probability assumptions, with all significant inputs, except for the probability and volatility assumptions, derived from or corroborated by observable market data such as stock price and interest rates. The probability and volatility assumptions are as follows:\nProbability of redemption as part of a fundamental sale transaction 0.5%\nProbability of redemption absent a fundamental sale transaction 4.75%\nAnnual volatility 65%\nAt the time of issuance, the Company recorded transaction costs, a beneficial conversion feature and the fair value allocated to the embedded derivatives as discounts to the Series A Preferred Stock. These costs were being accreted to the Series A Preferred Stock using the effective interest method through the stated redemption date of August 5, 2017, which represents the earliest redemption date of the instrument. This accretion was accelerated as of December 31, 2016 due to the failure of the financial covenants and the redemption right of the holders at that time. In connection with the Commitment, Hale Capital Partners, LP, which was the sole holder of the Series A Preferred Stock, agreed to the Series A mandatory extension of the mandatory redemption right and waived prior breaches of the terms of the Series A Preferred Stock. The Company included deductions for accretion, deemed and accrued dividends on the Series A Preferred Stock as adjustments to net income (loss) attributable to common stockholders on the statement of operations and in determining income (loss) per share for the twelve months ended December 31, 2020 and 2019, respectively. The following represents a reconciliation of net loss attributable to common stockholders for the twelve months ended December 31, 2020 and 2019, respectively:\nYears Ended December 31,\n2020 2019\nNet income (loss) $ 1,138,509 $ (1,751,954)\nEffects of Series A redeemable convertible preferred stock:\nLess: Accrual of Series A redeemable convertible preferred stock dividends 1,083,892 1,157,762\nLess: Accretion to redemption value of Series A redeemable convertible preferred stock 552,551 389,811\nNet income (loss) attributable to common stockholders $ (497,934) $ (3,299,527)\n(9) Stockholders’ Equity\nStock Repurchase Activity\nDuring the year ended December 31, 2020 and December 31, 2019, the Company repurchased no shares of its common stock. As of December 31, 2020, the Company had the authorization to repurchase 49,078 shares of its common stock based upon its judgment and market conditions.\n(10) Share-Based Payment Arrangements\nOn June 22, 2018, the Company's stockholders adopted the FalconStor Software, Inc. 2018 Incentive Stock Plan (the \"2018 Plan\"). The 2018 Plan is administered by the Compensation Committee and provides for the issuance of up to 1,471,997 shares of the Company's common stock upon the grant of shares with such restrictions as determined by the Compensation Committee to the employees and directors of, and consultants providing services to, the Company or its affiliates. Exercise prices of the options will be determined by the Compensation Committee of the Company's Board of Directors, subject to the consent of Hale Capital Partners, LP. The vesting terms shall be performance based and determined by the Committee, subject to the consent of Hale Capital Partners, LP, based on various factors, including (i) the return of capital to the holders of the Series A Preferred Stock and the Company’s Common Stock in the event of a Change of Control, (ii) the repayment of the Company’s obligations under its senior secured debt, and (iii) the Company’s free cash flow.\nThe following table summarizes the 2018 Plan, which was the only plan under which the Company was able to grant equity compensation as of December 31, 2020:\nName of Plan Shares\nAuthorized Shares Available\nfor Grant Shares\nOutstanding\nFalconStor Software, Inc. 2018 Incentive Stock Plan 1,471,997 25,247 1,386,213\nThe following table summarizes the Company’s equity plans that have expired but that still have equity awards outstanding as of December 31, 2020:\nName of Plan Shares Available for Grant Shares Outstanding\nFalconStor Software, Inc., 2016 Incentive Stock Plan - 3,850\nFalconStor Software, Inc., 2006 Incentive Stock Plan - 5,930\nAll outstanding options granted under the Company’s equity plans have terms of ten years.\nA summary of the Company’s stock option activity for 2020 is as follows:\nNumber of\nOptions Weighted\nAverage\nPrice Weighted\nAverage\nRemaining\nContractual\nLife (Years) Aggregate\nIntrinsic\nValue\nOptions Outstanding at December 31, 2019 10,445 $ 127.53 4.96 $ -\nGranted - $ -\nExercised - $ -\nForfeited -\nExpired (665) $ 331.50\nOptions Outstanding at December 31, 2020 9,780 $ 113.66 4.25 $ -\nOptions Exercisable at December 31, 2020 9,780 $ 113.66 4.25 $ -\nOptions Expected to Vest after December 31, 2020 - $ - 0.00 $ -\nStock option exercises are fulfilled with new shares of common stock.\nThe following table summarizes the share-based compensation expense for all awards issued under the Company’s stock equity plans in the following line items in the consolidated statements of operations:\nYears ended December 31,\n2020 2019\nCost of revenue - Support and Service 496 2,250\nResearch and development costs 942 6,348\nSelling and marketing 785 4,030\nGeneral and administrative 13,532 19,652\n$ 15,755 $ 32,280\nThe Company did not recognize any tax benefits related to share-based compensation expense during the years ended December 31, 2020 and 2019.\nThe Company has the ability to issue both restricted stock and restricted stock units. The fair value of the restricted stock awards and restricted stock units are expensed at the fair value per share at date of grant for directors, officers and employees. A summary of the total stock-based compensation expense related to restricted stock units, which is included in the Company’s total share-based compensation expense for each respective year, is as follows:\nYears ended December 31,\n2020 2019\nDirectors, officers and employees $ 15,756 $ 23,031\nA summary of the Company’s restricted stock activity for 2020 is as follows:\nNumber of Restricted Stock Awards\nNon-Vested at December 31, 2019 1,147,002\nGranted 360,638\nVested (30,730)\nForfeited (90,697)\nNon-Vested at December 31, 2020 1,386,213\nRestricted stock units are fulfilled with new shares of common stock. The total intrinsic value of restricted stock for which the restrictions lapsed during the years ended was $15,365 and $485,519 for the years ended December 31, 2020 and 2019, respectively.\nAs of December 31, 2020, total unrecognized compensation costs for unvested restricted stock unit awards was $683,928, including $649,133 relating to performance-based awards. The performance condition for such awards was not deemed probable at grant dates or at December 31, 2020 and the cost related to such awards will begin to be recognized once the performance condition is deemed probable. The remaining amount of $34,795 is expected to be recognized over a weighted-average period of 2.4 years as of December 31, 2020.\nAs of December 31, 2020, the Company had 1,421,240 shares of common stock reserved for issuance upon the exercise or vesting of stock options and restricted stock.\n(11) Commitments and Contingencies\nThe Company’s headquarters are located in Austin, Texas. The Company has an operating lease covering its Melville, N.Y. office facility that expires in April 2021. The Company also has several additional operating leases related to offices in foreign countries. The expiration dates for these leases occur in 2021. The following is a schedule of future minimum lease payments for all operating leases as of December 31, 2020:\n2021 659,754\nThereafter -\n$ 659,754\nThese leases require the Company to pay its proportionate share of real estate taxes and other common charges.\nThe Company typically provides its customers a warranty on its software products for a period of no more than 90 days. Such warranties are accounted for in accordance with the authoritative guidance issued by the FASB on contingencies. For the year ended December 31, 2020, the Company has not incurred any costs related to warranty obligations.\nUnder the terms of substantially all of its software license agreements, the Company has agreed to indemnify its customers for all costs and damages arising from claims against such customers based on, among other things, allegations that the Company’s software infringes the intellectual property rights of a third party. In most cases, in the event of an infringement claim, the Company retains the right to (i) procure for the customer the right to continue using the software; (ii) replace or modify the software to eliminate the infringement while providing substantially equivalent functionality; or (iii) if neither (i) nor (ii) can be reasonably achieved, the Company may terminate the license agreement and refund to the customer a pro-rata portion of the license fee paid to the Company. Such indemnification provisions are accounted for in accordance with the authoritative guidance issued by the FASB on guarantees. From time to time, in the ordinary course of business, the Company receives claims for indemnification, typically from OEMs. The Company is not currently aware of any material claims for indemnification.\nAs described under Note 8, the holders of the Series A Preferred Stock have redemption rights upon certain triggering events. As of December 31, 2020, the Company did not fail any non-financial covenants related to the Company's Series A Preferred Stock.\nIn connection with the appointment of Todd Brooks as Chief Executive Officer, the Board approved an offer letter to Mr. Brooks (the “Brooks Agreement”), which was executed on August 14, 2017. The Brooks Agreement provides that Mr. Brooks is entitled to receive an annualized base salary of $350,000, payable in regular installments in accordance with the Company’s general payroll practices. Mr. Brooks will also be eligible for a cash bonus of $17,500 for any quarter that is free cash flow positive on an operating basis and additional incentive compensation of an annual bonus of up to $200,000, subject to attainment of performance objectives to be mutually agreed upon and established. Mr. Brooks’ employment can be terminated at will. Pursuant to the Brooks Agreement and the 2018 Plan, Mr. Brooks received 735,973 shares of restricted stock. If Mr. Brooks’ employment is terminated by the Company other than for cause he is entitled to receive severance equal to twelve (12) months of his base salary if (i) he has been employed by the Company for at least twelve (12) months at the time of termination or (ii) a change of control has occurred within six (6) months of Mr. Brooks’ employment. Except as set forth in the preceding sentence, Mr. Brooks is entitled to receive severance equal to six (6) months of his base salary if he has been employed by the Company for less than six (6) months and his employment was terminated by the Company without cause. Mr. Brooks is also entitled to vacation and other employee benefits in accordance with the Company’s policies as well as reimbursement for an apartment.\nIn connection with the appointment of Brad Wolfe as the Company's Chief Financial Officer, the Board approved an offer letter to Mr. Wolfe (the “Wolfe Offer Letter”), which was executed on April 4, 2018. The Wolfe Offer Letter provides that Mr. Wolfe is entitled to receive an annualized base salary of $240,000, payable in regular installments in accordance with the Company’s general payroll practices. Mr. Wolfe will also be eligible for a cash bonus of $10,000 for any quarter which has net working capital cash that exceeds the prior quarter and additional incentive compensation of an annual bonus of up to $70,000, subject to attainment of performance objectives to be mutually agreed upon and established.\nAs described under Note 14, the Company has incurred certain restructuring costs in connection with restructuring plans adopted in 2017 and 2019.\nIn addition, as of December 31, 2020, our liability for uncertain tax positions totaled $111,142. At this time, the settlement period for the positions, including related accrued interest, cannot be determined.\n(12) Derivative Financial Instruments\nThe Company does not use derivative financial instruments for trading or speculative purposes. As of December 31, 2020 and 2019, the Company had no foreign currency forward contracts outstanding. The Company did not utilize foreign currency forward contracts during the years ended December 31, 2020 and 2019.\nAs a result of the Company’s analysis of all the embedded conversion and put features within its Series A redeemable convertible preferred stock, the contingent redemption put options in the Series A redeemable convertible preferred stock were determined to not be clearly and closely related to the debt-type host and also did not meet any other scope exceptions for derivative accounting. Therefore the contingent redemption put options are being accounted for as derivative instruments and the fair value of these derivative instruments were bifurcated from the Series A redeemable convertible preferred stock and recorded as a liability. At the time of issuance of the Series A redeemable convertible preferred stock the fair value of these derivative instruments were recorded as a reduction to preferred stock. As of December 31, 2020 and 2019, the fair value of these derivative instruments was $472,851 and $483,804, respectively, and were included in \"other long-term liabilities\" within the consolidated balance sheets. The gain on the change in fair value of these derivative instruments for 2020 of $10,953 and the gain on the change in fair value of these derivative instruments for 2019 of $14,282, were included in “interest and other loss, net” within the consolidated statement of operations.\n(13) Litigation\nIn view of the inherent difficulty of predicting the outcome of litigation, particularly where the claimants seek very large or indeterminate damages, the Company generally cannot predict what the eventual outcome of the pending matters will be, what the timing of the ultimate resolution of these matters will be, or what the eventual loss, fines or penalties related to each pending matter may be.\nIn accordance with the authoritative guidance issued by the FASB on contingencies, the Company accrues anticipated costs of settlement, damages and losses for claims to the extent specific losses are probable and estimable. The Company records a receivable for insurance recoveries when such amounts are probable and collectable. In such cases, there may be an exposure to loss in excess of any amounts accrued. If, at the time of evaluation, the loss contingency related to a litigation is not both probable and estimable, the matter will continue to be monitored for further developments that would make such loss contingency both probable and estimable and, the Company will expense these costs as incurred. If the estimate of a probable loss is a range and no amount within the range is more likely, the Company will accrue the minimum amount of the range.\nOther Claims\nThe Company is subject to various legal proceedings and claims, asserted or unasserted, which arise in the ordinary course of business. While the outcome of any such matters cannot be predicted with certainty, such matters are not expected to have a material adverse effect on the Company’s financial condition or operating results.\nThe Company continues to assess certain litigation and claims to determine the amounts, if any, that the Company believes may be paid as a result of such claims and litigation and, therefore, additional losses may be accrued and paid in the future, which could materially adversely impact the Company’s financial results, its cash flows and its cash reserves.\n(14) Restructuring Costs\nIn June 2017, the Board approved a comprehensive plan to increase operating performance (the “2017 Plan”). The 2017 Plan was substantially completed by the end of the Company’s fiscal year ending December 31, 2017, and when combined with previous workforce reductions in the second quarter of Fiscal 2017 reduced the Company’s workforce to approximately 86 employees at December 31, 2018. In making these changes, the Company prioritized customer support and development while consolidating operations and streamlining direct sales resources allowing the Company to focus on the install base and develop alternate channels to the market. As part of this consolidation effort the Company vacated a portion of the Mellville, NY office space during the three months ended June 30, 2018. In accordance with accounting standards governing costs associated with exit or disposal activities, expenses related to future rental payments for which the Company no longer intends to receive any economic benefit are accrued, net of any anticipated sublease income, when the Company ceases use of the leased space. During the fiscal year ended December 31, 2020, the Company incurred lease disposal-related costs for this property of $956,118. As of December 31, 2020, $75,466 of the Company's remaining accrued lease disposal cost has been recorded as a component of operating lease liabilities. The Company expects the remaining accrued severance-related costs of $239,444 as of December 31, 2020 to be paid once final settlement litigation is completed, which is expected to occur by December 31, 2021.\nIn the third quarter of 2019, the Company adopted the 2019 Plan to better align the Company’s cost structure with the skills and resources required to more effectively execute the Company’s long-term growth strategy and to support revenue levels the Company expected to achieve on a go forward basis. In connection with the 2019 Plan, the Company eliminated 23 positions worldwide, implemented tighter expense controls, ceased non-core activities and downsized several facilities. During the three months ended March 31, 2020, the Company incurred $0.1 million in severance expense as a result of this action. The 2019 Plan was substantially completed at March 31, 2020.\nGiven the commercial uncertainty caused by the novel coronavirus pandemic, or COVID-19, the Company developed and implemented an even more aggressive expense control plan in March 2020, that it is prepared to keep in place for the remainder of 2020 (the \"2020 Plan\"). The 2020 Plan reduced the Company's annual cash expense run rate by $4.0 million or 29%. The Company has furloughed 21 positions worldwide, and 20 of these positions were reinstated by the fourth quarter of 2020. During the nine months ended September 30, 2020, the Company has not yet incurred severance expense as a result of this action.\nThe following table summarizes the activity during 2019 and 2020 related to restructuring liabilities recorded in connection with the 2017, 2019 and 2020 Plans:\nSeverance related costs Facility and other costs Total\nBalance at December 31, 2018 $ 461,361 $ 453,447 $ 914,808\nProvisions/Additions 245,910 858,408 1,104,318\nUtilized/Paid (413,472) (1,074,362) (1,487,834)\nBalance at December 31, 2019 $ 293,799 $ 237,493 $ 531,292\nProvisions/Additions $ 76,708 $ 956,118 $ 1,032,826\nTranslation Adjustment 25,353 - 25,353\nUtilized/Paid $ (156,416) $ (1,118,145) $ (1,274,561)\nBalance at December 31, 2020 $ 239,444 $ 75,466 $ 314,910\nIn the accompanying consolidated balance sheets, the Company's remaining accrued severance and other charges are included within “accrued expenses” and \"accounts payable\". The Company's remaining accrued facility cost has been recorded as a component of \"operating lease liabilities\". Expenses incurred under the 2017, 2019 and 2020 Plans during the years ended December 31, 2020 and 2019 are included within “restructuring costs” in the accompanying consolidated statements of operations.\n(15) Employee Benefit Plans\nDefined Contribution Plan\nEffective July 2002, the Company established a voluntary savings and defined contribution plan (the “Plan”) under Section 401(k) of the Internal Revenue Code. This Plan covers all U.S. employees meeting certain eligibility requirements and allows participants to contribute a portion of their annual compensation. Employees are 100% vested in their own contributions. For the years ended December 31, 2020 and 2019, the Company did not make any contributions to the Plan.\nEffective July 1, 2007, the Company, in accordance with the labor pension system in Taiwan, contributes 6% of salaries to individual pension accounts managed by the Bureau of Labor Insurance. The plan covers all Taiwan employees that elect the new pension system and all employees hired after July 1, 2005. For the years ended December 31, 2020 and 2019, the Company contributed approximately $2,000 and $4,000, respectively.\nDefined Benefit Plan\nThe Company has a defined benefit plan covering employees in Taiwan. The Company accounts for its defined benefit plan in accordance with the authoritative guidance issued by the FASB on retirement benefits, which requires the Company to recognize the funded status of its defined benefit plan in the accompanying consolidated balance sheet, with the corresponding adjustment to accumulated other comprehensive income, net of tax.\nAt December 31, 2020 and 2019, $7,719 and $33,566, respectively, is included in accumulated other comprehensive (loss) income for amounts that have not yet been recognized in net periodic pension cost. These amounts include the following: unrecognized transition obligation of $0 and $0 at December 31, 2020 and 2019, respectively, and unrecognized actuarial gains of $9,872 and $33,566 at December 31, 2020 and 2019, respectively. During 2020, the total amount recorded in other comprehensive (loss) income related to the pension plan was $(25,847) (net of tax), which consisted of an actuarial loss of $25,847 and the recognition of $0 of transition obligations recognized during 2020 as a component of net periodic pension cost. The transition obligation and actuarial gain included in accumulated other comprehensive (loss) income and expected to be recognized in net periodic pension cost for the year ended December 31, 2021, is $0 and $18 respectively.\nPension information for the years ended December 31, 2020 and 2019, is as follows:\n2020 2019\nAccumulated benefit obligation $ 65,188 $ 170,879\nChanges in projected benefit obligation:\nProjected benefit obligation at beginning of year 180,151 174,261\nInterest cost 1,207 1,469\nActuarial gain 28,834 389\nBenefits paid (121,838) -\nService cost - -\nCurrency translation 7,157 4,032\nProjected benefit obligation at end of year $ 95,511 $ 180,151\nChanges in plan assets:\nFair value of plan assets at beginning of year $ 149,903 $ 134,351\nActual return on plan assets 6,226 8,069\nBenefits paid (121,838) -\nEmployer contributions 2,012 4,041\nCurrency translation 4,173 3,442\nFair value of plan assets at end of year $ 40,476 $ 149,903\nFunded status (55,035) (30,248)\nThe underfunded status of the Company's defined benefit plan has been recorded as a component of other long-term liabilities as of December 31, 2020 and 2019.\nComponents of net periodic pension cost:\nInterest cost $ 1,207 $ 1,469\nExpected return on plan assets (1,005) (1,133)\nAmortization of net (gain) loss (1,052) (581)\nService cost - -\nNet periodic pension (benefit) cost $ (850) $ (245)\nThe Company makes contributions to the plan so that minimum contribution requirements, as determined by government regulations, are met. Company contributions of approximately $2,000 are expected to be made during 2021. Benefit payments of $78,000 are expected to be paid through 2030.\nThe Company utilized the following assumptions in computing the benefit obligation at December 31, 2020 and 2019 as follows:\nYears ended December 31,\n2020 2019\nDiscount rate 0.43 % 0.66 %\nRate of increase in compensation levels 2.50 % 1.00 %\nExpected long-term rate of return on plan assets 0.43 % 0.66 %\n(16) Segment Reporting and Concentrations\nThe Company is organized in a single operating segment for purposes of making operating decisions and assessing performance. Revenues from the United States to customers in the following geographical areas for the years ended December 31, 2020 and 2019, and the location of long-lived assets as of December 31, 2020 and 2019, are summarized as follows:\nYears ended December 31,\n2020 2019\nRevenues:\nAmericas $ 5,387,128 $ 4,299,840\nAsia Pacific 3,655,011 6,212,275\nEurope, Middle East, Africa and Other 5,726,554 6,031,456\nTotal Revenues $ 14,768,693 $ 16,543,571\nDecember 31,\n2020 2019\nLong-lived assets:\nAmericas $ 1,735,986 $ 2,603,521\nAsia Pacific 502,344 860,023\nEurope, Middle East, Africa and Other 52,690 190,928\nTotal long-lived assets $ 2,291,020 $ 3,654,472\nFor the year ended December 31, 2020, the Company had two customers that accounted for more than 10% of total revenue. For the year ended 2019, the Company had two customers that accounted for more than 10% of total revenue.\nAs of December 31, 2020 and 2019, the Company had one customer that accounted for more than 10% of the gross accounts receivable balance, respectively.\n(17) Valuation and Qualifying Accounts - Allowance for Returns and Doubtful Accounts\nPeriod Ended Balance at Beginning of Period Charges / (Benefits) to Revenue (Increases) Deductions Balance at End of Period\nDecember 31, 2020 $ 216,153 4,464 69,282 $ 151,335\nDecember 31, 2019 $ 162,112 148,624 94,583 $ 216,153\nNote: Charges/benefits to the allowance for doubtful accounts are recorded within “general and administrative expenses” within the consolidated statements of operations. Charges/benefits to the return reserve for product and service are recorded within “product revenue” within the consolidated statements of operations.\n(18) Related Party Transactions\nMartin M. Hale, Jr., a member of the Company's Board of Directors, is a general partner of HCP-FVA, the holder in excess of 50% of the Company’s Series A Preferred Stock. The Series A Preferred Stock was purchased by Hale Capital Partners, LP, of which Mr. Hale is a general partner, pursuant to a September 16, 2013 stock purchase agreement with the Company at a time when Mr. Hale was not a director of the Company. Hale Capital Partners, LP subsequently assigned all of its rights in the Series A Preferred Stock to HCP-FVA. Under the terms of the Certificate of Designations, the holders of the Series A Preferred Stock are entitled, as a group, to nominate and to elect up to two directors so long as at least 85% of the Company's Series A Preferred Stock is outstanding. HCP-FVA, the sole holder of the Series A Preferred Stock at the time, nominated and elected Mr. Hale in September 2013 and Michael P. Kelly on October 29, 2014, to the Company’s Board of Directors.\nOn November 17, 2017, HCP-FVA provided the Commitment to the Company agreeing to finance up to $3 million to the Company on the terms, and subject to the conditions, set forth in the Commitment. As part of that Commitment, on November\n17, 2017, the Company entered into a Loan and Security Agreement with HCP-FVA and certain other loan parties named therein, pursuant to which the Lender made a short term loan to the Company in the principal amount of $500,000 payable on May 17, 2018. In connection with the short term loan, the Company issued HCP-FVA Backstop Warrants to purchase 138,591 shares of Common Stock. See Note (7) Notes Payable and Stock Warrants for more information.\nOn February 23, 2018, we closed on the Commitment whereby HCP-FVA purchased $3 million of Units (as defined in Note (7) Notes Payable and Stock Warrants) to backstop a proposed private placement of Units to certain eligible stockholders of the Company. HCP-FVA subscribed for the full $3 million of Units (at the Company’s election) in the Commitment by payment of $2.5 million in cash and the conversion of the $500,000 short term loan In connection therewith, the Company issued HCP-FVA additional BackStop Warrants to purchase 415,774 shares of common stock and Financing Warrants to purchase 3,669,900 shares of common stock.\nOn October 9, 2018, FalconStor closed on the final tranche of its previously-announced Financing of Units to certain eligible stockholders of the Company. As a result, the Company received an additional $1,000,000 of gross proceeds from new investors (the “New Investors”) which is in addition to the $3,000,000 of gross proceeds previously received from HCP-FVA through the subscription of 30,000,000 Units pursuant to the Commitment on February 23, 2018.\nIn addition to providing the Company with $1,000,000 of gross proceeds, the New Investors purchased $520,000 of the Term Loan held by HCP-FVA and 342,000 of the 900,000 shares of Series A Preferred Stock held by HCP-FVA. Financing Warrants to purchase 636,109 shares of Common Stock held by HCP-FVA were also cancelled. Accordingly, the New Investors hold Financing Warrants to purchase 1,859,420 shares of Common Stock and HCP-FVA now holds Financing Warrants to purchase 3,033,791 shares of Common Stock. The transfer of securities by HCP-FVA to New Investors was subject to certain transfer limitations to ensure the preservation of the Company’s net operating loss carry forward.\nOn December 27, 2019, the Company entered into Amendment No. 1 to Amended and Restated Term Loan Credit Agreement , by and among the Company, certain of the Company’s affiliates in their capacities as guarantors, HCP-FVA as administrative agent for the Lenders party thereto, ESW, as co-agent, and the Lenders, to provide for, among other things, a new $2,500,000 term loan facility to the Company. The Amendment also provides for certain financial covenants. On December 27, 2019, the Company drew down $1,000,000 of the 2019 Term Loan which required a fixed amount of interest on such advance equal to 15% of the principal amount advanced. On September 27, 2020, the Company paid the 2019 Term Loan in full.\n(19) Subsequent Events\nThe Company evaluated subsequent events through the date on which these financial statements were issued, to ensure appropriate recognition and/or disclosure of events that occurred subsequent to December 31, 2020. There were no events that required recognition, adjustment to or disclosure in the financial statements.",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A. Controls and Procedures\nDisclosure Controls and Procedures\nThe Company maintains “disclosure controls and procedures,” as such term is defined in Rules 13a-15e and 15d-15e of the Exchange Act, that are designed to ensure that information required to be disclosed in its reports, pursuant to the Exchange Act, is recorded, processed, summarized and reported within the time periods specified in the SEC’s rules and forms, and that such information is accumulated and communicated to its management, including its Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding the required disclosures. In designing and evaluating the disclosure controls and procedures, management has recognized that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurances of achieving the desired control objectives, and management necessarily is required to apply its judgment in evaluating the cost benefit relationship of possible controls and procedures.\nThe Company’s Chief Executive Officer (its principal executive officer) and Chief Financial Officer (its principal financial officer and principal accounting officer) have evaluated the effectiveness of its “disclosure controls and procedures” as of the end of the period covered by this Annual Report on Form 10-K. Based on their evaluation, the principal executive officer and principal financial officer concluded that its disclosure controls and procedures are effective as of the end of the period covered by this report.\nInternal Control Over Financial Reporting\nManagement’s Report on Internal Control Over Financial Reporting\nThe Company’s management is responsible for establishing and maintaining adequate internal control over financial reporting for the Company; as such term is defined in Rules 13a-15(f) under the Exchange Act, as amended. To evaluate the effectiveness of the Company’s internal control over financial reporting, the Company’s management uses the Integrated Framework (2013) adopted by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”).\nThe Company’s management has assessed the effectiveness of the Company’s internal control over financial reporting as of December 31, 2020, using the COSO framework (2013). The Company’s management has determined that the Company’s internal control over financial reporting is effective as of that date.\nThe Principal Executive Officer and the Principal Financial Officer believe that the consolidated financial statements and other information contained in this Annual Report present fairly, in all material respects, our business, financial condition and results of operations.\nMaterial Weakness in Internal Control over Financial Reporting\nDuring the three months ended September 30, 2020, the Company did not fully document all the COSO framework (2013) mandated system controls in place nor did the Company have an independent party complete testing of the controls as of September 30, 2020.\nRemediation of Material Weakness\nThe Company has implemented certain mitigating controls such as secondary reviews by senior management, variance analysis reporting and cash-flow monitoring, which insured that both internal and external financial reporting included all the information and disclosures required by generally accepted accounting principles in the United States of America. The remediation was the implementation of a monitoring control whereby there’s an oversight by the CFO of all control activities, entity level controls, IT general controls, etc. that now allows the company to perform a self-assessment of the effective of internal controls.\nChanges in Internal Control over Financial Reporting\nOther than with respect to the remediation efforts discussed above, there was no change in our internal control over financial reporting that occurred during the period covered by this Annual Report on Form 10-K that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. Although we have altered some work routines due to the COVID-19 pandemic, the changes in our work environment, including remote work arrangements, have not\nmaterially impacted our internal controls over financial reporting and have not adversely affected the Company’s ability to maintain operations.",
    "item_9B": "Item 9B. Other Information\nNone.\nPART III",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nInformation called for by Part III, Item 10, regarding the Registrant’s directors and executive officers will be included in our Proxy Statement relating to our annual meeting of stockholders scheduled to be held in June 2021, and is incorporated herein by reference. The information will appear in the Proxy Statement under the captions “Election of Directors”, “Management”, “Executive Compensation”, “Section 16 (a) Beneficial Ownership Reporting Compliance”, and “Committees of the Board of Directors.” The Proxy Statement will be filed within 120 days of December 31, 2020, our year-end.",
    "item_11": "Item 11. Executive Compensation\nInformation called for by Part III, Item 11, will be included in our Proxy Statement relating to our annual meeting of stockholders scheduled to be held in June 2021, and is incorporated herein by reference. The information will appear in the Proxy Statement under the captions “Executive Compensation”, “Director Compensation”, “Compensation Committee Interlocks and Insider Participation”, \"Compensation Committee Report” and “Committees of the Board of Directors.” The Proxy Statement will be filed within 120 days of December 31, 2020, our year-end.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nInformation regarding Securities Authorized for Issuance Under Equity Compensation Plans is included in Item 4 and is incorporated herein by reference. All other information called for by Part III, Item 12, will be included in our Proxy Statement relating to our annual meeting of stockholders scheduled to be held in June 2021, and is incorporated herein by reference. The information will appear in the Proxy Statement under the caption “Beneficial Ownership of Shares.” The Proxy Statement will be filed within 120 days of December 31, 2020, our year-end.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nInformation regarding our relationships and related transactions will be included in our Proxy Statement relating to our annual meeting of stockholders scheduled to be held in June 2021, and is incorporated by reference. The information will appear in the Proxy Statement under the caption “Certain Relationships and Related Transactions.” The Proxy Statement will be filed within 120 days of December 31, 2020, our year-end.",
    "item_14": "Item 14. Principal Accountant Fees and Services\nInformation called for by Part III, Item 14, will be included in our Proxy Statement relating to our annual meeting of stockholders scheduled to be held in June 2021, and is incorporated herein by reference. The information will appear in the Proxy Statement under the caption “Principal Accountant Fees and Services.” The Proxy Statement will be filed within 120 days of December 31, 2020, our year-end.\nPART IV",
    "item_15": "Item 15. Exhibits and Financial Statement Schedules\nThe information required by subsections (a)(1) and (a)(2) of this item are included in the response to Item 8 of Part II of this annual report on Form 10-K.\n(b) Exhibits\n3.1 Restated Certificate of Incorporation, incorporated herein by reference to Exhibit 3.1 to the Registrant’s registration statement on Form S-1 (File no. 33-79350), filed on April 28, 1994.\n3.2 Amended and Restated By-Laws of FalconStor Software, Inc., incorporated herein by reference to Exhibit 3.2 to the Registrant’s annual report on Form 10-K for the year ended December 31, 2010, filed on March 14, 2011.\n3.3 Certificate of Amendment to the Restated Certificate of Incorporation, incorporated herein by reference to Exhibit 3.3 to the Registrant’s the quarterly report on Form 10-Q for the period ended June 30, 2000 filed on August 11, 2000.\n3.4 Certificate of Amendment to the Restated Certificate of Incorporation, incorporated herein by reference to Exhibit 3.4 to the Registrant’s annual report on Form 10-K for the year ended December 31, 2001, filed on March 27, 2002.\n3.5 Certificate of Designations, Preferences and Rights of Series A Convertible Preferred Stock, incorporated herein by reference to Exhibit 4.1 to the Registrant's report on Form 8-K dated September 16, 2013.\n3.6 Certificate of Amendment of the Restated Certificate of Incorporation of FalconStor Software, Inc,, incorporated by reference to Exhibit 3.1 to the Registrant’s report on Form 8-K dated June 25, 2018.\n3.7 Amended and Restated Certificate of Designations, Preferences and Rights of Series A Convertible Preferred Stock of FalconStor Software, Inc., incorporated by reference to Exhibit 3.2 to the Registrant’s report on Form 8-K dated June 25, 2018.\n3.8 Certificate of Amendment to the Restated Certificate of Incorporation incorporated herein by reference to Exhibit 3.1 to the Registrant's current report on Form 8-K filed on June 25, 2019.\n3.9 Certificate of Amendment to Exhibit 3.1 to the Registrant's quarterly report on Form 10-Q for the period ended June 30, 2019 filed on August 14, 2019.\n4.1s\nAmended and Restated 2006 Incentive Stock Plan incorporated herein by reference to Exhibit 4.1 to the Registrant’s quarterly report on Form 10-Q for the quarter ended March 31, 2007, filed on May 10, 2007.\n4.3s\nForm of Restricted Stock Letter Agreement, incorporated herein by reference to Exhibit 4.1 to the Registrant’s current report on Form 8-K filed on April 7, 2014.\n4.4s\nIntentionally omitted.\n4.5s\nFalconStor Software, Inc. 2016 Incentive Stock Plan, incorporated by reference to Exhibit A to the Proxy Statement on Schedule 14A dated March 18, 2016.\n4.6* Description of Registered Securities of FalconStor Software, Inc. , incorporated by reference to Exhibit 4.6 of the Registrant's Annual Report on Form 10-K for the fiscal year ended December 31, 2019.\n10.1 Intentionally omitted.\n10.2 Agreement of Lease between Huntington Quadrangle 2 LLC and FalconStor Software, Inc. dated May 30, 2013, with a commencement date of March 1, 2014, incorporated herein by reference to Exhibit 99.1 to the Registrant's quarterly report on Form 10-Q for the period ended June 30, 2013 filed on August 7, 2013.\n10.3 Preferred Stock Purchase Agreement dated as of September 16, 2013 between FalconStor Software, Inc. and Hale Capital Partners, LP, incorporated herein by reference to Exhibit 10.1 to the Registrant's report on Form 8-K dated September 16, 2013.\n10.4 Intentionally omitted.\n10.5s\nAgreement between FalconStor Software, Inc. and Todd Brooks, dated August 14, 2017, incorporated by reference to Exhibit 10.2 to the Registrant’s current report on Form 8-K filed August 17,2017.\n10.6 Intentionally omitted.\n10.7s\nIntentionally omitted.\n10.8 Intentionally omitted.\n10.9 Intentionally omitted.\n10.10 Intentionally omitted.\n10.11 Amended and Restated Term Loan Credit Agreement, dated as of February 23, 2018, by and among FalconStor Software, Inc., HCP-FVA, LLC, as Administrative Agent and as a Lender, and the other Loan Parties named therein, incorporated herein by reference to Exhibit 10.1 to Registrant’s current report on Form 8-K filed on February 26, 2018.\n10.12 Intentionally omitted.\n10.13 Intentionally omitted.\n10.14 Agreement between FalconStor Software, Inc. and Brad Wolfe, dated April 4, 2018, incorporated by reference to Exhibit 10.2 to the Registrant’s current report on Form 8-K filed April 11, 2018.\n10.15 Falconstor Software Inc. 2018 Stock Incentive Plan, incorporated by reference to the Definitive Proxy Statement on Schedule 14A filed on June 5, 2018.\n10.16 Joinder to Amended and Restated Term Loan Credit Agreement, dated as of February 23, 2018, by and among FalconStor Software, Inc., HCP-FVA, LLC, as Administrative Agent and as a Lender, and the other Loan Parties named therein, incorporated by reference to Exhibit 10.2 to the Registrant’s current report on Form 8-K filed October 11, 2018.\n10.17 Amendment No. 1 to Amended and Restated Term Loan Credit Agreement dated December 27, 2019 by and among FalconStor Software, Inc., HCP-FVA, LLC, EW Capital, LLC, the lenders party thereto and the other loan parties named therein, incorporated by reference to Exhibit 10.1 to the Registrant's current report on Form 8-K, filed on January 3, 2020.\n10.18 Promissory Note between the Company and Peapack-Gladstone Bank, dated April 28, 2020, incorporated by reference to Exhibit 10.1 of the Company's Quarerly Report on Form 10-Q for the three months ended March 1, 2020.\n21.1 Subsidiaries of Registrant - FalconStor, Inc., FalconStor AC, Inc., FalconStor Software (Korea), Inc.\n23.1* Consent of Marcum LLP.\n31.1* Certification of the Chief Executive Officer.\n31.2* Certification of the Chief Financial Officer.\n32.1* Certification of Chief Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (18 U.S.C. § 1350).\n32.2* Certification of Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (18 U.S.C. § 1350).\n101.1 The following financial statements from FalconStor Software, Inc’s Annual Report on Form 10-K for the year ended December 31, 2020, formatted in XBLR (eXtensible Business Reporting Language):\n(i) Consolidated Balance Sheets - December 31, 2020 and December 31, 2019\n(ii) Consolidated Statements of Operations - Years Ended December 31, 2020 and 2019\n(iii) Consolidated Statements of Comprehensive Income (Loss) - Years Ended December 31, 2020 and 2019\n(iv) Consolidated Statements of Stockholders’ Deficit - Years Ended December 31, 2020 and 2019\n(v) Consolidated Statements of Cash Flows - Years Ended December 31, 2020 and 2019\n(vi) Notes to Consolidated Financial Statements - December 31, 2020\n*- Filed herewith.\ns- Denotes management contract or compensatory plan or arrangement.\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized in Melville, State of New York on March 10, 2021.\nFALCONSTOR SOFTWARE, INC.\nBy: /s/ Brad Wolfe March 10, 2021\nExecutive Vice President, Chief Financial Officer and Treasurer Date\n(principal financial and accounting officer)\nPOWER OF ATTORNEY\nFalconStor Software, Inc. and each of the undersigned do hereby appoint Todd Brooks and Brad Wolfe, and each of them severally, its or his true and lawful attorney to execute on behalf of FalconStor Software, Inc. and the undersigned any and all amendments to this Annual Report on Form 10-K and to file the same with all exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission; each of such attorneys shall have the power to act hereunder with or without the other.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the date indicated.\nBy: /s/ Todd Brooks March 10, 2021\nTodd Brooks, President & Chief Executive Officer and Director (principal executive officer) Date\nBy: /s/ Brad Wolfe March 10, 2021\nBrad Wolfe, Executive Vice President, Chief Financial Officer and Treasurer (principal financial and accounting officer) Date\nBy: /s/ Martin Hale Jr. March 10, 2021\nMartin Hale Jr., Director Date\nBy: /s/ Michael Kelly March 10, 2021\nMichael Kelly, Director Date\nBy: /s/ Barry A. Rudolph March 10, 2021\nBarry A. Rudolph, Director Date\nBy: /s/ William D. Miller March 10, 2021\nWilliam D. Miller, Director Date"
}